; ModuleID = './line107-ctcp.o.i'
source_filename = "./line107-ctcp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct.CTCP_CMD_REC = type { i8*, i32 }
%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !66, globals: !704)
!1 = !DIFile(filename: "line107-ctcp.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 10, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "../../../src/core/levels.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!38 = !DIEnumerator(name: "MSGLEVEL_CRAP", value: 1)
!39 = !DIEnumerator(name: "MSGLEVEL_MSGS", value: 2)
!40 = !DIEnumerator(name: "MSGLEVEL_PUBLIC", value: 4)
!41 = !DIEnumerator(name: "MSGLEVEL_NOTICES", value: 8)
!42 = !DIEnumerator(name: "MSGLEVEL_SNOTES", value: 16)
!43 = !DIEnumerator(name: "MSGLEVEL_CTCPS", value: 32)
!44 = !DIEnumerator(name: "MSGLEVEL_ACTIONS", value: 64)
!45 = !DIEnumerator(name: "MSGLEVEL_JOINS", value: 128)
!46 = !DIEnumerator(name: "MSGLEVEL_PARTS", value: 256)
!47 = !DIEnumerator(name: "MSGLEVEL_QUITS", value: 512)
!48 = !DIEnumerator(name: "MSGLEVEL_KICKS", value: 1024)
!49 = !DIEnumerator(name: "MSGLEVEL_MODES", value: 2048)
!50 = !DIEnumerator(name: "MSGLEVEL_TOPICS", value: 4096)
!51 = !DIEnumerator(name: "MSGLEVEL_WALLOPS", value: 8192)
!52 = !DIEnumerator(name: "MSGLEVEL_INVITES", value: 16384)
!53 = !DIEnumerator(name: "MSGLEVEL_NICKS", value: 32768)
!54 = !DIEnumerator(name: "MSGLEVEL_DCC", value: 65536)
!55 = !DIEnumerator(name: "MSGLEVEL_DCCMSGS", value: 131072)
!56 = !DIEnumerator(name: "MSGLEVEL_CLIENTNOTICE", value: 262144)
!57 = !DIEnumerator(name: "MSGLEVEL_CLIENTCRAP", value: 524288)
!58 = !DIEnumerator(name: "MSGLEVEL_CLIENTERROR", value: 1048576)
!59 = !DIEnumerator(name: "MSGLEVEL_HILIGHT", value: 2097152)
!60 = !DIEnumerator(name: "MSGLEVEL_ALL", value: 4194303)
!61 = !DIEnumerator(name: "MSGLEVEL_NOHILIGHT", value: 16777216)
!62 = !DIEnumerator(name: "MSGLEVEL_NO_ACT", value: 33554432)
!63 = !DIEnumerator(name: "MSGLEVEL_NEVER", value: 67108864)
!64 = !DIEnumerator(name: "MSGLEVEL_LASTLOG", value: 134217728)
!65 = !DIEnumerator(name: "MSGLEVEL_HIDDEN", value: 268435456)
!66 = !{!67, !68, !78, !81, !77, !83, !84, !86, !93, !94, !397}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "CTCP_CMD_REC", file: !70, line: 36, baseType: !71)
!70 = !DIFile(filename: "ctcp.c", directory: "/home/lichi/Desktop/irssi/task1")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !70, line: 33, size: 128, align: 64, elements: !72)
!72 = !{!73, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !71, file: !70, line: 34, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !71, file: !70, line: 35, baseType: !77, size: 32, align: 32, offset: 64)
!77 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !80, line: 46, baseType: !75)
!80 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !80, line: 77, baseType: !67)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !80, line: 48, baseType: !85)
!85 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !87, line: 9, baseType: !88)
!87 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !91, !91, !91, !91, !91, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !80, line: 49, baseType: !77)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !96, line: 6, baseType: !97)
!96 = !DIFile(filename: "irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !98, line: 42, size: 39168, align: 64, elements: !99)
!98 = !DIFile(filename: "irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!99 = !{!100, !102, !103, !104, !343, !348, !349, !350, !351, !352, !353, !354, !355, !356, !360, !361, !365, !366, !367, !371, !376, !377, !378, !379, !380, !381, !382, !383, !389, !390, !391, !392, !393, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !701, !703}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !97, file: !101, line: 3, baseType: !77, size: 32, align: 32)
!101 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!102 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !97, file: !101, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !97, file: !101, line: 6, baseType: !77, size: 32, align: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !97, file: !101, line: 8, baseType: !105, size: 64, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !96, line: 5, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !98, line: 24, size: 2496, align: 64, elements: !108)
!108 = !{!109, !111, !112, !113, !114, !115, !116, !117, !118, !120, !121, !122, !123, !124, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !107, file: !110, line: 3, baseType: !77, size: 32, align: 32)
!110 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!111 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !107, file: !110, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !107, file: !110, line: 6, baseType: !77, size: 32, align: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !107, file: !110, line: 9, baseType: !74, size: 64, align: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !107, file: !110, line: 10, baseType: !77, size: 32, align: 32, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !107, file: !110, line: 11, baseType: !74, size: 64, align: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !107, file: !110, line: 11, baseType: !74, size: 64, align: 64, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !107, file: !110, line: 11, baseType: !74, size: 64, align: 64, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !107, file: !110, line: 13, baseType: !119, size: 16, align: 16, offset: 448)
!119 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !107, file: !110, line: 14, baseType: !74, size: 64, align: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !107, file: !110, line: 15, baseType: !74, size: 64, align: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !107, file: !110, line: 16, baseType: !77, size: 32, align: 32, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !107, file: !110, line: 17, baseType: !74, size: 64, align: 64, offset: 704)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !107, file: !110, line: 19, baseType: !125, size: 64, align: 64, offset: 768)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !127, line: 99, baseType: !128)
!127 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !127, line: 99, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !107, file: !110, line: 19, baseType: !125, size: 64, align: 64, offset: 832)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !107, file: !110, line: 21, baseType: !74, size: 64, align: 64, offset: 896)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !107, file: !110, line: 22, baseType: !74, size: 64, align: 64, offset: 960)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !107, file: !110, line: 23, baseType: !74, size: 64, align: 64, offset: 1024)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !107, file: !110, line: 24, baseType: !74, size: 64, align: 64, offset: 1088)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !107, file: !110, line: 26, baseType: !74, size: 64, align: 64, offset: 1152)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !107, file: !110, line: 27, baseType: !74, size: 64, align: 64, offset: 1216)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !107, file: !110, line: 28, baseType: !74, size: 64, align: 64, offset: 1280)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !107, file: !110, line: 29, baseType: !74, size: 64, align: 64, offset: 1344)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !107, file: !110, line: 30, baseType: !74, size: 64, align: 64, offset: 1408)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !107, file: !110, line: 31, baseType: !74, size: 64, align: 64, offset: 1472)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !107, file: !110, line: 32, baseType: !74, size: 64, align: 64, offset: 1536)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !107, file: !110, line: 33, baseType: !74, size: 64, align: 64, offset: 1600)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !107, file: !110, line: 35, baseType: !143, size: 64, align: 64, offset: 1664)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !146)
!146 = !{!147, !148, !288, !289, !294, !295, !296, !297, !298, !307, !308, !309, !313, !314, !315, !316, !317, !318, !319, !320}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !145, file: !4, line: 100, baseType: !93, size: 32, align: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !145, file: !4, line: 101, baseType: !149, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !152)
!152 = !{!153, !175, !181, !187, !191, !275, !279, !284}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !151, file: !4, line: 133, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!157, !143, !78, !158, !161, !162}
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !159, line: 66, baseType: !160)
!159 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!160 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !165, line: 42, baseType: !166)
!165 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !165, line: 44, size: 128, align: 64, elements: !167)
!167 = !{!168, !173, !174}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !166, file: !165, line: 46, baseType: !169, size: 32, align: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !170, line: 36, baseType: !171)
!170 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !159, line: 45, baseType: !172)
!172 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !166, file: !165, line: 47, baseType: !93, size: 32, align: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !166, file: !165, line: 48, baseType: !78, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !151, file: !4, line: 138, baseType: !176, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!157, !143, !179, !158, !161, !162}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !151, file: !4, line: 143, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!157, !143, !185, !186, !162}
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !159, line: 51, baseType: !85)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !151, file: !4, line: 147, baseType: !188, size: 64, align: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!157, !143, !162}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !151, file: !4, line: 149, baseType: !192, size: 64, align: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!195, !143, !274}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !198)
!198 = !{!199, !200, !221, !250, !252, !256, !257, !258, !259, !267, !268, !269, !270}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !197, file: !16, line: 174, baseType: !83, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !197, file: !16, line: 175, baseType: !201, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !204)
!204 = !{!205, !209, !210}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !203, file: !16, line: 198, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !83}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !203, file: !16, line: 199, baseType: !206, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !203, file: !16, line: 200, baseType: !211, size: 64, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !83, !195, !214, !220}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!219, !83}
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !80, line: 50, baseType: !93)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !197, file: !16, line: 177, baseType: !222, size: 64, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !226)
!226 = !{!227, !232, !236, !240, !244, !245}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !225, file: !16, line: 216, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!219, !195, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !225, file: !16, line: 218, baseType: !233, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!219, !195}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !225, file: !16, line: 219, baseType: !237, size: 64, align: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!219, !195, !215, !83}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !225, file: !16, line: 222, baseType: !241, size: 64, align: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !195}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !225, file: !16, line: 226, baseType: !215, size: 64, align: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !225, file: !16, line: 227, baseType: !246, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{null}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !197, file: !16, line: 178, baseType: !251, size: 32, align: 32, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !80, line: 55, baseType: !172)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !197, file: !16, line: 180, baseType: !253, size: 64, align: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !255)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !197, file: !16, line: 182, baseType: !93, size: 32, align: 32, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !197, file: !16, line: 183, baseType: !251, size: 32, align: 32, offset: 352)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !197, file: !16, line: 184, baseType: !251, size: 32, align: 32, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !197, file: !16, line: 186, baseType: !260, size: 64, align: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !262, line: 37, baseType: !263)
!262 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !262, line: 39, size: 128, align: 64, elements: !264)
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !263, file: !262, line: 41, baseType: !83, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !263, file: !262, line: 42, baseType: !260, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !197, file: !16, line: 188, baseType: !195, size: 64, align: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !197, file: !16, line: 189, baseType: !195, size: 64, align: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !16, line: 191, baseType: !74, size: 64, align: 64, offset: 640)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !197, file: !16, line: 193, baseType: !271, size: 64, align: 64, offset: 704)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !273)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !151, file: !4, line: 151, baseType: !276, size: 64, align: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !143}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !151, file: !4, line: 152, baseType: !280, size: 64, align: 64, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!157, !143, !283, !162}
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !151, file: !4, line: 155, baseType: !285, size: 64, align: 64, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!283, !143}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !145, file: !4, line: 103, baseType: !78, size: 64, align: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !145, file: !4, line: 104, baseType: !290, size: 64, align: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !291, line: 77, baseType: !292)
!291 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !291, line: 77, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !145, file: !4, line: 105, baseType: !290, size: 64, align: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !145, file: !4, line: 106, baseType: !78, size: 64, align: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !145, file: !4, line: 107, baseType: !251, size: 32, align: 32, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !145, file: !4, line: 109, baseType: !158, size: 64, align: 64, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !145, file: !4, line: 110, baseType: !299, size: 64, align: 64, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !301, line: 39, baseType: !302)
!301 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !301, line: 41, size: 192, align: 64, elements: !303)
!303 = !{!304, !305, !306}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !302, file: !301, line: 43, baseType: !78, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !302, file: !301, line: 44, baseType: !158, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !302, file: !301, line: 45, baseType: !158, size: 64, align: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !145, file: !4, line: 111, baseType: !299, size: 64, align: 64, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !145, file: !4, line: 112, baseType: !299, size: 64, align: 64, offset: 640)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !145, file: !4, line: 113, baseType: !310, size: 48, align: 8, offset: 704)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 48, align: 8, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 6)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !145, file: !4, line: 117, baseType: !251, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !145, file: !4, line: 118, baseType: !251, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !145, file: !4, line: 119, baseType: !251, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !145, file: !4, line: 120, baseType: !251, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !145, file: !4, line: 121, baseType: !251, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !145, file: !4, line: 122, baseType: !251, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !145, file: !4, line: 124, baseType: !83, size: 64, align: 64, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !145, file: !4, line: 125, baseType: !83, size: 64, align: 64, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !107, file: !110, line: 38, baseType: !172, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !107, file: !110, line: 39, baseType: !172, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !107, file: !110, line: 40, baseType: !172, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !107, file: !110, line: 41, baseType: !172, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !107, file: !110, line: 42, baseType: !172, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !107, file: !110, line: 43, baseType: !172, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !107, file: !110, line: 44, baseType: !172, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !107, file: !110, line: 45, baseType: !172, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !107, file: !110, line: 46, baseType: !74, size: 64, align: 64, offset: 1792)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !107, file: !110, line: 47, baseType: !74, size: 64, align: 64, offset: 1856)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !107, file: !98, line: 27, baseType: !74, size: 64, align: 64, offset: 1920)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !107, file: !98, line: 28, baseType: !74, size: 64, align: 64, offset: 1984)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !107, file: !98, line: 30, baseType: !77, size: 32, align: 32, offset: 2048)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !107, file: !98, line: 31, baseType: !74, size: 64, align: 64, offset: 2112)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !107, file: !98, line: 32, baseType: !74, size: 64, align: 64, offset: 2176)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !107, file: !98, line: 34, baseType: !77, size: 32, align: 32, offset: 2240)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !107, file: !98, line: 35, baseType: !77, size: 32, align: 32, offset: 2272)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !107, file: !98, line: 36, baseType: !77, size: 32, align: 32, offset: 2304)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !107, file: !98, line: 38, baseType: !77, size: 32, align: 32, offset: 2336)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !107, file: !98, line: 38, baseType: !77, size: 32, align: 32, offset: 2368)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !107, file: !98, line: 38, baseType: !77, size: 32, align: 32, offset: 2400)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !107, file: !98, line: 38, baseType: !77, size: 32, align: 32, offset: 2432)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !97, file: !101, line: 9, baseType: !344, size: 64, align: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !345, line: 75, baseType: !346)
!345 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !347, line: 139, baseType: !85)
!347 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!348 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !97, file: !101, line: 10, baseType: !344, size: 64, align: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !97, file: !101, line: 12, baseType: !74, size: 64, align: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !97, file: !101, line: 13, baseType: !74, size: 64, align: 64, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !97, file: !101, line: 15, baseType: !172, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !97, file: !101, line: 16, baseType: !172, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !97, file: !101, line: 17, baseType: !172, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !97, file: !101, line: 18, baseType: !172, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !97, file: !101, line: 19, baseType: !172, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !97, file: !101, line: 21, baseType: !357, size: 64, align: 64, offset: 512)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !127, line: 102, baseType: !359)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !127, line: 102, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !97, file: !101, line: 22, baseType: !77, size: 32, align: 32, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !97, file: !101, line: 25, baseType: !362, size: 128, align: 64, offset: 640)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 128, align: 64, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 2)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !97, file: !101, line: 26, baseType: !77, size: 32, align: 32, offset: 768)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !97, file: !101, line: 27, baseType: !77, size: 32, align: 32, offset: 800)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !97, file: !101, line: 29, baseType: !368, size: 64, align: 64, offset: 832)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !127, line: 103, baseType: !370)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !127, line: 103, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !97, file: !101, line: 30, baseType: !372, size: 64, align: 64, offset: 896)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !374, line: 37, baseType: !375)
!374 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !374, line: 37, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !97, file: !101, line: 32, baseType: !74, size: 64, align: 64, offset: 960)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !97, file: !101, line: 33, baseType: !74, size: 64, align: 64, offset: 1024)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !97, file: !101, line: 34, baseType: !74, size: 64, align: 64, offset: 1088)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !97, file: !101, line: 35, baseType: !172, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !97, file: !101, line: 36, baseType: !172, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !97, file: !101, line: 37, baseType: !172, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !97, file: !101, line: 38, baseType: !172, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !97, file: !101, line: 40, baseType: !384, size: 128, align: 64, offset: 1216)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !80, line: 504, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !80, line: 506, size: 128, align: 64, elements: !386)
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !385, file: !80, line: 508, baseType: !84, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !385, file: !80, line: 509, baseType: !84, size: 64, align: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !97, file: !101, line: 41, baseType: !344, size: 64, align: 64, offset: 1344)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !97, file: !101, line: 42, baseType: !77, size: 32, align: 32, offset: 1408)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !97, file: !101, line: 44, baseType: !260, size: 64, align: 64, offset: 1472)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !97, file: !101, line: 45, baseType: !260, size: 64, align: 64, offset: 1536)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !97, file: !101, line: 53, baseType: !394, size: 64, align: 64, offset: 1600)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !397, !81, !77}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !127, line: 107, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !400, line: 30, size: 2240, align: 64, elements: !401)
!400 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!401 = !{!402, !403, !404, !405, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !481, !485, !489, !493, !498, !577, !584, !588}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !399, file: !101, line: 3, baseType: !77, size: 32, align: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !399, file: !101, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !399, file: !101, line: 6, baseType: !77, size: 32, align: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !399, file: !101, line: 8, baseType: !406, size: 64, align: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !127, line: 113, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !400, line: 25, size: 1920, align: 64, elements: !409)
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !408, file: !110, line: 3, baseType: !77, size: 32, align: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !408, file: !110, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !408, file: !110, line: 6, baseType: !77, size: 32, align: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !408, file: !110, line: 9, baseType: !74, size: 64, align: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !408, file: !110, line: 10, baseType: !77, size: 32, align: 32, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !408, file: !110, line: 11, baseType: !74, size: 64, align: 64, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !408, file: !110, line: 11, baseType: !74, size: 64, align: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !408, file: !110, line: 11, baseType: !74, size: 64, align: 64, offset: 384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !408, file: !110, line: 13, baseType: !119, size: 16, align: 16, offset: 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !408, file: !110, line: 14, baseType: !74, size: 64, align: 64, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !408, file: !110, line: 15, baseType: !74, size: 64, align: 64, offset: 576)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !408, file: !110, line: 16, baseType: !77, size: 32, align: 32, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !408, file: !110, line: 17, baseType: !74, size: 64, align: 64, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !408, file: !110, line: 19, baseType: !125, size: 64, align: 64, offset: 768)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !408, file: !110, line: 19, baseType: !125, size: 64, align: 64, offset: 832)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !408, file: !110, line: 21, baseType: !74, size: 64, align: 64, offset: 896)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !408, file: !110, line: 22, baseType: !74, size: 64, align: 64, offset: 960)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !408, file: !110, line: 23, baseType: !74, size: 64, align: 64, offset: 1024)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !408, file: !110, line: 24, baseType: !74, size: 64, align: 64, offset: 1088)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !408, file: !110, line: 26, baseType: !74, size: 64, align: 64, offset: 1152)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !408, file: !110, line: 27, baseType: !74, size: 64, align: 64, offset: 1216)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !408, file: !110, line: 28, baseType: !74, size: 64, align: 64, offset: 1280)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !408, file: !110, line: 29, baseType: !74, size: 64, align: 64, offset: 1344)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !408, file: !110, line: 30, baseType: !74, size: 64, align: 64, offset: 1408)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !408, file: !110, line: 31, baseType: !74, size: 64, align: 64, offset: 1472)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !408, file: !110, line: 32, baseType: !74, size: 64, align: 64, offset: 1536)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !408, file: !110, line: 33, baseType: !74, size: 64, align: 64, offset: 1600)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !408, file: !110, line: 35, baseType: !143, size: 64, align: 64, offset: 1664)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !408, file: !110, line: 38, baseType: !172, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !408, file: !110, line: 39, baseType: !172, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !408, file: !110, line: 40, baseType: !172, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !408, file: !110, line: 41, baseType: !172, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !408, file: !110, line: 42, baseType: !172, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !408, file: !110, line: 43, baseType: !172, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !408, file: !110, line: 44, baseType: !172, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !408, file: !110, line: 45, baseType: !172, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !408, file: !110, line: 46, baseType: !74, size: 64, align: 64, offset: 1792)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !408, file: !110, line: 47, baseType: !74, size: 64, align: 64, offset: 1856)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !399, file: !101, line: 9, baseType: !344, size: 64, align: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !399, file: !101, line: 10, baseType: !344, size: 64, align: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !399, file: !101, line: 12, baseType: !74, size: 64, align: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !399, file: !101, line: 13, baseType: !74, size: 64, align: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !399, file: !101, line: 15, baseType: !172, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !399, file: !101, line: 16, baseType: !172, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !399, file: !101, line: 17, baseType: !172, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !399, file: !101, line: 18, baseType: !172, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !399, file: !101, line: 19, baseType: !172, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !399, file: !101, line: 21, baseType: !357, size: 64, align: 64, offset: 512)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !399, file: !101, line: 22, baseType: !77, size: 32, align: 32, offset: 576)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !399, file: !101, line: 25, baseType: !362, size: 128, align: 64, offset: 640)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !399, file: !101, line: 26, baseType: !77, size: 32, align: 32, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !399, file: !101, line: 27, baseType: !77, size: 32, align: 32, offset: 800)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !399, file: !101, line: 29, baseType: !368, size: 64, align: 64, offset: 832)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !399, file: !101, line: 30, baseType: !372, size: 64, align: 64, offset: 896)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !399, file: !101, line: 32, baseType: !74, size: 64, align: 64, offset: 960)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !399, file: !101, line: 33, baseType: !74, size: 64, align: 64, offset: 1024)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !399, file: !101, line: 34, baseType: !74, size: 64, align: 64, offset: 1088)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !399, file: !101, line: 35, baseType: !172, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !399, file: !101, line: 36, baseType: !172, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !399, file: !101, line: 37, baseType: !172, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !399, file: !101, line: 38, baseType: !172, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !399, file: !101, line: 40, baseType: !384, size: 128, align: 64, offset: 1216)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !399, file: !101, line: 41, baseType: !344, size: 64, align: 64, offset: 1344)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !399, file: !101, line: 42, baseType: !77, size: 32, align: 32, offset: 1408)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !399, file: !101, line: 44, baseType: !260, size: 64, align: 64, offset: 1472)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !399, file: !101, line: 45, baseType: !260, size: 64, align: 64, offset: 1536)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !399, file: !101, line: 53, baseType: !394, size: 64, align: 64, offset: 1600)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !399, file: !101, line: 55, baseType: !478, size: 64, align: 64, offset: 1664)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!77, !397, !75}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !399, file: !101, line: 57, baseType: !482, size: 64, align: 64, offset: 1728)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!77, !397, !81}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !399, file: !101, line: 60, baseType: !486, size: 64, align: 64, offset: 1792)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!81, !397}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !399, file: !101, line: 62, baseType: !490, size: 64, align: 64, offset: 1856)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !397, !81, !81, !77}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !399, file: !101, line: 65, baseType: !494, size: 64, align: 64, offset: 1920)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!497, !397, !81, !81}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !399, file: !101, line: 69, baseType: !499, size: 64, align: 64, offset: 1984)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!502, !397, !81}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !127, line: 109, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !505, line: 15, size: 1408, align: 64, elements: !506)
!505 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!506 = !{!507, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !525, !529, !531, !532, !533, !534, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !504, file: !508, line: 3, baseType: !77, size: 32, align: 32)
!508 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!509 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !504, file: !508, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !504, file: !508, line: 5, baseType: !372, size: 64, align: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !504, file: !508, line: 7, baseType: !67, size: 64, align: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !504, file: !508, line: 8, baseType: !397, size: 64, align: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !504, file: !508, line: 9, baseType: !74, size: 64, align: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !504, file: !508, line: 10, baseType: !74, size: 64, align: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !504, file: !508, line: 11, baseType: !344, size: 64, align: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !504, file: !508, line: 12, baseType: !77, size: 32, align: 32, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !504, file: !508, line: 13, baseType: !74, size: 64, align: 64, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !504, file: !508, line: 15, baseType: !519, size: 64, align: 64, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !522}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !127, line: 108, baseType: !524)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !127, line: 108, flags: DIFlagFwdDecl)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !504, file: !508, line: 17, baseType: !526, size: 64, align: 64, offset: 640)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!81, !522}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !504, file: !530, line: 5, baseType: !74, size: 64, align: 64, offset: 704)
!530 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!531 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !504, file: !530, line: 6, baseType: !74, size: 64, align: 64, offset: 768)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !504, file: !530, line: 7, baseType: !344, size: 64, align: 64, offset: 832)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !504, file: !530, line: 9, baseType: !372, size: 64, align: 64, offset: 896)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !504, file: !530, line: 10, baseType: !535, size: 64, align: 64, offset: 960)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !127, line: 111, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !538, line: 13, size: 576, align: 64, elements: !539)
!538 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!539 = !{!540, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !558, !559}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !537, file: !541, line: 3, baseType: !77, size: 32, align: 32)
!541 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!542 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !537, file: !541, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !537, file: !541, line: 6, baseType: !344, size: 64, align: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !537, file: !541, line: 8, baseType: !74, size: 64, align: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !537, file: !541, line: 9, baseType: !74, size: 64, align: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !537, file: !541, line: 10, baseType: !74, size: 64, align: 64, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !537, file: !541, line: 11, baseType: !77, size: 32, align: 32, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !537, file: !541, line: 14, baseType: !172, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !537, file: !541, line: 15, baseType: !172, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !537, file: !541, line: 18, baseType: !172, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !537, file: !541, line: 19, baseType: !172, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !537, file: !541, line: 20, baseType: !172, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !537, file: !541, line: 21, baseType: !172, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !537, file: !541, line: 22, baseType: !555, size: 64, align: 8, offset: 360)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 64, align: 8, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 8)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !537, file: !541, line: 26, baseType: !67, size: 64, align: 64, offset: 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !537, file: !541, line: 28, baseType: !535, size: 64, align: 64, offset: 512)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !504, file: !530, line: 12, baseType: !172, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !504, file: !530, line: 13, baseType: !74, size: 64, align: 64, offset: 1088)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !504, file: !530, line: 14, baseType: !77, size: 32, align: 32, offset: 1152)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !504, file: !530, line: 15, baseType: !74, size: 64, align: 64, offset: 1216)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !504, file: !530, line: 17, baseType: !172, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !504, file: !530, line: 18, baseType: !172, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !504, file: !530, line: 19, baseType: !172, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !504, file: !530, line: 20, baseType: !172, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !504, file: !530, line: 22, baseType: !172, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !504, file: !530, line: 23, baseType: !172, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !504, file: !530, line: 24, baseType: !172, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !504, file: !530, line: 25, baseType: !172, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !504, file: !530, line: 26, baseType: !172, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !504, file: !530, line: 31, baseType: !574, size: 64, align: 64, offset: 1344)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64, align: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!74, !502}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !399, file: !101, line: 70, baseType: !578, size: 64, align: 64, offset: 2048)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64, align: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!581, !397, !81}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !127, line: 110, baseType: !583)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !127, line: 110, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !399, file: !101, line: 71, baseType: !585, size: 64, align: 64, offset: 2112)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64, align: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!77, !81, !81}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !399, file: !101, line: 73, baseType: !585, size: 64, align: 64, offset: 2176)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !97, file: !101, line: 55, baseType: !478, size: 64, align: 64, offset: 1664)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !97, file: !101, line: 57, baseType: !482, size: 64, align: 64, offset: 1728)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !97, file: !101, line: 60, baseType: !486, size: 64, align: 64, offset: 1792)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !97, file: !101, line: 62, baseType: !490, size: 64, align: 64, offset: 1856)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !97, file: !101, line: 65, baseType: !494, size: 64, align: 64, offset: 1920)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !97, file: !101, line: 69, baseType: !499, size: 64, align: 64, offset: 1984)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !97, file: !101, line: 70, baseType: !578, size: 64, align: 64, offset: 2048)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !97, file: !101, line: 71, baseType: !585, size: 64, align: 64, offset: 2112)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !97, file: !101, line: 73, baseType: !585, size: 64, align: 64, offset: 2176)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !97, file: !98, line: 46, baseType: !260, size: 64, align: 64, offset: 2240)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !97, file: !98, line: 47, baseType: !260, size: 64, align: 64, offset: 2304)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !97, file: !98, line: 48, baseType: !601, size: 64, align: 64, offset: 2368)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !96, line: 8, baseType: !603)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !96, line: 8, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !97, file: !98, line: 49, baseType: !260, size: 64, align: 64, offset: 2432)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !97, file: !98, line: 51, baseType: !74, size: 64, align: 64, offset: 2496)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !97, file: !98, line: 53, baseType: !74, size: 64, align: 64, offset: 2560)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !97, file: !98, line: 54, baseType: !74, size: 64, align: 64, offset: 2624)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !97, file: !98, line: 55, baseType: !74, size: 64, align: 64, offset: 2688)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !97, file: !98, line: 56, baseType: !74, size: 64, align: 64, offset: 2752)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !97, file: !98, line: 57, baseType: !77, size: 32, align: 32, offset: 2816)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !97, file: !98, line: 59, baseType: !172, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !97, file: !98, line: 60, baseType: !172, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !97, file: !98, line: 62, baseType: !172, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !97, file: !98, line: 63, baseType: !172, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !97, file: !98, line: 64, baseType: !172, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !97, file: !98, line: 65, baseType: !172, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !97, file: !98, line: 66, baseType: !172, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !97, file: !98, line: 67, baseType: !172, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !97, file: !98, line: 68, baseType: !172, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !97, file: !98, line: 69, baseType: !172, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !97, file: !98, line: 70, baseType: !172, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !97, file: !98, line: 71, baseType: !172, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !97, file: !98, line: 72, baseType: !172, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !97, file: !98, line: 74, baseType: !77, size: 32, align: 32, offset: 2880)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !97, file: !98, line: 75, baseType: !77, size: 32, align: 32, offset: 2912)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !97, file: !98, line: 76, baseType: !77, size: 32, align: 32, offset: 2944)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !97, file: !98, line: 77, baseType: !77, size: 32, align: 32, offset: 2976)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !97, file: !98, line: 79, baseType: !372, size: 64, align: 64, offset: 3008)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !97, file: !98, line: 80, baseType: !260, size: 64, align: 64, offset: 3072)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !97, file: !98, line: 81, baseType: !260, size: 64, align: 64, offset: 3136)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !97, file: !98, line: 83, baseType: !299, size: 64, align: 64, offset: 3200)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !97, file: !98, line: 84, baseType: !251, size: 32, align: 32, offset: 3264)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !97, file: !98, line: 87, baseType: !77, size: 32, align: 32, offset: 3296)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !97, file: !98, line: 91, baseType: !260, size: 64, align: 64, offset: 3328)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !97, file: !98, line: 92, baseType: !384, size: 128, align: 64, offset: 3392)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !97, file: !98, line: 93, baseType: !384, size: 128, align: 64, offset: 3520)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !97, file: !98, line: 95, baseType: !77, size: 32, align: 32, offset: 3648)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !97, file: !98, line: 96, baseType: !77, size: 32, align: 32, offset: 3680)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !97, file: !98, line: 97, baseType: !77, size: 32, align: 32, offset: 3712)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !97, file: !98, line: 100, baseType: !260, size: 64, align: 64, offset: 3776)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !97, file: !98, line: 103, baseType: !260, size: 64, align: 64, offset: 3840)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !97, file: !98, line: 106, baseType: !260, size: 64, align: 64, offset: 3904)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !97, file: !98, line: 108, baseType: !372, size: 64, align: 64, offset: 3968)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !97, file: !98, line: 109, baseType: !260, size: 64, align: 64, offset: 4032)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !97, file: !98, line: 111, baseType: !260, size: 64, align: 64, offset: 4096)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !97, file: !98, line: 114, baseType: !67, size: 64, align: 64, offset: 4160)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !97, file: !98, line: 116, baseType: !372, size: 64, align: 64, offset: 4224)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !97, file: !98, line: 117, baseType: !649, size: 32768, align: 64, offset: 4288)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 32768, align: 64, elements: !699)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !651, line: 10, size: 128, align: 64, elements: !652)
!651 = !DIFile(filename: "modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!652 = !{!653, !698}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !650, file: !651, line: 11, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !651, line: 7, baseType: !656)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !658, !81, !75, !75, !74, !299}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !96, line: 7, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !661, line: 15, size: 1600, align: 64, elements: !662)
!661 = !DIFile(filename: "irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !660, file: !508, line: 3, baseType: !77, size: 32, align: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !660, file: !508, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !660, file: !508, line: 5, baseType: !372, size: 64, align: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !660, file: !508, line: 7, baseType: !67, size: 64, align: 64, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !660, file: !508, line: 8, baseType: !94, size: 64, align: 64, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !660, file: !508, line: 9, baseType: !74, size: 64, align: 64, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !660, file: !508, line: 10, baseType: !74, size: 64, align: 64, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !660, file: !508, line: 11, baseType: !344, size: 64, align: 64, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !660, file: !508, line: 12, baseType: !77, size: 32, align: 32, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !660, file: !508, line: 13, baseType: !74, size: 64, align: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !660, file: !508, line: 15, baseType: !519, size: 64, align: 64, offset: 576)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !660, file: !508, line: 17, baseType: !526, size: 64, align: 64, offset: 640)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !660, file: !530, line: 5, baseType: !74, size: 64, align: 64, offset: 704)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !660, file: !530, line: 6, baseType: !74, size: 64, align: 64, offset: 768)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !660, file: !530, line: 7, baseType: !344, size: 64, align: 64, offset: 832)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !660, file: !530, line: 9, baseType: !372, size: 64, align: 64, offset: 896)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !660, file: !530, line: 10, baseType: !535, size: 64, align: 64, offset: 960)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !660, file: !530, line: 12, baseType: !172, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !660, file: !530, line: 13, baseType: !74, size: 64, align: 64, offset: 1088)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !660, file: !530, line: 14, baseType: !77, size: 32, align: 32, offset: 1152)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !660, file: !530, line: 15, baseType: !74, size: 64, align: 64, offset: 1216)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !660, file: !530, line: 17, baseType: !172, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !660, file: !530, line: 18, baseType: !172, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !660, file: !530, line: 19, baseType: !172, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !660, file: !530, line: 20, baseType: !172, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !660, file: !530, line: 22, baseType: !172, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !660, file: !530, line: 23, baseType: !172, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !660, file: !530, line: 24, baseType: !172, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !660, file: !530, line: 25, baseType: !172, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !660, file: !530, line: 26, baseType: !172, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !660, file: !530, line: 31, baseType: !574, size: 64, align: 64, offset: 1344)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !660, file: !661, line: 18, baseType: !260, size: 64, align: 64, offset: 1408)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !660, file: !661, line: 20, baseType: !344, size: 64, align: 64, offset: 1472)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !660, file: !661, line: 21, baseType: !77, size: 32, align: 32, offset: 1536)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !660, file: !661, line: 22, baseType: !77, size: 32, align: 32, offset: 1568)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !650, file: !651, line: 12, baseType: !75, size: 8, align: 8, offset: 64)
!699 = !{!700}
!700 = !DISubrange(count: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !97, file: !98, line: 118, baseType: !702, size: 2048, align: 8, offset: 37056)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 2048, align: 8, elements: !699)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !97, file: !98, line: 120, baseType: !585, size: 64, align: 64, offset: 39104)
!704 = !{!705}
!705 = distinct !DIGlobalVariable(name: "ctcp_cmds", scope: !0, file: !70, line: 38, type: !260, isLocal: true, isDefinition: true, variable: %struct._GSList** @ctcp_cmds)
!706 = !{i32 2, !"Dwarf Version", i32 4}
!707 = !{i32 2, !"Debug Info Version", i32 3}
!708 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!709 = distinct !DISubprogram(name: "ctcp_register", scope: !70, file: !70, line: 54, type: !710, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !712)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !81}
!712 = !{}
!713 = !DILocalVariable(name: "name", arg: 1, scope: !709, file: !70, line: 54, type: !81)
!714 = !DIExpression()
!715 = !DILocation(line: 54, column: 32, scope: !709)
!716 = !DILocalVariable(name: "rec", scope: !709, file: !70, line: 56, type: !68)
!717 = !DILocation(line: 56, column: 16, scope: !709)
!718 = !DILocation(line: 58, column: 22, scope: !709)
!719 = !DILocation(line: 58, column: 8, scope: !709)
!720 = !DILocation(line: 58, column: 6, scope: !709)
!721 = !DILocation(line: 59, column: 6, scope: !722)
!722 = distinct !DILexicalBlock(scope: !709, file: !70, line: 59, column: 6)
!723 = !DILocation(line: 59, column: 10, scope: !722)
!724 = !DILocation(line: 59, column: 6, scope: !709)
!725 = !DILocation(line: 60, column: 27, scope: !726)
!726 = distinct !DILexicalBlock(scope: !722, file: !70, line: 59, column: 18)
!727 = !DILocation(line: 60, column: 10, scope: !726)
!728 = !DILocation(line: 60, column: 7, scope: !726)
!729 = !DILocation(line: 61, column: 29, scope: !726)
!730 = !DILocation(line: 61, column: 15, scope: !726)
!731 = !DILocation(line: 61, column: 3, scope: !726)
!732 = !DILocation(line: 61, column: 8, scope: !726)
!733 = !DILocation(line: 61, column: 13, scope: !726)
!734 = !DILocation(line: 63, column: 30, scope: !726)
!735 = !DILocation(line: 63, column: 41, scope: !726)
!736 = !DILocation(line: 63, column: 15, scope: !726)
!737 = !DILocation(line: 63, column: 13, scope: !726)
!738 = !DILocation(line: 64, column: 2, scope: !726)
!739 = !DILocation(line: 66, column: 2, scope: !709)
!740 = !DILocation(line: 66, column: 7, scope: !709)
!741 = !DILocation(line: 66, column: 15, scope: !709)
!742 = !DILocation(line: 67, column: 1, scope: !709)
!743 = distinct !DISubprogram(name: "ctcp_cmd_find", scope: !70, file: !70, line: 40, type: !744, isLocal: true, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !712)
!744 = !DISubroutineType(types: !745)
!745 = !{!68, !81}
!746 = !DILocalVariable(name: "name", arg: 1, scope: !743, file: !70, line: 40, type: !81)
!747 = !DILocation(line: 40, column: 48, scope: !743)
!748 = !DILocalVariable(name: "tmp", scope: !743, file: !70, line: 42, type: !260)
!749 = !DILocation(line: 42, column: 10, scope: !743)
!750 = !DILocation(line: 44, column: 13, scope: !751)
!751 = distinct !DILexicalBlock(scope: !743, file: !70, line: 44, column: 2)
!752 = !DILocation(line: 44, column: 11, scope: !751)
!753 = !DILocation(line: 44, column: 7, scope: !751)
!754 = !DILocation(line: 44, column: 24, scope: !755)
!755 = !DILexicalBlockFile(scope: !756, file: !70, discriminator: 1)
!756 = distinct !DILexicalBlock(scope: !751, file: !70, line: 44, column: 2)
!757 = !DILocation(line: 44, column: 28, scope: !755)
!758 = !DILocation(line: 44, column: 2, scope: !755)
!759 = !DILocalVariable(name: "rec", scope: !760, file: !70, line: 45, type: !68)
!760 = distinct !DILexicalBlock(scope: !756, file: !70, line: 44, column: 53)
!761 = !DILocation(line: 45, column: 17, scope: !760)
!762 = !DILocation(line: 45, column: 23, scope: !760)
!763 = !DILocation(line: 45, column: 28, scope: !760)
!764 = !DILocation(line: 47, column: 26, scope: !765)
