; ModuleID = './line143-irc-cap.o.i'
source_filename = "./line143-irc-cap.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 51, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46}
!38 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!39 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!40 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!41 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!42 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!43 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!44 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!45 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!46 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!47 = !{!48, !49, !56, !60, !62, !67}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !50, line: 9, baseType: !51)
!50 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !54, !54, !54, !54, !54, !54}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !58, line: 46, baseType: !59)
!58 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!59 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "GDestroyNotify", file: !58, line: 87, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !66}
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !58, line: 77, baseType: !48)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !68, line: 66, baseType: !69)
!68 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!69 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!70 = !{i32 2, !"Dwarf Version", i32 4}
!71 = !{i32 2, !"Debug Info Version", i32 3}
!72 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!73 = distinct !DISubprogram(name: "cap_toggle", scope: !74, file: !74, line: 27, type: !75, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !686)
!74 = !DIFile(filename: "irc-cap.c", directory: "/home/lichi/Desktop/irssi/task1")
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !78, !98, !77}
!77 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !80, line: 6, baseType: !81)
!80 = !DIFile(filename: "irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !82, line: 42, size: 39168, align: 64, elements: !83)
!82 = !DIFile(filename: "irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!83 = !{!84, !86, !87, !88, !324, !329, !330, !331, !332, !333, !334, !335, !336, !337, !341, !342, !346, !347, !348, !352, !357, !358, !359, !360, !361, !362, !363, !364, !371, !372, !373, !374, !375, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !683, !685}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !81, file: !85, line: 3, baseType: !77, size: 32, align: 32)
!85 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!86 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !81, file: !85, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !81, file: !85, line: 6, baseType: !77, size: 32, align: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !81, file: !85, line: 8, baseType: !89, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !80, line: 5, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !82, line: 24, size: 2496, align: 64, elements: !92)
!92 = !{!93, !95, !96, !97, !99, !100, !101, !102, !103, !105, !106, !107, !108, !109, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, file: !94, line: 3, baseType: !77, size: 32, align: 32)
!94 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!95 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !91, file: !94, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !91, file: !94, line: 6, baseType: !77, size: 32, align: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !91, file: !94, line: 9, baseType: !98, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !91, file: !94, line: 10, baseType: !77, size: 32, align: 32, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !91, file: !94, line: 11, baseType: !98, size: 64, align: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !91, file: !94, line: 11, baseType: !98, size: 64, align: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !91, file: !94, line: 11, baseType: !98, size: 64, align: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !91, file: !94, line: 13, baseType: !104, size: 16, align: 16, offset: 448)
!104 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !91, file: !94, line: 14, baseType: !98, size: 64, align: 64, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !91, file: !94, line: 15, baseType: !98, size: 64, align: 64, offset: 576)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !91, file: !94, line: 16, baseType: !77, size: 32, align: 32, offset: 640)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !91, file: !94, line: 17, baseType: !98, size: 64, align: 64, offset: 704)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !91, file: !94, line: 19, baseType: !110, size: 64, align: 64, offset: 768)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !112, line: 99, baseType: !113)
!112 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !112, line: 99, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !91, file: !94, line: 19, baseType: !110, size: 64, align: 64, offset: 832)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !91, file: !94, line: 21, baseType: !98, size: 64, align: 64, offset: 896)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !91, file: !94, line: 22, baseType: !98, size: 64, align: 64, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !91, file: !94, line: 23, baseType: !98, size: 64, align: 64, offset: 1024)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !91, file: !94, line: 24, baseType: !98, size: 64, align: 64, offset: 1088)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !91, file: !94, line: 26, baseType: !98, size: 64, align: 64, offset: 1152)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !91, file: !94, line: 27, baseType: !98, size: 64, align: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !91, file: !94, line: 28, baseType: !98, size: 64, align: 64, offset: 1280)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !91, file: !94, line: 29, baseType: !98, size: 64, align: 64, offset: 1344)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !91, file: !94, line: 30, baseType: !98, size: 64, align: 64, offset: 1408)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !91, file: !94, line: 31, baseType: !98, size: 64, align: 64, offset: 1472)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !91, file: !94, line: 32, baseType: !98, size: 64, align: 64, offset: 1536)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !91, file: !94, line: 33, baseType: !98, size: 64, align: 64, offset: 1600)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !91, file: !94, line: 35, baseType: !128, size: 64, align: 64, offset: 1664)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !131)
!131 = !{!132, !134, !269, !270, !275, !276, !277, !278, !279, !288, !289, !290, !294, !295, !296, !297, !298, !299, !300, !301}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !130, file: !4, line: 100, baseType: !133, size: 32, align: 32)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !58, line: 49, baseType: !77)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !130, file: !4, line: 101, baseType: !135, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !138)
!138 = !{!139, !158, !164, !171, !175, !256, !260, !265}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !137, file: !4, line: 133, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !128, !56, !67, !144, !145}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !148, line: 42, baseType: !149)
!148 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !148, line: 44, size: 128, align: 64, elements: !150)
!150 = !{!151, !156, !157}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !149, file: !148, line: 46, baseType: !152, size: 32, align: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !153, line: 36, baseType: !154)
!153 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !68, line: 45, baseType: !155)
!155 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !149, file: !148, line: 47, baseType: !133, size: 32, align: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !149, file: !148, line: 48, baseType: !56, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !137, file: !4, line: 138, baseType: !159, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!143, !128, !162, !67, !144, !145}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !137, file: !4, line: 143, baseType: !165, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!143, !128, !168, !170, !145}
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !68, line: 51, baseType: !169)
!169 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !137, file: !4, line: 147, baseType: !172, size: 64, align: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!143, !128, !145}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !137, file: !4, line: 149, baseType: !176, size: 64, align: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!179, !128, !255}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !182)
!182 = !{!183, !184, !202, !231, !233, !237, !238, !239, !240, !248, !249, !250, !251}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !181, file: !16, line: 174, baseType: !66, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !181, file: !16, line: 175, baseType: !185, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !188)
!188 = !{!189, !190, !191}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !187, file: !16, line: 198, baseType: !63, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !187, file: !16, line: 199, baseType: !63, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !187, file: !16, line: 200, baseType: !192, size: 64, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !66, !179, !195, !201}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!200, !66}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !58, line: 50, baseType: !133)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !181, file: !16, line: 177, baseType: !203, size: 64, align: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !207)
!207 = !{!208, !213, !217, !221, !225, !226}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !206, file: !16, line: 216, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!200, !179, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !206, file: !16, line: 218, baseType: !214, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!200, !179}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !206, file: !16, line: 219, baseType: !218, size: 64, align: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!200, !179, !196, !66}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !206, file: !16, line: 222, baseType: !222, size: 64, align: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !179}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !206, file: !16, line: 226, baseType: !196, size: 64, align: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !206, file: !16, line: 227, baseType: !227, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{null}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !181, file: !16, line: 178, baseType: !232, size: 32, align: 32, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !58, line: 55, baseType: !155)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !181, file: !16, line: 180, baseType: !234, size: 64, align: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !236)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !181, file: !16, line: 182, baseType: !133, size: 32, align: 32, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !181, file: !16, line: 183, baseType: !232, size: 32, align: 32, offset: 352)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !181, file: !16, line: 184, baseType: !232, size: 32, align: 32, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !181, file: !16, line: 186, baseType: !241, size: 64, align: 64, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !243, line: 37, baseType: !244)
!243 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !243, line: 39, size: 128, align: 64, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !244, file: !243, line: 41, baseType: !66, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !243, line: 42, baseType: !241, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !181, file: !16, line: 188, baseType: !179, size: 64, align: 64, offset: 512)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !16, line: 189, baseType: !179, size: 64, align: 64, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !16, line: 191, baseType: !98, size: 64, align: 64, offset: 640)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !181, file: !16, line: 193, baseType: !252, size: 64, align: 64, offset: 704)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !254)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !137, file: !4, line: 151, baseType: !257, size: 64, align: 64, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !128}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !137, file: !4, line: 152, baseType: !261, size: 64, align: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!143, !128, !264, !145}
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !137, file: !4, line: 155, baseType: !266, size: 64, align: 64, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!264, !128}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !130, file: !4, line: 103, baseType: !56, size: 64, align: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !130, file: !4, line: 104, baseType: !271, size: 64, align: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !272, line: 77, baseType: !273)
!272 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !272, line: 77, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !130, file: !4, line: 105, baseType: !271, size: 64, align: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !130, file: !4, line: 106, baseType: !56, size: 64, align: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !130, file: !4, line: 107, baseType: !232, size: 32, align: 32, offset: 384)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !130, file: !4, line: 109, baseType: !67, size: 64, align: 64, offset: 448)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !130, file: !4, line: 110, baseType: !280, size: 64, align: 64, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !282, line: 39, baseType: !283)
!282 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !282, line: 41, size: 192, align: 64, elements: !284)
!284 = !{!285, !286, !287}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !283, file: !282, line: 43, baseType: !56, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !283, file: !282, line: 44, baseType: !67, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !283, file: !282, line: 45, baseType: !67, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !130, file: !4, line: 111, baseType: !280, size: 64, align: 64, offset: 576)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !130, file: !4, line: 112, baseType: !280, size: 64, align: 64, offset: 640)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !130, file: !4, line: 113, baseType: !291, size: 48, align: 8, offset: 704)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 48, align: 8, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 6)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !130, file: !4, line: 117, baseType: !232, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !130, file: !4, line: 118, baseType: !232, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !130, file: !4, line: 119, baseType: !232, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !130, file: !4, line: 120, baseType: !232, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !130, file: !4, line: 121, baseType: !232, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !130, file: !4, line: 122, baseType: !232, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !130, file: !4, line: 124, baseType: !66, size: 64, align: 64, offset: 768)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !130, file: !4, line: 125, baseType: !66, size: 64, align: 64, offset: 832)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !91, file: !94, line: 38, baseType: !155, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !91, file: !94, line: 39, baseType: !155, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !91, file: !94, line: 40, baseType: !155, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !91, file: !94, line: 41, baseType: !155, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !91, file: !94, line: 42, baseType: !155, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !91, file: !94, line: 43, baseType: !155, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !91, file: !94, line: 44, baseType: !155, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !91, file: !94, line: 45, baseType: !155, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !91, file: !94, line: 46, baseType: !98, size: 64, align: 64, offset: 1792)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !91, file: !94, line: 47, baseType: !98, size: 64, align: 64, offset: 1856)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !91, file: !82, line: 27, baseType: !98, size: 64, align: 64, offset: 1920)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !91, file: !82, line: 28, baseType: !98, size: 64, align: 64, offset: 1984)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !91, file: !82, line: 30, baseType: !77, size: 32, align: 32, offset: 2048)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !91, file: !82, line: 31, baseType: !98, size: 64, align: 64, offset: 2112)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !91, file: !82, line: 32, baseType: !98, size: 64, align: 64, offset: 2176)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !91, file: !82, line: 34, baseType: !77, size: 32, align: 32, offset: 2240)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !91, file: !82, line: 35, baseType: !77, size: 32, align: 32, offset: 2272)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !91, file: !82, line: 36, baseType: !77, size: 32, align: 32, offset: 2304)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !91, file: !82, line: 38, baseType: !77, size: 32, align: 32, offset: 2336)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !91, file: !82, line: 38, baseType: !77, size: 32, align: 32, offset: 2368)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !91, file: !82, line: 38, baseType: !77, size: 32, align: 32, offset: 2400)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !91, file: !82, line: 38, baseType: !77, size: 32, align: 32, offset: 2432)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !81, file: !85, line: 9, baseType: !325, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !326, line: 75, baseType: !327)
!326 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !328, line: 139, baseType: !169)
!328 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!329 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !81, file: !85, line: 10, baseType: !325, size: 64, align: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !81, file: !85, line: 12, baseType: !98, size: 64, align: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !81, file: !85, line: 13, baseType: !98, size: 64, align: 64, offset: 384)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !81, file: !85, line: 15, baseType: !155, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !81, file: !85, line: 16, baseType: !155, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !81, file: !85, line: 17, baseType: !155, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !81, file: !85, line: 18, baseType: !155, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !81, file: !85, line: 19, baseType: !155, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !81, file: !85, line: 21, baseType: !338, size: 64, align: 64, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !112, line: 102, baseType: !340)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !112, line: 102, flags: DIFlagFwdDecl)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !81, file: !85, line: 22, baseType: !77, size: 32, align: 32, offset: 576)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !81, file: !85, line: 25, baseType: !343, size: 128, align: 64, offset: 640)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 128, align: 64, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 2)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !81, file: !85, line: 26, baseType: !77, size: 32, align: 32, offset: 768)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !81, file: !85, line: 27, baseType: !77, size: 32, align: 32, offset: 800)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !81, file: !85, line: 29, baseType: !349, size: 64, align: 64, offset: 832)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !112, line: 103, baseType: !351)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !112, line: 103, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !81, file: !85, line: 30, baseType: !353, size: 64, align: 64, offset: 896)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !355, line: 37, baseType: !356)
!355 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !355, line: 37, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !81, file: !85, line: 32, baseType: !98, size: 64, align: 64, offset: 960)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !81, file: !85, line: 33, baseType: !98, size: 64, align: 64, offset: 1024)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !81, file: !85, line: 34, baseType: !98, size: 64, align: 64, offset: 1088)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !81, file: !85, line: 35, baseType: !155, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !81, file: !85, line: 36, baseType: !155, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !81, file: !85, line: 37, baseType: !155, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !81, file: !85, line: 38, baseType: !155, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !81, file: !85, line: 40, baseType: !365, size: 128, align: 64, offset: 1216)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !58, line: 504, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !58, line: 506, size: 128, align: 64, elements: !367)
!367 = !{!368, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !366, file: !58, line: 508, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !58, line: 48, baseType: !169)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !366, file: !58, line: 509, baseType: !369, size: 64, align: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !81, file: !85, line: 41, baseType: !325, size: 64, align: 64, offset: 1344)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !81, file: !85, line: 42, baseType: !77, size: 32, align: 32, offset: 1408)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !81, file: !85, line: 44, baseType: !241, size: 64, align: 64, offset: 1472)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !81, file: !85, line: 45, baseType: !241, size: 64, align: 64, offset: 1536)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !81, file: !85, line: 53, baseType: !376, size: 64, align: 64, offset: 1600)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !379, !60, !77}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !112, line: 107, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !382, line: 30, size: 2240, align: 64, elements: !383)
!382 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!383 = !{!384, !385, !386, !387, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !463, !467, !471, !475, !480, !559, !566, !570}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !381, file: !85, line: 3, baseType: !77, size: 32, align: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !381, file: !85, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !381, file: !85, line: 6, baseType: !77, size: 32, align: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !381, file: !85, line: 8, baseType: !388, size: 64, align: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !112, line: 113, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !382, line: 25, size: 1920, align: 64, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !94, line: 3, baseType: !77, size: 32, align: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !390, file: !94, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !390, file: !94, line: 6, baseType: !77, size: 32, align: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !390, file: !94, line: 9, baseType: !98, size: 64, align: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !390, file: !94, line: 10, baseType: !77, size: 32, align: 32, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !390, file: !94, line: 11, baseType: !98, size: 64, align: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !390, file: !94, line: 11, baseType: !98, size: 64, align: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !390, file: !94, line: 11, baseType: !98, size: 64, align: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !390, file: !94, line: 13, baseType: !104, size: 16, align: 16, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !390, file: !94, line: 14, baseType: !98, size: 64, align: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !390, file: !94, line: 15, baseType: !98, size: 64, align: 64, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !390, file: !94, line: 16, baseType: !77, size: 32, align: 32, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !390, file: !94, line: 17, baseType: !98, size: 64, align: 64, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !390, file: !94, line: 19, baseType: !110, size: 64, align: 64, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !390, file: !94, line: 19, baseType: !110, size: 64, align: 64, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !390, file: !94, line: 21, baseType: !98, size: 64, align: 64, offset: 896)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !390, file: !94, line: 22, baseType: !98, size: 64, align: 64, offset: 960)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !390, file: !94, line: 23, baseType: !98, size: 64, align: 64, offset: 1024)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !390, file: !94, line: 24, baseType: !98, size: 64, align: 64, offset: 1088)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !390, file: !94, line: 26, baseType: !98, size: 64, align: 64, offset: 1152)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !390, file: !94, line: 27, baseType: !98, size: 64, align: 64, offset: 1216)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !390, file: !94, line: 28, baseType: !98, size: 64, align: 64, offset: 1280)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !390, file: !94, line: 29, baseType: !98, size: 64, align: 64, offset: 1344)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !390, file: !94, line: 30, baseType: !98, size: 64, align: 64, offset: 1408)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !390, file: !94, line: 31, baseType: !98, size: 64, align: 64, offset: 1472)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !390, file: !94, line: 32, baseType: !98, size: 64, align: 64, offset: 1536)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !390, file: !94, line: 33, baseType: !98, size: 64, align: 64, offset: 1600)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !390, file: !94, line: 35, baseType: !128, size: 64, align: 64, offset: 1664)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !390, file: !94, line: 38, baseType: !155, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !390, file: !94, line: 39, baseType: !155, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !390, file: !94, line: 40, baseType: !155, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !390, file: !94, line: 41, baseType: !155, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !390, file: !94, line: 42, baseType: !155, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !390, file: !94, line: 43, baseType: !155, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !390, file: !94, line: 44, baseType: !155, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !390, file: !94, line: 45, baseType: !155, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !390, file: !94, line: 46, baseType: !98, size: 64, align: 64, offset: 1792)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !390, file: !94, line: 47, baseType: !98, size: 64, align: 64, offset: 1856)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !381, file: !85, line: 9, baseType: !325, size: 64, align: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !381, file: !85, line: 10, baseType: !325, size: 64, align: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !381, file: !85, line: 12, baseType: !98, size: 64, align: 64, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !381, file: !85, line: 13, baseType: !98, size: 64, align: 64, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !381, file: !85, line: 15, baseType: !155, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !381, file: !85, line: 16, baseType: !155, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !381, file: !85, line: 17, baseType: !155, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !381, file: !85, line: 18, baseType: !155, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !381, file: !85, line: 19, baseType: !155, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !381, file: !85, line: 21, baseType: !338, size: 64, align: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !381, file: !85, line: 22, baseType: !77, size: 32, align: 32, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !381, file: !85, line: 25, baseType: !343, size: 128, align: 64, offset: 640)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !381, file: !85, line: 26, baseType: !77, size: 32, align: 32, offset: 768)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !381, file: !85, line: 27, baseType: !77, size: 32, align: 32, offset: 800)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !381, file: !85, line: 29, baseType: !349, size: 64, align: 64, offset: 832)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !381, file: !85, line: 30, baseType: !353, size: 64, align: 64, offset: 896)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !381, file: !85, line: 32, baseType: !98, size: 64, align: 64, offset: 960)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !381, file: !85, line: 33, baseType: !98, size: 64, align: 64, offset: 1024)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !381, file: !85, line: 34, baseType: !98, size: 64, align: 64, offset: 1088)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !381, file: !85, line: 35, baseType: !155, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !381, file: !85, line: 36, baseType: !155, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !381, file: !85, line: 37, baseType: !155, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !381, file: !85, line: 38, baseType: !155, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !381, file: !85, line: 40, baseType: !365, size: 128, align: 64, offset: 1216)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !381, file: !85, line: 41, baseType: !325, size: 64, align: 64, offset: 1344)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !381, file: !85, line: 42, baseType: !77, size: 32, align: 32, offset: 1408)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !381, file: !85, line: 44, baseType: !241, size: 64, align: 64, offset: 1472)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !381, file: !85, line: 45, baseType: !241, size: 64, align: 64, offset: 1536)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !381, file: !85, line: 53, baseType: !376, size: 64, align: 64, offset: 1600)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !381, file: !85, line: 55, baseType: !460, size: 64, align: 64, offset: 1664)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!77, !379, !59}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !381, file: !85, line: 57, baseType: !464, size: 64, align: 64, offset: 1728)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!77, !379, !60}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !381, file: !85, line: 60, baseType: !468, size: 64, align: 64, offset: 1792)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!60, !379}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !381, file: !85, line: 62, baseType: !472, size: 64, align: 64, offset: 1856)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !379, !60, !60, !77}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !381, file: !85, line: 65, baseType: !476, size: 64, align: 64, offset: 1920)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!479, !379, !60, !60}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !381, file: !85, line: 69, baseType: !481, size: 64, align: 64, offset: 1984)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!484, !379, !60}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !112, line: 109, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !487, line: 15, size: 1408, align: 64, elements: !488)
!487 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!488 = !{!489, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !507, !511, !513, !514, !515, !516, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !486, file: !490, line: 3, baseType: !77, size: 32, align: 32)
!490 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!491 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !486, file: !490, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !486, file: !490, line: 5, baseType: !353, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !486, file: !490, line: 7, baseType: !48, size: 64, align: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !486, file: !490, line: 8, baseType: !379, size: 64, align: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !486, file: !490, line: 9, baseType: !98, size: 64, align: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !486, file: !490, line: 10, baseType: !98, size: 64, align: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !486, file: !490, line: 11, baseType: !325, size: 64, align: 64, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !486, file: !490, line: 12, baseType: !77, size: 32, align: 32, offset: 448)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !486, file: !490, line: 13, baseType: !98, size: 64, align: 64, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !486, file: !490, line: 15, baseType: !501, size: 64, align: 64, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !112, line: 108, baseType: !506)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !112, line: 108, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !486, file: !490, line: 17, baseType: !508, size: 64, align: 64, offset: 640)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!60, !504}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !486, file: !512, line: 5, baseType: !98, size: 64, align: 64, offset: 704)
!512 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!513 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !486, file: !512, line: 6, baseType: !98, size: 64, align: 64, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !486, file: !512, line: 7, baseType: !325, size: 64, align: 64, offset: 832)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !486, file: !512, line: 9, baseType: !353, size: 64, align: 64, offset: 896)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !486, file: !512, line: 10, baseType: !517, size: 64, align: 64, offset: 960)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !112, line: 111, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !520, line: 13, size: 576, align: 64, elements: !521)
!520 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!521 = !{!522, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !540, !541}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !519, file: !523, line: 3, baseType: !77, size: 32, align: 32)
!523 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!524 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !519, file: !523, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !519, file: !523, line: 6, baseType: !325, size: 64, align: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !519, file: !523, line: 8, baseType: !98, size: 64, align: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !519, file: !523, line: 9, baseType: !98, size: 64, align: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !519, file: !523, line: 10, baseType: !98, size: 64, align: 64, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !519, file: !523, line: 11, baseType: !77, size: 32, align: 32, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !519, file: !523, line: 14, baseType: !155, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !519, file: !523, line: 15, baseType: !155, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !519, file: !523, line: 18, baseType: !155, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !519, file: !523, line: 19, baseType: !155, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !519, file: !523, line: 20, baseType: !155, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !519, file: !523, line: 21, baseType: !155, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !519, file: !523, line: 22, baseType: !537, size: 64, align: 8, offset: 360)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 64, align: 8, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 8)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !519, file: !523, line: 26, baseType: !48, size: 64, align: 64, offset: 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !519, file: !523, line: 28, baseType: !517, size: 64, align: 64, offset: 512)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !486, file: !512, line: 12, baseType: !155, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !486, file: !512, line: 13, baseType: !98, size: 64, align: 64, offset: 1088)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !486, file: !512, line: 14, baseType: !77, size: 32, align: 32, offset: 1152)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !486, file: !512, line: 15, baseType: !98, size: 64, align: 64, offset: 1216)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !486, file: !512, line: 17, baseType: !155, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !486, file: !512, line: 18, baseType: !155, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !486, file: !512, line: 19, baseType: !155, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !486, file: !512, line: 20, baseType: !155, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !486, file: !512, line: 22, baseType: !155, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !486, file: !512, line: 23, baseType: !155, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !486, file: !512, line: 24, baseType: !155, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !486, file: !512, line: 25, baseType: !155, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !486, file: !512, line: 26, baseType: !155, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !486, file: !512, line: 31, baseType: !556, size: 64, align: 64, offset: 1344)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64, align: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!98, !484}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !381, file: !85, line: 70, baseType: !560, size: 64, align: 64, offset: 2048)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!563, !379, !60}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !112, line: 110, baseType: !565)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !112, line: 110, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !381, file: !85, line: 71, baseType: !567, size: 64, align: 64, offset: 2112)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64, align: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!77, !60, !60}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !381, file: !85, line: 73, baseType: !567, size: 64, align: 64, offset: 2176)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !81, file: !85, line: 55, baseType: !460, size: 64, align: 64, offset: 1664)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !81, file: !85, line: 57, baseType: !464, size: 64, align: 64, offset: 1728)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !81, file: !85, line: 60, baseType: !468, size: 64, align: 64, offset: 1792)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !81, file: !85, line: 62, baseType: !472, size: 64, align: 64, offset: 1856)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !81, file: !85, line: 65, baseType: !476, size: 64, align: 64, offset: 1920)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !81, file: !85, line: 69, baseType: !481, size: 64, align: 64, offset: 1984)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !81, file: !85, line: 70, baseType: !560, size: 64, align: 64, offset: 2048)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !81, file: !85, line: 71, baseType: !567, size: 64, align: 64, offset: 2112)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !81, file: !85, line: 73, baseType: !567, size: 64, align: 64, offset: 2176)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !81, file: !82, line: 46, baseType: !241, size: 64, align: 64, offset: 2240)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !81, file: !82, line: 47, baseType: !241, size: 64, align: 64, offset: 2304)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !81, file: !82, line: 48, baseType: !583, size: 64, align: 64, offset: 2368)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, align: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !80, line: 8, baseType: !585)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !80, line: 8, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !81, file: !82, line: 49, baseType: !241, size: 64, align: 64, offset: 2432)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !81, file: !82, line: 51, baseType: !98, size: 64, align: 64, offset: 2496)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !81, file: !82, line: 53, baseType: !98, size: 64, align: 64, offset: 2560)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !81, file: !82, line: 54, baseType: !98, size: 64, align: 64, offset: 2624)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !81, file: !82, line: 55, baseType: !98, size: 64, align: 64, offset: 2688)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !81, file: !82, line: 56, baseType: !98, size: 64, align: 64, offset: 2752)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !81, file: !82, line: 57, baseType: !77, size: 32, align: 32, offset: 2816)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !81, file: !82, line: 59, baseType: !155, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !81, file: !82, line: 60, baseType: !155, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !81, file: !82, line: 62, baseType: !155, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !81, file: !82, line: 63, baseType: !155, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !81, file: !82, line: 64, baseType: !155, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !81, file: !82, line: 65, baseType: !155, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !81, file: !82, line: 66, baseType: !155, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !81, file: !82, line: 67, baseType: !155, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !81, file: !82, line: 68, baseType: !155, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !81, file: !82, line: 69, baseType: !155, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !81, file: !82, line: 70, baseType: !155, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !81, file: !82, line: 71, baseType: !155, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !81, file: !82, line: 72, baseType: !155, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !81, file: !82, line: 74, baseType: !77, size: 32, align: 32, offset: 2880)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !81, file: !82, line: 75, baseType: !77, size: 32, align: 32, offset: 2912)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !81, file: !82, line: 76, baseType: !77, size: 32, align: 32, offset: 2944)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !81, file: !82, line: 77, baseType: !77, size: 32, align: 32, offset: 2976)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !81, file: !82, line: 79, baseType: !353, size: 64, align: 64, offset: 3008)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !81, file: !82, line: 80, baseType: !241, size: 64, align: 64, offset: 3072)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !81, file: !82, line: 81, baseType: !241, size: 64, align: 64, offset: 3136)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !81, file: !82, line: 83, baseType: !280, size: 64, align: 64, offset: 3200)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !81, file: !82, line: 84, baseType: !232, size: 32, align: 32, offset: 3264)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !81, file: !82, line: 87, baseType: !77, size: 32, align: 32, offset: 3296)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !81, file: !82, line: 91, baseType: !241, size: 64, align: 64, offset: 3328)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !81, file: !82, line: 92, baseType: !365, size: 128, align: 64, offset: 3392)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !81, file: !82, line: 93, baseType: !365, size: 128, align: 64, offset: 3520)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !81, file: !82, line: 95, baseType: !77, size: 32, align: 32, offset: 3648)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !81, file: !82, line: 96, baseType: !77, size: 32, align: 32, offset: 3680)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !81, file: !82, line: 97, baseType: !77, size: 32, align: 32, offset: 3712)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !81, file: !82, line: 100, baseType: !241, size: 64, align: 64, offset: 3776)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !81, file: !82, line: 103, baseType: !241, size: 64, align: 64, offset: 3840)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !81, file: !82, line: 106, baseType: !241, size: 64, align: 64, offset: 3904)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !81, file: !82, line: 108, baseType: !353, size: 64, align: 64, offset: 3968)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !81, file: !82, line: 109, baseType: !241, size: 64, align: 64, offset: 4032)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !81, file: !82, line: 111, baseType: !241, size: 64, align: 64, offset: 4096)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !81, file: !82, line: 114, baseType: !48, size: 64, align: 64, offset: 4160)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !81, file: !82, line: 116, baseType: !353, size: 64, align: 64, offset: 4224)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !81, file: !82, line: 117, baseType: !631, size: 32768, align: 64, offset: 4288)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 32768, align: 64, elements: !681)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !633, line: 10, size: 128, align: 64, elements: !634)
!633 = !DIFile(filename: "modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!634 = !{!635, !680}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !632, file: !633, line: 11, baseType: !636, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !633, line: 7, baseType: !638)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !640, !60, !59, !59, !98, !280}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !80, line: 7, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !643, line: 15, size: 1600, align: 64, elements: !644)
!643 = !DIFile(filename: "irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !642, file: !490, line: 3, baseType: !77, size: 32, align: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !642, file: !490, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !642, file: !490, line: 5, baseType: !353, size: 64, align: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !642, file: !490, line: 7, baseType: !48, size: 64, align: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !642, file: !490, line: 8, baseType: !78, size: 64, align: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !642, file: !490, line: 9, baseType: !98, size: 64, align: 64, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !642, file: !490, line: 10, baseType: !98, size: 64, align: 64, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !642, file: !490, line: 11, baseType: !325, size: 64, align: 64, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !642, file: !490, line: 12, baseType: !77, size: 32, align: 32, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !642, file: !490, line: 13, baseType: !98, size: 64, align: 64, offset: 512)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !642, file: !490, line: 15, baseType: !501, size: 64, align: 64, offset: 576)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !642, file: !490, line: 17, baseType: !508, size: 64, align: 64, offset: 640)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !642, file: !512, line: 5, baseType: !98, size: 64, align: 64, offset: 704)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !642, file: !512, line: 6, baseType: !98, size: 64, align: 64, offset: 768)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !642, file: !512, line: 7, baseType: !325, size: 64, align: 64, offset: 832)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !642, file: !512, line: 9, baseType: !353, size: 64, align: 64, offset: 896)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !642, file: !512, line: 10, baseType: !517, size: 64, align: 64, offset: 960)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !642, file: !512, line: 12, baseType: !155, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !642, file: !512, line: 13, baseType: !98, size: 64, align: 64, offset: 1088)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !642, file: !512, line: 14, baseType: !77, size: 32, align: 32, offset: 1152)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !642, file: !512, line: 15, baseType: !98, size: 64, align: 64, offset: 1216)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !642, file: !512, line: 17, baseType: !155, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !642, file: !512, line: 18, baseType: !155, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !642, file: !512, line: 19, baseType: !155, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !642, file: !512, line: 20, baseType: !155, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !642, file: !512, line: 22, baseType: !155, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !642, file: !512, line: 23, baseType: !155, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !642, file: !512, line: 24, baseType: !155, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !642, file: !512, line: 25, baseType: !155, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !642, file: !512, line: 26, baseType: !155, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !642, file: !512, line: 31, baseType: !556, size: 64, align: 64, offset: 1344)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !642, file: !643, line: 18, baseType: !241, size: 64, align: 64, offset: 1408)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !642, file: !643, line: 20, baseType: !325, size: 64, align: 64, offset: 1472)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !642, file: !643, line: 21, baseType: !77, size: 32, align: 32, offset: 1536)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !642, file: !643, line: 22, baseType: !77, size: 32, align: 32, offset: 1568)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !632, file: !633, line: 12, baseType: !59, size: 8, align: 8, offset: 64)
!681 = !{!682}
!682 = !DISubrange(count: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !81, file: !82, line: 118, baseType: !684, size: 2048, align: 8, offset: 37056)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 2048, align: 8, elements: !681)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !81, file: !82, line: 120, baseType: !567, size: 64, align: 64, offset: 39104)
!686 = !{}
!687 = !DILocalVariable(name: "server", arg: 1, scope: !73, file: !74, line: 27, type: !78)
!688 = !DIExpression()
!689 = !DILocation(line: 27, column: 33, scope: !73)
!690 = !DILocalVariable(name: "cap", arg: 2, scope: !73, file: !74, line: 27, type: !98)
!691 = !DILocation(line: 27, column: 47, scope: !73)
!692 = !DILocalVariable(name: "enable", arg: 3, scope: !73, file: !74, line: 27, type: !77)
!693 = !DILocation(line: 27, column: 56, scope: !73)
!694 = !DILocation(line: 29, column: 6, scope: !695)
!695 = distinct !DILexicalBlock(scope: !73, file: !74, line: 29, column: 6)
!696 = !DILocation(line: 29, column: 10, scope: !695)
!697 = !DILocation(line: 29, column: 17, scope: !695)
!698 = !DILocation(line: 29, column: 21, scope: !699)
!699 = !DILexicalBlockFile(scope: !695, file: !74, discriminator: 1)
!700 = !DILocation(line: 29, column: 20, scope: !699)
!701 = !DILocation(line: 29, column: 25, scope: !699)
!702 = !DILocation(line: 29, column: 6, scope: !699)
!703 = !DILocation(line: 30, column: 3, scope: !695)
!704 = !DILocation(line: 33, column: 7, scope: !705)
!705 = distinct !DILexicalBlock(scope: !73, file: !74, line: 33, column: 6)
!706 = !DILocation(line: 33, column: 15, scope: !705)
!707 = !DILocation(line: 33, column: 6, scope: !73)
!708 = !DILocation(line: 34, column: 7, scope: !709)
!709 = distinct !DILexicalBlock(scope: !710, file: !74, line: 34, column: 7)
!710 = distinct !DILexicalBlock(scope: !705, file: !74, line: 33, column: 29)
!711 = !DILocation(line: 34, column: 14, scope: !709)
!712 = !DILocation(line: 34, column: 37, scope: !713)
!713 = !DILexicalBlockFile(scope: !709, file: !74, discriminator: 1)
!714 = !DILocation(line: 34, column: 45, scope: !713)
!715 = !DILocation(line: 34, column: 56, scope: !713)
!716 = !DILocation(line: 34, column: 18, scope: !713)
!717 = !DILocation(line: 34, column: 7, scope: !713)
!718 = !DILocation(line: 35, column: 40, scope: !719)
!719 = distinct !DILexicalBlock(scope: !709, file: !74, line: 34, column: 62)
!720 = !DILocation(line: 35, column: 48, scope: !719)
!721 = !DILocation(line: 35, column: 68, scope: !719)
!722 = !DILocation(line: 35, column: 59, scope: !719)
!723 = !DILocation(line: 35, column: 24, scope: !724)
!724 = !DILexicalBlockFile(scope: !719, file: !74, discriminator: 1)
!725 = !DILocation(line: 35, column: 4, scope: !719)
!726 = !DILocation(line: 35, column: 12, scope: !719)
!727 = !DILocation(line: 35, column: 22, scope: !719)
!728 = !DILocation(line: 36, column: 4, scope: !719)
!729 = !DILocation(line: 38, column: 13, scope: !730)
!730 = distinct !DILexicalBlock(scope: !709, file: !74, line: 38, column: 12)
!731 = !DILocation(line: 38, column: 20, scope: !730)
!732 = !DILocation(line: 38, column: 42, scope: !733)
!733 = !DILexicalBlockFile(scope: !730, file: !74, discriminator: 1)
!734 = !DILocation(line: 38, column: 50, scope: !733)
!735 = !DILocation(line: 38, column: 61, scope: !733)
!736 = !DILocation(line: 38, column: 23, scope: !733)
!737 = !DILocation(line: 38, column: 12, scope: !733)
!738 = !DILocation(line: 39, column: 45, scope: !739)
!739 = distinct !DILexicalBlock(scope: !730, file: !74, line: 38, column: 67)
!740 = !DILocation(line: 39, column: 53, scope: !739)
!741 = !DILocation(line: 39, column: 64, scope: !739)
!742 = !DILocation(line: 39, column: 24, scope: !739)
!743 = !DILocation(line: 39, column: 4, scope: !739)
!744 = !DILocation(line: 39, column: 12, scope: !739)
!745 = !DILocation(line: 39, column: 22, scope: !739)
!746 = !DILocation(line: 40, column: 4, scope: !739)
!747 = !DILocation(line: 43, column: 3, scope: !710)
!748 = !DILocation(line: 46, column: 6, scope: !749)
!749 = distinct !DILexicalBlock(scope: !73, file: !74, line: 46, column: 6)
!750 = !DILocation(line: 46, column: 13, scope: !749)
!751 = !DILocation(line: 46, column: 36, scope: !752)
