; ModuleID = './line97-tls.o.i'
source_filename = "./line97-tls.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._TLS_REC = type { i8*, i8*, i64, i8*, i8*, i8*, i64, i8*, i8*, i8*, i8*, i8*, i64, %struct._GSList* }
%struct._GSList = type { i8*, %struct._GSList* }
%struct._TLS_CERT_REC = type { %struct._GSList*, %struct._GSList* }
%struct._TLS_CERT_ENTRY_REC = type { i8*, i8* }

@__func__.tls_create_rec = private unnamed_addr constant [15 x i8] c"tls_create_rec\00", align 1
@.str = private unnamed_addr constant [12 x i8] c"rec != NULL\00", align 1
@__func__.tls_rec_set_protocol_version = private unnamed_addr constant [29 x i8] c"tls_rec_set_protocol_version\00", align 1
@.str.1 = private unnamed_addr constant [16 x i8] c"tls_rec != NULL\00", align 1
@__func__.tls_rec_set_cipher = private unnamed_addr constant [19 x i8] c"tls_rec_set_cipher\00", align 1
@__func__.tls_rec_set_cipher_size = private unnamed_addr constant [24 x i8] c"tls_rec_set_cipher_size\00", align 1
@__func__.tls_rec_set_public_key_algorithm = private unnamed_addr constant [33 x i8] c"tls_rec_set_public_key_algorithm\00", align 1
@__func__.tls_rec_set_public_key_fingerprint = private unnamed_addr constant [35 x i8] c"tls_rec_set_public_key_fingerprint\00", align 1
@__func__.tls_rec_set_public_key_fingerprint_algorithm = private unnamed_addr constant [45 x i8] c"tls_rec_set_public_key_fingerprint_algorithm\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "line97-tls.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{}
!3 = !{!4, !36, !38, !40, !42, !46, !52}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "TLS_REC", file: !6, line: 26, baseType: !7)
!6 = !DIFile(filename: "tls.h", directory: "/home/lichi/Desktop/irssi/task1")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TLS_REC", file: !6, line: 30, size: 896, align: 64, elements: !8)
!8 = !{!9, !12, !13, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_version", scope: !7, file: !6, line: 31, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !7, file: !6, line: 32, baseType: !10, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_size", scope: !7, file: !6, line: 33, baseType: !14, size: 64, align: 64, offset: 128)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !15, line: 216, baseType: !16)
!15 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/irssi/task1")
!16 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "public_key_algorithm", scope: !7, file: !6, line: 35, baseType: !10, size: 64, align: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "public_key_fingerprint", scope: !7, file: !6, line: 36, baseType: !10, size: 64, align: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "public_key_fingerprint_algorithm", scope: !7, file: !6, line: 37, baseType: !10, size: 64, align: 64, offset: 320)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "public_key_size", scope: !7, file: !6, line: 38, baseType: !14, size: 64, align: 64, offset: 384)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "certificate_fingerprint", scope: !7, file: !6, line: 40, baseType: !10, size: 64, align: 64, offset: 448)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "certificate_fingerprint_algorithm", scope: !7, file: !6, line: 41, baseType: !10, size: 64, align: 64, offset: 512)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "not_after", scope: !7, file: !6, line: 43, baseType: !10, size: 64, align: 64, offset: 576)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "not_before", scope: !7, file: !6, line: 44, baseType: !10, size: 64, align: 64, offset: 640)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ephemeral_key_algorithm", scope: !7, file: !6, line: 46, baseType: !10, size: 64, align: 64, offset: 704)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ephemeral_key_size", scope: !7, file: !6, line: 47, baseType: !14, size: 64, align: 64, offset: 768)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "certs", scope: !7, file: !6, line: 49, baseType: !28, size: 64, align: 64, offset: 832)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !30, line: 37, baseType: !31)
!30 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !30, line: 39, size: 128, align: 64, elements: !32)
!32 = !{!33, !37}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !31, file: !30, line: 41, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !35, line: 77, baseType: !36)
!35 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !30, line: 42, baseType: !28, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !35, line: 46, baseType: !11)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !35, line: 88, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !34, !34}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "TLS_CERT_REC", file: !6, line: 27, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TLS_CERT_REC", file: !6, line: 52, size: 128, align: 64, elements: !49)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "subject", scope: !48, file: !6, line: 53, baseType: !28, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !48, file: !6, line: 54, baseType: !28, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "TLS_CERT_ENTRY_REC", file: !6, line: 28, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TLS_CERT_ENTRY_REC", file: !6, line: 57, size: 128, align: 64, elements: !55)
!55 = !{!56, !57}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !54, file: !6, line: 58, baseType: !10, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !54, file: !6, line: 59, baseType: !10, size: 64, align: 64, offset: 64)
!58 = !{i32 2, !"Dwarf Version", i32 4}
!59 = !{i32 2, !"Debug Info Version", i32 3}
!60 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!61 = distinct !DISubprogram(name: "tls_create_rec", scope: !62, file: !62, line: 23, type: !63, isLocal: false, isDefinition: true, scopeLine: 24, isOptimized: false, unit: !0, variables: !2)
!62 = !DIFile(filename: "tls.c", directory: "/home/lichi/Desktop/irssi/task1")
!63 = !DISubroutineType(types: !64)
!64 = !{!4}
!65 = !DILocalVariable(name: "rec", scope: !61, file: !62, line: 25, type: !4)
!66 = !DIExpression()
!67 = !DILocation(line: 25, column: 11, scope: !61)
!68 = !DILocation(line: 25, column: 30, scope: !61)
!69 = !DILocation(line: 25, column: 18, scope: !61)
!70 = !DILocation(line: 26, column: 2, scope: !61)
!71 = distinct !{!71, !70}
!72 = !DILocation(line: 26, column: 10, scope: !73)
!73 = !DILexicalBlockFile(scope: !74, file: !62, discriminator: 1)
!74 = distinct !DILexicalBlock(scope: !75, file: !62, line: 26, column: 10)
!75 = distinct !DILexicalBlock(scope: !61, file: !62, line: 26, column: 4)
!76 = !DILocation(line: 26, column: 14, scope: !73)
!77 = !DILocation(line: 26, column: 5, scope: !78)
!78 = !DILexicalBlockFile(scope: !79, file: !62, discriminator: 2)
!79 = distinct !DILexicalBlock(scope: !74, file: !62, line: 26, column: 3)
!80 = !DILocation(line: 26, column: 14, scope: !81)
!81 = !DILexicalBlockFile(scope: !82, file: !62, discriminator: 3)
!82 = distinct !DILexicalBlock(scope: !74, file: !62, line: 26, column: 12)
!83 = !DILocation(line: 26, column: 98, scope: !81)
!84 = !DILocation(line: 26, column: 7, scope: !85)
!85 = !DILexicalBlockFile(scope: !75, file: !62, discriminator: 4)
!86 = !DILocation(line: 28, column: 9, scope: !61)
!87 = !DILocation(line: 28, column: 2, scope: !61)
!88 = !DILocation(line: 29, column: 1, scope: !61)
!89 = distinct !DISubprogram(name: "tls_rec_free", scope: !62, file: !62, line: 31, type: !90, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !4}
!92 = !DILocalVariable(name: "tls_rec", arg: 1, scope: !89, file: !62, line: 31, type: !4)
!93 = !DILocation(line: 31, column: 28, scope: !89)
!94 = !DILocation(line: 33, column: 6, scope: !95)
!95 = distinct !DILexicalBlock(scope: !89, file: !62, line: 33, column: 6)
!96 = !DILocation(line: 33, column: 14, scope: !95)
!97 = !DILocation(line: 33, column: 6, scope: !89)
!98 = !DILocation(line: 34, column: 3, scope: !95)
!99 = !DILocation(line: 36, column: 2, scope: !89)
!100 = distinct !{!100, !99}
!101 = !DILocation(line: 36, column: 11, scope: !102)
!102 = !DILexicalBlockFile(scope: !103, file: !62, discriminator: 1)
!103 = distinct !DILexicalBlock(scope: !104, file: !62, line: 36, column: 11)
!104 = distinct !DILexicalBlock(scope: !89, file: !62, line: 36, column: 5)
!105 = !DILocation(line: 36, column: 20, scope: !102)
!106 = !DILocation(line: 36, column: 47, scope: !107)
!107 = !DILexicalBlockFile(scope: !108, file: !62, discriminator: 2)
!108 = distinct !DILexicalBlock(scope: !103, file: !62, line: 36, column: 38)
!109 = !DILocation(line: 36, column: 56, scope: !107)
!110 = !DILocation(line: 36, column: 40, scope: !107)
!111 = !DILocation(line: 36, column: 76, scope: !107)
!112 = !DILocation(line: 36, column: 85, scope: !107)
!113 = !DILocation(line: 36, column: 103, scope: !107)
!114 = !DILocation(line: 36, column: 3, scope: !107)
!115 = !DILocation(line: 36, column: 5, scope: !116)
!116 = !DILexicalBlockFile(scope: !104, file: !62, discriminator: 3)
!117 = !DILocation(line: 37, column: 2, scope: !89)
!118 = distinct !{!118, !117}
!119 = !DILocation(line: 37, column: 11, scope: !120)
!120 = !DILexicalBlockFile(scope: !121, file: !62, discriminator: 1)
!121 = distinct !DILexicalBlock(scope: !122, file: !62, line: 37, column: 11)
