; ModuleID = './line170-dcc-send.o.i'
source_filename = "./line170-dcc-send.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.SEND_DCC_REC = type { i32, i32, i64, %struct._IRC_SERVER_REC*, i8*, i8*, i8*, %struct.CHAT_DCC_REC*, i8*, i8*, %struct._IPADDR, [46 x i8], i32, %struct._GIOChannel*, i32, i32, i32, i64, i64, i32, i8, %struct._GHashTable*, i64, i64, i32, i32, [4 x i8], i32, i8 }

!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 51, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46}
!38 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!39 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!40 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!41 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!42 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!43 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!44 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!45 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!46 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 25, size: 32, align: 32, elements: !49)
!48 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!50 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!51 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!52 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!53 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!54 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!55 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!56 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!57 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!58 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!59 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!60 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!61 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!62 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!63 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!64 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!65 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!66 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!67 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 6, size: 32, align: 32, elements: !70)
!69 = !DIFile(filename: "dcc-queue.h", directory: "/home/lichi/Desktop/irssi/task1")
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "DCC_QUEUE_NORMAL", value: 0)
!72 = !DIEnumerator(name: "DCC_QUEUE_PREPEND", value: 1)
!73 = !DIEnumerator(name: "DCC_QUEUE_APPEND", value: 2)
!74 = !{!75, !82, !83, !99, !446, !238, !436, !195, !534, !818, !822}
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !76, line: 9, baseType: !77)
!76 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !80, !80, !80, !80, !80, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "SEND_DCC_REC", file: !85, line: 20, baseType: !86)
!85 = !DIFile(filename: "dcc-send.h", directory: "/home/lichi/Desktop/irssi/task1")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 12, size: 1920, align: 64, elements: !87)
!87 = !{!88, !91, !92, !98, !753, !754, !755, !756, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !809, !810, !811, !812, !814, !815, !816, !817}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !86, file: !89, line: 1, baseType: !90, size: 32, align: 32)
!89 = !DIFile(filename: "dcc-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!90 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !86, file: !89, line: 2, baseType: !90, size: 32, align: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !86, file: !89, line: 3, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !94, line: 75, baseType: !95)
!94 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !96, line: 139, baseType: !97)
!96 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!97 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !86, file: !89, line: 5, baseType: !99, size: 64, align: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !101, line: 6, baseType: !102)
!101 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !103, line: 42, size: 39168, align: 64, elements: !104)
!103 = !DIFile(filename: "../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!104 = !{!105, !107, !108, !109, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !408, !409, !413, !414, !415, !419, !424, !425, !426, !427, !428, !429, !430, !431, !438, !439, !440, !441, !442, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !750, !752}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !102, file: !106, line: 3, baseType: !90, size: 32, align: 32)
!106 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!107 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !102, file: !106, line: 4, baseType: !90, size: 32, align: 32, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !102, file: !106, line: 6, baseType: !90, size: 32, align: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !102, file: !106, line: 8, baseType: !110, size: 64, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !101, line: 5, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !103, line: 24, size: 2496, align: 64, elements: !113)
!113 = !{!114, !116, !117, !118, !121, !122, !123, !124, !125, !127, !128, !129, !130, !131, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !112, file: !115, line: 3, baseType: !90, size: 32, align: 32)
!115 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!116 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !112, file: !115, line: 4, baseType: !90, size: 32, align: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !112, file: !115, line: 6, baseType: !90, size: 32, align: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !112, file: !115, line: 9, baseType: !119, size: 64, align: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !112, file: !115, line: 10, baseType: !90, size: 32, align: 32, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !112, file: !115, line: 11, baseType: !119, size: 64, align: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !112, file: !115, line: 11, baseType: !119, size: 64, align: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !112, file: !115, line: 11, baseType: !119, size: 64, align: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !112, file: !115, line: 13, baseType: !126, size: 16, align: 16, offset: 448)
!126 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !112, file: !115, line: 14, baseType: !119, size: 64, align: 64, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !112, file: !115, line: 15, baseType: !119, size: 64, align: 64, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !112, file: !115, line: 16, baseType: !90, size: 32, align: 32, offset: 640)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !112, file: !115, line: 17, baseType: !119, size: 64, align: 64, offset: 704)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !112, file: !115, line: 19, baseType: !132, size: 64, align: 64, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !134, line: 99, baseType: !135)
!134 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !136, line: 22, size: 160, align: 32, elements: !137)
!136 = !DIFile(filename: "../../../src/core/network.h", directory: "/home/lichi/Desktop/irssi/task1")
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !135, file: !136, line: 23, baseType: !126, size: 16, align: 16)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !135, file: !136, line: 24, baseType: !140, size: 128, align: 32, offset: 32)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !141, line: 211, size: 128, align: 32, elements: !142)
!141 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!142 = !{!143}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !140, file: !141, line: 220, baseType: !144, size: 128, align: 32)
!144 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !140, file: !141, line: 213, size: 128, align: 32, elements: !145)
!145 = !{!146, !153, !158}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !144, file: !141, line: 215, baseType: !147, size: 128, align: 8)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 128, align: 8, elements: !151)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !149, line: 48, baseType: !150)
!149 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!150 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!151 = !{!152}
!152 = !DISubrange(count: 16)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !144, file: !141, line: 217, baseType: !154, size: 128, align: 16)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 128, align: 16, elements: !156)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !149, line: 49, baseType: !126)
!156 = !{!157}
!157 = !DISubrange(count: 8)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !144, file: !141, line: 218, baseType: !159, size: 128, align: 32)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 128, align: 32, elements: !162)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !149, line: 51, baseType: !161)
!161 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!162 = !{!163}
!163 = !DISubrange(count: 4)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !112, file: !115, line: 19, baseType: !132, size: 64, align: 64, offset: 832)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !112, file: !115, line: 21, baseType: !119, size: 64, align: 64, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !112, file: !115, line: 22, baseType: !119, size: 64, align: 64, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !112, file: !115, line: 23, baseType: !119, size: 64, align: 64, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !112, file: !115, line: 24, baseType: !119, size: 64, align: 64, offset: 1088)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !112, file: !115, line: 26, baseType: !119, size: 64, align: 64, offset: 1152)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !112, file: !115, line: 27, baseType: !119, size: 64, align: 64, offset: 1216)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !112, file: !115, line: 28, baseType: !119, size: 64, align: 64, offset: 1280)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !112, file: !115, line: 29, baseType: !119, size: 64, align: 64, offset: 1344)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !112, file: !115, line: 30, baseType: !119, size: 64, align: 64, offset: 1408)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !112, file: !115, line: 31, baseType: !119, size: 64, align: 64, offset: 1472)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !112, file: !115, line: 32, baseType: !119, size: 64, align: 64, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !112, file: !115, line: 33, baseType: !119, size: 64, align: 64, offset: 1600)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !112, file: !115, line: 35, baseType: !178, size: 64, align: 64, offset: 1664)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !181)
!181 = !{!182, !185, !327, !328, !333, !334, !335, !336, !337, !346, !347, !348, !352, !353, !354, !355, !356, !357, !358, !359}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !180, file: !4, line: 100, baseType: !183, size: 32, align: 32)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !184, line: 49, baseType: !90)
!184 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!185 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !180, file: !4, line: 101, baseType: !186, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !189)
!189 = !{!190, !213, !219, !225, !229, !314, !318, !323}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !188, file: !4, line: 133, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!194, !178, !195, !197, !200, !201}
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !184, line: 46, baseType: !120)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !198, line: 66, baseType: !199)
!198 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!199 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !204, line: 42, baseType: !205)
!204 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !204, line: 44, size: 128, align: 64, elements: !206)
!206 = !{!207, !211, !212}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !205, file: !204, line: 46, baseType: !208, size: 32, align: 32)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !209, line: 36, baseType: !210)
!209 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !198, line: 45, baseType: !161)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !205, file: !204, line: 47, baseType: !183, size: 32, align: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !205, file: !204, line: 48, baseType: !195, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !188, file: !4, line: 138, baseType: !214, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!194, !178, !217, !197, !200, !201}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !188, file: !4, line: 143, baseType: !220, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!194, !178, !223, !224, !201}
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !198, line: 51, baseType: !97)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !188, file: !4, line: 147, baseType: !226, size: 64, align: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!194, !178, !201}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !188, file: !4, line: 149, baseType: !230, size: 64, align: 64, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!233, !178, !313}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !236)
!236 = !{!237, !239, !260, !289, !291, !295, !296, !297, !298, !306, !307, !308, !309}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !235, file: !16, line: 174, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !184, line: 77, baseType: !82)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !235, file: !16, line: 175, baseType: !240, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !243)
!243 = !{!244, !248, !249}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !242, file: !16, line: 198, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !238}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !242, file: !16, line: 199, baseType: !245, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !242, file: !16, line: 200, baseType: !250, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !238, !233, !253, !259}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!258, !238}
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !184, line: 50, baseType: !183)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !235, file: !16, line: 177, baseType: !261, size: 64, align: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !265)
!265 = !{!266, !271, !275, !279, !283, !284}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !264, file: !16, line: 216, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!258, !233, !270}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !264, file: !16, line: 218, baseType: !272, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!258, !233}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !264, file: !16, line: 219, baseType: !276, size: 64, align: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!258, !233, !254, !238}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !264, file: !16, line: 222, baseType: !280, size: 64, align: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !233}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !264, file: !16, line: 226, baseType: !254, size: 64, align: 64, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !264, file: !16, line: 227, baseType: !285, size: 64, align: 64, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{null}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !235, file: !16, line: 178, baseType: !290, size: 32, align: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !184, line: 55, baseType: !161)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !235, file: !16, line: 180, baseType: !292, size: 64, align: 64, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !294)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !235, file: !16, line: 182, baseType: !183, size: 32, align: 32, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !235, file: !16, line: 183, baseType: !290, size: 32, align: 32, offset: 352)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !235, file: !16, line: 184, baseType: !290, size: 32, align: 32, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !235, file: !16, line: 186, baseType: !299, size: 64, align: 64, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !301, line: 37, baseType: !302)
!301 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !301, line: 39, size: 128, align: 64, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !302, file: !301, line: 41, baseType: !238, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !302, file: !301, line: 42, baseType: !299, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !235, file: !16, line: 188, baseType: !233, size: 64, align: 64, offset: 512)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !235, file: !16, line: 189, baseType: !233, size: 64, align: 64, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !235, file: !16, line: 191, baseType: !119, size: 64, align: 64, offset: 640)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !235, file: !16, line: 193, baseType: !310, size: 64, align: 64, offset: 704)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !312)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !188, file: !4, line: 151, baseType: !315, size: 64, align: 64, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !178}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !188, file: !4, line: 152, baseType: !319, size: 64, align: 64, offset: 384)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!194, !178, !322, !201}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !188, file: !4, line: 155, baseType: !324, size: 64, align: 64, offset: 448)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!322, !178}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !180, file: !4, line: 103, baseType: !195, size: 64, align: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !180, file: !4, line: 104, baseType: !329, size: 64, align: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !330, line: 77, baseType: !331)
!330 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !330, line: 77, flags: DIFlagFwdDecl)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !180, file: !4, line: 105, baseType: !329, size: 64, align: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !180, file: !4, line: 106, baseType: !195, size: 64, align: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !180, file: !4, line: 107, baseType: !290, size: 32, align: 32, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !180, file: !4, line: 109, baseType: !197, size: 64, align: 64, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !180, file: !4, line: 110, baseType: !338, size: 64, align: 64, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !340, line: 39, baseType: !341)
!340 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !340, line: 41, size: 192, align: 64, elements: !342)
!342 = !{!343, !344, !345}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !341, file: !340, line: 43, baseType: !195, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !341, file: !340, line: 44, baseType: !197, size: 64, align: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !341, file: !340, line: 45, baseType: !197, size: 64, align: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !180, file: !4, line: 111, baseType: !338, size: 64, align: 64, offset: 576)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !180, file: !4, line: 112, baseType: !338, size: 64, align: 64, offset: 640)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !180, file: !4, line: 113, baseType: !349, size: 48, align: 8, offset: 704)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 48, align: 8, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 6)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !180, file: !4, line: 117, baseType: !290, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !180, file: !4, line: 118, baseType: !290, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !180, file: !4, line: 119, baseType: !290, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !180, file: !4, line: 120, baseType: !290, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !180, file: !4, line: 121, baseType: !290, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !180, file: !4, line: 122, baseType: !290, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !180, file: !4, line: 124, baseType: !238, size: 64, align: 64, offset: 768)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !180, file: !4, line: 125, baseType: !238, size: 64, align: 64, offset: 832)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !112, file: !115, line: 38, baseType: !161, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !112, file: !115, line: 39, baseType: !161, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !112, file: !115, line: 40, baseType: !161, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !112, file: !115, line: 41, baseType: !161, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !112, file: !115, line: 42, baseType: !161, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !112, file: !115, line: 43, baseType: !161, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !112, file: !115, line: 44, baseType: !161, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !112, file: !115, line: 45, baseType: !161, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !112, file: !115, line: 46, baseType: !119, size: 64, align: 64, offset: 1792)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !112, file: !115, line: 47, baseType: !119, size: 64, align: 64, offset: 1856)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !112, file: !103, line: 27, baseType: !119, size: 64, align: 64, offset: 1920)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !112, file: !103, line: 28, baseType: !119, size: 64, align: 64, offset: 1984)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !112, file: !103, line: 30, baseType: !90, size: 32, align: 32, offset: 2048)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !112, file: !103, line: 31, baseType: !119, size: 64, align: 64, offset: 2112)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !112, file: !103, line: 32, baseType: !119, size: 64, align: 64, offset: 2176)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !112, file: !103, line: 34, baseType: !90, size: 32, align: 32, offset: 2240)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !112, file: !103, line: 35, baseType: !90, size: 32, align: 32, offset: 2272)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !112, file: !103, line: 36, baseType: !90, size: 32, align: 32, offset: 2304)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !112, file: !103, line: 38, baseType: !90, size: 32, align: 32, offset: 2336)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !112, file: !103, line: 38, baseType: !90, size: 32, align: 32, offset: 2368)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !112, file: !103, line: 38, baseType: !90, size: 32, align: 32, offset: 2400)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !112, file: !103, line: 38, baseType: !90, size: 32, align: 32, offset: 2432)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !102, file: !106, line: 9, baseType: !93, size: 64, align: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !102, file: !106, line: 10, baseType: !93, size: 64, align: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !102, file: !106, line: 12, baseType: !119, size: 64, align: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !102, file: !106, line: 13, baseType: !119, size: 64, align: 64, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !102, file: !106, line: 15, baseType: !161, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !102, file: !106, line: 16, baseType: !161, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !102, file: !106, line: 17, baseType: !161, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !102, file: !106, line: 18, baseType: !161, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !102, file: !106, line: 19, baseType: !161, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !102, file: !106, line: 21, baseType: !392, size: 64, align: 64, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !134, line: 102, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !395, line: 7, size: 384, align: 64, elements: !396)
!395 = !DIFile(filename: "../../../src/core/net-sendbuffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!396 = !{!397, !398, !402, !403, !404, !405, !406, !407}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !394, file: !395, line: 8, baseType: !178, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "readbuffer", scope: !394, file: !395, line: 9, baseType: !399, size: 64, align: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINEBUF_REC", file: !134, line: 101, baseType: !401)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LINEBUF_REC", file: !134, line: 101, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "send_tag", scope: !394, file: !395, line: 11, baseType: !90, size: 32, align: 32, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !394, file: !395, line: 12, baseType: !90, size: 32, align: 32, offset: 160)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !394, file: !395, line: 13, baseType: !90, size: 32, align: 32, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !394, file: !395, line: 14, baseType: !119, size: 64, align: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "def_bufsize", scope: !394, file: !395, line: 15, baseType: !90, size: 32, align: 32, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dead", scope: !394, file: !395, line: 16, baseType: !161, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !102, file: !106, line: 22, baseType: !90, size: 32, align: 32, offset: 576)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !102, file: !106, line: 25, baseType: !410, size: 128, align: 64, offset: 640)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 128, align: 64, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 2)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !102, file: !106, line: 26, baseType: !90, size: 32, align: 32, offset: 768)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !102, file: !106, line: 27, baseType: !90, size: 32, align: 32, offset: 800)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !102, file: !106, line: 29, baseType: !416, size: 64, align: 64, offset: 832)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !134, line: 103, baseType: !418)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !134, line: 103, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !102, file: !106, line: 30, baseType: !420, size: 64, align: 64, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !422, line: 37, baseType: !423)
!422 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !422, line: 37, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !102, file: !106, line: 32, baseType: !119, size: 64, align: 64, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !102, file: !106, line: 33, baseType: !119, size: 64, align: 64, offset: 1024)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !102, file: !106, line: 34, baseType: !119, size: 64, align: 64, offset: 1088)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !102, file: !106, line: 35, baseType: !161, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !102, file: !106, line: 36, baseType: !161, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !102, file: !106, line: 37, baseType: !161, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !102, file: !106, line: 38, baseType: !161, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !102, file: !106, line: 40, baseType: !432, size: 128, align: 64, offset: 1216)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !184, line: 504, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !184, line: 506, size: 128, align: 64, elements: !434)
!434 = !{!435, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !433, file: !184, line: 508, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !184, line: 48, baseType: !97)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !433, file: !184, line: 509, baseType: !436, size: 64, align: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !102, file: !106, line: 41, baseType: !93, size: 64, align: 64, offset: 1344)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !102, file: !106, line: 42, baseType: !90, size: 32, align: 32, offset: 1408)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !102, file: !106, line: 44, baseType: !299, size: 64, align: 64, offset: 1472)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !102, file: !106, line: 45, baseType: !299, size: 64, align: 64, offset: 1536)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !102, file: !106, line: 53, baseType: !443, size: 64, align: 64, offset: 1600)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{null, !446, !534, !90}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !134, line: 107, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !449, line: 30, size: 2240, align: 64, elements: !450)
!449 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!450 = !{!451, !452, !453, !454, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !530, !536, !540, !544, !549, !626, !633, !637}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !448, file: !106, line: 3, baseType: !90, size: 32, align: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !448, file: !106, line: 4, baseType: !90, size: 32, align: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !448, file: !106, line: 6, baseType: !90, size: 32, align: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !448, file: !106, line: 8, baseType: !455, size: 64, align: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !134, line: 113, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !449, line: 25, size: 1920, align: 64, elements: !458)
!458 = !{!459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !457, file: !115, line: 3, baseType: !90, size: 32, align: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !457, file: !115, line: 4, baseType: !90, size: 32, align: 32, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !457, file: !115, line: 6, baseType: !90, size: 32, align: 32, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !457, file: !115, line: 9, baseType: !119, size: 64, align: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !457, file: !115, line: 10, baseType: !90, size: 32, align: 32, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !457, file: !115, line: 11, baseType: !119, size: 64, align: 64, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !457, file: !115, line: 11, baseType: !119, size: 64, align: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !457, file: !115, line: 11, baseType: !119, size: 64, align: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !457, file: !115, line: 13, baseType: !126, size: 16, align: 16, offset: 448)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !457, file: !115, line: 14, baseType: !119, size: 64, align: 64, offset: 512)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !457, file: !115, line: 15, baseType: !119, size: 64, align: 64, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !457, file: !115, line: 16, baseType: !90, size: 32, align: 32, offset: 640)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !457, file: !115, line: 17, baseType: !119, size: 64, align: 64, offset: 704)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !457, file: !115, line: 19, baseType: !132, size: 64, align: 64, offset: 768)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !457, file: !115, line: 19, baseType: !132, size: 64, align: 64, offset: 832)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !457, file: !115, line: 21, baseType: !119, size: 64, align: 64, offset: 896)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !457, file: !115, line: 22, baseType: !119, size: 64, align: 64, offset: 960)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !457, file: !115, line: 23, baseType: !119, size: 64, align: 64, offset: 1024)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !457, file: !115, line: 24, baseType: !119, size: 64, align: 64, offset: 1088)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !457, file: !115, line: 26, baseType: !119, size: 64, align: 64, offset: 1152)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !457, file: !115, line: 27, baseType: !119, size: 64, align: 64, offset: 1216)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !457, file: !115, line: 28, baseType: !119, size: 64, align: 64, offset: 1280)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !457, file: !115, line: 29, baseType: !119, size: 64, align: 64, offset: 1344)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !457, file: !115, line: 30, baseType: !119, size: 64, align: 64, offset: 1408)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !457, file: !115, line: 31, baseType: !119, size: 64, align: 64, offset: 1472)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !457, file: !115, line: 32, baseType: !119, size: 64, align: 64, offset: 1536)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !457, file: !115, line: 33, baseType: !119, size: 64, align: 64, offset: 1600)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !457, file: !115, line: 35, baseType: !178, size: 64, align: 64, offset: 1664)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !457, file: !115, line: 38, baseType: !161, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !457, file: !115, line: 39, baseType: !161, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !457, file: !115, line: 40, baseType: !161, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !457, file: !115, line: 41, baseType: !161, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !457, file: !115, line: 42, baseType: !161, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !457, file: !115, line: 43, baseType: !161, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !457, file: !115, line: 44, baseType: !161, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !457, file: !115, line: 45, baseType: !161, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !457, file: !115, line: 46, baseType: !119, size: 64, align: 64, offset: 1792)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !457, file: !115, line: 47, baseType: !119, size: 64, align: 64, offset: 1856)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !448, file: !106, line: 9, baseType: !93, size: 64, align: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !448, file: !106, line: 10, baseType: !93, size: 64, align: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !448, file: !106, line: 12, baseType: !119, size: 64, align: 64, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !448, file: !106, line: 13, baseType: !119, size: 64, align: 64, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !448, file: !106, line: 15, baseType: !161, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !448, file: !106, line: 16, baseType: !161, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !448, file: !106, line: 17, baseType: !161, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !448, file: !106, line: 18, baseType: !161, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !448, file: !106, line: 19, baseType: !161, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !448, file: !106, line: 21, baseType: !392, size: 64, align: 64, offset: 512)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !448, file: !106, line: 22, baseType: !90, size: 32, align: 32, offset: 576)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !448, file: !106, line: 25, baseType: !410, size: 128, align: 64, offset: 640)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !448, file: !106, line: 26, baseType: !90, size: 32, align: 32, offset: 768)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !448, file: !106, line: 27, baseType: !90, size: 32, align: 32, offset: 800)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !448, file: !106, line: 29, baseType: !416, size: 64, align: 64, offset: 832)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !448, file: !106, line: 30, baseType: !420, size: 64, align: 64, offset: 896)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !448, file: !106, line: 32, baseType: !119, size: 64, align: 64, offset: 960)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !448, file: !106, line: 33, baseType: !119, size: 64, align: 64, offset: 1024)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !448, file: !106, line: 34, baseType: !119, size: 64, align: 64, offset: 1088)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !448, file: !106, line: 35, baseType: !161, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !448, file: !106, line: 36, baseType: !161, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !448, file: !106, line: 37, baseType: !161, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !448, file: !106, line: 38, baseType: !161, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !448, file: !106, line: 40, baseType: !432, size: 128, align: 64, offset: 1216)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !448, file: !106, line: 41, baseType: !93, size: 64, align: 64, offset: 1344)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !448, file: !106, line: 42, baseType: !90, size: 32, align: 32, offset: 1408)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !448, file: !106, line: 44, baseType: !299, size: 64, align: 64, offset: 1472)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !448, file: !106, line: 45, baseType: !299, size: 64, align: 64, offset: 1536)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !448, file: !106, line: 53, baseType: !443, size: 64, align: 64, offset: 1600)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !448, file: !106, line: 55, baseType: !527, size: 64, align: 64, offset: 1664)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!90, !446, !120}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !448, file: !106, line: 57, baseType: !531, size: 64, align: 64, offset: 1728)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!90, !446, !534}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !448, file: !106, line: 60, baseType: !537, size: 64, align: 64, offset: 1792)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!534, !446}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !448, file: !106, line: 62, baseType: !541, size: 64, align: 64, offset: 1856)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !446, !534, !534, !90}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !448, file: !106, line: 65, baseType: !545, size: 64, align: 64, offset: 1920)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!548, !446, !534, !534}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !448, file: !106, line: 69, baseType: !550, size: 64, align: 64, offset: 1984)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!553, !446, !534}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !134, line: 109, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !556, line: 15, size: 1408, align: 64, elements: !557)
!556 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!557 = !{!558, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !576, !580, !582, !583, !584, !585, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !555, file: !559, line: 3, baseType: !90, size: 32, align: 32)
!559 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!560 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !555, file: !559, line: 4, baseType: !90, size: 32, align: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !555, file: !559, line: 5, baseType: !420, size: 64, align: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !555, file: !559, line: 7, baseType: !82, size: 64, align: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !555, file: !559, line: 8, baseType: !446, size: 64, align: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !555, file: !559, line: 9, baseType: !119, size: 64, align: 64, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !555, file: !559, line: 10, baseType: !119, size: 64, align: 64, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !555, file: !559, line: 11, baseType: !93, size: 64, align: 64, offset: 384)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !555, file: !559, line: 12, baseType: !90, size: 32, align: 32, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !555, file: !559, line: 13, baseType: !119, size: 64, align: 64, offset: 512)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !555, file: !559, line: 15, baseType: !570, size: 64, align: 64, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, align: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !573}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !134, line: 108, baseType: !575)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !134, line: 108, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !555, file: !559, line: 17, baseType: !577, size: 64, align: 64, offset: 640)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!534, !573}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !555, file: !581, line: 5, baseType: !119, size: 64, align: 64, offset: 704)
!581 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!582 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !555, file: !581, line: 6, baseType: !119, size: 64, align: 64, offset: 768)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !555, file: !581, line: 7, baseType: !93, size: 64, align: 64, offset: 832)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !555, file: !581, line: 9, baseType: !420, size: 64, align: 64, offset: 896)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !555, file: !581, line: 10, baseType: !586, size: 64, align: 64, offset: 960)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !134, line: 111, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !589, line: 13, size: 576, align: 64, elements: !590)
!589 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!590 = !{!591, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !607, !608}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !588, file: !592, line: 3, baseType: !90, size: 32, align: 32)
!592 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!593 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !588, file: !592, line: 4, baseType: !90, size: 32, align: 32, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !588, file: !592, line: 6, baseType: !93, size: 64, align: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !588, file: !592, line: 8, baseType: !119, size: 64, align: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !588, file: !592, line: 9, baseType: !119, size: 64, align: 64, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !588, file: !592, line: 10, baseType: !119, size: 64, align: 64, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !588, file: !592, line: 11, baseType: !90, size: 32, align: 32, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !588, file: !592, line: 14, baseType: !161, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !588, file: !592, line: 15, baseType: !161, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !588, file: !592, line: 18, baseType: !161, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !588, file: !592, line: 19, baseType: !161, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !588, file: !592, line: 20, baseType: !161, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !588, file: !592, line: 21, baseType: !161, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !588, file: !592, line: 22, baseType: !606, size: 64, align: 8, offset: 360)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, align: 8, elements: !156)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !588, file: !592, line: 26, baseType: !82, size: 64, align: 64, offset: 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !588, file: !592, line: 28, baseType: !586, size: 64, align: 64, offset: 512)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !555, file: !581, line: 12, baseType: !161, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !555, file: !581, line: 13, baseType: !119, size: 64, align: 64, offset: 1088)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !555, file: !581, line: 14, baseType: !90, size: 32, align: 32, offset: 1152)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !555, file: !581, line: 15, baseType: !119, size: 64, align: 64, offset: 1216)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !555, file: !581, line: 17, baseType: !161, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !555, file: !581, line: 18, baseType: !161, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !555, file: !581, line: 19, baseType: !161, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !555, file: !581, line: 20, baseType: !161, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !555, file: !581, line: 22, baseType: !161, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !555, file: !581, line: 23, baseType: !161, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !555, file: !581, line: 24, baseType: !161, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !555, file: !581, line: 25, baseType: !161, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !555, file: !581, line: 26, baseType: !161, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !555, file: !581, line: 31, baseType: !623, size: 64, align: 64, offset: 1344)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!119, !553}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !448, file: !106, line: 70, baseType: !627, size: 64, align: 64, offset: 2048)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!630, !446, !534}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !134, line: 110, baseType: !632)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !134, line: 110, flags: DIFlagFwdDecl)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !448, file: !106, line: 71, baseType: !634, size: 64, align: 64, offset: 2112)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!90, !534, !534}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !448, file: !106, line: 73, baseType: !634, size: 64, align: 64, offset: 2176)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !102, file: !106, line: 55, baseType: !527, size: 64, align: 64, offset: 1664)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !102, file: !106, line: 57, baseType: !531, size: 64, align: 64, offset: 1728)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !102, file: !106, line: 60, baseType: !537, size: 64, align: 64, offset: 1792)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !102, file: !106, line: 62, baseType: !541, size: 64, align: 64, offset: 1856)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !102, file: !106, line: 65, baseType: !545, size: 64, align: 64, offset: 1920)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !102, file: !106, line: 69, baseType: !550, size: 64, align: 64, offset: 1984)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !102, file: !106, line: 70, baseType: !627, size: 64, align: 64, offset: 2048)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !102, file: !106, line: 71, baseType: !634, size: 64, align: 64, offset: 2112)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !102, file: !106, line: 73, baseType: !634, size: 64, align: 64, offset: 2176)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !102, file: !103, line: 46, baseType: !299, size: 64, align: 64, offset: 2240)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !102, file: !103, line: 47, baseType: !299, size: 64, align: 64, offset: 2304)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !102, file: !103, line: 48, baseType: !650, size: 64, align: 64, offset: 2368)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !101, line: 8, baseType: !652)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !101, line: 8, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !102, file: !103, line: 49, baseType: !299, size: 64, align: 64, offset: 2432)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !102, file: !103, line: 51, baseType: !119, size: 64, align: 64, offset: 2496)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !102, file: !103, line: 53, baseType: !119, size: 64, align: 64, offset: 2560)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !102, file: !103, line: 54, baseType: !119, size: 64, align: 64, offset: 2624)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !102, file: !103, line: 55, baseType: !119, size: 64, align: 64, offset: 2688)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !102, file: !103, line: 56, baseType: !119, size: 64, align: 64, offset: 2752)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !102, file: !103, line: 57, baseType: !90, size: 32, align: 32, offset: 2816)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !102, file: !103, line: 59, baseType: !161, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !102, file: !103, line: 60, baseType: !161, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !102, file: !103, line: 62, baseType: !161, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !102, file: !103, line: 63, baseType: !161, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !102, file: !103, line: 64, baseType: !161, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !102, file: !103, line: 65, baseType: !161, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !102, file: !103, line: 66, baseType: !161, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !102, file: !103, line: 67, baseType: !161, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !102, file: !103, line: 68, baseType: !161, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !102, file: !103, line: 69, baseType: !161, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !102, file: !103, line: 70, baseType: !161, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !102, file: !103, line: 71, baseType: !161, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !102, file: !103, line: 72, baseType: !161, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !102, file: !103, line: 74, baseType: !90, size: 32, align: 32, offset: 2880)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !102, file: !103, line: 75, baseType: !90, size: 32, align: 32, offset: 2912)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !102, file: !103, line: 76, baseType: !90, size: 32, align: 32, offset: 2944)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !102, file: !103, line: 77, baseType: !90, size: 32, align: 32, offset: 2976)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !102, file: !103, line: 79, baseType: !420, size: 64, align: 64, offset: 3008)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !102, file: !103, line: 80, baseType: !299, size: 64, align: 64, offset: 3072)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !102, file: !103, line: 81, baseType: !299, size: 64, align: 64, offset: 3136)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !102, file: !103, line: 83, baseType: !338, size: 64, align: 64, offset: 3200)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !102, file: !103, line: 84, baseType: !290, size: 32, align: 32, offset: 3264)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !102, file: !103, line: 87, baseType: !90, size: 32, align: 32, offset: 3296)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !102, file: !103, line: 91, baseType: !299, size: 64, align: 64, offset: 3328)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !102, file: !103, line: 92, baseType: !432, size: 128, align: 64, offset: 3392)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !102, file: !103, line: 93, baseType: !432, size: 128, align: 64, offset: 3520)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !102, file: !103, line: 95, baseType: !90, size: 32, align: 32, offset: 3648)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !102, file: !103, line: 96, baseType: !90, size: 32, align: 32, offset: 3680)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !102, file: !103, line: 97, baseType: !90, size: 32, align: 32, offset: 3712)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !102, file: !103, line: 100, baseType: !299, size: 64, align: 64, offset: 3776)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !102, file: !103, line: 103, baseType: !299, size: 64, align: 64, offset: 3840)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !102, file: !103, line: 106, baseType: !299, size: 64, align: 64, offset: 3904)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !102, file: !103, line: 108, baseType: !420, size: 64, align: 64, offset: 3968)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !102, file: !103, line: 109, baseType: !299, size: 64, align: 64, offset: 4032)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !102, file: !103, line: 111, baseType: !299, size: 64, align: 64, offset: 4096)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !102, file: !103, line: 114, baseType: !82, size: 64, align: 64, offset: 4160)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !102, file: !103, line: 116, baseType: !420, size: 64, align: 64, offset: 4224)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !102, file: !103, line: 117, baseType: !698, size: 32768, align: 64, offset: 4288)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 32768, align: 64, elements: !748)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !700, line: 10, size: 128, align: 64, elements: !701)
!700 = !DIFile(filename: "../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!701 = !{!702, !747}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !699, file: !700, line: 11, baseType: !703, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !700, line: 7, baseType: !705)
!705 = !DISubroutineType(types: !706)
!706 = !{null, !707, !534, !120, !120, !119, !338}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !101, line: 7, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !710, line: 15, size: 1600, align: 64, elements: !711)
!710 = !DIFile(filename: "../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !709, file: !559, line: 3, baseType: !90, size: 32, align: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !709, file: !559, line: 4, baseType: !90, size: 32, align: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !709, file: !559, line: 5, baseType: !420, size: 64, align: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !709, file: !559, line: 7, baseType: !82, size: 64, align: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !709, file: !559, line: 8, baseType: !99, size: 64, align: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !709, file: !559, line: 9, baseType: !119, size: 64, align: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !709, file: !559, line: 10, baseType: !119, size: 64, align: 64, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !709, file: !559, line: 11, baseType: !93, size: 64, align: 64, offset: 384)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !709, file: !559, line: 12, baseType: !90, size: 32, align: 32, offset: 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !709, file: !559, line: 13, baseType: !119, size: 64, align: 64, offset: 512)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !709, file: !559, line: 15, baseType: !570, size: 64, align: 64, offset: 576)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !709, file: !559, line: 17, baseType: !577, size: 64, align: 64, offset: 640)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !709, file: !581, line: 5, baseType: !119, size: 64, align: 64, offset: 704)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !709, file: !581, line: 6, baseType: !119, size: 64, align: 64, offset: 768)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !709, file: !581, line: 7, baseType: !93, size: 64, align: 64, offset: 832)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !709, file: !581, line: 9, baseType: !420, size: 64, align: 64, offset: 896)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !709, file: !581, line: 10, baseType: !586, size: 64, align: 64, offset: 960)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !709, file: !581, line: 12, baseType: !161, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !709, file: !581, line: 13, baseType: !119, size: 64, align: 64, offset: 1088)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !709, file: !581, line: 14, baseType: !90, size: 32, align: 32, offset: 1152)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !709, file: !581, line: 15, baseType: !119, size: 64, align: 64, offset: 1216)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !709, file: !581, line: 17, baseType: !161, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !709, file: !581, line: 18, baseType: !161, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !709, file: !581, line: 19, baseType: !161, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !709, file: !581, line: 20, baseType: !161, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !709, file: !581, line: 22, baseType: !161, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !709, file: !581, line: 23, baseType: !161, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !709, file: !581, line: 24, baseType: !161, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !709, file: !581, line: 25, baseType: !161, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !709, file: !581, line: 26, baseType: !161, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !709, file: !581, line: 31, baseType: !623, size: 64, align: 64, offset: 1344)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !709, file: !710, line: 18, baseType: !299, size: 64, align: 64, offset: 1408)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !709, file: !710, line: 20, baseType: !93, size: 64, align: 64, offset: 1472)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !709, file: !710, line: 21, baseType: !90, size: 32, align: 32, offset: 1536)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !709, file: !710, line: 22, baseType: !90, size: 32, align: 32, offset: 1568)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !699, file: !700, line: 12, baseType: !120, size: 8, align: 8, offset: 64)
!748 = !{!749}
!749 = !DISubrange(count: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !102, file: !103, line: 118, baseType: !751, size: 2048, align: 8, offset: 37056)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 2048, align: 8, elements: !748)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !102, file: !103, line: 120, baseType: !634, size: 64, align: 64, offset: 39104)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !86, file: !89, line: 6, baseType: !119, size: 64, align: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !86, file: !89, line: 7, baseType: !119, size: 64, align: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !86, file: !89, line: 8, baseType: !119, size: 64, align: 64, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !86, file: !89, line: 10, baseType: !757, size: 64, align: 64, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAT_DCC_REC", file: !759, line: 9, baseType: !760)
!759 = !DIFile(filename: "dcc.h", directory: "/home/lichi/Desktop/irssi/task1")
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CHAT_DCC_REC", file: !761, line: 12, size: 1792, align: 64, elements: !762)
!761 = !DIFile(filename: "dcc-chat.h", directory: "/home/lichi/Desktop/irssi/task1")
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !778, !779, !780, !781, !782, !783, !784, !786, !787, !788, !789, !790, !791, !792}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !760, file: !89, line: 1, baseType: !90, size: 32, align: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !760, file: !89, line: 2, baseType: !90, size: 32, align: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !760, file: !89, line: 3, baseType: !93, size: 64, align: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !760, file: !89, line: 5, baseType: !99, size: 64, align: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !760, file: !89, line: 6, baseType: !119, size: 64, align: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !760, file: !89, line: 7, baseType: !119, size: 64, align: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !760, file: !89, line: 8, baseType: !119, size: 64, align: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !760, file: !89, line: 10, baseType: !757, size: 64, align: 64, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !760, file: !89, line: 11, baseType: !119, size: 64, align: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !760, file: !89, line: 12, baseType: !119, size: 64, align: 64, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !760, file: !89, line: 14, baseType: !133, size: 160, align: 32, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !760, file: !89, line: 15, baseType: !775, size: 368, align: 8, offset: 736)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 368, align: 8, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 46)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !760, file: !89, line: 16, baseType: !90, size: 32, align: 32, offset: 1120)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !760, file: !89, line: 18, baseType: !178, size: 64, align: 64, offset: 1152)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !760, file: !89, line: 19, baseType: !90, size: 32, align: 32, offset: 1216)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !760, file: !89, line: 19, baseType: !90, size: 32, align: 32, offset: 1248)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !760, file: !89, line: 19, baseType: !90, size: 32, align: 32, offset: 1280)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !760, file: !89, line: 20, baseType: !93, size: 64, align: 64, offset: 1344)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !760, file: !89, line: 21, baseType: !785, size: 64, align: 64, offset: 1408)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "uoff_t", file: !134, line: 49, baseType: !199)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !760, file: !89, line: 23, baseType: !90, size: 32, align: 32, offset: 1472)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !760, file: !89, line: 25, baseType: !161, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !760, file: !89, line: 27, baseType: !420, size: 64, align: 64, offset: 1536)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !760, file: !761, line: 15, baseType: !119, size: 64, align: 64, offset: 1600)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "sendbuf", scope: !760, file: !761, line: 16, baseType: !392, size: 64, align: 64, offset: 1664)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "mirc_ctcp", scope: !760, file: !761, line: 18, baseType: !161, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !760, file: !761, line: 19, baseType: !161, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !86, file: !89, line: 11, baseType: !119, size: 64, align: 64, offset: 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !86, file: !89, line: 12, baseType: !119, size: 64, align: 64, offset: 512)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !86, file: !89, line: 14, baseType: !133, size: 160, align: 32, offset: 576)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !86, file: !89, line: 15, baseType: !775, size: 368, align: 8, offset: 736)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !86, file: !89, line: 16, baseType: !90, size: 32, align: 32, offset: 1120)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !86, file: !89, line: 18, baseType: !178, size: 64, align: 64, offset: 1152)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !86, file: !89, line: 19, baseType: !90, size: 32, align: 32, offset: 1216)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !86, file: !89, line: 19, baseType: !90, size: 32, align: 32, offset: 1248)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !86, file: !89, line: 19, baseType: !90, size: 32, align: 32, offset: 1280)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !86, file: !89, line: 20, baseType: !93, size: 64, align: 64, offset: 1344)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !86, file: !89, line: 21, baseType: !785, size: 64, align: 64, offset: 1408)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !86, file: !89, line: 23, baseType: !90, size: 32, align: 32, offset: 1472)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !86, file: !89, line: 25, baseType: !161, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !86, file: !89, line: 27, baseType: !420, size: 64, align: 64, offset: 1536)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !86, file: !808, line: 3, baseType: !785, size: 64, align: 64, offset: 1600)
!808 = !DIFile(filename: "dcc-file-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!809 = !DIDerivedType(tag: DW_TAG_member, name: "skipped", scope: !86, file: !808, line: 3, baseType: !785, size: 64, align: 64, offset: 1664)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "fhandle", scope: !86, file: !808, line: 4, baseType: !90, size: 32, align: 32, offset: 1728)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !86, file: !808, line: 5, baseType: !90, size: 32, align: 32, offset: 1760)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "count_buf", scope: !86, file: !808, line: 8, baseType: !813, size: 32, align: 8, offset: 1792)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 32, align: 8, elements: !162)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "count_pos", scope: !86, file: !808, line: 9, baseType: !90, size: 32, align: 32, offset: 1824)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "file_quoted", scope: !86, file: !85, line: 15, baseType: !161, size: 1, align: 32, offset: 1856, flags: DIFlagBitField, extraData: i64 1856)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "waitforend", scope: !86, file: !85, line: 18, baseType: !161, size: 1, align: 32, offset: 1857, flags: DIFlagBitField, extraData: i64 1856)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "gotalldata", scope: !86, file: !85, line: 19, baseType: !161, size: 1, align: 32, offset: 1858, flags: DIFlagBitField, extraData: i64 1856)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInputFunction", file: !134, line: 60, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64, align: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{null, !82, !178, !90}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64, align: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCC_REC", file: !759, line: 13, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !759, line: 11, size: 1600, align: 64, elements: !825)
!825 = !{!826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !824, file: !89, line: 1, baseType: !90, size: 32, align: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !824, file: !89, line: 2, baseType: !90, size: 32, align: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !824, file: !89, line: 3, baseType: !93, size: 64, align: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !824, file: !89, line: 5, baseType: !99, size: 64, align: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !824, file: !89, line: 6, baseType: !119, size: 64, align: 64, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !824, file: !89, line: 7, baseType: !119, size: 64, align: 64, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !824, file: !89, line: 8, baseType: !119, size: 64, align: 64, offset: 320)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !824, file: !89, line: 10, baseType: !757, size: 64, align: 64, offset: 384)
