; ModuleID = './line145-sasl.o.i'
source_filename = "./line145-sasl.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !42)
!1 = !DIFile(filename: "line145-sasl.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 24, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "sasl.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41}
!38 = !DIEnumerator(name: "SASL_MECHANISM_NONE", value: 0)
!39 = !DIEnumerator(name: "SASL_MECHANISM_PLAIN", value: 1)
!40 = !DIEnumerator(name: "SASL_MECHANISM_EXTERNAL", value: 2)
!41 = !DIEnumerator(name: "SASL_MECHANISM_MAX", value: 3)
!42 = !{!43, !44, !48, !49, !56, !367, !184, !123, !455}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "guchar", file: !46, line: 52, baseType: !47)
!46 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!47 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!48 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !50, line: 9, baseType: !51)
!50 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !54, !54, !54, !54, !54, !54}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !58, line: 6, baseType: !59)
!58 = !DIFile(filename: "irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !60, line: 42, size: 39168, align: 64, elements: !61)
!60 = !DIFile(filename: "irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!61 = !{!62, !64, !65, !66, !312, !317, !318, !319, !320, !321, !322, !323, !324, !325, !329, !330, !334, !335, !336, !340, !345, !346, !347, !348, !349, !350, !351, !352, !359, !360, !361, !362, !363, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !673, !675}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !63, line: 3, baseType: !48, size: 32, align: 32)
!63 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !59, file: !63, line: 4, baseType: !48, size: 32, align: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !59, file: !63, line: 6, baseType: !48, size: 32, align: 32, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !59, file: !63, line: 8, baseType: !67, size: 64, align: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !58, line: 5, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !60, line: 24, size: 2496, align: 64, elements: !70)
!70 = !{!71, !73, !74, !75, !78, !79, !80, !81, !82, !84, !85, !86, !87, !88, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !69, file: !72, line: 3, baseType: !48, size: 32, align: 32)
!72 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!73 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !69, file: !72, line: 4, baseType: !48, size: 32, align: 32, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !69, file: !72, line: 6, baseType: !48, size: 32, align: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !69, file: !72, line: 9, baseType: !76, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !69, file: !72, line: 10, baseType: !48, size: 32, align: 32, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !69, file: !72, line: 11, baseType: !76, size: 64, align: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !69, file: !72, line: 11, baseType: !76, size: 64, align: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !69, file: !72, line: 11, baseType: !76, size: 64, align: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !69, file: !72, line: 13, baseType: !83, size: 16, align: 16, offset: 448)
!83 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !69, file: !72, line: 14, baseType: !76, size: 64, align: 64, offset: 512)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !69, file: !72, line: 15, baseType: !76, size: 64, align: 64, offset: 576)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !69, file: !72, line: 16, baseType: !48, size: 32, align: 32, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !69, file: !72, line: 17, baseType: !76, size: 64, align: 64, offset: 704)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !69, file: !72, line: 19, baseType: !89, size: 64, align: 64, offset: 768)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !91, line: 99, baseType: !92)
!91 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !91, line: 99, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !69, file: !72, line: 19, baseType: !89, size: 64, align: 64, offset: 832)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !69, file: !72, line: 21, baseType: !76, size: 64, align: 64, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !69, file: !72, line: 22, baseType: !76, size: 64, align: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !69, file: !72, line: 23, baseType: !76, size: 64, align: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !69, file: !72, line: 24, baseType: !76, size: 64, align: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !69, file: !72, line: 26, baseType: !76, size: 64, align: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !69, file: !72, line: 27, baseType: !76, size: 64, align: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !69, file: !72, line: 28, baseType: !76, size: 64, align: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !69, file: !72, line: 29, baseType: !76, size: 64, align: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !69, file: !72, line: 30, baseType: !76, size: 64, align: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !69, file: !72, line: 31, baseType: !76, size: 64, align: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !69, file: !72, line: 32, baseType: !76, size: 64, align: 64, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !69, file: !72, line: 33, baseType: !76, size: 64, align: 64, offset: 1600)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !69, file: !72, line: 35, baseType: !107, size: 64, align: 64, offset: 1664)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !110)
!110 = !{!111, !113, !257, !258, !263, !264, !265, !266, !267, !276, !277, !278, !282, !283, !284, !285, !286, !287, !288, !289}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !109, file: !4, line: 100, baseType: !112, size: 32, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !46, line: 49, baseType: !48)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !109, file: !4, line: 101, baseType: !114, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !117)
!117 = !{!118, !142, !148, !155, !159, !244, !248, !253}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !116, file: !4, line: 133, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!122, !107, !123, !125, !128, !129}
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !46, line: 46, baseType: !77)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !126, line: 66, baseType: !127)
!126 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!127 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !132, line: 42, baseType: !133)
!132 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !132, line: 44, size: 128, align: 64, elements: !134)
!134 = !{!135, !140, !141}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !133, file: !132, line: 46, baseType: !136, size: 32, align: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !137, line: 36, baseType: !138)
!137 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !126, line: 45, baseType: !139)
!139 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !133, file: !132, line: 47, baseType: !112, size: 32, align: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !133, file: !132, line: 48, baseType: !123, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !116, file: !4, line: 138, baseType: !143, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!122, !107, !146, !125, !128, !129}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !116, file: !4, line: 143, baseType: !149, size: 64, align: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!122, !107, !152, !154, !129}
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !126, line: 51, baseType: !153)
!153 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !116, file: !4, line: 147, baseType: !156, size: 64, align: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!122, !107, !129}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !116, file: !4, line: 149, baseType: !160, size: 64, align: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !107, !243}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !166)
!166 = !{!167, !169, !190, !219, !221, !225, !226, !227, !228, !236, !237, !238, !239}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !165, file: !16, line: 174, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !46, line: 77, baseType: !43)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !165, file: !16, line: 175, baseType: !170, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !173)
!173 = !{!174, !178, !179}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !172, file: !16, line: 198, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !168}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !172, file: !16, line: 199, baseType: !175, size: 64, align: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !172, file: !16, line: 200, baseType: !180, size: 64, align: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !168, !163, !183, !189}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!188, !168}
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !46, line: 50, baseType: !112)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !165, file: !16, line: 177, baseType: !191, size: 64, align: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !195)
!195 = !{!196, !201, !205, !209, !213, !214}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !194, file: !16, line: 216, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!188, !163, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !194, file: !16, line: 218, baseType: !202, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!188, !163}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !194, file: !16, line: 219, baseType: !206, size: 64, align: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!188, !163, !184, !168}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !194, file: !16, line: 222, baseType: !210, size: 64, align: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !163}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !194, file: !16, line: 226, baseType: !184, size: 64, align: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !194, file: !16, line: 227, baseType: !215, size: 64, align: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !165, file: !16, line: 178, baseType: !220, size: 32, align: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !46, line: 55, baseType: !139)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !165, file: !16, line: 180, baseType: !222, size: 64, align: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !224)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !165, file: !16, line: 182, baseType: !112, size: 32, align: 32, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !165, file: !16, line: 183, baseType: !220, size: 32, align: 32, offset: 352)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !165, file: !16, line: 184, baseType: !220, size: 32, align: 32, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !165, file: !16, line: 186, baseType: !229, size: 64, align: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !231, line: 37, baseType: !232)
!231 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !231, line: 39, size: 128, align: 64, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !232, file: !231, line: 41, baseType: !168, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !231, line: 42, baseType: !229, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !165, file: !16, line: 188, baseType: !163, size: 64, align: 64, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !165, file: !16, line: 189, baseType: !163, size: 64, align: 64, offset: 576)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !165, file: !16, line: 191, baseType: !76, size: 64, align: 64, offset: 640)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !165, file: !16, line: 193, baseType: !240, size: 64, align: 64, offset: 704)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !242)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !116, file: !4, line: 151, baseType: !245, size: 64, align: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !107}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !116, file: !4, line: 152, baseType: !249, size: 64, align: 64, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!122, !107, !252, !129}
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !116, file: !4, line: 155, baseType: !254, size: 64, align: 64, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!252, !107}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !109, file: !4, line: 103, baseType: !123, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !109, file: !4, line: 104, baseType: !259, size: 64, align: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !260, line: 77, baseType: !261)
!260 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !260, line: 77, flags: DIFlagFwdDecl)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !109, file: !4, line: 105, baseType: !259, size: 64, align: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !109, file: !4, line: 106, baseType: !123, size: 64, align: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !109, file: !4, line: 107, baseType: !220, size: 32, align: 32, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !109, file: !4, line: 109, baseType: !125, size: 64, align: 64, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !109, file: !4, line: 110, baseType: !268, size: 64, align: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !270, line: 39, baseType: !271)
!270 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !270, line: 41, size: 192, align: 64, elements: !272)
!272 = !{!273, !274, !275}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !271, file: !270, line: 43, baseType: !123, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !271, file: !270, line: 44, baseType: !125, size: 64, align: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !271, file: !270, line: 45, baseType: !125, size: 64, align: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !109, file: !4, line: 111, baseType: !268, size: 64, align: 64, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !109, file: !4, line: 112, baseType: !268, size: 64, align: 64, offset: 640)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !109, file: !4, line: 113, baseType: !279, size: 48, align: 8, offset: 704)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 48, align: 8, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 6)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !109, file: !4, line: 117, baseType: !220, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !109, file: !4, line: 118, baseType: !220, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !109, file: !4, line: 119, baseType: !220, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !109, file: !4, line: 120, baseType: !220, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !109, file: !4, line: 121, baseType: !220, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !109, file: !4, line: 122, baseType: !220, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !109, file: !4, line: 124, baseType: !168, size: 64, align: 64, offset: 768)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !109, file: !4, line: 125, baseType: !168, size: 64, align: 64, offset: 832)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !69, file: !72, line: 38, baseType: !139, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !69, file: !72, line: 39, baseType: !139, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !69, file: !72, line: 40, baseType: !139, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !69, file: !72, line: 41, baseType: !139, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !69, file: !72, line: 42, baseType: !139, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !69, file: !72, line: 43, baseType: !139, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !69, file: !72, line: 44, baseType: !139, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !69, file: !72, line: 45, baseType: !139, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !69, file: !72, line: 46, baseType: !76, size: 64, align: 64, offset: 1792)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !69, file: !72, line: 47, baseType: !76, size: 64, align: 64, offset: 1856)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !69, file: !60, line: 27, baseType: !76, size: 64, align: 64, offset: 1920)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !69, file: !60, line: 28, baseType: !76, size: 64, align: 64, offset: 1984)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !69, file: !60, line: 30, baseType: !48, size: 32, align: 32, offset: 2048)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !69, file: !60, line: 31, baseType: !76, size: 64, align: 64, offset: 2112)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !69, file: !60, line: 32, baseType: !76, size: 64, align: 64, offset: 2176)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !69, file: !60, line: 34, baseType: !48, size: 32, align: 32, offset: 2240)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !69, file: !60, line: 35, baseType: !48, size: 32, align: 32, offset: 2272)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !69, file: !60, line: 36, baseType: !48, size: 32, align: 32, offset: 2304)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !69, file: !60, line: 38, baseType: !48, size: 32, align: 32, offset: 2336)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !69, file: !60, line: 38, baseType: !48, size: 32, align: 32, offset: 2368)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !69, file: !60, line: 38, baseType: !48, size: 32, align: 32, offset: 2400)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !69, file: !60, line: 38, baseType: !48, size: 32, align: 32, offset: 2432)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !59, file: !63, line: 9, baseType: !313, size: 64, align: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !314, line: 75, baseType: !315)
!314 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !316, line: 139, baseType: !153)
!316 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!317 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !59, file: !63, line: 10, baseType: !313, size: 64, align: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !59, file: !63, line: 12, baseType: !76, size: 64, align: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !59, file: !63, line: 13, baseType: !76, size: 64, align: 64, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !59, file: !63, line: 15, baseType: !139, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !59, file: !63, line: 16, baseType: !139, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !59, file: !63, line: 17, baseType: !139, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !59, file: !63, line: 18, baseType: !139, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !59, file: !63, line: 19, baseType: !139, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !59, file: !63, line: 21, baseType: !326, size: 64, align: 64, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !91, line: 102, baseType: !328)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !91, line: 102, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !59, file: !63, line: 22, baseType: !48, size: 32, align: 32, offset: 576)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !59, file: !63, line: 25, baseType: !331, size: 128, align: 64, offset: 640)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 128, align: 64, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 2)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !59, file: !63, line: 26, baseType: !48, size: 32, align: 32, offset: 768)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !59, file: !63, line: 27, baseType: !48, size: 32, align: 32, offset: 800)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !59, file: !63, line: 29, baseType: !337, size: 64, align: 64, offset: 832)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !91, line: 103, baseType: !339)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !91, line: 103, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !59, file: !63, line: 30, baseType: !341, size: 64, align: 64, offset: 896)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !343, line: 37, baseType: !344)
!343 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !343, line: 37, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !59, file: !63, line: 32, baseType: !76, size: 64, align: 64, offset: 960)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !59, file: !63, line: 33, baseType: !76, size: 64, align: 64, offset: 1024)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !59, file: !63, line: 34, baseType: !76, size: 64, align: 64, offset: 1088)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !59, file: !63, line: 35, baseType: !139, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !59, file: !63, line: 36, baseType: !139, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !59, file: !63, line: 37, baseType: !139, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !59, file: !63, line: 38, baseType: !139, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !59, file: !63, line: 40, baseType: !353, size: 128, align: 64, offset: 1216)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !46, line: 504, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !46, line: 506, size: 128, align: 64, elements: !355)
!355 = !{!356, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !354, file: !46, line: 508, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !46, line: 48, baseType: !153)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !354, file: !46, line: 509, baseType: !357, size: 64, align: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !59, file: !63, line: 41, baseType: !313, size: 64, align: 64, offset: 1344)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !59, file: !63, line: 42, baseType: !48, size: 32, align: 32, offset: 1408)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !59, file: !63, line: 44, baseType: !229, size: 64, align: 64, offset: 1472)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !59, file: !63, line: 45, baseType: !229, size: 64, align: 64, offset: 1536)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !59, file: !63, line: 53, baseType: !364, size: 64, align: 64, offset: 1600)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !367, !455, !48}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !91, line: 107, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !370, line: 30, size: 2240, align: 64, elements: !371)
!370 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!371 = !{!372, !373, !374, !375, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !451, !457, !461, !465, !470, !549, !556, !560}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !369, file: !63, line: 3, baseType: !48, size: 32, align: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !369, file: !63, line: 4, baseType: !48, size: 32, align: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !369, file: !63, line: 6, baseType: !48, size: 32, align: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !369, file: !63, line: 8, baseType: !376, size: 64, align: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !91, line: 113, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !370, line: 25, size: 1920, align: 64, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !378, file: !72, line: 3, baseType: !48, size: 32, align: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !378, file: !72, line: 4, baseType: !48, size: 32, align: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !378, file: !72, line: 6, baseType: !48, size: 32, align: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !378, file: !72, line: 9, baseType: !76, size: 64, align: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !378, file: !72, line: 10, baseType: !48, size: 32, align: 32, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !378, file: !72, line: 11, baseType: !76, size: 64, align: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !378, file: !72, line: 11, baseType: !76, size: 64, align: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !378, file: !72, line: 11, baseType: !76, size: 64, align: 64, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !378, file: !72, line: 13, baseType: !83, size: 16, align: 16, offset: 448)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !378, file: !72, line: 14, baseType: !76, size: 64, align: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !378, file: !72, line: 15, baseType: !76, size: 64, align: 64, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !378, file: !72, line: 16, baseType: !48, size: 32, align: 32, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !378, file: !72, line: 17, baseType: !76, size: 64, align: 64, offset: 704)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !378, file: !72, line: 19, baseType: !89, size: 64, align: 64, offset: 768)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !378, file: !72, line: 19, baseType: !89, size: 64, align: 64, offset: 832)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !378, file: !72, line: 21, baseType: !76, size: 64, align: 64, offset: 896)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !378, file: !72, line: 22, baseType: !76, size: 64, align: 64, offset: 960)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !378, file: !72, line: 23, baseType: !76, size: 64, align: 64, offset: 1024)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !378, file: !72, line: 24, baseType: !76, size: 64, align: 64, offset: 1088)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !378, file: !72, line: 26, baseType: !76, size: 64, align: 64, offset: 1152)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !378, file: !72, line: 27, baseType: !76, size: 64, align: 64, offset: 1216)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !378, file: !72, line: 28, baseType: !76, size: 64, align: 64, offset: 1280)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !378, file: !72, line: 29, baseType: !76, size: 64, align: 64, offset: 1344)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !378, file: !72, line: 30, baseType: !76, size: 64, align: 64, offset: 1408)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !378, file: !72, line: 31, baseType: !76, size: 64, align: 64, offset: 1472)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !378, file: !72, line: 32, baseType: !76, size: 64, align: 64, offset: 1536)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !378, file: !72, line: 33, baseType: !76, size: 64, align: 64, offset: 1600)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !378, file: !72, line: 35, baseType: !107, size: 64, align: 64, offset: 1664)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !378, file: !72, line: 38, baseType: !139, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !378, file: !72, line: 39, baseType: !139, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !378, file: !72, line: 40, baseType: !139, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !378, file: !72, line: 41, baseType: !139, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !378, file: !72, line: 42, baseType: !139, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !378, file: !72, line: 43, baseType: !139, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !378, file: !72, line: 44, baseType: !139, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !378, file: !72, line: 45, baseType: !139, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !378, file: !72, line: 46, baseType: !76, size: 64, align: 64, offset: 1792)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !378, file: !72, line: 47, baseType: !76, size: 64, align: 64, offset: 1856)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !369, file: !63, line: 9, baseType: !313, size: 64, align: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !369, file: !63, line: 10, baseType: !313, size: 64, align: 64, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !369, file: !63, line: 12, baseType: !76, size: 64, align: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !369, file: !63, line: 13, baseType: !76, size: 64, align: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !369, file: !63, line: 15, baseType: !139, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !369, file: !63, line: 16, baseType: !139, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !369, file: !63, line: 17, baseType: !139, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !369, file: !63, line: 18, baseType: !139, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !369, file: !63, line: 19, baseType: !139, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !369, file: !63, line: 21, baseType: !326, size: 64, align: 64, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !369, file: !63, line: 22, baseType: !48, size: 32, align: 32, offset: 576)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !369, file: !63, line: 25, baseType: !331, size: 128, align: 64, offset: 640)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !369, file: !63, line: 26, baseType: !48, size: 32, align: 32, offset: 768)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !369, file: !63, line: 27, baseType: !48, size: 32, align: 32, offset: 800)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !369, file: !63, line: 29, baseType: !337, size: 64, align: 64, offset: 832)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !369, file: !63, line: 30, baseType: !341, size: 64, align: 64, offset: 896)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !369, file: !63, line: 32, baseType: !76, size: 64, align: 64, offset: 960)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !369, file: !63, line: 33, baseType: !76, size: 64, align: 64, offset: 1024)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !369, file: !63, line: 34, baseType: !76, size: 64, align: 64, offset: 1088)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !369, file: !63, line: 35, baseType: !139, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !369, file: !63, line: 36, baseType: !139, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !369, file: !63, line: 37, baseType: !139, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !369, file: !63, line: 38, baseType: !139, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !369, file: !63, line: 40, baseType: !353, size: 128, align: 64, offset: 1216)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !369, file: !63, line: 41, baseType: !313, size: 64, align: 64, offset: 1344)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !369, file: !63, line: 42, baseType: !48, size: 32, align: 32, offset: 1408)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !369, file: !63, line: 44, baseType: !229, size: 64, align: 64, offset: 1472)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !369, file: !63, line: 45, baseType: !229, size: 64, align: 64, offset: 1536)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !369, file: !63, line: 53, baseType: !364, size: 64, align: 64, offset: 1600)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !369, file: !63, line: 55, baseType: !448, size: 64, align: 64, offset: 1664)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!48, !367, !77}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !369, file: !63, line: 57, baseType: !452, size: 64, align: 64, offset: 1728)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!48, !367, !455}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !369, file: !63, line: 60, baseType: !458, size: 64, align: 64, offset: 1792)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!455, !367}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !369, file: !63, line: 62, baseType: !462, size: 64, align: 64, offset: 1856)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !367, !455, !455, !48}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !369, file: !63, line: 65, baseType: !466, size: 64, align: 64, offset: 1920)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!469, !367, !455, !455}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !369, file: !63, line: 69, baseType: !471, size: 64, align: 64, offset: 1984)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!474, !367, !455}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !91, line: 109, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !477, line: 15, size: 1408, align: 64, elements: !478)
!477 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!478 = !{!479, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !497, !501, !503, !504, !505, !506, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !476, file: !480, line: 3, baseType: !48, size: 32, align: 32)
!480 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!481 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !476, file: !480, line: 4, baseType: !48, size: 32, align: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !476, file: !480, line: 5, baseType: !341, size: 64, align: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !476, file: !480, line: 7, baseType: !43, size: 64, align: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !476, file: !480, line: 8, baseType: !367, size: 64, align: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !476, file: !480, line: 9, baseType: !76, size: 64, align: 64, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !476, file: !480, line: 10, baseType: !76, size: 64, align: 64, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !476, file: !480, line: 11, baseType: !313, size: 64, align: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !476, file: !480, line: 12, baseType: !48, size: 32, align: 32, offset: 448)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !476, file: !480, line: 13, baseType: !76, size: 64, align: 64, offset: 512)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !476, file: !480, line: 15, baseType: !491, size: 64, align: 64, offset: 576)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !494}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !91, line: 108, baseType: !496)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !91, line: 108, flags: DIFlagFwdDecl)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !476, file: !480, line: 17, baseType: !498, size: 64, align: 64, offset: 640)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!455, !494}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !476, file: !502, line: 5, baseType: !76, size: 64, align: 64, offset: 704)
!502 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!503 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !476, file: !502, line: 6, baseType: !76, size: 64, align: 64, offset: 768)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !476, file: !502, line: 7, baseType: !313, size: 64, align: 64, offset: 832)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !476, file: !502, line: 9, baseType: !341, size: 64, align: 64, offset: 896)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !476, file: !502, line: 10, baseType: !507, size: 64, align: 64, offset: 960)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !91, line: 111, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !510, line: 13, size: 576, align: 64, elements: !511)
!510 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!511 = !{!512, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !530, !531}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !509, file: !513, line: 3, baseType: !48, size: 32, align: 32)
!513 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!514 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !509, file: !513, line: 4, baseType: !48, size: 32, align: 32, offset: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !509, file: !513, line: 6, baseType: !313, size: 64, align: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !509, file: !513, line: 8, baseType: !76, size: 64, align: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !509, file: !513, line: 9, baseType: !76, size: 64, align: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !509, file: !513, line: 10, baseType: !76, size: 64, align: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !509, file: !513, line: 11, baseType: !48, size: 32, align: 32, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !509, file: !513, line: 14, baseType: !139, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !509, file: !513, line: 15, baseType: !139, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !509, file: !513, line: 18, baseType: !139, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !509, file: !513, line: 19, baseType: !139, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !509, file: !513, line: 20, baseType: !139, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !509, file: !513, line: 21, baseType: !139, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !509, file: !513, line: 22, baseType: !527, size: 64, align: 8, offset: 360)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 64, align: 8, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 8)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !509, file: !513, line: 26, baseType: !43, size: 64, align: 64, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !509, file: !513, line: 28, baseType: !507, size: 64, align: 64, offset: 512)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !476, file: !502, line: 12, baseType: !139, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !476, file: !502, line: 13, baseType: !76, size: 64, align: 64, offset: 1088)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !476, file: !502, line: 14, baseType: !48, size: 32, align: 32, offset: 1152)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !476, file: !502, line: 15, baseType: !76, size: 64, align: 64, offset: 1216)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !476, file: !502, line: 17, baseType: !139, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !476, file: !502, line: 18, baseType: !139, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !476, file: !502, line: 19, baseType: !139, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !476, file: !502, line: 20, baseType: !139, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !476, file: !502, line: 22, baseType: !139, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !476, file: !502, line: 23, baseType: !139, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !476, file: !502, line: 24, baseType: !139, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !476, file: !502, line: 25, baseType: !139, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !476, file: !502, line: 26, baseType: !139, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !476, file: !502, line: 31, baseType: !546, size: 64, align: 64, offset: 1344)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!76, !474}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !369, file: !63, line: 70, baseType: !550, size: 64, align: 64, offset: 2048)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!553, !367, !455}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !91, line: 110, baseType: !555)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !91, line: 110, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !369, file: !63, line: 71, baseType: !557, size: 64, align: 64, offset: 2112)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!48, !455, !455}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !369, file: !63, line: 73, baseType: !557, size: 64, align: 64, offset: 2176)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !59, file: !63, line: 55, baseType: !448, size: 64, align: 64, offset: 1664)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !59, file: !63, line: 57, baseType: !452, size: 64, align: 64, offset: 1728)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !59, file: !63, line: 60, baseType: !458, size: 64, align: 64, offset: 1792)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !59, file: !63, line: 62, baseType: !462, size: 64, align: 64, offset: 1856)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !59, file: !63, line: 65, baseType: !466, size: 64, align: 64, offset: 1920)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !59, file: !63, line: 69, baseType: !471, size: 64, align: 64, offset: 1984)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !59, file: !63, line: 70, baseType: !550, size: 64, align: 64, offset: 2048)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !59, file: !63, line: 71, baseType: !557, size: 64, align: 64, offset: 2112)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !59, file: !63, line: 73, baseType: !557, size: 64, align: 64, offset: 2176)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !59, file: !60, line: 46, baseType: !229, size: 64, align: 64, offset: 2240)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !59, file: !60, line: 47, baseType: !229, size: 64, align: 64, offset: 2304)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !59, file: !60, line: 48, baseType: !573, size: 64, align: 64, offset: 2368)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !58, line: 8, baseType: !575)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !58, line: 8, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !59, file: !60, line: 49, baseType: !229, size: 64, align: 64, offset: 2432)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !59, file: !60, line: 51, baseType: !76, size: 64, align: 64, offset: 2496)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !59, file: !60, line: 53, baseType: !76, size: 64, align: 64, offset: 2560)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !59, file: !60, line: 54, baseType: !76, size: 64, align: 64, offset: 2624)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !59, file: !60, line: 55, baseType: !76, size: 64, align: 64, offset: 2688)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !59, file: !60, line: 56, baseType: !76, size: 64, align: 64, offset: 2752)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !59, file: !60, line: 57, baseType: !48, size: 32, align: 32, offset: 2816)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !59, file: !60, line: 59, baseType: !139, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !59, file: !60, line: 60, baseType: !139, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !59, file: !60, line: 62, baseType: !139, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !59, file: !60, line: 63, baseType: !139, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !59, file: !60, line: 64, baseType: !139, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !59, file: !60, line: 65, baseType: !139, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !59, file: !60, line: 66, baseType: !139, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !59, file: !60, line: 67, baseType: !139, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !59, file: !60, line: 68, baseType: !139, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !59, file: !60, line: 69, baseType: !139, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !59, file: !60, line: 70, baseType: !139, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !59, file: !60, line: 71, baseType: !139, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !59, file: !60, line: 72, baseType: !139, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !59, file: !60, line: 74, baseType: !48, size: 32, align: 32, offset: 2880)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !59, file: !60, line: 75, baseType: !48, size: 32, align: 32, offset: 2912)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !59, file: !60, line: 76, baseType: !48, size: 32, align: 32, offset: 2944)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !59, file: !60, line: 77, baseType: !48, size: 32, align: 32, offset: 2976)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !59, file: !60, line: 79, baseType: !341, size: 64, align: 64, offset: 3008)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !59, file: !60, line: 80, baseType: !229, size: 64, align: 64, offset: 3072)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !59, file: !60, line: 81, baseType: !229, size: 64, align: 64, offset: 3136)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !59, file: !60, line: 83, baseType: !268, size: 64, align: 64, offset: 3200)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !59, file: !60, line: 84, baseType: !220, size: 32, align: 32, offset: 3264)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !59, file: !60, line: 87, baseType: !48, size: 32, align: 32, offset: 3296)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !59, file: !60, line: 91, baseType: !229, size: 64, align: 64, offset: 3328)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !59, file: !60, line: 92, baseType: !353, size: 128, align: 64, offset: 3392)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !59, file: !60, line: 93, baseType: !353, size: 128, align: 64, offset: 3520)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !59, file: !60, line: 95, baseType: !48, size: 32, align: 32, offset: 3648)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !59, file: !60, line: 96, baseType: !48, size: 32, align: 32, offset: 3680)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !59, file: !60, line: 97, baseType: !48, size: 32, align: 32, offset: 3712)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !59, file: !60, line: 100, baseType: !229, size: 64, align: 64, offset: 3776)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !59, file: !60, line: 103, baseType: !229, size: 64, align: 64, offset: 3840)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !59, file: !60, line: 106, baseType: !229, size: 64, align: 64, offset: 3904)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !59, file: !60, line: 108, baseType: !341, size: 64, align: 64, offset: 3968)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !59, file: !60, line: 109, baseType: !229, size: 64, align: 64, offset: 4032)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !59, file: !60, line: 111, baseType: !229, size: 64, align: 64, offset: 4096)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !59, file: !60, line: 114, baseType: !43, size: 64, align: 64, offset: 4160)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !59, file: !60, line: 116, baseType: !341, size: 64, align: 64, offset: 4224)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !59, file: !60, line: 117, baseType: !621, size: 32768, align: 64, offset: 4288)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 32768, align: 64, elements: !671)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !623, line: 10, size: 128, align: 64, elements: !624)
!623 = !DIFile(filename: "modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!624 = !{!625, !670}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !622, file: !623, line: 11, baseType: !626, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !623, line: 7, baseType: !628)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !630, !455, !77, !77, !76, !268}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !58, line: 7, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !633, line: 15, size: 1600, align: 64, elements: !634)
!633 = !DIFile(filename: "irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !632, file: !480, line: 3, baseType: !48, size: 32, align: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !632, file: !480, line: 4, baseType: !48, size: 32, align: 32, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !632, file: !480, line: 5, baseType: !341, size: 64, align: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !632, file: !480, line: 7, baseType: !43, size: 64, align: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !632, file: !480, line: 8, baseType: !56, size: 64, align: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !632, file: !480, line: 9, baseType: !76, size: 64, align: 64, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !632, file: !480, line: 10, baseType: !76, size: 64, align: 64, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !632, file: !480, line: 11, baseType: !313, size: 64, align: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !632, file: !480, line: 12, baseType: !48, size: 32, align: 32, offset: 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !632, file: !480, line: 13, baseType: !76, size: 64, align: 64, offset: 512)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !632, file: !480, line: 15, baseType: !491, size: 64, align: 64, offset: 576)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !632, file: !480, line: 17, baseType: !498, size: 64, align: 64, offset: 640)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !632, file: !502, line: 5, baseType: !76, size: 64, align: 64, offset: 704)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !632, file: !502, line: 6, baseType: !76, size: 64, align: 64, offset: 768)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !632, file: !502, line: 7, baseType: !313, size: 64, align: 64, offset: 832)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !632, file: !502, line: 9, baseType: !341, size: 64, align: 64, offset: 896)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !632, file: !502, line: 10, baseType: !507, size: 64, align: 64, offset: 960)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !632, file: !502, line: 12, baseType: !139, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !632, file: !502, line: 13, baseType: !76, size: 64, align: 64, offset: 1088)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !632, file: !502, line: 14, baseType: !48, size: 32, align: 32, offset: 1152)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !632, file: !502, line: 15, baseType: !76, size: 64, align: 64, offset: 1216)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !632, file: !502, line: 17, baseType: !139, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !632, file: !502, line: 18, baseType: !139, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !632, file: !502, line: 19, baseType: !139, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !632, file: !502, line: 20, baseType: !139, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !632, file: !502, line: 22, baseType: !139, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !632, file: !502, line: 23, baseType: !139, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !632, file: !502, line: 24, baseType: !139, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !632, file: !502, line: 25, baseType: !139, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !632, file: !502, line: 26, baseType: !139, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !632, file: !502, line: 31, baseType: !546, size: 64, align: 64, offset: 1344)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !632, file: !633, line: 18, baseType: !229, size: 64, align: 64, offset: 1408)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !632, file: !633, line: 20, baseType: !313, size: 64, align: 64, offset: 1472)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !632, file: !633, line: 21, baseType: !48, size: 32, align: 32, offset: 1536)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !632, file: !633, line: 22, baseType: !48, size: 32, align: 32, offset: 1568)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !622, file: !623, line: 12, baseType: !77, size: 8, align: 8, offset: 64)
!671 = !{!672}
!672 = !DISubrange(count: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !59, file: !60, line: 118, baseType: !674, size: 2048, align: 8, offset: 37056)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 2048, align: 8, elements: !671)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !59, file: !60, line: 120, baseType: !557, size: 64, align: 64, offset: 39104)
!676 = !{i32 2, !"Dwarf Version", i32 4}
!677 = !{i32 2, !"Debug Info Version", i32 3}
!678 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!679 = distinct !DISubprogram(name: "sasl_send_response", scope: !680, file: !680, line: 198, type: !681, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !683)
!680 = !DIFile(filename: "sasl.c", directory: "/home/lichi/Desktop/irssi/task1")
!681 = !DISubroutineType(types: !682)
!682 = !{null, !56, !268}
!683 = !{}
!684 = !DILocalVariable(name: "server", arg: 1, scope: !679, file: !680, line: 198, type: !56)
!685 = !DIExpression()
!686 = !DILocation(line: 198, column: 41, scope: !679)
!687 = !DILocalVariable(name: "response", arg: 2, scope: !679, file: !680, line: 198, type: !268)
!688 = !DILocation(line: 198, column: 58, scope: !679)
!689 = !DILocalVariable(name: "enc", scope: !679, file: !680, line: 200, type: !76)
!690 = !DILocation(line: 200, column: 8, scope: !679)
!691 = !DILocalVariable(name: "offset", scope: !679, file: !680, line: 201, type: !692)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !693, line: 216, baseType: !127)
!693 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/irssi/task1")
!694 = !DILocation(line: 201, column: 9, scope: !679)
!695 = !DILocalVariable(name: "enc_len", scope: !679, file: !680, line: 201, type: !692)
!696 = !DILocation(line: 201, column: 17, scope: !679)
!697 = !DILocalVariable(name: "chunk_len", scope: !679, file: !680, line: 201, type: !692)
!698 = !DILocation(line: 201, column: 26, scope: !679)
!699 = !DILocation(line: 203, column: 6, scope: !700)
!700 = distinct !DILexicalBlock(scope: !679, file: !680, line: 203, column: 6)
!701 = !DILocation(line: 203, column: 15, scope: !700)
!702 = !DILocation(line: 203, column: 6, scope: !679)
!703 = !DILocation(line: 204, column: 17, scope: !704)
!704 = distinct !DILexicalBlock(scope: !700, file: !680, line: 203, column: 23)
!705 = !DILocation(line: 204, column: 3, scope: !704)
!706 = !DILocation(line: 205, column: 3, scope: !704)
!707 = !DILocation(line: 208, column: 35, scope: !679)
!708 = !DILocation(line: 208, column: 45, scope: !679)
!709 = !DILocation(line: 208, column: 50, scope: !679)
!710 = !DILocation(line: 208, column: 60, scope: !679)
!711 = !DILocation(line: 208, column: 8, scope: !679)
!712 = !DILocation(line: 208, column: 6, scope: !679)
!713 = !DILocation(line: 209, column: 19, scope: !679)
!714 = !DILocation(line: 209, column: 12, scope: !679)
!715 = !DILocation(line: 209, column: 10, scope: !679)
!716 = !DILocation(line: 211, column: 14, scope: !717)
!717 = distinct !DILexicalBlock(scope: !679, file: !680, line: 211, column: 2)
!718 = !DILocation(line: 211, column: 7, scope: !717)
!719 = !DILocation(line: 211, column: 19, scope: !720)
!720 = !DILexicalBlockFile(scope: !721, file: !680, discriminator: 1)
!721 = distinct !DILexicalBlock(scope: !717, file: !680, line: 211, column: 2)
!722 = !DILocation(line: 211, column: 28, scope: !720)
!723 = !DILocation(line: 211, column: 26, scope: !720)
!724 = !DILocation(line: 211, column: 2, scope: !720)
!725 = !DILocation(line: 212, column: 15, scope: !726)
!726 = distinct !DILexicalBlock(scope: !721, file: !680, line: 211, column: 52)
!727 = !DILocation(line: 212, column: 25, scope: !726)
!728 = !DILocation(line: 212, column: 23, scope: !726)
!729 = !DILocation(line: 212, column: 13, scope: !726)
!730 = !DILocation(line: 213, column: 7, scope: !731)
!731 = distinct !DILexicalBlock(scope: !726, file: !680, line: 213, column: 7)
!732 = !DILocation(line: 213, column: 17, scope: !731)
!733 = !DILocation(line: 213, column: 7, scope: !726)
!734 = !DILocation(line: 214, column: 14, scope: !731)
!735 = !DILocation(line: 214, column: 4, scope: !731)
