; ModuleID = './line210-chat-completion.o.i'
source_filename = "./line210-chat-completion.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, {}*, i8* (%struct._WI_ITEM_REC*)* }
%struct._GHashTable = type opaque
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }

!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 10, size: 32, align: 32, elements: !51)
!50 = !DIFile(filename: "../../../src/core/levels.h", directory: "/home/lichi/Desktop/irssi/task1")
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79}
!52 = !DIEnumerator(name: "MSGLEVEL_CRAP", value: 1)
!53 = !DIEnumerator(name: "MSGLEVEL_MSGS", value: 2)
!54 = !DIEnumerator(name: "MSGLEVEL_PUBLIC", value: 4)
!55 = !DIEnumerator(name: "MSGLEVEL_NOTICES", value: 8)
!56 = !DIEnumerator(name: "MSGLEVEL_SNOTES", value: 16)
!57 = !DIEnumerator(name: "MSGLEVEL_CTCPS", value: 32)
!58 = !DIEnumerator(name: "MSGLEVEL_ACTIONS", value: 64)
!59 = !DIEnumerator(name: "MSGLEVEL_JOINS", value: 128)
!60 = !DIEnumerator(name: "MSGLEVEL_PARTS", value: 256)
!61 = !DIEnumerator(name: "MSGLEVEL_QUITS", value: 512)
!62 = !DIEnumerator(name: "MSGLEVEL_KICKS", value: 1024)
!63 = !DIEnumerator(name: "MSGLEVEL_MODES", value: 2048)
!64 = !DIEnumerator(name: "MSGLEVEL_TOPICS", value: 4096)
!65 = !DIEnumerator(name: "MSGLEVEL_WALLOPS", value: 8192)
!66 = !DIEnumerator(name: "MSGLEVEL_INVITES", value: 16384)
!67 = !DIEnumerator(name: "MSGLEVEL_NICKS", value: 32768)
!68 = !DIEnumerator(name: "MSGLEVEL_DCC", value: 65536)
!69 = !DIEnumerator(name: "MSGLEVEL_DCCMSGS", value: 131072)
!70 = !DIEnumerator(name: "MSGLEVEL_CLIENTNOTICE", value: 262144)
!71 = !DIEnumerator(name: "MSGLEVEL_CLIENTCRAP", value: 524288)
!72 = !DIEnumerator(name: "MSGLEVEL_CLIENTERROR", value: 1048576)
!73 = !DIEnumerator(name: "MSGLEVEL_HILIGHT", value: 2097152)
!74 = !DIEnumerator(name: "MSGLEVEL_ALL", value: 4194303)
!75 = !DIEnumerator(name: "MSGLEVEL_NOHILIGHT", value: 16777216)
!76 = !DIEnumerator(name: "MSGLEVEL_NO_ACT", value: 33554432)
!77 = !DIEnumerator(name: "MSGLEVEL_NEVER", value: 67108864)
!78 = !DIEnumerator(name: "MSGLEVEL_LASTLOG", value: 134217728)
!79 = !DIEnumerator(name: "MSGLEVEL_HIDDEN", value: 268435456)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 39, size: 32, align: 32, elements: !82)
!81 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstrfuncs.h", directory: "/home/lichi/Desktop/irssi/task1")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!83 = !DIEnumerator(name: "G_ASCII_ALNUM", value: 1)
!84 = !DIEnumerator(name: "G_ASCII_ALPHA", value: 2)
!85 = !DIEnumerator(name: "G_ASCII_CNTRL", value: 4)
!86 = !DIEnumerator(name: "G_ASCII_DIGIT", value: 8)
!87 = !DIEnumerator(name: "G_ASCII_GRAPH", value: 16)
!88 = !DIEnumerator(name: "G_ASCII_LOWER", value: 32)
!89 = !DIEnumerator(name: "G_ASCII_PRINT", value: 64)
!90 = !DIEnumerator(name: "G_ASCII_PUNCT", value: 128)
!91 = !DIEnumerator(name: "G_ASCII_SPACE", value: 256)
!92 = !DIEnumerator(name: "G_ASCII_UPPER", value: 512)
!93 = !DIEnumerator(name: "G_ASCII_XDIGIT", value: 1024)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !95, line: 46, size: 32, align: 32, elements: !96)
!95 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/irssi/task1")
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108}
!97 = !DIEnumerator(name: "_ISupper", value: 256)
!98 = !DIEnumerator(name: "_ISlower", value: 512)
!99 = !DIEnumerator(name: "_ISalpha", value: 1024)
!100 = !DIEnumerator(name: "_ISdigit", value: 2048)
!101 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!102 = !DIEnumerator(name: "_ISspace", value: 8192)
!103 = !DIEnumerator(name: "_ISprint", value: 16384)
!104 = !DIEnumerator(name: "_ISgraph", value: 32768)
!105 = !DIEnumerator(name: "_ISblank", value: 1)
!106 = !DIEnumerator(name: "_IScntrl", value: 2)
!107 = !DIEnumerator(name: "_ISpunct", value: 4)
!108 = !DIEnumerator(name: "_ISalnum", value: 8)
!109 = !{!110, !111, !115, !117, !124, !138, !139, !152, !158, !478, !584, !585, !198, !174, !586, !591}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !113, line: 46, baseType: !114)
!113 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!114 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !118, line: 9, baseType: !119)
!118 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !122, !122, !122, !122, !122, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "LAST_MSG_REC", file: !126, line: 23, baseType: !127)
!126 = !DIFile(filename: "module.h", directory: "/home/lichi/Desktop/irssi/task1")
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 6, size: 192, align: 64, elements: !128)
!128 = !{!129, !135, !137}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !127, file: !126, line: 7, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !131, line: 75, baseType: !132)
!131 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !133, line: 139, baseType: !134)
!133 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!134 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !127, file: !126, line: 8, baseType: !136, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "own", scope: !127, file: !126, line: 22, baseType: !138, size: 32, align: 32, offset: 128)
!138 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "MODULE_SERVER_REC", file: !126, line: 29, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 25, size: 64, align: 64, elements: !142)
!142 = !{!143}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "lastmsgs", scope: !141, file: !126, line: 27, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !146, line: 37, baseType: !147)
!146 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !146, line: 39, size: 128, align: 64, elements: !148)
!148 = !{!149, !151}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !147, file: !146, line: 41, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !113, line: 77, baseType: !110)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !146, line: 42, baseType: !144, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !113, line: 80, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!156, !157, !157}
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !113, line: 49, baseType: !138)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !113, line: 78, baseType: !122)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !160, line: 109, baseType: !161)
!160 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !162, line: 15, size: 1408, align: 64, elements: !163)
!162 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!163 = !{!164, !166, !167, !172, !173, !529, !530, !531, !532, !533, !534, !535, !536, !538, !539, !540, !541, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !161, file: !165, line: 3, baseType: !138, size: 32, align: 32)
!165 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!166 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !161, file: !165, line: 4, baseType: !138, size: 32, align: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !161, file: !165, line: 5, baseType: !168, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !170, line: 37, baseType: !171)
!170 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !170, line: 37, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !161, file: !165, line: 7, baseType: !110, size: 64, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !161, file: !165, line: 8, baseType: !174, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !160, line: 107, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !177, line: 30, size: 2240, align: 64, elements: !178)
!177 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!178 = !{!179, !181, !182, !183, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !415, !416, !420, !421, !422, !426, !427, !428, !429, !430, !431, !432, !433, !434, !441, !442, !443, !444, !445, !449, !453, !457, !461, !465, !470, !474, !524, !528}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !176, file: !180, line: 3, baseType: !138, size: 32, align: 32)
!180 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!181 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !176, file: !180, line: 4, baseType: !138, size: 32, align: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !176, file: !180, line: 6, baseType: !138, size: 32, align: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !176, file: !180, line: 8, baseType: !184, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !160, line: 113, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !177, line: 25, size: 1920, align: 64, elements: !187)
!187 = !{!188, !190, !191, !192, !193, !194, !195, !196, !197, !199, !200, !201, !202, !203, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !186, file: !189, line: 3, baseType: !138, size: 32, align: 32)
!189 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!190 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !186, file: !189, line: 4, baseType: !138, size: 32, align: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !186, file: !189, line: 6, baseType: !138, size: 32, align: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !186, file: !189, line: 9, baseType: !136, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !186, file: !189, line: 10, baseType: !138, size: 32, align: 32, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !186, file: !189, line: 11, baseType: !136, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !186, file: !189, line: 11, baseType: !136, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !186, file: !189, line: 11, baseType: !136, size: 64, align: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !186, file: !189, line: 13, baseType: !198, size: 16, align: 16, offset: 448)
!198 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !186, file: !189, line: 14, baseType: !136, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !186, file: !189, line: 15, baseType: !136, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !186, file: !189, line: 16, baseType: !138, size: 32, align: 32, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !186, file: !189, line: 17, baseType: !136, size: 64, align: 64, offset: 704)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !186, file: !189, line: 19, baseType: !204, size: 64, align: 64, offset: 768)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !160, line: 99, baseType: !206)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !160, line: 99, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !186, file: !189, line: 19, baseType: !204, size: 64, align: 64, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !186, file: !189, line: 21, baseType: !136, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !186, file: !189, line: 22, baseType: !136, size: 64, align: 64, offset: 960)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !186, file: !189, line: 23, baseType: !136, size: 64, align: 64, offset: 1024)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !186, file: !189, line: 24, baseType: !136, size: 64, align: 64, offset: 1088)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !186, file: !189, line: 26, baseType: !136, size: 64, align: 64, offset: 1152)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !186, file: !189, line: 27, baseType: !136, size: 64, align: 64, offset: 1216)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !186, file: !189, line: 28, baseType: !136, size: 64, align: 64, offset: 1280)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !186, file: !189, line: 29, baseType: !136, size: 64, align: 64, offset: 1344)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !186, file: !189, line: 30, baseType: !136, size: 64, align: 64, offset: 1408)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !186, file: !189, line: 31, baseType: !136, size: 64, align: 64, offset: 1472)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !186, file: !189, line: 32, baseType: !136, size: 64, align: 64, offset: 1536)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !186, file: !189, line: 33, baseType: !136, size: 64, align: 64, offset: 1600)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !186, file: !189, line: 35, baseType: !221, size: 64, align: 64, offset: 1664)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !224)
!224 = !{!225, !226, !359, !360, !365, !366, !367, !368, !369, !378, !379, !380, !384, !385, !386, !387, !388, !389, !390, !391}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !223, file: !4, line: 100, baseType: !156, size: 32, align: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !223, file: !4, line: 101, baseType: !227, size: 64, align: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !230)
!230 = !{!231, !253, !259, !265, !269, !346, !350, !355}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !229, file: !4, line: 133, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!235, !221, !111, !236, !239, !240}
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !237, line: 66, baseType: !238)
!237 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!238 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !243, line: 42, baseType: !244)
!243 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !243, line: 44, size: 128, align: 64, elements: !245)
!245 = !{!246, !251, !252}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !244, file: !243, line: 46, baseType: !247, size: 32, align: 32)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !248, line: 36, baseType: !249)
!248 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !237, line: 45, baseType: !250)
!250 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !244, file: !243, line: 47, baseType: !156, size: 32, align: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !244, file: !243, line: 48, baseType: !111, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !229, file: !4, line: 138, baseType: !254, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!235, !221, !257, !236, !239, !240}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !229, file: !4, line: 143, baseType: !260, size: 64, align: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!235, !221, !263, !264, !240}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !237, line: 51, baseType: !134)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !229, file: !4, line: 147, baseType: !266, size: 64, align: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!235, !221, !240}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !229, file: !4, line: 149, baseType: !270, size: 64, align: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !221, !345}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !276)
!276 = !{!277, !278, !299, !328, !330, !334, !335, !336, !337, !338, !339, !340, !341}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !275, file: !16, line: 174, baseType: !150, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !275, file: !16, line: 175, baseType: !279, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !282)
!282 = !{!283, !287, !288}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !281, file: !16, line: 198, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !150}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !281, file: !16, line: 199, baseType: !284, size: 64, align: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !281, file: !16, line: 200, baseType: !289, size: 64, align: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !150, !273, !292, !298}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!297, !150}
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !113, line: 50, baseType: !156)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !275, file: !16, line: 177, baseType: !300, size: 64, align: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !304)
!304 = !{!305, !310, !314, !318, !322, !323}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !303, file: !16, line: 216, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!297, !273, !309}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !303, file: !16, line: 218, baseType: !311, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!297, !273}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !303, file: !16, line: 219, baseType: !315, size: 64, align: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!297, !273, !293, !150}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !303, file: !16, line: 222, baseType: !319, size: 64, align: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !273}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !303, file: !16, line: 226, baseType: !293, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !303, file: !16, line: 227, baseType: !324, size: 64, align: 64, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{null}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !275, file: !16, line: 178, baseType: !329, size: 32, align: 32, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !113, line: 55, baseType: !250)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !275, file: !16, line: 180, baseType: !331, size: 64, align: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !333)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !275, file: !16, line: 182, baseType: !156, size: 32, align: 32, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !275, file: !16, line: 183, baseType: !329, size: 32, align: 32, offset: 352)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !275, file: !16, line: 184, baseType: !329, size: 32, align: 32, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !275, file: !16, line: 186, baseType: !144, size: 64, align: 64, offset: 448)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !275, file: !16, line: 188, baseType: !273, size: 64, align: 64, offset: 512)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !275, file: !16, line: 189, baseType: !273, size: 64, align: 64, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !275, file: !16, line: 191, baseType: !136, size: 64, align: 64, offset: 640)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !275, file: !16, line: 193, baseType: !342, size: 64, align: 64, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !344)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !229, file: !4, line: 151, baseType: !347, size: 64, align: 64, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !221}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !229, file: !4, line: 152, baseType: !351, size: 64, align: 64, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!235, !221, !354, !240}
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !229, file: !4, line: 155, baseType: !356, size: 64, align: 64, offset: 448)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!354, !221}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !223, file: !4, line: 103, baseType: !111, size: 64, align: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !223, file: !4, line: 104, baseType: !361, size: 64, align: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !362, line: 77, baseType: !363)
!362 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !362, line: 77, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !223, file: !4, line: 105, baseType: !361, size: 64, align: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !223, file: !4, line: 106, baseType: !111, size: 64, align: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !223, file: !4, line: 107, baseType: !329, size: 32, align: 32, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !223, file: !4, line: 109, baseType: !236, size: 64, align: 64, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !223, file: !4, line: 110, baseType: !370, size: 64, align: 64, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !372, line: 39, baseType: !373)
!372 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !372, line: 41, size: 192, align: 64, elements: !374)
!374 = !{!375, !376, !377}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !373, file: !372, line: 43, baseType: !111, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !373, file: !372, line: 44, baseType: !236, size: 64, align: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !373, file: !372, line: 45, baseType: !236, size: 64, align: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !223, file: !4, line: 111, baseType: !370, size: 64, align: 64, offset: 576)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !223, file: !4, line: 112, baseType: !370, size: 64, align: 64, offset: 640)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !223, file: !4, line: 113, baseType: !381, size: 48, align: 8, offset: 704)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 48, align: 8, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 6)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !223, file: !4, line: 117, baseType: !329, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !223, file: !4, line: 118, baseType: !329, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !223, file: !4, line: 119, baseType: !329, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !223, file: !4, line: 120, baseType: !329, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !223, file: !4, line: 121, baseType: !329, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !223, file: !4, line: 122, baseType: !329, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !223, file: !4, line: 124, baseType: !150, size: 64, align: 64, offset: 768)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !223, file: !4, line: 125, baseType: !150, size: 64, align: 64, offset: 832)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !186, file: !189, line: 38, baseType: !250, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !186, file: !189, line: 39, baseType: !250, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !186, file: !189, line: 40, baseType: !250, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !186, file: !189, line: 41, baseType: !250, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !186, file: !189, line: 42, baseType: !250, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !186, file: !189, line: 43, baseType: !250, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !186, file: !189, line: 44, baseType: !250, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !186, file: !189, line: 45, baseType: !250, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !186, file: !189, line: 46, baseType: !136, size: 64, align: 64, offset: 1792)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !186, file: !189, line: 47, baseType: !136, size: 64, align: 64, offset: 1856)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !176, file: !180, line: 9, baseType: !130, size: 64, align: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !176, file: !180, line: 10, baseType: !130, size: 64, align: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !176, file: !180, line: 12, baseType: !136, size: 64, align: 64, offset: 320)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !176, file: !180, line: 13, baseType: !136, size: 64, align: 64, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !176, file: !180, line: 15, baseType: !250, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !176, file: !180, line: 16, baseType: !250, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !176, file: !180, line: 17, baseType: !250, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !176, file: !180, line: 18, baseType: !250, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !176, file: !180, line: 19, baseType: !250, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !176, file: !180, line: 21, baseType: !412, size: 64, align: 64, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !160, line: 102, baseType: !414)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !160, line: 102, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !176, file: !180, line: 22, baseType: !138, size: 32, align: 32, offset: 576)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !176, file: !180, line: 25, baseType: !417, size: 128, align: 64, offset: 640)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 128, align: 64, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 2)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !176, file: !180, line: 26, baseType: !138, size: 32, align: 32, offset: 768)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !176, file: !180, line: 27, baseType: !138, size: 32, align: 32, offset: 800)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !176, file: !180, line: 29, baseType: !423, size: 64, align: 64, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !160, line: 103, baseType: !425)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !160, line: 103, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !176, file: !180, line: 30, baseType: !168, size: 64, align: 64, offset: 896)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !176, file: !180, line: 32, baseType: !136, size: 64, align: 64, offset: 960)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !176, file: !180, line: 33, baseType: !136, size: 64, align: 64, offset: 1024)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !176, file: !180, line: 34, baseType: !136, size: 64, align: 64, offset: 1088)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !176, file: !180, line: 35, baseType: !250, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !176, file: !180, line: 36, baseType: !250, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !176, file: !180, line: 37, baseType: !250, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !176, file: !180, line: 38, baseType: !250, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !176, file: !180, line: 40, baseType: !435, size: 128, align: 64, offset: 1216)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !113, line: 504, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !113, line: 506, size: 128, align: 64, elements: !437)
!437 = !{!438, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !436, file: !113, line: 508, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !113, line: 48, baseType: !134)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !436, file: !113, line: 509, baseType: !439, size: 64, align: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !176, file: !180, line: 41, baseType: !130, size: 64, align: 64, offset: 1344)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !176, file: !180, line: 42, baseType: !138, size: 32, align: 32, offset: 1408)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !176, file: !180, line: 44, baseType: !144, size: 64, align: 64, offset: 1472)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !176, file: !180, line: 45, baseType: !144, size: 64, align: 64, offset: 1536)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !176, file: !180, line: 53, baseType: !446, size: 64, align: 64, offset: 1600)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !174, !115, !138}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !176, file: !180, line: 55, baseType: !450, size: 64, align: 64, offset: 1664)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!138, !174, !114}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !176, file: !180, line: 57, baseType: !454, size: 64, align: 64, offset: 1728)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!138, !174, !115}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !176, file: !180, line: 60, baseType: !458, size: 64, align: 64, offset: 1792)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!115, !174}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !176, file: !180, line: 62, baseType: !462, size: 64, align: 64, offset: 1856)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !174, !115, !115, !138}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !176, file: !180, line: 65, baseType: !466, size: 64, align: 64, offset: 1920)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!469, !174, !115, !115}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !176, file: !180, line: 69, baseType: !471, size: 64, align: 64, offset: 1984)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!158, !174, !115}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !176, file: !180, line: 70, baseType: !475, size: 64, align: 64, offset: 2048)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!478, !174, !115}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !160, line: 110, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !481, line: 15, size: 960, align: 64, elements: !482)
!481 = !DIFile(filename: "../../../src/core/queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !517, !518, !520, !521, !522, !523}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !480, file: !165, line: 3, baseType: !138, size: 32, align: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !480, file: !165, line: 4, baseType: !138, size: 32, align: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !480, file: !165, line: 5, baseType: !168, size: 64, align: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !480, file: !165, line: 7, baseType: !110, size: 64, align: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !480, file: !165, line: 8, baseType: !174, size: 64, align: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !480, file: !165, line: 9, baseType: !136, size: 64, align: 64, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !480, file: !165, line: 10, baseType: !136, size: 64, align: 64, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !480, file: !165, line: 11, baseType: !130, size: 64, align: 64, offset: 384)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !480, file: !165, line: 12, baseType: !138, size: 32, align: 32, offset: 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !480, file: !165, line: 13, baseType: !136, size: 64, align: 64, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !480, file: !165, line: 15, baseType: !494, size: 64, align: 64, offset: 576)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !160, line: 108, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !500, line: 5, size: 704, align: 64, elements: !501)
!500 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !499, file: !165, line: 3, baseType: !138, size: 32, align: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !499, file: !165, line: 4, baseType: !138, size: 32, align: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !499, file: !165, line: 5, baseType: !168, size: 64, align: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !499, file: !165, line: 7, baseType: !110, size: 64, align: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !499, file: !165, line: 8, baseType: !174, size: 64, align: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !499, file: !165, line: 9, baseType: !136, size: 64, align: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !499, file: !165, line: 10, baseType: !136, size: 64, align: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !499, file: !165, line: 11, baseType: !130, size: 64, align: 64, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !499, file: !165, line: 12, baseType: !138, size: 32, align: 32, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !499, file: !165, line: 13, baseType: !136, size: 64, align: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !499, file: !165, line: 15, baseType: !494, size: 64, align: 64, offset: 576)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !499, file: !165, line: 17, baseType: !514, size: 64, align: 64, offset: 640)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64, align: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!115, !497}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !480, file: !165, line: 17, baseType: !514, size: 64, align: 64, offset: 640)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !480, file: !519, line: 5, baseType: !136, size: 64, align: 64, offset: 704)
!519 = !DIFile(filename: "../../../src/core/query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!520 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !480, file: !519, line: 6, baseType: !136, size: 64, align: 64, offset: 768)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !480, file: !519, line: 7, baseType: !130, size: 64, align: 64, offset: 832)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !480, file: !519, line: 9, baseType: !250, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !480, file: !519, line: 11, baseType: !250, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !176, file: !180, line: 71, baseType: !525, size: 64, align: 64, offset: 2112)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!138, !115, !115}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !176, file: !180, line: 73, baseType: !525, size: 64, align: 64, offset: 2176)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !161, file: !165, line: 9, baseType: !136, size: 64, align: 64, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !161, file: !165, line: 10, baseType: !136, size: 64, align: 64, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !161, file: !165, line: 11, baseType: !130, size: 64, align: 64, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !161, file: !165, line: 12, baseType: !138, size: 32, align: 32, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !161, file: !165, line: 13, baseType: !136, size: 64, align: 64, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !161, file: !165, line: 15, baseType: !494, size: 64, align: 64, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !161, file: !165, line: 17, baseType: !514, size: 64, align: 64, offset: 640)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !161, file: !537, line: 5, baseType: !136, size: 64, align: 64, offset: 704)
!537 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!538 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !161, file: !537, line: 6, baseType: !136, size: 64, align: 64, offset: 768)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !161, file: !537, line: 7, baseType: !130, size: 64, align: 64, offset: 832)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !161, file: !537, line: 9, baseType: !168, size: 64, align: 64, offset: 896)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !161, file: !537, line: 10, baseType: !542, size: 64, align: 64, offset: 960)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !160, line: 111, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !545, line: 13, size: 576, align: 64, elements: !546)
!545 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!546 = !{!547, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !565, !566}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !544, file: !548, line: 3, baseType: !138, size: 32, align: 32)
!548 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!549 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !544, file: !548, line: 4, baseType: !138, size: 32, align: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !544, file: !548, line: 6, baseType: !130, size: 64, align: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !544, file: !548, line: 8, baseType: !136, size: 64, align: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !544, file: !548, line: 9, baseType: !136, size: 64, align: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !544, file: !548, line: 10, baseType: !136, size: 64, align: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !544, file: !548, line: 11, baseType: !138, size: 32, align: 32, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !544, file: !548, line: 14, baseType: !250, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !544, file: !548, line: 15, baseType: !250, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !544, file: !548, line: 18, baseType: !250, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !544, file: !548, line: 19, baseType: !250, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !544, file: !548, line: 20, baseType: !250, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !544, file: !548, line: 21, baseType: !250, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !544, file: !548, line: 22, baseType: !562, size: 64, align: 8, offset: 360)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 64, align: 8, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 8)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !544, file: !548, line: 26, baseType: !110, size: 64, align: 64, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !544, file: !548, line: 28, baseType: !542, size: 64, align: 64, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !161, file: !537, line: 12, baseType: !250, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !161, file: !537, line: 13, baseType: !136, size: 64, align: 64, offset: 1088)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !161, file: !537, line: 14, baseType: !138, size: 32, align: 32, offset: 1152)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !161, file: !537, line: 15, baseType: !136, size: 64, align: 64, offset: 1216)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !161, file: !537, line: 17, baseType: !250, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !161, file: !537, line: 18, baseType: !250, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !161, file: !537, line: 19, baseType: !250, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !161, file: !537, line: 20, baseType: !250, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !161, file: !537, line: 22, baseType: !250, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !161, file: !537, line: 23, baseType: !250, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !161, file: !537, line: 24, baseType: !250, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !161, file: !537, line: 25, baseType: !250, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !161, file: !537, line: 26, baseType: !250, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !161, file: !537, line: 31, baseType: !581, size: 64, align: 64, offset: 1344)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64, align: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!136, !158}
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "guchar", file: !113, line: 52, baseType: !585)
!585 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "MODULE_CHANNEL_REC", file: !126, line: 35, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 31, size: 64, align: 64, elements: !589)
!589 = !{!590}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "lastmsgs", scope: !588, file: !126, line: 33, baseType: !144, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !113, line: 88, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !150, !150}
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!596 = distinct !DIGlobalVariable(name: "keep_privates_count", scope: !0, file: !44, line: 47, type: !138, isLocal: true, isDefinition: true, variable: i32* @keep_privates_count)
!597 = distinct !DIGlobalVariable(name: "completion_char", scope: !0, file: !44, line: 49, type: !136, isLocal: true, isDefinition: true, variable: i8** @completion_char)
!598 = distinct !DIGlobalVariable(name: "cmdchars", scope: !0, file: !44, line: 49, type: !136, isLocal: true, isDefinition: true, variable: i8** @cmdchars)
!599 = distinct !DIGlobalVariable(name: "global_lastmsgs", scope: !0, file: !44, line: 50, type: !144, isLocal: true, isDefinition: true, variable: %struct._GSList** @global_lastmsgs)
!600 = distinct !DIGlobalVariable(name: "keep_publics_count", scope: !0, file: !44, line: 47, type: !138, isLocal: true, isDefinition: true, variable: i32* @keep_publics_count)
!601 = distinct !DIGlobalVariable(name: "completion_lowercase", scope: !0, file: !44, line: 48, type: !138, isLocal: true, isDefinition: true, variable: i32* @completion_lowercase)
!602 = distinct !DIGlobalVariable(name: "completion_auto", scope: !0, file: !44, line: 51, type: !138, isLocal: true, isDefinition: true, variable: i32* @completion_auto)
!603 = distinct !DIGlobalVariable(name: "completion_strict", scope: !0, file: !44, line: 51, type: !138, isLocal: true, isDefinition: true, variable: i32* @completion_strict)
!604 = distinct !DIGlobalVariable(name: "completion_empty_line", scope: !0, file: !44, line: 51, type: !138, isLocal: true, isDefinition: true, variable: i32* @completion_empty_line)
!605 = distinct !DIGlobalVariable(name: "completion_match_case", scope: !0, file: !44, line: 52, type: !138, isLocal: true, isDefinition: true, variable: i32* @completion_match_case)
!606 = !{i32 2, !"Dwarf Version", i32 4}
!607 = !{i32 2, !"Debug Info Version", i32 3}
!608 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!609 = distinct !DISubprogram(name: "completion_last_message_add", scope: !44, file: !44, line: 139, type: !610, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!610 = !DISubroutineType(types: !611)
!611 = !{null, !115}
!612 = !{}
!613 = !DILocalVariable(name: "nick", arg: 1, scope: !609, file: !44, line: 139, type: !115)
!614 = !DIExpression()
!615 = !DILocation(line: 139, column: 46, scope: !609)
!616 = !DILocation(line: 141, column: 2, scope: !609)
!617 = distinct !{!617, !616}
!618 = !DILocation(line: 141, column: 10, scope: !619)
!619 = !DILexicalBlockFile(scope: !620, file: !44, discriminator: 1)
!620 = distinct !DILexicalBlock(scope: !621, file: !44, line: 141, column: 10)
!621 = distinct !DILexicalBlock(scope: !609, file: !44, line: 141, column: 4)
!622 = !DILocation(line: 141, column: 15, scope: !619)
!623 = !DILocation(line: 141, column: 5, scope: !624)
!624 = !DILexicalBlockFile(scope: !625, file: !44, discriminator: 2)
!625 = distinct !DILexicalBlock(scope: !620, file: !44, line: 141, column: 3)
!626 = !DILocation(line: 141, column: 14, scope: !627)
!627 = !DILexicalBlockFile(scope: !628, file: !44, discriminator: 3)
!628 = distinct !DILexicalBlock(scope: !620, file: !44, line: 141, column: 12)
!629 = !DILocation(line: 141, column: 99, scope: !627)
!630 = !DILocation(line: 141, column: 110, scope: !631)
!631 = !DILexicalBlockFile(scope: !621, file: !44, discriminator: 4)
!632 = !DILocation(line: 143, column: 33, scope: !609)
!633 = !DILocation(line: 143, column: 47, scope: !609)
!634 = !DILocation(line: 143, column: 2, scope: !609)
!635 = !DILocation(line: 144, column: 1, scope: !609)
!636 = !DILocation(line: 144, column: 1, scope: !637)
!637 = !DILexicalBlockFile(scope: !609, file: !44, discriminator: 1)
!638 = distinct !DISubprogram(name: "last_msg_add", scope: !44, file: !44, line: 107, type: !639, isLocal: true, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !641, !115, !138, !138}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!642 = !DILocalVariable(name: "list", arg: 1, scope: !638, file: !44, line: 107, type: !641)
!643 = !DILocation(line: 107, column: 35, scope: !638)
!644 = !DILocalVariable(name: "nick", arg: 2, scope: !638, file: !44, line: 107, type: !115)
!645 = !DILocation(line: 107, column: 53, scope: !638)
!646 = !DILocalVariable(name: "own", arg: 3, scope: !638, file: !44, line: 107, type: !138)
!647 = !DILocation(line: 107, column: 63, scope: !638)
!648 = !DILocalVariable(name: "max", arg: 4, scope: !638, file: !44, line: 107, type: !138)
!649 = !DILocation(line: 107, column: 72, scope: !638)
!650 = !DILocalVariable(name: "rec", scope: !638, file: !44, line: 109, type: !124)
!651 = !DILocation(line: 109, column: 16, scope: !638)
!652 = !DILocation(line: 111, column: 6, scope: !653)
!653 = distinct !DILexicalBlock(scope: !638, file: !44, line: 111, column: 6)
!654 = !DILocation(line: 111, column: 10, scope: !653)
!655 = !DILocation(line: 111, column: 6, scope: !638)
!656 = !DILocation(line: 112, column: 3, scope: !653)
!657 = !DILocation(line: 114, column: 23, scope: !638)
!658 = !DILocation(line: 114, column: 22, scope: !638)
!659 = !DILocation(line: 114, column: 29, scope: !638)
!660 = !DILocation(line: 114, column: 8, scope: !638)
!661 = !DILocation(line: 114, column: 6, scope: !638)
!662 = !DILocation(line: 115, column: 6, scope: !663)
!663 = distinct !DILexicalBlock(scope: !638, file: !44, line: 115, column: 6)
!664 = !DILocation(line: 115, column: 10, scope: !663)
!665 = !DILocation(line: 115, column: 6, scope: !638)
!666 = !DILocation(line: 117, column: 27, scope: !667)
!667 = distinct !DILexicalBlock(scope: !663, file: !44, line: 115, column: 18)
!668 = !DILocation(line: 117, column: 26, scope: !667)
!669 = !DILocation(line: 117, column: 33, scope: !667)
!670 = !DILocation(line: 117, column: 11, scope: !667)
!671 = !DILocation(line: 117, column: 4, scope: !667)
!672 = !DILocation(line: 117, column: 9, scope: !667)
!673 = !DILocation(line: 118, column: 7, scope: !674)
!674 = distinct !DILexicalBlock(scope: !667, file: !44, line: 118, column: 7)
!675 = !DILocation(line: 118, column: 7, scope: !667)
!676 = !DILocation(line: 119, column: 15, scope: !674)
!677 = !DILocation(line: 119, column: 4, scope: !674)
!678 = !DILocation(line: 119, column: 9, scope: !674)
!679 = !DILocation(line: 119, column: 13, scope: !674)
!680 = !DILocation(line: 120, column: 12, scope: !681)
!681 = distinct !DILexicalBlock(scope: !674, file: !44, line: 120, column: 12)
!682 = !DILocation(line: 120, column: 17, scope: !681)
!683 = !DILocation(line: 120, column: 12, scope: !674)
!684 = !DILocation(line: 121, column: 25, scope: !681)
!685 = !DILocation(line: 121, column: 30, scope: !681)
!686 = !DILocation(line: 121, column: 33, scope: !681)
!687 = !DILocation(line: 122, column: 2, scope: !667)
!688 = !DILocation(line: 123, column: 27, scope: !689)
!689 = distinct !DILexicalBlock(scope: !663, file: !44, line: 122, column: 9)
!690 = !DILocation(line: 123, column: 10, scope: !689)
!691 = !DILocation(line: 123, column: 7, scope: !689)
!692 = !DILocation(line: 124, column: 24, scope: !689)
!693 = !DILocation(line: 124, column: 15, scope: !689)
!694 = !DILocation(line: 124, column: 3, scope: !689)
!695 = !DILocation(line: 124, column: 8, scope: !689)
!696 = !DILocation(line: 124, column: 13, scope: !689)
!697 = !DILocation(line: 126, column: 3, scope: !689)
!698 = !DILocation(line: 126, column: 31, scope: !699)
!699 = !DILexicalBlockFile(scope: !689, file: !44, discriminator: 1)
!700 = !DILocation(line: 126, column: 30, scope: !699)
!701 = !DILocation(line: 126, column: 15, scope: !699)
!702 = !DILocation(line: 126, column: 40, scope: !699)
!703 = !DILocation(line: 126, column: 37, scope: !699)
!704 = !DILocation(line: 126, column: 3, scope: !699)
!705 = !DILocation(line: 127, column: 21, scope: !706)
!706 = distinct !DILexicalBlock(scope: !689, file: !44, line: 126, column: 45)
!707 = !DILocation(line: 127, column: 41, scope: !706)
!708 = !DILocation(line: 127, column: 40, scope: !706)
!709 = !DILocation(line: 127, column: 27, scope: !706)
!710 = !DILocation(line: 127, column: 48, scope: !706)
!711 = !DILocation(line: 127, column: 4, scope: !712)
!712 = !DILexicalBlockFile(scope: !706, file: !44, discriminator: 1)
!713 = !DILocation(line: 126, column: 3, scope: !714)
!714 = !DILexicalBlockFile(scope: !689, file: !44, discriminator: 2)
!715 = distinct !{!715, !697}
!716 = !DILocation(line: 130, column: 14, scope: !689)
!717 = !DILocation(line: 130, column: 20, scope: !699)
!718 = !DILocation(line: 130, column: 14, scope: !699)
!719 = !DILocation(line: 130, column: 14, scope: !714)
!720 = !DILocation(line: 130, column: 14, scope: !721)
!721 = !DILexicalBlockFile(scope: !689, file: !44, discriminator: 3)
!722 = !DILocation(line: 130, column: 3, scope: !721)
!723 = !DILocation(line: 130, column: 8, scope: !721)
!724 = !DILocation(line: 130, column: 12, scope: !721)
!725 = !DILocation(line: 132, column: 14, scope: !638)
!726 = !DILocation(line: 132, column: 2, scope: !638)
!727 = !DILocation(line: 132, column: 7, scope: !638)
!728 = !DILocation(line: 132, column: 12, scope: !638)
!729 = !DILocation(line: 134, column: 28, scope: !638)
!730 = !DILocation(line: 134, column: 27, scope: !638)
!731 = !DILocation(line: 134, column: 9, scope: !638)
!732 = !DILocation(line: 136, column: 27, scope: !638)
!733 = !DILocation(line: 136, column: 26, scope: !638)
!734 = !DILocation(line: 136, column: 33, scope: !638)
!735 = !DILocation(line: 136, column: 10, scope: !638)
!736 = !DILocation(line: 136, column: 3, scope: !638)
!737 = !DILocation(line: 136, column: 8, scope: !638)
!738 = !DILocation(line: 137, column: 1, scope: !638)
!739 = !DILocation(line: 137, column: 1, scope: !740)
!740 = !DILexicalBlockFile(scope: !638, file: !44, discriminator: 1)
!741 = distinct !DISubprogram(name: "completion_last_message_remove", scope: !44, file: !44, line: 146, type: !610, isLocal: false, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!742 = !DILocalVariable(name: "nick", arg: 1, scope: !741, file: !44, line: 146, type: !115)
!743 = !DILocation(line: 146, column: 49, scope: !741)
!744 = !DILocalVariable(name: "rec", scope: !741, file: !44, line: 148, type: !124)
!745 = !DILocation(line: 148, column: 16, scope: !741)
!746 = !DILocation(line: 150, column: 2, scope: !741)
!747 = distinct !{!747, !746}
!748 = !DILocation(line: 150, column: 10, scope: !749)
!749 = !DILexicalBlockFile(scope: !750, file: !44, discriminator: 1)
!750 = distinct !DILexicalBlock(scope: !751, file: !44, line: 150, column: 10)
!751 = distinct !DILexicalBlock(scope: !741, file: !44, line: 150, column: 4)
!752 = !DILocation(line: 150, column: 15, scope: !749)
!753 = !DILocation(line: 150, column: 5, scope: !754)
!754 = !DILexicalBlockFile(scope: !755, file: !44, discriminator: 2)
!755 = distinct !DILexicalBlock(scope: !750, file: !44, line: 150, column: 3)
!756 = !DILocation(line: 150, column: 14, scope: !757)
!757 = !DILexicalBlockFile(scope: !758, file: !44, discriminator: 3)
!758 = distinct !DILexicalBlock(scope: !750, file: !44, line: 150, column: 12)
!759 = !DILocation(line: 150, column: 99, scope: !757)
!760 = !DILocation(line: 150, column: 110, scope: !761)
!761 = !DILexicalBlockFile(scope: !751, file: !44, discriminator: 4)
!762 = !DILocation(line: 152, column: 22, scope: !741)
!763 = !DILocation(line: 152, column: 39, scope: !741)
!764 = !DILocation(line: 152, column: 8, scope: !741)
!765 = !DILocation(line: 152, column: 6, scope: !741)
!766 = !DILocation(line: 153, column: 13, scope: !767)
!767 = distinct !DILexicalBlock(scope: !741, file: !44, line: 153, column: 13)
!768 = !DILocation(line: 153, column: 17, scope: !767)
!769 = !DILocation(line: 153, column: 13, scope: !741)
!770 = !DILocation(line: 153, column: 60, scope: !771)
!771 = !DILexicalBlockFile(scope: !767, file: !44, discriminator: 1)
!772 = !DILocation(line: 153, column: 25, scope: !771)
!773 = !DILocation(line: 154, column: 1, scope: !741)
!774 = distinct !DISubprogram(name: "last_msg_find", scope: !44, file: !44, line: 74, type: !775, isLocal: true, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!775 = !DISubroutineType(types: !776)
!776 = !{!124, !144, !115}
!777 = !DILocalVariable(name: "list", arg: 1, scope: !774, file: !44, line: 74, type: !144)
!778 = !DILocation(line: 74, column: 44, scope: !774)
!779 = !DILocalVariable(name: "nick", arg: 2, scope: !774, file: !44, line: 74, type: !115)
!780 = !DILocation(line: 74, column: 62, scope: !774)
!781 = !DILocation(line: 76, column: 2, scope: !774)
!782 = !DILocation(line: 76, column: 9, scope: !783)
!783 = !DILexicalBlockFile(scope: !774, file: !44, discriminator: 1)
!784 = !DILocation(line: 76, column: 14, scope: !783)
!785 = !DILocation(line: 76, column: 2, scope: !783)
!786 = !DILocalVariable(name: "rec", scope: !787, file: !44, line: 77, type: !124)
!787 = distinct !DILexicalBlock(scope: !774, file: !44, line: 76, column: 22)
!788 = !DILocation(line: 77, column: 17, scope: !787)
!789 = !DILocation(line: 77, column: 23, scope: !787)
!790 = !DILocation(line: 77, column: 29, scope: !787)
!791 = !DILocation(line: 79, column: 26, scope: !792)
!792 = distinct !DILexicalBlock(scope: !787, file: !44, line: 79, column: 7)
!793 = !DILocation(line: 79, column: 31, scope: !792)
!794 = !DILocation(line: 79, column: 37, scope: !792)
!795 = !DILocation(line: 79, column: 7, scope: !792)
!796 = !DILocation(line: 79, column: 43, scope: !792)
!797 = !DILocation(line: 79, column: 7, scope: !787)
!798 = !DILocation(line: 80, column: 11, scope: !792)
!799 = !DILocation(line: 80, column: 4, scope: !792)
!800 = !DILocation(line: 81, column: 10, scope: !787)
!801 = !DILocation(line: 81, column: 16, scope: !787)
!802 = !DILocation(line: 81, column: 8, scope: !787)
!803 = !DILocation(line: 76, column: 2, scope: !804)
!804 = !DILexicalBlockFile(scope: !774, file: !44, discriminator: 2)
!805 = distinct !{!805, !781}
!806 = !DILocation(line: 84, column: 2, scope: !774)
!807 = !DILocation(line: 85, column: 1, scope: !774)
!808 = distinct !DISubprogram(name: "last_msg_destroy", scope: !44, file: !44, line: 99, type: !809, isLocal: true, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!809 = !DISubroutineType(types: !810)
!810 = !{null, !641, !124}
!811 = !DILocalVariable(name: "list", arg: 1, scope: !808, file: !44, line: 99, type: !641)
!812 = !DILocation(line: 99, column: 39, scope: !808)
!813 = !DILocalVariable(name: "rec", arg: 2, scope: !808, file: !44, line: 99, type: !124)
!814 = !DILocation(line: 99, column: 59, scope: !808)
!815 = !DILocation(line: 101, column: 26, scope: !808)
!816 = !DILocation(line: 101, column: 25, scope: !808)
!817 = !DILocation(line: 101, column: 32, scope: !808)
!818 = !DILocation(line: 101, column: 10, scope: !808)
!819 = !DILocation(line: 101, column: 3, scope: !808)
!820 = !DILocation(line: 101, column: 8, scope: !808)
!821 = !DILocation(line: 103, column: 9, scope: !808)
!822 = !DILocation(line: 103, column: 14, scope: !808)
!823 = !DILocation(line: 103, column: 2, scope: !808)
!824 = !DILocation(line: 104, column: 9, scope: !808)
!825 = !DILocation(line: 104, column: 2, scope: !808)
!826 = !DILocation(line: 105, column: 1, scope: !808)
!827 = distinct !DISubprogram(name: "completion_last_message_rename", scope: !44, file: !44, line: 156, type: !828, isLocal: false, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !115, !115}
!830 = !DILocalVariable(name: "oldnick", arg: 1, scope: !827, file: !44, line: 156, type: !115)
!831 = !DILocation(line: 156, column: 49, scope: !827)
!832 = !DILocalVariable(name: "newnick", arg: 2, scope: !827, file: !44, line: 156, type: !115)
!833 = !DILocation(line: 156, column: 70, scope: !827)
!834 = !DILocalVariable(name: "rec", scope: !827, file: !44, line: 158, type: !124)
!835 = !DILocation(line: 158, column: 16, scope: !827)
!836 = !DILocation(line: 160, column: 2, scope: !827)
!837 = distinct !{!837, !836}
!838 = !DILocation(line: 160, column: 10, scope: !839)
!839 = !DILexicalBlockFile(scope: !840, file: !44, discriminator: 1)
!840 = distinct !DILexicalBlock(scope: !841, file: !44, line: 160, column: 10)
!841 = distinct !DILexicalBlock(scope: !827, file: !44, line: 160, column: 4)
!842 = !DILocation(line: 160, column: 18, scope: !839)
!843 = !DILocation(line: 160, column: 5, scope: !844)
!844 = !DILexicalBlockFile(scope: !845, file: !44, discriminator: 2)
!845 = distinct !DILexicalBlock(scope: !840, file: !44, line: 160, column: 3)
!846 = !DILocation(line: 160, column: 14, scope: !847)
!847 = !DILexicalBlockFile(scope: !848, file: !44, discriminator: 3)
!848 = distinct !DILexicalBlock(scope: !840, file: !44, line: 160, column: 12)
!849 = !DILocation(line: 160, column: 102, scope: !847)
!850 = !DILocation(line: 160, column: 113, scope: !851)
!851 = !DILexicalBlockFile(scope: !841, file: !44, discriminator: 4)
!852 = !DILocation(line: 161, column: 2, scope: !827)
!853 = distinct !{!853, !852}
!854 = !DILocation(line: 161, column: 10, scope: !855)
!855 = !DILexicalBlockFile(scope: !856, file: !44, discriminator: 1)
!856 = distinct !DILexicalBlock(scope: !857, file: !44, line: 161, column: 10)
!857 = distinct !DILexicalBlock(scope: !827, file: !44, line: 161, column: 4)
!858 = !DILocation(line: 161, column: 18, scope: !855)
!859 = !DILocation(line: 161, column: 5, scope: !860)
!860 = !DILexicalBlockFile(scope: !861, file: !44, discriminator: 2)
!861 = distinct !DILexicalBlock(scope: !856, file: !44, line: 161, column: 3)
!862 = !DILocation(line: 161, column: 14, scope: !863)
!863 = !DILexicalBlockFile(scope: !864, file: !44, discriminator: 3)
!864 = distinct !DILexicalBlock(scope: !856, file: !44, line: 161, column: 12)
!865 = !DILocation(line: 161, column: 102, scope: !863)
!866 = !DILocation(line: 161, column: 113, scope: !867)
!867 = !DILexicalBlockFile(scope: !857, file: !44, discriminator: 4)
!868 = !DILocation(line: 163, column: 22, scope: !827)
!869 = !DILocation(line: 163, column: 39, scope: !827)
!870 = !DILocation(line: 163, column: 8, scope: !827)
!871 = !DILocation(line: 163, column: 6, scope: !827)
!872 = !DILocation(line: 164, column: 6, scope: !873)
!873 = distinct !DILexicalBlock(scope: !827, file: !44, line: 164, column: 6)
!874 = !DILocation(line: 164, column: 10, scope: !873)
!875 = !DILocation(line: 164, column: 6, scope: !827)
!876 = !DILocation(line: 165, column: 10, scope: !877)
!877 = distinct !DILexicalBlock(scope: !873, file: !44, line: 164, column: 18)
!878 = !DILocation(line: 165, column: 15, scope: !877)
!879 = !DILocation(line: 165, column: 3, scope: !877)
!880 = !DILocation(line: 166, column: 38, scope: !877)
!881 = !DILocation(line: 166, column: 29, scope: !877)
!882 = !DILocation(line: 166, column: 17, scope: !877)
!883 = !DILocation(line: 166, column: 22, scope: !877)
!884 = !DILocation(line: 166, column: 27, scope: !877)
!885 = !DILocation(line: 167, column: 2, scope: !877)
!886 = !DILocation(line: 168, column: 1, scope: !827)
!887 = distinct !DISubprogram(name: "completion_msg", scope: !44, file: !44, line: 324, type: !888, isLocal: false, isDefinition: true, scopeLine: 327, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!888 = !DISubroutineType(types: !889)
!889 = !{!890, !174, !174, !115, !115}
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64, align: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !892, line: 37, baseType: !893)
!892 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !892, line: 39, size: 192, align: 64, elements: !894)
!894 = !{!895, !896, !897}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !893, file: !892, line: 41, baseType: !150, size: 64, align: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !893, file: !892, line: 42, baseType: !890, size: 64, align: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !893, file: !892, line: 43, baseType: !890, size: 64, align: 64, offset: 128)
!898 = !DILocalVariable(name: "win_server", arg: 1, scope: !887, file: !44, line: 324, type: !174)
!899 = !DILocation(line: 324, column: 35, scope: !887)
!900 = !DILocalVariable(name: "find_server", arg: 2, scope: !887, file: !44, line: 325, type: !174)
!901 = !DILocation(line: 325, column: 21, scope: !887)
!902 = !DILocalVariable(name: "nick", arg: 3, scope: !887, file: !44, line: 326, type: !115)
!903 = !DILocation(line: 326, column: 21, scope: !887)
!904 = !DILocalVariable(name: "prefix", arg: 4, scope: !887, file: !44, line: 326, type: !115)
!905 = !DILocation(line: 326, column: 39, scope: !887)
!906 = !DILocalVariable(name: "tmp", scope: !887, file: !44, line: 328, type: !144)
!907 = !DILocation(line: 328, column: 10, scope: !887)
!908 = !DILocalVariable(name: "list", scope: !887, file: !44, line: 328, type: !144)
!909 = !DILocation(line: 328, column: 16, scope: !887)
!910 = !DILocalVariable(name: "newprefix", scope: !887, file: !44, line: 329, type: !136)
!911 = !DILocation(line: 329, column: 8, scope: !887)
!912 = !DILocation(line: 331, column: 2, scope: !887)
!913 = distinct !{!913, !912}
!914 = !DILocation(line: 331, column: 10, scope: !915)
!915 = !DILexicalBlockFile(scope: !916, file: !44, discriminator: 1)
!916 = distinct !DILexicalBlock(scope: !917, file: !44, line: 331, column: 10)
!917 = distinct !DILexicalBlock(scope: !887, file: !44, line: 331, column: 4)
!918 = !DILocation(line: 331, column: 15, scope: !915)
!919 = !DILocation(line: 331, column: 5, scope: !920)
!920 = !DILexicalBlockFile(scope: !921, file: !44, discriminator: 2)
!921 = distinct !DILexicalBlock(scope: !916, file: !44, line: 331, column: 3)
!922 = !DILocation(line: 331, column: 14, scope: !923)
!923 = !DILexicalBlockFile(scope: !924, file: !44, discriminator: 3)
!924 = distinct !DILexicalBlock(scope: !916, file: !44, line: 331, column: 12)
!925 = !DILocation(line: 331, column: 99, scope: !923)
!926 = !DILocation(line: 331, column: 7, scope: !927)
!927 = !DILexicalBlockFile(scope: !917, file: !44, discriminator: 4)
!928 = !DILocation(line: 332, column: 6, scope: !929)
!929 = distinct !DILexicalBlock(scope: !887, file: !44, line: 332, column: 6)
!930 = !DILocation(line: 332, column: 14, scope: !929)
!931 = !DILocation(line: 332, column: 6, scope: !887)
!932 = !DILocation(line: 332, column: 22, scope: !933)
!933 = !DILexicalBlockFile(scope: !929, file: !44, discriminator: 1)
!934 = !DILocation(line: 334, column: 7, scope: !887)
!935 = !DILocation(line: 335, column: 6, scope: !936)
!936 = distinct !DILexicalBlock(scope: !887, file: !44, line: 335, column: 6)
!937 = !DILocation(line: 335, column: 18, scope: !936)
!938 = !DILocation(line: 335, column: 6, scope: !887)
!939 = !DILocation(line: 336, column: 32, scope: !940)
!940 = distinct !DILexicalBlock(scope: !936, file: !44, line: 335, column: 26)
!941 = !DILocation(line: 336, column: 45, scope: !940)
!942 = !DILocation(line: 336, column: 51, scope: !940)
!943 = !DILocation(line: 336, column: 3, scope: !940)
!944 = !DILocation(line: 337, column: 26, scope: !940)
!945 = !DILocation(line: 337, column: 10, scope: !940)
!946 = !DILocation(line: 337, column: 3, scope: !940)
!947 = !DILocation(line: 340, column: 36, scope: !887)
!948 = !DILocation(line: 340, column: 42, scope: !887)
!949 = !DILocation(line: 340, column: 2, scope: !887)
!950 = !DILocation(line: 341, column: 13, scope: !951)
!951 = distinct !DILexicalBlock(scope: !887, file: !44, line: 341, column: 2)
!952 = !DILocation(line: 341, column: 11, scope: !951)
!953 = !DILocation(line: 341, column: 7, scope: !951)
!954 = !DILocation(line: 341, column: 22, scope: !955)
!955 = !DILexicalBlockFile(scope: !956, file: !44, discriminator: 1)
!956 = distinct !DILexicalBlock(scope: !951, file: !44, line: 341, column: 2)
!957 = !DILocation(line: 341, column: 26, scope: !955)
!958 = !DILocation(line: 341, column: 2, scope: !955)
!959 = !DILocalVariable(name: "rec", scope: !960, file: !44, line: 342, type: !174)
!960 = distinct !DILexicalBlock(scope: !956, file: !44, line: 341, column: 51)
!961 = !DILocation(line: 342, column: 15, scope: !960)
!962 = !DILocation(line: 342, column: 21, scope: !960)
!963 = !DILocation(line: 342, column: 26, scope: !960)
!964 = !DILocation(line: 344, column: 7, scope: !965)
!965 = distinct !DILexicalBlock(scope: !960, file: !44, line: 344, column: 7)
!966 = !DILocation(line: 344, column: 16, scope: !965)
!967 = !DILocation(line: 344, column: 21, scope: !965)
!968 = !DILocation(line: 344, column: 28, scope: !965)
!969 = !DILocation(line: 344, column: 31, scope: !970)
!970 = !DILexicalBlockFile(scope: !965, file: !44, discriminator: 1)
!971 = !DILocation(line: 344, column: 38, scope: !970)
!972 = !DILocation(line: 344, column: 35, scope: !970)
!973 = !DILocation(line: 344, column: 7, scope: !970)
!974 = !DILocation(line: 345, column: 25, scope: !965)
!975 = !DILocation(line: 345, column: 16, scope: !965)
!976 = !DILocation(line: 345, column: 14, scope: !965)
!977 = !DILocation(line: 345, column: 4, scope: !965)
!978 = !DILocation(line: 347, column: 16, scope: !979)
!979 = distinct !DILexicalBlock(scope: !965, file: !44, line: 346, column: 8)
!980 = !DILocation(line: 347, column: 23, scope: !979)
!981 = !DILocation(line: 348, column: 28, scope: !979)
!982 = !DILocation(line: 348, column: 33, scope: !979)
!983 = !DILocation(line: 348, column: 5, scope: !979)
!984 = !DILocation(line: 347, column: 16, scope: !985)
!985 = !DILexicalBlockFile(scope: !979, file: !44, discriminator: 1)
!986 = !DILocation(line: 349, column: 31, scope: !979)
!987 = !DILocation(line: 349, column: 39, scope: !979)
!988 = !DILocation(line: 349, column: 44, scope: !979)
!989 = !DILocation(line: 349, column: 5, scope: !979)
!990 = !DILocation(line: 347, column: 16, scope: !991)
!991 = !DILexicalBlockFile(scope: !979, file: !44, discriminator: 2)
!992 = !DILocation(line: 347, column: 16, scope: !993)
!993 = !DILexicalBlockFile(scope: !979, file: !44, discriminator: 3)
!994 = !DILocation(line: 347, column: 14, scope: !993)
!995 = !DILocation(line: 352, column: 32, scope: !960)
!996 = !DILocation(line: 352, column: 37, scope: !960)
!997 = !DILocation(line: 352, column: 43, scope: !960)
!998 = !DILocation(line: 352, column: 3, scope: !960)
!999 = !DILocation(line: 353, column: 10, scope: !960)
!1000 = !DILocation(line: 353, column: 3, scope: !960)
!1001 = !DILocation(line: 354, column: 2, scope: !960)
!1002 = !DILocation(line: 341, column: 40, scope: !1003)
!1003 = !DILexicalBlockFile(scope: !956, file: !44, discriminator: 2)
!1004 = !DILocation(line: 341, column: 45, scope: !1003)
!1005 = !DILocation(line: 341, column: 38, scope: !1003)
!1006 = !DILocation(line: 341, column: 2, scope: !1003)
!1007 = distinct !{!1007, !1008}
!1008 = !DILocation(line: 341, column: 2, scope: !887)
!1009 = !DILocation(line: 356, column: 25, scope: !887)
!1010 = !DILocation(line: 356, column: 9, scope: !887)
!1011 = !DILocation(line: 356, column: 2, scope: !887)
!1012 = !DILocation(line: 357, column: 1, scope: !887)
!1013 = distinct !DISubprogram(name: "completion_msg_server", scope: !44, file: !44, line: 278, type: !1014, isLocal: true, isDefinition: true, scopeLine: 280, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{null, !641, !174, !115, !115}
!1016 = !DILocalVariable(name: "list", arg: 1, scope: !1013, file: !44, line: 278, type: !641)
!1017 = !DILocation(line: 278, column: 44, scope: !1013)
!1018 = !DILocalVariable(name: "server", arg: 2, scope: !1013, file: !44, line: 278, type: !174)
!1019 = !DILocation(line: 278, column: 62, scope: !1013)
!1020 = !DILocalVariable(name: "nick", arg: 3, scope: !1013, file: !44, line: 279, type: !115)
!1021 = !DILocation(line: 279, column: 19, scope: !1013)
!1022 = !DILocalVariable(name: "prefix", arg: 4, scope: !1013, file: !44, line: 279, type: !115)
!1023 = !DILocation(line: 279, column: 37, scope: !1013)
!1024 = !DILocalVariable(name: "msg", scope: !1013, file: !44, line: 281, type: !124)
!1025 = !DILocation(line: 281, column: 16, scope: !1013)
!1026 = !DILocalVariable(name: "tmp", scope: !1013, file: !44, line: 282, type: !144)
!1027 = !DILocation(line: 282, column: 10, scope: !1013)
!1028 = !DILocalVariable(name: "len", scope: !1013, file: !44, line: 283, type: !138)
!1029 = !DILocation(line: 283, column: 6, scope: !1013)
!1030 = !DILocation(line: 285, column: 2, scope: !1013)
!1031 = distinct !{!1031, !1030}
!1032 = !DILocation(line: 285, column: 10, scope: !1033)
!1033 = !DILexicalBlockFile(scope: !1034, file: !44, discriminator: 1)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !44, line: 285, column: 10)
!1035 = distinct !DILexicalBlock(scope: !1013, file: !44, line: 285, column: 4)
!1036 = !DILocation(line: 285, column: 15, scope: !1033)
!1037 = !DILocation(line: 285, column: 5, scope: !1038)
!1038 = !DILexicalBlockFile(scope: !1039, file: !44, discriminator: 2)
!1039 = distinct !DILexicalBlock(scope: !1034, file: !44, line: 285, column: 3)
!1040 = !DILocation(line: 285, column: 14, scope: !1041)
!1041 = !DILexicalBlockFile(scope: !1042, file: !44, discriminator: 3)
!1042 = distinct !DILexicalBlock(scope: !1034, file: !44, line: 285, column: 12)
!1043 = !DILocation(line: 285, column: 99, scope: !1041)
!1044 = !DILocation(line: 285, column: 110, scope: !1045)
!1045 = !DILexicalBlockFile(scope: !1035, file: !44, discriminator: 4)
!1046 = !DILocation(line: 287, column: 15, scope: !1013)
!1047 = !DILocation(line: 287, column: 8, scope: !1013)
!1048 = !DILocation(line: 287, column: 6, scope: !1013)
!1049 = !DILocation(line: 288, column: 8, scope: !1013)
!1050 = !DILocation(line: 288, column: 15, scope: !1013)
!1051 = !DILocation(line: 288, column: 24, scope: !1052)
!1052 = !DILexicalBlockFile(scope: !1013, file: !44, discriminator: 1)
!1053 = !DILocation(line: 288, column: 8, scope: !1052)
!1054 = !DILocation(line: 289, column: 47, scope: !1013)
!1055 = !DILocation(line: 289, column: 56, scope: !1013)
!1056 = !DILocation(line: 289, column: 26, scope: !1013)
!1057 = !DILocation(line: 289, column: 4, scope: !1013)
!1058 = !DILocation(line: 289, column: 89, scope: !1013)
!1059 = !DILocation(line: 288, column: 8, scope: !1060)
!1060 = !DILexicalBlockFile(scope: !1013, file: !44, discriminator: 2)
!1061 = !DILocation(line: 288, column: 8, scope: !1062)
!1062 = !DILexicalBlockFile(scope: !1013, file: !44, discriminator: 3)
!1063 = !DILocation(line: 288, column: 6, scope: !1062)
!1064 = !DILocation(line: 290, column: 2, scope: !1013)
!1065 = !DILocation(line: 290, column: 9, scope: !1066)
!1066 = !DILexicalBlockFile(scope: !1067, file: !44, discriminator: 1)
!1067 = distinct !DILexicalBlock(scope: !1068, file: !44, line: 290, column: 2)
!1068 = distinct !DILexicalBlock(scope: !1013, file: !44, line: 290, column: 2)
!1069 = !DILocation(line: 290, column: 13, scope: !1066)
!1070 = !DILocation(line: 290, column: 2, scope: !1066)
!1071 = !DILocalVariable(name: "rec", scope: !1072, file: !44, line: 291, type: !124)
!1072 = distinct !DILexicalBlock(scope: !1067, file: !44, line: 290, column: 38)
!1073 = !DILocation(line: 291, column: 17, scope: !1072)
!1074 = !DILocation(line: 291, column: 23, scope: !1072)
!1075 = !DILocation(line: 291, column: 28, scope: !1072)
!1076 = !DILocation(line: 293, column: 7, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1072, file: !44, line: 293, column: 7)
!1078 = !DILocation(line: 293, column: 11, scope: !1077)
!1079 = !DILocation(line: 293, column: 16, scope: !1077)
!1080 = !DILocation(line: 293, column: 39, scope: !1081)
!1081 = !DILexicalBlockFile(scope: !1077, file: !44, discriminator: 1)
!1082 = !DILocation(line: 293, column: 44, scope: !1081)
!1083 = !DILocation(line: 293, column: 50, scope: !1081)
!1084 = !DILocation(line: 293, column: 56, scope: !1081)
!1085 = !DILocation(line: 293, column: 19, scope: !1081)
!1086 = !DILocation(line: 293, column: 61, scope: !1081)
!1087 = !DILocation(line: 293, column: 7, scope: !1081)
!1088 = !DILocation(line: 294, column: 4, scope: !1077)
!1089 = !DILocation(line: 296, column: 27, scope: !1072)
!1090 = !DILocation(line: 296, column: 10, scope: !1072)
!1091 = !DILocation(line: 296, column: 7, scope: !1072)
!1092 = !DILocation(line: 297, column: 15, scope: !1072)
!1093 = !DILocation(line: 297, column: 20, scope: !1072)
!1094 = !DILocation(line: 297, column: 3, scope: !1072)
!1095 = !DILocation(line: 297, column: 8, scope: !1072)
!1096 = !DILocation(line: 297, column: 13, scope: !1072)
!1097 = !DILocation(line: 298, column: 15, scope: !1072)
!1098 = !DILocation(line: 298, column: 22, scope: !1072)
!1099 = !DILocation(line: 298, column: 29, scope: !1072)
!1100 = !DILocation(line: 298, column: 33, scope: !1101)
!1101 = !DILexicalBlockFile(scope: !1072, file: !44, discriminator: 1)
!1102 = !DILocation(line: 298, column: 32, scope: !1101)
!1103 = !DILocation(line: 298, column: 40, scope: !1101)
!1104 = !DILocation(line: 298, column: 15, scope: !1101)
!1105 = !DILocation(line: 299, column: 13, scope: !1072)
!1106 = !DILocation(line: 299, column: 18, scope: !1072)
!1107 = !DILocation(line: 299, column: 4, scope: !1072)
!1108 = !DILocation(line: 298, column: 15, scope: !1109)
!1109 = !DILexicalBlockFile(scope: !1072, file: !44, discriminator: 2)
!1110 = !DILocation(line: 300, column: 16, scope: !1072)
!1111 = !DILocation(line: 300, column: 29, scope: !1072)
!1112 = !DILocation(line: 300, column: 34, scope: !1072)
!1113 = !DILocation(line: 300, column: 4, scope: !1072)
!1114 = !DILocation(line: 298, column: 15, scope: !1115)
!1115 = !DILexicalBlockFile(scope: !1072, file: !44, discriminator: 3)
!1116 = !DILocation(line: 298, column: 15, scope: !1117)
!1117 = !DILexicalBlockFile(scope: !1072, file: !44, discriminator: 4)
!1118 = !DILocation(line: 298, column: 3, scope: !1117)
!1119 = !DILocation(line: 298, column: 8, scope: !1117)
!1120 = !DILocation(line: 298, column: 13, scope: !1117)
!1121 = !DILocation(line: 301, column: 34, scope: !1072)
!1122 = !DILocation(line: 301, column: 33, scope: !1072)
!1123 = !DILocation(line: 301, column: 40, scope: !1072)
!1124 = !DILocation(line: 301, column: 11, scope: !1072)
!1125 = !DILocation(line: 301, column: 4, scope: !1072)
!1126 = !DILocation(line: 301, column: 9, scope: !1072)
!1127 = !DILocation(line: 303, column: 2, scope: !1072)
!1128 = !DILocation(line: 290, column: 27, scope: !1129)
!1129 = !DILexicalBlockFile(scope: !1067, file: !44, discriminator: 2)
!1130 = !DILocation(line: 290, column: 32, scope: !1129)
!1131 = !DILocation(line: 290, column: 25, scope: !1129)
!1132 = !DILocation(line: 290, column: 2, scope: !1129)
!1133 = distinct !{!1133, !1064}
!1134 = !DILocation(line: 304, column: 1, scope: !1013)
!1135 = distinct !DISubprogram(name: "convert_msglist", scope: !44, file: !44, line: 307, type: !1136, isLocal: true, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!890, !144}
!1138 = !DILocalVariable(name: "msglist", arg: 1, scope: !1135, file: !44, line: 307, type: !144)
!1139 = !DILocation(line: 307, column: 39, scope: !1135)
!1140 = !DILocalVariable(name: "list", scope: !1135, file: !44, line: 309, type: !890)
!1141 = !DILocation(line: 309, column: 9, scope: !1135)
!1142 = !DILocation(line: 311, column: 7, scope: !1135)
!1143 = !DILocation(line: 312, column: 2, scope: !1135)
!1144 = !DILocation(line: 312, column: 9, scope: !1145)
!1145 = !DILexicalBlockFile(scope: !1135, file: !44, discriminator: 1)
!1146 = !DILocation(line: 312, column: 17, scope: !1145)
!1147 = !DILocation(line: 312, column: 2, scope: !1145)
!1148 = !DILocalVariable(name: "rec", scope: !1149, file: !44, line: 313, type: !124)
!1149 = distinct !DILexicalBlock(scope: !1135, file: !44, line: 312, column: 25)
!1150 = !DILocation(line: 313, column: 17, scope: !1149)
!1151 = !DILocation(line: 313, column: 23, scope: !1149)
!1152 = !DILocation(line: 313, column: 32, scope: !1149)
!1153 = !DILocation(line: 315, column: 38, scope: !1149)
!1154 = !DILocation(line: 315, column: 44, scope: !1149)
!1155 = !DILocation(line: 315, column: 49, scope: !1149)
!1156 = !DILocation(line: 315, column: 24, scope: !1149)
!1157 = !DILocation(line: 315, column: 22, scope: !1149)
!1158 = !DILocation(line: 316, column: 28, scope: !1149)
!1159 = !DILocation(line: 316, column: 37, scope: !1149)
!1160 = !DILocation(line: 316, column: 13, scope: !1149)
!1161 = !DILocation(line: 316, column: 11, scope: !1149)
!1162 = !DILocation(line: 317, column: 10, scope: !1149)
!1163 = !DILocation(line: 317, column: 3, scope: !1149)
!1164 = !DILocation(line: 312, column: 2, scope: !1165)
!1165 = !DILexicalBlockFile(scope: !1135, file: !44, discriminator: 2)
!1166 = distinct !{!1166, !1143}
!1167 = !DILocation(line: 320, column: 9, scope: !1135)
!1168 = !DILocation(line: 320, column: 2, scope: !1135)
!1169 = distinct !DISubprogram(name: "completion_get_servertags", scope: !44, file: !44, line: 520, type: !1170, isLocal: false, isDefinition: true, scopeLine: 521, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!890, !115}
!1172 = !DILocalVariable(name: "word", arg: 1, scope: !1169, file: !44, line: 520, type: !115)
!1173 = !DILocation(line: 520, column: 46, scope: !1169)
!1174 = !DILocalVariable(name: "list", scope: !1169, file: !44, line: 522, type: !890)
!1175 = !DILocation(line: 522, column: 9, scope: !1169)
!1176 = !DILocalVariable(name: "tmp", scope: !1169, file: !44, line: 523, type: !144)
!1177 = !DILocation(line: 523, column: 10, scope: !1169)
!1178 = !DILocalVariable(name: "len", scope: !1169, file: !44, line: 524, type: !138)
!1179 = !DILocation(line: 524, column: 6, scope: !1169)
!1180 = !DILocation(line: 526, column: 2, scope: !1169)
!1181 = distinct !{!1181, !1180}
!1182 = !DILocation(line: 526, column: 10, scope: !1183)
!1183 = !DILexicalBlockFile(scope: !1184, file: !44, discriminator: 1)
!1184 = distinct !DILexicalBlock(scope: !1185, file: !44, line: 526, column: 10)
!1185 = distinct !DILexicalBlock(scope: !1169, file: !44, line: 526, column: 4)
!1186 = !DILocation(line: 526, column: 15, scope: !1183)
!1187 = !DILocation(line: 526, column: 5, scope: !1188)
!1188 = !DILexicalBlockFile(scope: !1189, file: !44, discriminator: 2)
!1189 = distinct !DILexicalBlock(scope: !1184, file: !44, line: 526, column: 3)
!1190 = !DILocation(line: 526, column: 14, scope: !1191)
!1191 = !DILexicalBlockFile(scope: !1192, file: !44, discriminator: 3)
!1192 = distinct !DILexicalBlock(scope: !1184, file: !44, line: 526, column: 12)
!1193 = !DILocation(line: 526, column: 99, scope: !1191)
!1194 = !DILocation(line: 526, column: 7, scope: !1195)
!1195 = !DILexicalBlockFile(scope: !1185, file: !44, discriminator: 4)
!1196 = !DILocation(line: 528, column: 15, scope: !1169)
!1197 = !DILocation(line: 528, column: 8, scope: !1169)
!1198 = !DILocation(line: 528, column: 6, scope: !1169)
!1199 = !DILocation(line: 529, column: 7, scope: !1169)
!1200 = !DILocation(line: 531, column: 13, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1169, file: !44, line: 531, column: 2)
!1202 = !DILocation(line: 531, column: 11, scope: !1201)
!1203 = !DILocation(line: 531, column: 7, scope: !1201)
!1204 = !DILocation(line: 531, column: 22, scope: !1205)
