; ModuleID = './line308-fe-ircnet.o.i'
source_filename = "./line308-fe-ircnet.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }
%struct._SERVER_CONNECT_REC = type { i32, i32, i32, i8*, i32, i8*, i8*, i8*, i16, i8*, i8*, i32, i8*, %struct._IPADDR*, %struct._IPADDR*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._GIOChannel*, i8, i8*, i8* }
%struct._IPADDR = type opaque
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }

!145 = !DIEnumerator(name: "IRCTXT_WHOIS_REALHOST", value: 76)
!146 = !DIEnumerator(name: "IRCTXT_WHOIS_USERMODE", value: 77)
!147 = !DIEnumerator(name: "IRCTXT_WHOIS_CHANNELS", value: 78)
!148 = !DIEnumerator(name: "IRCTXT_WHOIS_AWAY", value: 79)
!149 = !DIEnumerator(name: "IRCTXT_WHOIS_SPECIAL", value: 80)
!150 = !DIEnumerator(name: "IRCTXT_WHOIS_EXTRA", value: 81)
!151 = !DIEnumerator(name: "IRCTXT_END_OF_WHOIS", value: 82)
!152 = !DIEnumerator(name: "IRCTXT_END_OF_WHOWAS", value: 83)
!153 = !DIEnumerator(name: "IRCTXT_WHOIS_NOT_FOUND", value: 84)
!154 = !DIEnumerator(name: "IRCTXT_WHO", value: 85)
!155 = !DIEnumerator(name: "IRCTXT_END_OF_WHO", value: 86)
!156 = !DIEnumerator(name: "IRCTXT_FILL_6", value: 87)
!157 = !DIEnumerator(name: "IRCTXT_OWN_NOTICE", value: 88)
!158 = !DIEnumerator(name: "IRCTXT_OWN_ACTION", value: 89)
!159 = !DIEnumerator(name: "IRCTXT_OWN_ACTION_TARGET", value: 90)
!160 = !DIEnumerator(name: "IRCTXT_OWN_CTCP", value: 91)
!161 = !DIEnumerator(name: "IRCTXT_FILL_7", value: 92)
!162 = !DIEnumerator(name: "IRCTXT_NOTICE_SERVER", value: 93)
!163 = !DIEnumerator(name: "IRCTXT_NOTICE_PUBLIC", value: 94)
!164 = !DIEnumerator(name: "IRCTXT_NOTICE_PRIVATE", value: 95)
!165 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE", value: 96)
!166 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE_QUERY", value: 97)
!167 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC", value: 98)
!168 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC_CHANNEL", value: 99)
!169 = !DIEnumerator(name: "IRCTXT_FILL_8", value: 100)
!170 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY", value: 101)
!171 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY_CHANNEL", value: 102)
!172 = !DIEnumerator(name: "IRCTXT_CTCP_PING_REPLY", value: 103)
!173 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED", value: 104)
!174 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED_UNKNOWN", value: 105)
!175 = !DIEnumerator(name: "IRCTXT_FILL_10", value: 106)
!176 = !DIEnumerator(name: "IRCTXT_ONLINE", value: 107)
!177 = !DIEnumerator(name: "IRCTXT_PONG", value: 108)
!178 = !DIEnumerator(name: "IRCTXT_WALLOPS", value: 109)
!179 = !DIEnumerator(name: "IRCTXT_ACTION_WALLOPS", value: 110)
!180 = !DIEnumerator(name: "IRCTXT_KILL", value: 111)
!181 = !DIEnumerator(name: "IRCTXT_KILL_SERVER", value: 112)
!182 = !DIEnumerator(name: "IRCTXT_ERROR", value: 113)
!183 = !DIEnumerator(name: "IRCTXT_UNKNOWN_MODE", value: 114)
!184 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT", value: 115)
!185 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT_SERVER", value: 116)
!186 = !DIEnumerator(name: "IRCTXT_FILL_11", value: 117)
!187 = !DIEnumerator(name: "IRCTXT_SILENCED", value: 118)
!188 = !DIEnumerator(name: "IRCTXT_UNSILENCED", value: 119)
!189 = !DIEnumerator(name: "IRCTXT_SILENCE_LINE", value: 120)
!190 = !DIEnumerator(name: "IRCTXT_ASK_OPER_PASS", value: 121)
!191 = !DIEnumerator(name: "IRCTXT_ACCEPT_LIST", value: 122)
!192 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !193, line: 25, size: 32, align: 32, elements: !194)
!193 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212}
!195 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!196 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!197 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!198 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!199 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!200 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!201 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!202 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!203 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!204 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!205 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!206 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!207 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!208 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!209 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!210 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!211 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!212 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!213 = !{!214, !221, !222, !258, !273, !275}
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !215, line: 9, baseType: !216)
!215 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !219, !219, !219, !219, !219, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHATNET_REC", file: !224, line: 4, baseType: !225)
!224 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHATNET_REC", file: !226, line: 17, size: 1152, align: 64, elements: !227)
!226 = !DIFile(filename: "../../../src/irc/core/irc-chatnets.h", directory: "/home/lichi/Desktop/irssi/task1")
!227 = !{!228, !231, !232, !235, !236, !237, !238, !239, !240, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !225, file: !229, line: 1, baseType: !230, size: 32, align: 32)
!229 = !DIFile(filename: "../../../src/core/chatnet-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!230 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !225, file: !229, line: 2, baseType: !230, size: 32, align: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !225, file: !229, line: 4, baseType: !233, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !225, file: !229, line: 6, baseType: !233, size: 64, align: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !225, file: !229, line: 7, baseType: !233, size: 64, align: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !225, file: !229, line: 8, baseType: !233, size: 64, align: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "own_host", scope: !225, file: !229, line: 10, baseType: !233, size: 64, align: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "autosendcmd", scope: !225, file: !229, line: 11, baseType: !233, size: 64, align: 64, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !225, file: !229, line: 12, baseType: !241, size: 64, align: 64, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !243, line: 99, baseType: !244)
!243 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !243, line: 99, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !225, file: !229, line: 12, baseType: !241, size: 64, align: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !225, file: !226, line: 20, baseType: !233, size: 64, align: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !225, file: !226, line: 21, baseType: !233, size: 64, align: 64, offset: 640)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !225, file: !226, line: 23, baseType: !233, size: 64, align: 64, offset: 704)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !225, file: !226, line: 24, baseType: !233, size: 64, align: 64, offset: 768)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !225, file: !226, line: 25, baseType: !233, size: 64, align: 64, offset: 832)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !225, file: !226, line: 27, baseType: !230, size: 32, align: 32, offset: 896)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !225, file: !226, line: 28, baseType: !230, size: 32, align: 32, offset: 928)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !225, file: !226, line: 29, baseType: !230, size: 32, align: 32, offset: 960)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !225, file: !226, line: 32, baseType: !230, size: 32, align: 32, offset: 992)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !225, file: !226, line: 32, baseType: !230, size: 32, align: 32, offset: 1024)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !225, file: !226, line: 32, baseType: !230, size: 32, align: 32, offset: 1056)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !225, file: !226, line: 32, baseType: !230, size: 32, align: 32, offset: 1088)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHATNET_REC", file: !243, line: 106, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHATNET_REC", file: !261, line: 13, size: 576, align: 64, elements: !262)
!261 = !DIFile(filename: "../../../src/core/chatnets.h", directory: "/home/lichi/Desktop/irssi/task1")
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !272}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !260, file: !229, line: 1, baseType: !230, size: 32, align: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !260, file: !229, line: 2, baseType: !230, size: 32, align: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !229, line: 4, baseType: !233, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !260, file: !229, line: 6, baseType: !233, size: 64, align: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !260, file: !229, line: 7, baseType: !233, size: 64, align: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !260, file: !229, line: 8, baseType: !233, size: 64, align: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "own_host", scope: !260, file: !229, line: 10, baseType: !233, size: 64, align: 64, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "autosendcmd", scope: !260, file: !229, line: 11, baseType: !233, size: 64, align: 64, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !260, file: !229, line: 12, baseType: !241, size: 64, align: 64, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !260, file: !229, line: 12, baseType: !241, size: 64, align: 64, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !274, line: 77, baseType: !221)
!274 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !274, line: 48, baseType: !276)
!276 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!277 = !{i32 2, !"Dwarf Version", i32 4}
!278 = !{i32 2, !"Debug Info Version", i32 3}
!279 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!280 = distinct !DISubprogram(name: "fe_ircnet_init", scope: !281, file: !281, line: 226, type: !282, isLocal: false, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !284)
!281 = !DIFile(filename: "fe-ircnet.c", directory: "/home/lichi/Desktop/irssi/task1")
!282 = !DISubroutineType(types: !283)
!283 = !{null}
!284 = !{}
!285 = !DILocation(line: 228, column: 2, scope: !280)
!286 = !DILocation(line: 229, column: 2, scope: !280)
!287 = !DILocation(line: 230, column: 2, scope: !280)
!288 = !DILocation(line: 231, column: 2, scope: !280)
!289 = !DILocation(line: 232, column: 2, scope: !280)
!290 = !DILocation(line: 233, column: 2, scope: !280)
!291 = !DILocation(line: 235, column: 2, scope: !280)
!292 = !DILocation(line: 237, column: 2, scope: !280)
!293 = !DILocation(line: 239, column: 1, scope: !280)
!294 = distinct !DISubprogram(name: "cmd_network", scope: !281, file: !281, line: 218, type: !295, isLocal: true, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !284)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !297, !299, !631}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !243, line: 107, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !302, line: 30, size: 2240, align: 64, elements: !303)
!302 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!303 = !{!304, !306, !307, !308, !532, !537, !538, !539, !540, !541, !542, !543, !544, !545, !549, !550, !554, !555, !556, !560, !565, !566, !567, !568, !569, !570, !571, !572, !578, !579, !580, !581, !582, !586, !590, !594, !598, !602, !607, !700, !707, !711}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !301, file: !305, line: 3, baseType: !230, size: 32, align: 32)
!305 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!306 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !301, file: !305, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !301, file: !305, line: 6, baseType: !230, size: 32, align: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !301, file: !305, line: 8, baseType: !309, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !243, line: 113, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !302, line: 25, size: 1920, align: 64, elements: !312)
!312 = !{!313, !315, !316, !317, !318, !319, !320, !321, !322, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !311, file: !314, line: 3, baseType: !230, size: 32, align: 32)
!314 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!315 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !311, file: !314, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !311, file: !314, line: 6, baseType: !230, size: 32, align: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !311, file: !314, line: 9, baseType: !233, size: 64, align: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !311, file: !314, line: 10, baseType: !230, size: 32, align: 32, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !311, file: !314, line: 11, baseType: !233, size: 64, align: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !311, file: !314, line: 11, baseType: !233, size: 64, align: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !311, file: !314, line: 11, baseType: !233, size: 64, align: 64, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !311, file: !314, line: 13, baseType: !323, size: 16, align: 16, offset: 448)
!323 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !311, file: !314, line: 14, baseType: !233, size: 64, align: 64, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !311, file: !314, line: 15, baseType: !233, size: 64, align: 64, offset: 576)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !311, file: !314, line: 16, baseType: !230, size: 32, align: 32, offset: 640)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !311, file: !314, line: 17, baseType: !233, size: 64, align: 64, offset: 704)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !311, file: !314, line: 19, baseType: !241, size: 64, align: 64, offset: 768)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !311, file: !314, line: 19, baseType: !241, size: 64, align: 64, offset: 832)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !311, file: !314, line: 21, baseType: !233, size: 64, align: 64, offset: 896)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !311, file: !314, line: 22, baseType: !233, size: 64, align: 64, offset: 960)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !311, file: !314, line: 23, baseType: !233, size: 64, align: 64, offset: 1024)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !311, file: !314, line: 24, baseType: !233, size: 64, align: 64, offset: 1088)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !311, file: !314, line: 26, baseType: !233, size: 64, align: 64, offset: 1152)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !311, file: !314, line: 27, baseType: !233, size: 64, align: 64, offset: 1216)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !311, file: !314, line: 28, baseType: !233, size: 64, align: 64, offset: 1280)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !311, file: !314, line: 29, baseType: !233, size: 64, align: 64, offset: 1344)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !311, file: !314, line: 30, baseType: !233, size: 64, align: 64, offset: 1408)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !311, file: !314, line: 31, baseType: !233, size: 64, align: 64, offset: 1472)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !311, file: !314, line: 32, baseType: !233, size: 64, align: 64, offset: 1536)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !311, file: !314, line: 33, baseType: !233, size: 64, align: 64, offset: 1600)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !311, file: !314, line: 35, baseType: !343, size: 64, align: 64, offset: 1664)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !346)
!346 = !{!347, !349, !489, !490, !495, !496, !497, !498, !499, !508, !509, !510, !514, !515, !516, !517, !518, !519, !520, !521}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !345, file: !4, line: 100, baseType: !348, size: 32, align: 32)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !274, line: 49, baseType: !230)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !345, file: !4, line: 101, baseType: !350, size: 64, align: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !353)
!353 = !{!354, !378, !384, !390, !394, !476, !480, !485}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !352, file: !4, line: 133, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!358, !343, !359, !361, !364, !365}
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !274, line: 46, baseType: !234)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !362, line: 66, baseType: !363)
!362 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!363 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !368, line: 42, baseType: !369)
!368 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !368, line: 44, size: 128, align: 64, elements: !370)
!370 = !{!371, !376, !377}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !369, file: !368, line: 46, baseType: !372, size: 32, align: 32)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !373, line: 36, baseType: !374)
!373 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !362, line: 45, baseType: !375)
!375 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !369, file: !368, line: 47, baseType: !348, size: 32, align: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !369, file: !368, line: 48, baseType: !359, size: 64, align: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !352, file: !4, line: 138, baseType: !379, size: 64, align: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!358, !343, !382, !361, !364, !365}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !352, file: !4, line: 143, baseType: !385, size: 64, align: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!358, !343, !388, !389, !365}
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !362, line: 51, baseType: !276)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !352, file: !4, line: 147, baseType: !391, size: 64, align: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!358, !343, !365}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !352, file: !4, line: 149, baseType: !395, size: 64, align: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!398, !343, !475}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !401)
!401 = !{!402, !403, !424, !451, !453, !457, !458, !459, !460, !468, !469, !470, !471}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !400, file: !16, line: 174, baseType: !273, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !400, file: !16, line: 175, baseType: !404, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !407)
!407 = !{!408, !412, !413}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !406, file: !16, line: 198, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !273}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !406, file: !16, line: 199, baseType: !409, size: 64, align: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !406, file: !16, line: 200, baseType: !414, size: 64, align: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !273, !398, !417, !423}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!422, !273}
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !274, line: 50, baseType: !348)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !400, file: !16, line: 177, baseType: !425, size: 64, align: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !429)
!429 = !{!430, !435, !439, !443, !447, !448}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !428, file: !16, line: 216, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!422, !398, !434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !428, file: !16, line: 218, baseType: !436, size: 64, align: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!422, !398}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !428, file: !16, line: 219, baseType: !440, size: 64, align: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!422, !398, !418, !273}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !428, file: !16, line: 222, baseType: !444, size: 64, align: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !398}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !428, file: !16, line: 226, baseType: !418, size: 64, align: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !428, file: !16, line: 227, baseType: !449, size: 64, align: 64, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !400, file: !16, line: 178, baseType: !452, size: 32, align: 32, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !274, line: 55, baseType: !375)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !400, file: !16, line: 180, baseType: !454, size: 64, align: 64, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !456)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !400, file: !16, line: 182, baseType: !348, size: 32, align: 32, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !400, file: !16, line: 183, baseType: !452, size: 32, align: 32, offset: 352)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !400, file: !16, line: 184, baseType: !452, size: 32, align: 32, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !400, file: !16, line: 186, baseType: !461, size: 64, align: 64, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !463, line: 37, baseType: !464)
!463 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !463, line: 39, size: 128, align: 64, elements: !465)
!465 = !{!466, !467}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !464, file: !463, line: 41, baseType: !273, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !464, file: !463, line: 42, baseType: !461, size: 64, align: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !400, file: !16, line: 188, baseType: !398, size: 64, align: 64, offset: 512)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !400, file: !16, line: 189, baseType: !398, size: 64, align: 64, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !400, file: !16, line: 191, baseType: !233, size: 64, align: 64, offset: 640)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !400, file: !16, line: 193, baseType: !472, size: 64, align: 64, offset: 704)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !474)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !352, file: !4, line: 151, baseType: !477, size: 64, align: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !343}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !352, file: !4, line: 152, baseType: !481, size: 64, align: 64, offset: 384)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!358, !343, !484, !365}
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !352, file: !4, line: 155, baseType: !486, size: 64, align: 64, offset: 448)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!484, !343}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !345, file: !4, line: 103, baseType: !359, size: 64, align: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !345, file: !4, line: 104, baseType: !491, size: 64, align: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !492, line: 77, baseType: !493)
!492 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !492, line: 77, flags: DIFlagFwdDecl)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !345, file: !4, line: 105, baseType: !491, size: 64, align: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !345, file: !4, line: 106, baseType: !359, size: 64, align: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !345, file: !4, line: 107, baseType: !452, size: 32, align: 32, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !345, file: !4, line: 109, baseType: !361, size: 64, align: 64, offset: 448)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !345, file: !4, line: 110, baseType: !500, size: 64, align: 64, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !502, line: 39, baseType: !503)
!502 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !502, line: 41, size: 192, align: 64, elements: !504)
!504 = !{!505, !506, !507}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !503, file: !502, line: 43, baseType: !359, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !503, file: !502, line: 44, baseType: !361, size: 64, align: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !503, file: !502, line: 45, baseType: !361, size: 64, align: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !345, file: !4, line: 111, baseType: !500, size: 64, align: 64, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !345, file: !4, line: 112, baseType: !500, size: 64, align: 64, offset: 640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !345, file: !4, line: 113, baseType: !511, size: 48, align: 8, offset: 704)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 48, align: 8, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 6)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !345, file: !4, line: 117, baseType: !452, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !345, file: !4, line: 118, baseType: !452, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !345, file: !4, line: 119, baseType: !452, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !345, file: !4, line: 120, baseType: !452, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !345, file: !4, line: 121, baseType: !452, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !345, file: !4, line: 122, baseType: !452, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !345, file: !4, line: 124, baseType: !273, size: 64, align: 64, offset: 768)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !345, file: !4, line: 125, baseType: !273, size: 64, align: 64, offset: 832)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !311, file: !314, line: 38, baseType: !375, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !311, file: !314, line: 39, baseType: !375, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !311, file: !314, line: 40, baseType: !375, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !311, file: !314, line: 41, baseType: !375, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !311, file: !314, line: 42, baseType: !375, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !311, file: !314, line: 43, baseType: !375, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !311, file: !314, line: 44, baseType: !375, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !311, file: !314, line: 45, baseType: !375, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !311, file: !314, line: 46, baseType: !233, size: 64, align: 64, offset: 1792)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !311, file: !314, line: 47, baseType: !233, size: 64, align: 64, offset: 1856)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !301, file: !305, line: 9, baseType: !533, size: 64, align: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !534, line: 75, baseType: !535)
!534 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !536, line: 139, baseType: !276)
!536 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!537 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !301, file: !305, line: 10, baseType: !533, size: 64, align: 64, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !301, file: !305, line: 12, baseType: !233, size: 64, align: 64, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !301, file: !305, line: 13, baseType: !233, size: 64, align: 64, offset: 384)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !301, file: !305, line: 15, baseType: !375, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !301, file: !305, line: 16, baseType: !375, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !301, file: !305, line: 17, baseType: !375, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !301, file: !305, line: 18, baseType: !375, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !301, file: !305, line: 19, baseType: !375, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !301, file: !305, line: 21, baseType: !546, size: 64, align: 64, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !243, line: 102, baseType: !548)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !243, line: 102, flags: DIFlagFwdDecl)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !301, file: !305, line: 22, baseType: !230, size: 32, align: 32, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !301, file: !305, line: 25, baseType: !551, size: 128, align: 64, offset: 640)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 128, align: 64, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 2)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !301, file: !305, line: 26, baseType: !230, size: 32, align: 32, offset: 768)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !301, file: !305, line: 27, baseType: !230, size: 32, align: 32, offset: 800)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !301, file: !305, line: 29, baseType: !557, size: 64, align: 64, offset: 832)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !243, line: 103, baseType: !559)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !243, line: 103, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !301, file: !305, line: 30, baseType: !561, size: 64, align: 64, offset: 896)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !563, line: 37, baseType: !564)
!563 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !563, line: 37, flags: DIFlagFwdDecl)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !301, file: !305, line: 32, baseType: !233, size: 64, align: 64, offset: 960)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !301, file: !305, line: 33, baseType: !233, size: 64, align: 64, offset: 1024)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !301, file: !305, line: 34, baseType: !233, size: 64, align: 64, offset: 1088)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !301, file: !305, line: 35, baseType: !375, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !301, file: !305, line: 36, baseType: !375, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !301, file: !305, line: 37, baseType: !375, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !301, file: !305, line: 38, baseType: !375, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !301, file: !305, line: 40, baseType: !573, size: 128, align: 64, offset: 1216)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !274, line: 504, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !274, line: 506, size: 128, align: 64, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !574, file: !274, line: 508, baseType: !275, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !574, file: !274, line: 509, baseType: !275, size: 64, align: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !301, file: !305, line: 41, baseType: !533, size: 64, align: 64, offset: 1344)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !301, file: !305, line: 42, baseType: !230, size: 32, align: 32, offset: 1408)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !301, file: !305, line: 44, baseType: !461, size: 64, align: 64, offset: 1472)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !301, file: !305, line: 45, baseType: !461, size: 64, align: 64, offset: 1536)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !301, file: !305, line: 53, baseType: !583, size: 64, align: 64, offset: 1600)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, align: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !299, !297, !230}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !301, file: !305, line: 55, baseType: !587, size: 64, align: 64, offset: 1664)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!230, !299, !234}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !301, file: !305, line: 57, baseType: !591, size: 64, align: 64, offset: 1728)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!230, !299, !297}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !301, file: !305, line: 60, baseType: !595, size: 64, align: 64, offset: 1792)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!297, !299}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !301, file: !305, line: 62, baseType: !599, size: 64, align: 64, offset: 1856)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !299, !297, !297, !230}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !301, file: !305, line: 65, baseType: !603, size: 64, align: 64, offset: 1920)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!606, !299, !297, !297}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !301, file: !305, line: 69, baseType: !608, size: 64, align: 64, offset: 1984)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!611, !299, !297}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !243, line: 109, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !614, line: 15, size: 1408, align: 64, elements: !615)
!614 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!615 = !{!616, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !651, !652, !654, !655, !656, !657, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !613, file: !617, line: 3, baseType: !230, size: 32, align: 32)
!617 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!618 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !613, file: !617, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !613, file: !617, line: 5, baseType: !561, size: 64, align: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !613, file: !617, line: 7, baseType: !221, size: 64, align: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !613, file: !617, line: 8, baseType: !299, size: 64, align: 64, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !613, file: !617, line: 9, baseType: !233, size: 64, align: 64, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !613, file: !617, line: 10, baseType: !233, size: 64, align: 64, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !613, file: !617, line: 11, baseType: !533, size: 64, align: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !613, file: !617, line: 12, baseType: !230, size: 32, align: 32, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !613, file: !617, line: 13, baseType: !233, size: 64, align: 64, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !613, file: !617, line: 15, baseType: !628, size: 64, align: 64, offset: 576)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64, align: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !631}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !243, line: 108, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !634, line: 5, size: 704, align: 64, elements: !635)
!634 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !633, file: !617, line: 3, baseType: !230, size: 32, align: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !633, file: !617, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !633, file: !617, line: 5, baseType: !561, size: 64, align: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !633, file: !617, line: 7, baseType: !221, size: 64, align: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !633, file: !617, line: 8, baseType: !299, size: 64, align: 64, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !633, file: !617, line: 9, baseType: !233, size: 64, align: 64, offset: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !633, file: !617, line: 10, baseType: !233, size: 64, align: 64, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !633, file: !617, line: 11, baseType: !533, size: 64, align: 64, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !633, file: !617, line: 12, baseType: !230, size: 32, align: 32, offset: 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !633, file: !617, line: 13, baseType: !233, size: 64, align: 64, offset: 512)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !633, file: !617, line: 15, baseType: !628, size: 64, align: 64, offset: 576)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !633, file: !617, line: 17, baseType: !648, size: 64, align: 64, offset: 640)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64, align: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!297, !631}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !613, file: !617, line: 17, baseType: !648, size: 64, align: 64, offset: 640)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !613, file: !653, line: 5, baseType: !233, size: 64, align: 64, offset: 704)
!653 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!654 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !613, file: !653, line: 6, baseType: !233, size: 64, align: 64, offset: 768)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !613, file: !653, line: 7, baseType: !533, size: 64, align: 64, offset: 832)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !613, file: !653, line: 9, baseType: !561, size: 64, align: 64, offset: 896)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !613, file: !653, line: 10, baseType: !658, size: 64, align: 64, offset: 960)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !243, line: 111, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !661, line: 13, size: 576, align: 64, elements: !662)
!661 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!662 = !{!663, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !681, !682}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !660, file: !664, line: 3, baseType: !230, size: 32, align: 32)
!664 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!665 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !660, file: !664, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !660, file: !664, line: 6, baseType: !533, size: 64, align: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !660, file: !664, line: 8, baseType: !233, size: 64, align: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !660, file: !664, line: 9, baseType: !233, size: 64, align: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !660, file: !664, line: 10, baseType: !233, size: 64, align: 64, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !660, file: !664, line: 11, baseType: !230, size: 32, align: 32, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !660, file: !664, line: 14, baseType: !375, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !660, file: !664, line: 15, baseType: !375, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !660, file: !664, line: 18, baseType: !375, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !660, file: !664, line: 19, baseType: !375, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !660, file: !664, line: 20, baseType: !375, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !660, file: !664, line: 21, baseType: !375, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !660, file: !664, line: 22, baseType: !678, size: 64, align: 8, offset: 360)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 64, align: 8, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 8)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !660, file: !664, line: 26, baseType: !221, size: 64, align: 64, offset: 448)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !660, file: !664, line: 28, baseType: !658, size: 64, align: 64, offset: 512)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !613, file: !653, line: 12, baseType: !375, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !613, file: !653, line: 13, baseType: !233, size: 64, align: 64, offset: 1088)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !613, file: !653, line: 14, baseType: !230, size: 32, align: 32, offset: 1152)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !613, file: !653, line: 15, baseType: !233, size: 64, align: 64, offset: 1216)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !613, file: !653, line: 17, baseType: !375, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !613, file: !653, line: 18, baseType: !375, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !613, file: !653, line: 19, baseType: !375, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !613, file: !653, line: 20, baseType: !375, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !613, file: !653, line: 22, baseType: !375, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !613, file: !653, line: 23, baseType: !375, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !613, file: !653, line: 24, baseType: !375, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !613, file: !653, line: 25, baseType: !375, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !613, file: !653, line: 26, baseType: !375, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !613, file: !653, line: 31, baseType: !697, size: 64, align: 64, offset: 1344)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, align: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!233, !611}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !301, file: !305, line: 70, baseType: !701, size: 64, align: 64, offset: 2048)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64, align: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!704, !299, !297}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !243, line: 110, baseType: !706)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !243, line: 110, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !301, file: !305, line: 71, baseType: !708, size: 64, align: 64, offset: 2112)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64, align: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!230, !297, !297}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !301, file: !305, line: 73, baseType: !708, size: 64, align: 64, offset: 2176)
!712 = !DILocalVariable(name: "data", arg: 1, scope: !294, file: !281, line: 218, type: !297)
!713 = !DIExpression()
!714 = !DILocation(line: 218, column: 37, scope: !294)
!715 = !DILocalVariable(name: "server", arg: 2, scope: !294, file: !281, line: 218, type: !299)
!716 = !DILocation(line: 218, column: 55, scope: !294)
!717 = !DILocalVariable(name: "item", arg: 3, scope: !294, file: !281, line: 218, type: !631)
!718 = !DILocation(line: 218, column: 76, scope: !294)
!719 = !DILocation(line: 220, column: 7, scope: !720)
!720 = distinct !DILexicalBlock(scope: !294, file: !281, line: 220, column: 6)
!721 = !DILocation(line: 220, column: 6, scope: !720)
!722 = !DILocation(line: 220, column: 12, scope: !720)
!723 = !DILocation(line: 220, column: 6, scope: !294)
!724 = !DILocation(line: 221, column: 3, scope: !720)
!725 = !DILocation(line: 223, column: 29, scope: !720)
!726 = !DILocation(line: 223, column: 35, scope: !720)
!727 = !DILocation(line: 223, column: 43, scope: !720)
!728 = !DILocation(line: 223, column: 3, scope: !720)
!729 = !DILocation(line: 224, column: 1, scope: !294)
!730 = distinct !DISubprogram(name: "cmd_network_list", scope: !281, file: !281, line: 35, type: !282, isLocal: true, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !284)
!731 = !DILocalVariable(name: "str", scope: !730, file: !281, line: 37, type: !500)
!732 = !DILocation(line: 37, column: 11, scope: !730)
!733 = !DILocalVariable(name: "tmp", scope: !730, file: !281, line: 38, type: !461)
!734 = !DILocation(line: 38, column: 10, scope: !730)
!735 = !DILocation(line: 40, column: 8, scope: !730)
!736 = !DILocation(line: 40, column: 6, scope: !730)
!737 = !DILocation(line: 41, column: 2, scope: !730)
!738 = !DILocation(line: 42, column: 13, scope: !739)
!739 = distinct !DILexicalBlock(scope: !730, file: !281, line: 42, column: 2)
!740 = !DILocation(line: 42, column: 11, scope: !739)
!741 = !DILocation(line: 42, column: 7, scope: !739)
!742 = !DILocation(line: 42, column: 23, scope: !743)
!743 = !DILexicalBlockFile(scope: !744, file: !281, discriminator: 1)
!744 = distinct !DILexicalBlock(scope: !739, file: !281, line: 42, column: 2)
!745 = !DILocation(line: 42, column: 27, scope: !743)
!746 = !DILocation(line: 42, column: 2, scope: !743)
!747 = !DILocalVariable(name: "rec", scope: !748, file: !281, line: 43, type: !222)
!748 = distinct !DILexicalBlock(scope: !744, file: !281, line: 42, column: 52)
!749 = !DILocation(line: 43, column: 20, scope: !748)
!750 = !DILocation(line: 43, column: 26, scope: !748)
!751 = !DILocation(line: 43, column: 31, scope: !748)
!752 = !DILocation(line: 45, column: 90, scope: !753)
!753 = distinct !DILexicalBlock(scope: !748, file: !281, line: 45, column: 7)
!754 = !DILocation(line: 45, column: 72, scope: !753)
!755 = !DILocation(line: 45, column: 56, scope: !753)
!756 = !DILocation(line: 45, column: 55, scope: !753)
!757 = !DILocation(line: 45, column: 30, scope: !758)
!758 = !DILexicalBlockFile(scope: !753, file: !281, discriminator: 3)
!759 = !DILocation(line: 45, column: 10, scope: !753)
!760 = !DILocation(line: 45, column: 7, scope: !748)
!761 = !DILocation(line: 45, column: 9, scope: !762)
!762 = !DILexicalBlockFile(scope: !753, file: !281, discriminator: 1)
!763 = !DILocation(line: 45, column: 7, scope: !764)
!764 = !DILexicalBlockFile(scope: !748, file: !281, discriminator: 2)
!765 = !DILocation(line: 46, column: 25, scope: !753)
!766 = !DILocation(line: 48, column: 21, scope: !748)
!767 = !DILocation(line: 48, column: 3, scope: !748)
!768 = !DILocation(line: 49, column: 7, scope: !769)
!769 = distinct !DILexicalBlock(scope: !748, file: !281, line: 49, column: 7)
!770 = !DILocation(line: 49, column: 12, scope: !769)
!771 = !DILocation(line: 49, column: 17, scope: !769)
!772 = !DILocation(line: 49, column: 7, scope: !748)
