; ModuleID = './line348-gui-printtext.o.i'
source_filename = "./line348-gui-printtext.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GHashTable = type opaque
%struct._TEXT_BUFFER_VIEW_REC = type { %struct.TEXT_BUFFER_REC*, %struct._GSList*, %struct._TERM_WINDOW*, i32, i32, i32, {}*, %struct.TEXT_BUFFER_CACHE_REC*, i32, %struct._LINE_REC*, i32, %struct._LINE_REC*, i32, %struct._GHashTable*, i32, i32, i8 }
%struct.TEXT_BUFFER_REC = type { %struct._GSList*, %struct._LINE_REC*, i32, %struct._LINE_REC*, %struct.TEXT_CHUNK_REC*, i32, i32, i32, i8 }
%struct.TEXT_CHUNK_REC = type { [16368 x i8], i32, i32 }
%struct._GSList = type { i8*, %struct._GSList* }
%struct._TERM_WINDOW = type opaque
%struct.TEXT_BUFFER_CACHE_REC = type { i32, i32, %struct._GHashTable*, i8, i32 }
%struct._LINE_REC = type { %struct._LINE_REC*, %struct._LINE_REC*, i8*, %struct.LINE_INFO_REC }
%struct.LINE_INFO_REC = type { i32, i64 }
%struct.THEME_REC = type { i32, i8*, i8*, i64, i32, i8, %struct._GHashTable*, [256 x i32], %struct._GSList*, %struct._GHashTable*, i8* }
%struct.MAIN_WINDOW_BORDER_REC = type { i8*, %struct._TERM_WINDOW* }
%struct._TEXT_DEST_REC = type { %struct._WINDOW_REC*, %struct._SERVER_REC*, i8*, i8*, i8*, i8*, i32, i32, i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !245)
!1 = !DIFile(filename: "line348-gui-printtext.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{}
!3 = !{!4, !5, !110, !224, !232, !237, !236, !242, !40, !243, !163}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "INDENT_FUNC", file: !6, line: 10, baseType: !7)
!6 = !DIFile(filename: "textbuffer-view.h", directory: "/home/lichi/Desktop/irssi/task1")
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11, !32, !10}
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_VIEW_REC", file: !6, line: 7, baseType: !13)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TEXT_BUFFER_VIEW_REC", file: !6, line: 50, size: 960, align: 64, elements: !14)
!14 = !{!15, !71, !72, !77, !78, !79, !80, !81, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !13, file: !6, line: 51, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_REC", file: !18, line: 72, baseType: !19)
!18 = !DIFile(filename: "textbuffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 60, size: 448, align: 64, elements: !20)
!20 = !{!21, !31, !53, !54, !55, !66, !67, !68, !69}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "text_chunks", scope: !19, file: !18, line: 61, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !24, line: 37, baseType: !25)
!24 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !24, line: 39, size: 128, align: 64, elements: !26)
!26 = !{!27, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !25, file: !24, line: 41, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !29, line: 77, baseType: !4)
!29 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !25, file: !24, line: 42, baseType: !22, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !19, file: !18, line: 62, baseType: !32, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINE_REC", file: !18, line: 52, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LINE_REC", file: !18, line: 34, size: 320, align: 64, elements: !35)
!35 = !{!36, !38, !39, !42}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !34, file: !18, line: 48, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !34, file: !18, line: 48, baseType: !37, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !34, file: !18, line: 50, baseType: !40, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !34, file: !18, line: 51, baseType: !43, size: 128, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINE_INFO_REC", file: !18, line: 32, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 29, size: 128, align: 64, elements: !45)
!45 = !{!46, !47}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !44, file: !18, line: 30, baseType: !10, size: 32, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !44, file: !18, line: 31, baseType: !48, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !49, line: 75, baseType: !50)
!49 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !51, line: 139, baseType: !52)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!52 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "lines_count", scope: !19, file: !18, line: 63, baseType: !10, size: 32, align: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "cur_line", scope: !19, file: !18, line: 65, baseType: !32, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "cur_text", scope: !19, file: !18, line: 66, baseType: !56, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_CHUNK_REC", file: !18, line: 58, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 54, size: 131008, align: 32, elements: !59)
!59 = !{!60, !64, !65}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !58, file: !18, line: 55, baseType: !61, size: 130944, align: 8)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 130944, align: 8, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 16368)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !58, file: !18, line: 56, baseType: !10, size: 32, align: 32, offset: 130944)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !58, file: !18, line: 57, baseType: !10, size: 32, align: 32, offset: 130976)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "last_fg", scope: !19, file: !18, line: 68, baseType: !10, size: 32, align: 32, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "last_bg", scope: !19, file: !18, line: 69, baseType: !10, size: 32, align: 32, offset: 352)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "last_flags", scope: !19, file: !18, line: 70, baseType: !10, size: 32, align: 32, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "last_eol", scope: !19, file: !18, line: 71, baseType: !70, size: 1, align: 32, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!70 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "siblings", scope: !13, file: !6, line: 53, baseType: !22, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !13, file: !6, line: 55, baseType: !73, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "TERM_WINDOW", file: !75, line: 4, baseType: !76)
!75 = !DIFile(filename: "term.h", directory: "/home/lichi/Desktop/irssi/task1")
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_TERM_WINDOW", file: !75, line: 4, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !13, file: !6, line: 56, baseType: !10, size: 32, align: 32, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !13, file: !6, line: 56, baseType: !10, size: 32, align: 32, offset: 224)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "default_indent", scope: !13, file: !6, line: 58, baseType: !10, size: 32, align: 32, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "default_indent_func", scope: !13, file: !6, line: 59, baseType: !5, size: 64, align: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !13, file: !6, line: 61, baseType: !82, size: 64, align: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_CACHE_REC", file: !6, line: 48, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 37, size: 192, align: 64, elements: !85)
!85 = !{!86, !87, !88, !93, !94}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !84, file: !6, line: 38, baseType: !10, size: 32, align: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !84, file: !6, line: 39, baseType: !10, size: 32, align: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "line_cache", scope: !84, file: !6, line: 41, baseType: !89, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !91, line: 37, baseType: !92)
!91 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !91, line: 37, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "update_counter", scope: !84, file: !6, line: 45, baseType: !41, size: 8, align: 8, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "last_linecount", scope: !84, file: !6, line: 47, baseType: !10, size: 32, align: 32, offset: 160)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ypos", scope: !13, file: !6, line: 63, baseType: !10, size: 32, align: 32, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "startline", scope: !13, file: !6, line: 66, baseType: !32, size: 64, align: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "subline", scope: !13, file: !6, line: 68, baseType: !10, size: 32, align: 32, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_startline", scope: !13, file: !6, line: 71, baseType: !32, size: 64, align: 64, offset: 640)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_subline", scope: !13, file: !6, line: 72, baseType: !10, size: 32, align: 32, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "bookmarks", scope: !13, file: !6, line: 76, baseType: !89, size: 64, align: 64, offset: 768)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "hidden_level", scope: !13, file: !6, line: 79, baseType: !10, size: 32, align: 32, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "empty_linecount", scope: !13, file: !6, line: 82, baseType: !10, size: 32, align: 32, offset: 864)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "longword_noindent", scope: !13, file: !6, line: 84, baseType: !70, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !13, file: !6, line: 86, baseType: !70, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !13, file: !6, line: 88, baseType: !70, size: 1, align: 32, offset: 898, flags: DIFlagBitField, extraData: i64 896)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "break_wide", scope: !13, file: !6, line: 90, baseType: !70, size: 1, align: 32, offset: 899, flags: DIFlagBitField, extraData: i64 896)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !13, file: !6, line: 92, baseType: !70, size: 1, align: 32, offset: 900, flags: DIFlagBitField, extraData: i64 896)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "more_text", scope: !13, file: !6, line: 94, baseType: !70, size: 1, align: 32, offset: 901, flags: DIFlagBitField, extraData: i64 896)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !13, file: !6, line: 96, baseType: !70, size: 1, align: 32, offset: 902, flags: DIFlagBitField, extraData: i64 896)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUI_WINDOW_REC", file: !112, line: 24, baseType: !113)
!112 = !DIFile(filename: "gui-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !112, line: 13, size: 320, align: 64, elements: !114)
!114 = !{!115, !217, !218, !219, !220, !221, !222, !223}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !113, file: !112, line: 14, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_WINDOW_REC", file: !118, line: 34, baseType: !119)
!118 = !DIFile(filename: "mainwindows.h", directory: "/home/lichi/Desktop/irssi/task1")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 16, size: 704, align: 64, elements: !120)
!120 = !{!121, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !119, file: !118, line: 17, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !124, line: 117, baseType: !125)
!124 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !126, line: 28, size: 1280, align: 64, elements: !127)
!126 = !DIFile(filename: "../../src/fe-common/core/fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!127 = !{!128, !129, !132, !133, !134, !135, !165, !166, !167, !168, !169, !170, !171, !172, !173, !192, !193, !194, !195, !196, !197, !198, !199}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !125, file: !126, line: 29, baseType: !10, size: 32, align: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !125, file: !126, line: 30, baseType: !130, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !125, file: !126, line: 32, baseType: !10, size: 32, align: 32, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !125, file: !126, line: 32, baseType: !10, size: 32, align: 32, offset: 160)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !125, file: !126, line: 34, baseType: !22, size: 64, align: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !125, file: !126, line: 35, baseType: !136, size: 64, align: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !124, line: 108, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !139, line: 5, size: 704, align: 64, elements: !140)
!139 = !DIFile(filename: "../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!140 = !{!141, !143, !144, !145, !146, !150, !151, !152, !153, !154, !155, !159}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !142, line: 3, baseType: !10, size: 32, align: 32)
!142 = !DIFile(filename: "../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!143 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !138, file: !142, line: 4, baseType: !10, size: 32, align: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !138, file: !142, line: 5, baseType: !89, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !138, file: !142, line: 7, baseType: !4, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !138, file: !142, line: 8, baseType: !147, size: 64, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !124, line: 107, baseType: !149)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !124, line: 107, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !138, file: !142, line: 9, baseType: !130, size: 64, align: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !138, file: !142, line: 10, baseType: !130, size: 64, align: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !138, file: !142, line: 11, baseType: !48, size: 64, align: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !138, file: !142, line: 12, baseType: !10, size: 32, align: 32, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !138, file: !142, line: 13, baseType: !130, size: 64, align: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !138, file: !142, line: 15, baseType: !156, size: 64, align: 64, offset: 576)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !136}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !138, file: !142, line: 17, baseType: !160, size: 64, align: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !136}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !125, file: !126, line: 36, baseType: !147, size: 64, align: 64, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !125, file: !126, line: 37, baseType: !147, size: 64, align: 64, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !125, file: !126, line: 38, baseType: !130, size: 64, align: 64, offset: 448)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !125, file: !126, line: 40, baseType: !10, size: 32, align: 32, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !125, file: !126, line: 41, baseType: !22, size: 64, align: 64, offset: 576)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !125, file: !126, line: 43, baseType: !70, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !125, file: !126, line: 44, baseType: !70, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !125, file: !126, line: 45, baseType: !70, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !125, file: !126, line: 48, baseType: !174, size: 64, align: 64, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !176, line: 14, baseType: !177)
!176 = !DIFile(filename: "../../src/fe-common/core/command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !176, line: 6, size: 256, align: 64, elements: !178)
!178 = !{!179, !180, !189, !190, !191}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !177, file: !176, line: 7, baseType: !130, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !177, file: !176, line: 9, baseType: !181, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !183, line: 37, baseType: !184)
!183 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !183, line: 39, size: 192, align: 64, elements: !185)
!185 = !{!186, !187, !188}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !184, file: !183, line: 41, baseType: !28, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !184, file: !183, line: 42, baseType: !181, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !184, file: !183, line: 43, baseType: !181, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !177, file: !176, line: 10, baseType: !10, size: 32, align: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !177, file: !176, line: 12, baseType: !10, size: 32, align: 32, offset: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !177, file: !176, line: 13, baseType: !10, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !125, file: !126, line: 49, baseType: !130, size: 64, align: 64, offset: 768)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !125, file: !126, line: 51, baseType: !10, size: 32, align: 32, offset: 832)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !125, file: !126, line: 52, baseType: !130, size: 64, align: 64, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !125, file: !126, line: 54, baseType: !48, size: 64, align: 64, offset: 960)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !125, file: !126, line: 55, baseType: !48, size: 64, align: 64, offset: 1024)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !125, file: !126, line: 57, baseType: !130, size: 64, align: 64, offset: 1088)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !125, file: !126, line: 58, baseType: !4, size: 64, align: 64, offset: 1152)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !125, file: !126, line: 60, baseType: !4, size: 64, align: 64, offset: 1216)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "screen_win", scope: !119, file: !118, line: 19, baseType: !73, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_windows", scope: !119, file: !118, line: 20, baseType: !10, size: 32, align: 32, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !119, file: !118, line: 22, baseType: !10, size: 32, align: 32, offset: 160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !119, file: !118, line: 22, baseType: !10, size: 32, align: 32, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "first_column", scope: !119, file: !118, line: 23, baseType: !10, size: 32, align: 32, offset: 224)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "last_column", scope: !119, file: !118, line: 23, baseType: !10, size: 32, align: 32, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !119, file: !118, line: 24, baseType: !10, size: 32, align: 32, offset: 288)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !119, file: !118, line: 24, baseType: !10, size: 32, align: 32, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "statusbars", scope: !119, file: !118, line: 26, baseType: !22, size: 64, align: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines_top", scope: !119, file: !118, line: 27, baseType: !10, size: 32, align: 32, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines_bottom", scope: !119, file: !118, line: 27, baseType: !10, size: 32, align: 32, offset: 480)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines", scope: !119, file: !118, line: 28, baseType: !10, size: 32, align: 32, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns_left", scope: !119, file: !118, line: 29, baseType: !10, size: 32, align: 32, offset: 544)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns_right", scope: !119, file: !118, line: 29, baseType: !10, size: 32, align: 32, offset: 576)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns", scope: !119, file: !118, line: 30, baseType: !10, size: 32, align: 32, offset: 608)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !119, file: !118, line: 32, baseType: !70, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "size_dirty", scope: !119, file: !118, line: 33, baseType: !70, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !113, file: !112, line: 15, baseType: !11, size: 64, align: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !113, file: !112, line: 17, baseType: !70, size: 1, align: 32, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "use_scroll", scope: !113, file: !112, line: 18, baseType: !70, size: 1, align: 32, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sticky", scope: !113, file: !112, line: 20, baseType: !70, size: 1, align: 32, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "use_insert_after", scope: !113, file: !112, line: 21, baseType: !70, size: 1, align: 32, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "insert_after", scope: !113, file: !112, line: 22, baseType: !32, size: 64, align: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "insert_after_time", scope: !113, file: !112, line: 23, baseType: !48, size: 64, align: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashFunc", file: !29, line: 90, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !229}
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !29, line: 55, baseType: !70)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !29, line: 78, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !29, line: 80, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !229, !229}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !29, line: 49, baseType: !10)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !238, line: 9, baseType: !239)
!238 = !DIFile(filename: "../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !230, !230, !230, !230, !230, !230}
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !29, line: 48, baseType: !52)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !29, line: 46, baseType: !131)
!245 = !{!246, !251, !252, !253, !254, !255, !264, !265, !266}
!246 = distinct !DIGlobalVariable(name: "mirc_colors", scope: !0, file: !247, line: 33, type: !248, isLocal: false, isDefinition: true, variable: [100 x i32]* @mirc_colors)
!247 = !DIFile(filename: "gui-printtext.c", directory: "/home/lichi/Desktop/irssi/task1")
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 3200, align: 32, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 100)
!251 = distinct !DIGlobalVariable(name: "next_xpos", scope: !0, file: !247, line: 43, type: !10, isLocal: true, isDefinition: true, variable: i32* @next_xpos)
!252 = distinct !DIGlobalVariable(name: "next_ypos", scope: !0, file: !247, line: 43, type: !10, isLocal: true, isDefinition: true, variable: i32* @next_ypos)
!253 = distinct !DIGlobalVariable(name: "indent_functions", scope: !0, file: !247, line: 45, type: !89, isLocal: true, isDefinition: true, variable: %struct._GHashTable** @indent_functions)
!254 = distinct !DIGlobalVariable(name: "default_indent_func", scope: !0, file: !247, line: 46, type: !5, isLocal: true, isDefinition: true, variable: i32 (%struct._TEXT_BUFFER_VIEW_REC*, %struct._LINE_REC*, i32)** @default_indent_func)
!255 = distinct !DIGlobalVariable(name: "eol", scope: !256, file: !247, line: 253, type: !260, isLocal: true, isDefinition: true, variable: [2 x i8]* @view_add_eol.eol)
!256 = distinct !DISubprogram(name: "view_add_eol", scope: !247, file: !247, line: 251, type: !257, isLocal: true, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !11, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 16, align: 8, elements: !262)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!262 = !{!263}
!263 = !DISubrange(count: 2)
!264 = distinct !DIGlobalVariable(name: "scrollback_time", scope: !0, file: !247, line: 41, type: !10, isLocal: true, isDefinition: true, variable: i32* @scrollback_time)
!265 = distinct !DIGlobalVariable(name: "scrollback_lines", scope: !0, file: !247, line: 41, type: !10, isLocal: true, isDefinition: true, variable: i32* @scrollback_lines)
!266 = distinct !DIGlobalVariable(name: "scrollback_burst_remove", scope: !0, file: !247, line: 41, type: !10, isLocal: true, isDefinition: true, variable: i32* @scrollback_burst_remove)
!267 = !{i32 2, !"Dwarf Version", i32 4}
!268 = !{i32 2, !"Debug Info Version", i32 3}
!269 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!270 = distinct !DISubprogram(name: "gui_register_indent_func", scope: !247, file: !247, line: 48, type: !271, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !163, !5}
!273 = !DILocalVariable(name: "name", arg: 1, scope: !270, file: !247, line: 48, type: !163)
!274 = !DIExpression()
!275 = !DILocation(line: 48, column: 43, scope: !270)
!276 = !DILocalVariable(name: "func", arg: 2, scope: !270, file: !247, line: 48, type: !5)
!277 = !DILocation(line: 48, column: 61, scope: !270)
!278 = !DILocalVariable(name: "key", scope: !270, file: !247, line: 50, type: !28)
!279 = !DILocation(line: 50, column: 11, scope: !270)
!280 = !DILocalVariable(name: "value", scope: !270, file: !247, line: 50, type: !28)
!281 = !DILocation(line: 50, column: 16, scope: !270)
!282 = !DILocalVariable(name: "list", scope: !270, file: !247, line: 51, type: !22)
!283 = !DILocation(line: 51, column: 17, scope: !270)
!284 = !DILocation(line: 53, column: 35, scope: !285)
!285 = distinct !DILexicalBlock(scope: !270, file: !247, line: 53, column: 6)
!286 = !DILocation(line: 53, column: 53, scope: !285)
!287 = !DILocation(line: 53, column: 6, scope: !285)
!288 = !DILocation(line: 53, column: 6, scope: !270)
!289 = !DILocation(line: 54, column: 24, scope: !290)
!290 = distinct !DILexicalBlock(scope: !285, file: !247, line: 53, column: 74)
!291 = !DILocation(line: 54, column: 22, scope: !290)
!292 = !DILocation(line: 55, column: 23, scope: !290)
!293 = !DILocation(line: 55, column: 41, scope: !290)
!294 = !DILocation(line: 55, column: 3, scope: !290)
!295 = !DILocation(line: 56, column: 2, scope: !290)
!296 = !DILocation(line: 57, column: 18, scope: !297)
!297 = distinct !DILexicalBlock(scope: !285, file: !247, line: 56, column: 9)
!298 = !DILocation(line: 57, column: 9, scope: !297)
!299 = !DILocation(line: 57, column: 7, scope: !297)
!300 = !DILocation(line: 58, column: 22, scope: !297)
!301 = !DILocation(line: 61, column: 24, scope: !270)
!302 = !DILocation(line: 61, column: 39, scope: !270)
!303 = !DILocation(line: 61, column: 30, scope: !270)
!304 = !DILocation(line: 61, column: 9, scope: !270)
!305 = !DILocation(line: 61, column: 7, scope: !270)
!306 = !DILocation(line: 62, column: 22, scope: !270)
!307 = !DILocation(line: 62, column: 40, scope: !270)
!308 = !DILocation(line: 62, column: 45, scope: !270)
!309 = !DILocation(line: 62, column: 2, scope: !270)
!310 = !DILocation(line: 63, column: 1, scope: !270)
!311 = distinct !DISubprogram(name: "gui_unregister_indent_func", scope: !247, file: !247, line: 65, type: !271, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!312 = !DILocalVariable(name: "name", arg: 1, scope: !311, file: !247, line: 65, type: !163)
!313 = !DILocation(line: 65, column: 45, scope: !311)
!314 = !DILocalVariable(name: "func", arg: 2, scope: !311, file: !247, line: 65, type: !5)
!315 = !DILocation(line: 65, column: 63, scope: !311)
!316 = !DILocalVariable(name: "key", scope: !311, file: !247, line: 67, type: !28)
!317 = !DILocation(line: 67, column: 11, scope: !311)
!318 = !DILocalVariable(name: "value", scope: !311, file: !247, line: 67, type: !28)
!319 = !DILocation(line: 67, column: 16, scope: !311)
!320 = !DILocalVariable(name: "list", scope: !311, file: !247, line: 68, type: !22)
!321 = !DILocation(line: 68, column: 17, scope: !311)
!322 = !DILocation(line: 70, column: 35, scope: !323)
!323 = distinct !DILexicalBlock(scope: !311, file: !247, line: 70, column: 6)
!324 = !DILocation(line: 70, column: 53, scope: !323)
!325 = !DILocation(line: 70, column: 6, scope: !323)
!326 = !DILocation(line: 70, column: 6, scope: !311)
!327 = !DILocation(line: 71, column: 10, scope: !328)
!328 = distinct !DILexicalBlock(scope: !323, file: !247, line: 70, column: 74)
!329 = !DILocation(line: 71, column: 8, scope: !328)
!330 = !DILocation(line: 73, column: 25, scope: !328)
!331 = !DILocation(line: 73, column: 40, scope: !328)
!332 = !DILocation(line: 73, column: 31, scope: !328)
!333 = !DILocation(line: 73, column: 10, scope: !328)
!334 = !DILocation(line: 73, column: 8, scope: !328)
!335 = !DILocation(line: 74, column: 23, scope: !328)
!336 = !DILocation(line: 74, column: 41, scope: !328)
!337 = !DILocation(line: 74, column: 3, scope: !328)
!338 = !DILocation(line: 75, column: 7, scope: !339)
!339 = distinct !DILexicalBlock(scope: !328, file: !247, line: 75, column: 7)
!340 = !DILocation(line: 75, column: 12, scope: !339)
!341 = !DILocation(line: 75, column: 7, scope: !328)
!342 = !DILocation(line: 76, column: 11, scope: !339)
!343 = !DILocation(line: 76, column: 4, scope: !339)
!344 = !DILocation(line: 78, column: 24, scope: !339)
!345 = !DILocation(line: 78, column: 42, scope: !339)
!346 = !DILocation(line: 78, column: 47, scope: !339)
!347 = !DILocation(line: 78, column: 4, scope: !339)
!348 = !DILocation(line: 79, column: 2, scope: !328)
!349 = !DILocation(line: 81, column: 6, scope: !350)
!350 = distinct !DILexicalBlock(scope: !311, file: !247, line: 81, column: 6)
!351 = !DILocation(line: 81, column: 29, scope: !350)
!352 = !DILocation(line: 81, column: 26, scope: !350)
!353 = !DILocation(line: 81, column: 6, scope: !311)
!354 = !DILocation(line: 82, column: 3, scope: !350)
!355 = !DILocation(line: 84, column: 42, scope: !311)
!356 = !DILocation(line: 84, column: 2, scope: !311)
!357 = !DILocation(line: 85, column: 1, scope: !311)
!358 = distinct !DISubprogram(name: "gui_set_default_indent", scope: !247, file: !247, line: 87, type: !359, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !163}
!361 = !DILocalVariable(name: "name", arg: 1, scope: !358, file: !247, line: 87, type: !163)
!362 = !DILocation(line: 87, column: 41, scope: !358)
!363 = !DILocalVariable(name: "list", scope: !358, file: !247, line: 89, type: !22)
!364 = !DILocation(line: 89, column: 10, scope: !358)
!365 = !DILocation(line: 91, column: 9, scope: !358)
!366 = !DILocation(line: 91, column: 14, scope: !358)
!367 = !DILocation(line: 91, column: 9, scope: !368)
!368 = !DILexicalBlockFile(scope: !358, file: !247, discriminator: 1)
!369 = !DILocation(line: 92, column: 23, scope: !358)
!370 = !DILocation(line: 92, column: 41, scope: !358)
!371 = !DILocation(line: 92, column: 3, scope: !358)
!372 = !DILocation(line: 91, column: 9, scope: !373)
!373 = !DILexicalBlockFile(scope: !358, file: !247, discriminator: 2)
!374 = !DILocation(line: 91, column: 9, scope: !375)
!375 = !DILexicalBlockFile(scope: !358, file: !247, discriminator: 3)
!376 = !DILocation(line: 91, column: 7, scope: !375)
!377 = !DILocation(line: 93, column: 24, scope: !358)
!378 = !DILocation(line: 93, column: 29, scope: !358)
!379 = !DILocation(line: 93, column: 24, scope: !368)
!380 = !DILocation(line: 94, column: 17, scope: !358)
!381 = !DILocation(line: 94, column: 23, scope: !358)
!382 = !DILocation(line: 94, column: 3, scope: !358)
!383 = !DILocation(line: 93, column: 24, scope: !373)
!384 = !DILocation(line: 93, column: 24, scope: !375)
!385 = !DILocation(line: 93, column: 22, scope: !375)
!386 = !DILocation(line: 95, column: 9, scope: !358)
!387 = !DILocation(line: 96, column: 1, scope: !358)
!388 = distinct !DISubprogram(name: "get_default_indent_func", scope: !247, file: !247, line: 98, type: !389, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!389 = !DISubroutineType(types: !390)
!390 = !{!5}
!391 = !DILocation(line: 100, column: 16, scope: !388)
!392 = !DILocation(line: 100, column: 9, scope: !388)
!393 = distinct !DISubprogram(name: "gui_printtext", scope: !247, file: !247, line: 103, type: !394, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !10, !10, !163}
!396 = !DILocalVariable(name: "xpos", arg: 1, scope: !393, file: !247, line: 103, type: !10)
!397 = !DILocation(line: 103, column: 24, scope: !393)
!398 = !DILocalVariable(name: "ypos", arg: 2, scope: !393, file: !247, line: 103, type: !10)
!399 = !DILocation(line: 103, column: 34, scope: !393)
!400 = !DILocalVariable(name: "str", arg: 3, scope: !393, file: !247, line: 103, type: !163)
!401 = !DILocation(line: 103, column: 52, scope: !393)
!402 = !DILocation(line: 105, column: 14, scope: !393)
!403 = !DILocation(line: 105, column: 12, scope: !393)
!404 = !DILocation(line: 106, column: 14, scope: !393)
!405 = !DILocation(line: 106, column: 12, scope: !393)
!406 = !DILocation(line: 108, column: 16, scope: !393)
!407 = !DILocation(line: 108, column: 2, scope: !393)
!408 = !DILocation(line: 110, column: 24, scope: !393)
!409 = !DILocation(line: 110, column: 12, scope: !393)
!410 = !DILocation(line: 111, column: 1, scope: !393)
!411 = distinct !DISubprogram(name: "gui_printtext_internal", scope: !247, file: !247, line: 113, type: !394, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!412 = !DILocalVariable(name: "xpos", arg: 1, scope: !411, file: !247, line: 113, type: !10)
!413 = !DILocation(line: 113, column: 33, scope: !411)
!414 = !DILocalVariable(name: "ypos", arg: 2, scope: !411, file: !247, line: 113, type: !10)
!415 = !DILocation(line: 113, column: 43, scope: !411)
!416 = !DILocalVariable(name: "str", arg: 3, scope: !411, file: !247, line: 113, type: !163)
!417 = !DILocation(line: 113, column: 61, scope: !411)
!418 = !DILocation(line: 115, column: 14, scope: !411)
!419 = !DILocation(line: 115, column: 12, scope: !411)
!420 = !DILocation(line: 116, column: 14, scope: !411)
!421 = !DILocation(line: 116, column: 12, scope: !411)
!422 = !DILocation(line: 118, column: 25, scope: !411)
!423 = !DILocation(line: 118, column: 2, scope: !411)
!424 = !DILocation(line: 120, column: 24, scope: !411)
!425 = !DILocation(line: 120, column: 12, scope: !411)
!426 = !DILocation(line: 121, column: 1, scope: !411)
!427 = distinct !DISubprogram(name: "gui_printtext_after_time", scope: !247, file: !247, line: 125, type: !428, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !430, !32, !163, !48}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_DEST_REC", file: !432, line: 62, baseType: !433)
!432 = !DIFile(filename: "../../src/fe-common/core/formats.h", directory: "/home/lichi/Desktop/irssi/task1")
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TEXT_DEST_REC", file: !432, line: 50, size: 576, align: 64, elements: !434)
!434 = !{!435, !436, !437, !438, !439, !440, !441, !442, !443, !444}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !433, file: !432, line: 51, baseType: !122, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !433, file: !432, line: 52, baseType: !147, size: 64, align: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !433, file: !432, line: 53, baseType: !163, size: 64, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !433, file: !432, line: 54, baseType: !163, size: 64, align: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !433, file: !432, line: 55, baseType: !163, size: 64, align: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !433, file: !432, line: 56, baseType: !163, size: 64, align: 64, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !433, file: !432, line: 57, baseType: !10, size: 32, align: 32, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_priority", scope: !433, file: !432, line: 59, baseType: !10, size: 32, align: 32, offset: 416)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !433, file: !432, line: 60, baseType: !130, size: 64, align: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !433, file: !432, line: 61, baseType: !10, size: 32, align: 32, offset: 512)
!445 = !DILocalVariable(name: "dest", arg: 1, scope: !427, file: !247, line: 125, type: !430)
!446 = !DILocation(line: 125, column: 46, scope: !427)
!447 = !DILocalVariable(name: "prev", arg: 2, scope: !427, file: !247, line: 125, type: !32)
!448 = !DILocation(line: 125, column: 62, scope: !427)
!449 = !DILocalVariable(name: "str", arg: 3, scope: !427, file: !247, line: 125, type: !163)
!450 = !DILocation(line: 125, column: 80, scope: !427)
!451 = !DILocalVariable(name: "time", arg: 4, scope: !427, file: !247, line: 125, type: !48)
!452 = !DILocation(line: 125, column: 92, scope: !427)
!453 = !DILocalVariable(name: "gui", scope: !427, file: !247, line: 127, type: !110)
!454 = !DILocation(line: 127, column: 18, scope: !427)
!455 = !DILocation(line: 129, column: 30, scope: !427)
!456 = !DILocation(line: 129, column: 36, scope: !427)
!457 = !DILocation(line: 129, column: 45, scope: !427)
!458 = !DILocation(line: 129, column: 9, scope: !427)
!459 = !DILocation(line: 129, column: 6, scope: !427)
!460 = !DILocation(line: 131, column: 6, scope: !461)
!461 = distinct !DILexicalBlock(scope: !427, file: !247, line: 131, column: 6)
!462 = !DILocation(line: 131, column: 11, scope: !461)
!463 = !DILocation(line: 131, column: 18, scope: !461)
!464 = !DILocation(line: 131, column: 22, scope: !465)
!465 = !DILexicalBlockFile(scope: !461, file: !247, discriminator: 1)
!466 = !DILocation(line: 131, column: 27, scope: !465)
!467 = !DILocation(line: 131, column: 33, scope: !465)
!468 = !DILocation(line: 131, column: 41, scope: !465)
!469 = !DILocation(line: 131, column: 6, scope: !465)
!470 = !DILocation(line: 133, column: 16, scope: !471)
!471 = distinct !DILexicalBlock(scope: !461, file: !247, line: 131, column: 51)
!472 = !DILocation(line: 133, column: 21, scope: !471)
!473 = !DILocation(line: 133, column: 28, scope: !471)
!474 = !DILocation(line: 133, column: 33, scope: !471)
!475 = !DILocation(line: 133, column: 3, scope: !471)
!476 = !DILocation(line: 134, column: 2, scope: !471)
!477 = !DILocation(line: 136, column: 2, scope: !427)
!478 = !DILocation(line: 136, column: 7, scope: !427)
!479 = !DILocation(line: 136, column: 24, scope: !427)
!480 = !DILocation(line: 137, column: 22, scope: !427)
!481 = !DILocation(line: 137, column: 2, scope: !427)
!482 = !DILocation(line: 137, column: 7, scope: !427)
!483 = !DILocation(line: 137, column: 20, scope: !427)
!484 = !DILocation(line: 138, column: 27, scope: !427)
!485 = !DILocation(line: 138, column: 2, scope: !427)
!486 = !DILocation(line: 138, column: 7, scope: !427)
!487 = !DILocation(line: 138, column: 25, scope: !427)
!488 = !DILocation(line: 139, column: 21, scope: !427)
!489 = !DILocation(line: 139, column: 27, scope: !427)
!490 = !DILocation(line: 139, column: 2, scope: !427)
!491 = !DILocation(line: 140, column: 2, scope: !427)
!492 = !DILocation(line: 140, column: 7, scope: !427)
!493 = !DILocation(line: 140, column: 24, scope: !427)
!494 = !DILocation(line: 141, column: 50, scope: !427)
!495 = !DILocation(line: 141, column: 56, scope: !427)
!496 = !DILocation(line: 141, column: 64, scope: !427)
!497 = !DILocation(line: 141, column: 69, scope: !427)
!498 = !DILocation(line: 141, column: 83, scope: !427)
!499 = !DILocation(line: 141, column: 2, scope: !427)
!500 = !DILocation(line: 142, column: 1, scope: !427)
!501 = !DILocalVariable(name: "view", arg: 1, scope: !256, file: !247, line: 251, type: !11)
!502 = !DILocation(line: 251, column: 48, scope: !256)
!503 = !DILocalVariable(name: "line", arg: 2, scope: !256, file: !247, line: 251, type: !259)
!504 = !DILocation(line: 251, column: 65, scope: !256)
!505 = !DILocation(line: 255, column: 28, scope: !256)
!506 = !DILocation(line: 255, column: 34, scope: !256)
!507 = !DILocation(line: 255, column: 43, scope: !256)
!508 = !DILocation(line: 255, column: 42, scope: !256)
!509 = !DILocation(line: 255, column: 10, scope: !256)
