; ModuleID = './line125-irc-commands.o.i'
source_filename = "./line125-irc-commands.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GString = type { i8*, i64, i64 }
%struct._GSList = type { i8*, %struct._GSList* }
%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 25, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!38 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!39 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!40 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!41 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!42 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!43 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!44 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!45 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!46 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!47 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!48 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!49 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!50 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!51 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!52 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!53 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!54 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!55 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 46, size: 32, align: 32, elements: !58)
!57 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/irssi/task1")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70}
!59 = !DIEnumerator(name: "_ISupper", value: 256)
!60 = !DIEnumerator(name: "_ISlower", value: 512)
!61 = !DIEnumerator(name: "_ISalpha", value: 1024)
!62 = !DIEnumerator(name: "_ISdigit", value: 2048)
!63 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!64 = !DIEnumerator(name: "_ISspace", value: 8192)
!65 = !DIEnumerator(name: "_ISprint", value: 16384)
!66 = !DIEnumerator(name: "_ISgraph", value: 32768)
!67 = !DIEnumerator(name: "_ISblank", value: 1)
!68 = !DIEnumerator(name: "_IScntrl", value: 2)
!69 = !DIEnumerator(name: "_ISpunct", value: 4)
!70 = !DIEnumerator(name: "_ISalnum", value: 8)
!71 = !{!72, !81, !82, !89, !93, !96, !98, !399, !80, !389, !118, !694, !504, !597, !740, !79, !744, !124, !745}
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!76, !80}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !77, line: 50, baseType: !78)
!77 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !77, line: 49, baseType: !79)
!79 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !77, line: 77, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !83, line: 9, baseType: !84)
!83 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !87, !87, !87, !87, !87, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !77, line: 88, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !80, !80}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !77, line: 46, baseType: !95)
!95 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !100, line: 6, baseType: !101)
!100 = !DIFile(filename: "irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !102, line: 42, size: 39168, align: 64, elements: !103)
!102 = !DIFile(filename: "irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!103 = !{!104, !106, !107, !108, !344, !349, !350, !351, !352, !353, !354, !355, !356, !357, !361, !362, !366, !367, !368, !372, !377, !378, !379, !380, !381, !382, !383, !384, !391, !392, !393, !394, !395, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !737, !739}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !101, file: !105, line: 3, baseType: !79, size: 32, align: 32)
!105 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!106 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !101, file: !105, line: 4, baseType: !79, size: 32, align: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !101, file: !105, line: 6, baseType: !79, size: 32, align: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !101, file: !105, line: 8, baseType: !109, size: 64, align: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !100, line: 5, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !102, line: 24, size: 2496, align: 64, elements: !112)
!112 = !{!113, !115, !116, !117, !119, !120, !121, !122, !123, !125, !126, !127, !128, !129, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !111, file: !114, line: 3, baseType: !79, size: 32, align: 32)
!114 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!115 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !111, file: !114, line: 4, baseType: !79, size: 32, align: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !111, file: !114, line: 6, baseType: !79, size: 32, align: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !111, file: !114, line: 9, baseType: !118, size: 64, align: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !111, file: !114, line: 10, baseType: !79, size: 32, align: 32, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !111, file: !114, line: 11, baseType: !118, size: 64, align: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !111, file: !114, line: 11, baseType: !118, size: 64, align: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !111, file: !114, line: 11, baseType: !118, size: 64, align: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !111, file: !114, line: 13, baseType: !124, size: 16, align: 16, offset: 448)
!124 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !111, file: !114, line: 14, baseType: !118, size: 64, align: 64, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !111, file: !114, line: 15, baseType: !118, size: 64, align: 64, offset: 576)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !111, file: !114, line: 16, baseType: !79, size: 32, align: 32, offset: 640)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !111, file: !114, line: 17, baseType: !118, size: 64, align: 64, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !111, file: !114, line: 19, baseType: !130, size: 64, align: 64, offset: 768)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !132, line: 99, baseType: !133)
!132 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !132, line: 99, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !111, file: !114, line: 19, baseType: !130, size: 64, align: 64, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !111, file: !114, line: 21, baseType: !118, size: 64, align: 64, offset: 896)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !111, file: !114, line: 22, baseType: !118, size: 64, align: 64, offset: 960)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !111, file: !114, line: 23, baseType: !118, size: 64, align: 64, offset: 1024)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !111, file: !114, line: 24, baseType: !118, size: 64, align: 64, offset: 1088)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !111, file: !114, line: 26, baseType: !118, size: 64, align: 64, offset: 1152)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !111, file: !114, line: 27, baseType: !118, size: 64, align: 64, offset: 1216)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !111, file: !114, line: 28, baseType: !118, size: 64, align: 64, offset: 1280)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !111, file: !114, line: 29, baseType: !118, size: 64, align: 64, offset: 1344)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !111, file: !114, line: 30, baseType: !118, size: 64, align: 64, offset: 1408)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !111, file: !114, line: 31, baseType: !118, size: 64, align: 64, offset: 1472)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !111, file: !114, line: 32, baseType: !118, size: 64, align: 64, offset: 1536)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !111, file: !114, line: 33, baseType: !118, size: 64, align: 64, offset: 1600)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !111, file: !114, line: 35, baseType: !148, size: 64, align: 64, offset: 1664)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !151)
!151 = !{!152, !153, !289, !290, !295, !296, !297, !298, !299, !308, !309, !310, !314, !315, !316, !317, !318, !319, !320, !321}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !150, file: !4, line: 100, baseType: !78, size: 32, align: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !150, file: !4, line: 101, baseType: !154, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !157)
!157 = !{!158, !180, !186, !193, !197, !276, !280, !285}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !156, file: !4, line: 133, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !148, !93, !163, !166, !167}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !164, line: 66, baseType: !165)
!164 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!165 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !170, line: 42, baseType: !171)
!170 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !170, line: 44, size: 128, align: 64, elements: !172)
!172 = !{!173, !178, !179}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !171, file: !170, line: 46, baseType: !174, size: 32, align: 32)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !175, line: 36, baseType: !176)
!175 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !164, line: 45, baseType: !177)
!177 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !171, file: !170, line: 47, baseType: !78, size: 32, align: 32, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !171, file: !170, line: 48, baseType: !93, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !156, file: !4, line: 138, baseType: !181, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!162, !148, !184, !163, !166, !167}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !156, file: !4, line: 143, baseType: !187, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!162, !148, !190, !192, !167}
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !164, line: 51, baseType: !191)
!191 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !156, file: !4, line: 147, baseType: !194, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!162, !148, !167}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !156, file: !4, line: 149, baseType: !198, size: 64, align: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!201, !148, !275}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !204)
!204 = !{!205, !206, !222, !251, !253, !257, !258, !259, !260, !268, !269, !270, !271}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !203, file: !16, line: 174, baseType: !80, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !203, file: !16, line: 175, baseType: !207, size: 64, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !210)
!210 = !{!211, !215, !216}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !209, file: !16, line: 198, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !80}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !209, file: !16, line: 199, baseType: !212, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !209, file: !16, line: 200, baseType: !217, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !80, !201, !220, !221}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !203, file: !16, line: 177, baseType: !223, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !227)
!227 = !{!228, !233, !237, !241, !245, !246}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !226, file: !16, line: 216, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!76, !201, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !226, file: !16, line: 218, baseType: !234, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!76, !201}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !226, file: !16, line: 219, baseType: !238, size: 64, align: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!76, !201, !72, !80}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !226, file: !16, line: 222, baseType: !242, size: 64, align: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !201}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !226, file: !16, line: 226, baseType: !72, size: 64, align: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !226, file: !16, line: 227, baseType: !247, size: 64, align: 64, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{null}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !203, file: !16, line: 178, baseType: !252, size: 32, align: 32, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !77, line: 55, baseType: !177)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !203, file: !16, line: 180, baseType: !254, size: 64, align: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !256)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !203, file: !16, line: 182, baseType: !78, size: 32, align: 32, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !203, file: !16, line: 183, baseType: !252, size: 32, align: 32, offset: 352)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !203, file: !16, line: 184, baseType: !252, size: 32, align: 32, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !203, file: !16, line: 186, baseType: !261, size: 64, align: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !263, line: 37, baseType: !264)
!263 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !263, line: 39, size: 128, align: 64, elements: !265)
!265 = !{!266, !267}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !264, file: !263, line: 41, baseType: !80, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !264, file: !263, line: 42, baseType: !261, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !203, file: !16, line: 188, baseType: !201, size: 64, align: 64, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !203, file: !16, line: 189, baseType: !201, size: 64, align: 64, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !203, file: !16, line: 191, baseType: !118, size: 64, align: 64, offset: 640)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !203, file: !16, line: 193, baseType: !272, size: 64, align: 64, offset: 704)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !274)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !156, file: !4, line: 151, baseType: !277, size: 64, align: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !148}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !156, file: !4, line: 152, baseType: !281, size: 64, align: 64, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!162, !148, !284, !167}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !156, file: !4, line: 155, baseType: !286, size: 64, align: 64, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!284, !148}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !150, file: !4, line: 103, baseType: !93, size: 64, align: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !150, file: !4, line: 104, baseType: !291, size: 64, align: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !292, line: 77, baseType: !293)
!292 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !292, line: 77, flags: DIFlagFwdDecl)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !150, file: !4, line: 105, baseType: !291, size: 64, align: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !150, file: !4, line: 106, baseType: !93, size: 64, align: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !150, file: !4, line: 107, baseType: !252, size: 32, align: 32, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !150, file: !4, line: 109, baseType: !163, size: 64, align: 64, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !150, file: !4, line: 110, baseType: !300, size: 64, align: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !302, line: 39, baseType: !303)
!302 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !302, line: 41, size: 192, align: 64, elements: !304)
!304 = !{!305, !306, !307}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !303, file: !302, line: 43, baseType: !93, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !303, file: !302, line: 44, baseType: !163, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !303, file: !302, line: 45, baseType: !163, size: 64, align: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !150, file: !4, line: 111, baseType: !300, size: 64, align: 64, offset: 576)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !150, file: !4, line: 112, baseType: !300, size: 64, align: 64, offset: 640)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !150, file: !4, line: 113, baseType: !311, size: 48, align: 8, offset: 704)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 48, align: 8, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 6)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !150, file: !4, line: 117, baseType: !252, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !150, file: !4, line: 118, baseType: !252, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !150, file: !4, line: 119, baseType: !252, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !150, file: !4, line: 120, baseType: !252, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !150, file: !4, line: 121, baseType: !252, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !150, file: !4, line: 122, baseType: !252, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !150, file: !4, line: 124, baseType: !80, size: 64, align: 64, offset: 768)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !150, file: !4, line: 125, baseType: !80, size: 64, align: 64, offset: 832)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !111, file: !114, line: 38, baseType: !177, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !111, file: !114, line: 39, baseType: !177, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !111, file: !114, line: 40, baseType: !177, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !111, file: !114, line: 41, baseType: !177, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !111, file: !114, line: 42, baseType: !177, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !111, file: !114, line: 43, baseType: !177, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !111, file: !114, line: 44, baseType: !177, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !111, file: !114, line: 45, baseType: !177, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !111, file: !114, line: 46, baseType: !118, size: 64, align: 64, offset: 1792)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !111, file: !114, line: 47, baseType: !118, size: 64, align: 64, offset: 1856)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !111, file: !102, line: 27, baseType: !118, size: 64, align: 64, offset: 1920)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !111, file: !102, line: 28, baseType: !118, size: 64, align: 64, offset: 1984)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !111, file: !102, line: 30, baseType: !79, size: 32, align: 32, offset: 2048)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !111, file: !102, line: 31, baseType: !118, size: 64, align: 64, offset: 2112)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !111, file: !102, line: 32, baseType: !118, size: 64, align: 64, offset: 2176)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !111, file: !102, line: 34, baseType: !79, size: 32, align: 32, offset: 2240)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !111, file: !102, line: 35, baseType: !79, size: 32, align: 32, offset: 2272)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !111, file: !102, line: 36, baseType: !79, size: 32, align: 32, offset: 2304)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !111, file: !102, line: 38, baseType: !79, size: 32, align: 32, offset: 2336)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !111, file: !102, line: 38, baseType: !79, size: 32, align: 32, offset: 2368)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !111, file: !102, line: 38, baseType: !79, size: 32, align: 32, offset: 2400)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !111, file: !102, line: 38, baseType: !79, size: 32, align: 32, offset: 2432)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !101, file: !105, line: 9, baseType: !345, size: 64, align: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !346, line: 75, baseType: !347)
!346 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !348, line: 139, baseType: !191)
!348 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!349 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !101, file: !105, line: 10, baseType: !345, size: 64, align: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !101, file: !105, line: 12, baseType: !118, size: 64, align: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !101, file: !105, line: 13, baseType: !118, size: 64, align: 64, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !101, file: !105, line: 15, baseType: !177, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !101, file: !105, line: 16, baseType: !177, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !101, file: !105, line: 17, baseType: !177, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !101, file: !105, line: 18, baseType: !177, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !101, file: !105, line: 19, baseType: !177, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !101, file: !105, line: 21, baseType: !358, size: 64, align: 64, offset: 512)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !132, line: 102, baseType: !360)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !132, line: 102, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !101, file: !105, line: 22, baseType: !79, size: 32, align: 32, offset: 576)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !101, file: !105, line: 25, baseType: !363, size: 128, align: 64, offset: 640)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 128, align: 64, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 2)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !101, file: !105, line: 26, baseType: !79, size: 32, align: 32, offset: 768)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !101, file: !105, line: 27, baseType: !79, size: 32, align: 32, offset: 800)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !101, file: !105, line: 29, baseType: !369, size: 64, align: 64, offset: 832)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !132, line: 103, baseType: !371)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !132, line: 103, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !101, file: !105, line: 30, baseType: !373, size: 64, align: 64, offset: 896)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !375, line: 37, baseType: !376)
!375 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !375, line: 37, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !101, file: !105, line: 32, baseType: !118, size: 64, align: 64, offset: 960)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !101, file: !105, line: 33, baseType: !118, size: 64, align: 64, offset: 1024)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !101, file: !105, line: 34, baseType: !118, size: 64, align: 64, offset: 1088)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !101, file: !105, line: 35, baseType: !177, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !101, file: !105, line: 36, baseType: !177, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !101, file: !105, line: 37, baseType: !177, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !101, file: !105, line: 38, baseType: !177, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !101, file: !105, line: 40, baseType: !385, size: 128, align: 64, offset: 1216)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !77, line: 504, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !77, line: 506, size: 128, align: 64, elements: !387)
!387 = !{!388, !390}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !386, file: !77, line: 508, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !77, line: 48, baseType: !191)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !386, file: !77, line: 509, baseType: !389, size: 64, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !101, file: !105, line: 41, baseType: !345, size: 64, align: 64, offset: 1344)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !101, file: !105, line: 42, baseType: !79, size: 32, align: 32, offset: 1408)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !101, file: !105, line: 44, baseType: !261, size: 64, align: 64, offset: 1472)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !101, file: !105, line: 45, baseType: !261, size: 64, align: 64, offset: 1536)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !101, file: !105, line: 53, baseType: !396, size: 64, align: 64, offset: 1600)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !399, !96, !79}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !132, line: 107, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !402, line: 30, size: 2240, align: 64, elements: !403)
!402 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!403 = !{!404, !405, !406, !407, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !483, !487, !491, !495, !500, !593, !620, !624}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !401, file: !105, line: 3, baseType: !79, size: 32, align: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !401, file: !105, line: 4, baseType: !79, size: 32, align: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !401, file: !105, line: 6, baseType: !79, size: 32, align: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !401, file: !105, line: 8, baseType: !408, size: 64, align: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !132, line: 113, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !402, line: 25, size: 1920, align: 64, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !410, file: !114, line: 3, baseType: !79, size: 32, align: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !410, file: !114, line: 4, baseType: !79, size: 32, align: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !410, file: !114, line: 6, baseType: !79, size: 32, align: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !410, file: !114, line: 9, baseType: !118, size: 64, align: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !410, file: !114, line: 10, baseType: !79, size: 32, align: 32, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !410, file: !114, line: 11, baseType: !118, size: 64, align: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !410, file: !114, line: 11, baseType: !118, size: 64, align: 64, offset: 320)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !410, file: !114, line: 11, baseType: !118, size: 64, align: 64, offset: 384)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !410, file: !114, line: 13, baseType: !124, size: 16, align: 16, offset: 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !410, file: !114, line: 14, baseType: !118, size: 64, align: 64, offset: 512)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !410, file: !114, line: 15, baseType: !118, size: 64, align: 64, offset: 576)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !410, file: !114, line: 16, baseType: !79, size: 32, align: 32, offset: 640)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !410, file: !114, line: 17, baseType: !118, size: 64, align: 64, offset: 704)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !410, file: !114, line: 19, baseType: !130, size: 64, align: 64, offset: 768)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !410, file: !114, line: 19, baseType: !130, size: 64, align: 64, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !410, file: !114, line: 21, baseType: !118, size: 64, align: 64, offset: 896)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !410, file: !114, line: 22, baseType: !118, size: 64, align: 64, offset: 960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !410, file: !114, line: 23, baseType: !118, size: 64, align: 64, offset: 1024)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !410, file: !114, line: 24, baseType: !118, size: 64, align: 64, offset: 1088)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !410, file: !114, line: 26, baseType: !118, size: 64, align: 64, offset: 1152)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !410, file: !114, line: 27, baseType: !118, size: 64, align: 64, offset: 1216)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !410, file: !114, line: 28, baseType: !118, size: 64, align: 64, offset: 1280)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !410, file: !114, line: 29, baseType: !118, size: 64, align: 64, offset: 1344)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !410, file: !114, line: 30, baseType: !118, size: 64, align: 64, offset: 1408)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !410, file: !114, line: 31, baseType: !118, size: 64, align: 64, offset: 1472)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !410, file: !114, line: 32, baseType: !118, size: 64, align: 64, offset: 1536)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !410, file: !114, line: 33, baseType: !118, size: 64, align: 64, offset: 1600)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !410, file: !114, line: 35, baseType: !148, size: 64, align: 64, offset: 1664)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !410, file: !114, line: 38, baseType: !177, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !410, file: !114, line: 39, baseType: !177, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !410, file: !114, line: 40, baseType: !177, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !410, file: !114, line: 41, baseType: !177, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !410, file: !114, line: 42, baseType: !177, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !410, file: !114, line: 43, baseType: !177, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !410, file: !114, line: 44, baseType: !177, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !410, file: !114, line: 45, baseType: !177, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !410, file: !114, line: 46, baseType: !118, size: 64, align: 64, offset: 1792)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !410, file: !114, line: 47, baseType: !118, size: 64, align: 64, offset: 1856)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !401, file: !105, line: 9, baseType: !345, size: 64, align: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !401, file: !105, line: 10, baseType: !345, size: 64, align: 64, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !401, file: !105, line: 12, baseType: !118, size: 64, align: 64, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !401, file: !105, line: 13, baseType: !118, size: 64, align: 64, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !401, file: !105, line: 15, baseType: !177, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !401, file: !105, line: 16, baseType: !177, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !401, file: !105, line: 17, baseType: !177, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !401, file: !105, line: 18, baseType: !177, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !401, file: !105, line: 19, baseType: !177, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !401, file: !105, line: 21, baseType: !358, size: 64, align: 64, offset: 512)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !401, file: !105, line: 22, baseType: !79, size: 32, align: 32, offset: 576)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !401, file: !105, line: 25, baseType: !363, size: 128, align: 64, offset: 640)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !401, file: !105, line: 26, baseType: !79, size: 32, align: 32, offset: 768)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !401, file: !105, line: 27, baseType: !79, size: 32, align: 32, offset: 800)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !401, file: !105, line: 29, baseType: !369, size: 64, align: 64, offset: 832)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !401, file: !105, line: 30, baseType: !373, size: 64, align: 64, offset: 896)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !401, file: !105, line: 32, baseType: !118, size: 64, align: 64, offset: 960)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !401, file: !105, line: 33, baseType: !118, size: 64, align: 64, offset: 1024)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !401, file: !105, line: 34, baseType: !118, size: 64, align: 64, offset: 1088)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !401, file: !105, line: 35, baseType: !177, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !401, file: !105, line: 36, baseType: !177, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !401, file: !105, line: 37, baseType: !177, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !401, file: !105, line: 38, baseType: !177, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !401, file: !105, line: 40, baseType: !385, size: 128, align: 64, offset: 1216)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !401, file: !105, line: 41, baseType: !345, size: 64, align: 64, offset: 1344)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !401, file: !105, line: 42, baseType: !79, size: 32, align: 32, offset: 1408)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !401, file: !105, line: 44, baseType: !261, size: 64, align: 64, offset: 1472)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !401, file: !105, line: 45, baseType: !261, size: 64, align: 64, offset: 1536)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !401, file: !105, line: 53, baseType: !396, size: 64, align: 64, offset: 1600)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !401, file: !105, line: 55, baseType: !480, size: 64, align: 64, offset: 1664)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!79, !399, !95}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !401, file: !105, line: 57, baseType: !484, size: 64, align: 64, offset: 1728)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!79, !399, !96}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !401, file: !105, line: 60, baseType: !488, size: 64, align: 64, offset: 1792)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!96, !399}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !401, file: !105, line: 62, baseType: !492, size: 64, align: 64, offset: 1856)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64, align: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !399, !96, !96, !79}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !401, file: !105, line: 65, baseType: !496, size: 64, align: 64, offset: 1920)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!499, !399, !96, !96}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !401, file: !105, line: 69, baseType: !501, size: 64, align: 64, offset: 1984)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!504, !399, !96}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !132, line: 109, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !507, line: 15, size: 1408, align: 64, elements: !508)
!507 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!508 = !{!509, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !544, !545, !547, !548, !549, !550, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !506, file: !510, line: 3, baseType: !79, size: 32, align: 32)
!510 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!511 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !506, file: !510, line: 4, baseType: !79, size: 32, align: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !506, file: !510, line: 5, baseType: !373, size: 64, align: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !506, file: !510, line: 7, baseType: !81, size: 64, align: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !506, file: !510, line: 8, baseType: !399, size: 64, align: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !506, file: !510, line: 9, baseType: !118, size: 64, align: 64, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !506, file: !510, line: 10, baseType: !118, size: 64, align: 64, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !506, file: !510, line: 11, baseType: !345, size: 64, align: 64, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !506, file: !510, line: 12, baseType: !79, size: 32, align: 32, offset: 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !506, file: !510, line: 13, baseType: !118, size: 64, align: 64, offset: 512)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !506, file: !510, line: 15, baseType: !521, size: 64, align: 64, offset: 576)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !132, line: 108, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !527, line: 5, size: 704, align: 64, elements: !528)
!527 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!528 = !{!529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !526, file: !510, line: 3, baseType: !79, size: 32, align: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !526, file: !510, line: 4, baseType: !79, size: 32, align: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !526, file: !510, line: 5, baseType: !373, size: 64, align: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !526, file: !510, line: 7, baseType: !81, size: 64, align: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !526, file: !510, line: 8, baseType: !399, size: 64, align: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !526, file: !510, line: 9, baseType: !118, size: 64, align: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !526, file: !510, line: 10, baseType: !118, size: 64, align: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !526, file: !510, line: 11, baseType: !345, size: 64, align: 64, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !526, file: !510, line: 12, baseType: !79, size: 32, align: 32, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !526, file: !510, line: 13, baseType: !118, size: 64, align: 64, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !526, file: !510, line: 15, baseType: !521, size: 64, align: 64, offset: 576)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !526, file: !510, line: 17, baseType: !541, size: 64, align: 64, offset: 640)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!96, !524}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !506, file: !510, line: 17, baseType: !541, size: 64, align: 64, offset: 640)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !506, file: !546, line: 5, baseType: !118, size: 64, align: 64, offset: 704)
!546 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!547 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !506, file: !546, line: 6, baseType: !118, size: 64, align: 64, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !506, file: !546, line: 7, baseType: !345, size: 64, align: 64, offset: 832)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !506, file: !546, line: 9, baseType: !373, size: 64, align: 64, offset: 896)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !506, file: !546, line: 10, baseType: !551, size: 64, align: 64, offset: 960)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !132, line: 111, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !554, line: 13, size: 576, align: 64, elements: !555)
!554 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!555 = !{!556, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !574, !575}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !553, file: !557, line: 3, baseType: !79, size: 32, align: 32)
!557 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!558 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !553, file: !557, line: 4, baseType: !79, size: 32, align: 32, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !553, file: !557, line: 6, baseType: !345, size: 64, align: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !553, file: !557, line: 8, baseType: !118, size: 64, align: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !553, file: !557, line: 9, baseType: !118, size: 64, align: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !553, file: !557, line: 10, baseType: !118, size: 64, align: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !553, file: !557, line: 11, baseType: !79, size: 32, align: 32, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !553, file: !557, line: 14, baseType: !177, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !553, file: !557, line: 15, baseType: !177, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !553, file: !557, line: 18, baseType: !177, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !553, file: !557, line: 19, baseType: !177, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !553, file: !557, line: 20, baseType: !177, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !553, file: !557, line: 21, baseType: !177, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !553, file: !557, line: 22, baseType: !571, size: 64, align: 8, offset: 360)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 64, align: 8, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 8)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !553, file: !557, line: 26, baseType: !81, size: 64, align: 64, offset: 448)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !553, file: !557, line: 28, baseType: !551, size: 64, align: 64, offset: 512)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !506, file: !546, line: 12, baseType: !177, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !506, file: !546, line: 13, baseType: !118, size: 64, align: 64, offset: 1088)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !506, file: !546, line: 14, baseType: !79, size: 32, align: 32, offset: 1152)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !506, file: !546, line: 15, baseType: !118, size: 64, align: 64, offset: 1216)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !506, file: !546, line: 17, baseType: !177, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !506, file: !546, line: 18, baseType: !177, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !506, file: !546, line: 19, baseType: !177, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !506, file: !546, line: 20, baseType: !177, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !506, file: !546, line: 22, baseType: !177, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !506, file: !546, line: 23, baseType: !177, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !506, file: !546, line: 24, baseType: !177, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !506, file: !546, line: 25, baseType: !177, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !506, file: !546, line: 26, baseType: !177, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !506, file: !546, line: 31, baseType: !590, size: 64, align: 64, offset: 1344)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64, align: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!118, !504}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !401, file: !105, line: 70, baseType: !594, size: 64, align: 64, offset: 2048)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64, align: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!597, !399, !96}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !132, line: 110, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !600, line: 15, size: 960, align: 64, elements: !601)
!600 = !DIFile(filename: "../../../src/core/queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !616, !617, !618, !619}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !599, file: !510, line: 3, baseType: !79, size: 32, align: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !599, file: !510, line: 4, baseType: !79, size: 32, align: 32, offset: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !599, file: !510, line: 5, baseType: !373, size: 64, align: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !599, file: !510, line: 7, baseType: !81, size: 64, align: 64, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !599, file: !510, line: 8, baseType: !399, size: 64, align: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !599, file: !510, line: 9, baseType: !118, size: 64, align: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !599, file: !510, line: 10, baseType: !118, size: 64, align: 64, offset: 320)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !599, file: !510, line: 11, baseType: !345, size: 64, align: 64, offset: 384)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !599, file: !510, line: 12, baseType: !79, size: 32, align: 32, offset: 448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !599, file: !510, line: 13, baseType: !118, size: 64, align: 64, offset: 512)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !599, file: !510, line: 15, baseType: !521, size: 64, align: 64, offset: 576)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !599, file: !510, line: 17, baseType: !541, size: 64, align: 64, offset: 640)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !599, file: !615, line: 5, baseType: !118, size: 64, align: 64, offset: 704)
!615 = !DIFile(filename: "../../../src/core/query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!616 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !599, file: !615, line: 6, baseType: !118, size: 64, align: 64, offset: 768)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !599, file: !615, line: 7, baseType: !345, size: 64, align: 64, offset: 832)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !599, file: !615, line: 9, baseType: !177, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !599, file: !615, line: 11, baseType: !177, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !401, file: !105, line: 71, baseType: !621, size: 64, align: 64, offset: 2112)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64, align: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!79, !96, !96}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !401, file: !105, line: 73, baseType: !621, size: 64, align: 64, offset: 2176)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !101, file: !105, line: 55, baseType: !480, size: 64, align: 64, offset: 1664)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !101, file: !105, line: 57, baseType: !484, size: 64, align: 64, offset: 1728)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !101, file: !105, line: 60, baseType: !488, size: 64, align: 64, offset: 1792)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !101, file: !105, line: 62, baseType: !492, size: 64, align: 64, offset: 1856)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !101, file: !105, line: 65, baseType: !496, size: 64, align: 64, offset: 1920)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !101, file: !105, line: 69, baseType: !501, size: 64, align: 64, offset: 1984)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !101, file: !105, line: 70, baseType: !594, size: 64, align: 64, offset: 2048)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !101, file: !105, line: 71, baseType: !621, size: 64, align: 64, offset: 2112)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !101, file: !105, line: 73, baseType: !621, size: 64, align: 64, offset: 2176)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !101, file: !102, line: 46, baseType: !261, size: 64, align: 64, offset: 2240)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !101, file: !102, line: 47, baseType: !261, size: 64, align: 64, offset: 2304)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !101, file: !102, line: 48, baseType: !637, size: 64, align: 64, offset: 2368)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !100, line: 8, baseType: !639)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !100, line: 8, flags: DIFlagFwdDecl)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !101, file: !102, line: 49, baseType: !261, size: 64, align: 64, offset: 2432)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !101, file: !102, line: 51, baseType: !118, size: 64, align: 64, offset: 2496)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !101, file: !102, line: 53, baseType: !118, size: 64, align: 64, offset: 2560)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !101, file: !102, line: 54, baseType: !118, size: 64, align: 64, offset: 2624)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !101, file: !102, line: 55, baseType: !118, size: 64, align: 64, offset: 2688)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !101, file: !102, line: 56, baseType: !118, size: 64, align: 64, offset: 2752)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !101, file: !102, line: 57, baseType: !79, size: 32, align: 32, offset: 2816)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !101, file: !102, line: 59, baseType: !177, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !101, file: !102, line: 60, baseType: !177, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !101, file: !102, line: 62, baseType: !177, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !101, file: !102, line: 63, baseType: !177, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !101, file: !102, line: 64, baseType: !177, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !101, file: !102, line: 65, baseType: !177, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !101, file: !102, line: 66, baseType: !177, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !101, file: !102, line: 67, baseType: !177, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !101, file: !102, line: 68, baseType: !177, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !101, file: !102, line: 69, baseType: !177, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !101, file: !102, line: 70, baseType: !177, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !101, file: !102, line: 71, baseType: !177, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !101, file: !102, line: 72, baseType: !177, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !101, file: !102, line: 74, baseType: !79, size: 32, align: 32, offset: 2880)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !101, file: !102, line: 75, baseType: !79, size: 32, align: 32, offset: 2912)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !101, file: !102, line: 76, baseType: !79, size: 32, align: 32, offset: 2944)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !101, file: !102, line: 77, baseType: !79, size: 32, align: 32, offset: 2976)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !101, file: !102, line: 79, baseType: !373, size: 64, align: 64, offset: 3008)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !101, file: !102, line: 80, baseType: !261, size: 64, align: 64, offset: 3072)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !101, file: !102, line: 81, baseType: !261, size: 64, align: 64, offset: 3136)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !101, file: !102, line: 83, baseType: !300, size: 64, align: 64, offset: 3200)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !101, file: !102, line: 84, baseType: !252, size: 32, align: 32, offset: 3264)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !101, file: !102, line: 87, baseType: !79, size: 32, align: 32, offset: 3296)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !101, file: !102, line: 91, baseType: !261, size: 64, align: 64, offset: 3328)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !101, file: !102, line: 92, baseType: !385, size: 128, align: 64, offset: 3392)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !101, file: !102, line: 93, baseType: !385, size: 128, align: 64, offset: 3520)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !101, file: !102, line: 95, baseType: !79, size: 32, align: 32, offset: 3648)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !101, file: !102, line: 96, baseType: !79, size: 32, align: 32, offset: 3680)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !101, file: !102, line: 97, baseType: !79, size: 32, align: 32, offset: 3712)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !101, file: !102, line: 100, baseType: !261, size: 64, align: 64, offset: 3776)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !101, file: !102, line: 103, baseType: !261, size: 64, align: 64, offset: 3840)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !101, file: !102, line: 106, baseType: !261, size: 64, align: 64, offset: 3904)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !101, file: !102, line: 108, baseType: !373, size: 64, align: 64, offset: 3968)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !101, file: !102, line: 109, baseType: !261, size: 64, align: 64, offset: 4032)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !101, file: !102, line: 111, baseType: !261, size: 64, align: 64, offset: 4096)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !101, file: !102, line: 114, baseType: !81, size: 64, align: 64, offset: 4160)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !101, file: !102, line: 116, baseType: !373, size: 64, align: 64, offset: 4224)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !101, file: !102, line: 117, baseType: !685, size: 32768, align: 64, offset: 4288)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 32768, align: 64, elements: !735)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !687, line: 10, size: 128, align: 64, elements: !688)
!687 = !DIFile(filename: "modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!688 = !{!689, !734}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !686, file: !687, line: 11, baseType: !690, size: 64, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !687, line: 7, baseType: !692)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !694, !96, !95, !95, !118, !300}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !100, line: 7, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !697, line: 15, size: 1600, align: 64, elements: !698)
!697 = !DIFile(filename: "irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !696, file: !510, line: 3, baseType: !79, size: 32, align: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !696, file: !510, line: 4, baseType: !79, size: 32, align: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !696, file: !510, line: 5, baseType: !373, size: 64, align: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !696, file: !510, line: 7, baseType: !81, size: 64, align: 64, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !696, file: !510, line: 8, baseType: !98, size: 64, align: 64, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !696, file: !510, line: 9, baseType: !118, size: 64, align: 64, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !696, file: !510, line: 10, baseType: !118, size: 64, align: 64, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !696, file: !510, line: 11, baseType: !345, size: 64, align: 64, offset: 384)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !696, file: !510, line: 12, baseType: !79, size: 32, align: 32, offset: 448)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !696, file: !510, line: 13, baseType: !118, size: 64, align: 64, offset: 512)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !696, file: !510, line: 15, baseType: !521, size: 64, align: 64, offset: 576)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !696, file: !510, line: 17, baseType: !541, size: 64, align: 64, offset: 640)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !696, file: !546, line: 5, baseType: !118, size: 64, align: 64, offset: 704)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !696, file: !546, line: 6, baseType: !118, size: 64, align: 64, offset: 768)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !696, file: !546, line: 7, baseType: !345, size: 64, align: 64, offset: 832)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !696, file: !546, line: 9, baseType: !373, size: 64, align: 64, offset: 896)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !696, file: !546, line: 10, baseType: !551, size: 64, align: 64, offset: 960)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !696, file: !546, line: 12, baseType: !177, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !696, file: !546, line: 13, baseType: !118, size: 64, align: 64, offset: 1088)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !696, file: !546, line: 14, baseType: !79, size: 32, align: 32, offset: 1152)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !696, file: !546, line: 15, baseType: !118, size: 64, align: 64, offset: 1216)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !696, file: !546, line: 17, baseType: !177, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !696, file: !546, line: 18, baseType: !177, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !696, file: !546, line: 19, baseType: !177, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !696, file: !546, line: 20, baseType: !177, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !696, file: !546, line: 22, baseType: !177, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !696, file: !546, line: 23, baseType: !177, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !696, file: !546, line: 24, baseType: !177, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !696, file: !546, line: 25, baseType: !177, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !696, file: !546, line: 26, baseType: !177, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !696, file: !546, line: 31, baseType: !590, size: 64, align: 64, offset: 1344)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !696, file: !697, line: 18, baseType: !261, size: 64, align: 64, offset: 1408)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !696, file: !697, line: 20, baseType: !345, size: 64, align: 64, offset: 1472)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !696, file: !697, line: 21, baseType: !79, size: 32, align: 32, offset: 1536)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !696, file: !697, line: 22, baseType: !79, size: 32, align: 32, offset: 1568)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !686, file: !687, line: 12, baseType: !95, size: 8, align: 8, offset: 64)
!735 = !{!736}
!736 = !DISubrange(count: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !101, file: !102, line: 118, baseType: !738, size: 2048, align: 8, offset: 37056)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 2048, align: 8, elements: !735)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !101, file: !102, line: 120, baseType: !621, size: 64, align: 64, offset: 39104)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHFunc", file: !77, line: 91, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64, align: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !80, !80, !80}
!744 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64, align: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "KNOCKOUT_REC", file: !747, line: 57, baseType: !748)
!747 = !DIFile(filename: "irc-commands.c", directory: "/home/lichi/Desktop/irssi/task1")
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !747, line: 53, size: 192, align: 64, elements: !749)
!749 = !{!750, !751, !752}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !748, file: !747, line: 54, baseType: !694, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ban", scope: !748, file: !747, line: 55, baseType: !118, size: 64, align: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "unban_time", scope: !748, file: !747, line: 56, baseType: !345, size: 64, align: 64, offset: 128)
!753 = !{!754, !755}
!754 = distinct !DIGlobalVariable(name: "tmpstr", scope: !0, file: !747, line: 59, type: !300, isLocal: true, isDefinition: true, variable: %struct._GString** @tmpstr)
!755 = distinct !DIGlobalVariable(name: "knockout_tag", scope: !0, file: !747, line: 60, type: !79, isLocal: true, isDefinition: true, variable: i32* @knockout_tag)
!756 = !{i32 2, !"Dwarf Version", i32 4}
!757 = !{i32 2, !"Debug Info Version", i32 3}
!758 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!759 = distinct !DISubprogram(name: "irc_commands_init", scope: !747, file: !747, line: 965, type: !249, isLocal: false, isDefinition: true, scopeLine: 966, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !760)
!760 = !{}
!761 = !DILocation(line: 967, column: 11, scope: !759)
!762 = !DILocation(line: 967, column: 9, scope: !759)
!763 = !DILocation(line: 969, column: 2, scope: !759)
!764 = !DILocation(line: 970, column: 2, scope: !759)
!765 = !DILocation(line: 971, column: 2, scope: !759)
!766 = !DILocation(line: 972, column: 2, scope: !759)
!767 = !DILocation(line: 973, column: 2, scope: !759)
!768 = !DILocation(line: 975, column: 17, scope: !759)
!769 = !DILocation(line: 975, column: 15, scope: !759)
!770 = !DILocation(line: 977, column: 46, scope: !759)
!771 = !DILocation(line: 977, column: 2, scope: !772)
!772 = !DILexicalBlockFile(scope: !759, file: !747, discriminator: 1)
!773 = !DILocation(line: 978, column: 44, scope: !759)
!774 = !DILocation(line: 978, column: 2, scope: !772)
!775 = !DILocation(line: 979, column: 45, scope: !759)
!776 = !DILocation(line: 979, column: 2, scope: !772)
!777 = !DILocation(line: 980, column: 44, scope: !759)
!778 = !DILocation(line: 980, column: 2, scope: !772)
!779 = !DILocation(line: 981, column: 44, scope: !759)
!780 = !DILocation(line: 981, column: 2, scope: !772)
!781 = !DILocation(line: 982, column: 45, scope: !759)
!782 = !DILocation(line: 982, column: 2, scope: !772)
!783 = !DILocation(line: 983, column: 46, scope: !759)
!784 = !DILocation(line: 983, column: 2, scope: !772)
!785 = !DILocation(line: 984, column: 44, scope: !759)
!786 = !DILocation(line: 984, column: 2, scope: !772)
!787 = !DILocation(line: 985, column: 43, scope: !759)
!788 = !DILocation(line: 985, column: 2, scope: !772)
!789 = !DILocation(line: 986, column: 45, scope: !759)
!790 = !DILocation(line: 986, column: 2, scope: !772)
!791 = !DILocation(line: 987, column: 44, scope: !759)
!792 = !DILocation(line: 987, column: 2, scope: !772)
!793 = !DILocation(line: 988, column: 45, scope: !759)
!794 = !DILocation(line: 988, column: 2, scope: !772)
!795 = !DILocation(line: 989, column: 46, scope: !759)
!796 = !DILocation(line: 989, column: 2, scope: !772)
!797 = !DILocation(line: 990, column: 44, scope: !759)
!798 = !DILocation(line: 990, column: 2, scope: !772)
!799 = !DILocation(line: 992, column: 44, scope: !759)
!800 = !DILocation(line: 992, column: 2, scope: !772)
!801 = !DILocation(line: 993, column: 44, scope: !759)
!802 = !DILocation(line: 993, column: 2, scope: !772)
!803 = !DILocation(line: 995, column: 44, scope: !759)
!804 = !DILocation(line: 995, column: 2, scope: !772)
!805 = !DILocation(line: 996, column: 46, scope: !759)
!806 = !DILocation(line: 996, column: 2, scope: !772)
!807 = !DILocation(line: 998, column: 45, scope: !759)
!808 = !DILocation(line: 998, column: 2, scope: !772)
!809 = !DILocation(line: 1000, column: 44, scope: !759)
!810 = !DILocation(line: 1000, column: 2, scope: !772)
!811 = !DILocation(line: 1002, column: 45, scope: !759)
!812 = !DILocation(line: 1002, column: 2, scope: !772)
!813 = !DILocation(line: 1004, column: 45, scope: !759)
!814 = !DILocation(line: 1004, column: 2, scope: !772)
!815 = !DILocation(line: 1006, column: 46, scope: !759)
!816 = !DILocation(line: 1006, column: 2, scope: !772)
