; ModuleID = './line291-fe-notifylist.o.i'
source_filename = "./line291-fe-notifylist.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._FORMAT_REC = type { i8*, i8*, i32, [10 x i32] }
%struct._GSList = type { i8*, %struct._GSList* }
%struct.MODULE_FILE_REC = type { %struct._MODULE_REC*, i8*, i8*, void ()*, %struct._GModule*, i8 }
%struct._MODULE_REC = type { i8*, %struct._GSList* }
%struct._GModule = type opaque

!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 10, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "../../../../src/core/levels.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!38 = !DIEnumerator(name: "MSGLEVEL_CRAP", value: 1)
!39 = !DIEnumerator(name: "MSGLEVEL_MSGS", value: 2)
!40 = !DIEnumerator(name: "MSGLEVEL_PUBLIC", value: 4)
!41 = !DIEnumerator(name: "MSGLEVEL_NOTICES", value: 8)
!42 = !DIEnumerator(name: "MSGLEVEL_SNOTES", value: 16)
!43 = !DIEnumerator(name: "MSGLEVEL_CTCPS", value: 32)
!44 = !DIEnumerator(name: "MSGLEVEL_ACTIONS", value: 64)
!45 = !DIEnumerator(name: "MSGLEVEL_JOINS", value: 128)
!46 = !DIEnumerator(name: "MSGLEVEL_PARTS", value: 256)
!47 = !DIEnumerator(name: "MSGLEVEL_QUITS", value: 512)
!48 = !DIEnumerator(name: "MSGLEVEL_KICKS", value: 1024)
!49 = !DIEnumerator(name: "MSGLEVEL_MODES", value: 2048)
!50 = !DIEnumerator(name: "MSGLEVEL_TOPICS", value: 4096)
!51 = !DIEnumerator(name: "MSGLEVEL_WALLOPS", value: 8192)
!52 = !DIEnumerator(name: "MSGLEVEL_INVITES", value: 16384)
!53 = !DIEnumerator(name: "MSGLEVEL_NICKS", value: 32768)
!54 = !DIEnumerator(name: "MSGLEVEL_DCC", value: 65536)
!55 = !DIEnumerator(name: "MSGLEVEL_DCCMSGS", value: 131072)
!56 = !DIEnumerator(name: "MSGLEVEL_CLIENTNOTICE", value: 262144)
!57 = !DIEnumerator(name: "MSGLEVEL_CLIENTCRAP", value: 524288)
!58 = !DIEnumerator(name: "MSGLEVEL_CLIENTERROR", value: 1048576)
!59 = !DIEnumerator(name: "MSGLEVEL_HILIGHT", value: 2097152)
!60 = !DIEnumerator(name: "MSGLEVEL_ALL", value: 4194303)
!61 = !DIEnumerator(name: "MSGLEVEL_NOHILIGHT", value: 16777216)
!62 = !DIEnumerator(name: "MSGLEVEL_NO_ACT", value: 33554432)
!63 = !DIEnumerator(name: "MSGLEVEL_NEVER", value: 67108864)
!64 = !DIEnumerator(name: "MSGLEVEL_LASTLOG", value: 134217728)
!65 = !DIEnumerator(name: "MSGLEVEL_HIDDEN", value: 268435456)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 3, size: 32, align: 32, elements: !68)
!67 = !DIFile(filename: "module-formats.h", directory: "/home/lichi/Desktop/irssi/task1")
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!69 = !DIEnumerator(name: "IRCTXT_MODULE_NAME", value: 0)
!70 = !DIEnumerator(name: "IRCTXT_FILL_1", value: 1)
!71 = !DIEnumerator(name: "IRCTXT_NOTIFY_JOIN", value: 2)
!72 = !DIEnumerator(name: "IRCTXT_NOTIFY_PART", value: 3)
!73 = !DIEnumerator(name: "IRCTXT_NOTIFY_AWAY", value: 4)
!74 = !DIEnumerator(name: "IRCTXT_NOTIFY_UNAWAY", value: 5)
!75 = !DIEnumerator(name: "IRCTXT_NOTIFY_ONLINE", value: 6)
!76 = !DIEnumerator(name: "IRCTXT_NOTIFY_OFFLINE", value: 7)
!77 = !DIEnumerator(name: "IRCTXT_NOTIFY_LIST", value: 8)
!78 = !DIEnumerator(name: "IRCTXT_NOTIFY_LIST_EMPTY", value: 9)
!79 = !{!80, !87, !88, !124, !139, !444, !99, !767, !200, !532, !96}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !81, line: 9, baseType: !82)
!81 = !DIFile(filename: "../../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !85, !85, !85, !85, !85, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHATNET_REC", file: !90, line: 4, baseType: !91)
!90 = !DIFile(filename: "../../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHATNET_REC", file: !92, line: 17, size: 1152, align: 64, elements: !93)
!92 = !DIFile(filename: "../../../../src/irc/core/irc-chatnets.h", directory: "/home/lichi/Desktop/irssi/task1")
!93 = !{!94, !97, !98, !101, !102, !103, !104, !105, !106, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, file: !95, line: 1, baseType: !96, size: 32, align: 32)
!95 = !DIFile(filename: "../../../../src/core/chatnet-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!96 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !91, file: !95, line: 2, baseType: !96, size: 32, align: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !91, file: !95, line: 4, baseType: !99, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !91, file: !95, line: 6, baseType: !99, size: 64, align: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !91, file: !95, line: 7, baseType: !99, size: 64, align: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !91, file: !95, line: 8, baseType: !99, size: 64, align: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "own_host", scope: !91, file: !95, line: 10, baseType: !99, size: 64, align: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "autosendcmd", scope: !91, file: !95, line: 11, baseType: !99, size: 64, align: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !91, file: !95, line: 12, baseType: !107, size: 64, align: 64, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !109, line: 99, baseType: !110)
!109 = !DIFile(filename: "../../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !109, line: 99, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !91, file: !95, line: 12, baseType: !107, size: 64, align: 64, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !91, file: !92, line: 20, baseType: !99, size: 64, align: 64, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !91, file: !92, line: 21, baseType: !99, size: 64, align: 64, offset: 640)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !91, file: !92, line: 23, baseType: !99, size: 64, align: 64, offset: 704)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !91, file: !92, line: 24, baseType: !99, size: 64, align: 64, offset: 768)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !91, file: !92, line: 25, baseType: !99, size: 64, align: 64, offset: 832)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !91, file: !92, line: 27, baseType: !96, size: 32, align: 32, offset: 896)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !91, file: !92, line: 28, baseType: !96, size: 32, align: 32, offset: 928)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !91, file: !92, line: 29, baseType: !96, size: 32, align: 32, offset: 960)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !91, file: !92, line: 32, baseType: !96, size: 32, align: 32, offset: 992)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !91, file: !92, line: 32, baseType: !96, size: 32, align: 32, offset: 1024)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !91, file: !92, line: 32, baseType: !96, size: 32, align: 32, offset: 1056)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !91, file: !92, line: 32, baseType: !96, size: 32, align: 32, offset: 1088)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHATNET_REC", file: !109, line: 106, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHATNET_REC", file: !127, line: 13, size: 576, align: 64, elements: !128)
!127 = !DIFile(filename: "../../../../src/core/chatnets.h", directory: "/home/lichi/Desktop/irssi/task1")
!128 = !{!129, !130, !131, !132, !133, !134, !135, !136, !137, !138}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !126, file: !95, line: 1, baseType: !96, size: 32, align: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !126, file: !95, line: 2, baseType: !96, size: 32, align: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !95, line: 4, baseType: !99, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !126, file: !95, line: 6, baseType: !99, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !126, file: !95, line: 7, baseType: !99, size: 64, align: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !126, file: !95, line: 8, baseType: !99, size: 64, align: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "own_host", scope: !126, file: !95, line: 10, baseType: !99, size: 64, align: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "autosendcmd", scope: !126, file: !95, line: 11, baseType: !99, size: 64, align: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !126, file: !95, line: 12, baseType: !107, size: 64, align: 64, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !126, file: !95, line: 12, baseType: !107, size: 64, align: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !90, line: 6, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !142, line: 42, size: 39168, align: 64, elements: !143)
!142 = !DIFile(filename: "../../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!143 = !{!144, !146, !147, !148, !389, !394, !395, !396, !397, !398, !399, !400, !401, !402, !406, !407, !411, !412, !413, !417, !422, !423, !424, !425, !426, !427, !428, !429, !436, !437, !438, !439, !440, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !764, !766}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !141, file: !145, line: 3, baseType: !96, size: 32, align: 32)
!145 = !DIFile(filename: "../../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!146 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !141, file: !145, line: 4, baseType: !96, size: 32, align: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !141, file: !145, line: 6, baseType: !96, size: 32, align: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !141, file: !145, line: 8, baseType: !149, size: 64, align: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !90, line: 5, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !142, line: 24, size: 2496, align: 64, elements: !152)
!152 = !{!153, !155, !156, !157, !158, !159, !160, !161, !162, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !151, file: !154, line: 3, baseType: !96, size: 32, align: 32)
!154 = !DIFile(filename: "../../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!155 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !151, file: !154, line: 4, baseType: !96, size: 32, align: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !151, file: !154, line: 6, baseType: !96, size: 32, align: 32, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !151, file: !154, line: 9, baseType: !99, size: 64, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !151, file: !154, line: 10, baseType: !96, size: 32, align: 32, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !151, file: !154, line: 11, baseType: !99, size: 64, align: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !151, file: !154, line: 11, baseType: !99, size: 64, align: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !151, file: !154, line: 11, baseType: !99, size: 64, align: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !151, file: !154, line: 13, baseType: !163, size: 16, align: 16, offset: 448)
!163 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !151, file: !154, line: 14, baseType: !99, size: 64, align: 64, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !151, file: !154, line: 15, baseType: !99, size: 64, align: 64, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !151, file: !154, line: 16, baseType: !96, size: 32, align: 32, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !151, file: !154, line: 17, baseType: !99, size: 64, align: 64, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !151, file: !154, line: 19, baseType: !107, size: 64, align: 64, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !151, file: !154, line: 19, baseType: !107, size: 64, align: 64, offset: 832)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !151, file: !154, line: 21, baseType: !99, size: 64, align: 64, offset: 896)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !151, file: !154, line: 22, baseType: !99, size: 64, align: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !151, file: !154, line: 23, baseType: !99, size: 64, align: 64, offset: 1024)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !151, file: !154, line: 24, baseType: !99, size: 64, align: 64, offset: 1088)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !151, file: !154, line: 26, baseType: !99, size: 64, align: 64, offset: 1152)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !151, file: !154, line: 27, baseType: !99, size: 64, align: 64, offset: 1216)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !151, file: !154, line: 28, baseType: !99, size: 64, align: 64, offset: 1280)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !151, file: !154, line: 29, baseType: !99, size: 64, align: 64, offset: 1344)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !151, file: !154, line: 30, baseType: !99, size: 64, align: 64, offset: 1408)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !151, file: !154, line: 31, baseType: !99, size: 64, align: 64, offset: 1472)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !151, file: !154, line: 32, baseType: !99, size: 64, align: 64, offset: 1536)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !151, file: !154, line: 33, baseType: !99, size: 64, align: 64, offset: 1600)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !151, file: !154, line: 35, baseType: !183, size: 64, align: 64, offset: 1664)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !186)
!186 = !{!187, !190, !334, !335, !340, !341, !342, !343, !344, !353, !354, !355, !359, !360, !361, !362, !363, !364, !365, !366}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !185, file: !4, line: 100, baseType: !188, size: 32, align: 32)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !189, line: 49, baseType: !96)
!189 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!190 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !185, file: !4, line: 101, baseType: !191, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !194)
!194 = !{!195, !219, !225, !232, !236, !321, !325, !330}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !193, file: !4, line: 133, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!199, !183, !200, !202, !205, !206}
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !189, line: 46, baseType: !100)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !203, line: 66, baseType: !204)
!203 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!204 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !209, line: 42, baseType: !210)
!209 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !209, line: 44, size: 128, align: 64, elements: !211)
!211 = !{!212, !217, !218}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !210, file: !209, line: 46, baseType: !213, size: 32, align: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !214, line: 36, baseType: !215)
!214 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !203, line: 45, baseType: !216)
!216 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !210, file: !209, line: 47, baseType: !188, size: 32, align: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !210, file: !209, line: 48, baseType: !200, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !193, file: !4, line: 138, baseType: !220, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!199, !183, !223, !202, !205, !206}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !193, file: !4, line: 143, baseType: !226, size: 64, align: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!199, !183, !229, !231, !206}
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !203, line: 51, baseType: !230)
!230 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !193, file: !4, line: 147, baseType: !233, size: 64, align: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!199, !183, !206}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !193, file: !4, line: 149, baseType: !237, size: 64, align: 64, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!240, !183, !320}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !243)
!243 = !{!244, !246, !267, !296, !298, !302, !303, !304, !305, !313, !314, !315, !316}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !242, file: !16, line: 174, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !189, line: 77, baseType: !87)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !242, file: !16, line: 175, baseType: !247, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !250)
!250 = !{!251, !255, !256}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !249, file: !16, line: 198, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !245}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !249, file: !16, line: 199, baseType: !252, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !249, file: !16, line: 200, baseType: !257, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !245, !240, !260, !266}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!265, !245}
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !189, line: 50, baseType: !188)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !242, file: !16, line: 177, baseType: !268, size: 64, align: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !272)
!272 = !{!273, !278, !282, !286, !290, !291}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !271, file: !16, line: 216, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!265, !240, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !271, file: !16, line: 218, baseType: !279, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!265, !240}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !271, file: !16, line: 219, baseType: !283, size: 64, align: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!265, !240, !261, !245}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !271, file: !16, line: 222, baseType: !287, size: 64, align: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !240}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !271, file: !16, line: 226, baseType: !261, size: 64, align: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !271, file: !16, line: 227, baseType: !292, size: 64, align: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{null}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !242, file: !16, line: 178, baseType: !297, size: 32, align: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !189, line: 55, baseType: !216)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !242, file: !16, line: 180, baseType: !299, size: 64, align: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !301)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !242, file: !16, line: 182, baseType: !188, size: 32, align: 32, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !242, file: !16, line: 183, baseType: !297, size: 32, align: 32, offset: 352)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !242, file: !16, line: 184, baseType: !297, size: 32, align: 32, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !242, file: !16, line: 186, baseType: !306, size: 64, align: 64, offset: 448)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !308, line: 37, baseType: !309)
!308 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !308, line: 39, size: 128, align: 64, elements: !310)
!310 = !{!311, !312}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !309, file: !308, line: 41, baseType: !245, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !309, file: !308, line: 42, baseType: !306, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !242, file: !16, line: 188, baseType: !240, size: 64, align: 64, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !16, line: 189, baseType: !240, size: 64, align: 64, offset: 576)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !242, file: !16, line: 191, baseType: !99, size: 64, align: 64, offset: 640)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !242, file: !16, line: 193, baseType: !317, size: 64, align: 64, offset: 704)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !319)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !193, file: !4, line: 151, baseType: !322, size: 64, align: 64, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !183}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !193, file: !4, line: 152, baseType: !326, size: 64, align: 64, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!199, !183, !329, !206}
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !193, file: !4, line: 155, baseType: !331, size: 64, align: 64, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!329, !183}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !185, file: !4, line: 103, baseType: !200, size: 64, align: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !185, file: !4, line: 104, baseType: !336, size: 64, align: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !337, line: 77, baseType: !338)
!337 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !337, line: 77, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !185, file: !4, line: 105, baseType: !336, size: 64, align: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !185, file: !4, line: 106, baseType: !200, size: 64, align: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !185, file: !4, line: 107, baseType: !297, size: 32, align: 32, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !185, file: !4, line: 109, baseType: !202, size: 64, align: 64, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !185, file: !4, line: 110, baseType: !345, size: 64, align: 64, offset: 512)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !347, line: 39, baseType: !348)
!347 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !347, line: 41, size: 192, align: 64, elements: !349)
!349 = !{!350, !351, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !348, file: !347, line: 43, baseType: !200, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !348, file: !347, line: 44, baseType: !202, size: 64, align: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !348, file: !347, line: 45, baseType: !202, size: 64, align: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !185, file: !4, line: 111, baseType: !345, size: 64, align: 64, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !185, file: !4, line: 112, baseType: !345, size: 64, align: 64, offset: 640)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !185, file: !4, line: 113, baseType: !356, size: 48, align: 8, offset: 704)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 48, align: 8, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 6)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !185, file: !4, line: 117, baseType: !297, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !185, file: !4, line: 118, baseType: !297, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !185, file: !4, line: 119, baseType: !297, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !185, file: !4, line: 120, baseType: !297, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !185, file: !4, line: 121, baseType: !297, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !185, file: !4, line: 122, baseType: !297, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !185, file: !4, line: 124, baseType: !245, size: 64, align: 64, offset: 768)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !185, file: !4, line: 125, baseType: !245, size: 64, align: 64, offset: 832)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !151, file: !154, line: 38, baseType: !216, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !151, file: !154, line: 39, baseType: !216, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !151, file: !154, line: 40, baseType: !216, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !151, file: !154, line: 41, baseType: !216, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !151, file: !154, line: 42, baseType: !216, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !151, file: !154, line: 43, baseType: !216, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !151, file: !154, line: 44, baseType: !216, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !151, file: !154, line: 45, baseType: !216, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !151, file: !154, line: 46, baseType: !99, size: 64, align: 64, offset: 1792)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !151, file: !154, line: 47, baseType: !99, size: 64, align: 64, offset: 1856)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !151, file: !142, line: 27, baseType: !99, size: 64, align: 64, offset: 1920)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !151, file: !142, line: 28, baseType: !99, size: 64, align: 64, offset: 1984)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !151, file: !142, line: 30, baseType: !96, size: 32, align: 32, offset: 2048)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !151, file: !142, line: 31, baseType: !99, size: 64, align: 64, offset: 2112)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !151, file: !142, line: 32, baseType: !99, size: 64, align: 64, offset: 2176)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !151, file: !142, line: 34, baseType: !96, size: 32, align: 32, offset: 2240)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !151, file: !142, line: 35, baseType: !96, size: 32, align: 32, offset: 2272)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !151, file: !142, line: 36, baseType: !96, size: 32, align: 32, offset: 2304)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !151, file: !142, line: 38, baseType: !96, size: 32, align: 32, offset: 2336)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !151, file: !142, line: 38, baseType: !96, size: 32, align: 32, offset: 2368)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !151, file: !142, line: 38, baseType: !96, size: 32, align: 32, offset: 2400)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !151, file: !142, line: 38, baseType: !96, size: 32, align: 32, offset: 2432)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !141, file: !145, line: 9, baseType: !390, size: 64, align: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !391, line: 75, baseType: !392)
!391 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !393, line: 139, baseType: !230)
!393 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!394 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !141, file: !145, line: 10, baseType: !390, size: 64, align: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !141, file: !145, line: 12, baseType: !99, size: 64, align: 64, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !141, file: !145, line: 13, baseType: !99, size: 64, align: 64, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !141, file: !145, line: 15, baseType: !216, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !141, file: !145, line: 16, baseType: !216, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !141, file: !145, line: 17, baseType: !216, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !141, file: !145, line: 18, baseType: !216, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !141, file: !145, line: 19, baseType: !216, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !141, file: !145, line: 21, baseType: !403, size: 64, align: 64, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !109, line: 102, baseType: !405)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !109, line: 102, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !141, file: !145, line: 22, baseType: !96, size: 32, align: 32, offset: 576)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !141, file: !145, line: 25, baseType: !408, size: 128, align: 64, offset: 640)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 128, align: 64, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 2)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !141, file: !145, line: 26, baseType: !96, size: 32, align: 32, offset: 768)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !141, file: !145, line: 27, baseType: !96, size: 32, align: 32, offset: 800)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !141, file: !145, line: 29, baseType: !414, size: 64, align: 64, offset: 832)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !109, line: 103, baseType: !416)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !109, line: 103, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !141, file: !145, line: 30, baseType: !418, size: 64, align: 64, offset: 896)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !420, line: 37, baseType: !421)
!420 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !420, line: 37, flags: DIFlagFwdDecl)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !141, file: !145, line: 32, baseType: !99, size: 64, align: 64, offset: 960)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !141, file: !145, line: 33, baseType: !99, size: 64, align: 64, offset: 1024)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !141, file: !145, line: 34, baseType: !99, size: 64, align: 64, offset: 1088)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !141, file: !145, line: 35, baseType: !216, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !141, file: !145, line: 36, baseType: !216, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !141, file: !145, line: 37, baseType: !216, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !141, file: !145, line: 38, baseType: !216, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !141, file: !145, line: 40, baseType: !430, size: 128, align: 64, offset: 1216)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !189, line: 504, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !189, line: 506, size: 128, align: 64, elements: !432)
!432 = !{!433, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !431, file: !189, line: 508, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !189, line: 48, baseType: !230)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !431, file: !189, line: 509, baseType: !434, size: 64, align: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !141, file: !145, line: 41, baseType: !390, size: 64, align: 64, offset: 1344)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !141, file: !145, line: 42, baseType: !96, size: 32, align: 32, offset: 1408)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !141, file: !145, line: 44, baseType: !306, size: 64, align: 64, offset: 1472)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !141, file: !145, line: 45, baseType: !306, size: 64, align: 64, offset: 1536)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !141, file: !145, line: 53, baseType: !441, size: 64, align: 64, offset: 1600)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !444, !532, !96}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !109, line: 107, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !447, line: 30, size: 2240, align: 64, elements: !448)
!447 = !DIFile(filename: "../../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!448 = !{!449, !450, !451, !452, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !528, !534, !538, !542, !547, !640, !647, !651}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !446, file: !145, line: 3, baseType: !96, size: 32, align: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !446, file: !145, line: 4, baseType: !96, size: 32, align: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !446, file: !145, line: 6, baseType: !96, size: 32, align: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !446, file: !145, line: 8, baseType: !453, size: 64, align: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !109, line: 113, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !447, line: 25, size: 1920, align: 64, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !455, file: !154, line: 3, baseType: !96, size: 32, align: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !455, file: !154, line: 4, baseType: !96, size: 32, align: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !455, file: !154, line: 6, baseType: !96, size: 32, align: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !455, file: !154, line: 9, baseType: !99, size: 64, align: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !455, file: !154, line: 10, baseType: !96, size: 32, align: 32, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !455, file: !154, line: 11, baseType: !99, size: 64, align: 64, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !455, file: !154, line: 11, baseType: !99, size: 64, align: 64, offset: 320)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !455, file: !154, line: 11, baseType: !99, size: 64, align: 64, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !455, file: !154, line: 13, baseType: !163, size: 16, align: 16, offset: 448)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !455, file: !154, line: 14, baseType: !99, size: 64, align: 64, offset: 512)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !455, file: !154, line: 15, baseType: !99, size: 64, align: 64, offset: 576)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !455, file: !154, line: 16, baseType: !96, size: 32, align: 32, offset: 640)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !455, file: !154, line: 17, baseType: !99, size: 64, align: 64, offset: 704)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !455, file: !154, line: 19, baseType: !107, size: 64, align: 64, offset: 768)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !455, file: !154, line: 19, baseType: !107, size: 64, align: 64, offset: 832)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !455, file: !154, line: 21, baseType: !99, size: 64, align: 64, offset: 896)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !455, file: !154, line: 22, baseType: !99, size: 64, align: 64, offset: 960)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !455, file: !154, line: 23, baseType: !99, size: 64, align: 64, offset: 1024)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !455, file: !154, line: 24, baseType: !99, size: 64, align: 64, offset: 1088)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !455, file: !154, line: 26, baseType: !99, size: 64, align: 64, offset: 1152)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !455, file: !154, line: 27, baseType: !99, size: 64, align: 64, offset: 1216)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !455, file: !154, line: 28, baseType: !99, size: 64, align: 64, offset: 1280)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !455, file: !154, line: 29, baseType: !99, size: 64, align: 64, offset: 1344)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !455, file: !154, line: 30, baseType: !99, size: 64, align: 64, offset: 1408)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !455, file: !154, line: 31, baseType: !99, size: 64, align: 64, offset: 1472)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !455, file: !154, line: 32, baseType: !99, size: 64, align: 64, offset: 1536)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !455, file: !154, line: 33, baseType: !99, size: 64, align: 64, offset: 1600)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !455, file: !154, line: 35, baseType: !183, size: 64, align: 64, offset: 1664)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !455, file: !154, line: 38, baseType: !216, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !455, file: !154, line: 39, baseType: !216, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !455, file: !154, line: 40, baseType: !216, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !455, file: !154, line: 41, baseType: !216, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !455, file: !154, line: 42, baseType: !216, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !455, file: !154, line: 43, baseType: !216, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !455, file: !154, line: 44, baseType: !216, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !455, file: !154, line: 45, baseType: !216, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !455, file: !154, line: 46, baseType: !99, size: 64, align: 64, offset: 1792)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !455, file: !154, line: 47, baseType: !99, size: 64, align: 64, offset: 1856)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !446, file: !145, line: 9, baseType: !390, size: 64, align: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !446, file: !145, line: 10, baseType: !390, size: 64, align: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !446, file: !145, line: 12, baseType: !99, size: 64, align: 64, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !446, file: !145, line: 13, baseType: !99, size: 64, align: 64, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !446, file: !145, line: 15, baseType: !216, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !446, file: !145, line: 16, baseType: !216, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !446, file: !145, line: 17, baseType: !216, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !446, file: !145, line: 18, baseType: !216, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !446, file: !145, line: 19, baseType: !216, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !446, file: !145, line: 21, baseType: !403, size: 64, align: 64, offset: 512)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !446, file: !145, line: 22, baseType: !96, size: 32, align: 32, offset: 576)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !446, file: !145, line: 25, baseType: !408, size: 128, align: 64, offset: 640)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !446, file: !145, line: 26, baseType: !96, size: 32, align: 32, offset: 768)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !446, file: !145, line: 27, baseType: !96, size: 32, align: 32, offset: 800)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !446, file: !145, line: 29, baseType: !414, size: 64, align: 64, offset: 832)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !446, file: !145, line: 30, baseType: !418, size: 64, align: 64, offset: 896)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !446, file: !145, line: 32, baseType: !99, size: 64, align: 64, offset: 960)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !446, file: !145, line: 33, baseType: !99, size: 64, align: 64, offset: 1024)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !446, file: !145, line: 34, baseType: !99, size: 64, align: 64, offset: 1088)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !446, file: !145, line: 35, baseType: !216, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !446, file: !145, line: 36, baseType: !216, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !446, file: !145, line: 37, baseType: !216, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !446, file: !145, line: 38, baseType: !216, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !446, file: !145, line: 40, baseType: !430, size: 128, align: 64, offset: 1216)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !446, file: !145, line: 41, baseType: !390, size: 64, align: 64, offset: 1344)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !446, file: !145, line: 42, baseType: !96, size: 32, align: 32, offset: 1408)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !446, file: !145, line: 44, baseType: !306, size: 64, align: 64, offset: 1472)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !446, file: !145, line: 45, baseType: !306, size: 64, align: 64, offset: 1536)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !446, file: !145, line: 53, baseType: !441, size: 64, align: 64, offset: 1600)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !446, file: !145, line: 55, baseType: !525, size: 64, align: 64, offset: 1664)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!96, !444, !100}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !446, file: !145, line: 57, baseType: !529, size: 64, align: 64, offset: 1728)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!96, !444, !532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !446, file: !145, line: 60, baseType: !535, size: 64, align: 64, offset: 1792)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!532, !444}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !446, file: !145, line: 62, baseType: !539, size: 64, align: 64, offset: 1856)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !444, !532, !532, !96}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !446, file: !145, line: 65, baseType: !543, size: 64, align: 64, offset: 1920)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!546, !444, !532, !532}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !446, file: !145, line: 69, baseType: !548, size: 64, align: 64, offset: 1984)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64, align: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!551, !444, !532}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !109, line: 109, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !554, line: 15, size: 1408, align: 64, elements: !555)
!554 = !DIFile(filename: "../../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!555 = !{!556, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !591, !592, !594, !595, !596, !597, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !553, file: !557, line: 3, baseType: !96, size: 32, align: 32)
!557 = !DIFile(filename: "../../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!558 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !553, file: !557, line: 4, baseType: !96, size: 32, align: 32, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !553, file: !557, line: 5, baseType: !418, size: 64, align: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !553, file: !557, line: 7, baseType: !87, size: 64, align: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !553, file: !557, line: 8, baseType: !444, size: 64, align: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !553, file: !557, line: 9, baseType: !99, size: 64, align: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !553, file: !557, line: 10, baseType: !99, size: 64, align: 64, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !553, file: !557, line: 11, baseType: !390, size: 64, align: 64, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !553, file: !557, line: 12, baseType: !96, size: 32, align: 32, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !553, file: !557, line: 13, baseType: !99, size: 64, align: 64, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !553, file: !557, line: 15, baseType: !568, size: 64, align: 64, offset: 576)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64, align: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !109, line: 108, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !574, line: 5, size: 704, align: 64, elements: !575)
!574 = !DIFile(filename: "../../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !573, file: !557, line: 3, baseType: !96, size: 32, align: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !573, file: !557, line: 4, baseType: !96, size: 32, align: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !573, file: !557, line: 5, baseType: !418, size: 64, align: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !573, file: !557, line: 7, baseType: !87, size: 64, align: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !573, file: !557, line: 8, baseType: !444, size: 64, align: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !573, file: !557, line: 9, baseType: !99, size: 64, align: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !573, file: !557, line: 10, baseType: !99, size: 64, align: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !573, file: !557, line: 11, baseType: !390, size: 64, align: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !573, file: !557, line: 12, baseType: !96, size: 32, align: 32, offset: 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !573, file: !557, line: 13, baseType: !99, size: 64, align: 64, offset: 512)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !573, file: !557, line: 15, baseType: !568, size: 64, align: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !573, file: !557, line: 17, baseType: !588, size: 64, align: 64, offset: 640)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64, align: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!532, !571}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !553, file: !557, line: 17, baseType: !588, size: 64, align: 64, offset: 640)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !553, file: !593, line: 5, baseType: !99, size: 64, align: 64, offset: 704)
!593 = !DIFile(filename: "../../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!594 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !553, file: !593, line: 6, baseType: !99, size: 64, align: 64, offset: 768)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !553, file: !593, line: 7, baseType: !390, size: 64, align: 64, offset: 832)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !553, file: !593, line: 9, baseType: !418, size: 64, align: 64, offset: 896)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !553, file: !593, line: 10, baseType: !598, size: 64, align: 64, offset: 960)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !109, line: 111, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !601, line: 13, size: 576, align: 64, elements: !602)
!601 = !DIFile(filename: "../../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!602 = !{!603, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !621, !622}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !600, file: !604, line: 3, baseType: !96, size: 32, align: 32)
!604 = !DIFile(filename: "../../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!605 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !600, file: !604, line: 4, baseType: !96, size: 32, align: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !600, file: !604, line: 6, baseType: !390, size: 64, align: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !600, file: !604, line: 8, baseType: !99, size: 64, align: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !600, file: !604, line: 9, baseType: !99, size: 64, align: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !600, file: !604, line: 10, baseType: !99, size: 64, align: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !600, file: !604, line: 11, baseType: !96, size: 32, align: 32, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !600, file: !604, line: 14, baseType: !216, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !600, file: !604, line: 15, baseType: !216, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !600, file: !604, line: 18, baseType: !216, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !600, file: !604, line: 19, baseType: !216, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !600, file: !604, line: 20, baseType: !216, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !600, file: !604, line: 21, baseType: !216, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !600, file: !604, line: 22, baseType: !618, size: 64, align: 8, offset: 360)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 64, align: 8, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 8)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !600, file: !604, line: 26, baseType: !87, size: 64, align: 64, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !600, file: !604, line: 28, baseType: !598, size: 64, align: 64, offset: 512)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !553, file: !593, line: 12, baseType: !216, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !553, file: !593, line: 13, baseType: !99, size: 64, align: 64, offset: 1088)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !553, file: !593, line: 14, baseType: !96, size: 32, align: 32, offset: 1152)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !553, file: !593, line: 15, baseType: !99, size: 64, align: 64, offset: 1216)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !553, file: !593, line: 17, baseType: !216, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !553, file: !593, line: 18, baseType: !216, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !553, file: !593, line: 19, baseType: !216, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !553, file: !593, line: 20, baseType: !216, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !553, file: !593, line: 22, baseType: !216, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !553, file: !593, line: 23, baseType: !216, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !553, file: !593, line: 24, baseType: !216, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !553, file: !593, line: 25, baseType: !216, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !553, file: !593, line: 26, baseType: !216, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !553, file: !593, line: 31, baseType: !637, size: 64, align: 64, offset: 1344)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!99, !551}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !446, file: !145, line: 70, baseType: !641, size: 64, align: 64, offset: 2048)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!644, !444, !532}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !109, line: 110, baseType: !646)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !109, line: 110, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !446, file: !145, line: 71, baseType: !648, size: 64, align: 64, offset: 2112)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64, align: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!96, !532, !532}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !446, file: !145, line: 73, baseType: !648, size: 64, align: 64, offset: 2176)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !141, file: !145, line: 55, baseType: !525, size: 64, align: 64, offset: 1664)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !141, file: !145, line: 57, baseType: !529, size: 64, align: 64, offset: 1728)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !141, file: !145, line: 60, baseType: !535, size: 64, align: 64, offset: 1792)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !141, file: !145, line: 62, baseType: !539, size: 64, align: 64, offset: 1856)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !141, file: !145, line: 65, baseType: !543, size: 64, align: 64, offset: 1920)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !141, file: !145, line: 69, baseType: !548, size: 64, align: 64, offset: 1984)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !141, file: !145, line: 70, baseType: !641, size: 64, align: 64, offset: 2048)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !141, file: !145, line: 71, baseType: !648, size: 64, align: 64, offset: 2112)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !141, file: !145, line: 73, baseType: !648, size: 64, align: 64, offset: 2176)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !141, file: !142, line: 46, baseType: !306, size: 64, align: 64, offset: 2240)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !141, file: !142, line: 47, baseType: !306, size: 64, align: 64, offset: 2304)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !141, file: !142, line: 48, baseType: !664, size: 64, align: 64, offset: 2368)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !90, line: 8, baseType: !666)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !90, line: 8, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !141, file: !142, line: 49, baseType: !306, size: 64, align: 64, offset: 2432)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !141, file: !142, line: 51, baseType: !99, size: 64, align: 64, offset: 2496)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !141, file: !142, line: 53, baseType: !99, size: 64, align: 64, offset: 2560)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !141, file: !142, line: 54, baseType: !99, size: 64, align: 64, offset: 2624)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !141, file: !142, line: 55, baseType: !99, size: 64, align: 64, offset: 2688)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !141, file: !142, line: 56, baseType: !99, size: 64, align: 64, offset: 2752)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !141, file: !142, line: 57, baseType: !96, size: 32, align: 32, offset: 2816)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !141, file: !142, line: 59, baseType: !216, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !141, file: !142, line: 60, baseType: !216, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !141, file: !142, line: 62, baseType: !216, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !141, file: !142, line: 63, baseType: !216, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !141, file: !142, line: 64, baseType: !216, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !141, file: !142, line: 65, baseType: !216, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !141, file: !142, line: 66, baseType: !216, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !141, file: !142, line: 67, baseType: !216, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !141, file: !142, line: 68, baseType: !216, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !141, file: !142, line: 69, baseType: !216, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !141, file: !142, line: 70, baseType: !216, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !141, file: !142, line: 71, baseType: !216, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !141, file: !142, line: 72, baseType: !216, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !141, file: !142, line: 74, baseType: !96, size: 32, align: 32, offset: 2880)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !141, file: !142, line: 75, baseType: !96, size: 32, align: 32, offset: 2912)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !141, file: !142, line: 76, baseType: !96, size: 32, align: 32, offset: 2944)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !141, file: !142, line: 77, baseType: !96, size: 32, align: 32, offset: 2976)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !141, file: !142, line: 79, baseType: !418, size: 64, align: 64, offset: 3008)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !141, file: !142, line: 80, baseType: !306, size: 64, align: 64, offset: 3072)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !141, file: !142, line: 81, baseType: !306, size: 64, align: 64, offset: 3136)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !141, file: !142, line: 83, baseType: !345, size: 64, align: 64, offset: 3200)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !141, file: !142, line: 84, baseType: !297, size: 32, align: 32, offset: 3264)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !141, file: !142, line: 87, baseType: !96, size: 32, align: 32, offset: 3296)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !141, file: !142, line: 91, baseType: !306, size: 64, align: 64, offset: 3328)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !141, file: !142, line: 92, baseType: !430, size: 128, align: 64, offset: 3392)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !141, file: !142, line: 93, baseType: !430, size: 128, align: 64, offset: 3520)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !141, file: !142, line: 95, baseType: !96, size: 32, align: 32, offset: 3648)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !141, file: !142, line: 96, baseType: !96, size: 32, align: 32, offset: 3680)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !141, file: !142, line: 97, baseType: !96, size: 32, align: 32, offset: 3712)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !141, file: !142, line: 100, baseType: !306, size: 64, align: 64, offset: 3776)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !141, file: !142, line: 103, baseType: !306, size: 64, align: 64, offset: 3840)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !141, file: !142, line: 106, baseType: !306, size: 64, align: 64, offset: 3904)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !141, file: !142, line: 108, baseType: !418, size: 64, align: 64, offset: 3968)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !141, file: !142, line: 109, baseType: !306, size: 64, align: 64, offset: 4032)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !141, file: !142, line: 111, baseType: !306, size: 64, align: 64, offset: 4096)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !141, file: !142, line: 114, baseType: !87, size: 64, align: 64, offset: 4160)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !141, file: !142, line: 116, baseType: !418, size: 64, align: 64, offset: 4224)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !141, file: !142, line: 117, baseType: !712, size: 32768, align: 64, offset: 4288)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 32768, align: 64, elements: !762)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !714, line: 10, size: 128, align: 64, elements: !715)
!714 = !DIFile(filename: "../../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!715 = !{!716, !761}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !713, file: !714, line: 11, baseType: !717, size: 64, align: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !714, line: 7, baseType: !719)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !721, !532, !100, !100, !99, !345}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !90, line: 7, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !724, line: 15, size: 1600, align: 64, elements: !725)
!724 = !DIFile(filename: "../../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !723, file: !557, line: 3, baseType: !96, size: 32, align: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !723, file: !557, line: 4, baseType: !96, size: 32, align: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !723, file: !557, line: 5, baseType: !418, size: 64, align: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !723, file: !557, line: 7, baseType: !87, size: 64, align: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !723, file: !557, line: 8, baseType: !139, size: 64, align: 64, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !723, file: !557, line: 9, baseType: !99, size: 64, align: 64, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !723, file: !557, line: 10, baseType: !99, size: 64, align: 64, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !723, file: !557, line: 11, baseType: !390, size: 64, align: 64, offset: 384)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !723, file: !557, line: 12, baseType: !96, size: 32, align: 32, offset: 448)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !723, file: !557, line: 13, baseType: !99, size: 64, align: 64, offset: 512)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !723, file: !557, line: 15, baseType: !568, size: 64, align: 64, offset: 576)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !723, file: !557, line: 17, baseType: !588, size: 64, align: 64, offset: 640)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !723, file: !593, line: 5, baseType: !99, size: 64, align: 64, offset: 704)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !723, file: !593, line: 6, baseType: !99, size: 64, align: 64, offset: 768)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !723, file: !593, line: 7, baseType: !390, size: 64, align: 64, offset: 832)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !723, file: !593, line: 9, baseType: !418, size: 64, align: 64, offset: 896)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !723, file: !593, line: 10, baseType: !598, size: 64, align: 64, offset: 960)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !723, file: !593, line: 12, baseType: !216, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !723, file: !593, line: 13, baseType: !99, size: 64, align: 64, offset: 1088)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !723, file: !593, line: 14, baseType: !96, size: 32, align: 32, offset: 1152)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !723, file: !593, line: 15, baseType: !99, size: 64, align: 64, offset: 1216)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !723, file: !593, line: 17, baseType: !216, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !723, file: !593, line: 18, baseType: !216, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !723, file: !593, line: 19, baseType: !216, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !723, file: !593, line: 20, baseType: !216, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !723, file: !593, line: 22, baseType: !216, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !723, file: !593, line: 23, baseType: !216, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !723, file: !593, line: 24, baseType: !216, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !723, file: !593, line: 25, baseType: !216, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !723, file: !593, line: 26, baseType: !216, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !723, file: !593, line: 31, baseType: !637, size: 64, align: 64, offset: 1344)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !723, file: !724, line: 18, baseType: !306, size: 64, align: 64, offset: 1408)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !723, file: !724, line: 20, baseType: !390, size: 64, align: 64, offset: 1472)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !723, file: !724, line: 21, baseType: !96, size: 32, align: 32, offset: 1536)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !723, file: !724, line: 22, baseType: !96, size: 32, align: 32, offset: 1568)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !713, file: !714, line: 12, baseType: !100, size: 8, align: 8, offset: 64)
!762 = !{!763}
!763 = !DISubrange(count: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !141, file: !142, line: 118, baseType: !765, size: 2048, align: 8, offset: 37056)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 2048, align: 8, elements: !762)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !141, file: !142, line: 120, baseType: !648, size: 64, align: 64, offset: 39104)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !189, line: 88, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64, align: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !245, !245}
!771 = !{i32 2, !"Dwarf Version", i32 4}
!772 = !{i32 2, !"Debug Info Version", i32 3}
!773 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!774 = distinct !DISubprogram(name: "fe_irc_notifylist_init", scope: !775, file: !775, line: 225, type: !294, isLocal: false, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !776)
!775 = !DIFile(filename: "fe-notifylist.c", directory: "/home/lichi/Desktop/irssi/task1")
!776 = !{}
!777 = !DILocation(line: 227, column: 2, scope: !774)
!778 = !DILocation(line: 229, column: 2, scope: !774)
!779 = !DILocation(line: 230, column: 2, scope: !774)
!780 = !DILocation(line: 231, column: 2, scope: !774)
!781 = !DILocation(line: 232, column: 2, scope: !774)
!782 = !DILocation(line: 234, column: 2, scope: !774)
!783 = !DILocation(line: 236, column: 2, scope: !774)
!784 = !DILocation(line: 237, column: 2, scope: !774)
!785 = !DILocation(line: 238, column: 1, scope: !774)
!786 = distinct !DISubprogram(name: "cmd_notify", scope: !775, file: !775, line: 173, type: !787, isLocal: true, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !776)
!787 = !DISubroutineType(types: !788)
!788 = !{null, !532}
!789 = !DILocalVariable(name: "data", arg: 1, scope: !786, file: !775, line: 173, type: !532)
!790 = !DIExpression()
!791 = !DILocation(line: 173, column: 36, scope: !786)
!792 = !DILocation(line: 175, column: 7, scope: !793)
!793 = distinct !DILexicalBlock(scope: !786, file: !775, line: 175, column: 6)
!794 = !DILocation(line: 175, column: 6, scope: !793)
!795 = !DILocation(line: 175, column: 12, scope: !793)
!796 = !DILocation(line: 175, column: 6, scope: !786)
!797 = !DILocation(line: 176, column: 3, scope: !798)
!798 = distinct !DILexicalBlock(scope: !793, file: !775, line: 175, column: 21)
!799 = !DILocation(line: 177, column: 3, scope: !798)
!800 = !DILocation(line: 178, column: 2, scope: !798)
!801 = !DILocation(line: 180, column: 26, scope: !802)
!802 = distinct !DILexicalBlock(scope: !786, file: !775, line: 180, column: 6)
!803 = !DILocation(line: 180, column: 6, scope: !802)
!804 = !DILocation(line: 180, column: 44, scope: !802)
!805 = !DILocation(line: 180, column: 6, scope: !786)
!806 = !DILocation(line: 181, column: 3, scope: !807)
!807 = distinct !DILexicalBlock(scope: !802, file: !775, line: 180, column: 50)
!808 = !DILocation(line: 182, column: 3, scope: !807)
!809 = !DILocation(line: 183, column: 2, scope: !807)
!810 = !DILocation(line: 184, column: 1, scope: !786)
!811 = distinct !DISubprogram(name: "notifylist_joined", scope: !775, file: !775, line: 186, type: !812, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !776)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !139, !532, !532, !532, !532, !532}
!814 = !DILocalVariable(name: "server", arg: 1, scope: !811, file: !775, line: 186, type: !139)
!815 = !DILocation(line: 186, column: 47, scope: !811)
!816 = !DILocalVariable(name: "nick", arg: 2, scope: !811, file: !775, line: 186, type: !532)
!817 = !DILocation(line: 186, column: 67, scope: !811)
!818 = !DILocalVariable(name: "username", arg: 3, scope: !811, file: !775, line: 187, type: !532)
!819 = !DILocation(line: 187, column: 22, scope: !811)
!820 = !DILocalVariable(name: "host", arg: 4, scope: !811, file: !775, line: 187, type: !532)
!821 = !DILocation(line: 187, column: 44, scope: !811)
!822 = !DILocalVariable(name: "realname", arg: 5, scope: !811, file: !775, line: 188, type: !532)
!823 = !DILocation(line: 188, column: 22, scope: !811)
!824 = !DILocalVariable(name: "awaymsg", arg: 6, scope: !811, file: !775, line: 188, type: !532)
!825 = !DILocation(line: 188, column: 44, scope: !811)
!826 = !DILocation(line: 190, column: 2, scope: !811)
!827 = distinct !{!827, !826}
!828 = !DILocation(line: 190, column: 10, scope: !829)
!829 = !DILexicalBlockFile(scope: !830, file: !775, discriminator: 1)
!830 = distinct !DILexicalBlock(scope: !831, file: !775, line: 190, column: 10)
!831 = distinct !DILexicalBlock(scope: !811, file: !775, line: 190, column: 4)
!832 = !DILocation(line: 190, column: 15, scope: !829)
!833 = !DILocation(line: 190, column: 5, scope: !834)
!834 = !DILexicalBlockFile(scope: !835, file: !775, discriminator: 2)
!835 = distinct !DILexicalBlock(scope: !830, file: !775, line: 190, column: 3)
!836 = !DILocation(line: 190, column: 14, scope: !837)
!837 = !DILexicalBlockFile(scope: !838, file: !775, discriminator: 3)
!838 = distinct !DILexicalBlock(scope: !830, file: !775, line: 190, column: 12)
!839 = !DILocation(line: 190, column: 99, scope: !837)
!840 = !DILocation(line: 190, column: 110, scope: !841)
!841 = !DILexicalBlockFile(scope: !831, file: !775, discriminator: 4)
!842 = !DILocation(line: 192, column: 49, scope: !811)
!843 = !DILocation(line: 192, column: 57, scope: !811)
!844 = !DILocation(line: 192, column: 106, scope: !811)
!845 = !DILocation(line: 192, column: 112, scope: !811)
!846 = !DILocation(line: 192, column: 122, scope: !811)
!847 = !DILocation(line: 192, column: 128, scope: !811)
!848 = !DILocation(line: 192, column: 138, scope: !811)
!849 = !DILocation(line: 192, column: 146, scope: !811)
!850 = !DILocation(line: 192, column: 155, scope: !811)
!851 = !DILocation(line: 192, column: 163, scope: !811)
!852 = !DILocation(line: 192, column: 138, scope: !853)
!853 = !DILexicalBlockFile(scope: !811, file: !775, discriminator: 1)
!854 = !DILocation(line: 192, column: 11, scope: !855)
!855 = !DILexicalBlockFile(scope: !811, file: !775, discriminator: 2)
!856 = !DILocation(line: 192, column: 19, scope: !855)
!857 = !DILocation(line: 192, column: 28, scope: !855)
!858 = !DILocation(line: 192, column: 138, scope: !855)
!859 = !DILocation(line: 192, column: 138, scope: !860)
!860 = !DILexicalBlockFile(scope: !811, file: !775, discriminator: 3)
!861 = !DILocation(line: 192, column: 2, scope: !860)
!862 = !DILocation(line: 195, column: 1, scope: !811)
!863 = !DILocation(line: 195, column: 1, scope: !853)
!864 = distinct !DISubprogram(name: "notifylist_left", scope: !775, file: !775, line: 197, type: !812, isLocal: true, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !776)
!865 = !DILocalVariable(name: "server", arg: 1, scope: !864, file: !775, line: 197, type: !139)
!866 = !DILocation(line: 197, column: 45, scope: !864)
!867 = !DILocalVariable(name: "nick", arg: 2, scope: !864, file: !775, line: 197, type: !532)
!868 = !DILocation(line: 197, column: 65, scope: !864)
!869 = !DILocalVariable(name: "username", arg: 3, scope: !864, file: !775, line: 198, type: !532)
!870 = !DILocation(line: 198, column: 20, scope: !864)
!871 = !DILocalVariable(name: "host", arg: 4, scope: !864, file: !775, line: 198, type: !532)
!872 = !DILocation(line: 198, column: 42, scope: !864)
!873 = !DILocalVariable(name: "realname", arg: 5, scope: !864, file: !775, line: 199, type: !532)
!874 = !DILocation(line: 199, column: 20, scope: !864)
!875 = !DILocalVariable(name: "awaymsg", arg: 6, scope: !864, file: !775, line: 199, type: !532)
!876 = !DILocation(line: 199, column: 42, scope: !864)
!877 = !DILocation(line: 201, column: 2, scope: !864)
!878 = distinct !{!878, !877}
!879 = !DILocation(line: 201, column: 10, scope: !880)
!880 = !DILexicalBlockFile(scope: !881, file: !775, discriminator: 1)
!881 = distinct !DILexicalBlock(scope: !882, file: !775, line: 201, column: 10)
!882 = distinct !DILexicalBlock(scope: !864, file: !775, line: 201, column: 4)
!883 = !DILocation(line: 201, column: 15, scope: !880)
!884 = !DILocation(line: 201, column: 5, scope: !885)
!885 = !DILexicalBlockFile(scope: !886, file: !775, discriminator: 2)
!886 = distinct !DILexicalBlock(scope: !881, file: !775, line: 201, column: 3)
!887 = !DILocation(line: 201, column: 14, scope: !888)
!888 = !DILexicalBlockFile(scope: !889, file: !775, discriminator: 3)
!889 = distinct !DILexicalBlock(scope: !881, file: !775, line: 201, column: 12)
!890 = !DILocation(line: 201, column: 99, scope: !888)
