; ModuleID = './line25-chat-commands.o.i'
source_filename = "./line25-chat-commands.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }
%struct._SERVER_CONNECT_REC = type { i32, i32, i32, i8*, i32, i8*, i8*, i8*, i16, i8*, i8*, i32, i8*, %struct._IPADDR*, %struct._IPADDR*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._GIOChannel*, i8, i8*, i8* }
%struct._IPADDR = type { i16, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }

!1 = !DIFile(filename: "line25-chat-commands.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 25, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!38 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!39 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!40 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!41 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!42 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!43 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!44 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!45 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!46 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!47 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!48 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!49 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!50 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!51 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!52 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!53 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!54 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!55 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!56 = !{!57, !64, !65, !69, !71, !72, !74, !75, !172}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !58, line: 9, baseType: !59)
!58 = !DIFile(filename: "signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62, !62, !62, !62, !62, !62}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !67, line: 46, baseType: !68)
!67 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!68 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !67, line: 77, baseType: !64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !67, line: 48, baseType: !73)
!73 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !77, line: 109, baseType: !78)
!77 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !79, line: 15, size: 1408, align: 64, elements: !80)
!79 = !DIFile(filename: "channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!80 = !{!81, !84, !85, !90, !91, !491, !492, !493, !494, !495, !496, !497, !498, !500, !501, !502, !503, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, file: !82, line: 3, baseType: !83, size: 32, align: 32)
!82 = !DIFile(filename: "window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!83 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !78, file: !82, line: 4, baseType: !83, size: 32, align: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !78, file: !82, line: 5, baseType: !86, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !88, line: 37, baseType: !89)
!88 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !88, line: 37, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !78, file: !82, line: 7, baseType: !64, size: 64, align: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !78, file: !82, line: 8, baseType: !92, size: 64, align: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !77, line: 107, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !95, line: 30, size: 2240, align: 64, elements: !96)
!95 = !DIFile(filename: "servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!96 = !{!97, !99, !100, !101, !355, !360, !361, !362, !363, !364, !365, !366, !367, !368, !372, !373, !377, !378, !379, !389, !390, !391, !392, !393, !394, !395, !396, !397, !403, !404, !405, !406, !407, !411, !415, !419, !423, !427, !432, !436, !486, !490}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !98, line: 3, baseType: !83, size: 32, align: 32)
!98 = !DIFile(filename: "server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!99 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !94, file: !98, line: 4, baseType: !83, size: 32, align: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !94, file: !98, line: 6, baseType: !83, size: 32, align: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !94, file: !98, line: 8, baseType: !102, size: 64, align: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !77, line: 113, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !95, line: 25, size: 1920, align: 64, elements: !105)
!105 = !{!106, !108, !109, !110, !111, !112, !113, !114, !115, !117, !118, !119, !120, !121, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !107, line: 3, baseType: !83, size: 32, align: 32)
!107 = !DIFile(filename: "server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!108 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !104, file: !107, line: 4, baseType: !83, size: 32, align: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !104, file: !107, line: 6, baseType: !83, size: 32, align: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !104, file: !107, line: 9, baseType: !74, size: 64, align: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !104, file: !107, line: 10, baseType: !83, size: 32, align: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !104, file: !107, line: 11, baseType: !74, size: 64, align: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !104, file: !107, line: 11, baseType: !74, size: 64, align: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !104, file: !107, line: 11, baseType: !74, size: 64, align: 64, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !104, file: !107, line: 13, baseType: !116, size: 16, align: 16, offset: 448)
!116 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !104, file: !107, line: 14, baseType: !74, size: 64, align: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !104, file: !107, line: 15, baseType: !74, size: 64, align: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !104, file: !107, line: 16, baseType: !83, size: 32, align: 32, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !104, file: !107, line: 17, baseType: !74, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !104, file: !107, line: 19, baseType: !122, size: 64, align: 64, offset: 768)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !77, line: 99, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !125, line: 22, size: 160, align: 32, elements: !126)
!125 = !DIFile(filename: "network.h", directory: "/home/lichi/Desktop/irssi/task1")
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !124, file: !125, line: 23, baseType: !116, size: 16, align: 16)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !124, file: !125, line: 24, baseType: !129, size: 128, align: 32, offset: 32)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !130, line: 211, size: 128, align: 32, elements: !131)
!130 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !129, file: !130, line: 220, baseType: !133, size: 128, align: 32)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !130, line: 213, size: 128, align: 32, elements: !134)
!134 = !{!135, !142, !147}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !133, file: !130, line: 215, baseType: !136, size: 128, align: 8)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 128, align: 8, elements: !140)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !138, line: 48, baseType: !139)
!138 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!139 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!140 = !{!141}
!141 = !DISubrange(count: 16)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !133, file: !130, line: 217, baseType: !143, size: 128, align: 16)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 128, align: 16, elements: !145)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !138, line: 49, baseType: !116)
!145 = !{!146}
!146 = !DISubrange(count: 8)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !133, file: !130, line: 218, baseType: !148, size: 128, align: 32)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 128, align: 32, elements: !151)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !138, line: 51, baseType: !150)
!150 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!151 = !{!152}
!152 = !DISubrange(count: 4)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !104, file: !107, line: 19, baseType: !122, size: 64, align: 64, offset: 832)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !104, file: !107, line: 21, baseType: !74, size: 64, align: 64, offset: 896)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !104, file: !107, line: 22, baseType: !74, size: 64, align: 64, offset: 960)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !104, file: !107, line: 23, baseType: !74, size: 64, align: 64, offset: 1024)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !104, file: !107, line: 24, baseType: !74, size: 64, align: 64, offset: 1088)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !104, file: !107, line: 26, baseType: !74, size: 64, align: 64, offset: 1152)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !104, file: !107, line: 27, baseType: !74, size: 64, align: 64, offset: 1216)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !104, file: !107, line: 28, baseType: !74, size: 64, align: 64, offset: 1280)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !104, file: !107, line: 29, baseType: !74, size: 64, align: 64, offset: 1344)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !104, file: !107, line: 30, baseType: !74, size: 64, align: 64, offset: 1408)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !104, file: !107, line: 31, baseType: !74, size: 64, align: 64, offset: 1472)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !104, file: !107, line: 32, baseType: !74, size: 64, align: 64, offset: 1536)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !104, file: !107, line: 33, baseType: !74, size: 64, align: 64, offset: 1600)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !104, file: !107, line: 35, baseType: !167, size: 64, align: 64, offset: 1664)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !170)
!170 = !{!171, !173, !312, !313, !318, !319, !320, !321, !322, !331, !332, !333, !337, !338, !339, !340, !341, !342, !343, !344}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !169, file: !4, line: 100, baseType: !172, size: 32, align: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !67, line: 49, baseType: !83)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !169, file: !4, line: 101, baseType: !174, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !177)
!177 = !{!178, !199, !205, !211, !215, !299, !303, !308}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !176, file: !4, line: 133, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!182, !167, !65, !183, !186, !187}
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !184, line: 66, baseType: !185)
!184 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!185 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !190, line: 42, baseType: !191)
!190 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !190, line: 44, size: 128, align: 64, elements: !192)
!192 = !{!193, !197, !198}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !191, file: !190, line: 46, baseType: !194, size: 32, align: 32)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !195, line: 36, baseType: !196)
!195 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !184, line: 45, baseType: !150)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !191, file: !190, line: 47, baseType: !172, size: 32, align: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !191, file: !190, line: 48, baseType: !65, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !176, file: !4, line: 138, baseType: !200, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!182, !167, !203, !183, !186, !187}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !176, file: !4, line: 143, baseType: !206, size: 64, align: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!182, !167, !209, !210, !187}
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !184, line: 51, baseType: !73)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !176, file: !4, line: 147, baseType: !212, size: 64, align: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!182, !167, !187}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !176, file: !4, line: 149, baseType: !216, size: 64, align: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!219, !167, !298}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !222)
!222 = !{!223, !224, !245, !274, !276, !280, !281, !282, !283, !291, !292, !293, !294}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !221, file: !16, line: 174, baseType: !71, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !221, file: !16, line: 175, baseType: !225, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !228)
!228 = !{!229, !233, !234}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !227, file: !16, line: 198, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !71}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !227, file: !16, line: 199, baseType: !230, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !227, file: !16, line: 200, baseType: !235, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !71, !219, !238, !244}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !71}
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !67, line: 50, baseType: !172)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !221, file: !16, line: 177, baseType: !246, size: 64, align: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !250)
!250 = !{!251, !256, !260, !264, !268, !269}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !249, file: !16, line: 216, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!243, !219, !255}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !249, file: !16, line: 218, baseType: !257, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!243, !219}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !249, file: !16, line: 219, baseType: !261, size: 64, align: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!243, !219, !239, !71}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !249, file: !16, line: 222, baseType: !265, size: 64, align: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !219}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !249, file: !16, line: 226, baseType: !239, size: 64, align: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !249, file: !16, line: 227, baseType: !270, size: 64, align: 64, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{null}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !221, file: !16, line: 178, baseType: !275, size: 32, align: 32, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !67, line: 55, baseType: !150)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !221, file: !16, line: 180, baseType: !277, size: 64, align: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !279)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !221, file: !16, line: 182, baseType: !172, size: 32, align: 32, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !221, file: !16, line: 183, baseType: !275, size: 32, align: 32, offset: 352)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !221, file: !16, line: 184, baseType: !275, size: 32, align: 32, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !221, file: !16, line: 186, baseType: !284, size: 64, align: 64, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !286, line: 37, baseType: !287)
!286 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !286, line: 39, size: 128, align: 64, elements: !288)
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !286, line: 41, baseType: !71, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !286, line: 42, baseType: !284, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !221, file: !16, line: 188, baseType: !219, size: 64, align: 64, offset: 512)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !221, file: !16, line: 189, baseType: !219, size: 64, align: 64, offset: 576)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !221, file: !16, line: 191, baseType: !74, size: 64, align: 64, offset: 640)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !221, file: !16, line: 193, baseType: !295, size: 64, align: 64, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !297)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !176, file: !4, line: 151, baseType: !300, size: 64, align: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !167}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !176, file: !4, line: 152, baseType: !304, size: 64, align: 64, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!182, !167, !307, !187}
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !176, file: !4, line: 155, baseType: !309, size: 64, align: 64, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!307, !167}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !169, file: !4, line: 103, baseType: !65, size: 64, align: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !169, file: !4, line: 104, baseType: !314, size: 64, align: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !315, line: 77, baseType: !316)
!315 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !315, line: 77, flags: DIFlagFwdDecl)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !169, file: !4, line: 105, baseType: !314, size: 64, align: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !169, file: !4, line: 106, baseType: !65, size: 64, align: 64, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !169, file: !4, line: 107, baseType: !275, size: 32, align: 32, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !169, file: !4, line: 109, baseType: !183, size: 64, align: 64, offset: 448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !169, file: !4, line: 110, baseType: !323, size: 64, align: 64, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !325, line: 39, baseType: !326)
!325 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !325, line: 41, size: 192, align: 64, elements: !327)
!327 = !{!328, !329, !330}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !326, file: !325, line: 43, baseType: !65, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !326, file: !325, line: 44, baseType: !183, size: 64, align: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !326, file: !325, line: 45, baseType: !183, size: 64, align: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !169, file: !4, line: 111, baseType: !323, size: 64, align: 64, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !169, file: !4, line: 112, baseType: !323, size: 64, align: 64, offset: 640)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !169, file: !4, line: 113, baseType: !334, size: 48, align: 8, offset: 704)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 48, align: 8, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 6)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !169, file: !4, line: 117, baseType: !275, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !169, file: !4, line: 118, baseType: !275, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !169, file: !4, line: 119, baseType: !275, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !169, file: !4, line: 120, baseType: !275, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !169, file: !4, line: 121, baseType: !275, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !169, file: !4, line: 122, baseType: !275, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !169, file: !4, line: 124, baseType: !71, size: 64, align: 64, offset: 768)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !169, file: !4, line: 125, baseType: !71, size: 64, align: 64, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !104, file: !107, line: 38, baseType: !150, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !104, file: !107, line: 39, baseType: !150, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !104, file: !107, line: 40, baseType: !150, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !104, file: !107, line: 41, baseType: !150, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !104, file: !107, line: 42, baseType: !150, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !104, file: !107, line: 43, baseType: !150, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !104, file: !107, line: 44, baseType: !150, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !104, file: !107, line: 45, baseType: !150, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !104, file: !107, line: 46, baseType: !74, size: 64, align: 64, offset: 1792)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !104, file: !107, line: 47, baseType: !74, size: 64, align: 64, offset: 1856)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !94, file: !98, line: 9, baseType: !356, size: 64, align: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !357, line: 75, baseType: !358)
!357 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !359, line: 139, baseType: !73)
!359 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!360 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !94, file: !98, line: 10, baseType: !356, size: 64, align: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !94, file: !98, line: 12, baseType: !74, size: 64, align: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !94, file: !98, line: 13, baseType: !74, size: 64, align: 64, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !94, file: !98, line: 15, baseType: !150, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !94, file: !98, line: 16, baseType: !150, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !94, file: !98, line: 17, baseType: !150, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !94, file: !98, line: 18, baseType: !150, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !94, file: !98, line: 19, baseType: !150, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !94, file: !98, line: 21, baseType: !369, size: 64, align: 64, offset: 512)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !77, line: 102, baseType: !371)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !77, line: 102, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !94, file: !98, line: 22, baseType: !83, size: 32, align: 32, offset: 576)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !94, file: !98, line: 25, baseType: !374, size: 128, align: 64, offset: 640)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 128, align: 64, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 2)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !94, file: !98, line: 26, baseType: !83, size: 32, align: 32, offset: 768)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !94, file: !98, line: 27, baseType: !83, size: 32, align: 32, offset: 800)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !94, file: !98, line: 29, baseType: !380, size: 64, align: 64, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !77, line: 103, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !383, line: 4, size: 192, align: 64, elements: !384)
!383 = !DIFile(filename: "rawlog.h", directory: "/home/lichi/Desktop/irssi/task1")
!384 = !{!385, !386, !387, !388}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !382, file: !383, line: 5, baseType: !83, size: 32, align: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !382, file: !383, line: 6, baseType: !83, size: 32, align: 32, offset: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "nlines", scope: !382, file: !383, line: 8, baseType: !83, size: 32, align: 32, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !382, file: !383, line: 9, baseType: !284, size: 64, align: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !94, file: !98, line: 30, baseType: !86, size: 64, align: 64, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !94, file: !98, line: 32, baseType: !74, size: 64, align: 64, offset: 960)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !94, file: !98, line: 33, baseType: !74, size: 64, align: 64, offset: 1024)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !94, file: !98, line: 34, baseType: !74, size: 64, align: 64, offset: 1088)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !94, file: !98, line: 35, baseType: !150, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !94, file: !98, line: 36, baseType: !150, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !94, file: !98, line: 37, baseType: !150, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !94, file: !98, line: 38, baseType: !150, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !94, file: !98, line: 40, baseType: !398, size: 128, align: 64, offset: 1216)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !67, line: 504, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !67, line: 506, size: 128, align: 64, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !399, file: !67, line: 508, baseType: !72, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !399, file: !67, line: 509, baseType: !72, size: 64, align: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !94, file: !98, line: 41, baseType: !356, size: 64, align: 64, offset: 1344)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !94, file: !98, line: 42, baseType: !83, size: 32, align: 32, offset: 1408)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !94, file: !98, line: 44, baseType: !284, size: 64, align: 64, offset: 1472)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !94, file: !98, line: 45, baseType: !284, size: 64, align: 64, offset: 1536)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !94, file: !98, line: 53, baseType: !408, size: 64, align: 64, offset: 1600)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !92, !69, !83}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !94, file: !98, line: 55, baseType: !412, size: 64, align: 64, offset: 1664)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!83, !92, !68}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !94, file: !98, line: 57, baseType: !416, size: 64, align: 64, offset: 1728)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!83, !92, !69}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !94, file: !98, line: 60, baseType: !420, size: 64, align: 64, offset: 1792)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!69, !92}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !94, file: !98, line: 62, baseType: !424, size: 64, align: 64, offset: 1856)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !92, !69, !69, !83}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !94, file: !98, line: 65, baseType: !428, size: 64, align: 64, offset: 1920)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!431, !92, !69, !69}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !94, file: !98, line: 69, baseType: !433, size: 64, align: 64, offset: 1984)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!75, !92, !69}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !94, file: !98, line: 70, baseType: !437, size: 64, align: 64, offset: 2048)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!440, !92, !69}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !77, line: 110, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !443, line: 15, size: 960, align: 64, elements: !444)
!443 = !DIFile(filename: "queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!444 = !{!445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !479, !480, !482, !483, !484, !485}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !442, file: !82, line: 3, baseType: !83, size: 32, align: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !442, file: !82, line: 4, baseType: !83, size: 32, align: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !442, file: !82, line: 5, baseType: !86, size: 64, align: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !442, file: !82, line: 7, baseType: !64, size: 64, align: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !442, file: !82, line: 8, baseType: !92, size: 64, align: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !442, file: !82, line: 9, baseType: !74, size: 64, align: 64, offset: 256)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !442, file: !82, line: 10, baseType: !74, size: 64, align: 64, offset: 320)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !442, file: !82, line: 11, baseType: !356, size: 64, align: 64, offset: 384)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !442, file: !82, line: 12, baseType: !83, size: 32, align: 32, offset: 448)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !442, file: !82, line: 13, baseType: !74, size: 64, align: 64, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !442, file: !82, line: 15, baseType: !456, size: 64, align: 64, offset: 576)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !459}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !77, line: 108, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !462, line: 5, size: 704, align: 64, elements: !463)
!462 = !DIFile(filename: "window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!463 = !{!464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !461, file: !82, line: 3, baseType: !83, size: 32, align: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !461, file: !82, line: 4, baseType: !83, size: 32, align: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !461, file: !82, line: 5, baseType: !86, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !461, file: !82, line: 7, baseType: !64, size: 64, align: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !461, file: !82, line: 8, baseType: !92, size: 64, align: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !461, file: !82, line: 9, baseType: !74, size: 64, align: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !461, file: !82, line: 10, baseType: !74, size: 64, align: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !461, file: !82, line: 11, baseType: !356, size: 64, align: 64, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !461, file: !82, line: 12, baseType: !83, size: 32, align: 32, offset: 448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !461, file: !82, line: 13, baseType: !74, size: 64, align: 64, offset: 512)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !461, file: !82, line: 15, baseType: !456, size: 64, align: 64, offset: 576)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !461, file: !82, line: 17, baseType: !476, size: 64, align: 64, offset: 640)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!69, !459}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !442, file: !82, line: 17, baseType: !476, size: 64, align: 64, offset: 640)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !442, file: !481, line: 5, baseType: !74, size: 64, align: 64, offset: 704)
!481 = !DIFile(filename: "query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!482 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !442, file: !481, line: 6, baseType: !74, size: 64, align: 64, offset: 768)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !442, file: !481, line: 7, baseType: !356, size: 64, align: 64, offset: 832)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !442, file: !481, line: 9, baseType: !150, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !442, file: !481, line: 11, baseType: !150, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !94, file: !98, line: 71, baseType: !487, size: 64, align: 64, offset: 2112)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!83, !69, !69}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !94, file: !98, line: 73, baseType: !487, size: 64, align: 64, offset: 2176)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !78, file: !82, line: 9, baseType: !74, size: 64, align: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !78, file: !82, line: 10, baseType: !74, size: 64, align: 64, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !78, file: !82, line: 11, baseType: !356, size: 64, align: 64, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !78, file: !82, line: 12, baseType: !83, size: 32, align: 32, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !78, file: !82, line: 13, baseType: !74, size: 64, align: 64, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !78, file: !82, line: 15, baseType: !456, size: 64, align: 64, offset: 576)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !78, file: !82, line: 17, baseType: !476, size: 64, align: 64, offset: 640)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !78, file: !499, line: 5, baseType: !74, size: 64, align: 64, offset: 704)
!499 = !DIFile(filename: "channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!500 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !78, file: !499, line: 6, baseType: !74, size: 64, align: 64, offset: 768)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !78, file: !499, line: 7, baseType: !356, size: 64, align: 64, offset: 832)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !78, file: !499, line: 9, baseType: !86, size: 64, align: 64, offset: 896)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !78, file: !499, line: 10, baseType: !504, size: 64, align: 64, offset: 960)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !77, line: 111, baseType: !506)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !77, line: 111, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !78, file: !499, line: 12, baseType: !150, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !78, file: !499, line: 13, baseType: !74, size: 64, align: 64, offset: 1088)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !78, file: !499, line: 14, baseType: !83, size: 32, align: 32, offset: 1152)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !78, file: !499, line: 15, baseType: !74, size: 64, align: 64, offset: 1216)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !78, file: !499, line: 17, baseType: !150, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !78, file: !499, line: 18, baseType: !150, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !78, file: !499, line: 19, baseType: !150, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !78, file: !499, line: 20, baseType: !150, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !78, file: !499, line: 22, baseType: !150, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !78, file: !499, line: 23, baseType: !150, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !78, file: !499, line: 24, baseType: !150, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !78, file: !499, line: 25, baseType: !150, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !78, file: !499, line: 26, baseType: !150, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !78, file: !499, line: 31, baseType: !521, size: 64, align: 64, offset: 1344)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!74, !75}
!524 = !{i32 2, !"Dwarf Version", i32 4}
!525 = !{i32 2, !"Debug Info Version", i32 3}
!526 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!527 = distinct !DISubprogram(name: "chat_commands_init", scope: !528, file: !528, line: 503, type: !272, isLocal: false, isDefinition: true, scopeLine: 504, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !529)
!528 = !DIFile(filename: "chat-commands.c", directory: "/home/lichi/Desktop/irssi/task1")
!529 = !{}
!530 = !DILocation(line: 505, column: 2, scope: !527)
!531 = !DILocation(line: 507, column: 2, scope: !527)
!532 = !DILocation(line: 508, column: 2, scope: !527)
!533 = !DILocation(line: 509, column: 2, scope: !527)
!534 = !DILocation(line: 510, column: 2, scope: !527)
!535 = !DILocation(line: 511, column: 2, scope: !527)
!536 = !DILocation(line: 512, column: 2, scope: !527)
!537 = !DILocation(line: 513, column: 2, scope: !527)
!538 = !DILocation(line: 514, column: 2, scope: !527)
!539 = !DILocation(line: 515, column: 2, scope: !527)
!540 = !DILocation(line: 516, column: 2, scope: !527)
!541 = !DILocation(line: 518, column: 2, scope: !527)
!542 = !DILocation(line: 520, column: 2, scope: !527)
!543 = !DILocation(line: 521, column: 2, scope: !527)
!544 = !DILocation(line: 522, column: 1, scope: !527)
!545 = distinct !DISubprogram(name: "cmd_server", scope: !528, file: !528, line: 248, type: !546, isLocal: true, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !529)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !69, !92, !459}
!548 = !DILocalVariable(name: "data", arg: 1, scope: !545, file: !528, line: 248, type: !69)
!549 = !DIExpression()
!550 = !DILocation(line: 248, column: 36, scope: !545)
!551 = !DILocalVariable(name: "server", arg: 2, scope: !545, file: !528, line: 248, type: !92)
!552 = !DILocation(line: 248, column: 54, scope: !545)
!553 = !DILocalVariable(name: "item", arg: 3, scope: !545, file: !528, line: 248, type: !459)
!554 = !DILocation(line: 248, column: 75, scope: !545)
!555 = !DILocation(line: 250, column: 27, scope: !545)
!556 = !DILocation(line: 250, column: 33, scope: !545)
!557 = !DILocation(line: 250, column: 41, scope: !545)
!558 = !DILocation(line: 250, column: 2, scope: !545)
!559 = !DILocation(line: 251, column: 1, scope: !545)
!560 = distinct !DISubprogram(name: "cmd_server_connect", scope: !528, file: !528, line: 262, type: !561, isLocal: true, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !529)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !69, !92}
!563 = !DILocalVariable(name: "data", arg: 1, scope: !560, file: !528, line: 262, type: !69)
!564 = !DILocation(line: 262, column: 44, scope: !560)
!565 = !DILocalVariable(name: "server", arg: 2, scope: !560, file: !528, line: 262, type: !92)
!566 = !DILocation(line: 262, column: 62, scope: !560)
!567 = !DILocalVariable(name: "conn", scope: !560, file: !528, line: 264, type: !102)
!568 = !DILocation(line: 264, column: 22, scope: !560)
!569 = !DILocalVariable(name: "rawlog_file", scope: !560, file: !528, line: 265, type: !74)
!570 = !DILocation(line: 265, column: 15, scope: !560)
!571 = !DILocalVariable(name: "plus_addr", scope: !560, file: !528, line: 266, type: !83)
!572 = !DILocation(line: 266, column: 6, scope: !560)
!573 = !DILocation(line: 268, column: 2, scope: !560)
!574 = distinct !{!574, !573}
!575 = !DILocation(line: 268, column: 10, scope: !576)
!576 = !DILexicalBlockFile(scope: !577, file: !528, discriminator: 1)
!577 = distinct !DILexicalBlock(scope: !578, file: !528, line: 268, column: 10)
!578 = distinct !DILexicalBlock(scope: !560, file: !528, line: 268, column: 4)
!579 = !DILocation(line: 268, column: 15, scope: !576)
!580 = !DILocation(line: 268, column: 5, scope: !581)
!581 = !DILexicalBlockFile(scope: !582, file: !528, discriminator: 2)
!582 = distinct !DILexicalBlock(scope: !577, file: !528, line: 268, column: 3)
!583 = !DILocation(line: 268, column: 14, scope: !584)
!584 = !DILexicalBlockFile(scope: !585, file: !528, discriminator: 3)
!585 = distinct !DILexicalBlock(scope: !577, file: !528, line: 268, column: 12)
!586 = !DILocation(line: 268, column: 99, scope: !584)
!587 = !DILocation(line: 268, column: 110, scope: !588)
!588 = !DILexicalBlockFile(scope: !578, file: !528, discriminator: 4)
!589 = !DILocation(line: 271, column: 28, scope: !560)
!590 = !DILocation(line: 271, column: 9, scope: !560)
!591 = !DILocation(line: 271, column: 7, scope: !560)
!592 = !DILocation(line: 272, column: 6, scope: !593)
!593 = distinct !DILexicalBlock(scope: !560, file: !528, line: 272, column: 6)
!594 = !DILocation(line: 272, column: 11, scope: !593)
!595 = !DILocation(line: 272, column: 6, scope: !560)
!596 = !DILocation(line: 273, column: 8, scope: !597)
!597 = distinct !DILexicalBlock(scope: !598, file: !528, line: 273, column: 7)
!598 = distinct !DILexicalBlock(scope: !593, file: !528, line: 272, column: 19)
!599 = !DILocation(line: 273, column: 7, scope: !598)
!600 = !DILocation(line: 274, column: 24, scope: !597)
!601 = !DILocation(line: 274, column: 30, scope: !597)
!602 = !DILocation(line: 274, column: 4, scope: !597)
!603 = !DILocation(line: 275, column: 27, scope: !598)
!604 = !DILocation(line: 275, column: 12, scope: !598)
!605 = !DILocation(line: 275, column: 10, scope: !598)
!606 = !DILocation(line: 276, column: 24, scope: !598)
!607 = !DILocation(line: 276, column: 3, scope: !598)
!608 = !DILocation(line: 278, column: 7, scope: !609)
!609 = distinct !DILexicalBlock(scope: !598, file: !528, line: 278, column: 7)
!610 = !DILocation(line: 278, column: 14, scope: !609)
!611 = !DILocation(line: 278, column: 21, scope: !609)
!612 = !DILocation(line: 278, column: 24, scope: !613)
!613 = !DILexicalBlockFile(scope: !609, file: !528, discriminator: 1)
!614 = !DILocation(line: 278, column: 36, scope: !613)
!615 = !DILocation(line: 278, column: 7, scope: !613)
!616 = !DILocation(line: 279, column: 16, scope: !609)
!617 = !DILocation(line: 279, column: 24, scope: !609)
!618 = !DILocation(line: 279, column: 32, scope: !609)
!619 = !DILocation(line: 279, column: 4, scope: !609)
!620 = !DILocation(line: 281, column: 10, scope: !598)
!621 = !DILocation(line: 281, column: 3, scope: !598)
!622 = !DILocation(line: 282, column: 2, scope: !598)
!623 = !DILocation(line: 283, column: 1, scope: !560)
!624 = distinct !DISubprogram(name: "cmd_connect", scope: !528, file: !528, line: 160, type: !625, isLocal: true, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !529)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !69}
!627 = !DILocalVariable(name: "data", arg: 1, scope: !624, file: !528, line: 160, type: !69)
!628 = !DILocation(line: 160, column: 37, scope: !624)
!629 = !DILocalVariable(name: "conn", scope: !624, file: !528, line: 162, type: !102)
!630 = !DILocation(line: 162, column: 22, scope: !624)
!631 = !DILocalVariable(name: "server", scope: !624, file: !528, line: 163, type: !92)
!632 = !DILocation(line: 163, column: 14, scope: !624)
!633 = !DILocalVariable(name: "rawlog_file", scope: !624, file: !528, line: 164, type: !74)
!634 = !DILocation(line: 164, column: 15, scope: !624)
!635 = !DILocation(line: 166, column: 28, scope: !624)
!636 = !DILocation(line: 166, column: 9, scope: !624)
!637 = !DILocation(line: 166, column: 7, scope: !624)
!638 = !DILocation(line: 167, column: 6, scope: !639)
!639 = distinct !DILexicalBlock(scope: !624, file: !528, line: 167, column: 6)
!640 = !DILocation(line: 167, column: 11, scope: !639)
!641 = !DILocation(line: 167, column: 6, scope: !624)
!642 = !DILocation(line: 168, column: 27, scope: !643)
!643 = distinct !DILexicalBlock(scope: !639, file: !528, line: 167, column: 19)
!644 = !DILocation(line: 168, column: 12, scope: !643)
!645 = !DILocation(line: 168, column: 10, scope: !643)
!646 = !DILocation(line: 169, column: 38, scope: !643)
!647 = !DILocation(line: 169, column: 17, scope: !643)
!648 = !DILocation(line: 171, column: 7, scope: !649)
!649 = distinct !DILexicalBlock(scope: !643, file: !528, line: 171, column: 7)
!650 = !DILocation(line: 171, column: 14, scope: !649)
!651 = !DILocation(line: 171, column: 21, scope: !649)
!652 = !DILocation(line: 171, column: 24, scope: !653)
!653 = !DILexicalBlockFile(scope: !649, file: !528, discriminator: 1)
!654 = !DILocation(line: 171, column: 36, scope: !653)
!655 = !DILocation(line: 171, column: 7, scope: !653)
!656 = !DILocation(line: 172, column: 16, scope: !649)
!657 = !DILocation(line: 172, column: 24, scope: !649)
!658 = !DILocation(line: 172, column: 32, scope: !649)
!659 = !DILocation(line: 172, column: 4, scope: !649)
!660 = !DILocation(line: 174, column: 10, scope: !643)
!661 = !DILocation(line: 174, column: 3, scope: !643)
!662 = !DILocation(line: 175, column: 2, scope: !643)
!663 = !DILocation(line: 176, column: 1, scope: !624)
!664 = distinct !DISubprogram(name: "cmd_disconnect", scope: !528, file: !528, line: 286, type: !561, isLocal: true, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !529)
!665 = !DILocalVariable(name: "data", arg: 1, scope: !664, file: !528, line: 286, type: !69)
!666 = !DILocation(line: 286, column: 40, scope: !664)
!667 = !DILocalVariable(name: "server", arg: 2, scope: !664, file: !528, line: 286, type: !92)
!668 = !DILocation(line: 286, column: 58, scope: !664)
!669 = !DILocalVariable(name: "tag", scope: !664, file: !528, line: 288, type: !74)
!670 = !DILocation(line: 288, column: 8, scope: !664)
!671 = !DILocalVariable(name: "msg", scope: !664, file: !528, line: 288, type: !74)
!672 = !DILocation(line: 288, column: 14, scope: !664)
!673 = !DILocalVariable(name: "free_arg", scope: !664, file: !528, line: 289, type: !64)
!674 = !DILocation(line: 289, column: 8, scope: !664)
!675 = !DILocation(line: 291, column: 2, scope: !664)
!676 = distinct !{!676, !675}
!677 = !DILocation(line: 291, column: 10, scope: !678)
!678 = !DILexicalBlockFile(scope: !679, file: !528, discriminator: 1)
!679 = distinct !DILexicalBlock(scope: !680, file: !528, line: 291, column: 10)
!680 = distinct !DILexicalBlock(scope: !664, file: !528, line: 291, column: 4)
!681 = !DILocation(line: 291, column: 15, scope: !678)
!682 = !DILocation(line: 291, column: 5, scope: !683)
!683 = !DILexicalBlockFile(scope: !684, file: !528, discriminator: 2)
!684 = distinct !DILexicalBlock(scope: !679, file: !528, line: 291, column: 3)
!685 = !DILocation(line: 291, column: 14, scope: !686)
!686 = !DILexicalBlockFile(scope: !687, file: !528, discriminator: 3)
!687 = distinct !DILexicalBlock(scope: !679, file: !528, line: 291, column: 12)
!688 = !DILocation(line: 291, column: 99, scope: !686)
!689 = !DILocation(line: 291, column: 110, scope: !690)
!690 = !DILexicalBlockFile(scope: !680, file: !528, discriminator: 4)
!691 = !DILocation(line: 293, column: 22, scope: !692)
!692 = distinct !DILexicalBlock(scope: !664, file: !528, line: 293, column: 6)
!693 = !DILocation(line: 293, column: 7, scope: !692)
!694 = !DILocation(line: 293, column: 6, scope: !664)
!695 = !DILocation(line: 294, column: 3, scope: !692)
!696 = !DILocation(line: 296, column: 7, scope: !697)
!697 = distinct !DILexicalBlock(scope: !664, file: !528, line: 296, column: 6)
!698 = !DILocation(line: 296, column: 6, scope: !697)
!699 = !DILocation(line: 296, column: 11, scope: !697)
!700 = !DILocation(line: 296, column: 19, scope: !697)
!701 = !DILocation(line: 296, column: 32, scope: !702)
!702 = !DILexicalBlockFile(scope: !697, file: !528, discriminator: 1)
!703 = !DILocation(line: 296, column: 22, scope: !702)
!704 = !DILocation(line: 296, column: 42, scope: !702)
!705 = !DILocation(line: 296, column: 6, scope: !702)
!706 = !DILocation(line: 297, column: 28, scope: !707)
!707 = distinct !DILexicalBlock(scope: !697, file: !528, line: 296, column: 48)
!708 = !DILocation(line: 297, column: 12, scope: !707)
!709 = !DILocation(line: 297, column: 10, scope: !707)
!710 = !DILocation(line: 298, column: 7, scope: !711)
!711 = distinct !DILexicalBlock(scope: !707, file: !528, line: 298, column: 7)
!712 = !DILocation(line: 298, column: 14, scope: !711)
!713 = !DILocation(line: 298, column: 7, scope: !707)
!714 = !DILocation(line: 299, column: 36, scope: !711)
!715 = !DILocation(line: 299, column: 13, scope: !711)
!716 = !DILocation(line: 299, column: 11, scope: !711)
!717 = !DILocation(line: 299, column: 4, scope: !711)
!718 = !DILocation(line: 300, column: 2, scope: !707)
!719 = !DILocation(line: 301, column: 6, scope: !720)
!720 = distinct !DILexicalBlock(scope: !664, file: !528, line: 301, column: 6)
!721 = !DILocation(line: 301, column: 13, scope: !720)
!722 = !DILocation(line: 301, column: 6, scope: !664)
!723 = !DILocation(line: 301, column: 21, scope: !724)
!724 = !DILexicalBlockFile(scope: !720, file: !528, discriminator: 1)
!725 = distinct !{!725, !726}
!726 = !DILocation(line: 301, column: 21, scope: !720)
!727 = !DILocation(line: 301, column: 42, scope: !728)
!728 = !DILexicalBlockFile(scope: !729, file: !528, discriminator: 2)
!729 = distinct !DILexicalBlock(scope: !720, file: !528, line: 301, column: 24)
!730 = !DILocation(line: 301, column: 26, scope: !728)
!731 = !DILocation(line: 301, column: 53, scope: !728)
!732 = distinct !{!732, !733}
!733 = !DILocation(line: 301, column: 53, scope: !729)
!734 = !DILocation(line: 301, column: 58, scope: !735)
!735 = !DILexicalBlockFile(scope: !736, file: !528, discriminator: 3)
!736 = distinct !DILexicalBlock(scope: !729, file: !528, line: 301, column: 56)
!737 = !DILocation(line: 301, column: 136, scope: !738)
!738 = !DILexicalBlockFile(scope: !735, file: !528, discriminator: 6)
!739 = !DILocation(line: 301, column: 151, scope: !735)
!740 = !DILocation(line: 301, column: 172, scope: !741)
!741 = !DILexicalBlockFile(scope: !729, file: !528, discriminator: 4)
!742 = !DILocation(line: 301, column: 172, scope: !743)
!743 = !DILexicalBlockFile(scope: !729, file: !528, discriminator: 5)
!744 = !DILocation(line: 303, column: 7, scope: !745)
!745 = distinct !DILexicalBlock(scope: !664, file: !528, line: 303, column: 6)
!746 = !DILocation(line: 303, column: 6, scope: !745)
!747 = !DILocation(line: 303, column: 11, scope: !745)
!748 = !DILocation(line: 303, column: 6, scope: !664)
!749 = !DILocation(line: 303, column: 35, scope: !750)
!750 = !DILexicalBlockFile(scope: !745, file: !528, discriminator: 1)
!751 = !DILocation(line: 303, column: 24, scope: !750)
!752 = !DILocation(line: 303, column: 20, scope: !750)
!753 = !DILocation(line: 304, column: 32, scope: !664)
!754 = !DILocation(line: 304, column: 40, scope: !664)
!755 = !DILocation(line: 304, column: 2, scope: !664)
!756 = !DILocation(line: 306, column: 18, scope: !664)
!757 = !DILocation(line: 306, column: 2, scope: !664)
!758 = !DILocation(line: 307, column: 20, scope: !664)
!759 = !DILocation(line: 307, column: 2, scope: !664)
!760 = !DILocation(line: 308, column: 1, scope: !664)
!761 = !DILocation(line: 308, column: 1, scope: !762)
!762 = !DILexicalBlockFile(scope: !664, file: !528, discriminator: 1)
!763 = distinct !DISubprogram(name: "cmd_quit", scope: !528, file: !528, line: 311, type: !625, isLocal: true, isDefinition: true, scopeLine: 312, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !529)
!764 = !DILocalVariable(name: "data", arg: 1, scope: !763, file: !528, line: 311, type: !69)
!765 = !DILocation(line: 311, column: 34, scope: !763)
!766 = !DILocalVariable(name: "tmp", scope: !763, file: !528, line: 313, type: !284)
!767 = !DILocation(line: 313, column: 10, scope: !763)
!768 = !DILocalVariable(name: "next", scope: !763, file: !528, line: 313, type: !284)
!769 = !DILocation(line: 313, column: 16, scope: !763)
!770 = !DILocalVariable(name: "quitmsg", scope: !763, file: !528, line: 314, type: !69)
!771 = !DILocation(line: 314, column: 14, scope: !763)
!772 = !DILocalVariable(name: "str", scope: !763, file: !528, line: 315, type: !74)
!773 = !DILocation(line: 315, column: 8, scope: !763)
!774 = !DILocation(line: 317, column: 2, scope: !763)
!775 = distinct !{!775, !774}
!776 = !DILocation(line: 317, column: 10, scope: !777)
!777 = !DILexicalBlockFile(scope: !778, file: !528, discriminator: 1)
!778 = distinct !DILexicalBlock(scope: !779, file: !528, line: 317, column: 10)
!779 = distinct !DILexicalBlock(scope: !763, file: !528, line: 317, column: 4)
!780 = !DILocation(line: 317, column: 15, scope: !777)
!781 = !DILocation(line: 317, column: 5, scope: !782)
!782 = !DILexicalBlockFile(scope: !783, file: !528, discriminator: 2)
!783 = distinct !DILexicalBlock(scope: !778, file: !528, line: 317, column: 3)
!784 = !DILocation(line: 317, column: 14, scope: !785)
!785 = !DILexicalBlockFile(scope: !786, file: !528, discriminator: 3)
!786 = distinct !DILexicalBlock(scope: !778, file: !528, line: 317, column: 12)
!787 = !DILocation(line: 317, column: 99, scope: !785)
!788 = !DILocation(line: 317, column: 110, scope: !789)
!789 = !DILexicalBlockFile(scope: !779, file: !528, discriminator: 4)
!790 = !DILocation(line: 319, column: 13, scope: !763)
!791 = !DILocation(line: 319, column: 12, scope: !763)
!792 = !DILocation(line: 319, column: 18, scope: !763)
!793 = !DILocation(line: 319, column: 28, scope: !794)
!794 = !DILexicalBlockFile(scope: !763, file: !528, discriminator: 1)
!795 = !DILocation(line: 319, column: 12, scope: !794)
!796 = !DILocation(line: 320, column: 3, scope: !763)
!797 = !DILocation(line: 319, column: 12, scope: !798)
!798 = !DILexicalBlockFile(scope: !763, file: !528, discriminator: 2)
!799 = !DILocation(line: 319, column: 12, scope: !800)
!800 = !DILexicalBlockFile(scope: !763, file: !528, discriminator: 3)
!801 = !DILocation(line: 319, column: 10, scope: !800)
!802 = !DILocation(line: 323, column: 13, scope: !803)
!803 = distinct !DILexicalBlock(scope: !763, file: !528, line: 323, column: 2)
!804 = !DILocation(line: 323, column: 11, scope: !803)
!805 = !DILocation(line: 323, column: 7, scope: !803)
!806 = !DILocation(line: 323, column: 22, scope: !807)
!807 = !DILexicalBlockFile(scope: !808, file: !528, discriminator: 1)
!808 = distinct !DILexicalBlock(scope: !803, file: !528, line: 323, column: 2)
!809 = !DILocation(line: 323, column: 26, scope: !807)
!810 = !DILocation(line: 323, column: 2, scope: !807)
!811 = !DILocation(line: 324, column: 10, scope: !812)
!812 = distinct !DILexicalBlock(scope: !808, file: !528, line: 323, column: 46)
!813 = !DILocation(line: 324, column: 15, scope: !812)
!814 = !DILocation(line: 324, column: 8, scope: !812)
!815 = !DILocation(line: 326, column: 33, scope: !812)
!816 = !DILocation(line: 326, column: 9, scope: !812)
!817 = !DILocation(line: 326, column: 7, scope: !812)
!818 = !DILocation(line: 327, column: 18, scope: !812)
!819 = !DILocation(line: 327, column: 23, scope: !812)
!820 = !DILocation(line: 327, column: 28, scope: !812)
!821 = !DILocation(line: 327, column: 3, scope: !812)
!822 = !DILocation(line: 328, column: 10, scope: !812)
!823 = !DILocation(line: 328, column: 3, scope: !812)
!824 = !DILocation(line: 329, column: 2, scope: !812)
!825 = !DILocation(line: 323, column: 40, scope: !826)
!826 = !DILexicalBlockFile(scope: !808, file: !528, discriminator: 2)
!827 = !DILocation(line: 323, column: 38, scope: !826)
!828 = !DILocation(line: 323, column: 2, scope: !826)
!829 = distinct !{!829, !830}
!830 = !DILocation(line: 323, column: 2, scope: !763)
!831 = !DILocation(line: 331, column: 2, scope: !763)
!832 = !DILocation(line: 332, column: 1, scope: !763)
!833 = !DILocation(line: 332, column: 1, scope: !794)
!834 = distinct !DISubprogram(name: "cmd_msg", scope: !528, file: !528, line: 335, type: !546, isLocal: true, isDefinition: true, scopeLine: 336, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !529)
!835 = !DILocalVariable(name: "data", arg: 1, scope: !834, file: !528, line: 335, type: !69)
!836 = !DILocation(line: 335, column: 33, scope: !834)
!837 = !DILocalVariable(name: "server", arg: 2, scope: !834, file: !528, line: 335, type: !92)
!838 = !DILocation(line: 335, column: 51, scope: !834)
!839 = !DILocalVariable(name: "item", arg: 3, scope: !834, file: !528, line: 335, type: !459)
!840 = !DILocation(line: 335, column: 72, scope: !834)
!841 = !DILocalVariable(name: "optlist", scope: !834, file: !528, line: 337, type: !86)
!842 = !DILocation(line: 337, column: 14, scope: !834)
!843 = !DILocalVariable(name: "target", scope: !834, file: !528, line: 338, type: !74)
!844 = !DILocation(line: 338, column: 8, scope: !834)
!845 = !DILocalVariable(name: "origtarget", scope: !834, file: !528, line: 338, type: !74)
!846 = !DILocation(line: 338, column: 17, scope: !834)
!847 = !DILocalVariable(name: "msg", scope: !834, file: !528, line: 338, type: !74)
!848 = !DILocation(line: 338, column: 30, scope: !834)
!849 = !DILocalVariable(name: "free_arg", scope: !834, file: !528, line: 339, type: !64)
!850 = !DILocation(line: 339, column: 8, scope: !834)
!851 = !DILocalVariable(name: "free_ret", scope: !834, file: !528, line: 340, type: !83)
!852 = !DILocation(line: 340, column: 6, scope: !834)
!853 = !DILocalVariable(name: "target_type", scope: !834, file: !528, line: 340, type: !83)
!854 = !DILocation(line: 340, column: 16, scope: !834)
!855 = !DILocation(line: 342, column: 2, scope: !834)
!856 = distinct !{!856, !855}
!857 = !DILocation(line: 342, column: 10, scope: !858)
!858 = !DILexicalBlockFile(scope: !859, file: !528, discriminator: 1)
!859 = distinct !DILexicalBlock(scope: !860, file: !528, line: 342, column: 10)
!860 = distinct !DILexicalBlock(scope: !834, file: !528, line: 342, column: 4)
!861 = !DILocation(line: 342, column: 15, scope: !858)
!862 = !DILocation(line: 342, column: 5, scope: !863)
!863 = !DILexicalBlockFile(scope: !864, file: !528, discriminator: 2)
!864 = distinct !DILexicalBlock(scope: !859, file: !528, line: 342, column: 3)
!865 = !DILocation(line: 342, column: 14, scope: !866)
!866 = !DILexicalBlockFile(scope: !867, file: !528, discriminator: 3)
!867 = distinct !DILexicalBlock(scope: !859, file: !528, line: 342, column: 12)
!868 = !DILocation(line: 342, column: 99, scope: !866)
!869 = !DILocation(line: 342, column: 110, scope: !870)
!870 = !DILexicalBlockFile(scope: !860, file: !528, discriminator: 4)
!871 = !DILocation(line: 344, column: 22, scope: !872)
!872 = distinct !DILexicalBlock(scope: !834, file: !528, line: 344, column: 6)
!873 = !DILocation(line: 344, column: 7, scope: !872)
!874 = !DILocation(line: 344, column: 6, scope: !834)
!875 = !DILocation(line: 347, column: 3, scope: !872)
!876 = !DILocation(line: 348, column: 7, scope: !877)
!877 = distinct !DILexicalBlock(scope: !834, file: !528, line: 348, column: 6)
!878 = !DILocation(line: 348, column: 6, scope: !877)
!879 = !DILocation(line: 348, column: 14, scope: !877)
!880 = !DILocation(line: 348, column: 22, scope: !877)
!881 = !DILocation(line: 348, column: 26, scope: !882)
!882 = !DILexicalBlockFile(scope: !877, file: !528, discriminator: 1)
!883 = !DILocation(line: 348, column: 25, scope: !882)
!884 = !DILocation(line: 348, column: 30, scope: !882)
!885 = !DILocation(line: 348, column: 6, scope: !882)
!886 = !DILocation(line: 348, column: 39, scope: !887)
!887 = !DILexicalBlockFile(scope: !877, file: !528, discriminator: 2)
!888 = distinct !{!888, !889}
!889 = !DILocation(line: 348, column: 39, scope: !877)
!890 = !DILocation(line: 348, column: 60, scope: !891)
!891 = !DILexicalBlockFile(scope: !892, file: !528, discriminator: 3)
!892 = distinct !DILexicalBlock(scope: !877, file: !528, line: 348, column: 42)
!893 = !DILocation(line: 348, column: 44, scope: !891)
!894 = !DILocation(line: 348, column: 71, scope: !891)
!895 = distinct !{!895, !896}
!896 = !DILocation(line: 348, column: 71, scope: !892)
!897 = !DILocation(line: 348, column: 76, scope: !898)
!898 = !DILexicalBlockFile(scope: !899, file: !528, discriminator: 4)
!899 = distinct !DILexicalBlock(scope: !892, file: !528, line: 348, column: 74)
!900 = !DILocation(line: 348, column: 158, scope: !901)
!901 = !DILexicalBlockFile(scope: !898, file: !528, discriminator: 7)
!902 = !DILocation(line: 348, column: 173, scope: !898)
!903 = !DILocation(line: 348, column: 194, scope: !904)
!904 = !DILexicalBlockFile(scope: !892, file: !528, discriminator: 5)
!905 = !DILocation(line: 348, column: 194, scope: !906)
!906 = !DILexicalBlockFile(scope: !892, file: !528, discriminator: 6)
!907 = !DILocation(line: 350, column: 41, scope: !834)
!908 = !DILocation(line: 350, column: 50, scope: !834)
!909 = !DILocation(line: 350, column: 11, scope: !834)
!910 = !DILocation(line: 350, column: 9, scope: !834)
!911 = !DILocation(line: 351, column: 6, scope: !912)
!912 = distinct !DILexicalBlock(scope: !834, file: !528, line: 351, column: 6)
!913 = !DILocation(line: 351, column: 13, scope: !912)
!914 = !DILocation(line: 351, column: 20, scope: !912)
!915 = !DILocation(line: 351, column: 24, scope: !916)
!916 = !DILexicalBlockFile(scope: !912, file: !528, discriminator: 1)
!917 = !DILocation(line: 351, column: 32, scope: !916)
!918 = !DILocation(line: 351, column: 6, scope: !916)
!919 = !DILocation(line: 352, column: 3, scope: !912)
!920 = distinct !{!920, !919}
!921 = !DILocation(line: 352, column: 24, scope: !922)
!922 = !DILexicalBlockFile(scope: !923, file: !528, discriminator: 1)
!923 = distinct !DILexicalBlock(scope: !912, file: !528, line: 352, column: 6)
!924 = !DILocation(line: 352, column: 8, scope: !922)
!925 = !DILocation(line: 352, column: 35, scope: !922)
!926 = distinct !{!926, !927}
!927 = !DILocation(line: 352, column: 35, scope: !923)
!928 = !DILocation(line: 352, column: 40, scope: !929)
!929 = !DILexicalBlockFile(scope: !930, file: !528, discriminator: 2)
!930 = distinct !DILexicalBlock(scope: !923, file: !528, line: 352, column: 38)
!931 = !DILocation(line: 352, column: 118, scope: !932)
!932 = !DILexicalBlockFile(scope: !929, file: !528, discriminator: 5)
!933 = !DILocation(line: 352, column: 133, scope: !929)
!934 = !DILocation(line: 352, column: 154, scope: !935)
!935 = !DILexicalBlockFile(scope: !923, file: !528, discriminator: 3)
!936 = !DILocation(line: 352, column: 154, scope: !937)
!937 = !DILexicalBlockFile(scope: !923, file: !528, discriminator: 4)
!938 = !DILocation(line: 354, column: 22, scope: !834)
!939 = !DILocation(line: 354, column: 20, scope: !834)
!940 = !DILocation(line: 355, column: 11, scope: !834)
!941 = !DILocation(line: 356, column: 16, scope: !942)
!942 = distinct !DILexicalBlock(scope: !834, file: !528, line: 356, column: 6)
!943 = !DILocation(line: 356, column: 6, scope: !942)
!944 = !DILocation(line: 356, column: 29, scope: !942)
!945 = !DILocation(line: 356, column: 34, scope: !942)
!946 = !DILocation(line: 356, column: 47, scope: !947)
!947 = !DILexicalBlockFile(scope: !942, file: !528, discriminator: 1)
!948 = !DILocation(line: 356, column: 37, scope: !947)
!949 = !DILocation(line: 356, column: 60, scope: !947)
!950 = !DILocation(line: 356, column: 6, scope: !947)
!951 = !DILocation(line: 357, column: 35, scope: !952)
!952 = distinct !DILexicalBlock(scope: !942, file: !528, line: 356, column: 66)
!953 = !DILocation(line: 357, column: 43, scope: !952)
!954 = !DILocation(line: 357, column: 12, scope: !952)
!955 = !DILocation(line: 357, column: 10, scope: !952)
!956 = !DILocation(line: 359, column: 7, scope: !957)
!957 = distinct !DILexicalBlock(scope: !952, file: !528, line: 359, column: 7)
!958 = !DILocation(line: 359, column: 14, scope: !957)
!959 = !DILocation(line: 359, column: 21, scope: !957)
!960 = !DILocation(line: 359, column: 25, scope: !961)
!961 = !DILexicalBlockFile(scope: !957, file: !528, discriminator: 1)
!962 = !DILocation(line: 359, column: 24, scope: !961)
!963 = !DILocation(line: 359, column: 32, scope: !961)
!964 = !DILocation(line: 359, column: 7, scope: !961)
!965 = !DILocation(line: 360, column: 8, scope: !966)
!966 = distinct !DILexicalBlock(scope: !967, file: !528, line: 360, column: 8)
!967 = distinct !DILexicalBlock(scope: !957, file: !528, line: 359, column: 41)
!968 = !DILocation(line: 360, column: 8, scope: !967)
!969 = !DILocation(line: 361, column: 12, scope: !966)
!970 = !DILocation(line: 361, column: 5, scope: !966)
!971 = !DILocation(line: 362, column: 11, scope: !967)
!972 = !DILocation(line: 363, column: 13, scope: !967)
!973 = !DILocation(line: 364, column: 3, scope: !967)
!974 = !DILocation(line: 365, column: 2, scope: !952)
!975 = !DILocation(line: 367, column: 6, scope: !976)
!976 = distinct !DILexicalBlock(scope: !834, file: !528, line: 367, column: 6)
!977 = !DILocation(line: 367, column: 13, scope: !976)
!978 = !DILocation(line: 367, column: 6, scope: !834)
!979 = !DILocation(line: 368, column: 17, scope: !980)
!980 = distinct !DILexicalBlock(scope: !981, file: !528, line: 368, column: 7)
!981 = distinct !DILexicalBlock(scope: !976, file: !528, line: 367, column: 21)
!982 = !DILocation(line: 368, column: 7, scope: !980)
!983 = !DILocation(line: 368, column: 30, scope: !980)
!984 = !DILocation(line: 368, column: 7, scope: !981)
!985 = !DILocation(line: 370, column: 8, scope: !986)
!986 = distinct !DILexicalBlock(scope: !987, file: !528, line: 370, column: 8)
!987 = distinct !DILexicalBlock(scope: !980, file: !528, line: 368, column: 36)
!988 = !DILocation(line: 370, column: 13, scope: !986)
!989 = !DILocation(line: 370, column: 8, scope: !987)
!990 = !DILocation(line: 371, column: 5, scope: !986)
!991 = distinct !{!991, !990}
!992 = !DILocation(line: 371, column: 26, scope: !993)
!993 = !DILexicalBlockFile(scope: !994, file: !528, discriminator: 1)
!994 = distinct !DILexicalBlock(scope: !986, file: !528, line: 371, column: 8)
!995 = !DILocation(line: 371, column: 10, scope: !993)
!996 = !DILocation(line: 371, column: 37, scope: !993)
!997 = distinct !{!997, !998}
!998 = !DILocation(line: 371, column: 37, scope: !994)
!999 = !DILocation(line: 371, column: 42, scope: !1000)
!1000 = !DILexicalBlockFile(scope: !1001, file: !528, discriminator: 2)
!1001 = distinct !DILexicalBlock(scope: !994, file: !528, line: 371, column: 40)
!1002 = !DILocation(line: 371, column: 117, scope: !1003)
!1003 = !DILexicalBlockFile(scope: !1000, file: !528, discriminator: 5)
!1004 = !DILocation(line: 371, column: 132, scope: !1000)
!1005 = !DILocation(line: 371, column: 153, scope: !1006)
!1006 = !DILexicalBlockFile(scope: !994, file: !528, discriminator: 3)
!1007 = !DILocation(line: 371, column: 153, scope: !1008)
!1008 = !DILexicalBlockFile(scope: !994, file: !528, discriminator: 4)
!1009 = !DILocation(line: 373, column: 61, scope: !987)
!1010 = !DILocation(line: 373, column: 36, scope: !987)
!1011 = !DILocation(line: 373, column: 20, scope: !987)
!1012 = !DILocation(line: 373, column: 19, scope: !987)
!1013 = !DILocation(line: 373, column: 18, scope: !987)
!1014 = !DILocation(line: 373, column: 16, scope: !987)
!1015 = !DILocation(line: 375, column: 24, scope: !987)
!1016 = !DILocation(line: 375, column: 31, scope: !987)
!1017 = !DILocation(line: 375, column: 42, scope: !987)
!1018 = !DILocation(line: 375, column: 23, scope: !987)
!1019 = !DILocation(line: 375, column: 11, scope: !987)
!1020 = !DILocation(line: 376, column: 3, scope: !987)
!1021 = !DILocation(line: 376, column: 34, scope: !1022)
!1022 = !DILexicalBlockFile(scope: !1023, file: !528, discriminator: 1)
!1023 = distinct !DILexicalBlock(scope: !980, file: !528, line: 376, column: 14)
!1024 = !DILocation(line: 376, column: 14, scope: !1022)
!1025 = !DILocation(line: 376, column: 54, scope: !1022)
!1026 = !DILocation(line: 377, column: 37, scope: !1023)
!1027 = !DILocation(line: 377, column: 25, scope: !1023)
!1028 = !DILocation(line: 378, column: 32, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1023, file: !528, line: 378, column: 12)
!1030 = !DILocation(line: 378, column: 12, scope: !1029)
!1031 = !DILocation(line: 378, column: 49, scope: !1029)
!1032 = !DILocation(line: 378, column: 12, scope: !1023)
!1033 = !DILocation(line: 379, column: 16, scope: !1029)
!1034 = !DILocation(line: 379, column: 4, scope: !1029)
!1035 = !DILocation(line: 386, column: 20, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1029, file: !528, line: 380, column: 8)
!1037 = !DILocation(line: 386, column: 29, scope: !1036)
!1038 = !DILocation(line: 386, column: 39, scope: !1036)
!1039 = !DILocation(line: 386, column: 47, scope: !1036)
!1040 = !DILocation(line: 386, column: 19, scope: !1036)
!1041 = !DILocation(line: 386, column: 18, scope: !1036)
!1042 = !DILocation(line: 386, column: 16, scope: !1036)
!1043 = !DILocation(line: 389, column: 2, scope: !981)
!1044 = !DILocation(line: 390, column: 6, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !834, file: !528, line: 390, column: 6)
!1046 = !DILocation(line: 390, column: 13, scope: !1045)
!1047 = !DILocation(line: 390, column: 6, scope: !834)
!1048 = !DILocalVariable(name: "splitmsgs", scope: !1049, file: !528, line: 391, type: !431)
!1049 = distinct !DILexicalBlock(scope: !1045, file: !528, line: 390, column: 21)
!1050 = !DILocation(line: 391, column: 10, scope: !1049)
!1051 = !DILocalVariable(name: "tmp", scope: !1049, file: !528, line: 392, type: !431)
!1052 = !DILocation(line: 392, column: 10, scope: !1049)
!1053 = !DILocalVariable(name: "singlemsg", scope: !1049, file: !528, line: 393, type: !1054)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 128, align: 64, elements: !375)
!1055 = !DILocation(line: 393, column: 9, scope: !1049)
!1056 = !DILocation(line: 393, column: 23, scope: !1049)
!1057 = !DILocation(line: 393, column: 25, scope: !1049)
!1058 = !DILocalVariable(name: "m", scope: !1049, file: !528, line: 394, type: !74)
!1059 = !DILocation(line: 394, column: 9, scope: !1049)
!1060 = !DILocalVariable(name: "n", scope: !1049, file: !528, line: 395, type: !83)
!1061 = !DILocation(line: 395, column: 7, scope: !1049)
!1062 = !DILocation(line: 401, column: 7, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1049, file: !528, line: 401, column: 7)
!1064 = !DILocation(line: 401, column: 15, scope: !1063)
!1065 = !DILocation(line: 401, column: 29, scope: !1063)
!1066 = !DILocation(line: 401, column: 7, scope: !1049)
!1067 = !DILocation(line: 402, column: 22, scope: !1063)
!1068 = !DILocation(line: 402, column: 30, scope: !1063)
!1069 = !DILocation(line: 402, column: 44, scope: !1063)
!1070 = !DILocation(line: 402, column: 52, scope: !1063)
!1071 = !DILocation(line: 403, column: 9, scope: !1063)
!1072 = !DILocation(line: 402, column: 20, scope: !1063)
!1073 = !DILocation(line: 402, column: 14, scope: !1063)
!1074 = !DILocation(line: 402, column: 4, scope: !1063)
!1075 = !DILocation(line: 405, column: 16, scope: !1063)
!1076 = !DILocation(line: 405, column: 14, scope: !1063)
!1077 = !DILocation(line: 407, column: 3, scope: !1049)
!1078 = !DILocation(line: 407, column: 26, scope: !1079)
!1079 = !DILexicalBlockFile(scope: !1049, file: !528, discriminator: 1)
!1080 = !DILocation(line: 407, column: 15, scope: !1079)
!1081 = !DILocation(line: 407, column: 13, scope: !1079)
!1082 = !DILocation(line: 407, column: 3, scope: !1079)
!1083 = !DILocation(line: 408, column: 37, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1049, file: !528, line: 407, column: 32)
!1085 = !DILocation(line: 408, column: 45, scope: !1084)
!1086 = !DILocation(line: 408, column: 53, scope: !1084)
!1087 = !DILocation(line: 409, column: 30, scope: !1084)
!1088 = !DILocation(line: 409, column: 21, scope: !1084)
!1089 = !DILocation(line: 409, column: 10, scope: !1084)
!1090 = !DILocation(line: 408, column: 4, scope: !1084)
!1091 = !DILocation(line: 410, column: 16, scope: !1084)
!1092 = !DILocation(line: 410, column: 28, scope: !1084)
!1093 = !DILocation(line: 412, column: 35, scope: !1084)
!1094 = !DILocation(line: 412, column: 43, scope: !1084)
!1095 = !DILocation(line: 413, column: 9, scope: !1084)
!1096 = !DILocation(line: 413, column: 17, scope: !1084)
!1097 = !DILocation(line: 410, column: 4, scope: !1084)
!1098 = !DILocation(line: 407, column: 3, scope: !1099)
!1099 = !DILexicalBlockFile(scope: !1049, file: !528, discriminator: 2)
!1100 = distinct !{!1100, !1077}
!1101 = !DILocation(line: 415, column: 14, scope: !1049)
!1102 = !DILocation(line: 415, column: 3, scope: !1049)
!1103 = !DILocation(line: 416, column: 2, scope: !1049)
!1104 = !DILocation(line: 417, column: 41, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1045, file: !528, line: 416, column: 9)
!1106 = !DILocation(line: 417, column: 49, scope: !1105)
!1107 = !DILocation(line: 417, column: 54, scope: !1105)
!1108 = !DILocation(line: 418, column: 8, scope: !1105)
!1109 = !DILocation(line: 417, column: 3, scope: !1105)
!1110 = !DILocation(line: 421, column: 6, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !834, file: !528, line: 421, column: 6)
!1112 = !DILocation(line: 421, column: 15, scope: !1111)
!1113 = !DILocation(line: 421, column: 18, scope: !1114)
!1114 = !DILexicalBlockFile(scope: !1111, file: !528, discriminator: 1)
!1115 = !DILocation(line: 421, column: 25, scope: !1114)
!1116 = !DILocation(line: 421, column: 6, scope: !1114)
!1117 = !DILocation(line: 421, column: 40, scope: !1118)
!1118 = !DILexicalBlockFile(scope: !1111, file: !528, discriminator: 2)
!1119 = !DILocation(line: 421, column: 33, scope: !1118)
!1120 = !DILocation(line: 422, column: 18, scope: !834)
!1121 = !DILocation(line: 422, column: 2, scope: !834)
!1122 = !DILocation(line: 423, column: 1, scope: !834)
!1123 = !DILocation(line: 423, column: 1, scope: !1124)
!1124 = !DILexicalBlockFile(scope: !834, file: !528, discriminator: 1)
!1125 = distinct !DISubprogram(name: "cmd_foreach", scope: !528, file: !528, line: 432, type: !546, isLocal: true, isDefinition: true, scopeLine: 434, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !529)
!1126 = !DILocalVariable(name: "data", arg: 1, scope: !1125, file: !528, line: 432, type: !69)
!1127 = !DILocation(line: 432, column: 37, scope: !1125)
!1128 = !DILocalVariable(name: "server", arg: 2, scope: !1125, file: !528, line: 432, type: !92)
!1129 = !DILocation(line: 432, column: 55, scope: !1125)
!1130 = !DILocalVariable(name: "item", arg: 3, scope: !1125, file: !528, line: 433, type: !459)
!1131 = !DILocation(line: 433, column: 17, scope: !1125)
!1132 = !DILocation(line: 435, column: 28, scope: !1125)
!1133 = !DILocation(line: 435, column: 34, scope: !1125)
!1134 = !DILocation(line: 435, column: 42, scope: !1125)
!1135 = !DILocation(line: 435, column: 2, scope: !1125)
!1136 = !DILocation(line: 436, column: 1, scope: !1125)
!1137 = distinct !DISubprogram(name: "cmd_foreach_server", scope: !528, file: !528, line: 439, type: !561, isLocal: true, isDefinition: true, scopeLine: 440, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !529)
!1138 = !DILocalVariable(name: "data", arg: 1, scope: !1137, file: !528, line: 439, type: !69)
!1139 = !DILocation(line: 439, column: 44, scope: !1137)
!1140 = !DILocalVariable(name: "server", arg: 2, scope: !1137, file: !528, line: 439, type: !92)
!1141 = !DILocation(line: 439, column: 62, scope: !1137)
!1142 = !DILocalVariable(name: "list", scope: !1137, file: !528, line: 441, type: !284)
!1143 = !DILocation(line: 441, column: 10, scope: !1137)
!1144 = !DILocalVariable(name: "cmdchars", scope: !1137, file: !528, line: 442, type: !69)
!1145 = !DILocation(line: 442, column: 14, scope: !1137)
!1146 = !DILocalVariable(name: "str", scope: !1137, file: !528, line: 443, type: !74)
!1147 = !DILocation(line: 443, column: 8, scope: !1137)
!1148 = !DILocation(line: 445, column: 13, scope: !1137)
!1149 = !DILocation(line: 445, column: 11, scope: !1137)
!1150 = !DILocation(line: 446, column: 15, scope: !1137)
!1151 = !DILocation(line: 446, column: 26, scope: !1137)
!1152 = !DILocation(line: 446, column: 25, scope: !1137)
!1153 = !DILocation(line: 446, column: 8, scope: !1137)
!1154 = !DILocation(line: 446, column: 32, scope: !1137)
!1155 = !DILocation(line: 446, column: 50, scope: !1156)
!1156 = !DILexicalBlockFile(scope: !1137, file: !528, discriminator: 1)
!1157 = !DILocation(line: 446, column: 41, scope: !1156)
!1158 = !DILocation(line: 446, column: 8, scope: !1156)
!1159 = !DILocation(line: 447, column: 28, scope: !1137)
!1160 = !DILocation(line: 447, column: 27, scope: !1137)
!1161 = !DILocation(line: 447, column: 38, scope: !1137)
!1162 = !DILocation(line: 447, column: 3, scope: !1137)
!1163 = !DILocation(line: 446, column: 8, scope: !1164)
!1164 = !DILexicalBlockFile(scope: !1137, file: !528, discriminator: 2)
!1165 = !DILocation(line: 446, column: 8, scope: !1166)
!1166 = !DILexicalBlockFile(scope: !1137, file: !528, discriminator: 3)
!1167 = !DILocation(line: 446, column: 6, scope: !1166)
!1168 = !DILocation(line: 449, column: 22, scope: !1137)
!1169 = !DILocation(line: 449, column: 9, scope: !1137)
!1170 = !DILocation(line: 449, column: 7, scope: !1137)
!1171 = !DILocation(line: 450, column: 2, scope: !1137)
!1172 = !DILocation(line: 450, column: 9, scope: !1156)
!1173 = !DILocation(line: 450, column: 14, scope: !1156)
!1174 = !DILocation(line: 450, column: 2, scope: !1156)
!1175 = !DILocation(line: 451, column: 34, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1137, file: !528, line: 450, column: 22)
!1177 = !DILocation(line: 451, column: 39, scope: !1176)
!1178 = !DILocation(line: 451, column: 45, scope: !1176)
!1179 = !DILocation(line: 451, column: 3, scope: !1176)
!1180 = !DILocation(line: 452, column: 25, scope: !1176)
!1181 = !DILocation(line: 452, column: 31, scope: !1176)
!1182 = !DILocation(line: 452, column: 37, scope: !1176)
!1183 = !DILocation(line: 452, column: 10, scope: !1176)
!1184 = !DILocation(line: 452, column: 8, scope: !1176)
!1185 = !DILocation(line: 450, column: 2, scope: !1164)
!1186 = distinct !{!1186, !1171}
!1187 = !DILocation(line: 455, column: 9, scope: !1137)
!1188 = !DILocation(line: 455, column: 2, scope: !1137)
!1189 = !DILocation(line: 456, column: 1, scope: !1137)
!1190 = distinct !DISubprogram(name: "cmd_foreach_channel", scope: !528, file: !528, line: 459, type: !625, isLocal: true, isDefinition: true, scopeLine: 460, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !529)
!1191 = !DILocalVariable(name: "data", arg: 1, scope: !1190, file: !528, line: 459, type: !69)
!1192 = !DILocation(line: 459, column: 45, scope: !1190)
!1193 = !DILocalVariable(name: "list", scope: !1190, file: !528, line: 461, type: !284)
!1194 = !DILocation(line: 461, column: 10, scope: !1190)
!1195 = !DILocalVariable(name: "cmdchars", scope: !1190, file: !528, line: 462, type: !69)
!1196 = !DILocation(line: 462, column: 14, scope: !1190)
!1197 = !DILocalVariable(name: "str", scope: !1190, file: !528, line: 463, type: !74)
!1198 = !DILocation(line: 463, column: 8, scope: !1190)
!1199 = !DILocation(line: 465, column: 13, scope: !1190)
!1200 = !DILocation(line: 465, column: 11, scope: !1190)
!1201 = !DILocation(line: 466, column: 15, scope: !1190)
!1202 = !DILocation(line: 466, column: 26, scope: !1190)
!1203 = !DILocation(line: 466, column: 25, scope: !1190)
!1204 = !DILocation(line: 466, column: 8, scope: !1190)
!1205 = !DILocation(line: 466, column: 32, scope: !1190)
!1206 = !DILocation(line: 466, column: 50, scope: !1207)
!1207 = !DILexicalBlockFile(scope: !1190, file: !528, discriminator: 1)
