; ModuleID = './line370-term-terminfo.o.i'
source_filename = "./line370-term-terminfo.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._TERM_REC = type { void (%struct._TERM_REC*, i32, i32)*, void (%struct._TERM_REC*, i32, i32, i32, i32)*, void (%struct._TERM_REC*, i32)*, void (%struct._TERM_REC*, i32, i32, i32)*, void (%struct._TERM_REC*)*, void (%struct._TERM_REC*)*, void (%struct._TERM_REC*, i8, i32)*, void (%struct._TERM_REC*, i32)*, void (%struct._TERM_REC*, i32)*, void (%struct._TERM_REC*)*, void (%struct._TERM_REC*)*, void (%struct._TERM_REC*)*, void (%struct._TERM_REC*)*, void (%struct._TERM_REC*, i32)*, void (%struct._TERM_REC*, i32)*, void (%struct._TERM_REC*, i32)*, void (%struct._TERM_REC*)*, [1024 x i8], [1024 x i8], %struct._IO_FILE*, %struct._IO_FILE*, %struct.termios, %struct.termios, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8**, i8**, i8*, i8*, i8*, i8*, i32, i32 }
%struct.termios = type { i32, i32, i32, i32, i8, [32 x i8], i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15, globals: !224)
!1 = !DIFile(filename: "line370-term-terminfo.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 51, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!7 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!8 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!9 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!10 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!11 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!12 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!13 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!14 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!15 = !{!16, !17, !19, !25, !214, !218, !222, !24}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !20, line: 85, baseType: !21)
!20 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/irssi/task1")
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DISubroutineType(types: !23)
!23 = !{null, !24}
!24 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "TERM_WINDOW", file: !27, line: 4, baseType: !28)
!27 = !DIFile(filename: "term.h", directory: "/home/lichi/Desktop/irssi/task1")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TERM_WINDOW", file: !29, line: 39, size: 192, align: 64, elements: !30)
!29 = !DIFile(filename: "term-terminfo.c", directory: "/home/lichi/Desktop/irssi/task1")
!30 = !{!31, !210, !211, !212, !213}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "term", scope: !28, file: !29, line: 41, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "TERM_REC", file: !34, line: 24, baseType: !35)
!34 = !DIFile(filename: "terminfo-core.h", directory: "/home/lichi/Desktop/irssi/task1")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TERM_REC", file: !34, line: 26, size: 21504, align: 64, elements: !36)
!36 = !{!37, !41, !45, !49, !53, !57, !58, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !76, !77, !137, !138, !158, !159, !160, !161, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !203, !204, !205, !206, !207, !208, !209}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "move", scope: !35, file: !34, line: 28, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !32, !24, !24}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "move_relative", scope: !35, file: !34, line: 29, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !32, !24, !24, !24, !24}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "set_cursor_visible", scope: !35, file: !34, line: 30, baseType: !46, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !32, !24}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !35, file: !34, line: 31, baseType: !50, size: 64, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !32, !24, !24, !24}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !35, file: !34, line: 33, baseType: !54, size: 64, align: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !32}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "clrtoeol", scope: !35, file: !34, line: 34, baseType: !54, size: 64, align: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !35, file: !34, line: 35, baseType: !59, size: 64, align: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !32, !18, !24}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "set_fg", scope: !35, file: !34, line: 37, baseType: !46, size: 64, align: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "set_bg", scope: !35, file: !34, line: 38, baseType: !46, size: 64, align: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "set_normal", scope: !35, file: !34, line: 39, baseType: !54, size: 64, align: 64, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "set_blink", scope: !35, file: !34, line: 40, baseType: !54, size: 64, align: 64, offset: 640)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "set_bold", scope: !35, file: !34, line: 41, baseType: !54, size: 64, align: 64, offset: 704)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "set_reverse", scope: !35, file: !34, line: 42, baseType: !54, size: 64, align: 64, offset: 768)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "set_uline", scope: !35, file: !34, line: 43, baseType: !46, size: 64, align: 64, offset: 832)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "set_standout", scope: !35, file: !34, line: 44, baseType: !46, size: 64, align: 64, offset: 896)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "set_italic", scope: !35, file: !34, line: 45, baseType: !46, size: 64, align: 64, offset: 960)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "beep", scope: !35, file: !34, line: 47, baseType: !54, size: 64, align: 64, offset: 1024)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "buffer1", scope: !35, file: !34, line: 50, baseType: !73, size: 8192, align: 8, offset: 1088)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8192, align: 8, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 1024)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "buffer2", scope: !35, file: !34, line: 50, baseType: !73, size: 8192, align: 8, offset: 9280)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !35, file: !34, line: 52, baseType: !78, size: 64, align: 64, offset: 17472)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !80, line: 48, baseType: !81)
!80 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/irssi/task1")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !82, line: 241, size: 1728, align: 64, elements: !83)
!82 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/irssi/task1")
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !104, !105, !106, !107, !111, !113, !115, !119, !122, !124, !125, !126, !127, !128, !132, !133}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !81, file: !82, line: 242, baseType: !24, size: 32, align: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !81, file: !82, line: 247, baseType: !17, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !81, file: !82, line: 248, baseType: !17, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !81, file: !82, line: 249, baseType: !17, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !81, file: !82, line: 250, baseType: !17, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !81, file: !82, line: 251, baseType: !17, size: 64, align: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !81, file: !82, line: 252, baseType: !17, size: 64, align: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !81, file: !82, line: 253, baseType: !17, size: 64, align: 64, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !81, file: !82, line: 254, baseType: !17, size: 64, align: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !81, file: !82, line: 256, baseType: !17, size: 64, align: 64, offset: 576)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !81, file: !82, line: 257, baseType: !17, size: 64, align: 64, offset: 640)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !81, file: !82, line: 258, baseType: !17, size: 64, align: 64, offset: 704)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !81, file: !82, line: 260, baseType: !97, size: 64, align: 64, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !82, line: 156, size: 192, align: 64, elements: !99)
!99 = !{!100, !101, !103}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !98, file: !82, line: 157, baseType: !97, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !98, file: !82, line: 158, baseType: !102, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !98, file: !82, line: 162, baseType: !24, size: 32, align: 32, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !81, file: !82, line: 262, baseType: !102, size: 64, align: 64, offset: 832)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !81, file: !82, line: 264, baseType: !24, size: 32, align: 32, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !81, file: !82, line: 268, baseType: !24, size: 32, align: 32, offset: 928)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !81, file: !82, line: 270, baseType: !108, size: 64, align: 64, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !109, line: 131, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!110 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !81, file: !82, line: 274, baseType: !112, size: 16, align: 16, offset: 1024)
!112 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !81, file: !82, line: 275, baseType: !114, size: 8, align: 8, offset: 1040)
!114 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !81, file: !82, line: 276, baseType: !116, size: 8, align: 8, offset: 1048)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, align: 8, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 1)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !81, file: !82, line: 280, baseType: !120, size: 64, align: 64, offset: 1088)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !82, line: 150, baseType: null)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !81, file: !82, line: 289, baseType: !123, size: 64, align: 64, offset: 1152)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !109, line: 132, baseType: !110)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !81, file: !82, line: 297, baseType: !16, size: 64, align: 64, offset: 1216)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !81, file: !82, line: 298, baseType: !16, size: 64, align: 64, offset: 1280)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !81, file: !82, line: 299, baseType: !16, size: 64, align: 64, offset: 1344)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !81, file: !82, line: 300, baseType: !16, size: 64, align: 64, offset: 1408)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !81, file: !82, line: 302, baseType: !129, size: 64, align: 64, offset: 1472)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !130, line: 216, baseType: !131)
!130 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/irssi/task1")
!131 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !81, file: !82, line: 303, baseType: !24, size: 32, align: 32, offset: 1536)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !81, file: !82, line: 305, baseType: !134, size: 160, align: 8, offset: 1568)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, align: 8, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 20)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !35, file: !34, line: 52, baseType: !78, size: 64, align: 64, offset: 17536)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tio", scope: !35, file: !34, line: 53, baseType: !139, size: 480, align: 32, offset: 17600)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "termios", file: !140, line: 28, size: 480, align: 32, elements: !141)
!140 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/termios.h", directory: "/home/lichi/Desktop/irssi/task1")
!141 = !{!142, !145, !146, !147, !148, !151, !155, !157}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "c_iflag", scope: !139, file: !140, line: 30, baseType: !143, size: 32, align: 32)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcflag_t", file: !140, line: 25, baseType: !144)
!144 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "c_oflag", scope: !139, file: !140, line: 31, baseType: !143, size: 32, align: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "c_cflag", scope: !139, file: !140, line: 32, baseType: !143, size: 32, align: 32, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "c_lflag", scope: !139, file: !140, line: 33, baseType: !143, size: 32, align: 32, offset: 96)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "c_line", scope: !139, file: !140, line: 34, baseType: !149, size: 8, align: 8, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "cc_t", file: !140, line: 23, baseType: !150)
!150 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "c_cc", scope: !139, file: !140, line: 35, baseType: !152, size: 256, align: 8, offset: 136)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 256, align: 8, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "c_ispeed", scope: !139, file: !140, line: 36, baseType: !156, size: 32, align: 32, offset: 416)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "speed_t", file: !140, line: 24, baseType: !144)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "c_ospeed", scope: !139, file: !140, line: 37, baseType: !156, size: 32, align: 32, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "old_tio", scope: !35, file: !34, line: 53, baseType: !139, size: 480, align: 32, offset: 18080)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !35, file: !34, line: 56, baseType: !24, size: 32, align: 32, offset: 18560)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !35, file: !34, line: 56, baseType: !24, size: 32, align: 32, offset: 18592)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "TI_smcup", scope: !35, file: !34, line: 59, baseType: !162, size: 64, align: 64, offset: 18624)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "TI_rmcup", scope: !35, file: !34, line: 59, baseType: !162, size: 64, align: 64, offset: 18688)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "TI_cup", scope: !35, file: !34, line: 59, baseType: !162, size: 64, align: 64, offset: 18752)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "TI_hpa", scope: !35, file: !34, line: 60, baseType: !162, size: 64, align: 64, offset: 18816)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "TI_vpa", scope: !35, file: !34, line: 60, baseType: !162, size: 64, align: 64, offset: 18880)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "TI_cub1", scope: !35, file: !34, line: 60, baseType: !162, size: 64, align: 64, offset: 18944)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "TI_cuf1", scope: !35, file: !34, line: 60, baseType: !162, size: 64, align: 64, offset: 19008)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "TI_civis", scope: !35, file: !34, line: 61, baseType: !162, size: 64, align: 64, offset: 19072)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "TI_cnorm", scope: !35, file: !34, line: 61, baseType: !162, size: 64, align: 64, offset: 19136)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "TI_csr", scope: !35, file: !34, line: 64, baseType: !162, size: 64, align: 64, offset: 19200)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "TI_wind", scope: !35, file: !34, line: 64, baseType: !162, size: 64, align: 64, offset: 19264)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "TI_ri", scope: !35, file: !34, line: 65, baseType: !162, size: 64, align: 64, offset: 19328)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "TI_rin", scope: !35, file: !34, line: 65, baseType: !162, size: 64, align: 64, offset: 19392)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "TI_ind", scope: !35, file: !34, line: 65, baseType: !162, size: 64, align: 64, offset: 19456)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "TI_indn", scope: !35, file: !34, line: 65, baseType: !162, size: 64, align: 64, offset: 19520)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "TI_il", scope: !35, file: !34, line: 66, baseType: !162, size: 64, align: 64, offset: 19584)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "TI_il1", scope: !35, file: !34, line: 66, baseType: !162, size: 64, align: 64, offset: 19648)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "TI_dl", scope: !35, file: !34, line: 66, baseType: !162, size: 64, align: 64, offset: 19712)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "TI_dl1", scope: !35, file: !34, line: 66, baseType: !162, size: 64, align: 64, offset: 19776)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "TI_clear", scope: !35, file: !34, line: 69, baseType: !162, size: 64, align: 64, offset: 19840)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "TI_ed", scope: !35, file: !34, line: 69, baseType: !162, size: 64, align: 64, offset: 19904)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "TI_el", scope: !35, file: !34, line: 72, baseType: !162, size: 64, align: 64, offset: 19968)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "TI_rep", scope: !35, file: !34, line: 75, baseType: !162, size: 64, align: 64, offset: 20032)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "TI_colors", scope: !35, file: !34, line: 78, baseType: !24, size: 32, align: 32, offset: 20096)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "TI_sgr0", scope: !35, file: !34, line: 79, baseType: !162, size: 64, align: 64, offset: 20160)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "TI_smul", scope: !35, file: !34, line: 80, baseType: !162, size: 64, align: 64, offset: 20224)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "TI_rmul", scope: !35, file: !34, line: 80, baseType: !162, size: 64, align: 64, offset: 20288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "TI_smso", scope: !35, file: !34, line: 81, baseType: !162, size: 64, align: 64, offset: 20352)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "TI_rmso", scope: !35, file: !34, line: 81, baseType: !162, size: 64, align: 64, offset: 20416)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "TI_sitm", scope: !35, file: !34, line: 82, baseType: !162, size: 64, align: 64, offset: 20480)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "TI_ritm", scope: !35, file: !34, line: 82, baseType: !162, size: 64, align: 64, offset: 20544)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "TI_bold", scope: !35, file: !34, line: 83, baseType: !162, size: 64, align: 64, offset: 20608)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "TI_blink", scope: !35, file: !34, line: 83, baseType: !162, size: 64, align: 64, offset: 20672)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "TI_rev", scope: !35, file: !34, line: 83, baseType: !162, size: 64, align: 64, offset: 20736)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "TI_setaf", scope: !35, file: !34, line: 84, baseType: !162, size: 64, align: 64, offset: 20800)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "TI_setab", scope: !35, file: !34, line: 84, baseType: !162, size: 64, align: 64, offset: 20864)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "TI_setf", scope: !35, file: !34, line: 84, baseType: !162, size: 64, align: 64, offset: 20928)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "TI_setb", scope: !35, file: !34, line: 84, baseType: !162, size: 64, align: 64, offset: 20992)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "TI_fg", scope: !35, file: !34, line: 87, baseType: !202, size: 64, align: 64, offset: 21056)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "TI_bg", scope: !35, file: !34, line: 87, baseType: !202, size: 64, align: 64, offset: 21120)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "TI_normal", scope: !35, file: !34, line: 87, baseType: !17, size: 64, align: 64, offset: 21184)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "TI_bel", scope: !35, file: !34, line: 90, baseType: !17, size: 64, align: 64, offset: 21248)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "TI_smkx", scope: !35, file: !34, line: 93, baseType: !162, size: 64, align: 64, offset: 21312)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "TI_rmkx", scope: !35, file: !34, line: 94, baseType: !162, size: 64, align: 64, offset: 21376)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "appkey_enabled", scope: !35, file: !34, line: 97, baseType: !24, size: 32, align: 32, offset: 21440)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "bracketed_paste_enabled", scope: !35, file: !34, line: 98, baseType: !24, size: 32, align: 32, offset: 21472)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !28, file: !29, line: 44, baseType: !24, size: 32, align: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !28, file: !29, line: 44, baseType: !24, size: 32, align: 32, offset: 96)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !28, file: !29, line: 45, baseType: !24, size: 32, align: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !28, file: !29, line: 45, baseType: !24, size: 32, align: 32, offset: 160)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "gunichar", file: !215, line: 60, baseType: !216)
!215 = !DIFile(filename: "/usr/include/glib-2.0/glib/gunicode.h", directory: "/home/lichi/Desktop/irssi/task1")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !217, line: 45, baseType: !144)
!217 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "guchar", file: !221, line: 52, baseType: !150)
!221 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !221, line: 46, baseType: !18)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !322, !323, !333, !337, !338, !343, !344, !349}
!225 = distinct !DIGlobalVariable(name: "root_window", scope: !0, file: !29, line: 48, type: !25, isLocal: false, isDefinition: true, variable: %struct._TERM_WINDOW** @root_window)
!226 = distinct !DIGlobalVariable(name: "term_lines_empty", scope: !0, file: !29, line: 50, type: !17, isLocal: true, isDefinition: true, variable: i8** @term_lines_empty)
!227 = distinct !DIGlobalVariable(name: "vcmove", scope: !0, file: !29, line: 51, type: !24, isLocal: true, isDefinition: true, variable: i32* @vcmove)
!228 = distinct !DIGlobalVariable(name: "vcx", scope: !0, file: !29, line: 51, type: !24, isLocal: true, isDefinition: true, variable: i32* @vcx)
!229 = distinct !DIGlobalVariable(name: "vcy", scope: !0, file: !29, line: 51, type: !24, isLocal: true, isDefinition: true, variable: i32* @vcy)
!230 = distinct !DIGlobalVariable(name: "curs_visible", scope: !0, file: !29, line: 51, type: !24, isLocal: true, isDefinition: true, variable: i32* @curs_visible)
!231 = distinct !DIGlobalVariable(name: "crealx", scope: !0, file: !29, line: 52, type: !24, isLocal: true, isDefinition: true, variable: i32* @crealx)
!232 = distinct !DIGlobalVariable(name: "crealy", scope: !0, file: !29, line: 52, type: !24, isLocal: true, isDefinition: true, variable: i32* @crealy)
!233 = distinct !DIGlobalVariable(name: "cforcemove", scope: !0, file: !29, line: 52, type: !24, isLocal: true, isDefinition: true, variable: i32* @cforcemove)
!234 = distinct !DIGlobalVariable(name: "curs_x", scope: !0, file: !29, line: 53, type: !24, isLocal: true, isDefinition: true, variable: i32* @curs_x)
!235 = distinct !DIGlobalVariable(name: "curs_y", scope: !0, file: !29, line: 53, type: !24, isLocal: true, isDefinition: true, variable: i32* @curs_y)
!236 = distinct !DIGlobalVariable(name: "last_fg", scope: !0, file: !29, line: 55, type: !144, isLocal: true, isDefinition: true, variable: i32* @last_fg)
!237 = distinct !DIGlobalVariable(name: "last_bg", scope: !0, file: !29, line: 55, type: !144, isLocal: true, isDefinition: true, variable: i32* @last_bg)
!238 = distinct !DIGlobalVariable(name: "last_attrs", scope: !0, file: !29, line: 56, type: !24, isLocal: true, isDefinition: true, variable: i32* @last_attrs)
!239 = distinct !DIGlobalVariable(name: "sigcont_source", scope: !0, file: !29, line: 58, type: !240, isLocal: true, isDefinition: true, variable: %struct._GSource** @sigcont_source)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !242, line: 64, baseType: !243)
!242 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !242, line: 171, size: 768, align: 64, elements: !244)
!244 = !{!245, !247, !269, !298, !300, !304, !305, !306, !307, !315, !316, !317, !318}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !243, file: !242, line: 174, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !221, line: 77, baseType: !16)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !243, file: !242, line: 175, baseType: !248, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !242, line: 77, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !242, line: 196, size: 192, align: 64, elements: !251)
!251 = !{!252, !256, !257}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !250, file: !242, line: 198, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !246}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !250, file: !242, line: 199, baseType: !253, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !250, file: !242, line: 200, baseType: !258, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !246, !240, !261, !268}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !242, line: 155, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!266, !246}
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !221, line: 50, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !221, line: 49, baseType: !24)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !243, file: !242, line: 177, baseType: !270, size: 64, align: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !242, line: 130, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !242, line: 214, size: 384, align: 64, elements: !274)
!274 = !{!275, !280, !284, !288, !292, !293}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !273, file: !242, line: 216, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!266, !240, !279}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !273, file: !242, line: 218, baseType: !281, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!266, !240}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !273, file: !242, line: 219, baseType: !285, size: 64, align: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!266, !240, !262, !246}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !273, file: !242, line: 222, baseType: !289, size: 64, align: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !240}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !273, file: !242, line: 226, baseType: !262, size: 64, align: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !273, file: !242, line: 227, baseType: !294, size: 64, align: 64, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !242, line: 212, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{null}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !243, file: !242, line: 178, baseType: !299, size: 32, align: 32, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !221, line: 55, baseType: !144)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !243, file: !242, line: 180, baseType: !301, size: 64, align: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !242, line: 48, baseType: !303)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !242, line: 48, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !243, file: !242, line: 182, baseType: !267, size: 32, align: 32, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !243, file: !242, line: 183, baseType: !299, size: 32, align: 32, offset: 352)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !243, file: !242, line: 184, baseType: !299, size: 32, align: 32, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !243, file: !242, line: 186, baseType: !308, size: 64, align: 64, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !310, line: 37, baseType: !311)
!310 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !310, line: 39, size: 128, align: 64, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !311, file: !310, line: 41, baseType: !246, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !311, file: !310, line: 42, baseType: !308, size: 64, align: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !243, file: !242, line: 188, baseType: !240, size: 64, align: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !242, line: 189, baseType: !240, size: 64, align: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !243, file: !242, line: 191, baseType: !17, size: 64, align: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !243, file: !242, line: 193, baseType: !319, size: 64, align: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !242, line: 65, baseType: !321)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !242, line: 65, flags: DIFlagFwdDecl)
!322 = distinct !DIGlobalVariable(name: "freeze_counter", scope: !0, file: !29, line: 60, type: !24, isLocal: true, isDefinition: true, variable: i32* @freeze_counter)
!323 = distinct !DIGlobalVariable(name: "input_func", scope: !0, file: !29, line: 62, type: !324, isLocal: true, isDefinition: true, variable: i32 (i8*, i32, i32*)** @input_func)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "TERM_INPUT_FUNC", file: !29, line: 36, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!24, !328, !24, !330}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "unichar", file: !332, line: 12, baseType: !216)
!332 = !DIFile(filename: "../../src/core/utf8.h", directory: "/home/lichi/Desktop/irssi/task1")
!333 = distinct !DIGlobalVariable(name: "term_inbuf", scope: !0, file: !29, line: 63, type: !334, isLocal: true, isDefinition: true, variable: [256 x i8]* @term_inbuf)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 2048, align: 8, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 256)
!337 = distinct !DIGlobalVariable(name: "term_inbuf_pos", scope: !0, file: !29, line: 64, type: !24, isLocal: true, isDefinition: true, variable: i32* @term_inbuf_pos)
!338 = distinct !DIGlobalVariable(name: "got_sigcont", scope: !0, file: !29, line: 59, type: !339, isLocal: true, isDefinition: true, variable: i32* @got_sigcont)
!339 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !20, line: 40, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !342, line: 22, baseType: !24)
!342 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "/home/lichi/Desktop/irssi/task1")
!343 = distinct !DIGlobalVariable(name: "sigcont_funcs", scope: !0, file: !29, line: 100, type: !272, isLocal: true, isDefinition: true, variable: %struct._GSourceFuncs* @sigcont_funcs)
!344 = distinct !DIGlobalVariable(name: "buf", scope: !345, file: !29, line: 322, type: !134, isLocal: true, isDefinition: true, variable: [20 x i8]* @termctl_set_color_24bit.buf)
!345 = distinct !DISubprogram(name: "termctl_set_color_24bit", scope: !29, file: !29, line: 320, type: !346, isLocal: true, isDefinition: true, scopeLine: 321, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!346 = !DISubroutineType(types: !347)
!347 = !{!24, !24, !144}
!348 = !{}
!349 = distinct !DIGlobalVariable(name: "term_env_warning", scope: !0, file: !29, line: 769, type: !162, isLocal: true, isDefinition: true, variable: i8** @term_env_warning)
!350 = !{i32 2, !"Dwarf Version", i32 4}
!351 = !{i32 2, !"Debug Info Version", i32 3}
!352 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!353 = distinct !DISubprogram(name: "term_init", scope: !29, file: !29, line: 117, type: !354, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!354 = !DISubroutineType(types: !355)
!355 = !{!24}
!356 = !DILocalVariable(name: "act", scope: !353, file: !29, line: 119, type: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !358, line: 24, size: 1216, align: 64, elements: !359)
!358 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "/home/lichi/Desktop/irssi/task1")
!359 = !{!360, !439, !447, !448}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !357, file: !358, line: 35, baseType: !361, size: 64, align: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !357, file: !358, line: 28, size: 64, align: 64, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !361, file: !358, line: 31, baseType: !19, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !361, file: !358, line: 33, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{null, !24, !368, !16}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !370, line: 133, baseType: !371)
!370 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/siginfo.h", directory: "/home/lichi/Desktop/irssi/task1")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !370, line: 62, size: 1024, align: 64, elements: !372)
!372 = !{!373, !374, !375, !376}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !371, file: !370, line: 64, baseType: !24, size: 32, align: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !371, file: !370, line: 65, baseType: !24, size: 32, align: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !371, file: !370, line: 67, baseType: !24, size: 32, align: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !371, file: !370, line: 132, baseType: !377, size: 896, align: 64, offset: 128)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !371, file: !370, line: 69, size: 896, align: 64, elements: !378)
!378 = !{!379, !383, !390, !401, !407, !417, !428, !433}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !377, file: !370, line: 71, baseType: !380, size: 896, align: 32)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 896, align: 32, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 28)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !377, file: !370, line: 78, baseType: !384, size: 64, align: 32)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !370, line: 74, size: 64, align: 32, elements: !385)
!385 = !{!386, !388}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !384, file: !370, line: 76, baseType: !387, size: 32, align: 32)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !109, line: 133, baseType: !24)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !384, file: !370, line: 77, baseType: !389, size: 32, align: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !109, line: 125, baseType: !144)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !377, file: !370, line: 86, baseType: !391, size: 128, align: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !370, line: 81, size: 128, align: 64, elements: !392)
!392 = !{!393, !394, !395}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !391, file: !370, line: 83, baseType: !24, size: 32, align: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !391, file: !370, line: 84, baseType: !24, size: 32, align: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !391, file: !370, line: 85, baseType: !396, size: 64, align: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !370, line: 36, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !370, line: 32, size: 64, align: 64, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !397, file: !370, line: 34, baseType: !24, size: 32, align: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !397, file: !370, line: 35, baseType: !16, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !377, file: !370, line: 94, baseType: !402, size: 128, align: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !370, line: 89, size: 128, align: 64, elements: !403)
!403 = !{!404, !405, !406}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !402, file: !370, line: 91, baseType: !387, size: 32, align: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !402, file: !370, line: 92, baseType: !389, size: 32, align: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !402, file: !370, line: 93, baseType: !396, size: 64, align: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !377, file: !370, line: 104, baseType: !408, size: 256, align: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !370, line: 97, size: 256, align: 64, elements: !409)
!409 = !{!410, !411, !412, !413, !416}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !408, file: !370, line: 99, baseType: !387, size: 32, align: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !408, file: !370, line: 100, baseType: !389, size: 32, align: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !408, file: !370, line: 101, baseType: !24, size: 32, align: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !408, file: !370, line: 102, baseType: !414, size: 64, align: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !370, line: 58, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !109, line: 135, baseType: !110)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !408, file: !370, line: 103, baseType: !414, size: 64, align: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !377, file: !370, line: 116, baseType: !418, size: 256, align: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !370, line: 107, size: 256, align: 64, elements: !419)
!419 = !{!420, !421, !423}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !418, file: !370, line: 109, baseType: !16, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !418, file: !370, line: 110, baseType: !422, size: 16, align: 16, offset: 64)
!422 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_bnd", scope: !418, file: !370, line: 115, baseType: !424, size: 128, align: 64, offset: 128)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !418, file: !370, line: 111, size: 128, align: 64, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !424, file: !370, line: 113, baseType: !16, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !424, file: !370, line: 114, baseType: !16, size: 64, align: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !377, file: !370, line: 123, baseType: !429, size: 128, align: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !370, line: 119, size: 128, align: 64, elements: !430)
!430 = !{!431, !432}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !429, file: !370, line: 121, baseType: !110, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !429, file: !370, line: 122, baseType: !24, size: 32, align: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !377, file: !370, line: 131, baseType: !434, size: 128, align: 64)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !370, line: 126, size: 128, align: 64, elements: !435)
!435 = !{!436, !437, !438}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !434, file: !370, line: 128, baseType: !16, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !434, file: !370, line: 129, baseType: !24, size: 32, align: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !434, file: !370, line: 130, baseType: !144, size: 32, align: 32, offset: 96)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !357, file: !358, line: 43, baseType: !440, size: 1024, align: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !342, line: 30, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !342, line: 27, size: 1024, align: 64, elements: !442)
!442 = !{!443}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !441, file: !342, line: 29, baseType: !444, size: 1024, align: 64)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 1024, align: 64, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 16)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !357, file: !358, line: 46, baseType: !24, size: 32, align: 32, offset: 1088)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !357, file: !358, line: 49, baseType: !295, size: 64, align: 64, offset: 1152)
!449 = !DIExpression()
!450 = !DILocation(line: 119, column: 19, scope: !353)
!451 = !DILocalVariable(name: "width", scope: !353, file: !29, line: 120, type: !24)
!452 = !DILocation(line: 120, column: 13, scope: !353)
!453 = !DILocalVariable(name: "height", scope: !353, file: !29, line: 120, type: !24)
!454 = !DILocation(line: 120, column: 20, scope: !353)
!455 = !DILocation(line: 122, column: 20, scope: !353)
!456 = !DILocation(line: 122, column: 10, scope: !353)
!457 = !DILocation(line: 123, column: 13, scope: !353)
!458 = !DILocation(line: 124, column: 12, scope: !353)
!459 = !DILocation(line: 124, column: 6, scope: !353)
!460 = !DILocation(line: 124, column: 33, scope: !353)
!461 = !DILocation(line: 124, column: 24, scope: !353)
!462 = !DILocation(line: 125, column: 9, scope: !353)
!463 = !DILocation(line: 125, column: 27, scope: !353)
!464 = !DILocation(line: 126, column: 22, scope: !353)
!465 = !DILocation(line: 128, column: 35, scope: !353)
!466 = !DILocation(line: 128, column: 42, scope: !353)
!467 = !DILocation(line: 128, column: 17, scope: !353)
!468 = !DILocation(line: 128, column: 15, scope: !353)
!469 = !DILocation(line: 129, column: 6, scope: !470)
!470 = distinct !DILexicalBlock(scope: !353, file: !29, line: 129, column: 6)
!471 = !DILocation(line: 129, column: 19, scope: !470)
!472 = !DILocation(line: 129, column: 6, scope: !353)
!473 = !DILocation(line: 130, column: 3, scope: !470)
!474 = !DILocation(line: 132, column: 6, scope: !475)
!475 = distinct !DILexicalBlock(scope: !353, file: !29, line: 132, column: 6)
!476 = !DILocation(line: 132, column: 6, scope: !353)
!477 = !DILocation(line: 133, column: 39, scope: !478)
!478 = distinct !DILexicalBlock(scope: !475, file: !29, line: 132, column: 38)
!479 = !DILocation(line: 133, column: 17, scope: !478)
!480 = !DILocation(line: 133, column: 31, scope: !478)
!481 = !DILocation(line: 133, column: 37, scope: !478)
!482 = !DILocation(line: 134, column: 40, scope: !478)
!483 = !DILocation(line: 134, column: 17, scope: !478)
!484 = !DILocation(line: 134, column: 31, scope: !478)
!485 = !DILocation(line: 134, column: 38, scope: !478)
!486 = !DILocation(line: 135, column: 2, scope: !478)
!487 = !DILocation(line: 138, column: 19, scope: !353)
!488 = !DILocation(line: 138, column: 2, scope: !353)
!489 = !DILocation(line: 139, column: 6, scope: !353)
!490 = !DILocation(line: 139, column: 15, scope: !353)
!491 = !DILocation(line: 140, column: 5, scope: !353)
!492 = !DILocation(line: 140, column: 25, scope: !353)
!493 = !DILocation(line: 140, column: 16, scope: !353)
!494 = !DILocation(line: 141, column: 2, scope: !353)
!495 = !DILocation(line: 142, column: 19, scope: !353)
!496 = !DILocation(line: 142, column: 17, scope: !353)
!497 = !DILocation(line: 143, column: 24, scope: !353)
!498 = !DILocation(line: 143, column: 2, scope: !353)
!499 = !DILocation(line: 144, column: 18, scope: !353)
!500 = !DILocation(line: 144, column: 2, scope: !353)
!501 = !DILocation(line: 146, column: 18, scope: !353)
!502 = !DILocation(line: 146, column: 9, scope: !353)
!503 = !DILocation(line: 147, column: 15, scope: !353)
!504 = !DILocation(line: 147, column: 29, scope: !353)
!505 = !DILocation(line: 147, column: 13, scope: !353)
!506 = !DILocation(line: 148, column: 16, scope: !353)
!507 = !DILocation(line: 148, column: 30, scope: !353)
!508 = !DILocation(line: 148, column: 14, scope: !353)
!509 = !DILocation(line: 149, column: 41, scope: !353)
!510 = !DILocation(line: 149, column: 53, scope: !353)
!511 = !DILocation(line: 149, column: 16, scope: !353)
!512 = !DILocation(line: 149, column: 14, scope: !353)
!513 = !DILocation(line: 151, column: 52, scope: !353)
!514 = !DILocation(line: 151, column: 51, scope: !353)
!515 = !DILocation(line: 151, column: 38, scope: !353)
!516 = !DILocation(line: 151, column: 26, scope: !353)
!517 = !DILocation(line: 153, column: 9, scope: !353)
!518 = !DILocation(line: 154, column: 2, scope: !353)
!519 = !DILocation(line: 155, column: 2, scope: !353)
!520 = !DILocation(line: 156, column: 9, scope: !353)
!521 = !DILocation(line: 157, column: 1, scope: !353)
!522 = distinct !DISubprogram(name: "sig_cont", scope: !29, file: !29, line: 67, type: !22, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!523 = !DILocalVariable(name: "p", arg: 1, scope: !522, file: !29, line: 67, type: !24)
!524 = !DILocation(line: 67, column: 26, scope: !522)
!525 = !DILocation(line: 69, column: 21, scope: !522)
!526 = !DILocation(line: 70, column: 1, scope: !522)
!527 = distinct !DISubprogram(name: "do_redraw", scope: !29, file: !29, line: 92, type: !264, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!528 = !DILocalVariable(name: "unused", arg: 1, scope: !527, file: !29, line: 92, type: !246)
!529 = !DILocation(line: 92, column: 36, scope: !527)
!530 = !DILocation(line: 94, column: 16, scope: !527)
!531 = !DILocation(line: 94, column: 2, scope: !527)
!532 = !DILocation(line: 95, column: 2, scope: !527)
!533 = !DILocation(line: 97, column: 9, scope: !527)
!534 = distinct !DISubprogram(name: "term_window_create", scope: !29, file: !29, line: 256, type: !535, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!535 = !DISubroutineType(types: !536)
!536 = !{!25, !24, !24, !24, !24}
!537 = !DILocalVariable(name: "x", arg: 1, scope: !534, file: !29, line: 256, type: !24)
!538 = !DILocation(line: 256, column: 37, scope: !534)
!539 = !DILocalVariable(name: "y", arg: 2, scope: !534, file: !29, line: 256, type: !24)
!540 = !DILocation(line: 256, column: 44, scope: !534)
!541 = !DILocalVariable(name: "width", arg: 3, scope: !534, file: !29, line: 256, type: !24)
!542 = !DILocation(line: 256, column: 51, scope: !534)
!543 = !DILocalVariable(name: "height", arg: 4, scope: !534, file: !29, line: 256, type: !24)
!544 = !DILocation(line: 256, column: 62, scope: !534)
!545 = !DILocalVariable(name: "window", scope: !534, file: !29, line: 258, type: !25)
!546 = !DILocation(line: 258, column: 15, scope: !534)
!547 = !DILocation(line: 260, column: 28, scope: !534)
!548 = !DILocation(line: 260, column: 12, scope: !534)
!549 = !DILocation(line: 260, column: 9, scope: !534)
!550 = !DILocation(line: 261, column: 24, scope: !534)
!551 = !DILocation(line: 261, column: 9, scope: !534)
!552 = !DILocation(line: 261, column: 17, scope: !534)
!553 = !DILocation(line: 261, column: 22, scope: !534)
!554 = !DILocation(line: 262, column: 14, scope: !534)
!555 = !DILocation(line: 262, column: 2, scope: !534)
!556 = !DILocation(line: 262, column: 10, scope: !534)
!557 = !DILocation(line: 262, column: 12, scope: !534)
!558 = !DILocation(line: 262, column: 29, scope: !534)
!559 = !DILocation(line: 262, column: 17, scope: !534)
!560 = !DILocation(line: 262, column: 25, scope: !534)
!561 = !DILocation(line: 262, column: 27, scope: !534)
!562 = !DILocation(line: 263, column: 18, scope: !534)
!563 = !DILocation(line: 263, column: 2, scope: !534)
!564 = !DILocation(line: 263, column: 10, scope: !534)
!565 = !DILocation(line: 263, column: 16, scope: !534)
!566 = !DILocation(line: 263, column: 42, scope: !534)
!567 = !DILocation(line: 263, column: 25, scope: !534)
!568 = !DILocation(line: 263, column: 33, scope: !534)
!569 = !DILocation(line: 263, column: 40, scope: !534)
!570 = !DILocation(line: 264, column: 16, scope: !534)
!571 = !DILocation(line: 264, column: 9, scope: !534)
!572 = distinct !DISubprogram(name: "term_set_input_type", scope: !29, file: !29, line: 714, type: !22, isLocal: false, isDefinition: true, scopeLine: 715, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!573 = !DILocalVariable(name: "type", arg: 1, scope: !572, file: !29, line: 714, type: !24)
!574 = !DILocation(line: 714, column: 30, scope: !572)
!575 = !DILocation(line: 716, column: 10, scope: !572)
!576 = !DILocation(line: 716, column: 2, scope: !572)
!577 = !DILocation(line: 718, column: 28, scope: !578)
!578 = distinct !DILexicalBlock(scope: !572, file: !29, line: 716, column: 16)
!579 = !DILocation(line: 719, column: 17, scope: !578)
!580 = !DILocation(line: 721, column: 28, scope: !578)
!581 = !DILocation(line: 722, column: 3, scope: !578)
!582 = !DILocation(line: 724, column: 28, scope: !578)
!583 = !DILocation(line: 725, column: 2, scope: !578)
!584 = !DILocation(line: 726, column: 1, scope: !572)
!585 = distinct !DISubprogram(name: "term_atexit", scope: !29, file: !29, line: 106, type: !296, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!586 = !DILocation(line: 108, column: 7, scope: !587)
!587 = distinct !DILexicalBlock(scope: !585, file: !29, line: 108, column: 6)
!588 = !DILocation(line: 108, column: 16, scope: !587)
!589 = !DILocation(line: 108, column: 19, scope: !590)
!590 = !DILexicalBlockFile(scope: !587, file: !29, discriminator: 1)
!591 = !DILocation(line: 108, column: 32, scope: !590)
!592 = !DILocation(line: 108, column: 35, scope: !593)
!593 = !DILexicalBlockFile(scope: !587, file: !29, discriminator: 2)
!594 = !DILocation(line: 108, column: 49, scope: !593)
!595 = !DILocation(line: 108, column: 6, scope: !593)
!596 = !DILocation(line: 111, column: 3, scope: !597)
!597 = distinct !DILexicalBlock(scope: !587, file: !29, line: 108, column: 59)
!598 = !DILocation(line: 111, column: 17, scope: !597)
!599 = !DILocation(line: 111, column: 26, scope: !597)
!600 = !DILocation(line: 112, column: 2, scope: !597)
!601 = !DILocation(line: 114, column: 2, scope: !585)
!602 = !DILocation(line: 115, column: 1, scope: !585)
!603 = distinct !DISubprogram(name: "term_deinit", scope: !29, file: !29, line: 159, type: !296, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!604 = !DILocation(line: 161, column: 6, scope: !605)
!605 = distinct !DILexicalBlock(scope: !603, file: !29, line: 161, column: 6)
!606 = !DILocation(line: 161, column: 19, scope: !605)
!607 = !DILocation(line: 161, column: 6, scope: !603)
!608 = !DILocation(line: 162, column: 3, scope: !609)
!609 = distinct !DILexicalBlock(scope: !605, file: !29, line: 161, column: 27)
!610 = !DILocation(line: 163, column: 20, scope: !609)
!611 = !DILocation(line: 163, column: 3, scope: !609)
!612 = !DILocation(line: 164, column: 18, scope: !609)
!613 = !DILocation(line: 164, column: 3, scope: !609)
!614 = !DILocation(line: 166, column: 3, scope: !609)
!615 = !DILocation(line: 167, column: 24, scope: !609)
!616 = !DILocation(line: 167, column: 3, scope: !609)
!617 = !DILocation(line: 168, column: 16, scope: !609)
!618 = !DILocation(line: 169, column: 2, scope: !609)
!619 = !DILocation(line: 170, column: 1, scope: !603)
!620 = distinct !DISubprogram(name: "term_resize", scope: !29, file: !29, line: 204, type: !621, isLocal: false, isDefinition: true, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !24, !24}
!623 = !DILocalVariable(name: "width", arg: 1, scope: !620, file: !29, line: 204, type: !24)
!624 = !DILocation(line: 204, column: 22, scope: !620)
!625 = !DILocalVariable(name: "height", arg: 2, scope: !620, file: !29, line: 204, type: !24)
!626 = !DILocation(line: 204, column: 33, scope: !620)
!627 = !DILocation(line: 206, column: 6, scope: !628)
!628 = distinct !DILexicalBlock(scope: !620, file: !29, line: 206, column: 6)
!629 = !DILocation(line: 206, column: 12, scope: !628)
!630 = !DILocation(line: 206, column: 16, scope: !628)
!631 = !DILocation(line: 206, column: 19, scope: !632)
!632 = !DILexicalBlockFile(scope: !628, file: !29, discriminator: 1)
!633 = !DILocation(line: 206, column: 26, scope: !632)
!634 = !DILocation(line: 206, column: 6, scope: !632)
!635 = !DILocation(line: 207, column: 11, scope: !636)
!636 = distinct !DILexicalBlock(scope: !628, file: !29, line: 206, column: 31)
!637 = !DILocation(line: 207, column: 25, scope: !636)
!638 = !DILocation(line: 207, column: 9, scope: !636)
!639 = !DILocation(line: 208, column: 26, scope: !636)
!640 = !DILocation(line: 208, column: 40, scope: !636)
!641 = !DILocation(line: 208, column: 24, scope: !636)
!642 = !DILocation(line: 209, column: 2, scope: !636)
!643 = !DILocation(line: 211, column: 6, scope: !644)
!644 = distinct !DILexicalBlock(scope: !620, file: !29, line: 211, column: 6)
!645 = !DILocation(line: 211, column: 20, scope: !644)
!646 = !DILocation(line: 211, column: 17, scope: !644)
!647 = !DILocation(line: 211, column: 26, scope: !644)
!648 = !DILocation(line: 211, column: 29, scope: !649)
!649 = !DILexicalBlockFile(scope: !644, file: !29, discriminator: 1)
!650 = !DILocation(line: 211, column: 44, scope: !649)
!651 = !DILocation(line: 211, column: 41, scope: !649)
!652 = !DILocation(line: 211, column: 6, scope: !649)
!653 = !DILocation(line: 212, column: 38, scope: !654)
!654 = distinct !DILexicalBlock(scope: !644, file: !29, line: 211, column: 52)
!655 = !DILocation(line: 212, column: 16, scope: !654)
!656 = !DILocation(line: 212, column: 30, scope: !654)
!657 = !DILocation(line: 212, column: 36, scope: !654)
!658 = !DILocation(line: 212, column: 14, scope: !654)
!659 = !DILocation(line: 213, column: 40, scope: !654)
!660 = !DILocation(line: 213, column: 17, scope: !654)
!661 = !DILocation(line: 213, column: 31, scope: !654)
!662 = !DILocation(line: 213, column: 38, scope: !654)
!663 = !DILocation(line: 213, column: 15, scope: !654)
!664 = !DILocation(line: 214, column: 20, scope: !654)
!665 = !DILocation(line: 214, column: 39, scope: !654)
!666 = !DILocation(line: 214, column: 51, scope: !654)
!667 = !DILocation(line: 214, column: 3, scope: !654)
!668 = !DILocation(line: 216, column: 24, scope: !654)
!669 = !DILocation(line: 216, column: 17, scope: !654)
!670 = !DILocation(line: 217, column: 46, scope: !654)
!671 = !DILocation(line: 217, column: 45, scope: !654)
!672 = !DILocation(line: 217, column: 32, scope: !654)
!673 = !DILocation(line: 217, column: 20, scope: !654)
!674 = !DILocation(line: 218, column: 2, scope: !654)
!675 = !DILocation(line: 220, column: 9, scope: !620)
!676 = !DILocation(line: 221, column: 1, scope: !620)
!677 = distinct !DISubprogram(name: "term_window_move", scope: !29, file: !29, line: 274, type: !678, isLocal: false, isDefinition: true, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !25, !24, !24, !24, !24}
!680 = !DILocalVariable(name: "window", arg: 1, scope: !677, file: !29, line: 274, type: !25)
!681 = !DILocation(line: 274, column: 36, scope: !677)
!682 = !DILocalVariable(name: "x", arg: 2, scope: !677, file: !29, line: 274, type: !24)
!683 = !DILocation(line: 274, column: 48, scope: !677)
!684 = !DILocalVariable(name: "y", arg: 3, scope: !677, file: !29, line: 274, type: !24)
!685 = !DILocation(line: 274, column: 55, scope: !677)
!686 = !DILocalVariable(name: "width", arg: 4, scope: !677, file: !29, line: 275, type: !24)
!687 = !DILocation(line: 275, column: 13, scope: !677)
!688 = !DILocalVariable(name: "height", arg: 5, scope: !677, file: !29, line: 275, type: !24)
!689 = !DILocation(line: 275, column: 24, scope: !677)
!690 = !DILocation(line: 277, column: 14, scope: !677)
!691 = !DILocation(line: 277, column: 2, scope: !677)
!692 = !DILocation(line: 277, column: 10, scope: !677)
!693 = !DILocation(line: 277, column: 12, scope: !677)
!694 = !DILocation(line: 278, column: 14, scope: !677)
!695 = !DILocation(line: 278, column: 2, scope: !677)
!696 = !DILocation(line: 278, column: 10, scope: !677)
!697 = !DILocation(line: 278, column: 12, scope: !677)
!698 = !DILocation(line: 279, column: 18, scope: !677)
!699 = !DILocation(line: 279, column: 2, scope: !677)
!700 = !DILocation(line: 279, column: 10, scope: !677)
!701 = !DILocation(line: 279, column: 16, scope: !677)
!702 = !DILocation(line: 280, column: 26, scope: !677)
!703 = !DILocation(line: 280, column: 9, scope: !677)
!704 = !DILocation(line: 280, column: 17, scope: !677)
!705 = !DILocation(line: 280, column: 24, scope: !677)
!706 = !DILocation(line: 281, column: 1, scope: !677)
!707 = distinct !DISubprogram(name: "term_move_reset", scope: !29, file: !29, line: 192, type: !621, isLocal: true, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!708 = !DILocalVariable(name: "x", arg: 1, scope: !707, file: !29, line: 192, type: !24)
!709 = !DILocation(line: 192, column: 33, scope: !707)
!710 = !DILocalVariable(name: "y", arg: 2, scope: !707, file: !29, line: 192, type: !24)
!711 = !DILocation(line: 192, column: 40, scope: !707)
!712 = !DILocation(line: 194, column: 6, scope: !713)
!713 = distinct !DILexicalBlock(scope: !707, file: !29, line: 194, column: 6)
!714 = !DILocation(line: 194, column: 11, scope: !713)
!715 = !DILocation(line: 194, column: 8, scope: !713)
!716 = !DILocation(line: 194, column: 6, scope: !707)
!717 = !DILocation(line: 194, column: 27, scope: !718)
!718 = !DILexicalBlockFile(scope: !713, file: !29, discriminator: 1)
!719 = !DILocation(line: 194, column: 37, scope: !718)
!720 = !DILocation(line: 194, column: 25, scope: !718)
!721 = !DILocation(line: 194, column: 23, scope: !718)
!722 = !DILocation(line: 195, column: 6, scope: !723)
!723 = distinct !DILexicalBlock(scope: !707, file: !29, line: 195, column: 6)
!724 = !DILocation(line: 195, column: 11, scope: !723)
!725 = !DILocation(line: 195, column: 8, scope: !723)
!726 = !DILocation(line: 195, column: 6, scope: !707)
!727 = !DILocation(line: 195, column: 28, scope: !728)
!728 = !DILexicalBlockFile(scope: !723, file: !29, discriminator: 1)
!729 = !DILocation(line: 195, column: 39, scope: !728)
!730 = !DILocation(line: 195, column: 26, scope: !728)
!731 = !DILocation(line: 195, column: 24, scope: !728)
!732 = !DILocation(line: 197, column: 8, scope: !707)
!733 = !DILocation(line: 197, column: 6, scope: !707)
!734 = !DILocation(line: 197, column: 17, scope: !707)
!735 = !DILocation(line: 197, column: 15, scope: !707)
!736 = !DILocation(line: 198, column: 20, scope: !707)
!737 = !DILocation(line: 199, column: 9, scope: !707)
!738 = !DILocation(line: 200, column: 1, scope: !707)
!739 = distinct !DISubprogram(name: "term_resize_final", scope: !29, file: !29, line: 223, type: !621, isLocal: false, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!740 = !DILocalVariable(name: "width", arg: 1, scope: !739, file: !29, line: 223, type: !24)
!741 = !DILocation(line: 223, column: 28, scope: !739)
!742 = !DILocalVariable(name: "height", arg: 2, scope: !739, file: !29, line: 223, type: !24)
!743 = !DILocation(line: 223, column: 39, scope: !739)
!744 = !DILocation(line: 225, column: 1, scope: !739)
!745 = distinct !DISubprogram(name: "term_has_colors", scope: !29, file: !29, line: 228, type: !354, isLocal: false, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!746 = !DILocation(line: 230, column: 16, scope: !745)
!747 = !DILocation(line: 230, column: 30, scope: !745)
!748 = !DILocation(line: 230, column: 40, scope: !745)
!749 = !DILocation(line: 230, column: 9, scope: !745)
!750 = distinct !DISubprogram(name: "term_force_colors", scope: !29, file: !29, line: 234, type: !22, isLocal: false, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!751 = !DILocalVariable(name: "set", arg: 1, scope: !750, file: !29, line: 234, type: !24)
!752 = !DILocation(line: 234, column: 28, scope: !750)
!753 = !DILocation(line: 236, column: 24, scope: !750)
!754 = !DILocation(line: 236, column: 38, scope: !750)
!755 = !DILocation(line: 236, column: 2, scope: !750)
!756 = !DILocation(line: 237, column: 1, scope: !750)
!757 = distinct !DISubprogram(name: "term_clear", scope: !29, file: !29, line: 240, type: !296, isLocal: false, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!758 = !DILocation(line: 242, column: 24, scope: !757)
!759 = !DILocation(line: 242, column: 9, scope: !757)
!760 = !DILocation(line: 243, column: 2, scope: !757)
!761 = !DILocation(line: 243, column: 16, scope: !757)
!762 = !DILocation(line: 243, column: 22, scope: !757)
!763 = !DILocation(line: 244, column: 9, scope: !757)
!764 = !DILocation(line: 246, column: 9, scope: !757)
!765 = !DILocation(line: 246, column: 30, scope: !757)
!766 = !DILocation(line: 246, column: 2, scope: !757)
!767 = !DILocation(line: 247, column: 1, scope: !757)
!768 = distinct !DISubprogram(name: "term_set_color", scope: !29, file: !29, line: 345, type: !769, isLocal: false, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !25, !24}
!771 = !DILocalVariable(name: "window", arg: 1, scope: !768, file: !29, line: 345, type: !25)
!772 = !DILocation(line: 345, column: 34, scope: !768)
!773 = !DILocalVariable(name: "col", arg: 2, scope: !768, file: !29, line: 345, type: !24)
!774 = !DILocation(line: 345, column: 46, scope: !768)
!775 = !DILocalVariable(name: "set_normal", scope: !768, file: !29, line: 348, type: !24)
!776 = !DILocation(line: 348, column: 6, scope: !768)
!777 = !DILocalVariable(name: "fg", scope: !768, file: !29, line: 350, type: !144)
!778 = !DILocation(line: 350, column: 15, scope: !768)
!779 = !DILocalVariable(name: "bg", scope: !768, file: !29, line: 350, type: !144)
!780 = !DILocation(line: 350, column: 19, scope: !768)
!781 = !DILocation(line: 359, column: 9, scope: !768)
!782 = !DILocation(line: 359, column: 13, scope: !768)
!783 = !DILocation(line: 359, column: 6, scope: !768)
!784 = !DILocation(line: 369, column: 10, scope: !768)
!785 = !DILocation(line: 369, column: 14, scope: !768)
!786 = !DILocation(line: 369, column: 28, scope: !768)
!787 = !DILocation(line: 369, column: 6, scope: !768)
!788 = !DILocation(line: 371, column: 7, scope: !789)
!789 = distinct !DILexicalBlock(scope: !768, file: !29, line: 371, column: 6)
!790 = !DILocation(line: 371, column: 23, scope: !789)
!791 = !DILocation(line: 371, column: 26, scope: !792)
!792 = !DILexicalBlockFile(scope: !789, file: !29, discriminator: 1)
!793 = !DILocation(line: 371, column: 29, scope: !792)
!794 = !DILocation(line: 371, column: 6, scope: !792)
!795 = !DILocation(line: 372, column: 7, scope: !789)
!796 = !DILocation(line: 372, column: 3, scope: !789)
!797 = !DILocation(line: 374, column: 24, scope: !768)
!798 = !DILocation(line: 374, column: 28, scope: !768)
!799 = !DILocation(line: 374, column: 44, scope: !768)
!800 = !DILocation(line: 374, column: 47, scope: !801)
!801 = !DILexicalBlockFile(scope: !768, file: !29, discriminator: 1)
!802 = !DILocation(line: 374, column: 55, scope: !801)
!803 = !DILocation(line: 374, column: 70, scope: !801)
!804 = !DILocation(line: 375, column: 5, scope: !768)
!805 = !DILocation(line: 375, column: 9, scope: !768)
!806 = !DILocation(line: 375, column: 25, scope: !768)
!807 = !DILocation(line: 375, column: 28, scope: !801)
!808 = !DILocation(line: 375, column: 36, scope: !801)
!809 = !DILocation(line: 374, column: 70, scope: !810)
!810 = !DILexicalBlockFile(scope: !768, file: !29, discriminator: 2)
!811 = !DILocation(line: 374, column: 70, scope: !812)
!812 = !DILexicalBlockFile(scope: !768, file: !29, discriminator: 3)
!813 = !DILocation(line: 374, column: 20, scope: !812)
!814 = !DILocation(line: 376, column: 8, scope: !815)
!815 = distinct !DILexicalBlock(scope: !768, file: !29, line: 376, column: 6)
!816 = !DILocation(line: 376, column: 19, scope: !815)
!817 = !DILocation(line: 376, column: 35, scope: !815)
!818 = !DILocation(line: 376, column: 39, scope: !819)
!819 = !DILexicalBlockFile(scope: !815, file: !29, discriminator: 1)
!820 = !DILocation(line: 376, column: 43, scope: !819)
!821 = !DILocation(line: 376, column: 59, scope: !819)
!822 = !DILocation(line: 376, column: 65, scope: !819)
!823 = !DILocation(line: 377, column: 8, scope: !815)
!824 = !DILocation(line: 377, column: 19, scope: !815)
!825 = !DILocation(line: 377, column: 35, scope: !815)
!826 = !DILocation(line: 377, column: 39, scope: !819)
!827 = !DILocation(line: 377, column: 43, scope: !819)
!828 = !DILocation(line: 377, column: 59, scope: !819)
!829 = !DILocation(line: 377, column: 65, scope: !819)
!830 = !DILocation(line: 378, column: 8, scope: !815)
!831 = !DILocation(line: 378, column: 19, scope: !815)
!832 = !DILocation(line: 378, column: 35, scope: !815)
!833 = !DILocation(line: 378, column: 39, scope: !819)
!834 = !DILocation(line: 378, column: 43, scope: !819)
!835 = !DILocation(line: 378, column: 59, scope: !819)
!836 = !DILocation(line: 376, column: 6, scope: !810)
!837 = !DILocation(line: 381, column: 14, scope: !838)
!838 = distinct !DILexicalBlock(scope: !815, file: !29, line: 378, column: 66)
!839 = !DILocation(line: 382, column: 2, scope: !838)
!840 = !DILocation(line: 384, column: 6, scope: !841)
!841 = distinct !DILexicalBlock(scope: !768, file: !29, line: 384, column: 6)
!842 = !DILocation(line: 384, column: 6, scope: !768)
!843 = !DILocation(line: 385, column: 21, scope: !844)
!844 = distinct !DILexicalBlock(scope: !841, file: !29, line: 384, column: 18)
!845 = !DILocation(line: 385, column: 11, scope: !844)
!846 = !DILocation(line: 386, column: 28, scope: !844)
!847 = !DILocation(line: 387, column: 3, scope: !844)
!848 = !DILocation(line: 387, column: 17, scope: !844)
!849 = !DILocation(line: 387, column: 28, scope: !844)
!850 = !DILocation(line: 388, column: 2, scope: !844)
!851 = !DILocation(line: 391, column: 6, scope: !852)
!852 = distinct !DILexicalBlock(scope: !768, file: !29, line: 391, column: 6)
!853 = !DILocation(line: 391, column: 12, scope: !852)
!854 = !DILocation(line: 391, column: 9, scope: !852)
!855 = !DILocation(line: 391, column: 20, scope: !852)
!856 = !DILocation(line: 392, column: 7, scope: !852)
!857 = !DILocation(line: 392, column: 10, scope: !852)
!858 = !DILocation(line: 392, column: 15, scope: !852)
!859 = !DILocation(line: 392, column: 19, scope: !860)
!860 = !DILexicalBlockFile(scope: !852, file: !29, discriminator: 1)
!861 = !DILocation(line: 392, column: 23, scope: !860)
!862 = !DILocation(line: 392, column: 39, scope: !860)
!863 = !DILocation(line: 391, column: 6, scope: !801)
!864 = !DILocation(line: 393, column: 21, scope: !865)
!865 = distinct !DILexicalBlock(scope: !866, file: !29, line: 393, column: 21)
!866 = distinct !DILexicalBlock(scope: !852, file: !29, line: 392, column: 46)
!867 = !DILocation(line: 393, column: 21, scope: !866)
!868 = !DILocation(line: 394, column: 14, scope: !869)
!869 = distinct !DILexicalBlock(scope: !865, file: !29, line: 393, column: 38)
!870 = !DILocation(line: 394, column: 12, scope: !869)
!871 = !DILocation(line: 395, column: 8, scope: !872)
!872 = distinct !DILexicalBlock(scope: !869, file: !29, line: 395, column: 8)
!873 = !DILocation(line: 395, column: 11, scope: !872)
!874 = !DILocation(line: 395, column: 8, scope: !869)
!875 = !DILocation(line: 397, column: 8, scope: !872)
!876 = !DILocation(line: 397, column: 16, scope: !872)
!877 = !DILocation(line: 397, column: 8, scope: !878)
!878 = !DILexicalBlockFile(scope: !872, file: !29, discriminator: 1)
!879 = !DILocation(line: 398, column: 10, scope: !872)
!880 = !DILocation(line: 398, column: 18, scope: !872)
!881 = !DILocation(line: 397, column: 8, scope: !882)
!882 = !DILexicalBlockFile(scope: !872, file: !29, discriminator: 2)
!883 = !DILocation(line: 397, column: 8, scope: !884)
!884 = !DILexicalBlockFile(scope: !872, file: !29, discriminator: 3)
!885 = !DILocation(line: 396, column: 5, scope: !872)
!886 = !DILocation(line: 400, column: 5, scope: !872)
!887 = !DILocation(line: 400, column: 19, scope: !872)
!888 = !DILocation(line: 400, column: 26, scope: !872)
!889 = !DILocation(line: 400, column: 40, scope: !872)
!890 = !DILocation(line: 401, column: 3, scope: !869)
!891 = !DILocation(line: 402, column: 2, scope: !866)
!892 = !DILocation(line: 405, column: 6, scope: !893)
!893 = distinct !DILexicalBlock(scope: !768, file: !29, line: 405, column: 6)
!894 = !DILocation(line: 405, column: 13, scope: !893)
!895 = !DILocation(line: 405, column: 16, scope: !896)
!896 = !DILexicalBlockFile(scope: !893, file: !29, discriminator: 1)
!897 = !DILocation(line: 405, column: 24, scope: !896)
!898 = !DILocation(line: 405, column: 30, scope: !896)
!899 = !DILocation(line: 405, column: 40, scope: !896)
!900 = !DILocation(line: 406, column: 24, scope: !893)
!901 = !DILocation(line: 406, column: 26, scope: !893)
!902 = !DILocation(line: 406, column: 7, scope: !893)
!903 = !DILocation(line: 406, column: 32, scope: !893)
!904 = !DILocation(line: 406, column: 39, scope: !893)
!905 = !DILocation(line: 406, column: 47, scope: !893)
!906 = !DILocation(line: 406, column: 53, scope: !893)
!907 = !DILocation(line: 406, column: 36, scope: !893)
!908 = !DILocation(line: 405, column: 6, scope: !810)
!909 = !DILocation(line: 407, column: 7, scope: !893)
!910 = !DILocation(line: 407, column: 3, scope: !893)
!911 = !DILocation(line: 408, column: 6, scope: !912)
!912 = distinct !DILexicalBlock(scope: !768, file: !29, line: 408, column: 6)
!913 = !DILocation(line: 408, column: 10, scope: !912)
!914 = !DILocation(line: 408, column: 6, scope: !768)
!915 = !DILocation(line: 409, column: 3, scope: !912)
!916 = !DILocation(line: 409, column: 17, scope: !912)
!917 = !DILocation(line: 409, column: 27, scope: !912)
!918 = !DILocation(line: 411, column: 6, scope: !919)
!919 = distinct !DILexicalBlock(scope: !768, file: !29, line: 411, column: 6)
!920 = !DILocation(line: 411, column: 12, scope: !919)
!921 = !DILocation(line: 411, column: 9, scope: !919)
!922 = !DILocation(line: 411, column: 20, scope: !919)
!923 = !DILocation(line: 412, column: 7, scope: !919)
!924 = !DILocation(line: 412, column: 10, scope: !919)
!925 = !DILocation(line: 412, column: 15, scope: !919)
!926 = !DILocation(line: 412, column: 19, scope: !927)
!927 = !DILexicalBlockFile(scope: !919, file: !29, discriminator: 1)
!928 = !DILocation(line: 412, column: 23, scope: !927)
!929 = !DILocation(line: 412, column: 39, scope: !927)
!930 = !DILocation(line: 411, column: 6, scope: !801)
!931 = !DILocation(line: 413, column: 21, scope: !932)
!932 = distinct !DILexicalBlock(scope: !933, file: !29, line: 413, column: 21)
!933 = distinct !DILexicalBlock(scope: !919, file: !29, line: 412, column: 46)
!934 = !DILocation(line: 413, column: 21, scope: !933)
!935 = !DILocation(line: 414, column: 14, scope: !936)
!936 = distinct !DILexicalBlock(scope: !932, file: !29, line: 413, column: 38)
!937 = !DILocation(line: 414, column: 12, scope: !936)
!938 = !DILocation(line: 415, column: 8, scope: !939)
!939 = distinct !DILexicalBlock(scope: !936, file: !29, line: 415, column: 8)
!940 = !DILocation(line: 415, column: 11, scope: !939)
!941 = !DILocation(line: 415, column: 8, scope: !936)
!942 = !DILocation(line: 417, column: 8, scope: !939)
!943 = !DILocation(line: 417, column: 16, scope: !939)
!944 = !DILocation(line: 417, column: 8, scope: !945)
!945 = !DILexicalBlockFile(scope: !939, file: !29, discriminator: 1)
!946 = !DILocation(line: 418, column: 10, scope: !939)
!947 = !DILocation(line: 418, column: 18, scope: !939)
!948 = !DILocation(line: 417, column: 8, scope: !949)
!949 = !DILexicalBlockFile(scope: !939, file: !29, discriminator: 2)
!950 = !DILocation(line: 417, column: 8, scope: !951)
!951 = !DILexicalBlockFile(scope: !939, file: !29, discriminator: 3)
!952 = !DILocation(line: 416, column: 5, scope: !939)
!953 = !DILocation(line: 420, column: 5, scope: !939)
!954 = !DILocation(line: 420, column: 19, scope: !939)
!955 = !DILocation(line: 420, column: 26, scope: !939)
!956 = !DILocation(line: 420, column: 40, scope: !939)
!957 = !DILocation(line: 421, column: 3, scope: !936)
!958 = !DILocation(line: 422, column: 2, scope: !933)
!959 = !DILocation(line: 425, column: 6, scope: !960)
!960 = distinct !DILexicalBlock(scope: !768, file: !29, line: 425, column: 6)
!961 = !DILocation(line: 425, column: 10, scope: !960)
!962 = !DILocation(line: 425, column: 6, scope: !768)
!963 = !DILocation(line: 426, column: 3, scope: !960)
!964 = !DILocation(line: 426, column: 17, scope: !960)
!965 = !DILocation(line: 426, column: 29, scope: !960)
!966 = !DILocation(line: 429, column: 6, scope: !967)
!967 = distinct !DILexicalBlock(scope: !768, file: !29, line: 429, column: 6)
!968 = !DILocation(line: 429, column: 13, scope: !967)
!969 = !DILocation(line: 429, column: 16, scope: !970)
!970 = !DILexicalBlockFile(scope: !967, file: !29, discriminator: 1)
!971 = !DILocation(line: 429, column: 24, scope: !970)
!972 = !DILocation(line: 429, column: 30, scope: !970)
!973 = !DILocation(line: 429, column: 40, scope: !970)
!974 = !DILocation(line: 430, column: 24, scope: !967)
!975 = !DILocation(line: 430, column: 26, scope: !967)
!976 = !DILocation(line: 430, column: 7, scope: !967)
!977 = !DILocation(line: 430, column: 32, scope: !967)
!978 = !DILocation(line: 430, column: 39, scope: !967)
!979 = !DILocation(line: 430, column: 47, scope: !967)
!980 = !DILocation(line: 430, column: 53, scope: !967)
!981 = !DILocation(line: 430, column: 36, scope: !967)
!982 = !DILocation(line: 429, column: 6, scope: !810)
!983 = !DILocation(line: 431, column: 7, scope: !967)
!984 = !DILocation(line: 431, column: 3, scope: !967)
!985 = !DILocation(line: 432, column: 6, scope: !986)
!986 = distinct !DILexicalBlock(scope: !768, file: !29, line: 432, column: 6)
!987 = !DILocation(line: 432, column: 10, scope: !986)
!988 = !DILocation(line: 432, column: 6, scope: !768)
!989 = !DILocation(line: 433, column: 3, scope: !986)
!990 = !DILocation(line: 433, column: 17, scope: !986)
!991 = !DILocation(line: 433, column: 26, scope: !986)
!992 = !DILocation(line: 436, column: 6, scope: !993)
!993 = distinct !DILexicalBlock(scope: !768, file: !29, line: 436, column: 6)
!994 = !DILocation(line: 436, column: 10, scope: !993)
!995 = !DILocation(line: 436, column: 6, scope: !768)
!996 = !DILocation(line: 437, column: 8, scope: !997)
!997 = distinct !DILexicalBlock(scope: !998, file: !29, line: 437, column: 7)
!998 = distinct !DILexicalBlock(scope: !993, file: !29, line: 436, column: 26)
!999 = !DILocation(line: 437, column: 19, scope: !997)
!1000 = !DILocation(line: 437, column: 35, scope: !997)
!1001 = !DILocation(line: 437, column: 7, scope: !998)
!1002 = !DILocation(line: 438, column: 4, scope: !997)
!1003 = !DILocation(line: 438, column: 18, scope: !997)
!1004 = !DILocation(line: 438, column: 28, scope: !997)
!1005 = !DILocation(line: 439, column: 2, scope: !998)
!1006 = !DILocation(line: 439, column: 13, scope: !1007)
!1007 = !DILexicalBlockFile(scope: !1008, file: !29, discriminator: 1)
!1008 = distinct !DILexicalBlock(scope: !993, file: !29, line: 439, column: 13)
!1009 = !DILocation(line: 439, column: 24, scope: !1007)
!1010 = !DILocation(line: 440, column: 3, scope: !1008)
!1011 = !DILocation(line: 440, column: 17, scope: !1008)
!1012 = !DILocation(line: 440, column: 27, scope: !1008)
!1013 = !DILocation(line: 443, column: 6, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !768, file: !29, line: 443, column: 6)
!1015 = !DILocation(line: 443, column: 10, scope: !1014)
!1016 = !DILocation(line: 443, column: 6, scope: !768)
!1017 = !DILocation(line: 444, column: 8, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !29, line: 444, column: 7)
!1019 = distinct !DILexicalBlock(scope: !1014, file: !29, line: 443, column: 26)
!1020 = !DILocation(line: 444, column: 19, scope: !1018)
!1021 = !DILocation(line: 444, column: 35, scope: !1018)
!1022 = !DILocation(line: 444, column: 7, scope: !1019)
!1023 = !DILocation(line: 445, column: 4, scope: !1018)
!1024 = !DILocation(line: 445, column: 18, scope: !1018)
!1025 = !DILocation(line: 445, column: 29, scope: !1018)
!1026 = !DILocation(line: 446, column: 2, scope: !1019)
!1027 = !DILocation(line: 446, column: 13, scope: !1028)
!1028 = !DILexicalBlockFile(scope: !1029, file: !29, discriminator: 1)
!1029 = distinct !DILexicalBlock(scope: !1014, file: !29, line: 446, column: 13)
!1030 = !DILocation(line: 446, column: 24, scope: !1028)
!1031 = !DILocation(line: 447, column: 3, scope: !1029)
!1032 = !DILocation(line: 447, column: 17, scope: !1029)
!1033 = !DILocation(line: 447, column: 28, scope: !1029)
!1034 = !DILocation(line: 450, column: 15, scope: !768)
!1035 = !DILocation(line: 450, column: 19, scope: !768)
!1036 = !DILocation(line: 450, column: 13, scope: !768)
!1037 = !DILocation(line: 451, column: 1, scope: !768)
!1038 = distinct !DISubprogram(name: "term_beep", scope: !29, file: !29, line: 250, type: !296, isLocal: false, isDefinition: true, scopeLine: 251, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!1039 = !DILocation(line: 252, column: 9, scope: !1038)
!1040 = !DILocation(line: 252, column: 23, scope: !1038)
!1041 = !DILocation(line: 252, column: 28, scope: !1038)
!1042 = !DILocation(line: 253, column: 1, scope: !1038)
!1043 = distinct !DISubprogram(name: "term_window_destroy", scope: !29, file: !29, line: 268, type: !1044, isLocal: false, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{null, !25}
!1046 = !DILocalVariable(name: "window", arg: 1, scope: !1043, file: !29, line: 268, type: !25)
!1047 = !DILocation(line: 268, column: 39, scope: !1043)
!1048 = !DILocation(line: 270, column: 16, scope: !1043)
!1049 = !DILocation(line: 270, column: 9, scope: !1043)
!1050 = !DILocation(line: 271, column: 1, scope: !1043)
!1051 = distinct !DISubprogram(name: "term_window_clear", scope: !29, file: !29, line: 284, type: !1044, isLocal: false, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!1052 = !DILocalVariable(name: "window", arg: 1, scope: !1051, file: !29, line: 284, type: !25)
!1053 = !DILocation(line: 284, column: 37, scope: !1051)
!1054 = !DILocalVariable(name: "y", scope: !1051, file: !29, line: 286, type: !24)
!1055 = !DILocation(line: 286, column: 6, scope: !1051)
!1056 = !DILocation(line: 288, column: 2, scope: !1051)
!1057 = !DILocation(line: 288, column: 16, scope: !1051)
!1058 = !DILocation(line: 288, column: 27, scope: !1051)
!1059 = !DILocation(line: 289, column: 6, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1051, file: !29, line: 289, column: 6)
!1061 = !DILocation(line: 289, column: 14, scope: !1060)
!1062 = !DILocation(line: 289, column: 16, scope: !1060)
!1063 = !DILocation(line: 289, column: 21, scope: !1060)
!1064 = !DILocation(line: 289, column: 24, scope: !1065)
!1065 = !DILexicalBlockFile(scope: !1060, file: !29, discriminator: 1)
!1066 = !DILocation(line: 289, column: 32, scope: !1065)
!1067 = !DILocation(line: 289, column: 42, scope: !1065)
!1068 = !DILocation(line: 289, column: 39, scope: !1065)
!1069 = !DILocation(line: 289, column: 54, scope: !1065)
!1070 = !DILocation(line: 289, column: 57, scope: !1071)
!1071 = !DILexicalBlockFile(scope: !1060, file: !29, discriminator: 2)
!1072 = !DILocation(line: 289, column: 65, scope: !1071)
!1073 = !DILocation(line: 289, column: 74, scope: !1071)
!1074 = !DILocation(line: 289, column: 71, scope: !1071)
!1075 = !DILocation(line: 289, column: 6, scope: !1071)
!1076 = !DILocation(line: 290, column: 3, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1060, file: !29, line: 289, column: 86)
!1078 = !DILocation(line: 291, column: 2, scope: !1077)
!1079 = !DILocation(line: 292, column: 10, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1081, file: !29, line: 292, column: 3)
!1081 = distinct !DILexicalBlock(scope: !1060, file: !29, line: 291, column: 9)
!1082 = !DILocation(line: 292, column: 8, scope: !1080)
!1083 = !DILocation(line: 292, column: 15, scope: !1084)
!1084 = !DILexicalBlockFile(scope: !1085, file: !29, discriminator: 1)
!1085 = distinct !DILexicalBlock(scope: !1080, file: !29, line: 292, column: 3)
!1086 = !DILocation(line: 292, column: 19, scope: !1084)
!1087 = !DILocation(line: 292, column: 27, scope: !1084)
!1088 = !DILocation(line: 292, column: 17, scope: !1084)
!1089 = !DILocation(line: 292, column: 3, scope: !1084)
!1090 = !DILocation(line: 293, column: 14, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1085, file: !29, line: 292, column: 40)
!1092 = !DILocation(line: 293, column: 25, scope: !1091)
!1093 = !DILocation(line: 293, column: 4, scope: !1091)
!1094 = !DILocation(line: 294, column: 18, scope: !1091)
!1095 = !DILocation(line: 294, column: 4, scope: !1091)
!1096 = !DILocation(line: 295, column: 3, scope: !1091)
!1097 = !DILocation(line: 292, column: 36, scope: !1098)
!1098 = !DILexicalBlockFile(scope: !1085, file: !29, discriminator: 2)
!1099 = !DILocation(line: 292, column: 3, scope: !1098)
!1100 = distinct !{!1100, !1101}
!1101 = !DILocation(line: 292, column: 3, scope: !1081)
!1102 = !DILocation(line: 297, column: 1, scope: !1051)
!1103 = distinct !DISubprogram(name: "term_move", scope: !29, file: !29, line: 453, type: !1104, isLocal: false, isDefinition: true, scopeLine: 454, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{null, !25, !24, !24}
!1106 = !DILocalVariable(name: "window", arg: 1, scope: !1103, file: !29, line: 453, type: !25)
!1107 = !DILocation(line: 453, column: 29, scope: !1103)
!1108 = !DILocalVariable(name: "x", arg: 2, scope: !1103, file: !29, line: 453, type: !24)
!1109 = !DILocation(line: 453, column: 41, scope: !1103)
!1110 = !DILocalVariable(name: "y", arg: 3, scope: !1103, file: !29, line: 453, type: !24)
!1111 = !DILocation(line: 453, column: 48, scope: !1103)
!1112 = !DILocation(line: 455, column: 6, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1103, file: !29, line: 455, column: 6)
!1114 = !DILocation(line: 455, column: 8, scope: !1113)
!1115 = !DILocation(line: 455, column: 13, scope: !1113)
!1116 = !DILocation(line: 455, column: 16, scope: !1117)
!1117 = !DILexicalBlockFile(scope: !1113, file: !29, discriminator: 1)
!1118 = !DILocation(line: 455, column: 18, scope: !1117)
!1119 = !DILocation(line: 455, column: 6, scope: !1117)
!1120 = !DILocation(line: 456, column: 10, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1113, file: !29, line: 455, column: 24)
!1122 = !DILocation(line: 457, column: 9, scope: !1121)
!1123 = !DILocation(line: 457, column: 11, scope: !1121)
!1124 = !DILocation(line: 457, column: 19, scope: !1121)
!1125 = !DILocation(line: 457, column: 10, scope: !1121)
!1126 = !DILocation(line: 457, column: 7, scope: !1121)
!1127 = !DILocation(line: 458, column: 9, scope: !1121)
!1128 = !DILocation(line: 458, column: 11, scope: !1121)
!1129 = !DILocation(line: 458, column: 19, scope: !1121)
!1130 = !DILocation(line: 458, column: 10, scope: !1121)
!1131 = !DILocation(line: 458, column: 7, scope: !1121)
!1132 = !DILocation(line: 460, column: 7, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1121, file: !29, line: 460, column: 7)
!1134 = !DILocation(line: 460, column: 14, scope: !1133)
!1135 = !DILocation(line: 460, column: 11, scope: !1133)
!1136 = !DILocation(line: 460, column: 7, scope: !1121)
!1137 = !DILocation(line: 461, column: 10, scope: !1133)
!1138 = !DILocation(line: 461, column: 20, scope: !1133)
!1139 = !DILocation(line: 461, column: 8, scope: !1133)
!1140 = !DILocation(line: 461, column: 4, scope: !1133)
!1141 = !DILocation(line: 462, column: 7, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1121, file: !29, line: 462, column: 7)
!1143 = !DILocation(line: 462, column: 14, scope: !1142)
!1144 = !DILocation(line: 462, column: 11, scope: !1142)
!1145 = !DILocation(line: 462, column: 7, scope: !1121)
!1146 = !DILocation(line: 463, column: 10, scope: !1142)
!1147 = !DILocation(line: 463, column: 21, scope: !1142)
!1148 = !DILocation(line: 463, column: 8, scope: !1142)
!1149 = !DILocation(line: 463, column: 4, scope: !1142)
!1150 = !DILocation(line: 464, column: 2, scope: !1121)
!1151 = !DILocation(line: 465, column: 1, scope: !1103)
!1152 = distinct !DISubprogram(name: "term_clrtoeol", scope: !29, file: !29, line: 576, type: !1044, isLocal: false, isDefinition: true, scopeLine: 577, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!1153 = !DILocalVariable(name: "window", arg: 1, scope: !1152, file: !29, line: 576, type: !25)
!1154 = !DILocation(line: 576, column: 33, scope: !1152)
!1155 = !DILocation(line: 578, column: 6, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1152, file: !29, line: 578, column: 6)
!1157 = !DILocation(line: 578, column: 12, scope: !1156)
!1158 = !DILocation(line: 578, column: 20, scope: !1156)
!1159 = !DILocation(line: 578, column: 10, scope: !1156)
!1160 = !DILocation(line: 578, column: 6, scope: !1152)
!1161 = !DILocation(line: 580, column: 10, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1156, file: !29, line: 578, column: 23)
!1163 = !DILocation(line: 580, column: 18, scope: !1162)
!1164 = !DILocation(line: 580, column: 7, scope: !1162)
!1165 = !DILocation(line: 581, column: 10, scope: !1162)
!1166 = !DILocation(line: 582, column: 2, scope: !1162)
!1167 = !DILocation(line: 583, column: 6, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1152, file: !29, line: 583, column: 6)
!1169 = !DILocation(line: 583, column: 14, scope: !1168)
!1170 = !DILocation(line: 583, column: 18, scope: !1168)
!1171 = !DILocation(line: 583, column: 26, scope: !1168)
!1172 = !DILocation(line: 583, column: 16, scope: !1168)
!1173 = !DILocation(line: 583, column: 34, scope: !1168)
!1174 = !DILocation(line: 583, column: 32, scope: !1168)
!1175 = !DILocation(line: 583, column: 6, scope: !1152)
!1176 = !DILocation(line: 585, column: 7, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1178, file: !29, line: 585, column: 7)
!1178 = distinct !DILexicalBlock(scope: !1168, file: !29, line: 583, column: 46)
!1179 = !DILocation(line: 585, column: 7, scope: !1178)
!1180 = !DILocation(line: 585, column: 15, scope: !1181)
!1181 = !DILexicalBlockFile(scope: !1177, file: !29, discriminator: 1)
!1182 = !DILocation(line: 586, column: 3, scope: !1178)
!1183 = !DILocation(line: 586, column: 17, scope: !1178)
!1184 = !DILocation(line: 586, column: 24, scope: !1178)
!1185 = !DILocation(line: 586, column: 43, scope: !1178)
!1186 = !DILocation(line: 586, column: 51, scope: !1178)
!1187 = !DILocation(line: 586, column: 55, scope: !1178)
!1188 = !DILocation(line: 586, column: 63, scope: !1178)
!1189 = !DILocation(line: 586, column: 53, scope: !1178)
!1190 = !DILocation(line: 586, column: 71, scope: !1178)
!1191 = !DILocation(line: 586, column: 69, scope: !1178)
!1192 = !DILocation(line: 586, column: 75, scope: !1178)
!1193 = !DILocation(line: 587, column: 3, scope: !1178)
!1194 = !DILocation(line: 587, column: 17, scope: !1178)
!1195 = !DILocation(line: 587, column: 22, scope: !1178)
!1196 = !DILocation(line: 587, column: 36, scope: !1178)
!1197 = !DILocation(line: 587, column: 41, scope: !1178)
!1198 = !DILocation(line: 588, column: 20, scope: !1178)
!1199 = !DILocation(line: 588, column: 3, scope: !1178)
!1200 = !DILocation(line: 588, column: 25, scope: !1178)
!1201 = !DILocation(line: 589, column: 2, scope: !1178)
!1202 = !DILocation(line: 591, column: 7, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1204, file: !29, line: 591, column: 7)
!1204 = distinct !DILexicalBlock(scope: !1168, file: !29, line: 589, column: 9)
!1205 = !DILocation(line: 591, column: 15, scope: !1203)
!1206 = !DILocation(line: 591, column: 21, scope: !1203)
!1207 = !DILocation(line: 591, column: 24, scope: !1208)
!1208 = !DILexicalBlockFile(scope: !1203, file: !29, discriminator: 1)
!1209 = !DILocation(line: 591, column: 32, scope: !1208)
!1210 = !DILocation(line: 591, column: 38, scope: !1208)
!1211 = !DILocation(line: 592, column: 8, scope: !1203)
!1212 = !DILocation(line: 592, column: 19, scope: !1203)
!1213 = !DILocation(line: 592, column: 63, scope: !1203)
!1214 = !DILocation(line: 591, column: 7, scope: !1215)
!1215 = !DILexicalBlockFile(scope: !1204, file: !29, discriminator: 2)
!1216 = !DILocation(line: 593, column: 26, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1218, file: !29, line: 593, column: 8)
!1218 = distinct !DILexicalBlock(scope: !1203, file: !29, line: 592, column: 69)
!1219 = !DILocation(line: 593, column: 9, scope: !1217)
!1220 = !DILocation(line: 593, column: 8, scope: !1218)
!1221 = !DILocation(line: 594, column: 9, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1223, file: !29, line: 594, column: 9)
!1223 = distinct !DILexicalBlock(scope: !1217, file: !29, line: 593, column: 32)
!1224 = !DILocation(line: 594, column: 9, scope: !1223)
!1225 = !DILocation(line: 594, column: 17, scope: !1226)
!1226 = !DILexicalBlockFile(scope: !1222, file: !29, discriminator: 1)
!1227 = !DILocation(line: 595, column: 5, scope: !1223)
!1228 = !DILocation(line: 595, column: 19, scope: !1223)
!1229 = !DILocation(line: 595, column: 28, scope: !1223)
!1230 = !DILocation(line: 596, column: 9, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1223, file: !29, line: 596, column: 9)
!1232 = !DILocation(line: 596, column: 13, scope: !1231)
!1233 = !DILocation(line: 596, column: 9, scope: !1223)
!1234 = !DILocation(line: 596, column: 36, scope: !1235)
