; ModuleID = './line238-fe-queries.o.i'
source_filename = "./line238-fe-queries.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, {}*, i8* (%struct._WI_ITEM_REC*)* }
%struct._GHashTable = type opaque
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }

!260 = !DIEnumerator(name: "TXT_FORMAT_ITEM", value: 184)
!261 = !DIEnumerator(name: "TXT_FILL_12", value: 185)
!262 = !DIEnumerator(name: "TXT_IGNORED", value: 186)
!263 = !DIEnumerator(name: "TXT_IGNORED_OPTIONS", value: 187)
!264 = !DIEnumerator(name: "TXT_UNIGNORED", value: 188)
!265 = !DIEnumerator(name: "TXT_IGNORE_NOT_FOUND", value: 189)
!266 = !DIEnumerator(name: "TXT_IGNORE_NO_IGNORES", value: 190)
!267 = !DIEnumerator(name: "TXT_IGNORE_HEADER", value: 191)
!268 = !DIEnumerator(name: "TXT_IGNORE_LINE", value: 192)
!269 = !DIEnumerator(name: "TXT_IGNORE_FOOTER", value: 193)
!270 = !DIEnumerator(name: "TXT_FILL_13", value: 194)
!271 = !DIEnumerator(name: "TXT_NOT_CHANNEL_OR_QUERY", value: 195)
!272 = !DIEnumerator(name: "TXT_CONVERSION_ADDED", value: 196)
!273 = !DIEnumerator(name: "TXT_CONVERSION_REMOVED", value: 197)
!274 = !DIEnumerator(name: "TXT_CONVERSION_NOT_FOUND", value: 198)
!275 = !DIEnumerator(name: "TXT_CONVERSION_NO_TRANSLITS", value: 199)
!276 = !DIEnumerator(name: "TXT_RECODE_HEADER", value: 200)
!277 = !DIEnumerator(name: "TXT_RECODE_LINE", value: 201)
!278 = !DIEnumerator(name: "TXT_FILL_14", value: 202)
!279 = !DIEnumerator(name: "TXT_UNKNOWN_CHAT_PROTOCOL", value: 203)
!280 = !DIEnumerator(name: "TXT_UNKNOWN_CHATNET", value: 204)
!281 = !DIEnumerator(name: "TXT_NOT_TOGGLE", value: 205)
!282 = !DIEnumerator(name: "TXT_PERL_ERROR", value: 206)
!283 = !DIEnumerator(name: "TXT_BIND_HEADER", value: 207)
!284 = !DIEnumerator(name: "TXT_BIND_LIST", value: 208)
!285 = !DIEnumerator(name: "TXT_BIND_COMMAND_LIST", value: 209)
!286 = !DIEnumerator(name: "TXT_BIND_FOOTER", value: 210)
!287 = !DIEnumerator(name: "TXT_BIND_UNKNOWN_ID", value: 211)
!288 = !DIEnumerator(name: "TXT_CONFIG_SAVED", value: 212)
!289 = !DIEnumerator(name: "TXT_CONFIG_RELOADED", value: 213)
!290 = !DIEnumerator(name: "TXT_CONFIG_MODIFIED", value: 214)
!291 = !DIEnumerator(name: "TXT_GLIB_ERROR", value: 215)
!292 = !DIEnumerator(name: "TXT_OVERWRITE_CONFIG", value: 216)
!293 = !DIEnumerator(name: "TXT_SET_TITLE", value: 217)
!294 = !DIEnumerator(name: "TXT_SET_ITEM", value: 218)
!295 = !DIEnumerator(name: "TXT_SET_UNKNOWN", value: 219)
!296 = !DIEnumerator(name: "TXT_SET_NOT_BOOLEAN", value: 220)
!297 = !DIEnumerator(name: "TXT_NO_COMPLETIONS", value: 221)
!298 = !DIEnumerator(name: "TXT_COMPLETION_REMOVED", value: 222)
!299 = !DIEnumerator(name: "TXT_COMPLETION_HEADER", value: 223)
!300 = !DIEnumerator(name: "TXT_COMPLETION_LINE", value: 224)
!301 = !DIEnumerator(name: "TXT_COMPLETION_FOOTER", value: 225)
!302 = !DIEnumerator(name: "TXT_CAPSICUM_ENABLED", value: 226)
!303 = !DIEnumerator(name: "TXT_CAPSICUM_DISABLED", value: 227)
!304 = !DIEnumerator(name: "TXT_CAPSICUM_FAILED", value: 228)
!305 = !DIEnumerator(name: "TLS_FILL_15", value: 229)
!306 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY", value: 230)
!307 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY_UNAVAILBLE", value: 231)
!308 = !DIEnumerator(name: "TXT_TLS_PUBKEY", value: 232)
!309 = !DIEnumerator(name: "TXT_TLS_CERT_HEADER", value: 233)
!310 = !DIEnumerator(name: "TXT_TLS_CERT_SUBJECT", value: 234)
!311 = !DIEnumerator(name: "TXT_TLS_CERT_ISSUER", value: 235)
!312 = !DIEnumerator(name: "TXT_TLS_PUBKEY_FINGERPRINT", value: 236)
!313 = !DIEnumerator(name: "TXT_TLS_CERT_FINGERPRINT", value: 237)
!314 = !DIEnumerator(name: "TXT_TLS_PROTOCOL_VERSION", value: 238)
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !316, line: 25, size: 32, align: 32, elements: !317)
!316 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!317 = !{!318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!318 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!319 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!320 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!321 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!322 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!323 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!324 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!325 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!326 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!327 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!328 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!329 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!330 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!331 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!332 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!333 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!334 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!335 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!336 = !{!337, !405, !638, !451, !724, !467, !731, !692, !672, !393, !628, !450}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !339, line: 107, baseType: !340)
!339 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !341, line: 30, size: 2240, align: 64, elements: !342)
!341 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!342 = !{!343, !346, !347, !348, !583, !588, !589, !590, !591, !592, !593, !594, !595, !596, !600, !601, !605, !606, !607, !611, !616, !617, !618, !619, !620, !621, !622, !623, !630, !631, !632, !633, !634, !640, !644, !648, !652, !656, !661, !668, !719, !723}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !340, file: !344, line: 3, baseType: !345, size: 32, align: 32)
!344 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!345 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !340, file: !344, line: 4, baseType: !345, size: 32, align: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !340, file: !344, line: 6, baseType: !345, size: 32, align: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !340, file: !344, line: 8, baseType: !349, size: 64, align: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !339, line: 113, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !341, line: 25, size: 1920, align: 64, elements: !352)
!352 = !{!353, !355, !356, !357, !360, !361, !362, !363, !364, !366, !367, !368, !369, !370, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !351, file: !354, line: 3, baseType: !345, size: 32, align: 32)
!354 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!355 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !351, file: !354, line: 4, baseType: !345, size: 32, align: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !351, file: !354, line: 6, baseType: !345, size: 32, align: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !351, file: !354, line: 9, baseType: !358, size: 64, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !351, file: !354, line: 10, baseType: !345, size: 32, align: 32, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !351, file: !354, line: 11, baseType: !358, size: 64, align: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !351, file: !354, line: 11, baseType: !358, size: 64, align: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !351, file: !354, line: 11, baseType: !358, size: 64, align: 64, offset: 384)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !351, file: !354, line: 13, baseType: !365, size: 16, align: 16, offset: 448)
!365 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !351, file: !354, line: 14, baseType: !358, size: 64, align: 64, offset: 512)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !351, file: !354, line: 15, baseType: !358, size: 64, align: 64, offset: 576)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !351, file: !354, line: 16, baseType: !345, size: 32, align: 32, offset: 640)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !351, file: !354, line: 17, baseType: !358, size: 64, align: 64, offset: 704)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !351, file: !354, line: 19, baseType: !371, size: 64, align: 64, offset: 768)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !339, line: 99, baseType: !373)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !339, line: 99, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !351, file: !354, line: 19, baseType: !371, size: 64, align: 64, offset: 832)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !351, file: !354, line: 21, baseType: !358, size: 64, align: 64, offset: 896)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !351, file: !354, line: 22, baseType: !358, size: 64, align: 64, offset: 960)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !351, file: !354, line: 23, baseType: !358, size: 64, align: 64, offset: 1024)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !351, file: !354, line: 24, baseType: !358, size: 64, align: 64, offset: 1088)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !351, file: !354, line: 26, baseType: !358, size: 64, align: 64, offset: 1152)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !351, file: !354, line: 27, baseType: !358, size: 64, align: 64, offset: 1216)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !351, file: !354, line: 28, baseType: !358, size: 64, align: 64, offset: 1280)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !351, file: !354, line: 29, baseType: !358, size: 64, align: 64, offset: 1344)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !351, file: !354, line: 30, baseType: !358, size: 64, align: 64, offset: 1408)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !351, file: !354, line: 31, baseType: !358, size: 64, align: 64, offset: 1472)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !351, file: !354, line: 32, baseType: !358, size: 64, align: 64, offset: 1536)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !351, file: !354, line: 33, baseType: !358, size: 64, align: 64, offset: 1600)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !351, file: !354, line: 35, baseType: !388, size: 64, align: 64, offset: 1664)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !391)
!391 = !{!392, !395, !540, !541, !546, !547, !548, !549, !550, !559, !560, !561, !565, !566, !567, !568, !569, !570, !571, !572}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !390, file: !4, line: 100, baseType: !393, size: 32, align: 32)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !394, line: 49, baseType: !345)
!394 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!395 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !390, file: !4, line: 101, baseType: !396, size: 64, align: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !399)
!399 = !{!400, !424, !430, !437, !441, !527, !531, !536}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !398, file: !4, line: 133, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!404, !388, !405, !407, !410, !411}
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !394, line: 46, baseType: !359)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !408, line: 66, baseType: !409)
!408 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!409 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !414, line: 42, baseType: !415)
!414 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !414, line: 44, size: 128, align: 64, elements: !416)
!416 = !{!417, !422, !423}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !415, file: !414, line: 46, baseType: !418, size: 32, align: 32)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !419, line: 36, baseType: !420)
!419 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !408, line: 45, baseType: !421)
!421 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !415, file: !414, line: 47, baseType: !393, size: 32, align: 32, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !415, file: !414, line: 48, baseType: !405, size: 64, align: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !398, file: !4, line: 138, baseType: !425, size: 64, align: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!404, !388, !428, !407, !410, !411}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !398, file: !4, line: 143, baseType: !431, size: 64, align: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!404, !388, !434, !436, !411}
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !408, line: 51, baseType: !435)
!435 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !398, file: !4, line: 147, baseType: !438, size: 64, align: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!404, !388, !411}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !398, file: !4, line: 149, baseType: !442, size: 64, align: 64, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!445, !388, !526}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !448)
!448 = !{!449, !452, !473, !502, !504, !508, !509, !510, !511, !519, !520, !521, !522}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !447, file: !16, line: 174, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !394, line: 77, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !447, file: !16, line: 175, baseType: !453, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !456)
!456 = !{!457, !461, !462}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !455, file: !16, line: 198, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !450}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !455, file: !16, line: 199, baseType: !458, size: 64, align: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !455, file: !16, line: 200, baseType: !463, size: 64, align: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !450, !445, !466, !472}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!471, !450}
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !394, line: 50, baseType: !393)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !447, file: !16, line: 177, baseType: !474, size: 64, align: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !478)
!478 = !{!479, !484, !488, !492, !496, !497}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !477, file: !16, line: 216, baseType: !480, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!471, !445, !483}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !477, file: !16, line: 218, baseType: !485, size: 64, align: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!471, !445}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !477, file: !16, line: 219, baseType: !489, size: 64, align: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!471, !445, !467, !450}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !477, file: !16, line: 222, baseType: !493, size: 64, align: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !445}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !477, file: !16, line: 226, baseType: !467, size: 64, align: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !477, file: !16, line: 227, baseType: !498, size: 64, align: 64, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{null}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !447, file: !16, line: 178, baseType: !503, size: 32, align: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !394, line: 55, baseType: !421)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !447, file: !16, line: 180, baseType: !505, size: 64, align: 64, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !507)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !447, file: !16, line: 182, baseType: !393, size: 32, align: 32, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !447, file: !16, line: 183, baseType: !503, size: 32, align: 32, offset: 352)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !447, file: !16, line: 184, baseType: !503, size: 32, align: 32, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !447, file: !16, line: 186, baseType: !512, size: 64, align: 64, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !514, line: 37, baseType: !515)
!514 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !514, line: 39, size: 128, align: 64, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !515, file: !514, line: 41, baseType: !450, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !515, file: !514, line: 42, baseType: !512, size: 64, align: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !447, file: !16, line: 188, baseType: !445, size: 64, align: 64, offset: 512)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !447, file: !16, line: 189, baseType: !445, size: 64, align: 64, offset: 576)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !447, file: !16, line: 191, baseType: !358, size: 64, align: 64, offset: 640)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !447, file: !16, line: 193, baseType: !523, size: 64, align: 64, offset: 704)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !525)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !398, file: !4, line: 151, baseType: !528, size: 64, align: 64, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !388}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !398, file: !4, line: 152, baseType: !532, size: 64, align: 64, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!404, !388, !535, !411}
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !398, file: !4, line: 155, baseType: !537, size: 64, align: 64, offset: 448)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!535, !388}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !390, file: !4, line: 103, baseType: !405, size: 64, align: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !390, file: !4, line: 104, baseType: !542, size: 64, align: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !543, line: 77, baseType: !544)
!543 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !543, line: 77, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !390, file: !4, line: 105, baseType: !542, size: 64, align: 64, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !390, file: !4, line: 106, baseType: !405, size: 64, align: 64, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !390, file: !4, line: 107, baseType: !503, size: 32, align: 32, offset: 384)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !390, file: !4, line: 109, baseType: !407, size: 64, align: 64, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !390, file: !4, line: 110, baseType: !551, size: 64, align: 64, offset: 512)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !553, line: 39, baseType: !554)
!553 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !553, line: 41, size: 192, align: 64, elements: !555)
!555 = !{!556, !557, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !554, file: !553, line: 43, baseType: !405, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !554, file: !553, line: 44, baseType: !407, size: 64, align: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !554, file: !553, line: 45, baseType: !407, size: 64, align: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !390, file: !4, line: 111, baseType: !551, size: 64, align: 64, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !390, file: !4, line: 112, baseType: !551, size: 64, align: 64, offset: 640)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !390, file: !4, line: 113, baseType: !562, size: 48, align: 8, offset: 704)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 48, align: 8, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 6)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !390, file: !4, line: 117, baseType: !503, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !390, file: !4, line: 118, baseType: !503, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !390, file: !4, line: 119, baseType: !503, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !390, file: !4, line: 120, baseType: !503, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !390, file: !4, line: 121, baseType: !503, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !390, file: !4, line: 122, baseType: !503, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !390, file: !4, line: 124, baseType: !450, size: 64, align: 64, offset: 768)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !390, file: !4, line: 125, baseType: !450, size: 64, align: 64, offset: 832)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !351, file: !354, line: 38, baseType: !421, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !351, file: !354, line: 39, baseType: !421, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !351, file: !354, line: 40, baseType: !421, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !351, file: !354, line: 41, baseType: !421, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !351, file: !354, line: 42, baseType: !421, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !351, file: !354, line: 43, baseType: !421, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !351, file: !354, line: 44, baseType: !421, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !351, file: !354, line: 45, baseType: !421, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !351, file: !354, line: 46, baseType: !358, size: 64, align: 64, offset: 1792)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !351, file: !354, line: 47, baseType: !358, size: 64, align: 64, offset: 1856)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !340, file: !344, line: 9, baseType: !584, size: 64, align: 64, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !585, line: 75, baseType: !586)
!585 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !587, line: 139, baseType: !435)
!587 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!588 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !340, file: !344, line: 10, baseType: !584, size: 64, align: 64, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !340, file: !344, line: 12, baseType: !358, size: 64, align: 64, offset: 320)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !340, file: !344, line: 13, baseType: !358, size: 64, align: 64, offset: 384)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !340, file: !344, line: 15, baseType: !421, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !340, file: !344, line: 16, baseType: !421, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !340, file: !344, line: 17, baseType: !421, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !340, file: !344, line: 18, baseType: !421, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !340, file: !344, line: 19, baseType: !421, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !340, file: !344, line: 21, baseType: !597, size: 64, align: 64, offset: 512)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !339, line: 102, baseType: !599)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !339, line: 102, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !340, file: !344, line: 22, baseType: !345, size: 32, align: 32, offset: 576)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !340, file: !344, line: 25, baseType: !602, size: 128, align: 64, offset: 640)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 128, align: 64, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 2)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !340, file: !344, line: 26, baseType: !345, size: 32, align: 32, offset: 768)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !340, file: !344, line: 27, baseType: !345, size: 32, align: 32, offset: 800)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !340, file: !344, line: 29, baseType: !608, size: 64, align: 64, offset: 832)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !339, line: 103, baseType: !610)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !339, line: 103, flags: DIFlagFwdDecl)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !340, file: !344, line: 30, baseType: !612, size: 64, align: 64, offset: 896)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !614, line: 37, baseType: !615)
!614 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !614, line: 37, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !340, file: !344, line: 32, baseType: !358, size: 64, align: 64, offset: 960)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !340, file: !344, line: 33, baseType: !358, size: 64, align: 64, offset: 1024)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !340, file: !344, line: 34, baseType: !358, size: 64, align: 64, offset: 1088)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !340, file: !344, line: 35, baseType: !421, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !340, file: !344, line: 36, baseType: !421, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !340, file: !344, line: 37, baseType: !421, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !340, file: !344, line: 38, baseType: !421, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !340, file: !344, line: 40, baseType: !624, size: 128, align: 64, offset: 1216)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !394, line: 504, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !394, line: 506, size: 128, align: 64, elements: !626)
!626 = !{!627, !629}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !625, file: !394, line: 508, baseType: !628, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !394, line: 48, baseType: !435)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !625, file: !394, line: 509, baseType: !628, size: 64, align: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !340, file: !344, line: 41, baseType: !584, size: 64, align: 64, offset: 1344)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !340, file: !344, line: 42, baseType: !345, size: 32, align: 32, offset: 1408)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !340, file: !344, line: 44, baseType: !512, size: 64, align: 64, offset: 1472)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !340, file: !344, line: 45, baseType: !512, size: 64, align: 64, offset: 1536)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !340, file: !344, line: 53, baseType: !635, size: 64, align: 64, offset: 1600)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{null, !337, !638, !345}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !340, file: !344, line: 55, baseType: !641, size: 64, align: 64, offset: 1664)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!345, !337, !359}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !340, file: !344, line: 57, baseType: !645, size: 64, align: 64, offset: 1728)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64, align: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!345, !337, !638}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !340, file: !344, line: 60, baseType: !649, size: 64, align: 64, offset: 1792)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, align: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!638, !337}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !340, file: !344, line: 62, baseType: !653, size: 64, align: 64, offset: 1856)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !337, !638, !638, !345}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !340, file: !344, line: 65, baseType: !657, size: 64, align: 64, offset: 1920)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!660, !337, !638, !638}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !340, file: !344, line: 69, baseType: !662, size: 64, align: 64, offset: 1984)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64, align: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!665, !337, !638}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !339, line: 109, baseType: !667)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !339, line: 109, flags: DIFlagFwdDecl)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !340, file: !344, line: 70, baseType: !669, size: 64, align: 64, offset: 2048)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64, align: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!672, !337, !638}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !339, line: 110, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !675, line: 15, size: 960, align: 64, elements: !676)
!675 = !DIFile(filename: "../../../src/core/queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!676 = !{!677, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !712, !713, !715, !716, !717, !718}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !674, file: !678, line: 3, baseType: !345, size: 32, align: 32)
!678 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!679 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !674, file: !678, line: 4, baseType: !345, size: 32, align: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !674, file: !678, line: 5, baseType: !612, size: 64, align: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !674, file: !678, line: 7, baseType: !451, size: 64, align: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !674, file: !678, line: 8, baseType: !337, size: 64, align: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !674, file: !678, line: 9, baseType: !358, size: 64, align: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !674, file: !678, line: 10, baseType: !358, size: 64, align: 64, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !674, file: !678, line: 11, baseType: !584, size: 64, align: 64, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !674, file: !678, line: 12, baseType: !345, size: 32, align: 32, offset: 448)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !674, file: !678, line: 13, baseType: !358, size: 64, align: 64, offset: 512)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !674, file: !678, line: 15, baseType: !689, size: 64, align: 64, offset: 576)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64, align: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !692}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !339, line: 108, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !695, line: 5, size: 704, align: 64, elements: !696)
!695 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !694, file: !678, line: 3, baseType: !345, size: 32, align: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !694, file: !678, line: 4, baseType: !345, size: 32, align: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !694, file: !678, line: 5, baseType: !612, size: 64, align: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !694, file: !678, line: 7, baseType: !451, size: 64, align: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !694, file: !678, line: 8, baseType: !337, size: 64, align: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !694, file: !678, line: 9, baseType: !358, size: 64, align: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !694, file: !678, line: 10, baseType: !358, size: 64, align: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !694, file: !678, line: 11, baseType: !584, size: 64, align: 64, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !694, file: !678, line: 12, baseType: !345, size: 32, align: 32, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !694, file: !678, line: 13, baseType: !358, size: 64, align: 64, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !694, file: !678, line: 15, baseType: !689, size: 64, align: 64, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !694, file: !678, line: 17, baseType: !709, size: 64, align: 64, offset: 640)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!638, !692}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !674, file: !678, line: 17, baseType: !709, size: 64, align: 64, offset: 640)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !674, file: !714, line: 5, baseType: !358, size: 64, align: 64, offset: 704)
!714 = !DIFile(filename: "../../../src/core/query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!715 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !674, file: !714, line: 6, baseType: !358, size: 64, align: 64, offset: 768)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !674, file: !714, line: 7, baseType: !584, size: 64, align: 64, offset: 832)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !674, file: !714, line: 9, baseType: !421, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !674, file: !714, line: 11, baseType: !421, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !340, file: !344, line: 71, baseType: !720, size: 64, align: 64, offset: 2112)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64, align: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!345, !638, !638}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !340, file: !344, line: 73, baseType: !720, size: 64, align: 64, offset: 2176)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !725, line: 9, baseType: !726)
!725 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64, align: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !729, !729, !729, !729, !729, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !339, line: 117, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !36, line: 28, size: 1280, align: 64, elements: !734)
!734 = !{!735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !768, !769, !770, !771, !772, !773, !774, !775}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !733, file: !36, line: 29, baseType: !345, size: 32, align: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !733, file: !36, line: 30, baseType: !358, size: 64, align: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !733, file: !36, line: 32, baseType: !345, size: 32, align: 32, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !733, file: !36, line: 32, baseType: !345, size: 32, align: 32, offset: 160)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !733, file: !36, line: 34, baseType: !512, size: 64, align: 64, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !733, file: !36, line: 35, baseType: !692, size: 64, align: 64, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !733, file: !36, line: 36, baseType: !337, size: 64, align: 64, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !733, file: !36, line: 37, baseType: !337, size: 64, align: 64, offset: 384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !733, file: !36, line: 38, baseType: !358, size: 64, align: 64, offset: 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !733, file: !36, line: 40, baseType: !345, size: 32, align: 32, offset: 512)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !733, file: !36, line: 41, baseType: !512, size: 64, align: 64, offset: 576)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !733, file: !36, line: 43, baseType: !421, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !733, file: !36, line: 44, baseType: !421, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !733, file: !36, line: 45, baseType: !421, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !733, file: !36, line: 48, baseType: !750, size: 64, align: 64, offset: 704)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !752, line: 14, baseType: !753)
!752 = !DIFile(filename: "command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !752, line: 6, size: 256, align: 64, elements: !754)
!754 = !{!755, !756, !765, !766, !767}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !753, file: !752, line: 7, baseType: !358, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !753, file: !752, line: 9, baseType: !757, size: 64, align: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !759, line: 37, baseType: !760)
!759 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !759, line: 39, size: 192, align: 64, elements: !761)
!761 = !{!762, !763, !764}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !760, file: !759, line: 41, baseType: !450, size: 64, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !760, file: !759, line: 42, baseType: !757, size: 64, align: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !760, file: !759, line: 43, baseType: !757, size: 64, align: 64, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !753, file: !752, line: 10, baseType: !345, size: 32, align: 32, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !753, file: !752, line: 12, baseType: !345, size: 32, align: 32, offset: 160)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !753, file: !752, line: 13, baseType: !345, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !733, file: !36, line: 49, baseType: !358, size: 64, align: 64, offset: 768)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !733, file: !36, line: 51, baseType: !345, size: 32, align: 32, offset: 832)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !733, file: !36, line: 52, baseType: !358, size: 64, align: 64, offset: 896)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !733, file: !36, line: 54, baseType: !584, size: 64, align: 64, offset: 960)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !733, file: !36, line: 55, baseType: !584, size: 64, align: 64, offset: 1024)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !733, file: !36, line: 57, baseType: !358, size: 64, align: 64, offset: 1088)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !733, file: !36, line: 58, baseType: !451, size: 64, align: 64, offset: 1152)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !733, file: !36, line: 60, baseType: !451, size: 64, align: 64, offset: 1216)
!776 = !{!777, !779, !780}
!777 = distinct !DIGlobalVariable(name: "queryclose_tag", scope: !0, file: !778, line: 38, type: !345, isLocal: true, isDefinition: true, variable: i32* @queryclose_tag)
!778 = !DIFile(filename: "fe-queries.c", directory: "/home/lichi/Desktop/irssi/task1")
!779 = distinct !DIGlobalVariable(name: "querycreate_level", scope: !0, file: !778, line: 38, type: !345, isLocal: true, isDefinition: true, variable: i32* @querycreate_level)
!780 = distinct !DIGlobalVariable(name: "query_auto_close", scope: !0, file: !778, line: 38, type: !345, isLocal: true, isDefinition: true, variable: i32* @query_auto_close)
!781 = !{i32 2, !"Dwarf Version", i32 4}
!782 = !{i32 2, !"Debug Info Version", i32 3}
!783 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!784 = distinct !DISubprogram(name: "privmsg_get_query", scope: !778, file: !778, line: 41, type: !785, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !787)
!785 = !DISubroutineType(types: !786)
!786 = !{!672, !337, !638, !345, !345}
!787 = !{}
!788 = !DILocalVariable(name: "server", arg: 1, scope: !784, file: !778, line: 41, type: !337)
!789 = !DIExpression()
!790 = !DILocation(line: 41, column: 42, scope: !784)
!791 = !DILocalVariable(name: "nick", arg: 2, scope: !784, file: !778, line: 41, type: !638)
!792 = !DILocation(line: 41, column: 62, scope: !784)
!793 = !DILocalVariable(name: "own", arg: 3, scope: !784, file: !778, line: 42, type: !345)
!794 = !DILocation(line: 42, column: 13, scope: !784)
!795 = !DILocalVariable(name: "level", arg: 4, scope: !784, file: !778, line: 42, type: !345)
!796 = !DILocation(line: 42, column: 22, scope: !784)
!797 = !DILocalVariable(name: "query", scope: !784, file: !778, line: 44, type: !672)
!798 = !DILocation(line: 44, column: 13, scope: !784)
!799 = !DILocation(line: 46, column: 2, scope: !784)
!800 = distinct !{!800, !799}
!801 = !DILocation(line: 46, column: 45, scope: !802)
!802 = !DILexicalBlockFile(scope: !803, file: !778, discriminator: 1)
!803 = distinct !DILexicalBlock(scope: !804, file: !778, line: 46, column: 10)
!804 = distinct !DILexicalBlock(scope: !784, file: !778, line: 46, column: 4)
!805 = !DILocation(line: 46, column: 27, scope: !802)
!806 = !DILocation(line: 46, column: 12, scope: !802)
!807 = !DILocation(line: 46, column: 10, scope: !802)
!808 = !DILocation(line: 46, column: 11, scope: !809)
!809 = !DILexicalBlockFile(scope: !803, file: !778, discriminator: 2)
!810 = !DILocation(line: 46, column: 10, scope: !811)
!811 = !DILexicalBlockFile(scope: !804, file: !778, discriminator: 3)
!812 = !DILocation(line: 46, column: 33, scope: !813)
!813 = !DILexicalBlockFile(scope: !814, file: !778, discriminator: 4)
!814 = distinct !DILexicalBlock(scope: !803, file: !778, line: 46, column: 31)
!815 = !DILocation(line: 46, column: 42, scope: !816)
!816 = !DILexicalBlockFile(scope: !817, file: !778, discriminator: 5)
!817 = distinct !DILexicalBlock(scope: !803, file: !778, line: 46, column: 40)
!818 = !DILocation(line: 46, column: 132, scope: !816)
!819 = !DILocation(line: 46, column: 7, scope: !820)
!820 = !DILexicalBlockFile(scope: !804, file: !778, discriminator: 6)
!821 = !DILocation(line: 47, column: 9, scope: !784)
!822 = distinct !{!822, !821}
!823 = !DILocation(line: 47, column: 17, scope: !824)
!824 = !DILexicalBlockFile(scope: !825, file: !778, discriminator: 1)
!825 = distinct !DILexicalBlock(scope: !826, file: !778, line: 47, column: 17)
!826 = distinct !DILexicalBlock(scope: !784, file: !778, line: 47, column: 11)
!827 = !DILocation(line: 47, column: 22, scope: !824)
!828 = !DILocation(line: 47, column: 12, scope: !829)
!829 = !DILexicalBlockFile(scope: !830, file: !778, discriminator: 2)
!830 = distinct !DILexicalBlock(scope: !825, file: !778, line: 47, column: 10)
!831 = !DILocation(line: 47, column: 21, scope: !832)
!832 = !DILexicalBlockFile(scope: !833, file: !778, discriminator: 3)
!833 = distinct !DILexicalBlock(scope: !825, file: !778, line: 47, column: 19)
!834 = !DILocation(line: 47, column: 106, scope: !832)
!835 = !DILocation(line: 47, column: 14, scope: !836)
!836 = !DILexicalBlockFile(scope: !826, file: !778, discriminator: 4)
!837 = !DILocation(line: 49, column: 21, scope: !784)
!838 = !DILocation(line: 49, column: 29, scope: !784)
!839 = !DILocation(line: 49, column: 10, scope: !784)
!840 = !DILocation(line: 49, column: 8, scope: !784)
!841 = !DILocation(line: 50, column: 6, scope: !842)
!842 = distinct !DILexicalBlock(scope: !784, file: !778, line: 50, column: 6)
!843 = !DILocation(line: 50, column: 12, scope: !842)
!844 = !DILocation(line: 50, column: 19, scope: !842)
!845 = !DILocation(line: 50, column: 23, scope: !846)
!846 = !DILexicalBlockFile(scope: !842, file: !778, discriminator: 1)
!847 = !DILocation(line: 50, column: 43, scope: !846)
!848 = !DILocation(line: 51, column: 7, scope: !842)
!849 = !DILocation(line: 51, column: 27, scope: !842)
!850 = !DILocation(line: 51, column: 25, scope: !842)
!851 = !DILocation(line: 51, column: 34, scope: !842)
!852 = !DILocation(line: 51, column: 39, scope: !842)
!853 = !DILocation(line: 52, column: 8, scope: !842)
!854 = !DILocation(line: 52, column: 12, scope: !842)
!855 = !DILocation(line: 52, column: 15, scope: !846)
!856 = !DILocation(line: 50, column: 6, scope: !857)
!857 = !DILexicalBlockFile(scope: !784, file: !778, discriminator: 2)
!858 = !DILocation(line: 53, column: 13, scope: !859)
!859 = distinct !DILexicalBlock(scope: !842, file: !778, line: 52, column: 59)
!860 = !DILocation(line: 53, column: 21, scope: !859)
!861 = !DILocation(line: 53, column: 12, scope: !859)
!862 = !DILocation(line: 53, column: 12, scope: !863)
!863 = !DILexicalBlockFile(scope: !859, file: !778, discriminator: 1)
!864 = !DILocation(line: 53, column: 65, scope: !865)
!865 = !DILexicalBlockFile(scope: !859, file: !778, discriminator: 2)
!866 = !DILocation(line: 53, column: 74, scope: !865)
!867 = !DILocation(line: 53, column: 42, scope: !865)
!868 = !DILocation(line: 53, column: 12, scope: !865)
!869 = !DILocation(line: 53, column: 12, scope: !870)
!870 = !DILexicalBlockFile(scope: !859, file: !778, discriminator: 3)
!871 = !DILocation(line: 54, column: 4, scope: !859)
!872 = !DILocation(line: 54, column: 17, scope: !859)
!873 = !DILocation(line: 54, column: 25, scope: !859)
!874 = !DILocation(line: 54, column: 30, scope: !859)
!875 = !DILocation(line: 53, column: 11, scope: !870)
!876 = !DILocation(line: 53, column: 9, scope: !870)
!877 = !DILocation(line: 55, column: 2, scope: !859)
!878 = !DILocation(line: 57, column: 9, scope: !784)
!879 = !DILocation(line: 57, column: 2, scope: !784)
!880 = !DILocation(line: 58, column: 1, scope: !784)
!881 = distinct !DISubprogram(name: "fe_queries_init", scope: !778, file: !778, line: 356, type: !500, isLocal: false, isDefinition: true, scopeLine: 357, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !787)
!882 = !DILocation(line: 358, column: 2, scope: !881)
!883 = !DILocation(line: 359, column: 2, scope: !881)
!884 = !DILocation(line: 360, column: 2, scope: !881)
!885 = !DILocation(line: 362, column: 17, scope: !881)
!886 = !DILocation(line: 363, column: 2, scope: !881)
!887 = !DILocation(line: 365, column: 2, scope: !881)
!888 = !DILocation(line: 366, column: 2, scope: !881)
!889 = !DILocation(line: 367, column: 2, scope: !881)
!890 = !DILocation(line: 368, column: 2, scope: !881)
!891 = !DILocation(line: 369, column: 9, scope: !881)
!892 = !DILocation(line: 370, column: 2, scope: !881)
!893 = !DILocation(line: 371, column: 2, scope: !881)
!894 = !DILocation(line: 372, column: 2, scope: !881)
!895 = !DILocation(line: 373, column: 2, scope: !881)
!896 = !DILocation(line: 375, column: 2, scope: !881)
!897 = !DILocation(line: 376, column: 2, scope: !881)
!898 = !DILocation(line: 377, column: 2, scope: !881)
!899 = !DILocation(line: 379, column: 2, scope: !881)
!900 = !DILocation(line: 380, column: 1, scope: !881)
!901 = distinct !DISubprogram(name: "read_settings", scope: !778, file: !778, line: 344, type: !500, isLocal: true, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !787)
!902 = !DILocation(line: 346, column: 22, scope: !901)
!903 = !DILocation(line: 346, column: 20, scope: !901)
!904 = !DILocation(line: 347, column: 21, scope: !901)
!905 = !DILocation(line: 347, column: 57, scope: !901)
!906 = !DILocation(line: 347, column: 19, scope: !901)
!907 = !DILocation(line: 348, column: 6, scope: !908)
!908 = distinct !DILexicalBlock(scope: !901, file: !778, line: 348, column: 6)
!909 = !DILocation(line: 348, column: 23, scope: !908)
!910 = !DILocation(line: 348, column: 27, scope: !908)
!911 = !DILocation(line: 348, column: 30, scope: !912)
!912 = !DILexicalBlockFile(scope: !908, file: !778, discriminator: 1)
!913 = !DILocation(line: 348, column: 45, scope: !912)
!914 = !DILocation(line: 348, column: 6, scope: !912)
!915 = !DILocation(line: 349, column: 20, scope: !908)
!916 = !DILocation(line: 349, column: 18, scope: !908)
!917 = !DILocation(line: 349, column: 3, scope: !908)
!918 = !DILocation(line: 350, column: 11, scope: !919)
!919 = distinct !DILexicalBlock(scope: !908, file: !778, line: 350, column: 11)
!920 = !DILocation(line: 350, column: 28, scope: !919)
!921 = !DILocation(line: 350, column: 33, scope: !919)
!922 = !DILocation(line: 350, column: 36, scope: !923)
!923 = !DILexicalBlockFile(scope: !919, file: !778, discriminator: 1)
!924 = !DILocation(line: 350, column: 51, scope: !923)
!925 = !DILocation(line: 350, column: 11, scope: !923)
!926 = !DILocation(line: 351, column: 19, scope: !927)
!927 = distinct !DILexicalBlock(scope: !919, file: !778, line: 350, column: 58)
!928 = !DILocation(line: 351, column: 3, scope: !927)
!929 = !DILocation(line: 352, column: 18, scope: !927)
!930 = !DILocation(line: 353, column: 2, scope: !927)
!931 = !DILocation(line: 354, column: 1, scope: !901)
!932 = distinct !DISubprogram(name: "signal_query_created", scope: !778, file: !778, line: 60, type: !933, isLocal: true, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !787)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !672, !450}
!935 = !DILocalVariable(name: "query", arg: 1, scope: !932, file: !778, line: 60, type: !672)
!936 = !DILocation(line: 60, column: 45, scope: !932)
!937 = !DILocalVariable(name: "automatic", arg: 2, scope: !932, file: !778, line: 60, type: !450)
!938 = !DILocation(line: 60, column: 61, scope: !932)
!939 = !DILocalVariable(name: "dest", scope: !932, file: !778, line: 62, type: !940)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_DEST_REC", file: !941, line: 62, baseType: !942)
!941 = !DIFile(filename: "formats.h", directory: "/home/lichi/Desktop/irssi/task1")
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TEXT_DEST_REC", file: !941, line: 50, size: 576, align: 64, elements: !943)
!943 = !{!944, !945, !946, !947, !948, !949, !950, !951, !952, !953}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !942, file: !941, line: 51, baseType: !731, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !942, file: !941, line: 52, baseType: !337, size: 64, align: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !942, file: !941, line: 53, baseType: !638, size: 64, align: 64, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !942, file: !941, line: 54, baseType: !638, size: 64, align: 64, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !942, file: !941, line: 55, baseType: !638, size: 64, align: 64, offset: 256)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !942, file: !941, line: 56, baseType: !638, size: 64, align: 64, offset: 320)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !942, file: !941, line: 57, baseType: !345, size: 32, align: 32, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_priority", scope: !942, file: !941, line: 59, baseType: !345, size: 32, align: 32, offset: 416)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !942, file: !941, line: 60, baseType: !358, size: 64, align: 64, offset: 448)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !942, file: !941, line: 61, baseType: !345, size: 32, align: 32, offset: 512)
!954 = !DILocation(line: 62, column: 23, scope: !932)
!955 = !DILocation(line: 64, column: 2, scope: !932)
!956 = distinct !{!956, !955}
!957 = !DILocation(line: 64, column: 51, scope: !958)
!958 = !DILexicalBlockFile(scope: !959, file: !778, discriminator: 1)
!959 = distinct !DILexicalBlock(scope: !960, file: !778, line: 64, column: 10)
!960 = distinct !DILexicalBlock(scope: !932, file: !778, line: 64, column: 4)
!961 = !DILocation(line: 64, column: 26, scope: !958)
!962 = !DILocation(line: 64, column: 12, scope: !958)
!963 = !DILocation(line: 64, column: 10, scope: !958)
!964 = !DILocation(line: 64, column: 11, scope: !965)
!965 = !DILexicalBlockFile(scope: !959, file: !778, discriminator: 2)
!966 = !DILocation(line: 64, column: 10, scope: !967)
!967 = !DILexicalBlockFile(scope: !960, file: !778, discriminator: 3)
!968 = !DILocation(line: 64, column: 52, scope: !969)
!969 = !DILexicalBlockFile(scope: !970, file: !778, discriminator: 4)
!970 = distinct !DILexicalBlock(scope: !959, file: !778, line: 64, column: 50)
!971 = !DILocation(line: 64, column: 61, scope: !972)
!972 = !DILexicalBlockFile(scope: !973, file: !778, discriminator: 5)
!973 = distinct !DILexicalBlock(scope: !959, file: !778, line: 64, column: 59)
!974 = !DILocation(line: 64, column: 149, scope: !972)
!975 = !DILocation(line: 64, column: 160, scope: !976)
!976 = !DILexicalBlockFile(scope: !960, file: !778, discriminator: 6)
!977 = !DILocation(line: 66, column: 40, scope: !978)
!978 = distinct !DILexicalBlock(scope: !932, file: !778, line: 66, column: 6)
!979 = !DILocation(line: 66, column: 49, scope: !978)
!980 = !DILocation(line: 66, column: 7, scope: !978)
!981 = !DILocation(line: 66, column: 57, scope: !978)
!982 = !DILocation(line: 66, column: 6, scope: !932)
!983 = !DILocation(line: 67, column: 38, scope: !984)
!984 = distinct !DILexicalBlock(scope: !978, file: !778, line: 66, column: 40)
!985 = !DILocation(line: 67, column: 22, scope: !984)
!986 = !DILocation(line: 68, column: 25, scope: !984)
!987 = !DILocation(line: 68, column: 16, scope: !984)
!988 = !DILocation(line: 68, column: 9, scope: !984)
!989 = !DILocation(line: 67, column: 3, scope: !984)
!990 = !DILocation(line: 69, column: 2, scope: !984)
!991 = !DILocation(line: 71, column: 32, scope: !932)
!992 = !DILocation(line: 71, column: 39, scope: !932)
!993 = !DILocation(line: 71, column: 47, scope: !932)
!994 = !DILocation(line: 71, column: 54, scope: !932)
!995 = !DILocation(line: 72, column: 11, scope: !932)
!996 = !DILocation(line: 72, column: 18, scope: !932)
!997 = !DILocation(line: 71, column: 2, scope: !932)
!998 = !DILocation(line: 73, column: 68, scope: !932)
!999 = !DILocation(line: 73, column: 75, scope: !932)
!1000 = !DILocation(line: 73, column: 81, scope: !932)
!1001 = !DILocation(line: 73, column: 88, scope: !932)
!1002 = !DILocation(line: 73, column: 2, scope: !932)
!1003 = !DILocation(line: 75, column: 1, scope: !932)
!1004 = !DILocation(line: 75, column: 1, scope: !1005)
!1005 = !DILexicalBlockFile(scope: !932, file: !778, discriminator: 1)
!1006 = distinct !DISubprogram(name: "signal_query_destroyed", scope: !778, file: !778, line: 84, type: !1007, isLocal: true, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !787)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{null, !672}
!1009 = !DILocalVariable(name: "query", arg: 1, scope: !1006, file: !778, line: 84, type: !672)
!1010 = !DILocation(line: 84, column: 47, scope: !1006)
!1011 = !DILocalVariable(name: "window", scope: !1006, file: !778, line: 86, type: !731)
!1012 = !DILocation(line: 86, column: 14, scope: !1006)
!1013 = !DILocalVariable(name: "dest", scope: !1006, file: !778, line: 87, type: !940)
!1014 = !DILocation(line: 87, column: 23, scope: !1006)
!1015 = !DILocation(line: 89, column: 2, scope: !1006)
!1016 = distinct !{!1016, !1015}
