; ModuleID = './line77-servers-reconnect.o.i'
source_filename = "./line77-servers-reconnect.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._SERVER_CONNECT_REC = type { i32, i32, i32, i8*, i32, i8*, i8*, i8*, i16, i8*, i8*, i32, i8*, %struct._IPADDR*, %struct._IPADDR*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._GIOChannel*, i8, i8*, i8* }
%struct._IPADDR = type { i16, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }
%struct._GSource = type { i8*, %struct._GSourceCallbackFuncs*, %struct._GSourceFuncs*, i32, %struct._GMainContext*, i32, i32, i32, %struct._GSList*, %struct._GSource*, %struct._GSource*, i8*, %struct._GSourcePrivate* }

!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 25, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!38 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!39 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!40 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!41 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!42 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!43 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!44 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!45 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!46 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!47 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!48 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!49 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!50 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!51 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!52 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!53 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!54 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!55 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!56 = !{!57, !58, !62, !64, !72, !79, !111, !90, !434, !71, !384}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !60, line: 46, baseType: !61)
!60 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!61 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !71}
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !60, line: 50, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !60, line: 49, baseType: !70)
!70 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !60, line: 77, baseType: !57)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !73, line: 9, baseType: !74)
!73 = !DIFile(filename: "signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !77, !77, !77, !77, !77, !77}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !81, line: 107, baseType: !82)
!81 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !83, line: 30, size: 2240, align: 64, elements: !84)
!83 = !DIFile(filename: "servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!84 = !{!85, !87, !88, !89, !339, !344, !345, !346, !347, !348, !349, !350, !351, !352, !356, !357, !361, !362, !363, !367, !372, !373, !374, !375, !376, !377, !378, !379, !386, !387, !388, !389, !390, !394, !398, !402, !406, !410, !415, !422, !429, !433}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !86, line: 3, baseType: !70, size: 32, align: 32)
!86 = !DIFile(filename: "server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!87 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !82, file: !86, line: 4, baseType: !70, size: 32, align: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !82, file: !86, line: 6, baseType: !70, size: 32, align: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !82, file: !86, line: 8, baseType: !90, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !81, line: 113, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !83, line: 25, size: 1920, align: 64, elements: !93)
!93 = !{!94, !96, !97, !98, !100, !101, !102, !103, !104, !106, !107, !108, !109, !110, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !92, file: !95, line: 3, baseType: !70, size: 32, align: 32)
!95 = !DIFile(filename: "server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!96 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !92, file: !95, line: 4, baseType: !70, size: 32, align: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !92, file: !95, line: 6, baseType: !70, size: 32, align: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !92, file: !95, line: 9, baseType: !99, size: 64, align: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !92, file: !95, line: 10, baseType: !70, size: 32, align: 32, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !92, file: !95, line: 11, baseType: !99, size: 64, align: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !92, file: !95, line: 11, baseType: !99, size: 64, align: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !92, file: !95, line: 11, baseType: !99, size: 64, align: 64, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !92, file: !95, line: 13, baseType: !105, size: 16, align: 16, offset: 448)
!105 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !92, file: !95, line: 14, baseType: !99, size: 64, align: 64, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !92, file: !95, line: 15, baseType: !99, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !92, file: !95, line: 16, baseType: !70, size: 32, align: 32, offset: 640)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !92, file: !95, line: 17, baseType: !99, size: 64, align: 64, offset: 704)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !92, file: !95, line: 19, baseType: !111, size: 64, align: 64, offset: 768)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !81, line: 99, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !114, line: 22, size: 160, align: 32, elements: !115)
!114 = !DIFile(filename: "network.h", directory: "/home/lichi/Desktop/irssi/task1")
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !113, file: !114, line: 23, baseType: !105, size: 16, align: 16)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !113, file: !114, line: 24, baseType: !118, size: 128, align: 32, offset: 32)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !119, line: 211, size: 128, align: 32, elements: !120)
!119 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !118, file: !119, line: 220, baseType: !122, size: 128, align: 32)
!122 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !118, file: !119, line: 213, size: 128, align: 32, elements: !123)
!123 = !{!124, !131, !136}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !122, file: !119, line: 215, baseType: !125, size: 128, align: 8)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 128, align: 8, elements: !129)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !127, line: 48, baseType: !128)
!127 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!128 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!129 = !{!130}
!130 = !DISubrange(count: 16)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !122, file: !119, line: 217, baseType: !132, size: 128, align: 16)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 128, align: 16, elements: !134)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !127, line: 49, baseType: !105)
!134 = !{!135}
!135 = !DISubrange(count: 8)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !122, file: !119, line: 218, baseType: !137, size: 128, align: 32)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 128, align: 32, elements: !140)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !127, line: 51, baseType: !139)
!139 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!140 = !{!141}
!141 = !DISubrange(count: 4)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !92, file: !95, line: 19, baseType: !111, size: 64, align: 64, offset: 832)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !92, file: !95, line: 21, baseType: !99, size: 64, align: 64, offset: 896)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !92, file: !95, line: 22, baseType: !99, size: 64, align: 64, offset: 960)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !92, file: !95, line: 23, baseType: !99, size: 64, align: 64, offset: 1024)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !92, file: !95, line: 24, baseType: !99, size: 64, align: 64, offset: 1088)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !92, file: !95, line: 26, baseType: !99, size: 64, align: 64, offset: 1152)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !92, file: !95, line: 27, baseType: !99, size: 64, align: 64, offset: 1216)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !92, file: !95, line: 28, baseType: !99, size: 64, align: 64, offset: 1280)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !92, file: !95, line: 29, baseType: !99, size: 64, align: 64, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !92, file: !95, line: 30, baseType: !99, size: 64, align: 64, offset: 1408)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !92, file: !95, line: 31, baseType: !99, size: 64, align: 64, offset: 1472)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !92, file: !95, line: 32, baseType: !99, size: 64, align: 64, offset: 1536)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !92, file: !95, line: 33, baseType: !99, size: 64, align: 64, offset: 1600)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !92, file: !95, line: 35, baseType: !156, size: 64, align: 64, offset: 1664)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !159)
!159 = !{!160, !161, !296, !297, !302, !303, !304, !305, !306, !315, !316, !317, !321, !322, !323, !324, !325, !326, !327, !328}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !158, file: !4, line: 100, baseType: !69, size: 32, align: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !158, file: !4, line: 101, baseType: !162, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !165)
!165 = !{!166, !187, !193, !200, !204, !283, !287, !292}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !164, file: !4, line: 133, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !156, !58, !171, !174, !175}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !172, line: 66, baseType: !173)
!172 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!173 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !178, line: 42, baseType: !179)
!178 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !178, line: 44, size: 128, align: 64, elements: !180)
!180 = !{!181, !185, !186}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !179, file: !178, line: 46, baseType: !182, size: 32, align: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !183, line: 36, baseType: !184)
!183 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !172, line: 45, baseType: !139)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !179, file: !178, line: 47, baseType: !69, size: 32, align: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !179, file: !178, line: 48, baseType: !58, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !164, file: !4, line: 138, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!170, !156, !191, !171, !174, !175}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !164, file: !4, line: 143, baseType: !194, size: 64, align: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!170, !156, !197, !199, !175}
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !172, line: 51, baseType: !198)
!198 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !164, file: !4, line: 147, baseType: !201, size: 64, align: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!170, !156, !175}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !164, file: !4, line: 149, baseType: !205, size: 64, align: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!208, !156, !282}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !211)
!211 = !{!212, !213, !229, !258, !260, !264, !265, !266, !267, !275, !276, !277, !278}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !210, file: !16, line: 174, baseType: !71, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !210, file: !16, line: 175, baseType: !214, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !217)
!217 = !{!218, !222, !223}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !216, file: !16, line: 198, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !71}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !216, file: !16, line: 199, baseType: !219, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !216, file: !16, line: 200, baseType: !224, size: 64, align: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !71, !208, !227, !228}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !210, file: !16, line: 177, baseType: !230, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !234)
!234 = !{!235, !240, !244, !248, !252, !253}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !233, file: !16, line: 216, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!68, !208, !239}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !233, file: !16, line: 218, baseType: !241, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!68, !208}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !233, file: !16, line: 219, baseType: !245, size: 64, align: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!68, !208, !64, !71}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !233, file: !16, line: 222, baseType: !249, size: 64, align: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !208}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !233, file: !16, line: 226, baseType: !64, size: 64, align: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !233, file: !16, line: 227, baseType: !254, size: 64, align: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !210, file: !16, line: 178, baseType: !259, size: 32, align: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !60, line: 55, baseType: !139)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !210, file: !16, line: 180, baseType: !261, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !263)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !210, file: !16, line: 182, baseType: !69, size: 32, align: 32, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !210, file: !16, line: 183, baseType: !259, size: 32, align: 32, offset: 352)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !210, file: !16, line: 184, baseType: !259, size: 32, align: 32, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !210, file: !16, line: 186, baseType: !268, size: 64, align: 64, offset: 448)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !270, line: 37, baseType: !271)
!270 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !270, line: 39, size: 128, align: 64, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !271, file: !270, line: 41, baseType: !71, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !271, file: !270, line: 42, baseType: !268, size: 64, align: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !210, file: !16, line: 188, baseType: !208, size: 64, align: 64, offset: 512)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !16, line: 189, baseType: !208, size: 64, align: 64, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !16, line: 191, baseType: !99, size: 64, align: 64, offset: 640)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !210, file: !16, line: 193, baseType: !279, size: 64, align: 64, offset: 704)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !281)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !164, file: !4, line: 151, baseType: !284, size: 64, align: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !156}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !164, file: !4, line: 152, baseType: !288, size: 64, align: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!170, !156, !291, !175}
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !164, file: !4, line: 155, baseType: !293, size: 64, align: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!291, !156}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !158, file: !4, line: 103, baseType: !58, size: 64, align: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !158, file: !4, line: 104, baseType: !298, size: 64, align: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !299, line: 77, baseType: !300)
!299 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !299, line: 77, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !158, file: !4, line: 105, baseType: !298, size: 64, align: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !158, file: !4, line: 106, baseType: !58, size: 64, align: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !158, file: !4, line: 107, baseType: !259, size: 32, align: 32, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !158, file: !4, line: 109, baseType: !171, size: 64, align: 64, offset: 448)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !158, file: !4, line: 110, baseType: !307, size: 64, align: 64, offset: 512)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !309, line: 39, baseType: !310)
!309 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !309, line: 41, size: 192, align: 64, elements: !311)
!311 = !{!312, !313, !314}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !310, file: !309, line: 43, baseType: !58, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !310, file: !309, line: 44, baseType: !171, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !310, file: !309, line: 45, baseType: !171, size: 64, align: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !158, file: !4, line: 111, baseType: !307, size: 64, align: 64, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !158, file: !4, line: 112, baseType: !307, size: 64, align: 64, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !158, file: !4, line: 113, baseType: !318, size: 48, align: 8, offset: 704)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 48, align: 8, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 6)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !158, file: !4, line: 117, baseType: !259, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !158, file: !4, line: 118, baseType: !259, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !158, file: !4, line: 119, baseType: !259, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !158, file: !4, line: 120, baseType: !259, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !158, file: !4, line: 121, baseType: !259, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !158, file: !4, line: 122, baseType: !259, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !158, file: !4, line: 124, baseType: !71, size: 64, align: 64, offset: 768)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !158, file: !4, line: 125, baseType: !71, size: 64, align: 64, offset: 832)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !92, file: !95, line: 38, baseType: !139, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !92, file: !95, line: 39, baseType: !139, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !92, file: !95, line: 40, baseType: !139, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !92, file: !95, line: 41, baseType: !139, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !92, file: !95, line: 42, baseType: !139, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !92, file: !95, line: 43, baseType: !139, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !92, file: !95, line: 44, baseType: !139, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !92, file: !95, line: 45, baseType: !139, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !92, file: !95, line: 46, baseType: !99, size: 64, align: 64, offset: 1792)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !92, file: !95, line: 47, baseType: !99, size: 64, align: 64, offset: 1856)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !82, file: !86, line: 9, baseType: !340, size: 64, align: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !341, line: 75, baseType: !342)
!341 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !343, line: 139, baseType: !198)
!343 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!344 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !82, file: !86, line: 10, baseType: !340, size: 64, align: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !82, file: !86, line: 12, baseType: !99, size: 64, align: 64, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !82, file: !86, line: 13, baseType: !99, size: 64, align: 64, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !82, file: !86, line: 15, baseType: !139, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !82, file: !86, line: 16, baseType: !139, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !82, file: !86, line: 17, baseType: !139, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !82, file: !86, line: 18, baseType: !139, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !82, file: !86, line: 19, baseType: !139, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !82, file: !86, line: 21, baseType: !353, size: 64, align: 64, offset: 512)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !81, line: 102, baseType: !355)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !81, line: 102, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !82, file: !86, line: 22, baseType: !70, size: 32, align: 32, offset: 576)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !82, file: !86, line: 25, baseType: !358, size: 128, align: 64, offset: 640)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 128, align: 64, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 2)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !82, file: !86, line: 26, baseType: !70, size: 32, align: 32, offset: 768)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !82, file: !86, line: 27, baseType: !70, size: 32, align: 32, offset: 800)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !82, file: !86, line: 29, baseType: !364, size: 64, align: 64, offset: 832)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !81, line: 103, baseType: !366)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !81, line: 103, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !82, file: !86, line: 30, baseType: !368, size: 64, align: 64, offset: 896)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !370, line: 37, baseType: !371)
!370 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !370, line: 37, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !82, file: !86, line: 32, baseType: !99, size: 64, align: 64, offset: 960)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !82, file: !86, line: 33, baseType: !99, size: 64, align: 64, offset: 1024)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !82, file: !86, line: 34, baseType: !99, size: 64, align: 64, offset: 1088)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !82, file: !86, line: 35, baseType: !139, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !82, file: !86, line: 36, baseType: !139, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !82, file: !86, line: 37, baseType: !139, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !82, file: !86, line: 38, baseType: !139, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !82, file: !86, line: 40, baseType: !380, size: 128, align: 64, offset: 1216)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !60, line: 504, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !60, line: 506, size: 128, align: 64, elements: !382)
!382 = !{!383, !385}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !381, file: !60, line: 508, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !60, line: 48, baseType: !198)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !381, file: !60, line: 509, baseType: !384, size: 64, align: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !82, file: !86, line: 41, baseType: !340, size: 64, align: 64, offset: 1344)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !82, file: !86, line: 42, baseType: !70, size: 32, align: 32, offset: 1408)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !82, file: !86, line: 44, baseType: !268, size: 64, align: 64, offset: 1472)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !82, file: !86, line: 45, baseType: !268, size: 64, align: 64, offset: 1536)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !82, file: !86, line: 53, baseType: !391, size: 64, align: 64, offset: 1600)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !79, !62, !70}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !82, file: !86, line: 55, baseType: !395, size: 64, align: 64, offset: 1664)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!70, !79, !61}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !82, file: !86, line: 57, baseType: !399, size: 64, align: 64, offset: 1728)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!70, !79, !62}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !82, file: !86, line: 60, baseType: !403, size: 64, align: 64, offset: 1792)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!62, !79}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !82, file: !86, line: 62, baseType: !407, size: 64, align: 64, offset: 1856)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !79, !62, !62, !70}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !82, file: !86, line: 65, baseType: !411, size: 64, align: 64, offset: 1920)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!414, !79, !62, !62}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !82, file: !86, line: 69, baseType: !416, size: 64, align: 64, offset: 1984)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!419, !79, !62}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !81, line: 109, baseType: !421)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !81, line: 109, flags: DIFlagFwdDecl)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !82, file: !86, line: 70, baseType: !423, size: 64, align: 64, offset: 2048)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!426, !79, !62}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !81, line: 110, baseType: !428)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !81, line: 110, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !82, file: !86, line: 71, baseType: !430, size: 64, align: 64, offset: 2112)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!70, !62, !62}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !82, file: !86, line: 73, baseType: !430, size: 64, align: 64, offset: 2176)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "RECONNECT_REC", file: !436, line: 13, baseType: !437)
!436 = !DIFile(filename: "servers-reconnect.h", directory: "/home/lichi/Desktop/irssi/task1")
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !436, line: 8, size: 192, align: 64, elements: !438)
!438 = !{!439, !440, !441}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !437, file: !436, line: 9, baseType: !70, size: 32, align: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "next_connect", scope: !437, file: !436, line: 10, baseType: !340, size: 64, align: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !437, file: !436, line: 12, baseType: !90, size: 64, align: 64, offset: 128)
!442 = !{!443, !445, !446, !447, !448}
!443 = distinct !DIGlobalVariable(name: "reconnects", scope: !0, file: !444, line: 33, type: !268, isLocal: false, isDefinition: true, variable: %struct._GSList** @reconnects)
!444 = !DIFile(filename: "servers-reconnect.c", directory: "/home/lichi/Desktop/irssi/task1")
!445 = distinct !DIGlobalVariable(name: "last_reconnect_tag", scope: !0, file: !444, line: 34, type: !70, isLocal: true, isDefinition: true, variable: i32* @last_reconnect_tag)
!446 = distinct !DIGlobalVariable(name: "reconnect_timeout_tag", scope: !0, file: !444, line: 35, type: !70, isLocal: true, isDefinition: true, variable: i32* @reconnect_timeout_tag)
!447 = distinct !DIGlobalVariable(name: "connect_timeout", scope: !0, file: !444, line: 37, type: !70, isLocal: true, isDefinition: true, variable: i32* @connect_timeout)
!448 = distinct !DIGlobalVariable(name: "reconnect_time", scope: !0, file: !444, line: 36, type: !70, isLocal: true, isDefinition: true, variable: i32* @reconnect_time)
!449 = !{i32 2, !"Dwarf Version", i32 4}
!450 = !{i32 2, !"Debug Info Version", i32 3}
!451 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!452 = distinct !DISubprogram(name: "reconnect_save_status", scope: !444, file: !444, line: 39, type: !453, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !455)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !90, !79}
!455 = !{}
!456 = !DILocalVariable(name: "conn", arg: 1, scope: !452, file: !444, line: 39, type: !90)
!457 = !DIExpression()
!458 = !DILocation(line: 39, column: 48, scope: !452)
!459 = !DILocalVariable(name: "server", arg: 2, scope: !452, file: !444, line: 39, type: !79)
!460 = !DILocation(line: 39, column: 66, scope: !452)
!461 = !DILocation(line: 41, column: 16, scope: !452)
!462 = !DILocation(line: 41, column: 22, scope: !452)
!463 = !DILocation(line: 41, column: 9, scope: !452)
!464 = !DILocation(line: 42, column: 23, scope: !452)
!465 = !DILocation(line: 42, column: 31, scope: !452)
!466 = !DILocation(line: 42, column: 14, scope: !452)
!467 = !DILocation(line: 42, column: 2, scope: !452)
!468 = !DILocation(line: 42, column: 8, scope: !452)
!469 = !DILocation(line: 42, column: 12, scope: !452)
!470 = !DILocation(line: 44, column: 9, scope: !452)
!471 = !DILocation(line: 44, column: 15, scope: !452)
!472 = !DILocation(line: 44, column: 2, scope: !452)
!473 = !DILocation(line: 45, column: 23, scope: !452)
!474 = !DILocation(line: 45, column: 31, scope: !452)
!475 = !DILocation(line: 45, column: 22, scope: !452)
!476 = !DILocation(line: 45, column: 22, scope: !477)
!477 = !DILexicalBlockFile(scope: !452, file: !444, discriminator: 1)
!478 = !DILocation(line: 46, column: 12, scope: !452)
!479 = !DILocation(line: 46, column: 20, scope: !452)
!480 = !DILocation(line: 46, column: 3, scope: !452)
!481 = !DILocation(line: 45, column: 22, scope: !482)
!482 = !DILexicalBlockFile(scope: !452, file: !444, discriminator: 2)
!483 = !DILocation(line: 45, column: 22, scope: !484)
!484 = !DILexicalBlockFile(scope: !452, file: !444, discriminator: 3)
!485 = !DILocation(line: 45, column: 2, scope: !484)
!486 = !DILocation(line: 45, column: 8, scope: !484)
!487 = !DILocation(line: 45, column: 20, scope: !484)
!488 = !DILocation(line: 48, column: 7, scope: !489)
!489 = distinct !DILexicalBlock(scope: !452, file: !444, line: 48, column: 6)
!490 = !DILocation(line: 48, column: 15, scope: !489)
!491 = !DILocation(line: 48, column: 6, scope: !452)
!492 = !DILocation(line: 53, column: 10, scope: !493)
!493 = distinct !DILexicalBlock(scope: !489, file: !444, line: 48, column: 26)
!494 = !DILocation(line: 53, column: 16, scope: !493)
!495 = !DILocation(line: 53, column: 3, scope: !493)
!496 = !DILocation(line: 54, column: 20, scope: !493)
!497 = !DILocation(line: 54, column: 28, scope: !493)
!498 = !DILocation(line: 54, column: 37, scope: !493)
!499 = !DILocation(line: 54, column: 20, scope: !500)
!500 = !DILexicalBlockFile(scope: !493, file: !444, discriminator: 1)
!501 = !DILocation(line: 55, column: 13, scope: !493)
!502 = !DILocation(line: 55, column: 21, scope: !493)
!503 = !DILocation(line: 55, column: 30, scope: !493)
!504 = !DILocation(line: 55, column: 4, scope: !493)
!505 = !DILocation(line: 54, column: 20, scope: !506)
!506 = !DILexicalBlockFile(scope: !493, file: !444, discriminator: 2)
!507 = !DILocation(line: 54, column: 20, scope: !508)
!508 = !DILexicalBlockFile(scope: !493, file: !444, discriminator: 3)
!509 = !DILocation(line: 54, column: 3, scope: !508)
!510 = !DILocation(line: 54, column: 9, scope: !508)
!511 = !DILocation(line: 54, column: 18, scope: !508)
!512 = !DILocation(line: 56, column: 2, scope: !493)
!513 = !DILocation(line: 58, column: 49, scope: !452)
!514 = !DILocation(line: 58, column: 55, scope: !452)
!515 = !DILocation(line: 58, column: 2, scope: !452)
!516 = !DILocation(line: 59, column: 1, scope: !452)
!517 = distinct !DISubprogram(name: "server_reconnect_destroy", scope: !444, file: !444, line: 79, type: !518, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !455)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !434}
!520 = !DILocalVariable(name: "rec", arg: 1, scope: !517, file: !444, line: 79, type: !434)
!521 = !DILocation(line: 79, column: 46, scope: !517)
!522 = !DILocation(line: 81, column: 2, scope: !517)
!523 = distinct !{!523, !522}
!524 = !DILocation(line: 81, column: 10, scope: !525)
!525 = !DILexicalBlockFile(scope: !526, file: !444, discriminator: 1)
!526 = distinct !DILexicalBlock(scope: !527, file: !444, line: 81, column: 10)
!527 = distinct !DILexicalBlock(scope: !517, file: !444, line: 81, column: 4)
!528 = !DILocation(line: 81, column: 14, scope: !525)
!529 = !DILocation(line: 81, column: 5, scope: !530)
!530 = !DILexicalBlockFile(scope: !531, file: !444, discriminator: 2)
!531 = distinct !DILexicalBlock(scope: !526, file: !444, line: 81, column: 3)
!532 = !DILocation(line: 81, column: 14, scope: !533)
!533 = !DILexicalBlockFile(scope: !534, file: !444, discriminator: 3)
!534 = distinct !DILexicalBlock(scope: !526, file: !444, line: 81, column: 12)
!535 = !DILocation(line: 81, column: 98, scope: !533)
!536 = !DILocation(line: 81, column: 109, scope: !537)
!537 = !DILexicalBlockFile(scope: !527, file: !444, discriminator: 4)
!538 = !DILocation(line: 83, column: 30, scope: !517)
!539 = !DILocation(line: 83, column: 42, scope: !517)
!540 = !DILocation(line: 83, column: 15, scope: !517)
!541 = !DILocation(line: 83, column: 13, scope: !517)
!542 = !DILocation(line: 85, column: 44, scope: !517)
!543 = !DILocation(line: 85, column: 2, scope: !517)
!544 = !DILocation(line: 86, column: 23, scope: !517)
!545 = !DILocation(line: 86, column: 28, scope: !517)
!546 = !DILocation(line: 86, column: 2, scope: !517)
!547 = !DILocation(line: 87, column: 9, scope: !517)
!548 = !DILocation(line: 87, column: 2, scope: !517)
!549 = !DILocation(line: 89, column: 6, scope: !550)
!550 = distinct !DILexicalBlock(scope: !517, file: !444, line: 89, column: 6)
!551 = !DILocation(line: 89, column: 17, scope: !550)
!552 = !DILocation(line: 89, column: 6, scope: !517)
!553 = !DILocation(line: 90, column: 25, scope: !550)
!554 = !DILocation(line: 90, column: 6, scope: !550)
!555 = !DILocation(line: 91, column: 1, scope: !517)
!556 = distinct !DISubprogram(name: "servers_reconnect_init", scope: !444, file: !444, line: 496, type: !256, isLocal: false, isDefinition: true, scopeLine: 497, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !455)
!557 = !DILocation(line: 498, column: 2, scope: !556)
!558 = !DILocation(line: 499, column: 2, scope: !556)
!559 = !DILocation(line: 501, column: 13, scope: !556)
!560 = !DILocation(line: 502, column: 21, scope: !556)
!561 = !DILocation(line: 504, column: 26, scope: !556)
!562 = !DILocation(line: 504, column: 24, scope: !556)
!563 = !DILocation(line: 505, column: 2, scope: !556)
!564 = !DILocation(line: 507, column: 2, scope: !556)
!565 = !DILocation(line: 508, column: 2, scope: !556)
!566 = !DILocation(line: 509, column: 2, scope: !556)
!567 = !DILocation(line: 510, column: 2, scope: !556)
!568 = !DILocation(line: 511, column: 2, scope: !556)
!569 = !DILocation(line: 513, column: 2, scope: !556)
!570 = !DILocation(line: 514, column: 2, scope: !556)
!571 = !DILocation(line: 515, column: 2, scope: !556)
!572 = !DILocation(line: 516, column: 1, scope: !556)
!573 = distinct !DISubprogram(name: "server_reconnect_timeout", scope: !444, file: !444, line: 93, type: !574, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !455)
!574 = !DISubroutineType(types: !575)
!575 = !{!70}
!576 = !DILocalVariable(name: "conn", scope: !573, file: !444, line: 95, type: !90)
!577 = !DILocation(line: 95, column: 22, scope: !573)
!578 = !DILocalVariable(name: "list", scope: !573, file: !444, line: 96, type: !268)
!579 = !DILocation(line: 96, column: 10, scope: !573)
!580 = !DILocalVariable(name: "tmp", scope: !573, file: !444, line: 96, type: !268)
!581 = !DILocation(line: 96, column: 17, scope: !573)
!582 = !DILocalVariable(name: "next", scope: !573, file: !444, line: 96, type: !268)
!583 = !DILocation(line: 96, column: 23, scope: !573)
!584 = !DILocalVariable(name: "now", scope: !573, file: !444, line: 97, type: !340)
!585 = !DILocation(line: 97, column: 9, scope: !573)
!586 = !DILocation(line: 99, column: 8, scope: !573)
!587 = !DILocation(line: 99, column: 6, scope: !573)
!588 = !DILocation(line: 102, column: 13, scope: !589)
!589 = distinct !DILexicalBlock(scope: !573, file: !444, line: 102, column: 2)
!590 = !DILocation(line: 102, column: 11, scope: !589)
!591 = !DILocation(line: 102, column: 7, scope: !589)
!592 = !DILocation(line: 102, column: 22, scope: !593)
!593 = !DILexicalBlockFile(scope: !594, file: !444, discriminator: 1)
!594 = distinct !DILexicalBlock(scope: !589, file: !444, line: 102, column: 2)
!595 = !DILocation(line: 102, column: 26, scope: !593)
!596 = !DILocation(line: 102, column: 2, scope: !593)
!597 = !DILocalVariable(name: "server", scope: !598, file: !444, line: 103, type: !79)
!598 = distinct !DILexicalBlock(scope: !594, file: !444, line: 102, column: 46)
!599 = !DILocation(line: 103, column: 15, scope: !598)
!600 = !DILocation(line: 103, column: 24, scope: !598)
!601 = !DILocation(line: 103, column: 29, scope: !598)
!602 = !DILocation(line: 105, column: 10, scope: !598)
!603 = !DILocation(line: 105, column: 15, scope: !598)
!604 = !DILocation(line: 105, column: 8, scope: !598)
!605 = !DILocation(line: 106, column: 8, scope: !606)
!606 = distinct !DILexicalBlock(scope: !598, file: !444, line: 106, column: 7)
!607 = !DILocation(line: 106, column: 16, scope: !606)
!608 = !DILocation(line: 106, column: 26, scope: !606)
!609 = !DILocation(line: 107, column: 7, scope: !606)
!610 = !DILocation(line: 107, column: 15, scope: !606)
!611 = !DILocation(line: 107, column: 30, scope: !606)
!612 = !DILocation(line: 107, column: 28, scope: !606)
!613 = !DILocation(line: 107, column: 48, scope: !606)
!614 = !DILocation(line: 107, column: 46, scope: !606)
!615 = !DILocation(line: 107, column: 52, scope: !606)
!616 = !DILocation(line: 108, column: 7, scope: !606)
!617 = !DILocation(line: 108, column: 23, scope: !606)
!618 = !DILocation(line: 106, column: 7, scope: !619)
!619 = !DILexicalBlockFile(scope: !598, file: !444, discriminator: 1)
!620 = !DILocation(line: 109, column: 4, scope: !621)
!621 = distinct !DILexicalBlock(scope: !606, file: !444, line: 108, column: 28)
!622 = !DILocation(line: 109, column: 12, scope: !621)
!623 = !DILocation(line: 109, column: 28, scope: !621)
!624 = !DILocation(line: 110, column: 22, scope: !621)
!625 = !DILocation(line: 110, column: 4, scope: !621)
!626 = !DILocation(line: 111, column: 3, scope: !621)
!627 = !DILocation(line: 112, column: 2, scope: !598)
!628 = !DILocation(line: 102, column: 40, scope: !629)
!629 = !DILexicalBlockFile(scope: !594, file: !444, discriminator: 2)
!630 = !DILocation(line: 102, column: 38, scope: !629)
!631 = !DILocation(line: 102, column: 2, scope: !629)
!632 = distinct !{!632, !633}
!633 = !DILocation(line: 102, column: 2, scope: !573)
!634 = !DILocation(line: 114, column: 13, scope: !635)
!635 = distinct !DILexicalBlock(scope: !573, file: !444, line: 114, column: 2)
!636 = !DILocation(line: 114, column: 11, scope: !635)
!637 = !DILocation(line: 114, column: 7, scope: !635)
!638 = !DILocation(line: 114, column: 29, scope: !639)
!639 = !DILexicalBlockFile(scope: !640, file: !444, discriminator: 1)
!640 = distinct !DILexicalBlock(scope: !635, file: !444, line: 114, column: 2)
!641 = !DILocation(line: 114, column: 33, scope: !639)
!642 = !DILocation(line: 114, column: 2, scope: !639)
!643 = !DILocalVariable(name: "server", scope: !644, file: !444, line: 115, type: !79)
!644 = distinct !DILexicalBlock(scope: !640, file: !444, line: 114, column: 53)
!645 = !DILocation(line: 115, column: 15, scope: !644)
!646 = !DILocation(line: 115, column: 24, scope: !644)
!647 = !DILocation(line: 115, column: 29, scope: !644)
!648 = !DILocation(line: 117, column: 10, scope: !644)
!649 = !DILocation(line: 117, column: 15, scope: !644)
!650 = !DILocation(line: 117, column: 8, scope: !644)
!651 = !DILocation(line: 118, column: 7, scope: !652)
!652 = distinct !DILexicalBlock(scope: !644, file: !444, line: 118, column: 7)
!653 = !DILocation(line: 118, column: 15, scope: !652)
!654 = !DILocation(line: 118, column: 30, scope: !652)
!655 = !DILocation(line: 118, column: 28, scope: !652)
!656 = !DILocation(line: 118, column: 48, scope: !652)
!657 = !DILocation(line: 118, column: 46, scope: !652)
!658 = !DILocation(line: 118, column: 52, scope: !652)
!659 = !DILocation(line: 119, column: 7, scope: !652)
!660 = !DILocation(line: 119, column: 23, scope: !652)
!661 = !DILocation(line: 118, column: 7, scope: !662)
!662 = !DILexicalBlockFile(scope: !644, file: !444, discriminator: 1)
!663 = !DILocation(line: 120, column: 8, scope: !664)
!664 = distinct !DILexicalBlock(scope: !665, file: !444, line: 120, column: 8)
!665 = distinct !DILexicalBlock(scope: !652, file: !444, line: 119, column: 28)
!666 = !DILocation(line: 120, column: 16, scope: !664)
!667 = !DILocation(line: 120, column: 28, scope: !664)
!668 = !DILocation(line: 120, column: 8, scope: !665)
!669 = !DILocation(line: 121, column: 21, scope: !670)
!670 = distinct !DILexicalBlock(scope: !664, file: !444, line: 120, column: 35)
!671 = !DILocation(line: 121, column: 29, scope: !670)
!672 = !DILocation(line: 121, column: 5, scope: !670)
!673 = !DILocation(line: 122, column: 5, scope: !670)
!674 = !DILocation(line: 122, column: 13, scope: !670)
!675 = !DILocation(line: 122, column: 25, scope: !670)
!676 = !DILocation(line: 123, column: 4, scope: !670)
!677 = !DILocation(line: 124, column: 4, scope: !665)
!678 = !DILocation(line: 124, column: 12, scope: !665)
!679 = !DILocation(line: 124, column: 28, scope: !665)
!680 = !DILocation(line: 125, column: 26, scope: !665)
!681 = !DILocation(line: 125, column: 4, scope: !665)
!682 = !DILocation(line: 126, column: 3, scope: !665)
!683 = !DILocation(line: 127, column: 2, scope: !644)
!684 = !DILocation(line: 114, column: 47, scope: !685)
!685 = !DILexicalBlockFile(scope: !640, file: !444, discriminator: 2)
!686 = !DILocation(line: 114, column: 45, scope: !685)
!687 = !DILocation(line: 114, column: 2, scope: !685)
!688 = distinct !{!688, !689}
!689 = !DILocation(line: 114, column: 2, scope: !573)
!690 = !DILocation(line: 132, column: 22, scope: !573)
!691 = !DILocation(line: 132, column: 9, scope: !573)
!692 = !DILocation(line: 132, column: 7, scope: !573)
!693 = !DILocation(line: 133, column: 13, scope: !694)
!694 = distinct !DILexicalBlock(scope: !573, file: !444, line: 133, column: 2)
!695 = !DILocation(line: 133, column: 11, scope: !694)
!696 = !DILocation(line: 133, column: 7, scope: !694)
!697 = !DILocation(line: 133, column: 19, scope: !698)
!698 = !DILexicalBlockFile(scope: !699, file: !444, discriminator: 1)
!699 = distinct !DILexicalBlock(scope: !694, file: !444, line: 133, column: 2)
!700 = !DILocation(line: 133, column: 23, scope: !698)
!701 = !DILocation(line: 133, column: 2, scope: !698)
!702 = !DILocalVariable(name: "rec", scope: !703, file: !444, line: 134, type: !434)
!703 = distinct !DILexicalBlock(scope: !699, file: !444, line: 133, column: 48)
!704 = !DILocation(line: 134, column: 18, scope: !703)
!705 = !DILocation(line: 134, column: 24, scope: !703)
!706 = !DILocation(line: 134, column: 29, scope: !703)
!707 = !DILocation(line: 136, column: 20, scope: !708)
!708 = distinct !DILexicalBlock(scope: !703, file: !444, line: 136, column: 7)
!709 = !DILocation(line: 136, column: 32, scope: !708)
!710 = !DILocation(line: 136, column: 7, scope: !708)
!711 = !DILocation(line: 136, column: 37, scope: !708)
!712 = !DILocation(line: 136, column: 7, scope: !703)
!713 = !DILocation(line: 137, column: 4, scope: !708)
!714 = !DILocation(line: 139, column: 7, scope: !715)
!715 = distinct !DILexicalBlock(scope: !703, file: !444, line: 139, column: 7)
!716 = !DILocation(line: 139, column: 12, scope: !715)
!717 = !DILocation(line: 139, column: 28, scope: !715)
!718 = !DILocation(line: 139, column: 25, scope: !715)
!719 = !DILocation(line: 139, column: 7, scope: !703)
!720 = !DILocation(line: 140, column: 11, scope: !721)
!721 = distinct !DILexicalBlock(scope: !715, file: !444, line: 139, column: 33)
!722 = !DILocation(line: 140, column: 16, scope: !721)
!723 = !DILocation(line: 140, column: 9, scope: !721)
!724 = !DILocation(line: 141, column: 23, scope: !721)
!725 = !DILocation(line: 141, column: 4, scope: !721)
!726 = !DILocation(line: 142, column: 29, scope: !721)
!727 = !DILocation(line: 142, column: 4, scope: !721)
!728 = !DILocation(line: 143, column: 19, scope: !721)
!729 = !DILocation(line: 143, column: 4, scope: !721)
!730 = !DILocation(line: 144, column: 25, scope: !721)
!731 = !DILocation(line: 144, column: 4, scope: !721)
!732 = !DILocation(line: 145, column: 3, scope: !721)
!733 = !DILocation(line: 146, column: 2, scope: !703)
!734 = !DILocation(line: 133, column: 37, scope: !735)
!735 = !DILexicalBlockFile(scope: !699, file: !444, discriminator: 2)
!736 = !DILocation(line: 133, column: 42, scope: !735)
!737 = !DILocation(line: 133, column: 35, scope: !735)
!738 = !DILocation(line: 133, column: 2, scope: !735)
!739 = distinct !{!739, !740}
!740 = !DILocation(line: 133, column: 2, scope: !573)
!741 = !DILocation(line: 148, column: 15, scope: !573)
!742 = !DILocation(line: 148, column: 2, scope: !573)
!743 = !DILocation(line: 149, column: 2, scope: !573)
!744 = distinct !DISubprogram(name: "read_settings", scope: !444, file: !444, line: 490, type: !256, isLocal: true, isDefinition: true, scopeLine: 491, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !455)
!745 = !DILocation(line: 492, column: 19, scope: !744)
!746 = !DILocation(line: 492, column: 61, scope: !744)
!747 = !DILocation(line: 492, column: 17, scope: !744)
!748 = !DILocation(line: 493, column: 27, scope: !744)
!749 = !DILocation(line: 493, column: 70, scope: !744)
!750 = !DILocation(line: 493, column: 25, scope: !744)
!751 = !DILocation(line: 494, column: 1, scope: !744)
!752 = distinct !DISubprogram(name: "sig_reconnect", scope: !444, file: !444, line: 232, type: !753, isLocal: true, isDefinition: true, scopeLine: 233, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !455)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !79}
!755 = !DILocalVariable(name: "server", arg: 1, scope: !752, file: !444, line: 232, type: !79)
!756 = !DILocation(line: 232, column: 39, scope: !752)
!757 = !DILocalVariable(name: "conn", scope: !752, file: !444, line: 234, type: !90)
!758 = !DILocation(line: 234, column: 22, scope: !752)
!759 = !DILocalVariable(name: "sserver", scope: !752, file: !444, line: 235, type: !760)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_SETUP_REC", file: !81, line: 114, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_SETUP_REC", file: !763, line: 13, size: 1408, align: 64, elements: !764)
!763 = !DIFile(filename: "servers-setup.h", directory: "/home/lichi/Desktop/irssi/task1")
!764 = !{!765, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !762, file: !766, line: 1, baseType: !70, size: 32, align: 32)
!766 = !DIFile(filename: "server-setup-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!767 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !762, file: !766, line: 2, baseType: !70, size: 32, align: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !762, file: !766, line: 4, baseType: !99, size: 64, align: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !762, file: !766, line: 6, baseType: !105, size: 16, align: 16, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !762, file: !766, line: 7, baseType: !99, size: 64, align: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !762, file: !766, line: 8, baseType: !70, size: 32, align: 32, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !762, file: !766, line: 9, baseType: !99, size: 64, align: 64, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !762, file: !766, line: 11, baseType: !70, size: 32, align: 32, offset: 384)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !762, file: !766, line: 12, baseType: !99, size: 64, align: 64, offset: 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !762, file: !766, line: 14, baseType: !99, size: 64, align: 64, offset: 512)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !762, file: !766, line: 15, baseType: !99, size: 64, align: 64, offset: 576)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !762, file: !766, line: 16, baseType: !99, size: 64, align: 64, offset: 640)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !762, file: !766, line: 17, baseType: !99, size: 64, align: 64, offset: 704)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !762, file: !766, line: 18, baseType: !99, size: 64, align: 64, offset: 768)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !762, file: !766, line: 19, baseType: !99, size: 64, align: 64, offset: 832)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !762, file: !766, line: 20, baseType: !99, size: 64, align: 64, offset: 896)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !762, file: !766, line: 21, baseType: !99, size: 64, align: 64, offset: 960)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "own_host", scope: !762, file: !766, line: 23, baseType: !99, size: 64, align: 64, offset: 1024)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !762, file: !766, line: 24, baseType: !111, size: 64, align: 64, offset: 1088)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !762, file: !766, line: 24, baseType: !111, size: 64, align: 64, offset: 1152)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !762, file: !766, line: 26, baseType: !340, size: 64, align: 64, offset: 1216)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "autoconnect", scope: !762, file: !766, line: 28, baseType: !139, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "no_proxy", scope: !762, file: !766, line: 29, baseType: !139, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "last_failed", scope: !762, file: !766, line: 30, baseType: !139, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !762, file: !766, line: 31, baseType: !139, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !762, file: !766, line: 32, baseType: !139, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !762, file: !766, line: 33, baseType: !139, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !762, file: !766, line: 34, baseType: !139, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !762, file: !766, line: 36, baseType: !368, size: 64, align: 64, offset: 1344)
!795 = !DILocation(line: 235, column: 20, scope: !752)
!796 = !DILocalVariable(name: "tmp", scope: !752, file: !444, line: 236, type: !268)
!797 = !DILocation(line: 236, column: 10, scope: !752)
!798 = !DILocalVariable(name: "use_next", scope: !752, file: !444, line: 237, type: !70)
!799 = !DILocation(line: 237, column: 6, scope: !752)
!800 = !DILocalVariable(name: "through", scope: !752, file: !444, line: 237, type: !70)
!801 = !DILocation(line: 237, column: 16, scope: !752)
!802 = !DILocalVariable(name: "now", scope: !752, file: !444, line: 238, type: !340)
!803 = !DILocation(line: 238, column: 9, scope: !752)
!804 = !DILocation(line: 240, column: 2, scope: !752)
!805 = distinct !{!805, !804}
!806 = !DILocation(line: 240, column: 45, scope: !807)
!807 = !DILexicalBlockFile(scope: !808, file: !444, discriminator: 1)
!808 = distinct !DILexicalBlock(scope: !809, file: !444, line: 240, column: 10)
!809 = distinct !DILexicalBlock(scope: !752, file: !444, line: 240, column: 4)
!810 = !DILocation(line: 240, column: 27, scope: !807)
!811 = !DILocation(line: 240, column: 12, scope: !807)
!812 = !DILocation(line: 240, column: 10, scope: !807)
!813 = !DILocation(line: 240, column: 11, scope: !814)
!814 = !DILexicalBlockFile(scope: !808, file: !444, discriminator: 2)
!815 = !DILocation(line: 240, column: 10, scope: !816)
!816 = !DILexicalBlockFile(scope: !809, file: !444, discriminator: 3)
!817 = !DILocation(line: 240, column: 33, scope: !818)
!818 = !DILexicalBlockFile(scope: !819, file: !444, discriminator: 4)
!819 = distinct !DILexicalBlock(scope: !808, file: !444, line: 240, column: 31)
!820 = !DILocation(line: 240, column: 42, scope: !821)
!821 = !DILexicalBlockFile(scope: !822, file: !444, discriminator: 5)
!822 = distinct !DILexicalBlock(scope: !808, file: !444, line: 240, column: 40)
!823 = !DILocation(line: 240, column: 132, scope: !821)
!824 = !DILocation(line: 240, column: 143, scope: !825)
!825 = !DILexicalBlockFile(scope: !809, file: !444, discriminator: 6)
!826 = !DILocation(line: 242, column: 6, scope: !827)
!827 = distinct !DILexicalBlock(scope: !752, file: !444, line: 242, column: 6)
!828 = !DILocation(line: 242, column: 21, scope: !827)
!829 = !DILocation(line: 242, column: 27, scope: !827)
!830 = !DILocation(line: 242, column: 33, scope: !831)
!831 = !DILexicalBlockFile(scope: !827, file: !444, discriminator: 1)
!832 = !DILocation(line: 242, column: 42, scope: !831)
!833 = !DILocation(line: 242, column: 32, scope: !831)
!834 = !DILocation(line: 242, column: 58, scope: !831)
!835 = !DILocation(line: 242, column: 63, scope: !836)
!836 = !DILexicalBlockFile(scope: !827, file: !444, discriminator: 2)
!837 = !DILocation(line: 242, column: 72, scope: !836)
!838 = !DILocation(line: 242, column: 62, scope: !836)
!839 = !DILocation(line: 242, column: 85, scope: !836)
!840 = !DILocation(line: 242, column: 90, scope: !841)
!841 = !DILexicalBlockFile(scope: !827, file: !444, discriminator: 3)
!842 = !DILocation(line: 242, column: 99, scope: !841)
!843 = !DILocation(line: 242, column: 108, scope: !841)
!844 = !DILocation(line: 242, column: 116, scope: !841)
!845 = !DILocation(line: 242, column: 30, scope: !841)
!846 = !DILocation(line: 242, column: 35, scope: !847)
!847 = !DILexicalBlockFile(scope: !827, file: !444, discriminator: 4)
!848 = !DILocation(line: 242, column: 44, scope: !847)
!849 = !DILocation(line: 242, column: 34, scope: !847)
!850 = !DILocation(line: 242, column: 6, scope: !847)
!851 = !DILocation(line: 243, column: 3, scope: !827)
!852 = !DILocation(line: 245, column: 38, scope: !752)
!853 = !DILocation(line: 245, column: 46, scope: !752)
!854 = !DILocation(line: 245, column: 9, scope: !752)
!855 = !DILocation(line: 245, column: 7, scope: !752)
!856 = !DILocation(line: 246, column: 9, scope: !752)
!857 = distinct !{!857, !856}
!858 = !DILocation(line: 246, column: 17, scope: !859)
!859 = !DILexicalBlockFile(scope: !860, file: !444, discriminator: 1)
!860 = distinct !DILexicalBlock(scope: !861, file: !444, line: 246, column: 17)
!861 = distinct !DILexicalBlock(scope: !752, file: !444, line: 246, column: 11)
!862 = !DILocation(line: 246, column: 22, scope: !859)
!863 = !DILocation(line: 246, column: 12, scope: !864)
!864 = !DILexicalBlockFile(scope: !865, file: !444, discriminator: 2)
!865 = distinct !DILexicalBlock(scope: !860, file: !444, line: 246, column: 10)
!866 = !DILocation(line: 246, column: 21, scope: !867)
!867 = !DILexicalBlockFile(scope: !868, file: !444, discriminator: 3)
!868 = distinct !DILexicalBlock(scope: !860, file: !444, line: 246, column: 19)
!869 = !DILocation(line: 246, column: 106, scope: !867)
!870 = !DILocation(line: 246, column: 117, scope: !871)
!871 = !DILexicalBlockFile(scope: !861, file: !444, discriminator: 4)
!872 = !DILocation(line: 249, column: 6, scope: !873)
!873 = distinct !DILexicalBlock(scope: !752, file: !444, line: 249, column: 6)
!874 = !DILocation(line: 249, column: 14, scope: !873)
!875 = !DILocation(line: 249, column: 6, scope: !752)
!876 = !DILocation(line: 250, column: 3, scope: !877)
!877 = distinct !DILexicalBlock(scope: !873, file: !444, line: 249, column: 25)
!878 = !DILocation(line: 250, column: 9, scope: !877)
!879 = !DILocation(line: 250, column: 22, scope: !877)
!880 = !DILocation(line: 252, column: 39, scope: !877)
!881 = !DILocation(line: 252, column: 45, scope: !877)
!882 = !DILocation(line: 252, column: 17, scope: !877)
!883 = !DILocation(line: 253, column: 2, scope: !877)
!884 = !DILocation(line: 255, column: 30, scope: !752)
!885 = !DILocation(line: 255, column: 38, scope: !752)
!886 = !DILocation(line: 255, column: 47, scope: !752)
!887 = !DILocation(line: 256, column: 9, scope: !752)
!888 = !DILocation(line: 256, column: 17, scope: !752)
!889 = !DILocation(line: 256, column: 26, scope: !752)
!890 = !DILocation(line: 257, column: 9, scope: !752)
!891 = !DILocation(line: 257, column: 17, scope: !752)
!892 = !DILocation(line: 257, column: 26, scope: !752)
!893 = !DILocation(line: 255, column: 12, scope: !752)
!894 = !DILocation(line: 255, column: 10, scope: !752)
!895 = !DILocation(line: 259, column: 6, scope: !896)
!896 = distinct !DILexicalBlock(scope: !752, file: !444, line: 259, column: 6)
!897 = !DILocation(line: 259, column: 14, scope: !896)
!898 = !DILocation(line: 259, column: 6, scope: !752)
!899 = !DILocation(line: 261, column: 27, scope: !900)
!900 = distinct !DILexicalBlock(scope: !896, file: !444, line: 259, column: 22)
!901 = !DILocation(line: 261, column: 35, scope: !900)
!902 = !DILocation(line: 261, column: 48, scope: !900)
!903 = !DILocation(line: 262, column: 4, scope: !900)
!904 = !DILocation(line: 261, column: 27, scope: !905)
!905 = !DILexicalBlockFile(scope: !900, file: !444, discriminator: 1)
!906 = !DILocation(line: 262, column: 16, scope: !905)
!907 = !DILocation(line: 262, column: 24, scope: !905)
!908 = !DILocation(line: 261, column: 27, scope: !909)
!909 = !DILexicalBlockFile(scope: !900, file: !444, discriminator: 2)
!910 = !DILocation(line: 261, column: 27, scope: !911)
!911 = !DILexicalBlockFile(scope: !900, file: !444, discriminator: 3)
!912 = !DILocation(line: 261, column: 3, scope: !911)
!913 = !DILocation(line: 261, column: 12, scope: !911)
!914 = !DILocation(line: 261, column: 25, scope: !911)
!915 = !DILocation(line: 263, column: 27, scope: !900)
!916 = !DILocation(line: 263, column: 35, scope: !900)
!917 = !DILocation(line: 263, column: 26, scope: !900)
!918 = !DILocation(line: 263, column: 3, scope: !900)
!919 = !DILocation(line: 263, column: 12, scope: !900)
!920 = !DILocation(line: 263, column: 24, scope: !900)
!921 = !DILocation(line: 264, column: 21, scope: !900)
!922 = !DILocation(line: 264, column: 29, scope: !900)
!923 = !DILocation(line: 264, column: 3, scope: !900)
!924 = !DILocation(line: 264, column: 12, scope: !900)
!925 = !DILocation(line: 264, column: 19, scope: !900)
!926 = !DILocation(line: 265, column: 38, scope: !900)
!927 = !DILocation(line: 265, column: 46, scope: !900)
!928 = !DILocation(line: 265, column: 17, scope: !900)
!929 = !DILocation(line: 265, column: 26, scope: !900)
!930 = !DILocation(line: 265, column: 36, scope: !900)
!931 = !DILocation(line: 266, column: 2, scope: !900)
!932 = !DILocation(line: 268, column: 6, scope: !933)
!933 = distinct !DILexicalBlock(scope: !752, file: !444, line: 268, column: 6)
!934 = !DILocation(line: 268, column: 14, scope: !933)
!935 = !DILocation(line: 268, column: 21, scope: !933)
!936 = !DILocation(line: 268, column: 24, scope: !937)
!937 = !DILexicalBlockFile(scope: !933, file: !444, discriminator: 1)
!938 = !DILocation(line: 268, column: 30, scope: !937)
!939 = !DILocation(line: 268, column: 38, scope: !937)
!940 = !DILocation(line: 268, column: 6, scope: !937)
!941 = !DILocation(line: 270, column: 32, scope: !942)
!942 = distinct !DILexicalBlock(scope: !933, file: !444, line: 268, column: 47)
!943 = !DILocation(line: 270, column: 40, scope: !942)
!944 = !DILocation(line: 270, column: 49, scope: !942)
!945 = !DILocation(line: 270, column: 17, scope: !942)
!946 = !DILocation(line: 270, column: 23, scope: !942)
!947 = !DILocation(line: 270, column: 30, scope: !942)
!948 = !DILocation(line: 271, column: 28, scope: !942)
!949 = !DILocation(line: 271, column: 36, scope: !942)
!950 = !DILocation(line: 271, column: 45, scope: !942)
!951 = !DILocation(line: 271, column: 19, scope: !942)
!952 = !DILocation(line: 271, column: 3, scope: !942)
!953 = !DILocation(line: 271, column: 9, scope: !942)
!954 = !DILocation(line: 271, column: 17, scope: !942)
!955 = !DILocation(line: 272, column: 16, scope: !942)
!956 = !DILocation(line: 272, column: 24, scope: !942)
!957 = !DILocation(line: 272, column: 33, scope: !942)
!958 = !DILocation(line: 272, column: 3, scope: !942)
!959 = !DILocation(line: 272, column: 9, scope: !942)
!960 = !DILocation(line: 272, column: 14, scope: !942)
!961 = !DILocation(line: 273, column: 29, scope: !942)
!962 = !DILocation(line: 273, column: 37, scope: !942)
!963 = !DILocation(line: 273, column: 46, scope: !942)
!964 = !DILocation(line: 273, column: 20, scope: !942)
!965 = !DILocation(line: 273, column: 3, scope: !942)
!966 = !DILocation(line: 273, column: 9, scope: !942)
!967 = !DILocation(line: 273, column: 18, scope: !942)
!968 = !DILocation(line: 275, column: 14, scope: !969)
!969 = distinct !DILexicalBlock(scope: !942, file: !444, line: 275, column: 7)
!970 = !DILocation(line: 275, column: 20, scope: !969)
!971 = !DILocation(line: 275, column: 7, scope: !969)
!972 = !DILocation(line: 275, column: 34, scope: !969)
!973 = !DILocation(line: 275, column: 7, scope: !942)
!974 = !DILocation(line: 276, column: 4, scope: !969)
!975 = !DILocation(line: 276, column: 10, scope: !969)
!976 = !DILocation(line: 276, column: 22, scope: !969)
!977 = !DILocation(line: 278, column: 24, scope: !942)
!978 = !DILocation(line: 278, column: 31, scope: !942)
!979 = !DILocation(line: 278, column: 39, scope: !942)
!980 = !DILocation(line: 278, column: 52, scope: !942)
!981 = !DILocation(line: 278, column: 59, scope: !982)
!982 = !DILexicalBlockFile(scope: !942, file: !444, discriminator: 1)
!983 = !DILocation(line: 278, column: 31, scope: !982)
!984 = !DILocation(line: 279, column: 10, scope: !942)
!985 = !DILocation(line: 279, column: 18, scope: !942)
!986 = !DILocation(line: 278, column: 31, scope: !987)
!987 = !DILexicalBlockFile(scope: !942, file: !444, discriminator: 2)
!988 = !DILocation(line: 278, column: 31, scope: !989)
!989 = !DILexicalBlockFile(scope: !942, file: !444, discriminator: 3)
!990 = !DILocation(line: 279, column: 34, scope: !982)
!991 = !DILocation(line: 279, column: 32, scope: !982)
!992 = !DILocation(line: 278, column: 3, scope: !989)
!993 = !DILocation(line: 280, column: 24, scope: !942)
!994 = !DILocation(line: 280, column: 3, scope: !942)
!995 = !DILocation(line: 281, column: 3, scope: !942)
!996 = !DILocation(line: 288, column: 8, scope: !752)
!997 = !DILocation(line: 288, column: 6, scope: !752)
!998 = !DILocation(line: 289, column: 13, scope: !999)
!999 = distinct !DILexicalBlock(scope: !752, file: !444, line: 289, column: 2)
!1000 = !DILocation(line: 289, column: 11, scope: !999)
!1001 = !DILocation(line: 289, column: 7, scope: !999)
!1002 = !DILocation(line: 289, column: 27, scope: !1003)
!1003 = !DILexicalBlockFile(scope: !1004, file: !444, discriminator: 1)
!1004 = distinct !DILexicalBlock(scope: !999, file: !444, line: 289, column: 2)
!1005 = !DILocation(line: 289, column: 31, scope: !1003)
!1006 = !DILocation(line: 289, column: 2, scope: !1003)
!1007 = !DILocalVariable(name: "rec", scope: !1008, file: !444, line: 290, type: !760)
!1008 = distinct !DILexicalBlock(scope: !1004, file: !444, line: 289, column: 56)
!1009 = !DILocation(line: 290, column: 21, scope: !1008)
!1010 = !DILocation(line: 290, column: 27, scope: !1008)
!1011 = !DILocation(line: 290, column: 32, scope: !1008)
!1012 = !DILocation(line: 292, column: 10, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1008, file: !444, line: 292, column: 7)
!1014 = !DILocation(line: 292, column: 16, scope: !1013)
!1015 = !DILocation(line: 292, column: 9, scope: !1013)
!1016 = !DILocation(line: 292, column: 23, scope: !1013)
!1017 = !DILocation(line: 292, column: 27, scope: !1018)
!1018 = !DILexicalBlockFile(scope: !1013, file: !444, discriminator: 1)
!1019 = !DILocation(line: 292, column: 33, scope: !1018)
!1020 = !DILocation(line: 292, column: 41, scope: !1018)
!1021 = !DILocation(line: 292, column: 6, scope: !1018)
!1022 = !DILocation(line: 292, column: 29, scope: !1023)
!1023 = !DILexicalBlockFile(scope: !1013, file: !444, discriminator: 2)
!1024 = !DILocation(line: 292, column: 35, scope: !1023)
!1025 = !DILocation(line: 292, column: 45, scope: !1023)
!1026 = !DILocation(line: 292, column: 51, scope: !1023)
!1027 = !DILocation(line: 292, column: 9, scope: !1023)
!1028 = !DILocation(line: 292, column: 61, scope: !1023)
!1029 = !DILocation(line: 292, column: 67, scope: !1023)
!1030 = !DILocation(line: 293, column: 9, scope: !1013)
!1031 = !DILocation(line: 293, column: 14, scope: !1013)
!1032 = !DILocation(line: 293, column: 27, scope: !1013)
!1033 = !DILocation(line: 293, column: 31, scope: !1018)
!1034 = !DILocation(line: 293, column: 36, scope: !1018)
!1035 = !DILocation(line: 293, column: 48, scope: !1018)
!1036 = !DILocation(line: 294, column: 8, scope: !1013)
!1037 = !DILocation(line: 294, column: 13, scope: !1013)
!1038 = !DILocation(line: 294, column: 28, scope: !1013)
!1039 = !DILocation(line: 294, column: 31, scope: !1013)
!1040 = !DILocation(line: 294, column: 26, scope: !1013)
!1041 = !DILocation(line: 292, column: 7, scope: !1042)
!1042 = !DILexicalBlockFile(scope: !1008, file: !444, discriminator: 3)
!1043 = !DILocation(line: 295, column: 8, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !444, line: 295, column: 8)
!1045 = distinct !DILexicalBlock(scope: !1013, file: !444, line: 294, column: 42)
!1046 = !DILocation(line: 295, column: 15, scope: !1044)
!1047 = !DILocation(line: 295, column: 12, scope: !1044)
!1048 = !DILocation(line: 295, column: 8, scope: !1045)
!1049 = !DILocation(line: 296, column: 46, scope: !1044)
!1050 = !DILocation(line: 296, column: 54, scope: !1044)
!1051 = !DILocation(line: 296, column: 63, scope: !1044)
!1052 = !DILocation(line: 296, column: 33, scope: !1044)
!1053 = !DILocation(line: 296, column: 39, scope: !1044)
!1054 = !DILocation(line: 296, column: 44, scope: !1044)
!1055 = !DILocation(line: 297, column: 20, scope: !1045)
!1056 = !DILocation(line: 297, column: 25, scope: !1045)
!1057 = !DILocation(line: 297, column: 4, scope: !1045)
!1058 = !DILocation(line: 298, column: 4, scope: !1045)
!1059 = !DILocation(line: 300, column: 2, scope: !1008)
!1060 = !DILocation(line: 289, column: 45, scope: !1061)
!1061 = !DILexicalBlockFile(scope: !1004, file: !444, discriminator: 2)
!1062 = !DILocation(line: 289, column: 50, scope: !1061)
!1063 = !DILocation(line: 289, column: 43, scope: !1061)
!1064 = !DILocation(line: 289, column: 2, scope: !1061)
!1065 = distinct !{!1065, !1066}
!1066 = !DILocation(line: 289, column: 2, scope: !752)
!1067 = !DILocation(line: 303, column: 21, scope: !752)
!1068 = !DILocation(line: 303, column: 11, scope: !752)
!1069 = !DILocation(line: 304, column: 13, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !752, file: !444, line: 304, column: 2)
!1071 = !DILocation(line: 304, column: 11, scope: !1070)
!1072 = !DILocation(line: 304, column: 7, scope: !1070)
!1073 = !DILocation(line: 304, column: 27, scope: !1074)
!1074 = !DILexicalBlockFile(scope: !1075, file: !444, discriminator: 1)
!1075 = distinct !DILexicalBlock(scope: !1070, file: !444, line: 304, column: 2)
!1076 = !DILocation(line: 304, column: 31, scope: !1074)
!1077 = !DILocation(line: 304, column: 2, scope: !1074)
!1078 = !DILocalVariable(name: "rec", scope: !1079, file: !444, line: 305, type: !760)
!1079 = distinct !DILexicalBlock(scope: !1075, file: !444, line: 304, column: 41)
!1080 = !DILocation(line: 305, column: 21, scope: !1079)
!1081 = !DILocation(line: 305, column: 27, scope: !1079)
!1082 = !DILocation(line: 305, column: 32, scope: !1079)
!1083 = !DILocation(line: 307, column: 8, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1079, file: !444, line: 307, column: 7)
!1085 = !DILocation(line: 307, column: 17, scope: !1084)
!1086 = !DILocation(line: 307, column: 20, scope: !1087)
!1087 = !DILexicalBlockFile(scope: !1084, file: !444, discriminator: 1)
!1088 = !DILocation(line: 307, column: 28, scope: !1087)
!1089 = !DILocation(line: 307, column: 37, scope: !1087)
!1090 = !DILocation(line: 307, column: 45, scope: !1087)
!1091 = !DILocation(line: 307, column: 50, scope: !1087)
!1092 = !DILocation(line: 307, column: 42, scope: !1087)
!1093 = !DILocation(line: 307, column: 55, scope: !1087)
!1094 = !DILocation(line: 308, column: 26, scope: !1084)
!1095 = !DILocation(line: 308, column: 31, scope: !1084)
!1096 = !DILocation(line: 308, column: 40, scope: !1084)
!1097 = !DILocation(line: 308, column: 48, scope: !1084)
!1098 = !DILocation(line: 308, column: 57, scope: !1084)
!1099 = !DILocation(line: 308, column: 7, scope: !1084)
!1100 = !DILocation(line: 308, column: 66, scope: !1084)
!1101 = !DILocation(line: 307, column: 7, scope: !1102)
!1102 = !DILexicalBlockFile(scope: !1079, file: !444, discriminator: 2)
!1103 = !DILocation(line: 309, column: 13, scope: !1084)
!1104 = !DILocation(line: 309, column: 4, scope: !1084)
!1105 = !DILocation(line: 310, column: 12, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1084, file: !444, line: 310, column: 12)
!1107 = !DILocation(line: 310, column: 21, scope: !1106)
!1108 = !DILocation(line: 310, column: 27, scope: !1109)
!1109 = !DILexicalBlockFile(scope: !1106, file: !444, discriminator: 1)
!1110 = !DILocation(line: 310, column: 33, scope: !1109)
!1111 = !DILocation(line: 310, column: 26, scope: !1109)
!1112 = !DILocation(line: 310, column: 40, scope: !1109)
!1113 = !DILocation(line: 310, column: 44, scope: !1114)
!1114 = !DILexicalBlockFile(scope: !1106, file: !444, discriminator: 2)
!1115 = !DILocation(line: 310, column: 50, scope: !1114)
!1116 = !DILocation(line: 310, column: 58, scope: !1114)
!1117 = !DILocation(line: 310, column: 23, scope: !1114)
!1118 = !DILocation(line: 310, column: 46, scope: !1119)
!1119 = !DILexicalBlockFile(scope: !1106, file: !444, discriminator: 3)
!1120 = !DILocation(line: 310, column: 52, scope: !1119)
!1121 = !DILocation(line: 310, column: 62, scope: !1119)
!1122 = !DILocation(line: 310, column: 68, scope: !1119)
!1123 = !DILocation(line: 310, column: 26, scope: !1119)
!1124 = !DILocation(line: 310, column: 78, scope: !1119)
!1125 = !DILocation(line: 310, column: 12, scope: !1119)
!1126 = !DILocation(line: 311, column: 8, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1128, file: !444, line: 311, column: 8)
!1128 = distinct !DILexicalBlock(scope: !1106, file: !444, line: 310, column: 85)
!1129 = !DILocation(line: 311, column: 15, scope: !1127)
!1130 = !DILocation(line: 311, column: 12, scope: !1127)
!1131 = !DILocation(line: 311, column: 8, scope: !1128)
!1132 = !DILocation(line: 312, column: 46, scope: !1127)
!1133 = !DILocation(line: 312, column: 54, scope: !1127)
!1134 = !DILocation(line: 312, column: 63, scope: !1127)
!1135 = !DILocation(line: 312, column: 33, scope: !1127)
!1136 = !DILocation(line: 312, column: 39, scope: !1127)
!1137 = !DILocation(line: 312, column: 44, scope: !1127)
!1138 = !DILocation(line: 313, column: 20, scope: !1128)
!1139 = !DILocation(line: 313, column: 25, scope: !1128)
!1140 = !DILocation(line: 313, column: 4, scope: !1128)
!1141 = !DILocation(line: 314, column: 4, scope: !1128)
!1142 = !DILocation(line: 317, column: 7, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1079, file: !444, line: 317, column: 7)
!1144 = !DILocation(line: 317, column: 12, scope: !1143)
!1145 = !DILocation(line: 317, column: 17, scope: !1143)
!1146 = !DILocation(line: 317, column: 7, scope: !1079)
!1147 = !DILocation(line: 318, column: 10, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1143, file: !444, line: 317, column: 25)
!1149 = !DILocation(line: 318, column: 15, scope: !1148)
!1150 = !DILocation(line: 318, column: 8, scope: !1148)
!1151 = !DILocation(line: 319, column: 4, scope: !1148)
!1152 = distinct !{!1152, !1153}
!1153 = !DILocation(line: 304, column: 2, scope: !752)
!1154 = !DILocation(line: 322, column: 7, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1079, file: !444, line: 322, column: 7)
!1156 = !DILocation(line: 322, column: 7, scope: !1079)
!1157 = !DILocation(line: 325, column: 25, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1155, file: !444, line: 322, column: 16)
!1159 = !DILocation(line: 325, column: 4, scope: !1158)
!1160 = !DILocation(line: 326, column: 4, scope: !1158)
!1161 = !DILocation(line: 329, column: 9, scope: !1079)
!1162 = !DILocation(line: 329, column: 7, scope: !1079)
!1163 = !DILocation(line: 330, column: 22, scope: !1079)
!1164 = !DILocation(line: 330, column: 12, scope: !1079)
!1165 = !DILocation(line: 304, column: 2, scope: !1166)
!1166 = !DILexicalBlockFile(scope: !1075, file: !444, discriminator: 2)
!1167 = !DILocation(line: 332, column: 1, scope: !752)
!1168 = distinct !DISubprogram(name: "sig_connected", scope: !444, file: !444, line: 334, type: !753, isLocal: true, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !455)
!1169 = !DILocalVariable(name: "server", arg: 1, scope: !1168, file: !444, line: 334, type: !79)
!1170 = !DILocation(line: 334, column: 39, scope: !1168)
!1171 = !DILocation(line: 336, column: 2, scope: !1168)
!1172 = distinct !{!1172, !1171}
!1173 = !DILocation(line: 336, column: 45, scope: !1174)
!1174 = !DILexicalBlockFile(scope: !1175, file: !444, discriminator: 1)
!1175 = distinct !DILexicalBlock(scope: !1176, file: !444, line: 336, column: 10)
!1176 = distinct !DILexicalBlock(scope: !1168, file: !444, line: 336, column: 4)
!1177 = !DILocation(line: 336, column: 27, scope: !1174)
!1178 = !DILocation(line: 336, column: 12, scope: !1174)
!1179 = !DILocation(line: 336, column: 10, scope: !1174)
!1180 = !DILocation(line: 336, column: 11, scope: !1181)
!1181 = !DILexicalBlockFile(scope: !1175, file: !444, discriminator: 2)
!1182 = !DILocation(line: 336, column: 10, scope: !1183)
!1183 = !DILexicalBlockFile(scope: !1176, file: !444, discriminator: 3)
!1184 = !DILocation(line: 336, column: 33, scope: !1185)
!1185 = !DILexicalBlockFile(scope: !1186, file: !444, discriminator: 4)
!1186 = distinct !DILexicalBlock(scope: !1175, file: !444, line: 336, column: 31)
!1187 = !DILocation(line: 336, column: 42, scope: !1188)
!1188 = !DILexicalBlockFile(scope: !1189, file: !444, discriminator: 5)
!1189 = distinct !DILexicalBlock(scope: !1175, file: !444, line: 336, column: 40)
!1190 = !DILocation(line: 336, column: 132, scope: !1188)
!1191 = !DILocation(line: 336, column: 143, scope: !1192)
!1192 = !DILexicalBlockFile(scope: !1176, file: !444, discriminator: 6)
!1193 = !DILocation(line: 337, column: 7, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1168, file: !444, line: 337, column: 6)
!1195 = !DILocation(line: 337, column: 15, scope: !1194)
!1196 = !DILocation(line: 337, column: 24, scope: !1194)
!1197 = !DILocation(line: 337, column: 6, scope: !1168)
!1198 = !DILocation(line: 338, column: 3, scope: !1194)
!1199 = !DILocation(line: 340, column: 6, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1168, file: !444, line: 340, column: 6)
!1201 = !DILocation(line: 340, column: 14, scope: !1200)
!1202 = !DILocation(line: 340, column: 23, scope: !1200)
!1203 = !DILocation(line: 340, column: 32, scope: !1200)
!1204 = !DILocation(line: 340, column: 6, scope: !1168)
!1205 = !DILocation(line: 341, column: 3, scope: !1200)
!1206 = !DILocation(line: 341, column: 11, scope: !1200)
!1207 = !DILocation(line: 341, column: 25, scope: !1200)
!1208 = !DILocation(line: 341, column: 33, scope: !1200)
!1209 = !DILocation(line: 341, column: 41, scope: !1200)
!1210 = !DILocation(line: 341, column: 50, scope: !1200)
!1211 = !DILocation(line: 342, column: 1, scope: !1168)
!1212 = distinct !DISubprogram(name: "sig_chat_protocol_deinit", scope: !444, file: !444, line: 477, type: !1213, isLocal: true, isDefinition: true, scopeLine: 478, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !455)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{null, !1215}
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAT_PROTOCOL_REC", file: !81, line: 105, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHAT_PROTOCOL_REC", file: !1218, line: 4, size: 832, align: 64, elements: !1219)
!1218 = !DIFile(filename: "chat-protocols.h", directory: "/home/lichi/Desktop/irssi/task1")
!1219 = !{!1220, !1221, !1222, !1223, !1224, !1225, !1226, !1233, !1237, !1244, !1248, !1252, !1256, !1258, !1262}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1217, file: !1218, line: 5, baseType: !70, size: 32, align: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "not_initialized", scope: !1217, file: !1218, line: 7, baseType: !139, size: 1, align: 32, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "case_insensitive", scope: !1217, file: !1218, line: 8, baseType: !139, size: 1, align: 32, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1217, file: !1218, line: 10, baseType: !99, size: 64, align: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "fullname", scope: !1217, file: !1218, line: 11, baseType: !99, size: 64, align: 64, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !1217, file: !1218, line: 12, baseType: !99, size: 64, align: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "create_chatnet", scope: !1217, file: !1218, line: 14, baseType: !1227, size: 64, align: 64, offset: 256)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!1230}
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHATNET_REC", file: !81, line: 106, baseType: !1232)
!1232 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHATNET_REC", file: !81, line: 106, flags: DIFlagFwdDecl)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "create_server_setup", scope: !1217, file: !1218, line: 15, baseType: !1234, size: 64, align: 64, offset: 320)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!760}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "create_channel_setup", scope: !1217, file: !1218, line: 16, baseType: !1238, size: 64, align: 64, offset: 384)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!1241}
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_SETUP_REC", file: !81, line: 115, baseType: !1243)
!1243 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_SETUP_REC", file: !81, line: 115, flags: DIFlagFwdDecl)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "create_server_connect", scope: !1217, file: !1218, line: 17, baseType: !1245, size: 64, align: 64, offset: 448)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!90}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_server_connect", scope: !1217, file: !1218, line: 18, baseType: !1249, size: 64, align: 64, offset: 512)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{null, !90}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "server_init_connect", scope: !1217, file: !1218, line: 20, baseType: !1253, size: 64, align: 64, offset: 576)
