; ModuleID = './line35-ignore.o.i'
source_filename = "./line35-ignore.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.NICKMATCH_REC = type { %struct._GHashTable*, void (%struct._GHashTable*, %struct._CHANNEL_REC*, %struct._NICK_REC*)* }
%struct._GHashTable = type opaque
%struct._CHANNEL_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)*, i8*, i8*, i64, %struct._GHashTable*, %struct._NICK_REC*, i8, i8*, i32, i8*, i16, i8* (%struct._CHANNEL_REC*)* }
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }

!55 = !DIEnumerator(name: "MSGLEVEL_DCCMSGS", value: 131072)
!56 = !DIEnumerator(name: "MSGLEVEL_CLIENTNOTICE", value: 262144)
!57 = !DIEnumerator(name: "MSGLEVEL_CLIENTCRAP", value: 524288)
!58 = !DIEnumerator(name: "MSGLEVEL_CLIENTERROR", value: 1048576)
!59 = !DIEnumerator(name: "MSGLEVEL_HILIGHT", value: 2097152)
!60 = !DIEnumerator(name: "MSGLEVEL_ALL", value: 4194303)
!61 = !DIEnumerator(name: "MSGLEVEL_NOHILIGHT", value: 16777216)
!62 = !DIEnumerator(name: "MSGLEVEL_NO_ACT", value: 33554432)
!63 = !DIEnumerator(name: "MSGLEVEL_NEVER", value: 67108864)
!64 = !DIEnumerator(name: "MSGLEVEL_LASTLOG", value: 134217728)
!65 = !DIEnumerator(name: "MSGLEVEL_HIDDEN", value: 268435456)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 29, size: 32, align: 32, elements: !68)
!67 = !DIFile(filename: "ignore.h", directory: "/home/lichi/Desktop/irssi/task1")
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "IGNORE_FIND_PATTERN", value: 1)
!70 = !DIEnumerator(name: "IGNORE_FIND_NOACT", value: 2)
!71 = !DIEnumerator(name: "IGNORE_FIND_HIDDEN", value: 4)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 297, size: 32, align: 32, elements: !74)
!73 = !DIFile(filename: "/usr/include/glib-2.0/glib/gregex.h", directory: "/home/lichi/Desktop/irssi/task1")
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92}
!75 = !DIEnumerator(name: "G_REGEX_CASELESS", value: 1)
!76 = !DIEnumerator(name: "G_REGEX_MULTILINE", value: 2)
!77 = !DIEnumerator(name: "G_REGEX_DOTALL", value: 4)
!78 = !DIEnumerator(name: "G_REGEX_EXTENDED", value: 8)
!79 = !DIEnumerator(name: "G_REGEX_ANCHORED", value: 16)
!80 = !DIEnumerator(name: "G_REGEX_DOLLAR_ENDONLY", value: 32)
!81 = !DIEnumerator(name: "G_REGEX_UNGREEDY", value: 512)
!82 = !DIEnumerator(name: "G_REGEX_RAW", value: 2048)
!83 = !DIEnumerator(name: "G_REGEX_NO_AUTO_CAPTURE", value: 4096)
!84 = !DIEnumerator(name: "G_REGEX_OPTIMIZE", value: 8192)
!85 = !DIEnumerator(name: "G_REGEX_FIRSTLINE", value: 262144)
!86 = !DIEnumerator(name: "G_REGEX_DUPNAMES", value: 524288)
!87 = !DIEnumerator(name: "G_REGEX_NEWLINE_CR", value: 1048576)
!88 = !DIEnumerator(name: "G_REGEX_NEWLINE_LF", value: 2097152)
!89 = !DIEnumerator(name: "G_REGEX_NEWLINE_CRLF", value: 3145728)
!90 = !DIEnumerator(name: "G_REGEX_NEWLINE_ANYCRLF", value: 5242880)
!91 = !DIEnumerator(name: "G_REGEX_BSR_ANYCRLF", value: 8388608)
!92 = !DIEnumerator(name: "G_REGEX_JAVASCRIPT_COMPAT", value: 33554432)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !94, line: 51, size: 32, align: 32, elements: !95)
!94 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !104}
!96 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!97 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!98 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!99 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!100 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!101 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!102 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!103 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!104 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 4, size: 32, align: 32, elements: !107)
!106 = !DIFile(filename: "../../src/lib-config/iconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!107 = !{!108, !109, !110, !111, !112}
!108 = !DIEnumerator(name: "NODE_TYPE_KEY", value: 0)
!109 = !DIEnumerator(name: "NODE_TYPE_VALUE", value: 1)
!110 = !DIEnumerator(name: "NODE_TYPE_BLOCK", value: 2)
!111 = !DIEnumerator(name: "NODE_TYPE_LIST", value: 3)
!112 = !DIEnumerator(name: "NODE_TYPE_COMMENT", value: 4)
!113 = !{!114, !115, !124, !131, !134}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !123}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !120, line: 50, baseType: !121)
!120 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !120, line: 49, baseType: !122)
!122 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !120, line: 77, baseType: !114)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !125, line: 9, baseType: !126)
!125 = !DIFile(filename: "signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !129, !129, !129, !129, !129, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !120, line: 46, baseType: !133)
!133 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "IGNORE_REC", file: !67, line: 6, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IGNORE_REC", file: !67, line: 8, size: 512, align: 64, elements: !137)
!137 = !{!138, !139, !141, !142, !144, !145, !151, !153, !154, !155, !156}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !136, file: !67, line: 9, baseType: !122, size: 32, align: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !136, file: !67, line: 10, baseType: !140, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !136, file: !67, line: 11, baseType: !140, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !136, file: !67, line: 12, baseType: !143, size: 64, align: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !136, file: !67, line: 13, baseType: !140, size: 64, align: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "unignore_time", scope: !136, file: !67, line: 15, baseType: !146, size: 64, align: 64, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !147, line: 75, baseType: !148)
!147 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !149, line: 139, baseType: !150)
!149 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!150 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !136, file: !67, line: 17, baseType: !152, size: 1, align: 32, offset: 384, flags: DIFlagBitField, extraData: i64 384)
!152 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "regexp", scope: !136, file: !67, line: 18, baseType: !152, size: 1, align: 32, offset: 385, flags: DIFlagBitField, extraData: i64 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fullword", scope: !136, file: !67, line: 19, baseType: !152, size: 1, align: 32, offset: 386, flags: DIFlagBitField, extraData: i64 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "replies", scope: !136, file: !67, line: 20, baseType: !152, size: 1, align: 32, offset: 387, flags: DIFlagBitField, extraData: i64 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "preg", scope: !136, file: !67, line: 21, baseType: !157, size: 64, align: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "Regex", file: !159, line: 9, baseType: !160)
!159 = !DIFile(filename: "iregex.h", directory: "/home/lichi/Desktop/irssi/task1")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "GRegex", file: !73, line: 414, baseType: !161)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GRegex", file: !73, line: 414, flags: DIFlagFwdDecl)
!162 = !{!163, !172, !571}
!163 = distinct !DIGlobalVariable(name: "ignores", scope: !0, file: !164, line: 37, type: !165, isLocal: false, isDefinition: true, variable: %struct._GSList** @ignores)
!164 = !DIFile(filename: "ignore.c", directory: "/home/lichi/Desktop/irssi/task1")
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !167, line: 37, baseType: !168)
!167 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !167, line: 39, size: 128, align: 64, elements: !169)
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !168, file: !167, line: 41, baseType: !123, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !168, file: !167, line: 42, baseType: !165, size: 64, align: 64, offset: 64)
!172 = distinct !DIGlobalVariable(name: "nickmatch", scope: !0, file: !164, line: 39, type: !173, isLocal: true, isDefinition: true, variable: %struct.NICKMATCH_REC** @nickmatch)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICKMATCH_REC", file: !175, line: 10, baseType: !176)
!175 = !DIFile(filename: "nickmatch-cache.h", directory: "/home/lichi/Desktop/irssi/task1")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !175, line: 7, size: 128, align: 64, elements: !177)
!177 = !{!178, !183}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !176, file: !175, line: 8, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !181, line: 37, baseType: !182)
!181 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !181, line: 37, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !176, file: !175, line: 9, baseType: !184, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICKMATCH_REBUILD_FUNC", file: !175, line: 4, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !179, !188, !529}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !190, line: 109, baseType: !191)
!190 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !192, line: 15, size: 1408, align: 64, elements: !193)
!192 = !DIFile(filename: "channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!193 = !{!194, !196, !197, !198, !199, !507, !508, !509, !510, !511, !512, !519, !523, !525, !526, !527, !528, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !191, file: !195, line: 3, baseType: !122, size: 32, align: 32)
!195 = !DIFile(filename: "window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!196 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !191, file: !195, line: 4, baseType: !122, size: 32, align: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !191, file: !195, line: 5, baseType: !179, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !191, file: !195, line: 7, baseType: !114, size: 64, align: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !191, file: !195, line: 8, baseType: !200, size: 64, align: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !190, line: 107, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !203, line: 30, size: 2240, align: 64, elements: !204)
!203 = !DIFile(filename: "servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!204 = !{!205, !207, !208, !209, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !435, !436, !440, !441, !442, !446, !447, !448, !449, !450, !451, !452, !453, !454, !461, !462, !463, !464, !465, !471, !475, !479, !483, !487, !491, !495, !502, !506}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !202, file: !206, line: 3, baseType: !122, size: 32, align: 32)
!206 = !DIFile(filename: "server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!207 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !202, file: !206, line: 4, baseType: !122, size: 32, align: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !202, file: !206, line: 6, baseType: !122, size: 32, align: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !202, file: !206, line: 8, baseType: !210, size: 64, align: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !190, line: 113, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !203, line: 25, size: 1920, align: 64, elements: !213)
!213 = !{!214, !216, !217, !218, !219, !220, !221, !222, !223, !225, !226, !227, !228, !229, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !212, file: !215, line: 3, baseType: !122, size: 32, align: 32)
!215 = !DIFile(filename: "server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!216 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !212, file: !215, line: 4, baseType: !122, size: 32, align: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !212, file: !215, line: 6, baseType: !122, size: 32, align: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !212, file: !215, line: 9, baseType: !140, size: 64, align: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !212, file: !215, line: 10, baseType: !122, size: 32, align: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !212, file: !215, line: 11, baseType: !140, size: 64, align: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !212, file: !215, line: 11, baseType: !140, size: 64, align: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !212, file: !215, line: 11, baseType: !140, size: 64, align: 64, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !212, file: !215, line: 13, baseType: !224, size: 16, align: 16, offset: 448)
!224 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !212, file: !215, line: 14, baseType: !140, size: 64, align: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !212, file: !215, line: 15, baseType: !140, size: 64, align: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !212, file: !215, line: 16, baseType: !122, size: 32, align: 32, offset: 640)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !212, file: !215, line: 17, baseType: !140, size: 64, align: 64, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !212, file: !215, line: 19, baseType: !230, size: 64, align: 64, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !190, line: 99, baseType: !232)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !190, line: 99, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !212, file: !215, line: 19, baseType: !230, size: 64, align: 64, offset: 832)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !212, file: !215, line: 21, baseType: !140, size: 64, align: 64, offset: 896)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !212, file: !215, line: 22, baseType: !140, size: 64, align: 64, offset: 960)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !212, file: !215, line: 23, baseType: !140, size: 64, align: 64, offset: 1024)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !212, file: !215, line: 24, baseType: !140, size: 64, align: 64, offset: 1088)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !212, file: !215, line: 26, baseType: !140, size: 64, align: 64, offset: 1152)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !212, file: !215, line: 27, baseType: !140, size: 64, align: 64, offset: 1216)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !212, file: !215, line: 28, baseType: !140, size: 64, align: 64, offset: 1280)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !212, file: !215, line: 29, baseType: !140, size: 64, align: 64, offset: 1344)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !212, file: !215, line: 30, baseType: !140, size: 64, align: 64, offset: 1408)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !212, file: !215, line: 31, baseType: !140, size: 64, align: 64, offset: 1472)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !212, file: !215, line: 32, baseType: !140, size: 64, align: 64, offset: 1536)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !212, file: !215, line: 33, baseType: !140, size: 64, align: 64, offset: 1600)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !212, file: !215, line: 35, baseType: !247, size: 64, align: 64, offset: 1664)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !250)
!250 = !{!251, !252, !379, !380, !385, !386, !387, !388, !389, !398, !399, !400, !404, !405, !406, !407, !408, !409, !410, !411}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !249, file: !4, line: 100, baseType: !121, size: 32, align: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !249, file: !4, line: 101, baseType: !253, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !256)
!256 = !{!257, !278, !284, !290, !294, !366, !370, !375}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !255, file: !4, line: 133, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!261, !247, !131, !262, !265, !266}
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !263, line: 66, baseType: !264)
!263 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!264 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !269, line: 42, baseType: !270)
!269 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !269, line: 44, size: 128, align: 64, elements: !271)
!271 = !{!272, !276, !277}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !270, file: !269, line: 46, baseType: !273, size: 32, align: 32)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !274, line: 36, baseType: !275)
!274 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !263, line: 45, baseType: !152)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !270, file: !269, line: 47, baseType: !121, size: 32, align: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !270, file: !269, line: 48, baseType: !131, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !255, file: !4, line: 138, baseType: !279, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!261, !247, !282, !262, !265, !266}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !255, file: !4, line: 143, baseType: !285, size: 64, align: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!261, !247, !288, !289, !266}
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !263, line: 51, baseType: !150)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !255, file: !4, line: 147, baseType: !291, size: 64, align: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!261, !247, !266}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !255, file: !4, line: 149, baseType: !295, size: 64, align: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!298, !247, !365}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !301)
!301 = !{!302, !303, !319, !348, !350, !354, !355, !356, !357, !358, !359, !360, !361}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !300, file: !16, line: 174, baseType: !123, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !300, file: !16, line: 175, baseType: !304, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !307)
!307 = !{!308, !312, !313}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !306, file: !16, line: 198, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !123}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !306, file: !16, line: 199, baseType: !309, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !306, file: !16, line: 200, baseType: !314, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !123, !298, !317, !318}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !300, file: !16, line: 177, baseType: !320, size: 64, align: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !324)
!324 = !{!325, !330, !334, !338, !342, !343}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !323, file: !16, line: 216, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!119, !298, !329}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !323, file: !16, line: 218, baseType: !331, size: 64, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!119, !298}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !323, file: !16, line: 219, baseType: !335, size: 64, align: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!119, !298, !115, !123}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !323, file: !16, line: 222, baseType: !339, size: 64, align: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !298}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !323, file: !16, line: 226, baseType: !115, size: 64, align: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !323, file: !16, line: 227, baseType: !344, size: 64, align: 64, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !300, file: !16, line: 178, baseType: !349, size: 32, align: 32, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !120, line: 55, baseType: !152)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !300, file: !16, line: 180, baseType: !351, size: 64, align: 64, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !353)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !300, file: !16, line: 182, baseType: !121, size: 32, align: 32, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !300, file: !16, line: 183, baseType: !349, size: 32, align: 32, offset: 352)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !300, file: !16, line: 184, baseType: !349, size: 32, align: 32, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !300, file: !16, line: 186, baseType: !165, size: 64, align: 64, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !300, file: !16, line: 188, baseType: !298, size: 64, align: 64, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !300, file: !16, line: 189, baseType: !298, size: 64, align: 64, offset: 576)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !16, line: 191, baseType: !140, size: 64, align: 64, offset: 640)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !300, file: !16, line: 193, baseType: !362, size: 64, align: 64, offset: 704)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !364)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !255, file: !4, line: 151, baseType: !367, size: 64, align: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !247}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !255, file: !4, line: 152, baseType: !371, size: 64, align: 64, offset: 384)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!261, !247, !374, !266}
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !255, file: !4, line: 155, baseType: !376, size: 64, align: 64, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!374, !247}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !249, file: !4, line: 103, baseType: !131, size: 64, align: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !249, file: !4, line: 104, baseType: !381, size: 64, align: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !382, line: 77, baseType: !383)
!382 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !382, line: 77, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !249, file: !4, line: 105, baseType: !381, size: 64, align: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !249, file: !4, line: 106, baseType: !131, size: 64, align: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !249, file: !4, line: 107, baseType: !349, size: 32, align: 32, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !249, file: !4, line: 109, baseType: !262, size: 64, align: 64, offset: 448)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !249, file: !4, line: 110, baseType: !390, size: 64, align: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !392, line: 39, baseType: !393)
!392 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !392, line: 41, size: 192, align: 64, elements: !394)
!394 = !{!395, !396, !397}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !393, file: !392, line: 43, baseType: !131, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !393, file: !392, line: 44, baseType: !262, size: 64, align: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !393, file: !392, line: 45, baseType: !262, size: 64, align: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !249, file: !4, line: 111, baseType: !390, size: 64, align: 64, offset: 576)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !249, file: !4, line: 112, baseType: !390, size: 64, align: 64, offset: 640)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !249, file: !4, line: 113, baseType: !401, size: 48, align: 8, offset: 704)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 48, align: 8, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 6)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !249, file: !4, line: 117, baseType: !349, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !249, file: !4, line: 118, baseType: !349, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !249, file: !4, line: 119, baseType: !349, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !249, file: !4, line: 120, baseType: !349, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !249, file: !4, line: 121, baseType: !349, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !249, file: !4, line: 122, baseType: !349, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !249, file: !4, line: 124, baseType: !123, size: 64, align: 64, offset: 768)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !249, file: !4, line: 125, baseType: !123, size: 64, align: 64, offset: 832)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !212, file: !215, line: 38, baseType: !152, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !212, file: !215, line: 39, baseType: !152, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !212, file: !215, line: 40, baseType: !152, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !212, file: !215, line: 41, baseType: !152, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !212, file: !215, line: 42, baseType: !152, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !212, file: !215, line: 43, baseType: !152, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !212, file: !215, line: 44, baseType: !152, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !212, file: !215, line: 45, baseType: !152, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !212, file: !215, line: 46, baseType: !140, size: 64, align: 64, offset: 1792)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !212, file: !215, line: 47, baseType: !140, size: 64, align: 64, offset: 1856)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !202, file: !206, line: 9, baseType: !146, size: 64, align: 64, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !202, file: !206, line: 10, baseType: !146, size: 64, align: 64, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !202, file: !206, line: 12, baseType: !140, size: 64, align: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !202, file: !206, line: 13, baseType: !140, size: 64, align: 64, offset: 384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !202, file: !206, line: 15, baseType: !152, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !202, file: !206, line: 16, baseType: !152, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !202, file: !206, line: 17, baseType: !152, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !202, file: !206, line: 18, baseType: !152, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !202, file: !206, line: 19, baseType: !152, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !202, file: !206, line: 21, baseType: !432, size: 64, align: 64, offset: 512)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !190, line: 102, baseType: !434)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !190, line: 102, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !202, file: !206, line: 22, baseType: !122, size: 32, align: 32, offset: 576)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !202, file: !206, line: 25, baseType: !437, size: 128, align: 64, offset: 640)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 128, align: 64, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 2)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !202, file: !206, line: 26, baseType: !122, size: 32, align: 32, offset: 768)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !202, file: !206, line: 27, baseType: !122, size: 32, align: 32, offset: 800)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !202, file: !206, line: 29, baseType: !443, size: 64, align: 64, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !190, line: 103, baseType: !445)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !190, line: 103, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !202, file: !206, line: 30, baseType: !179, size: 64, align: 64, offset: 896)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !202, file: !206, line: 32, baseType: !140, size: 64, align: 64, offset: 960)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !202, file: !206, line: 33, baseType: !140, size: 64, align: 64, offset: 1024)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !202, file: !206, line: 34, baseType: !140, size: 64, align: 64, offset: 1088)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !202, file: !206, line: 35, baseType: !152, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !202, file: !206, line: 36, baseType: !152, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !202, file: !206, line: 37, baseType: !152, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !202, file: !206, line: 38, baseType: !152, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !202, file: !206, line: 40, baseType: !455, size: 128, align: 64, offset: 1216)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !120, line: 504, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !120, line: 506, size: 128, align: 64, elements: !457)
!457 = !{!458, !460}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !456, file: !120, line: 508, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !120, line: 48, baseType: !150)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !456, file: !120, line: 509, baseType: !459, size: 64, align: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !202, file: !206, line: 41, baseType: !146, size: 64, align: 64, offset: 1344)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !202, file: !206, line: 42, baseType: !122, size: 32, align: 32, offset: 1408)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !202, file: !206, line: 44, baseType: !165, size: 64, align: 64, offset: 1472)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !202, file: !206, line: 45, baseType: !165, size: 64, align: 64, offset: 1536)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !202, file: !206, line: 53, baseType: !466, size: 64, align: 64, offset: 1600)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !200, !469, !122}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !202, file: !206, line: 55, baseType: !472, size: 64, align: 64, offset: 1664)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!122, !200, !133}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !202, file: !206, line: 57, baseType: !476, size: 64, align: 64, offset: 1728)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!122, !200, !469}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !202, file: !206, line: 60, baseType: !480, size: 64, align: 64, offset: 1792)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!469, !200}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !202, file: !206, line: 62, baseType: !484, size: 64, align: 64, offset: 1856)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !200, !469, !469, !122}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !202, file: !206, line: 65, baseType: !488, size: 64, align: 64, offset: 1920)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!143, !200, !469, !469}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !202, file: !206, line: 69, baseType: !492, size: 64, align: 64, offset: 1984)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64, align: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!188, !200, !469}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !202, file: !206, line: 70, baseType: !496, size: 64, align: 64, offset: 2048)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!499, !200, !469}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !190, line: 110, baseType: !501)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !190, line: 110, flags: DIFlagFwdDecl)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !202, file: !206, line: 71, baseType: !503, size: 64, align: 64, offset: 2112)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!122, !469, !469}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !202, file: !206, line: 73, baseType: !503, size: 64, align: 64, offset: 2176)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !191, file: !195, line: 9, baseType: !140, size: 64, align: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !191, file: !195, line: 10, baseType: !140, size: 64, align: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !191, file: !195, line: 11, baseType: !146, size: 64, align: 64, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !191, file: !195, line: 12, baseType: !122, size: 32, align: 32, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !191, file: !195, line: 13, baseType: !140, size: 64, align: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !191, file: !195, line: 15, baseType: !513, size: 64, align: 64, offset: 576)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !516}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !190, line: 108, baseType: !518)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !190, line: 108, flags: DIFlagFwdDecl)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !191, file: !195, line: 17, baseType: !520, size: 64, align: 64, offset: 640)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!469, !516}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !191, file: !524, line: 5, baseType: !140, size: 64, align: 64, offset: 704)
!524 = !DIFile(filename: "channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!525 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !191, file: !524, line: 6, baseType: !140, size: 64, align: 64, offset: 768)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !191, file: !524, line: 7, baseType: !146, size: 64, align: 64, offset: 832)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !191, file: !524, line: 9, baseType: !179, size: 64, align: 64, offset: 896)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !191, file: !524, line: 10, baseType: !529, size: 64, align: 64, offset: 960)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !190, line: 111, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !532, line: 13, size: 576, align: 64, elements: !533)
!532 = !DIFile(filename: "nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!533 = !{!534, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !552, !553}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !531, file: !535, line: 3, baseType: !122, size: 32, align: 32)
!535 = !DIFile(filename: "nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!536 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !531, file: !535, line: 4, baseType: !122, size: 32, align: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !531, file: !535, line: 6, baseType: !146, size: 64, align: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !531, file: !535, line: 8, baseType: !140, size: 64, align: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !531, file: !535, line: 9, baseType: !140, size: 64, align: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !531, file: !535, line: 10, baseType: !140, size: 64, align: 64, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !531, file: !535, line: 11, baseType: !122, size: 32, align: 32, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !531, file: !535, line: 14, baseType: !152, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !531, file: !535, line: 15, baseType: !152, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !531, file: !535, line: 18, baseType: !152, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !531, file: !535, line: 19, baseType: !152, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !531, file: !535, line: 20, baseType: !152, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !531, file: !535, line: 21, baseType: !152, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !531, file: !535, line: 22, baseType: !549, size: 64, align: 8, offset: 360)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 64, align: 8, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 8)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !531, file: !535, line: 26, baseType: !114, size: 64, align: 64, offset: 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !531, file: !535, line: 28, baseType: !529, size: 64, align: 64, offset: 512)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !191, file: !524, line: 12, baseType: !152, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !191, file: !524, line: 13, baseType: !140, size: 64, align: 64, offset: 1088)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !191, file: !524, line: 14, baseType: !122, size: 32, align: 32, offset: 1152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !191, file: !524, line: 15, baseType: !140, size: 64, align: 64, offset: 1216)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !191, file: !524, line: 17, baseType: !152, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !191, file: !524, line: 18, baseType: !152, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !191, file: !524, line: 19, baseType: !152, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !191, file: !524, line: 20, baseType: !152, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !191, file: !524, line: 22, baseType: !152, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !191, file: !524, line: 23, baseType: !152, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !191, file: !524, line: 24, baseType: !152, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !191, file: !524, line: 25, baseType: !152, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !191, file: !524, line: 26, baseType: !152, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !191, file: !524, line: 31, baseType: !568, size: 64, align: 64, offset: 1344)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64, align: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!140, !188}
!571 = distinct !DIGlobalVariable(name: "time_tag", scope: !0, file: !164, line: 40, type: !122, isLocal: true, isDefinition: true, variable: i32* @time_tag)
!572 = !{i32 2, !"Dwarf Version", i32 4}
!573 = !{i32 2, !"Debug Info Version", i32 3}
!574 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!575 = distinct !DISubprogram(name: "ignore_check", scope: !164, file: !164, line: 133, type: !576, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !578)
!576 = !DISubroutineType(types: !577)
!577 = !{!122, !200, !469, !469, !469, !469, !122}
!578 = !{}
!579 = !DILocalVariable(name: "server", arg: 1, scope: !575, file: !164, line: 133, type: !200)
!580 = !DIExpression()
!581 = !DILocation(line: 133, column: 30, scope: !575)
!582 = !DILocalVariable(name: "nick", arg: 2, scope: !575, file: !164, line: 133, type: !469)
!583 = !DILocation(line: 133, column: 50, scope: !575)
!584 = !DILocalVariable(name: "host", arg: 3, scope: !575, file: !164, line: 133, type: !469)
!585 = !DILocation(line: 133, column: 68, scope: !575)
!586 = !DILocalVariable(name: "channel", arg: 4, scope: !575, file: !164, line: 134, type: !469)
!587 = !DILocation(line: 134, column: 16, scope: !575)
!588 = !DILocalVariable(name: "text", arg: 5, scope: !575, file: !164, line: 134, type: !469)
!589 = !DILocation(line: 134, column: 37, scope: !575)
!590 = !DILocalVariable(name: "level", arg: 6, scope: !575, file: !164, line: 134, type: !122)
!591 = !DILocation(line: 134, column: 47, scope: !575)
!592 = !DILocalVariable(name: "chanrec", scope: !575, file: !164, line: 136, type: !188)
!593 = !DILocation(line: 136, column: 15, scope: !575)
!594 = !DILocalVariable(name: "nickrec", scope: !575, file: !164, line: 137, type: !529)
!595 = !DILocation(line: 137, column: 12, scope: !575)
!596 = !DILocalVariable(name: "rec", scope: !575, file: !164, line: 138, type: !134)
!597 = !DILocation(line: 138, column: 21, scope: !575)
!598 = !DILocalVariable(name: "tmp", scope: !575, file: !164, line: 139, type: !165)
!599 = !DILocation(line: 139, column: 10, scope: !575)
!600 = !DILocalVariable(name: "nickmask", scope: !575, file: !164, line: 140, type: !140)
!601 = !DILocation(line: 140, column: 15, scope: !575)
!602 = !DILocalVariable(name: "len", scope: !575, file: !164, line: 141, type: !122)
!603 = !DILocation(line: 141, column: 13, scope: !575)
!604 = !DILocalVariable(name: "best_mask", scope: !575, file: !164, line: 141, type: !122)
!605 = !DILocation(line: 141, column: 18, scope: !575)
!606 = !DILocalVariable(name: "best_match", scope: !575, file: !164, line: 141, type: !122)
!607 = !DILocation(line: 141, column: 29, scope: !575)
!608 = !DILocalVariable(name: "best_patt", scope: !575, file: !164, line: 141, type: !122)
!609 = !DILocation(line: 141, column: 41, scope: !575)
!610 = !DILocation(line: 143, column: 13, scope: !611)
!611 = distinct !DILexicalBlock(scope: !575, file: !164, line: 143, column: 13)
!612 = !DILocation(line: 143, column: 18, scope: !611)
!613 = !DILocation(line: 143, column: 13, scope: !575)
!614 = !DILocation(line: 143, column: 31, scope: !615)
!615 = !DILexicalBlockFile(scope: !611, file: !164, discriminator: 1)
!616 = !DILocation(line: 143, column: 26, scope: !615)
!617 = !DILocation(line: 145, column: 12, scope: !575)
!618 = !DILocation(line: 145, column: 19, scope: !575)
!619 = !DILocation(line: 145, column: 26, scope: !575)
!620 = !DILocation(line: 145, column: 29, scope: !621)
!621 = !DILexicalBlockFile(scope: !575, file: !164, discriminator: 1)
!622 = !DILocation(line: 145, column: 37, scope: !621)
!623 = !DILocation(line: 145, column: 12, scope: !621)
!624 = !DILocation(line: 145, column: 12, scope: !625)
!625 = !DILexicalBlockFile(scope: !575, file: !164, discriminator: 2)
!626 = !DILocation(line: 146, column: 16, scope: !575)
!627 = !DILocation(line: 146, column: 24, scope: !575)
!628 = !DILocation(line: 146, column: 3, scope: !575)
!629 = !DILocation(line: 145, column: 12, scope: !630)
!630 = !DILexicalBlockFile(scope: !575, file: !164, discriminator: 3)
!631 = !DILocation(line: 145, column: 12, scope: !632)
!632 = !DILexicalBlockFile(scope: !575, file: !164, discriminator: 4)
!633 = !DILocation(line: 145, column: 10, scope: !632)
!634 = !DILocation(line: 147, column: 6, scope: !635)
!635 = distinct !DILexicalBlock(scope: !575, file: !164, line: 147, column: 6)
!636 = !DILocation(line: 147, column: 14, scope: !635)
!637 = !DILocation(line: 147, column: 21, scope: !635)
!638 = !DILocation(line: 147, column: 24, scope: !639)
!639 = !DILexicalBlockFile(scope: !635, file: !164, discriminator: 1)
!640 = !DILocation(line: 147, column: 29, scope: !639)
!641 = !DILocation(line: 147, column: 37, scope: !639)
!642 = !DILocation(line: 148, column: 31, scope: !635)
!643 = !DILocation(line: 148, column: 40, scope: !635)
!644 = !DILocation(line: 148, column: 17, scope: !635)
!645 = !DILocation(line: 148, column: 15, scope: !635)
!646 = !DILocation(line: 148, column: 47, scope: !635)
!647 = !DILocation(line: 147, column: 6, scope: !625)
!648 = !DILocation(line: 150, column: 7, scope: !649)
!649 = distinct !DILexicalBlock(scope: !650, file: !164, line: 150, column: 7)
!650 = distinct !DILexicalBlock(scope: !635, file: !164, line: 148, column: 55)
!651 = !DILocation(line: 150, column: 16, scope: !649)
!652 = !DILocation(line: 150, column: 21, scope: !649)
!653 = !DILocation(line: 150, column: 7, scope: !650)
!654 = !DILocation(line: 151, column: 22, scope: !649)
!655 = !DILocation(line: 151, column: 31, scope: !649)
!656 = !DILocation(line: 151, column: 40, scope: !649)
!657 = !DILocation(line: 151, column: 4, scope: !649)
!658 = !DILocation(line: 153, column: 30, scope: !650)
!659 = !DILocation(line: 153, column: 42, scope: !650)
!660 = !DILocation(line: 153, column: 49, scope: !650)
!661 = !DILocation(line: 153, column: 9, scope: !650)
!662 = !DILocation(line: 153, column: 7, scope: !650)
!663 = !DILocation(line: 154, column: 12, scope: !650)
!664 = !DILocation(line: 155, column: 2, scope: !650)
!665 = !DILocation(line: 156, column: 9, scope: !666)
!666 = distinct !DILexicalBlock(scope: !635, file: !164, line: 155, column: 9)
!667 = !DILocation(line: 156, column: 7, scope: !666)
!668 = !DILocation(line: 157, column: 26, scope: !666)
!669 = !DILocation(line: 157, column: 37, scope: !666)
!670 = !DILocation(line: 157, column: 14, scope: !666)
!671 = !DILocation(line: 157, column: 12, scope: !666)
!672 = !DILocation(line: 160, column: 31, scope: !575)
!673 = !DILocation(line: 160, column: 19, scope: !575)
!674 = !DILocation(line: 160, column: 48, scope: !575)
!675 = !DILocation(line: 161, column: 2, scope: !575)
!676 = !DILocation(line: 161, column: 9, scope: !677)
!677 = !DILexicalBlockFile(scope: !678, file: !164, discriminator: 1)
!678 = distinct !DILexicalBlock(scope: !679, file: !164, line: 161, column: 2)
!679 = distinct !DILexicalBlock(scope: !575, file: !164, line: 161, column: 2)
!680 = !DILocation(line: 161, column: 13, scope: !677)
!681 = !DILocation(line: 161, column: 2, scope: !677)
!682 = !DILocalVariable(name: "match", scope: !683, file: !164, line: 162, type: !122)
!683 = distinct !DILexicalBlock(scope: !678, file: !164, line: 161, column: 38)
!684 = !DILocation(line: 162, column: 7, scope: !683)
!685 = !DILocation(line: 163, column: 9, scope: !683)
!686 = !DILocation(line: 163, column: 14, scope: !683)
!687 = !DILocation(line: 163, column: 7, scope: !683)
!688 = !DILocation(line: 165, column: 7, scope: !689)
!689 = distinct !DILexicalBlock(scope: !683, file: !164, line: 165, column: 7)
!690 = !DILocation(line: 165, column: 16, scope: !689)
!691 = !DILocation(line: 165, column: 7, scope: !683)
!692 = !DILocation(line: 166, column: 14, scope: !689)
!693 = !DILocation(line: 166, column: 20, scope: !689)
!694 = !DILocation(line: 166, column: 30, scope: !689)
!695 = !DILocation(line: 166, column: 11, scope: !689)
!696 = !DILocation(line: 166, column: 16, scope: !697)
!697 = !DILexicalBlockFile(scope: !689, file: !164, discriminator: 1)
!698 = !DILocation(line: 166, column: 24, scope: !697)
!699 = !DILocation(line: 166, column: 11, scope: !697)
!700 = !DILocation(line: 166, column: 34, scope: !701)
!701 = !DILexicalBlockFile(scope: !689, file: !164, discriminator: 2)
!702 = !DILocation(line: 166, column: 43, scope: !701)
!703 = !DILocation(line: 166, column: 49, scope: !701)
!704 = !DILocation(line: 166, column: 55, scope: !701)
!705 = !DILocation(line: 166, column: 14, scope: !701)
!706 = !DILocation(line: 166, column: 66, scope: !701)
!707 = !DILocation(line: 166, column: 73, scope: !701)
!708 = !DILocation(line: 167, column: 7, scope: !689)
!709 = !DILocation(line: 167, column: 13, scope: !689)
!710 = !DILocation(line: 167, column: 22, scope: !689)
!711 = !DILocation(line: 167, column: 4, scope: !689)
!712 = !DILocation(line: 167, column: 9, scope: !697)
!713 = !DILocation(line: 167, column: 18, scope: !697)
!714 = !DILocation(line: 167, column: 4, scope: !697)
!715 = !DILocation(line: 167, column: 22, scope: !701)
!716 = !DILocation(line: 167, column: 28, scope: !701)
!717 = !DILocation(line: 167, column: 39, scope: !701)
!718 = !DILocation(line: 167, column: 7, scope: !701)
!719 = !DILocation(line: 167, column: 49, scope: !701)
!720 = !DILocation(line: 167, column: 57, scope: !701)
!721 = !DILocation(line: 168, column: 7, scope: !689)
!722 = !DILocation(line: 168, column: 13, scope: !689)
!723 = !DILocation(line: 168, column: 18, scope: !689)
!724 = !DILocation(line: 168, column: 4, scope: !689)
!725 = !DILocation(line: 168, column: 16, scope: !697)
!726 = !DILocation(line: 168, column: 22, scope: !697)
!727 = !DILocation(line: 168, column: 8, scope: !697)
!728 = !DILocation(line: 168, column: 33, scope: !697)
!729 = !DILocation(line: 168, column: 23, scope: !701)
!730 = !DILocation(line: 168, column: 29, scope: !701)
!731 = !DILocation(line: 168, column: 35, scope: !701)
!732 = !DILocation(line: 168, column: 6, scope: !701)
!733 = !DILocation(line: 168, column: 8, scope: !701)
!734 = !DILocation(line: 168, column: 64, scope: !735)
!735 = !DILexicalBlockFile(scope: !689, file: !164, discriminator: 3)
!736 = !DILocation(line: 168, column: 70, scope: !735)
!737 = !DILocation(line: 168, column: 76, scope: !735)
!738 = !DILocation(line: 168, column: 47, scope: !735)
!739 = !DILocation(line: 168, column: 8, scope: !735)
!740 = !DILocation(line: 168, column: 8, scope: !741)
!741 = !DILexicalBlockFile(scope: !689, file: !164, discriminator: 4)
!742 = !DILocation(line: 168, column: 4, scope: !741)
!743 = !DILocation(line: 167, column: 57, scope: !735)
!744 = !DILocation(line: 166, column: 10, scope: !735)
!745 = !DILocation(line: 166, column: 4, scope: !735)
!746 = !DILocation(line: 169, column: 7, scope: !747)
!747 = distinct !DILexicalBlock(scope: !683, file: !164, line: 169, column: 7)
!748 = !DILocation(line: 169, column: 13, scope: !747)
!749 = !DILocation(line: 170, column: 26, scope: !747)
!750 = !DILocation(line: 170, column: 31, scope: !747)
!751 = !DILocation(line: 170, column: 7, scope: !747)
!752 = !DILocation(line: 170, column: 38, scope: !747)
!753 = !DILocation(line: 171, column: 28, scope: !747)
!754 = !DILocation(line: 171, column: 33, scope: !747)
!755 = !DILocation(line: 171, column: 7, scope: !747)
!756 = !DILocation(line: 169, column: 7, scope: !757)
!757 = !DILexicalBlockFile(scope: !683, file: !164, discriminator: 1)
!758 = !DILocation(line: 172, column: 10, scope: !759)
!759 = distinct !DILexicalBlock(scope: !747, file: !164, line: 171, column: 40)
!760 = !DILocation(line: 172, column: 15, scope: !759)
!761 = !DILocation(line: 172, column: 20, scope: !759)
!762 = !DILocation(line: 172, column: 10, scope: !763)
!763 = !DILexicalBlockFile(scope: !759, file: !164, discriminator: 1)
!764 = !DILocation(line: 172, column: 40, scope: !765)
!765 = !DILexicalBlockFile(scope: !759, file: !164, discriminator: 2)
!766 = !DILocation(line: 172, column: 45, scope: !765)
!767 = !DILocation(line: 172, column: 33, scope: !765)
!768 = !DILocation(line: 172, column: 10, scope: !765)
!769 = !DILocation(line: 172, column: 10, scope: !770)
!770 = !DILexicalBlockFile(scope: !759, file: !164, discriminator: 3)
!771 = !DILocation(line: 172, column: 8, scope: !770)
!772 = !DILocation(line: 173, column: 8, scope: !773)
!773 = distinct !DILexicalBlock(scope: !759, file: !164, line: 173, column: 8)
!774 = !DILocation(line: 173, column: 14, scope: !773)
!775 = !DILocation(line: 173, column: 12, scope: !773)
!776 = !DILocation(line: 173, column: 8, scope: !759)
!777 = !DILocation(line: 174, column: 17, scope: !778)
!778 = distinct !DILexicalBlock(scope: !773, file: !164, line: 173, column: 25)
!779 = !DILocation(line: 174, column: 15, scope: !778)
!780 = !DILocation(line: 175, column: 19, scope: !778)
!781 = !DILocation(line: 175, column: 24, scope: !778)
!782 = !DILocation(line: 175, column: 18, scope: !778)
!783 = !DILocation(line: 175, column: 16, scope: !778)
!784 = !DILocation(line: 176, column: 4, scope: !778)
!785 = !DILocation(line: 176, column: 15, scope: !786)
!786 = !DILexicalBlockFile(scope: !787, file: !164, discriminator: 1)
!787 = distinct !DILexicalBlock(scope: !773, file: !164, line: 176, column: 15)
!788 = !DILocation(line: 176, column: 22, scope: !786)
!789 = !DILocation(line: 176, column: 19, scope: !786)
!790 = !DILocation(line: 177, column: 11, scope: !791)
!791 = distinct !DILexicalBlock(scope: !787, file: !164, line: 176, column: 33)
!792 = !DILocation(line: 177, column: 16, scope: !791)
!793 = !DILocation(line: 177, column: 24, scope: !791)
!794 = !DILocation(line: 177, column: 11, scope: !795)
!795 = !DILexicalBlockFile(scope: !791, file: !164, discriminator: 1)
!796 = !DILocation(line: 177, column: 44, scope: !797)
!797 = !DILexicalBlockFile(scope: !791, file: !164, discriminator: 2)
!798 = !DILocation(line: 177, column: 49, scope: !797)
!799 = !DILocation(line: 177, column: 37, scope: !797)
!800 = !DILocation(line: 177, column: 11, scope: !797)
!801 = !DILocation(line: 177, column: 11, scope: !802)
!802 = !DILexicalBlockFile(scope: !791, file: !164, discriminator: 3)
!803 = !DILocation(line: 177, column: 9, scope: !802)
!804 = !DILocation(line: 178, column: 9, scope: !805)
!805 = distinct !DILexicalBlock(scope: !791, file: !164, line: 178, column: 9)
!806 = !DILocation(line: 178, column: 15, scope: !805)
!807 = !DILocation(line: 178, column: 13, scope: !805)
!808 = !DILocation(line: 178, column: 9, scope: !791)
!809 = !DILocation(line: 179, column: 18, scope: !810)
!810 = distinct !DILexicalBlock(scope: !805, file: !164, line: 178, column: 26)
!811 = !DILocation(line: 179, column: 16, scope: !810)
!812 = !DILocation(line: 180, column: 20, scope: !810)
!813 = !DILocation(line: 180, column: 25, scope: !810)
!814 = !DILocation(line: 180, column: 19, scope: !810)
!815 = !DILocation(line: 180, column: 17, scope: !810)
!816 = !DILocation(line: 181, column: 5, scope: !810)
!817 = !DILocation(line: 181, column: 16, scope: !818)
!818 = !DILexicalBlockFile(scope: !819, file: !164, discriminator: 1)
!819 = distinct !DILexicalBlock(scope: !805, file: !164, line: 181, column: 16)
!820 = !DILocation(line: 181, column: 23, scope: !818)
!821 = !DILocation(line: 181, column: 20, scope: !818)
!822 = !DILocation(line: 181, column: 33, scope: !818)
!823 = !DILocation(line: 181, column: 36, scope: !824)
!824 = !DILexicalBlockFile(scope: !819, file: !164, discriminator: 2)
!825 = !DILocation(line: 181, column: 41, scope: !824)
!826 = !DILocation(line: 181, column: 16, scope: !824)
!827 = !DILocation(line: 182, column: 17, scope: !819)
!828 = !DILocation(line: 182, column: 6, scope: !819)
!829 = !DILocation(line: 183, column: 4, scope: !791)
!830 = !DILocation(line: 184, column: 3, scope: !759)
!831 = !DILocation(line: 185, column: 2, scope: !683)
!832 = !DILocation(line: 161, column: 27, scope: !833)
!833 = !DILexicalBlockFile(scope: !678, file: !164, discriminator: 2)
!834 = !DILocation(line: 161, column: 32, scope: !833)
!835 = !DILocation(line: 161, column: 25, scope: !833)
!836 = !DILocation(line: 161, column: 2, scope: !833)
!837 = distinct !{!837, !675}
!838 = !DILocation(line: 186, column: 16, scope: !575)
!839 = !DILocation(line: 186, column: 9, scope: !575)
!840 = !DILocation(line: 188, column: 6, scope: !841)
!841 = distinct !DILexicalBlock(scope: !575, file: !164, line: 188, column: 6)
!842 = !DILocation(line: 188, column: 17, scope: !841)
!843 = !DILocation(line: 188, column: 21, scope: !844)
!844 = !DILexicalBlockFile(scope: !841, file: !164, discriminator: 1)
!845 = !DILocation(line: 188, column: 27, scope: !844)
!846 = !DILocation(line: 188, column: 46, scope: !844)
!847 = !DILocation(line: 188, column: 6, scope: !844)
!848 = !DILocation(line: 189, column: 10, scope: !841)
!849 = !DILocation(line: 189, column: 3, scope: !841)
!850 = !DILocation(line: 191, column: 37, scope: !575)
!851 = !DILocation(line: 191, column: 46, scope: !575)
!852 = !DILocation(line: 191, column: 52, scope: !575)
!853 = !DILocation(line: 191, column: 16, scope: !575)
!854 = !DILocation(line: 191, column: 9, scope: !575)
!855 = !DILocation(line: 192, column: 1, scope: !575)
!856 = distinct !DISubprogram(name: "ignore_match_level", scope: !164, file: !164, line: 85, type: !857, isLocal: true, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !578)
!857 = !DISubroutineType(types: !858)
!858 = !{!122, !134, !122}
!859 = !DILocalVariable(name: "rec", arg: 1, scope: !856, file: !164, line: 85, type: !134)
!860 = !DILocation(line: 85, column: 43, scope: !856)
!861 = !DILocalVariable(name: "level", arg: 2, scope: !856, file: !164, line: 85, type: !122)
!862 = !DILocation(line: 85, column: 52, scope: !856)
!863 = !DILocation(line: 87, column: 6, scope: !864)
!864 = distinct !DILexicalBlock(scope: !856, file: !164, line: 87, column: 6)
!865 = !DILocation(line: 87, column: 12, scope: !864)
!866 = !DILocation(line: 87, column: 6, scope: !856)
!867 = !DILocalVariable(name: "flaglevel", scope: !868, file: !164, line: 88, type: !122)
!868 = distinct !DILexicalBlock(scope: !864, file: !164, line: 87, column: 53)
!869 = !DILocation(line: 88, column: 7, scope: !868)
!870 = !DILocation(line: 88, column: 19, scope: !868)
!871 = !DILocation(line: 88, column: 25, scope: !868)
!872 = !DILocalVariable(name: "msglevel", scope: !868, file: !164, line: 89, type: !122)
!873 = !DILocation(line: 89, column: 7, scope: !868)
!874 = !DILocation(line: 89, column: 18, scope: !868)
!875 = !DILocation(line: 89, column: 24, scope: !868)
!876 = !DILocation(line: 90, column: 11, scope: !868)
!877 = !DILocation(line: 90, column: 22, scope: !868)
!878 = !DILocation(line: 90, column: 27, scope: !868)
!879 = !DILocation(line: 90, column: 20, scope: !868)
!880 = !DILocation(line: 90, column: 34, scope: !868)
!881 = !DILocation(line: 90, column: 38, scope: !882)
!882 = !DILexicalBlockFile(scope: !868, file: !164, discriminator: 1)
!883 = !DILocation(line: 90, column: 50, scope: !882)
!884 = !DILocation(line: 90, column: 55, scope: !882)
!885 = !DILocation(line: 90, column: 48, scope: !882)
!886 = !DILocation(line: 90, column: 34, scope: !882)
!887 = !DILocation(line: 90, column: 34, scope: !888)
!888 = !DILexicalBlockFile(scope: !868, file: !164, discriminator: 2)
!889 = !DILocation(line: 90, column: 3, scope: !888)
!890 = !DILocation(line: 91, column: 15, scope: !891)
!891 = distinct !DILexicalBlock(scope: !864, file: !164, line: 91, column: 13)
!892 = !DILocation(line: 91, column: 20, scope: !891)
!893 = !DILocation(line: 91, column: 26, scope: !891)
!894 = !DILocation(line: 91, column: 13, scope: !864)
!895 = !DILocation(line: 92, column: 11, scope: !896)
!896 = distinct !DILexicalBlock(scope: !891, file: !164, line: 91, column: 68)
!897 = !DILocation(line: 92, column: 19, scope: !896)
!898 = !DILocation(line: 92, column: 24, scope: !896)
!899 = !DILocation(line: 92, column: 17, scope: !896)
!900 = !DILocation(line: 92, column: 3, scope: !896)
!901 = !DILocation(line: 94, column: 3, scope: !902)
!902 = distinct !DILexicalBlock(scope: !891, file: !164, line: 93, column: 9)
!903 = !DILocation(line: 96, column: 1, scope: !856)
!904 = distinct !DISubprogram(name: "ignore_match_pattern", scope: !164, file: !164, line: 62, type: !905, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !578)
!905 = !DISubroutineType(types: !906)
!906 = !{!122, !134, !469}
!907 = !DILocalVariable(name: "rec", arg: 1, scope: !904, file: !164, line: 62, type: !134)
!908 = !DILocation(line: 62, column: 45, scope: !904)
!909 = !DILocalVariable(name: "text", arg: 2, scope: !904, file: !164, line: 62, type: !469)
!910 = !DILocation(line: 62, column: 62, scope: !904)
!911 = !DILocation(line: 64, column: 6, scope: !912)
!912 = distinct !DILexicalBlock(scope: !904, file: !164, line: 64, column: 6)
!913 = !DILocation(line: 64, column: 11, scope: !912)
!914 = !DILocation(line: 64, column: 19, scope: !912)
!915 = !DILocation(line: 64, column: 6, scope: !904)
!916 = !DILocation(line: 65, column: 3, scope: !912)
!917 = !DILocation(line: 67, column: 13, scope: !918)
!918 = distinct !DILexicalBlock(scope: !904, file: !164, line: 67, column: 13)
!919 = !DILocation(line: 67, column: 18, scope: !918)
!920 = !DILocation(line: 67, column: 13, scope: !904)
!921 = !DILocation(line: 68, column: 3, scope: !918)
!922 = !DILocation(line: 70, column: 6, scope: !923)
!923 = distinct !DILexicalBlock(scope: !904, file: !164, line: 70, column: 6)
!924 = !DILocation(line: 70, column: 11, scope: !923)
!925 = !DILocation(line: 70, column: 6, scope: !904)
!926 = !DILocation(line: 71, column: 10, scope: !927)
!927 = distinct !DILexicalBlock(scope: !923, file: !164, line: 70, column: 19)
!928 = !DILocation(line: 71, column: 15, scope: !927)
!929 = !DILocation(line: 71, column: 20, scope: !927)
!930 = !DILocation(line: 71, column: 27, scope: !927)
!931 = !DILocation(line: 72, column: 18, scope: !927)
!932 = !DILocation(line: 72, column: 23, scope: !927)
!933 = !DILocation(line: 72, column: 29, scope: !927)
!934 = !DILocation(line: 72, column: 4, scope: !927)
!935 = !DILocation(line: 71, column: 27, scope: !936)
!936 = !DILexicalBlockFile(scope: !927, file: !164, discriminator: 1)
!937 = !DILocation(line: 71, column: 27, scope: !938)
!938 = !DILexicalBlockFile(scope: !927, file: !164, discriminator: 2)
!939 = !DILocation(line: 71, column: 3, scope: !938)
!940 = !DILocation(line: 75, column: 9, scope: !904)
!941 = !DILocation(line: 75, column: 14, scope: !904)
!942 = !DILocation(line: 76, column: 16, scope: !904)
!943 = !DILocation(line: 76, column: 22, scope: !904)
!944 = !DILocation(line: 76, column: 27, scope: !904)
!945 = !DILocation(line: 76, column: 3, scope: !904)
!946 = !DILocation(line: 76, column: 36, scope: !904)
!947 = !DILocation(line: 75, column: 9, scope: !948)
!948 = !DILexicalBlockFile(scope: !904, file: !164, discriminator: 1)
!949 = !DILocation(line: 77, column: 11, scope: !904)
!950 = !DILocation(line: 77, column: 17, scope: !904)
!951 = !DILocation(line: 77, column: 22, scope: !904)
!952 = !DILocation(line: 77, column: 3, scope: !904)
!953 = !DILocation(line: 77, column: 31, scope: !904)
!954 = !DILocation(line: 75, column: 9, scope: !955)
!955 = !DILexicalBlockFile(scope: !904, file: !164, discriminator: 2)
!956 = !DILocation(line: 75, column: 9, scope: !957)
!957 = !DILexicalBlockFile(scope: !904, file: !164, discriminator: 3)
!958 = !DILocation(line: 75, column: 2, scope: !957)
!959 = !DILocation(line: 78, column: 1, scope: !904)
!960 = distinct !DISubprogram(name: "ignore_check_replies", scope: !164, file: !164, line: 112, type: !961, isLocal: true, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !578)
!961 = !DISubroutineType(types: !962)
!962 = !{!122, !188, !469, !122}
!963 = !DILocalVariable(name: "chanrec", arg: 1, scope: !960, file: !164, line: 112, type: !188)
!964 = !DILocation(line: 112, column: 46, scope: !960)
!965 = !DILocalVariable(name: "text", arg: 2, scope: !960, file: !164, line: 112, type: !469)
!966 = !DILocation(line: 112, column: 67, scope: !960)
!967 = !DILocalVariable(name: "level", arg: 3, scope: !960, file: !164, line: 112, type: !122)
!968 = !DILocation(line: 112, column: 77, scope: !960)
!969 = !DILocalVariable(name: "tmp", scope: !960, file: !164, line: 114, type: !165)
!970 = !DILocation(line: 114, column: 10, scope: !960)
!971 = !DILocation(line: 116, column: 6, scope: !972)
!972 = distinct !DILexicalBlock(scope: !960, file: !164, line: 116, column: 6)
!973 = !DILocation(line: 116, column: 11, scope: !972)
!974 = !DILocation(line: 116, column: 18, scope: !972)
!975 = !DILocation(line: 116, column: 21, scope: !976)
!976 = !DILexicalBlockFile(scope: !972, file: !164, discriminator: 1)
!977 = !DILocation(line: 116, column: 29, scope: !976)
!978 = !DILocation(line: 116, column: 6, scope: !976)
!979 = !DILocation(line: 117, column: 3, scope: !972)
!980 = !DILocation(line: 120, column: 13, scope: !981)
!981 = distinct !DILexicalBlock(scope: !960, file: !164, line: 120, column: 2)
!982 = !DILocation(line: 120, column: 11, scope: !981)
!983 = !DILocation(line: 120, column: 7, scope: !981)
!984 = !DILocation(line: 120, column: 22, scope: !985)
!985 = !DILexicalBlockFile(scope: !986, file: !164, discriminator: 1)
!986 = distinct !DILexicalBlock(scope: !981, file: !164, line: 120, column: 2)
!987 = !DILocation(line: 120, column: 26, scope: !985)
!988 = !DILocation(line: 120, column: 2, scope: !985)
!989 = !DILocalVariable(name: "rec", scope: !990, file: !164, line: 121, type: !134)
!990 = distinct !DILexicalBlock(scope: !986, file: !164, line: 120, column: 51)
!991 = !DILocation(line: 121, column: 15, scope: !990)
!992 = !DILocation(line: 121, column: 21, scope: !990)
!993 = !DILocation(line: 121, column: 26, scope: !990)
!994 = !DILocation(line: 123, column: 7, scope: !995)
!995 = distinct !DILexicalBlock(scope: !990, file: !164, line: 123, column: 7)
!996 = !DILocation(line: 123, column: 12, scope: !995)
!997 = !DILocation(line: 123, column: 17, scope: !995)
!998 = !DILocation(line: 123, column: 24, scope: !995)
!999 = !DILocation(line: 123, column: 27, scope: !1000)
!1000 = !DILexicalBlockFile(scope: !995, file: !164, discriminator: 1)
!1001 = !DILocation(line: 123, column: 32, scope: !1000)
!1002 = !DILocation(line: 123, column: 40, scope: !1000)
!1003 = !DILocation(line: 124, column: 26, scope: !995)
!1004 = !DILocation(line: 124, column: 31, scope: !995)
!1005 = !DILocation(line: 124, column: 7, scope: !995)
!1006 = !DILocation(line: 124, column: 38, scope: !995)
!1007 = !DILocation(line: 125, column: 9, scope: !995)
!1008 = !DILocation(line: 125, column: 15, scope: !995)
!1009 = !DILocation(line: 125, column: 24, scope: !995)
!1010 = !DILocation(line: 125, column: 6, scope: !995)
!1011 = !DILocation(line: 125, column: 11, scope: !1000)
!1012 = !DILocation(line: 125, column: 20, scope: !1000)
!1013 = !DILocation(line: 125, column: 26, scope: !1000)
!1014 = !DILocation(line: 125, column: 6, scope: !1000)
!1015 = !DILocation(line: 125, column: 24, scope: !1016)
!1016 = !DILexicalBlockFile(scope: !995, file: !164, discriminator: 2)
!1017 = !DILocation(line: 125, column: 30, scope: !1016)
!1018 = !DILocation(line: 125, column: 41, scope: !1016)
!1019 = !DILocation(line: 125, column: 50, scope: !1016)
!1020 = !DILocation(line: 125, column: 9, scope: !1016)
!1021 = !DILocation(line: 125, column: 57, scope: !1016)
!1022 = !DILocation(line: 125, column: 65, scope: !1016)
!1023 = !DILocation(line: 126, column: 32, scope: !995)
!1024 = !DILocation(line: 126, column: 37, scope: !995)
!1025 = !DILocation(line: 126, column: 46, scope: !995)
!1026 = !DILocation(line: 126, column: 7, scope: !995)
!1027 = !DILocation(line: 123, column: 7, scope: !1028)
!1028 = !DILexicalBlockFile(scope: !990, file: !164, discriminator: 2)
!1029 = !DILocation(line: 127, column: 4, scope: !995)
!1030 = !DILocation(line: 128, column: 2, scope: !990)
!1031 = !DILocation(line: 120, column: 40, scope: !1032)
!1032 = !DILexicalBlockFile(scope: !986, file: !164, discriminator: 2)
!1033 = !DILocation(line: 120, column: 45, scope: !1032)
!1034 = !DILocation(line: 120, column: 38, scope: !1032)
!1035 = !DILocation(line: 120, column: 2, scope: !1032)
!1036 = distinct !{!1036, !1037}
!1037 = !DILocation(line: 120, column: 2, scope: !960)
!1038 = !DILocation(line: 130, column: 2, scope: !960)
!1039 = !DILocation(line: 131, column: 1, scope: !960)
!1040 = distinct !DISubprogram(name: "ignore_find_full", scope: !164, file: !164, line: 194, type: !1041, isLocal: false, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !578)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!134, !469, !469, !469, !143, !1043}
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!1044 = !DILocalVariable(name: "servertag", arg: 1, scope: !1040, file: !164, line: 194, type: !469)
!1045 = !DILocation(line: 194, column: 42, scope: !1040)
!1046 = !DILocalVariable(name: "mask", arg: 2, scope: !1040, file: !164, line: 194, type: !469)
!1047 = !DILocation(line: 194, column: 65, scope: !1040)
!1048 = !DILocalVariable(name: "pattern", arg: 3, scope: !1040, file: !164, line: 194, type: !469)
!1049 = !DILocation(line: 194, column: 83, scope: !1040)
!1050 = !DILocalVariable(name: "channels", arg: 4, scope: !1040, file: !164, line: 195, type: !143)
!1051 = !DILocation(line: 195, column: 10, scope: !1040)
!1052 = !DILocalVariable(name: "flags", arg: 5, scope: !1040, file: !164, line: 195, type: !1043)
!1053 = !DILocation(line: 195, column: 30, scope: !1040)
!1054 = !DILocalVariable(name: "tmp", scope: !1040, file: !164, line: 197, type: !165)
!1055 = !DILocation(line: 197, column: 10, scope: !1040)
!1056 = !DILocalVariable(name: "chan", scope: !1040, file: !164, line: 198, type: !143)
!1057 = !DILocation(line: 198, column: 9, scope: !1040)
!1058 = !DILocalVariable(name: "ignore_servertag", scope: !1040, file: !164, line: 199, type: !122)
!1059 = !DILocation(line: 199, column: 6, scope: !1040)
!1060 = !DILocation(line: 201, column: 6, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1040, file: !164, line: 201, column: 6)
!1062 = !DILocation(line: 201, column: 11, scope: !1061)
!1063 = !DILocation(line: 201, column: 18, scope: !1061)
!1064 = !DILocation(line: 201, column: 23, scope: !1065)
!1065 = !DILexicalBlockFile(scope: !1061, file: !164, discriminator: 1)
!1066 = !DILocation(line: 201, column: 22, scope: !1065)
!1067 = !DILocation(line: 201, column: 28, scope: !1065)
!1068 = !DILocation(line: 201, column: 36, scope: !1065)
!1069 = !DILocation(line: 201, column: 49, scope: !1070)
!1070 = !DILexicalBlockFile(scope: !1061, file: !164, discriminator: 2)
!1071 = !DILocation(line: 201, column: 39, scope: !1070)
!1072 = !DILocation(line: 201, column: 60, scope: !1070)
!1073 = !DILocation(line: 201, column: 6, scope: !1070)
!1074 = !DILocation(line: 202, column: 8, scope: !1061)
!1075 = !DILocation(line: 202, column: 3, scope: !1061)
!1076 = !DILocation(line: 204, column: 21, scope: !1040)
!1077 = !DILocation(line: 204, column: 31, scope: !1040)
!1078 = !DILocation(line: 204, column: 38, scope: !1040)
!1079 = !DILocation(line: 204, column: 51, scope: !1080)
!1080 = !DILexicalBlockFile(scope: !1040, file: !164, discriminator: 1)
!1081 = !DILocation(line: 204, column: 41, scope: !1080)
!1082 = !DILocation(line: 204, column: 67, scope: !1080)
!1083 = !DILocation(line: 204, column: 38, scope: !1084)
!1084 = !DILexicalBlockFile(scope: !1040, file: !164, discriminator: 2)
!1085 = !DILocation(line: 204, column: 19, scope: !1084)
!1086 = !DILocation(line: 205, column: 13, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1040, file: !164, line: 205, column: 2)
!1088 = !DILocation(line: 205, column: 11, scope: !1087)
!1089 = !DILocation(line: 205, column: 7, scope: !1087)
!1090 = !DILocation(line: 205, column: 22, scope: !1091)
!1091 = !DILexicalBlockFile(scope: !1092, file: !164, discriminator: 1)
!1092 = distinct !DILexicalBlock(scope: !1087, file: !164, line: 205, column: 2)
!1093 = !DILocation(line: 205, column: 26, scope: !1091)
!1094 = !DILocation(line: 205, column: 2, scope: !1091)
!1095 = !DILocalVariable(name: "rec", scope: !1096, file: !164, line: 206, type: !134)
!1096 = distinct !DILexicalBlock(scope: !1092, file: !164, line: 205, column: 51)
!1097 = !DILocation(line: 206, column: 15, scope: !1096)
!1098 = !DILocation(line: 206, column: 21, scope: !1096)
!1099 = !DILocation(line: 206, column: 26, scope: !1096)
!1100 = !DILocation(line: 208, column: 8, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1096, file: !164, line: 208, column: 7)
!1102 = !DILocation(line: 208, column: 7, scope: !1096)
!1103 = !DILocation(line: 209, column: 9, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !164, line: 209, column: 8)
!1105 = distinct !DILexicalBlock(scope: !1101, file: !164, line: 208, column: 26)
!1106 = !DILocation(line: 209, column: 19, scope: !1104)
!1107 = !DILocation(line: 209, column: 26, scope: !1104)
!1108 = !DILocation(line: 209, column: 29, scope: !1109)
!1109 = !DILexicalBlockFile(scope: !1104, file: !164, discriminator: 1)
!1110 = !DILocation(line: 209, column: 34, scope: !1109)
!1111 = !DILocation(line: 209, column: 44, scope: !1109)
!1112 = !DILocation(line: 209, column: 53, scope: !1109)
!1113 = !DILocation(line: 210, column: 9, scope: !1104)
!1114 = !DILocation(line: 210, column: 19, scope: !1104)
!1115 = !DILocation(line: 210, column: 26, scope: !1104)
!1116 = !DILocation(line: 210, column: 29, scope: !1109)
!1117 = !DILocation(line: 210, column: 34, scope: !1109)
!1118 = !DILocation(line: 210, column: 44, scope: !1109)
!1119 = !DILocation(line: 209, column: 8, scope: !1120)
!1120 = !DILexicalBlockFile(scope: !1105, file: !164, discriminator: 2)
!1121 = !DILocation(line: 211, column: 5, scope: !1104)
!1122 = !DILocation(line: 213, column: 8, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1105, file: !164, line: 213, column: 8)
!1124 = !DILocation(line: 213, column: 18, scope: !1123)
!1125 = !DILocation(line: 213, column: 25, scope: !1123)
!1126 = !DILocation(line: 213, column: 47, scope: !1127)
!1127 = !DILexicalBlockFile(scope: !1123, file: !164, discriminator: 1)
!1128 = !DILocation(line: 213, column: 58, scope: !1127)
!1129 = !DILocation(line: 213, column: 63, scope: !1127)
!1130 = !DILocation(line: 213, column: 28, scope: !1127)
!1131 = !DILocation(line: 213, column: 74, scope: !1127)
!1132 = !DILocation(line: 213, column: 8, scope: !1127)
!1133 = !DILocation(line: 214, column: 5, scope: !1123)
!1134 = !DILocation(line: 215, column: 3, scope: !1105)
!1135 = !DILocation(line: 217, column: 8, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1096, file: !164, line: 217, column: 7)
!1137 = !DILocation(line: 217, column: 14, scope: !1136)
!1138 = !DILocation(line: 217, column: 35, scope: !1136)
!1139 = !DILocation(line: 217, column: 39, scope: !1140)
!1140 = !DILexicalBlockFile(scope: !1136, file: !164, discriminator: 1)
!1141 = !DILocation(line: 217, column: 44, scope: !1140)
!1142 = !DILocation(line: 217, column: 50, scope: !1140)
!1143 = !DILocation(line: 217, column: 69, scope: !1140)
!1144 = !DILocation(line: 217, column: 7, scope: !1140)
!1145 = !DILocation(line: 218, column: 4, scope: !1136)
!1146 = !DILocation(line: 220, column: 9, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1096, file: !164, line: 220, column: 7)
!1148 = !DILocation(line: 220, column: 15, scope: !1147)
!1149 = !DILocation(line: 220, column: 36, scope: !1147)
!1150 = !DILocation(line: 220, column: 40, scope: !1151)
!1151 = !DILexicalBlockFile(scope: !1147, file: !164, discriminator: 1)
!1152 = !DILocation(line: 220, column: 45, scope: !1151)
!1153 = !DILocation(line: 220, column: 51, scope: !1151)
!1154 = !DILocation(line: 220, column: 70, scope: !1151)
!1155 = !DILocation(line: 220, column: 7, scope: !1151)
!1156 = !DILocation(line: 221, column: 4, scope: !1147)
!1157 = !DILocation(line: 223, column: 8, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1096, file: !164, line: 223, column: 7)
!1159 = !DILocation(line: 223, column: 14, scope: !1158)
!1160 = !DILocation(line: 223, column: 36, scope: !1158)
!1161 = !DILocation(line: 223, column: 40, scope: !1162)
!1162 = !DILexicalBlockFile(scope: !1158, file: !164, discriminator: 1)
!1163 = !DILocation(line: 223, column: 45, scope: !1162)
!1164 = !DILocation(line: 223, column: 51, scope: !1162)
!1165 = !DILocation(line: 223, column: 70, scope: !1162)
!1166 = !DILocation(line: 223, column: 7, scope: !1162)
!1167 = !DILocation(line: 224, column: 4, scope: !1158)
!1168 = !DILocation(line: 226, column: 9, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1096, file: !164, line: 226, column: 7)
!1170 = !DILocation(line: 226, column: 15, scope: !1169)
!1171 = !DILocation(line: 226, column: 37, scope: !1169)
!1172 = !DILocation(line: 226, column: 41, scope: !1173)
!1173 = !DILexicalBlockFile(scope: !1169, file: !164, discriminator: 1)
!1174 = !DILocation(line: 226, column: 46, scope: !1173)
!1175 = !DILocation(line: 226, column: 52, scope: !1173)
!1176 = !DILocation(line: 226, column: 71, scope: !1173)
!1177 = !DILocation(line: 226, column: 7, scope: !1173)
!1178 = !DILocation(line: 227, column: 4, scope: !1169)
!1179 = !DILocation(line: 229, column: 8, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1096, file: !164, line: 229, column: 7)
!1181 = !DILocation(line: 229, column: 13, scope: !1180)
!1182 = !DILocation(line: 229, column: 18, scope: !1180)
!1183 = !DILocation(line: 229, column: 25, scope: !1180)
!1184 = !DILocation(line: 229, column: 28, scope: !1185)
!1185 = !DILexicalBlockFile(scope: !1180, file: !164, discriminator: 1)
!1186 = !DILocation(line: 229, column: 33, scope: !1185)
!1187 = !DILocation(line: 229, column: 42, scope: !1185)
!1188 = !DILocation(line: 230, column: 8, scope: !1180)
!1189 = !DILocation(line: 230, column: 13, scope: !1180)
!1190 = !DILocation(line: 230, column: 18, scope: !1180)
!1191 = !DILocation(line: 230, column: 25, scope: !1180)
!1192 = !DILocation(line: 230, column: 28, scope: !1185)
!1193 = !DILocation(line: 230, column: 33, scope: !1185)
!1194 = !DILocation(line: 229, column: 7, scope: !1195)
!1195 = !DILexicalBlockFile(scope: !1096, file: !164, discriminator: 2)
!1196 = !DILocation(line: 231, column: 4, scope: !1180)
!1197 = !DILocation(line: 233, column: 7, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1096, file: !164, line: 233, column: 7)
!1199 = !DILocation(line: 233, column: 12, scope: !1198)
!1200 = !DILocation(line: 233, column: 17, scope: !1198)
!1201 = !DILocation(line: 233, column: 24, scope: !1198)
!1202 = !DILocation(line: 233, column: 46, scope: !1203)
!1203 = !DILexicalBlockFile(scope: !1198, file: !164, discriminator: 1)
!1204 = !DILocation(line: 233, column: 51, scope: !1203)
!1205 = !DILocation(line: 233, column: 57, scope: !1203)
!1206 = !DILocation(line: 233, column: 27, scope: !1203)
!1207 = !DILocation(line: 233, column: 63, scope: !1203)
!1208 = !DILocation(line: 233, column: 7, scope: !1203)
!1209 = !DILocation(line: 234, column: 4, scope: !1198)
!1210 = !DILocation(line: 237, column: 7, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1096, file: !164, line: 237, column: 7)
!1212 = !DILocation(line: 237, column: 13, scope: !1211)
!1213 = !DILocation(line: 237, column: 7, scope: !1096)
!1214 = !DILocation(line: 238, column: 9, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1216, file: !164, line: 238, column: 8)
!1216 = distinct !DILexicalBlock(scope: !1211, file: !164, line: 237, column: 36)
!1217 = !DILocation(line: 238, column: 14, scope: !1215)
!1218 = !DILocation(line: 238, column: 22, scope: !1215)
!1219 = !DILocation(line: 238, column: 29, scope: !1215)
!1220 = !DILocation(line: 238, column: 32, scope: !1221)
!1221 = !DILexicalBlockFile(scope: !1215, file: !164, discriminator: 1)
!1222 = !DILocation(line: 238, column: 40, scope: !1221)
!1223 = !DILocation(line: 238, column: 49, scope: !1221)
!1224 = !DILocation(line: 239, column: 9, scope: !1215)
!1225 = !DILocation(line: 239, column: 14, scope: !1215)
!1226 = !DILocation(line: 239, column: 22, scope: !1215)
!1227 = !DILocation(line: 239, column: 29, scope: !1215)
!1228 = !DILocation(line: 239, column: 32, scope: !1221)
!1229 = !DILocation(line: 239, column: 40, scope: !1221)
!1230 = !DILocation(line: 238, column: 8, scope: !1231)
!1231 = !DILexicalBlockFile(scope: !1216, file: !164, discriminator: 2)
!1232 = !DILocation(line: 240, column: 5, scope: !1215)
!1233 = !DILocation(line: 242, column: 8, scope: !1234)
!1234 = distinct !DILexicalBlock(scope: !1216, file: !164, line: 242, column: 8)
!1235 = !DILocation(line: 242, column: 13, scope: !1234)
!1236 = !DILocation(line: 242, column: 21, scope: !1234)
!1237 = !DILocation(line: 242, column: 28, scope: !1234)
!1238 = !DILocation(line: 242, column: 50, scope: !1239)
!1239 = !DILexicalBlockFile(scope: !1234, file: !164, discriminator: 1)
!1240 = !DILocation(line: 242, column: 55, scope: !1239)
!1241 = !DILocation(line: 242, column: 64, scope: !1239)
!1242 = !DILocation(line: 242, column: 31, scope: !1239)
!1243 = !DILocation(line: 242, column: 73, scope: !1239)
!1244 = !DILocation(line: 242, column: 8, scope: !1239)
!1245 = !DILocation(line: 243, column: 5, scope: !1234)
!1246 = !DILocation(line: 244, column: 3, scope: !1216)
!1247 = !DILocation(line: 246, column: 8, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1096, file: !164, line: 246, column: 7)
!1249 = !DILocation(line: 246, column: 17, scope: !1248)
!1250 = !DILocation(line: 246, column: 24, scope: !1248)
!1251 = !DILocation(line: 246, column: 27, scope: !1252)
!1252 = !DILexicalBlockFile(scope: !1248, file: !164, discriminator: 1)
!1253 = !DILocation(line: 246, column: 32, scope: !1252)
!1254 = !DILocation(line: 246, column: 41, scope: !1252)
!1255 = !DILocation(line: 246, column: 7, scope: !1252)
!1256 = !DILocation(line: 247, column: 11, scope: !1248)
!1257 = !DILocation(line: 247, column: 4, scope: !1248)
!1258 = !DILocation(line: 249, column: 7, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1096, file: !164, line: 249, column: 7)
!1260 = !DILocation(line: 249, column: 16, scope: !1259)
!1261 = !DILocation(line: 249, column: 23, scope: !1259)
!1262 = !DILocation(line: 249, column: 37, scope: !1263)
!1263 = !DILexicalBlockFile(scope: !1259, file: !164, discriminator: 1)
!1264 = !DILocation(line: 249, column: 36, scope: !1263)
!1265 = !DILocation(line: 249, column: 26, scope: !1263)
!1266 = !DILocation(line: 249, column: 52, scope: !1263)
!1267 = !DILocation(line: 249, column: 7, scope: !1263)
!1268 = !DILocation(line: 250, column: 11, scope: !1259)
!1269 = !DILocation(line: 250, column: 4, scope: !1259)
!1270 = !DILocation(line: 252, column: 7, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1096, file: !164, line: 252, column: 7)
!1272 = !DILocation(line: 252, column: 16, scope: !1271)
!1273 = !DILocation(line: 252, column: 23, scope: !1271)
!1274 = !DILocation(line: 252, column: 26, scope: !1275)
!1275 = !DILexicalBlockFile(scope: !1271, file: !164, discriminator: 1)
!1276 = !DILocation(line: 252, column: 31, scope: !1275)
!1277 = !DILocation(line: 252, column: 40, scope: !1275)
!1278 = !DILocation(line: 252, column: 7, scope: !1275)
