; ModuleID = './line109-channels-query.o.i'
source_filename = "./line109-channels-query.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !42)
!1 = !DIFile(filename: "line109-channels-query.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 53, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "channels-query.c", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41}
!38 = !DIEnumerator(name: "CHANNEL_QUERY_MODE", value: 0)
!39 = !DIEnumerator(name: "CHANNEL_QUERY_WHO", value: 1)
!40 = !DIEnumerator(name: "CHANNEL_QUERY_BMODE", value: 2)
!41 = !DIEnumerator(name: "CHANNEL_QUERIES", value: 3)
!42 = !{!43, !50, !51, !55, !57, !366, !673, !627, !471, !356, !683}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !44, line: 9, baseType: !45)
!44 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !48, !48, !48, !48, !48, !48}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !53, line: 46, baseType: !54)
!53 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!54 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !59, line: 6, baseType: !60)
!59 = !DIFile(filename: "irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !61, line: 42, size: 39168, align: 64, elements: !62)
!61 = !DIFile(filename: "irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!62 = !{!63, !66, !67, !68, !311, !316, !317, !318, !319, !320, !321, !322, !323, !324, !328, !329, !333, !334, !335, !339, !344, !345, !346, !347, !348, !349, !350, !351, !358, !359, !360, !361, !362, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !670, !672}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !60, file: !64, line: 3, baseType: !65, size: 32, align: 32)
!64 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!65 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !60, file: !64, line: 4, baseType: !65, size: 32, align: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !60, file: !64, line: 6, baseType: !65, size: 32, align: 32, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !60, file: !64, line: 8, baseType: !69, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !59, line: 5, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !61, line: 24, size: 2496, align: 64, elements: !72)
!72 = !{!73, !75, !76, !77, !79, !80, !81, !82, !83, !85, !86, !87, !88, !89, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !71, file: !74, line: 3, baseType: !65, size: 32, align: 32)
!74 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!75 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !71, file: !74, line: 4, baseType: !65, size: 32, align: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !71, file: !74, line: 6, baseType: !65, size: 32, align: 32, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !71, file: !74, line: 9, baseType: !78, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !71, file: !74, line: 10, baseType: !65, size: 32, align: 32, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !71, file: !74, line: 11, baseType: !78, size: 64, align: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !71, file: !74, line: 11, baseType: !78, size: 64, align: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !71, file: !74, line: 11, baseType: !78, size: 64, align: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !71, file: !74, line: 13, baseType: !84, size: 16, align: 16, offset: 448)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !71, file: !74, line: 14, baseType: !78, size: 64, align: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !71, file: !74, line: 15, baseType: !78, size: 64, align: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !71, file: !74, line: 16, baseType: !65, size: 32, align: 32, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !71, file: !74, line: 17, baseType: !78, size: 64, align: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !71, file: !74, line: 19, baseType: !90, size: 64, align: 64, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !92, line: 99, baseType: !93)
!92 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !92, line: 99, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !71, file: !74, line: 19, baseType: !90, size: 64, align: 64, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !71, file: !74, line: 21, baseType: !78, size: 64, align: 64, offset: 896)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !71, file: !74, line: 22, baseType: !78, size: 64, align: 64, offset: 960)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !71, file: !74, line: 23, baseType: !78, size: 64, align: 64, offset: 1024)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !71, file: !74, line: 24, baseType: !78, size: 64, align: 64, offset: 1088)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !71, file: !74, line: 26, baseType: !78, size: 64, align: 64, offset: 1152)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !71, file: !74, line: 27, baseType: !78, size: 64, align: 64, offset: 1216)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !71, file: !74, line: 28, baseType: !78, size: 64, align: 64, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !71, file: !74, line: 29, baseType: !78, size: 64, align: 64, offset: 1344)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !71, file: !74, line: 30, baseType: !78, size: 64, align: 64, offset: 1408)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !71, file: !74, line: 31, baseType: !78, size: 64, align: 64, offset: 1472)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !71, file: !74, line: 32, baseType: !78, size: 64, align: 64, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !71, file: !74, line: 33, baseType: !78, size: 64, align: 64, offset: 1600)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !71, file: !74, line: 35, baseType: !108, size: 64, align: 64, offset: 1664)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !111)
!111 = !{!112, !114, !256, !257, !262, !263, !264, !265, !266, !275, !276, !277, !281, !282, !283, !284, !285, !286, !287, !288}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !110, file: !4, line: 100, baseType: !113, size: 32, align: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !53, line: 49, baseType: !65)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !110, file: !4, line: 101, baseType: !115, size: 64, align: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !118)
!118 = !{!119, !141, !147, !154, !158, !243, !247, !252}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !117, file: !4, line: 133, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !108, !51, !124, !127, !128}
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !125, line: 66, baseType: !126)
!125 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!126 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !131, line: 42, baseType: !132)
!131 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !131, line: 44, size: 128, align: 64, elements: !133)
!133 = !{!134, !139, !140}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !132, file: !131, line: 46, baseType: !135, size: 32, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !136, line: 36, baseType: !137)
!136 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !125, line: 45, baseType: !138)
!138 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !132, file: !131, line: 47, baseType: !113, size: 32, align: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !132, file: !131, line: 48, baseType: !51, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !117, file: !4, line: 138, baseType: !142, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!123, !108, !145, !124, !127, !128}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !117, file: !4, line: 143, baseType: !148, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!123, !108, !151, !153, !128}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !125, line: 51, baseType: !152)
!152 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !117, file: !4, line: 147, baseType: !155, size: 64, align: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!123, !108, !128}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !117, file: !4, line: 149, baseType: !159, size: 64, align: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !108, !242}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !165)
!165 = !{!166, !168, !189, !218, !220, !224, !225, !226, !227, !235, !236, !237, !238}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !164, file: !16, line: 174, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !53, line: 77, baseType: !50)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !164, file: !16, line: 175, baseType: !169, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !172)
!172 = !{!173, !177, !178}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !171, file: !16, line: 198, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !167}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !171, file: !16, line: 199, baseType: !174, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !171, file: !16, line: 200, baseType: !179, size: 64, align: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !167, !162, !182, !188}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!187, !167}
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !53, line: 50, baseType: !113)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !164, file: !16, line: 177, baseType: !190, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !194)
!194 = !{!195, !200, !204, !208, !212, !213}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !193, file: !16, line: 216, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!187, !162, !199}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !193, file: !16, line: 218, baseType: !201, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!187, !162}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !193, file: !16, line: 219, baseType: !205, size: 64, align: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!187, !162, !183, !167}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !193, file: !16, line: 222, baseType: !209, size: 64, align: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !162}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !193, file: !16, line: 226, baseType: !183, size: 64, align: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !193, file: !16, line: 227, baseType: !214, size: 64, align: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{null}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !164, file: !16, line: 178, baseType: !219, size: 32, align: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !53, line: 55, baseType: !138)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !164, file: !16, line: 180, baseType: !221, size: 64, align: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !223)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !164, file: !16, line: 182, baseType: !113, size: 32, align: 32, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !164, file: !16, line: 183, baseType: !219, size: 32, align: 32, offset: 352)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !164, file: !16, line: 184, baseType: !219, size: 32, align: 32, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !164, file: !16, line: 186, baseType: !228, size: 64, align: 64, offset: 448)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !230, line: 37, baseType: !231)
!230 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !230, line: 39, size: 128, align: 64, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !231, file: !230, line: 41, baseType: !167, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !231, file: !230, line: 42, baseType: !228, size: 64, align: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !164, file: !16, line: 188, baseType: !162, size: 64, align: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !164, file: !16, line: 189, baseType: !162, size: 64, align: 64, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !164, file: !16, line: 191, baseType: !78, size: 64, align: 64, offset: 640)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !164, file: !16, line: 193, baseType: !239, size: 64, align: 64, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !241)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !117, file: !4, line: 151, baseType: !244, size: 64, align: 64, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !108}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !117, file: !4, line: 152, baseType: !248, size: 64, align: 64, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!123, !108, !251, !128}
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !117, file: !4, line: 155, baseType: !253, size: 64, align: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!251, !108}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !110, file: !4, line: 103, baseType: !51, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !110, file: !4, line: 104, baseType: !258, size: 64, align: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !259, line: 77, baseType: !260)
!259 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !259, line: 77, flags: DIFlagFwdDecl)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !110, file: !4, line: 105, baseType: !258, size: 64, align: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !110, file: !4, line: 106, baseType: !51, size: 64, align: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !110, file: !4, line: 107, baseType: !219, size: 32, align: 32, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !110, file: !4, line: 109, baseType: !124, size: 64, align: 64, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !110, file: !4, line: 110, baseType: !267, size: 64, align: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !269, line: 39, baseType: !270)
!269 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !269, line: 41, size: 192, align: 64, elements: !271)
!271 = !{!272, !273, !274}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !270, file: !269, line: 43, baseType: !51, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !270, file: !269, line: 44, baseType: !124, size: 64, align: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !270, file: !269, line: 45, baseType: !124, size: 64, align: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !110, file: !4, line: 111, baseType: !267, size: 64, align: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !110, file: !4, line: 112, baseType: !267, size: 64, align: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !110, file: !4, line: 113, baseType: !278, size: 48, align: 8, offset: 704)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 48, align: 8, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 6)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !110, file: !4, line: 117, baseType: !219, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !110, file: !4, line: 118, baseType: !219, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !110, file: !4, line: 119, baseType: !219, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !110, file: !4, line: 120, baseType: !219, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !110, file: !4, line: 121, baseType: !219, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !110, file: !4, line: 122, baseType: !219, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !110, file: !4, line: 124, baseType: !167, size: 64, align: 64, offset: 768)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !110, file: !4, line: 125, baseType: !167, size: 64, align: 64, offset: 832)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !71, file: !74, line: 38, baseType: !138, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !71, file: !74, line: 39, baseType: !138, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !71, file: !74, line: 40, baseType: !138, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !71, file: !74, line: 41, baseType: !138, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !71, file: !74, line: 42, baseType: !138, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !71, file: !74, line: 43, baseType: !138, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !71, file: !74, line: 44, baseType: !138, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !71, file: !74, line: 45, baseType: !138, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !71, file: !74, line: 46, baseType: !78, size: 64, align: 64, offset: 1792)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !71, file: !74, line: 47, baseType: !78, size: 64, align: 64, offset: 1856)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !71, file: !61, line: 27, baseType: !78, size: 64, align: 64, offset: 1920)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !71, file: !61, line: 28, baseType: !78, size: 64, align: 64, offset: 1984)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !71, file: !61, line: 30, baseType: !65, size: 32, align: 32, offset: 2048)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !71, file: !61, line: 31, baseType: !78, size: 64, align: 64, offset: 2112)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !71, file: !61, line: 32, baseType: !78, size: 64, align: 64, offset: 2176)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !71, file: !61, line: 34, baseType: !65, size: 32, align: 32, offset: 2240)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !71, file: !61, line: 35, baseType: !65, size: 32, align: 32, offset: 2272)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !71, file: !61, line: 36, baseType: !65, size: 32, align: 32, offset: 2304)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !71, file: !61, line: 38, baseType: !65, size: 32, align: 32, offset: 2336)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !71, file: !61, line: 38, baseType: !65, size: 32, align: 32, offset: 2368)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !71, file: !61, line: 38, baseType: !65, size: 32, align: 32, offset: 2400)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !71, file: !61, line: 38, baseType: !65, size: 32, align: 32, offset: 2432)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !60, file: !64, line: 9, baseType: !312, size: 64, align: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !313, line: 75, baseType: !314)
!313 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !315, line: 139, baseType: !152)
!315 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!316 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !60, file: !64, line: 10, baseType: !312, size: 64, align: 64, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !60, file: !64, line: 12, baseType: !78, size: 64, align: 64, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !60, file: !64, line: 13, baseType: !78, size: 64, align: 64, offset: 384)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !60, file: !64, line: 15, baseType: !138, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !60, file: !64, line: 16, baseType: !138, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !60, file: !64, line: 17, baseType: !138, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !60, file: !64, line: 18, baseType: !138, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !60, file: !64, line: 19, baseType: !138, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !60, file: !64, line: 21, baseType: !325, size: 64, align: 64, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !92, line: 102, baseType: !327)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !92, line: 102, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !60, file: !64, line: 22, baseType: !65, size: 32, align: 32, offset: 576)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !60, file: !64, line: 25, baseType: !330, size: 128, align: 64, offset: 640)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 128, align: 64, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 2)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !60, file: !64, line: 26, baseType: !65, size: 32, align: 32, offset: 768)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !60, file: !64, line: 27, baseType: !65, size: 32, align: 32, offset: 800)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !60, file: !64, line: 29, baseType: !336, size: 64, align: 64, offset: 832)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !92, line: 103, baseType: !338)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !92, line: 103, flags: DIFlagFwdDecl)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !60, file: !64, line: 30, baseType: !340, size: 64, align: 64, offset: 896)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !342, line: 37, baseType: !343)
!342 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !342, line: 37, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !60, file: !64, line: 32, baseType: !78, size: 64, align: 64, offset: 960)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !60, file: !64, line: 33, baseType: !78, size: 64, align: 64, offset: 1024)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !60, file: !64, line: 34, baseType: !78, size: 64, align: 64, offset: 1088)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !60, file: !64, line: 35, baseType: !138, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !60, file: !64, line: 36, baseType: !138, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !60, file: !64, line: 37, baseType: !138, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !60, file: !64, line: 38, baseType: !138, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !60, file: !64, line: 40, baseType: !352, size: 128, align: 64, offset: 1216)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !53, line: 504, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !53, line: 506, size: 128, align: 64, elements: !354)
!354 = !{!355, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !353, file: !53, line: 508, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !53, line: 48, baseType: !152)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !353, file: !53, line: 509, baseType: !356, size: 64, align: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !60, file: !64, line: 41, baseType: !312, size: 64, align: 64, offset: 1344)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !60, file: !64, line: 42, baseType: !65, size: 32, align: 32, offset: 1408)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !60, file: !64, line: 44, baseType: !228, size: 64, align: 64, offset: 1472)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !60, file: !64, line: 45, baseType: !228, size: 64, align: 64, offset: 1536)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !60, file: !64, line: 53, baseType: !363, size: 64, align: 64, offset: 1600)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !366, !55, !65}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !92, line: 107, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !369, line: 30, size: 2240, align: 64, elements: !370)
!369 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!370 = !{!371, !372, !373, !374, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !450, !454, !458, !462, !467, !546, !553, !557}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !368, file: !64, line: 3, baseType: !65, size: 32, align: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !368, file: !64, line: 4, baseType: !65, size: 32, align: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !368, file: !64, line: 6, baseType: !65, size: 32, align: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !368, file: !64, line: 8, baseType: !375, size: 64, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !92, line: 113, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !369, line: 25, size: 1920, align: 64, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !377, file: !74, line: 3, baseType: !65, size: 32, align: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !377, file: !74, line: 4, baseType: !65, size: 32, align: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !377, file: !74, line: 6, baseType: !65, size: 32, align: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !377, file: !74, line: 9, baseType: !78, size: 64, align: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !377, file: !74, line: 10, baseType: !65, size: 32, align: 32, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !377, file: !74, line: 11, baseType: !78, size: 64, align: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !377, file: !74, line: 11, baseType: !78, size: 64, align: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !377, file: !74, line: 11, baseType: !78, size: 64, align: 64, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !377, file: !74, line: 13, baseType: !84, size: 16, align: 16, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !377, file: !74, line: 14, baseType: !78, size: 64, align: 64, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !377, file: !74, line: 15, baseType: !78, size: 64, align: 64, offset: 576)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !377, file: !74, line: 16, baseType: !65, size: 32, align: 32, offset: 640)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !377, file: !74, line: 17, baseType: !78, size: 64, align: 64, offset: 704)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !377, file: !74, line: 19, baseType: !90, size: 64, align: 64, offset: 768)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !377, file: !74, line: 19, baseType: !90, size: 64, align: 64, offset: 832)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !377, file: !74, line: 21, baseType: !78, size: 64, align: 64, offset: 896)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !377, file: !74, line: 22, baseType: !78, size: 64, align: 64, offset: 960)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !377, file: !74, line: 23, baseType: !78, size: 64, align: 64, offset: 1024)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !377, file: !74, line: 24, baseType: !78, size: 64, align: 64, offset: 1088)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !377, file: !74, line: 26, baseType: !78, size: 64, align: 64, offset: 1152)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !377, file: !74, line: 27, baseType: !78, size: 64, align: 64, offset: 1216)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !377, file: !74, line: 28, baseType: !78, size: 64, align: 64, offset: 1280)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !377, file: !74, line: 29, baseType: !78, size: 64, align: 64, offset: 1344)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !377, file: !74, line: 30, baseType: !78, size: 64, align: 64, offset: 1408)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !377, file: !74, line: 31, baseType: !78, size: 64, align: 64, offset: 1472)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !377, file: !74, line: 32, baseType: !78, size: 64, align: 64, offset: 1536)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !377, file: !74, line: 33, baseType: !78, size: 64, align: 64, offset: 1600)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !377, file: !74, line: 35, baseType: !108, size: 64, align: 64, offset: 1664)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !377, file: !74, line: 38, baseType: !138, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !377, file: !74, line: 39, baseType: !138, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !377, file: !74, line: 40, baseType: !138, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !377, file: !74, line: 41, baseType: !138, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !377, file: !74, line: 42, baseType: !138, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !377, file: !74, line: 43, baseType: !138, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !377, file: !74, line: 44, baseType: !138, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !377, file: !74, line: 45, baseType: !138, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !377, file: !74, line: 46, baseType: !78, size: 64, align: 64, offset: 1792)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !377, file: !74, line: 47, baseType: !78, size: 64, align: 64, offset: 1856)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !368, file: !64, line: 9, baseType: !312, size: 64, align: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !368, file: !64, line: 10, baseType: !312, size: 64, align: 64, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !368, file: !64, line: 12, baseType: !78, size: 64, align: 64, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !368, file: !64, line: 13, baseType: !78, size: 64, align: 64, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !368, file: !64, line: 15, baseType: !138, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !368, file: !64, line: 16, baseType: !138, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !368, file: !64, line: 17, baseType: !138, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !368, file: !64, line: 18, baseType: !138, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !368, file: !64, line: 19, baseType: !138, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !368, file: !64, line: 21, baseType: !325, size: 64, align: 64, offset: 512)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !368, file: !64, line: 22, baseType: !65, size: 32, align: 32, offset: 576)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !368, file: !64, line: 25, baseType: !330, size: 128, align: 64, offset: 640)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !368, file: !64, line: 26, baseType: !65, size: 32, align: 32, offset: 768)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !368, file: !64, line: 27, baseType: !65, size: 32, align: 32, offset: 800)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !368, file: !64, line: 29, baseType: !336, size: 64, align: 64, offset: 832)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !368, file: !64, line: 30, baseType: !340, size: 64, align: 64, offset: 896)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !368, file: !64, line: 32, baseType: !78, size: 64, align: 64, offset: 960)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !368, file: !64, line: 33, baseType: !78, size: 64, align: 64, offset: 1024)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !368, file: !64, line: 34, baseType: !78, size: 64, align: 64, offset: 1088)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !368, file: !64, line: 35, baseType: !138, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !368, file: !64, line: 36, baseType: !138, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !368, file: !64, line: 37, baseType: !138, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !368, file: !64, line: 38, baseType: !138, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !368, file: !64, line: 40, baseType: !352, size: 128, align: 64, offset: 1216)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !368, file: !64, line: 41, baseType: !312, size: 64, align: 64, offset: 1344)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !368, file: !64, line: 42, baseType: !65, size: 32, align: 32, offset: 1408)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !368, file: !64, line: 44, baseType: !228, size: 64, align: 64, offset: 1472)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !368, file: !64, line: 45, baseType: !228, size: 64, align: 64, offset: 1536)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !368, file: !64, line: 53, baseType: !363, size: 64, align: 64, offset: 1600)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !368, file: !64, line: 55, baseType: !447, size: 64, align: 64, offset: 1664)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!65, !366, !54}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !368, file: !64, line: 57, baseType: !451, size: 64, align: 64, offset: 1728)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!65, !366, !55}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !368, file: !64, line: 60, baseType: !455, size: 64, align: 64, offset: 1792)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64, align: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!55, !366}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !368, file: !64, line: 62, baseType: !459, size: 64, align: 64, offset: 1856)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !366, !55, !55, !65}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !368, file: !64, line: 65, baseType: !463, size: 64, align: 64, offset: 1920)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!466, !366, !55, !55}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !368, file: !64, line: 69, baseType: !468, size: 64, align: 64, offset: 1984)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!471, !366, !55}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !92, line: 109, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !474, line: 15, size: 1408, align: 64, elements: !475)
!474 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!475 = !{!476, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !494, !498, !500, !501, !502, !503, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !473, file: !477, line: 3, baseType: !65, size: 32, align: 32)
!477 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!478 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !473, file: !477, line: 4, baseType: !65, size: 32, align: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !473, file: !477, line: 5, baseType: !340, size: 64, align: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !473, file: !477, line: 7, baseType: !50, size: 64, align: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !473, file: !477, line: 8, baseType: !366, size: 64, align: 64, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !473, file: !477, line: 9, baseType: !78, size: 64, align: 64, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !473, file: !477, line: 10, baseType: !78, size: 64, align: 64, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !473, file: !477, line: 11, baseType: !312, size: 64, align: 64, offset: 384)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !473, file: !477, line: 12, baseType: !65, size: 32, align: 32, offset: 448)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !473, file: !477, line: 13, baseType: !78, size: 64, align: 64, offset: 512)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !473, file: !477, line: 15, baseType: !488, size: 64, align: 64, offset: 576)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !92, line: 108, baseType: !493)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !92, line: 108, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !473, file: !477, line: 17, baseType: !495, size: 64, align: 64, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!55, !491}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !473, file: !499, line: 5, baseType: !78, size: 64, align: 64, offset: 704)
!499 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!500 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !473, file: !499, line: 6, baseType: !78, size: 64, align: 64, offset: 768)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !473, file: !499, line: 7, baseType: !312, size: 64, align: 64, offset: 832)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !473, file: !499, line: 9, baseType: !340, size: 64, align: 64, offset: 896)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !473, file: !499, line: 10, baseType: !504, size: 64, align: 64, offset: 960)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !92, line: 111, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !507, line: 13, size: 576, align: 64, elements: !508)
!507 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!508 = !{!509, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !527, !528}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !506, file: !510, line: 3, baseType: !65, size: 32, align: 32)
!510 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!511 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !506, file: !510, line: 4, baseType: !65, size: 32, align: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !506, file: !510, line: 6, baseType: !312, size: 64, align: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !506, file: !510, line: 8, baseType: !78, size: 64, align: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !506, file: !510, line: 9, baseType: !78, size: 64, align: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !506, file: !510, line: 10, baseType: !78, size: 64, align: 64, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !506, file: !510, line: 11, baseType: !65, size: 32, align: 32, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !506, file: !510, line: 14, baseType: !138, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !506, file: !510, line: 15, baseType: !138, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !506, file: !510, line: 18, baseType: !138, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !506, file: !510, line: 19, baseType: !138, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !506, file: !510, line: 20, baseType: !138, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !506, file: !510, line: 21, baseType: !138, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !506, file: !510, line: 22, baseType: !524, size: 64, align: 8, offset: 360)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 64, align: 8, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 8)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !506, file: !510, line: 26, baseType: !50, size: 64, align: 64, offset: 448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !506, file: !510, line: 28, baseType: !504, size: 64, align: 64, offset: 512)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !473, file: !499, line: 12, baseType: !138, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !473, file: !499, line: 13, baseType: !78, size: 64, align: 64, offset: 1088)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !473, file: !499, line: 14, baseType: !65, size: 32, align: 32, offset: 1152)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !473, file: !499, line: 15, baseType: !78, size: 64, align: 64, offset: 1216)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !473, file: !499, line: 17, baseType: !138, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !473, file: !499, line: 18, baseType: !138, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !473, file: !499, line: 19, baseType: !138, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !473, file: !499, line: 20, baseType: !138, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !473, file: !499, line: 22, baseType: !138, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !473, file: !499, line: 23, baseType: !138, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !473, file: !499, line: 24, baseType: !138, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !473, file: !499, line: 25, baseType: !138, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !473, file: !499, line: 26, baseType: !138, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !473, file: !499, line: 31, baseType: !543, size: 64, align: 64, offset: 1344)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!78, !471}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !368, file: !64, line: 70, baseType: !547, size: 64, align: 64, offset: 2048)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64, align: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!550, !366, !55}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !92, line: 110, baseType: !552)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !92, line: 110, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !368, file: !64, line: 71, baseType: !554, size: 64, align: 64, offset: 2112)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!65, !55, !55}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !368, file: !64, line: 73, baseType: !554, size: 64, align: 64, offset: 2176)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !60, file: !64, line: 55, baseType: !447, size: 64, align: 64, offset: 1664)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !60, file: !64, line: 57, baseType: !451, size: 64, align: 64, offset: 1728)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !60, file: !64, line: 60, baseType: !455, size: 64, align: 64, offset: 1792)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !60, file: !64, line: 62, baseType: !459, size: 64, align: 64, offset: 1856)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !60, file: !64, line: 65, baseType: !463, size: 64, align: 64, offset: 1920)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !60, file: !64, line: 69, baseType: !468, size: 64, align: 64, offset: 1984)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !60, file: !64, line: 70, baseType: !547, size: 64, align: 64, offset: 2048)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !60, file: !64, line: 71, baseType: !554, size: 64, align: 64, offset: 2112)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !60, file: !64, line: 73, baseType: !554, size: 64, align: 64, offset: 2176)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !60, file: !61, line: 46, baseType: !228, size: 64, align: 64, offset: 2240)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !60, file: !61, line: 47, baseType: !228, size: 64, align: 64, offset: 2304)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !60, file: !61, line: 48, baseType: !570, size: 64, align: 64, offset: 2368)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !59, line: 8, baseType: !572)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !59, line: 8, flags: DIFlagFwdDecl)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !60, file: !61, line: 49, baseType: !228, size: 64, align: 64, offset: 2432)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !60, file: !61, line: 51, baseType: !78, size: 64, align: 64, offset: 2496)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !60, file: !61, line: 53, baseType: !78, size: 64, align: 64, offset: 2560)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !60, file: !61, line: 54, baseType: !78, size: 64, align: 64, offset: 2624)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !60, file: !61, line: 55, baseType: !78, size: 64, align: 64, offset: 2688)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !60, file: !61, line: 56, baseType: !78, size: 64, align: 64, offset: 2752)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !60, file: !61, line: 57, baseType: !65, size: 32, align: 32, offset: 2816)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !60, file: !61, line: 59, baseType: !138, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !60, file: !61, line: 60, baseType: !138, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !60, file: !61, line: 62, baseType: !138, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !60, file: !61, line: 63, baseType: !138, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !60, file: !61, line: 64, baseType: !138, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !60, file: !61, line: 65, baseType: !138, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !60, file: !61, line: 66, baseType: !138, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !60, file: !61, line: 67, baseType: !138, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !60, file: !61, line: 68, baseType: !138, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !60, file: !61, line: 69, baseType: !138, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !60, file: !61, line: 70, baseType: !138, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !60, file: !61, line: 71, baseType: !138, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !60, file: !61, line: 72, baseType: !138, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !60, file: !61, line: 74, baseType: !65, size: 32, align: 32, offset: 2880)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !60, file: !61, line: 75, baseType: !65, size: 32, align: 32, offset: 2912)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !60, file: !61, line: 76, baseType: !65, size: 32, align: 32, offset: 2944)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !60, file: !61, line: 77, baseType: !65, size: 32, align: 32, offset: 2976)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !60, file: !61, line: 79, baseType: !340, size: 64, align: 64, offset: 3008)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !60, file: !61, line: 80, baseType: !228, size: 64, align: 64, offset: 3072)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !60, file: !61, line: 81, baseType: !228, size: 64, align: 64, offset: 3136)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !60, file: !61, line: 83, baseType: !267, size: 64, align: 64, offset: 3200)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !60, file: !61, line: 84, baseType: !219, size: 32, align: 32, offset: 3264)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !60, file: !61, line: 87, baseType: !65, size: 32, align: 32, offset: 3296)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !60, file: !61, line: 91, baseType: !228, size: 64, align: 64, offset: 3328)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !60, file: !61, line: 92, baseType: !352, size: 128, align: 64, offset: 3392)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !60, file: !61, line: 93, baseType: !352, size: 128, align: 64, offset: 3520)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !60, file: !61, line: 95, baseType: !65, size: 32, align: 32, offset: 3648)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !60, file: !61, line: 96, baseType: !65, size: 32, align: 32, offset: 3680)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !60, file: !61, line: 97, baseType: !65, size: 32, align: 32, offset: 3712)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !60, file: !61, line: 100, baseType: !228, size: 64, align: 64, offset: 3776)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !60, file: !61, line: 103, baseType: !228, size: 64, align: 64, offset: 3840)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !60, file: !61, line: 106, baseType: !228, size: 64, align: 64, offset: 3904)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !60, file: !61, line: 108, baseType: !340, size: 64, align: 64, offset: 3968)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !60, file: !61, line: 109, baseType: !228, size: 64, align: 64, offset: 4032)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !60, file: !61, line: 111, baseType: !228, size: 64, align: 64, offset: 4096)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !60, file: !61, line: 114, baseType: !50, size: 64, align: 64, offset: 4160)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !60, file: !61, line: 116, baseType: !340, size: 64, align: 64, offset: 4224)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !60, file: !61, line: 117, baseType: !618, size: 32768, align: 64, offset: 4288)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 32768, align: 64, elements: !668)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !620, line: 10, size: 128, align: 64, elements: !621)
!620 = !DIFile(filename: "modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!621 = !{!622, !667}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !619, file: !620, line: 11, baseType: !623, size: 64, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !620, line: 7, baseType: !625)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !627, !55, !54, !54, !78, !267}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !59, line: 7, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !630, line: 15, size: 1600, align: 64, elements: !631)
!630 = !DIFile(filename: "irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !629, file: !477, line: 3, baseType: !65, size: 32, align: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !629, file: !477, line: 4, baseType: !65, size: 32, align: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !629, file: !477, line: 5, baseType: !340, size: 64, align: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !629, file: !477, line: 7, baseType: !50, size: 64, align: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !629, file: !477, line: 8, baseType: !57, size: 64, align: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !629, file: !477, line: 9, baseType: !78, size: 64, align: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !629, file: !477, line: 10, baseType: !78, size: 64, align: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !629, file: !477, line: 11, baseType: !312, size: 64, align: 64, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !629, file: !477, line: 12, baseType: !65, size: 32, align: 32, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !629, file: !477, line: 13, baseType: !78, size: 64, align: 64, offset: 512)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !629, file: !477, line: 15, baseType: !488, size: 64, align: 64, offset: 576)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !629, file: !477, line: 17, baseType: !495, size: 64, align: 64, offset: 640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !629, file: !499, line: 5, baseType: !78, size: 64, align: 64, offset: 704)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !629, file: !499, line: 6, baseType: !78, size: 64, align: 64, offset: 768)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !629, file: !499, line: 7, baseType: !312, size: 64, align: 64, offset: 832)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !629, file: !499, line: 9, baseType: !340, size: 64, align: 64, offset: 896)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !629, file: !499, line: 10, baseType: !504, size: 64, align: 64, offset: 960)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !629, file: !499, line: 12, baseType: !138, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !629, file: !499, line: 13, baseType: !78, size: 64, align: 64, offset: 1088)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !629, file: !499, line: 14, baseType: !65, size: 32, align: 32, offset: 1152)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !629, file: !499, line: 15, baseType: !78, size: 64, align: 64, offset: 1216)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !629, file: !499, line: 17, baseType: !138, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !629, file: !499, line: 18, baseType: !138, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !629, file: !499, line: 19, baseType: !138, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !629, file: !499, line: 20, baseType: !138, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !629, file: !499, line: 22, baseType: !138, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !629, file: !499, line: 23, baseType: !138, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !629, file: !499, line: 24, baseType: !138, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !629, file: !499, line: 25, baseType: !138, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !629, file: !499, line: 26, baseType: !138, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !629, file: !499, line: 31, baseType: !543, size: 64, align: 64, offset: 1344)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !629, file: !630, line: 18, baseType: !228, size: 64, align: 64, offset: 1408)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !629, file: !630, line: 20, baseType: !312, size: 64, align: 64, offset: 1472)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !629, file: !630, line: 21, baseType: !65, size: 32, align: 32, offset: 1536)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !629, file: !630, line: 22, baseType: !65, size: 32, align: 32, offset: 1568)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !619, file: !620, line: 12, baseType: !54, size: 8, align: 8, offset: 64)
!668 = !{!669}
!669 = !DISubrange(count: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !60, file: !61, line: 118, baseType: !671, size: 2048, align: 8, offset: 37056)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 2048, align: 8, elements: !668)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !60, file: !61, line: 120, baseType: !554, size: 64, align: 64, offset: 39104)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_QUERY_REC", file: !36, line: 68, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 63, size: 320, align: 64, elements: !676)
!676 = !{!677, !678, !679}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "current_query_type", scope: !675, file: !36, line: 64, baseType: !65, size: 32, align: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "current_queries", scope: !675, file: !36, line: 65, baseType: !228, size: 64, align: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !675, file: !36, line: 67, baseType: !680, size: 192, align: 64, offset: 128)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 192, align: 64, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 3)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !53, line: 88, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !167, !167}
!687 = !{i32 2, !"Dwarf Version", i32 4}
!688 = !{i32 2, !"Debug Info Version", i32 3}
!689 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!690 = distinct !DISubprogram(name: "channels_query_init", scope: !36, file: !36, line: 486, type: !216, isLocal: false, isDefinition: true, scopeLine: 487, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !691)
!691 = !{}
!692 = !DILocation(line: 488, column: 2, scope: !690)
!693 = !DILocation(line: 489, column: 2, scope: !690)
!694 = !DILocation(line: 491, column: 2, scope: !690)
!695 = !DILocation(line: 492, column: 2, scope: !690)
!696 = !DILocation(line: 493, column: 2, scope: !690)
!697 = !DILocation(line: 494, column: 2, scope: !690)
!698 = !DILocation(line: 496, column: 2, scope: !690)
!699 = !DILocation(line: 497, column: 2, scope: !690)
!700 = !DILocation(line: 499, column: 2, scope: !690)
!701 = !DILocation(line: 500, column: 2, scope: !690)
!702 = !DILocation(line: 501, column: 1, scope: !690)
!703 = distinct !DISubprogram(name: "sig_connected", scope: !36, file: !36, line: 70, type: !704, isLocal: true, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !691)
!704 = !DISubroutineType(types: !705)
!705 = !{null, !57}
!706 = !DILocalVariable(name: "server", arg: 1, scope: !703, file: !36, line: 70, type: !57)
!707 = !DIExpression()
!708 = !DILocation(line: 70, column: 43, scope: !703)
!709 = !DILocalVariable(name: "rec", scope: !703, file: !36, line: 72, type: !673)
!710 = !DILocation(line: 72, column: 20, scope: !703)
!711 = !DILocation(line: 74, column: 2, scope: !703)
!712 = distinct !{!712, !711}
!713 = !DILocation(line: 74, column: 10, scope: !714)
!714 = !DILexicalBlockFile(scope: !715, file: !36, discriminator: 1)
!715 = distinct !DILexicalBlock(scope: !716, file: !36, line: 74, column: 10)
!716 = distinct !DILexicalBlock(scope: !703, file: !36, line: 74, column: 4)
!717 = !DILocation(line: 74, column: 17, scope: !714)
!718 = !DILocation(line: 74, column: 5, scope: !719)
!719 = !DILexicalBlockFile(scope: !720, file: !36, discriminator: 2)
!720 = distinct !DILexicalBlock(scope: !715, file: !36, line: 74, column: 3)
!721 = !DILocation(line: 74, column: 14, scope: !722)
!722 = !DILexicalBlockFile(scope: !723, file: !36, discriminator: 3)
!723 = distinct !DILexicalBlock(scope: !715, file: !36, line: 74, column: 12)
!724 = !DILocation(line: 74, column: 101, scope: !722)
!725 = !DILocation(line: 74, column: 112, scope: !726)
!726 = !DILexicalBlockFile(scope: !716, file: !36, discriminator: 4)
!727 = !DILocation(line: 75, column: 87, scope: !728)
!728 = distinct !DILexicalBlock(scope: !703, file: !36, line: 75, column: 6)
!729 = !DILocation(line: 75, column: 69, scope: !728)
!730 = !DILocation(line: 75, column: 54, scope: !728)
!731 = !DILocation(line: 75, column: 53, scope: !728)
!732 = !DILocation(line: 75, column: 28, scope: !733)
!733 = !DILexicalBlockFile(scope: !728, file: !36, discriminator: 3)
!734 = !DILocation(line: 75, column: 9, scope: !728)
!735 = !DILocation(line: 75, column: 6, scope: !703)
!736 = !DILocation(line: 75, column: 8, scope: !737)
!737 = !DILexicalBlockFile(scope: !728, file: !36, discriminator: 1)
!738 = !DILocation(line: 75, column: 6, scope: !739)
!739 = !DILexicalBlockFile(scope: !703, file: !36, discriminator: 2)
!740 = !DILocation(line: 76, column: 3, scope: !728)
!741 = !DILocation(line: 78, column: 30, scope: !703)
