; ModuleID = './line240-fe-server.o.i'
source_filename = "./line240-fe-server.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)* }
%struct._GHashTable = type opaque
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }

!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !416, line: 37, baseType: !417)
!416 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !416, line: 37, flags: DIFlagFwdDecl)
!418 = !DILocation(line: 323, column: 14, scope: !410)
!419 = !DILocalVariable(name: "addr", scope: !410, file: !351, line: 324, type: !420)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!421 = !DILocation(line: 324, column: 8, scope: !410)
!422 = !DILocalVariable(name: "free_arg", scope: !410, file: !351, line: 325, type: !337)
!423 = !DILocation(line: 325, column: 8, scope: !410)
!424 = !DILocation(line: 327, column: 22, scope: !425)
!425 = distinct !DILexicalBlock(scope: !410, file: !351, line: 327, column: 6)
!426 = !DILocation(line: 327, column: 7, scope: !425)
!427 = !DILocation(line: 327, column: 6, scope: !410)
!428 = !DILocation(line: 329, column: 3, scope: !425)
!429 = !DILocation(line: 331, column: 7, scope: !430)
!430 = distinct !DILexicalBlock(scope: !410, file: !351, line: 331, column: 6)
!431 = !DILocation(line: 331, column: 6, scope: !430)
!432 = !DILocation(line: 331, column: 12, scope: !430)
!433 = !DILocation(line: 331, column: 20, scope: !430)
!434 = !DILocation(line: 331, column: 33, scope: !435)
!435 = !DILexicalBlockFile(scope: !430, file: !351, discriminator: 1)
!436 = !DILocation(line: 331, column: 23, scope: !435)
!437 = !DILocation(line: 331, column: 44, scope: !435)
!438 = !DILocation(line: 331, column: 6, scope: !435)
!439 = !DILocation(line: 332, column: 3, scope: !430)
!440 = distinct !{!440, !439}
!441 = !DILocation(line: 332, column: 24, scope: !442)
!442 = !DILexicalBlockFile(scope: !443, file: !351, discriminator: 1)
!443 = distinct !DILexicalBlock(scope: !430, file: !351, line: 332, column: 6)
!444 = !DILocation(line: 332, column: 8, scope: !442)
!445 = !DILocation(line: 332, column: 35, scope: !442)
!446 = distinct !{!446, !447}
!447 = !DILocation(line: 332, column: 35, scope: !443)
!448 = !DILocation(line: 332, column: 40, scope: !449)
!449 = !DILexicalBlockFile(scope: !450, file: !351, discriminator: 2)
!450 = distinct !DILexicalBlock(scope: !443, file: !351, line: 332, column: 38)
!451 = !DILocation(line: 332, column: 122, scope: !452)
!452 = !DILexicalBlockFile(scope: !449, file: !351, discriminator: 5)
!453 = !DILocation(line: 332, column: 137, scope: !449)
!454 = !DILocation(line: 332, column: 158, scope: !455)
!455 = !DILexicalBlockFile(scope: !443, file: !351, discriminator: 3)
!456 = !DILocation(line: 332, column: 158, scope: !457)
!457 = !DILexicalBlockFile(scope: !443, file: !351, discriminator: 4)
!458 = !DILocation(line: 333, column: 7, scope: !459)
!459 = distinct !DILexicalBlock(scope: !410, file: !351, line: 333, column: 6)
!460 = !DILocation(line: 333, column: 6, scope: !459)
!461 = !DILocation(line: 333, column: 12, scope: !459)
!462 = !DILocation(line: 333, column: 6, scope: !410)
!463 = !DILocation(line: 333, column: 20, scope: !464)
!464 = !DILexicalBlockFile(scope: !459, file: !351, discriminator: 1)
!465 = !DILocation(line: 335, column: 18, scope: !410)
!466 = !DILocation(line: 335, column: 2, scope: !410)
!467 = !DILocation(line: 336, column: 1, scope: !410)
!468 = !DILocation(line: 336, column: 1, scope: !469)
!469 = !DILexicalBlockFile(scope: !410, file: !351, discriminator: 1)
!470 = distinct !DISubprogram(name: "cmd_server_add", scope: !351, file: !351, line: 258, type: !376, isLocal: true, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!471 = !DILocalVariable(name: "data", arg: 1, scope: !470, file: !351, line: 258, type: !345)
!472 = !DILocation(line: 258, column: 40, scope: !470)
!473 = !DILocation(line: 260, column: 24, scope: !470)
!474 = !DILocation(line: 260, column: 2, scope: !470)
!475 = !DILocation(line: 261, column: 1, scope: !470)
!476 = distinct !DISubprogram(name: "cmd_server_modify", scope: !351, file: !351, line: 263, type: !376, isLocal: true, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!477 = !DILocalVariable(name: "data", arg: 1, scope: !476, file: !351, line: 263, type: !345)
!478 = !DILocation(line: 263, column: 43, scope: !476)
!479 = !DILocation(line: 265, column: 24, scope: !476)
!480 = !DILocation(line: 265, column: 2, scope: !476)
!481 = !DILocation(line: 266, column: 1, scope: !476)
!482 = distinct !DISubprogram(name: "cmd_server_remove", scope: !351, file: !351, line: 269, type: !376, isLocal: true, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!483 = !DILocalVariable(name: "data", arg: 1, scope: !482, file: !351, line: 269, type: !345)
!484 = !DILocation(line: 269, column: 43, scope: !482)
!485 = !DILocalVariable(name: "rec", scope: !482, file: !351, line: 271, type: !486)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_SETUP_REC", file: !488, line: 114, baseType: !489)
!488 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_SETUP_REC", file: !490, line: 13, size: 1408, align: 64, elements: !491)
!490 = !DIFile(filename: "../../../src/core/servers-setup.h", directory: "/home/lichi/Desktop/irssi/task1")
!491 = !{!492, !495, !496, !497, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !545, !546, !551, !552, !553, !554, !555, !556, !557, !558}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !489, file: !493, line: 1, baseType: !494, size: 32, align: 32)
!493 = !DIFile(filename: "../../../src/core/server-setup-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!494 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !489, file: !493, line: 2, baseType: !494, size: 32, align: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !489, file: !493, line: 4, baseType: !420, size: 64, align: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !489, file: !493, line: 6, baseType: !498, size: 16, align: 16, offset: 128)
!498 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !489, file: !493, line: 7, baseType: !420, size: 64, align: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !489, file: !493, line: 8, baseType: !494, size: 32, align: 32, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !489, file: !493, line: 9, baseType: !420, size: 64, align: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !489, file: !493, line: 11, baseType: !494, size: 32, align: 32, offset: 384)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !489, file: !493, line: 12, baseType: !420, size: 64, align: 64, offset: 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !489, file: !493, line: 14, baseType: !420, size: 64, align: 64, offset: 512)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !489, file: !493, line: 15, baseType: !420, size: 64, align: 64, offset: 576)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !489, file: !493, line: 16, baseType: !420, size: 64, align: 64, offset: 640)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !489, file: !493, line: 17, baseType: !420, size: 64, align: 64, offset: 704)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !489, file: !493, line: 18, baseType: !420, size: 64, align: 64, offset: 768)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !489, file: !493, line: 19, baseType: !420, size: 64, align: 64, offset: 832)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !489, file: !493, line: 20, baseType: !420, size: 64, align: 64, offset: 896)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !489, file: !493, line: 21, baseType: !420, size: 64, align: 64, offset: 960)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "own_host", scope: !489, file: !493, line: 23, baseType: !420, size: 64, align: 64, offset: 1024)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !489, file: !493, line: 24, baseType: !514, size: 64, align: 64, offset: 1088)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !488, line: 99, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !517, line: 22, size: 160, align: 32, elements: !518)
!517 = !DIFile(filename: "../../../src/core/network.h", directory: "/home/lichi/Desktop/irssi/task1")
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !516, file: !517, line: 23, baseType: !498, size: 16, align: 16)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !516, file: !517, line: 24, baseType: !521, size: 128, align: 32, offset: 32)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !522, line: 211, size: 128, align: 32, elements: !523)
!522 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!523 = !{!524}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !521, file: !522, line: 220, baseType: !525, size: 128, align: 32)
!525 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !521, file: !522, line: 213, size: 128, align: 32, elements: !526)
!526 = !{!527, !534, !539}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !525, file: !522, line: 215, baseType: !528, size: 128, align: 8)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 128, align: 8, elements: !532)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !530, line: 48, baseType: !531)
!530 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!531 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!532 = !{!533}
!533 = !DISubrange(count: 16)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !525, file: !522, line: 217, baseType: !535, size: 128, align: 16)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 128, align: 16, elements: !537)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !530, line: 49, baseType: !498)
!537 = !{!538}
!538 = !DISubrange(count: 8)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !525, file: !522, line: 218, baseType: !540, size: 128, align: 32)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 128, align: 32, elements: !543)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !530, line: 51, baseType: !542)
!542 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!543 = !{!544}
!544 = !DISubrange(count: 4)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !489, file: !493, line: 24, baseType: !514, size: 64, align: 64, offset: 1152)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !489, file: !493, line: 26, baseType: !547, size: 64, align: 64, offset: 1216)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !548, line: 75, baseType: !549)
!548 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !550, line: 139, baseType: !341)
!550 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!551 = !DIDerivedType(tag: DW_TAG_member, name: "autoconnect", scope: !489, file: !493, line: 28, baseType: !542, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "no_proxy", scope: !489, file: !493, line: 29, baseType: !542, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "last_failed", scope: !489, file: !493, line: 30, baseType: !542, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !489, file: !493, line: 31, baseType: !542, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !489, file: !493, line: 32, baseType: !542, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !489, file: !493, line: 33, baseType: !542, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !489, file: !493, line: 34, baseType: !542, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !489, file: !493, line: 36, baseType: !414, size: 64, align: 64, offset: 1344)
!559 = !DILocation(line: 271, column: 20, scope: !482)
!560 = !DILocalVariable(name: "addr", scope: !482, file: !351, line: 272, type: !420)
!561 = !DILocation(line: 272, column: 8, scope: !482)
!562 = !DILocalVariable(name: "port", scope: !482, file: !351, line: 272, type: !420)
!563 = !DILocation(line: 272, column: 15, scope: !482)
!564 = !DILocalVariable(name: "chatnet", scope: !482, file: !351, line: 272, type: !420)
!565 = !DILocation(line: 272, column: 22, scope: !482)
!566 = !DILocalVariable(name: "free_arg", scope: !482, file: !351, line: 273, type: !337)
!567 = !DILocation(line: 273, column: 8, scope: !482)
!568 = !DILocation(line: 275, column: 22, scope: !569)
!569 = distinct !DILexicalBlock(scope: !482, file: !351, line: 275, column: 6)
!570 = !DILocation(line: 275, column: 7, scope: !569)
!571 = !DILocation(line: 275, column: 6, scope: !482)
!572 = !DILocation(line: 276, column: 3, scope: !569)
!573 = !DILocation(line: 277, column: 7, scope: !574)
!574 = distinct !DILexicalBlock(scope: !482, file: !351, line: 277, column: 6)
!575 = !DILocation(line: 277, column: 6, scope: !574)
!576 = !DILocation(line: 277, column: 12, scope: !574)
!577 = !DILocation(line: 277, column: 6, scope: !482)
!578 = !DILocation(line: 277, column: 21, scope: !579)
!579 = !DILexicalBlockFile(scope: !574, file: !351, discriminator: 1)
!580 = distinct !{!580, !581}
!581 = !DILocation(line: 277, column: 21, scope: !574)
!582 = !DILocation(line: 277, column: 42, scope: !583)
!583 = !DILexicalBlockFile(scope: !584, file: !351, discriminator: 2)
!584 = distinct !DILexicalBlock(scope: !574, file: !351, line: 277, column: 24)
!585 = !DILocation(line: 277, column: 26, scope: !583)
!586 = !DILocation(line: 277, column: 53, scope: !583)
!587 = distinct !{!587, !588}
!588 = !DILocation(line: 277, column: 53, scope: !584)
!589 = !DILocation(line: 277, column: 58, scope: !590)
!590 = !DILexicalBlockFile(scope: !591, file: !351, discriminator: 3)
!591 = distinct !DILexicalBlock(scope: !584, file: !351, line: 277, column: 56)
!592 = !DILocation(line: 277, column: 140, scope: !593)
!593 = !DILexicalBlockFile(scope: !590, file: !351, discriminator: 6)
!594 = !DILocation(line: 277, column: 155, scope: !590)
!595 = !DILocation(line: 277, column: 176, scope: !596)
!596 = !DILexicalBlockFile(scope: !584, file: !351, discriminator: 4)
!597 = !DILocation(line: 277, column: 176, scope: !598)
!598 = !DILexicalBlockFile(scope: !584, file: !351, discriminator: 5)
!599 = !DILocation(line: 279, column: 7, scope: !600)
!600 = distinct !DILexicalBlock(scope: !482, file: !351, line: 279, column: 6)
!601 = !DILocation(line: 279, column: 6, scope: !600)
!602 = !DILocation(line: 279, column: 12, scope: !600)
!603 = !DILocation(line: 279, column: 6, scope: !482)
!604 = !DILocation(line: 280, column: 8, scope: !605)
!605 = distinct !DILexicalBlock(scope: !606, file: !351, line: 280, column: 7)
!606 = distinct !DILexicalBlock(scope: !600, file: !351, line: 279, column: 21)
!607 = !DILocation(line: 280, column: 7, scope: !605)
!608 = !DILocation(line: 280, column: 16, scope: !605)
!609 = !DILocation(line: 280, column: 7, scope: !606)
!610 = !DILocation(line: 281, column: 28, scope: !605)
!611 = !DILocation(line: 281, column: 10, scope: !605)
!612 = !DILocation(line: 281, column: 8, scope: !605)
!613 = !DILocation(line: 281, column: 4, scope: !605)
!614 = !DILocation(line: 283, column: 28, scope: !605)
!615 = !DILocation(line: 283, column: 38, scope: !605)
!616 = !DILocation(line: 283, column: 10, scope: !605)
!617 = !DILocation(line: 283, column: 8, scope: !605)
!618 = !DILocation(line: 284, column: 2, scope: !606)
!619 = !DILocation(line: 287, column: 8, scope: !620)
!620 = distinct !DILexicalBlock(scope: !621, file: !351, line: 287, column: 7)
!621 = distinct !DILexicalBlock(scope: !600, file: !351, line: 286, column: 2)
!622 = !DILocation(line: 287, column: 7, scope: !620)
!623 = !DILocation(line: 287, column: 16, scope: !620)
!624 = !DILocation(line: 287, column: 7, scope: !621)
!625 = !DILocation(line: 288, column: 28, scope: !620)
!626 = !DILocation(line: 288, column: 39, scope: !620)
!627 = !DILocation(line: 288, column: 34, scope: !620)
!628 = !DILocation(line: 288, column: 10, scope: !629)
!629 = !DILexicalBlockFile(scope: !620, file: !351, discriminator: 1)
!630 = !DILocation(line: 288, column: 8, scope: !620)
!631 = !DILocation(line: 288, column: 4, scope: !620)
!632 = !DILocation(line: 290, column: 28, scope: !620)
!633 = !DILocation(line: 290, column: 39, scope: !620)
!634 = !DILocation(line: 290, column: 34, scope: !620)
!635 = !DILocation(line: 290, column: 46, scope: !620)
!636 = !DILocation(line: 290, column: 10, scope: !629)
!637 = !DILocation(line: 290, column: 8, scope: !620)
!638 = !DILocation(line: 293, column: 6, scope: !639)
!639 = distinct !DILexicalBlock(scope: !482, file: !351, line: 293, column: 6)
!640 = !DILocation(line: 293, column: 10, scope: !639)
!641 = !DILocation(line: 293, column: 6, scope: !482)
!642 = !DILocation(line: 294, column: 54, scope: !639)
!643 = !DILocation(line: 294, column: 60, scope: !639)
!644 = !DILocation(line: 294, column: 3, scope: !639)
!645 = !DILocation(line: 296, column: 23, scope: !646)
!646 = distinct !DILexicalBlock(scope: !639, file: !351, line: 295, column: 7)
!647 = !DILocation(line: 296, column: 3, scope: !646)
!648 = !DILocation(line: 297, column: 52, scope: !646)
!649 = !DILocation(line: 297, column: 58, scope: !646)
!650 = !DILocation(line: 297, column: 3, scope: !646)
!651 = !DILocation(line: 300, column: 18, scope: !482)
!652 = !DILocation(line: 300, column: 2, scope: !482)
!653 = !DILocation(line: 301, column: 1, scope: !482)
!654 = !DILocation(line: 301, column: 1, scope: !655)
!655 = !DILexicalBlockFile(scope: !482, file: !351, discriminator: 1)
!656 = distinct !DISubprogram(name: "server_command", scope: !351, file: !351, line: 338, type: !657, isLocal: true, isDefinition: true, scopeLine: 340, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !345, !659, !974}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !488, line: 107, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !662, line: 30, size: 2240, align: 64, elements: !663)
!662 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!663 = !{!664, !666, !667, !668, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !901, !902, !906, !907, !908, !912, !913, !914, !915, !916, !917, !918, !919, !920, !926, !927, !928, !929, !930, !934, !938, !942, !946, !950, !955, !962, !969, !973}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !661, file: !665, line: 3, baseType: !494, size: 32, align: 32)
!665 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!666 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !661, file: !665, line: 4, baseType: !494, size: 32, align: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !661, file: !665, line: 6, baseType: !494, size: 32, align: 32, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !661, file: !665, line: 8, baseType: !669, size: 64, align: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !488, line: 113, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !662, line: 25, size: 1920, align: 64, elements: !672)
!672 = !{!673, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !671, file: !674, line: 3, baseType: !494, size: 32, align: 32)
!674 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!675 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !671, file: !674, line: 4, baseType: !494, size: 32, align: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !671, file: !674, line: 6, baseType: !494, size: 32, align: 32, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !671, file: !674, line: 9, baseType: !420, size: 64, align: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !671, file: !674, line: 10, baseType: !494, size: 32, align: 32, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !671, file: !674, line: 11, baseType: !420, size: 64, align: 64, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !671, file: !674, line: 11, baseType: !420, size: 64, align: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !671, file: !674, line: 11, baseType: !420, size: 64, align: 64, offset: 384)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !671, file: !674, line: 13, baseType: !498, size: 16, align: 16, offset: 448)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !671, file: !674, line: 14, baseType: !420, size: 64, align: 64, offset: 512)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !671, file: !674, line: 15, baseType: !420, size: 64, align: 64, offset: 576)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !671, file: !674, line: 16, baseType: !494, size: 32, align: 32, offset: 640)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !671, file: !674, line: 17, baseType: !420, size: 64, align: 64, offset: 704)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !671, file: !674, line: 19, baseType: !514, size: 64, align: 64, offset: 768)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !671, file: !674, line: 19, baseType: !514, size: 64, align: 64, offset: 832)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !671, file: !674, line: 21, baseType: !420, size: 64, align: 64, offset: 896)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !671, file: !674, line: 22, baseType: !420, size: 64, align: 64, offset: 960)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !671, file: !674, line: 23, baseType: !420, size: 64, align: 64, offset: 1024)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !671, file: !674, line: 24, baseType: !420, size: 64, align: 64, offset: 1088)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !671, file: !674, line: 26, baseType: !420, size: 64, align: 64, offset: 1152)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !671, file: !674, line: 27, baseType: !420, size: 64, align: 64, offset: 1216)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !671, file: !674, line: 28, baseType: !420, size: 64, align: 64, offset: 1280)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !671, file: !674, line: 29, baseType: !420, size: 64, align: 64, offset: 1344)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !671, file: !674, line: 30, baseType: !420, size: 64, align: 64, offset: 1408)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !671, file: !674, line: 31, baseType: !420, size: 64, align: 64, offset: 1472)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !671, file: !674, line: 32, baseType: !420, size: 64, align: 64, offset: 1536)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !671, file: !674, line: 33, baseType: !420, size: 64, align: 64, offset: 1600)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !671, file: !674, line: 35, baseType: !702, size: 64, align: 64, offset: 1664)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !277, line: 41, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !277, line: 97, size: 896, align: 64, elements: !705)
!705 = !{!706, !708, !845, !846, !851, !852, !853, !854, !855, !864, !865, !866, !870, !871, !872, !873, !874, !875, !876, !877}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !704, file: !277, line: 100, baseType: !707, size: 32, align: 32)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !339, line: 49, baseType: !494)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !704, file: !277, line: 101, baseType: !709, size: 64, align: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !277, line: 42, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !277, line: 131, size: 512, align: 64, elements: !712)
!712 = !{!713, !734, !740, !746, !750, !832, !836, !841}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !711, file: !277, line: 133, baseType: !714, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64, align: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!717, !702, !342, !718, !721, !722}
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !277, line: 75, baseType: !276)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !719, line: 66, baseType: !720)
!719 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!720 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !725, line: 42, baseType: !726)
!725 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !725, line: 44, size: 128, align: 64, elements: !727)
!727 = !{!728, !732, !733}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !726, file: !725, line: 46, baseType: !729, size: 32, align: 32)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !730, line: 36, baseType: !731)
!730 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !719, line: 45, baseType: !542)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !726, file: !725, line: 47, baseType: !707, size: 32, align: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !726, file: !725, line: 48, baseType: !342, size: 64, align: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !711, file: !277, line: 138, baseType: !735, size: 64, align: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64, align: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!717, !702, !738, !718, !721, !722}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, align: 64)
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !711, file: !277, line: 143, baseType: !741, size: 64, align: 64, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64, align: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!717, !702, !744, !745, !722}
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !719, line: 51, baseType: !341)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !277, line: 82, baseType: !283)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !711, file: !277, line: 147, baseType: !747, size: 64, align: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64, align: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!717, !702, !722}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !711, file: !277, line: 149, baseType: !751, size: 64, align: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64, align: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!754, !702, !831}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64, align: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !289, line: 64, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !289, line: 171, size: 768, align: 64, elements: !757)
!757 = !{!758, !759, !780, !807, !809, !813, !814, !815, !816, !824, !825, !826, !827}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !756, file: !289, line: 174, baseType: !338, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !756, file: !289, line: 175, baseType: !760, size: 64, align: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !289, line: 77, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !289, line: 196, size: 192, align: 64, elements: !763)
!763 = !{!764, !768, !769}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !762, file: !289, line: 198, baseType: !765, size: 64, align: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64, align: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !338}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !762, file: !289, line: 199, baseType: !765, size: 64, align: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !762, file: !289, line: 200, baseType: !770, size: 64, align: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64, align: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{null, !338, !754, !773, !779}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64, align: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !289, line: 155, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64, align: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!778, !338}
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !339, line: 50, baseType: !707)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !756, file: !289, line: 177, baseType: !781, size: 64, align: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64, align: 64)
!782 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !289, line: 130, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !289, line: 214, size: 384, align: 64, elements: !785)
!785 = !{!786, !791, !795, !799, !803, !804}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !784, file: !289, line: 216, baseType: !787, size: 64, align: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64, align: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!778, !754, !790}
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !784, file: !289, line: 218, baseType: !792, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64, align: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!778, !754}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !784, file: !289, line: 219, baseType: !796, size: 64, align: 64, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64, align: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!778, !754, !774, !338}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !784, file: !289, line: 222, baseType: !800, size: 64, align: 64, offset: 192)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64, align: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{null, !754}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !784, file: !289, line: 226, baseType: !774, size: 64, align: 64, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !784, file: !289, line: 227, baseType: !805, size: 64, align: 64, offset: 320)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !289, line: 212, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !756, file: !289, line: 178, baseType: !808, size: 32, align: 32, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !339, line: 55, baseType: !542)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !756, file: !289, line: 180, baseType: !810, size: 64, align: 64, offset: 256)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64, align: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !289, line: 48, baseType: !812)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !289, line: 48, flags: DIFlagFwdDecl)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !756, file: !289, line: 182, baseType: !707, size: 32, align: 32, offset: 320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !756, file: !289, line: 183, baseType: !808, size: 32, align: 32, offset: 352)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !756, file: !289, line: 184, baseType: !808, size: 32, align: 32, offset: 384)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !756, file: !289, line: 186, baseType: !817, size: 64, align: 64, offset: 448)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64, align: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !819, line: 37, baseType: !820)
!819 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !819, line: 39, size: 128, align: 64, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !820, file: !819, line: 41, baseType: !338, size: 64, align: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !820, file: !819, line: 42, baseType: !817, size: 64, align: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !756, file: !289, line: 188, baseType: !754, size: 64, align: 64, offset: 512)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !756, file: !289, line: 189, baseType: !754, size: 64, align: 64, offset: 576)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !756, file: !289, line: 191, baseType: !420, size: 64, align: 64, offset: 640)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !756, file: !289, line: 193, baseType: !828, size: 64, align: 64, offset: 704)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64, align: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !289, line: 65, baseType: !830)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !289, line: 65, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !289, line: 39, baseType: !288)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !711, file: !277, line: 151, baseType: !833, size: 64, align: 64, offset: 320)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64, align: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !702}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !711, file: !277, line: 152, baseType: !837, size: 64, align: 64, offset: 384)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64, align: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!717, !702, !840, !722}
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !277, line: 95, baseType: !297)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !711, file: !277, line: 155, baseType: !842, size: 64, align: 64, offset: 448)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64, align: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!840, !702}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !704, file: !277, line: 103, baseType: !342, size: 64, align: 64, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !704, file: !277, line: 104, baseType: !847, size: 64, align: 64, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !848, line: 77, baseType: !849)
!848 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64, align: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !848, line: 77, flags: DIFlagFwdDecl)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !704, file: !277, line: 105, baseType: !847, size: 64, align: 64, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !704, file: !277, line: 106, baseType: !342, size: 64, align: 64, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !704, file: !277, line: 107, baseType: !808, size: 32, align: 32, offset: 384)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !704, file: !277, line: 109, baseType: !718, size: 64, align: 64, offset: 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !704, file: !277, line: 110, baseType: !856, size: 64, align: 64, offset: 512)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64, align: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !858, line: 39, baseType: !859)
!858 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !858, line: 41, size: 192, align: 64, elements: !860)
!860 = !{!861, !862, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !859, file: !858, line: 43, baseType: !342, size: 64, align: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !859, file: !858, line: 44, baseType: !718, size: 64, align: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !859, file: !858, line: 45, baseType: !718, size: 64, align: 64, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !704, file: !277, line: 111, baseType: !856, size: 64, align: 64, offset: 576)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !704, file: !277, line: 112, baseType: !856, size: 64, align: 64, offset: 640)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !704, file: !277, line: 113, baseType: !867, size: 48, align: 8, offset: 704)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 48, align: 8, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 6)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !704, file: !277, line: 117, baseType: !808, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !704, file: !277, line: 118, baseType: !808, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !704, file: !277, line: 119, baseType: !808, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !704, file: !277, line: 120, baseType: !808, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !704, file: !277, line: 121, baseType: !808, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !704, file: !277, line: 122, baseType: !808, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !704, file: !277, line: 124, baseType: !338, size: 64, align: 64, offset: 768)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !704, file: !277, line: 125, baseType: !338, size: 64, align: 64, offset: 832)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !671, file: !674, line: 38, baseType: !542, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !671, file: !674, line: 39, baseType: !542, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !671, file: !674, line: 40, baseType: !542, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !671, file: !674, line: 41, baseType: !542, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !671, file: !674, line: 42, baseType: !542, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !671, file: !674, line: 43, baseType: !542, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !671, file: !674, line: 44, baseType: !542, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !671, file: !674, line: 45, baseType: !542, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !671, file: !674, line: 46, baseType: !420, size: 64, align: 64, offset: 1792)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !671, file: !674, line: 47, baseType: !420, size: 64, align: 64, offset: 1856)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !661, file: !665, line: 9, baseType: !547, size: 64, align: 64, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !661, file: !665, line: 10, baseType: !547, size: 64, align: 64, offset: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !661, file: !665, line: 12, baseType: !420, size: 64, align: 64, offset: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !661, file: !665, line: 13, baseType: !420, size: 64, align: 64, offset: 384)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !661, file: !665, line: 15, baseType: !542, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !661, file: !665, line: 16, baseType: !542, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !661, file: !665, line: 17, baseType: !542, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !661, file: !665, line: 18, baseType: !542, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !661, file: !665, line: 19, baseType: !542, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !661, file: !665, line: 21, baseType: !898, size: 64, align: 64, offset: 512)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !488, line: 102, baseType: !900)
!900 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !488, line: 102, flags: DIFlagFwdDecl)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !661, file: !665, line: 22, baseType: !494, size: 32, align: 32, offset: 576)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !661, file: !665, line: 25, baseType: !903, size: 128, align: 64, offset: 640)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !702, size: 128, align: 64, elements: !904)
!904 = !{!905}
!905 = !DISubrange(count: 2)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !661, file: !665, line: 26, baseType: !494, size: 32, align: 32, offset: 768)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !661, file: !665, line: 27, baseType: !494, size: 32, align: 32, offset: 800)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !661, file: !665, line: 29, baseType: !909, size: 64, align: 64, offset: 832)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !488, line: 103, baseType: !911)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !488, line: 103, flags: DIFlagFwdDecl)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !661, file: !665, line: 30, baseType: !414, size: 64, align: 64, offset: 896)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !661, file: !665, line: 32, baseType: !420, size: 64, align: 64, offset: 960)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !661, file: !665, line: 33, baseType: !420, size: 64, align: 64, offset: 1024)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !661, file: !665, line: 34, baseType: !420, size: 64, align: 64, offset: 1088)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !661, file: !665, line: 35, baseType: !542, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !661, file: !665, line: 36, baseType: !542, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !661, file: !665, line: 37, baseType: !542, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !661, file: !665, line: 38, baseType: !542, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !661, file: !665, line: 40, baseType: !921, size: 128, align: 64, offset: 1216)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !339, line: 504, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !339, line: 506, size: 128, align: 64, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !922, file: !339, line: 508, baseType: !340, size: 64, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !922, file: !339, line: 509, baseType: !340, size: 64, align: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !661, file: !665, line: 41, baseType: !547, size: 64, align: 64, offset: 1344)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !661, file: !665, line: 42, baseType: !494, size: 32, align: 32, offset: 1408)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !661, file: !665, line: 44, baseType: !817, size: 64, align: 64, offset: 1472)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !661, file: !665, line: 45, baseType: !817, size: 64, align: 64, offset: 1536)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !661, file: !665, line: 53, baseType: !931, size: 64, align: 64, offset: 1600)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{null, !659, !345, !494}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !661, file: !665, line: 55, baseType: !935, size: 64, align: 64, offset: 1664)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!494, !659, !344}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !661, file: !665, line: 57, baseType: !939, size: 64, align: 64, offset: 1728)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!494, !659, !345}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !661, file: !665, line: 60, baseType: !943, size: 64, align: 64, offset: 1792)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!345, !659}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !661, file: !665, line: 62, baseType: !947, size: 64, align: 64, offset: 1856)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{null, !659, !345, !345, !494}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !661, file: !665, line: 65, baseType: !951, size: 64, align: 64, offset: 1920)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!954, !659, !345, !345}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !661, file: !665, line: 69, baseType: !956, size: 64, align: 64, offset: 1984)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{!959, !659, !345}
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !488, line: 109, baseType: !961)
!961 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !488, line: 109, flags: DIFlagFwdDecl)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !661, file: !665, line: 70, baseType: !963, size: 64, align: 64, offset: 2048)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!966, !659, !345}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !488, line: 110, baseType: !968)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !488, line: 110, flags: DIFlagFwdDecl)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !661, file: !665, line: 71, baseType: !970, size: 64, align: 64, offset: 2112)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!494, !345, !345}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !661, file: !665, line: 73, baseType: !970, size: 64, align: 64, offset: 2176)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !488, line: 108, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !977, line: 5, size: 704, align: 64, elements: !978)
!977 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!978 = !{!979, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !994}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !976, file: !980, line: 3, baseType: !494, size: 32, align: 32)
!980 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!981 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !976, file: !980, line: 4, baseType: !494, size: 32, align: 32, offset: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !976, file: !980, line: 5, baseType: !414, size: 64, align: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !976, file: !980, line: 7, baseType: !337, size: 64, align: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !976, file: !980, line: 8, baseType: !659, size: 64, align: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !976, file: !980, line: 9, baseType: !420, size: 64, align: 64, offset: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !976, file: !980, line: 10, baseType: !420, size: 64, align: 64, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !976, file: !980, line: 11, baseType: !547, size: 64, align: 64, offset: 384)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !976, file: !980, line: 12, baseType: !494, size: 32, align: 32, offset: 448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !976, file: !980, line: 13, baseType: !420, size: 64, align: 64, offset: 512)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !976, file: !980, line: 15, baseType: !991, size: 64, align: 64, offset: 576)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{null, !974}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !976, file: !980, line: 17, baseType: !995, size: 64, align: 64, offset: 640)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!345, !974}
!998 = !DILocalVariable(name: "data", arg: 1, scope: !656, file: !351, line: 338, type: !345)
!999 = !DILocation(line: 338, column: 40, scope: !656)
!1000 = !DILocalVariable(name: "server", arg: 2, scope: !656, file: !351, line: 338, type: !659)
!1001 = !DILocation(line: 338, column: 58, scope: !656)
!1002 = !DILocalVariable(name: "item", arg: 3, scope: !656, file: !351, line: 339, type: !974)
!1003 = !DILocation(line: 339, column: 20, scope: !656)
!1004 = !DILocation(line: 341, column: 6, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !656, file: !351, line: 341, column: 6)
!1006 = !DILocation(line: 341, column: 13, scope: !1005)
!1007 = !DILocation(line: 341, column: 6, scope: !656)
!1008 = !DILocation(line: 343, column: 12, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1005, file: !351, line: 341, column: 21)
!1010 = !DILocation(line: 343, column: 24, scope: !1009)
!1011 = !DILocation(line: 343, column: 10, scope: !1009)
!1012 = !DILocation(line: 344, column: 2, scope: !1009)
!1013 = !DILocation(line: 346, column: 21, scope: !656)
!1014 = !DILocation(line: 346, column: 27, scope: !656)
!1015 = !DILocation(line: 346, column: 35, scope: !656)
!1016 = !DILocation(line: 346, column: 2, scope: !656)
!1017 = !DILocation(line: 347, column: 1, scope: !656)
!1018 = distinct !DISubprogram(name: "sig_server_looking", scope: !351, file: !351, line: 349, type: !1019, isLocal: true, isDefinition: true, scopeLine: 350, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{null, !659}
!1021 = !DILocalVariable(name: "server", arg: 1, scope: !1018, file: !351, line: 349, type: !659)
!1022 = !DILocation(line: 349, column: 44, scope: !1018)
!1023 = !DILocation(line: 351, column: 2, scope: !1018)
!1024 = distinct !{!1024, !1023}
!1025 = !DILocation(line: 351, column: 10, scope: !1026)
!1026 = !DILexicalBlockFile(scope: !1027, file: !351, discriminator: 1)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !351, line: 351, column: 10)
!1028 = distinct !DILexicalBlock(scope: !1018, file: !351, line: 351, column: 4)
!1029 = !DILocation(line: 351, column: 17, scope: !1026)
!1030 = !DILocation(line: 351, column: 5, scope: !1031)
!1031 = !DILexicalBlockFile(scope: !1032, file: !351, discriminator: 2)
!1032 = distinct !DILexicalBlock(scope: !1027, file: !351, line: 351, column: 3)
!1033 = !DILocation(line: 351, column: 14, scope: !1034)
!1034 = !DILexicalBlockFile(scope: !1035, file: !351, discriminator: 3)
!1035 = distinct !DILexicalBlock(scope: !1027, file: !351, line: 351, column: 12)
!1036 = !DILocation(line: 351, column: 101, scope: !1034)
!1037 = !DILocation(line: 351, column: 112, scope: !1038)
!1038 = !DILexicalBlockFile(scope: !1028, file: !351, discriminator: 4)
!1039 = !DILocation(line: 353, column: 39, scope: !1018)
!1040 = !DILocation(line: 353, column: 42, scope: !1018)
!1041 = !DILocation(line: 353, column: 50, scope: !1018)
!1042 = !DILocation(line: 353, column: 59, scope: !1018)
!1043 = !DILocation(line: 353, column: 2, scope: !1018)
!1044 = !DILocation(line: 354, column: 1, scope: !1018)
!1045 = !DILocation(line: 354, column: 1, scope: !1046)
!1046 = !DILexicalBlockFile(scope: !1018, file: !351, discriminator: 1)
!1047 = distinct !DISubprogram(name: "sig_server_connecting", scope: !351, file: !351, line: 356, type: !1048, isLocal: true, isDefinition: true, scopeLine: 357, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{null, !659, !514}
!1050 = !DILocalVariable(name: "server", arg: 1, scope: !1047, file: !351, line: 356, type: !659)
!1051 = !DILocation(line: 356, column: 47, scope: !1047)
!1052 = !DILocalVariable(name: "ip", arg: 2, scope: !1047, file: !351, line: 356, type: !514)
!1053 = !DILocation(line: 356, column: 63, scope: !1047)
!1054 = !DILocalVariable(name: "ipaddr", scope: !1047, file: !351, line: 358, type: !1055)
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 368, align: 8, elements: !1056)
!1056 = !{!1057}
!1057 = !DISubrange(count: 46)
!1058 = !DILocation(line: 358, column: 7, scope: !1047)
!1059 = !DILocation(line: 360, column: 2, scope: !1047)
!1060 = distinct !{!1060, !1059}
!1061 = !DILocation(line: 360, column: 10, scope: !1062)
!1062 = !DILexicalBlockFile(scope: !1063, file: !351, discriminator: 1)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !351, line: 360, column: 10)
!1064 = distinct !DILexicalBlock(scope: !1047, file: !351, line: 360, column: 4)
!1065 = !DILocation(line: 360, column: 17, scope: !1062)
!1066 = !DILocation(line: 360, column: 5, scope: !1067)
!1067 = !DILexicalBlockFile(scope: !1068, file: !351, discriminator: 2)
!1068 = distinct !DILexicalBlock(scope: !1063, file: !351, line: 360, column: 3)
!1069 = !DILocation(line: 360, column: 14, scope: !1070)
!1070 = !DILexicalBlockFile(scope: !1071, file: !351, discriminator: 3)
!1071 = distinct !DILexicalBlock(scope: !1063, file: !351, line: 360, column: 12)
!1072 = !DILocation(line: 360, column: 101, scope: !1070)
!1073 = !DILocation(line: 360, column: 112, scope: !1074)
!1074 = !DILexicalBlockFile(scope: !1064, file: !351, discriminator: 4)
!1075 = !DILocation(line: 362, column: 6, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1047, file: !351, line: 362, column: 6)
!1077 = !DILocation(line: 362, column: 9, scope: !1076)
!1078 = !DILocation(line: 362, column: 6, scope: !1047)
!1079 = !DILocation(line: 363, column: 3, scope: !1076)
!1080 = !DILocation(line: 363, column: 13, scope: !1076)
!1081 = !DILocation(line: 365, column: 15, scope: !1076)
!1082 = !DILocation(line: 365, column: 19, scope: !1076)
!1083 = !DILocation(line: 365, column: 3, scope: !1076)
!1084 = !DILocation(line: 367, column: 39, scope: !1047)
!1085 = !DILocation(line: 367, column: 27, scope: !1047)
!1086 = !DILocation(line: 367, column: 35, scope: !1047)
!1087 = !DILocation(line: 367, column: 44, scope: !1047)
!1088 = !DILocation(line: 367, column: 26, scope: !1047)
!1089 = !DILocation(line: 367, column: 94, scope: !1047)
!1090 = !DILocation(line: 367, column: 102, scope: !1047)
!1091 = !DILocation(line: 367, column: 111, scope: !1047)
!1092 = !DILocation(line: 367, column: 120, scope: !1047)
!1093 = !DILocation(line: 367, column: 128, scope: !1047)
!1094 = !DILocation(line: 367, column: 136, scope: !1047)
!1095 = !DILocation(line: 367, column: 145, scope: !1047)
!1096 = !DILocation(line: 367, column: 2, scope: !1047)
!1097 = !DILocation(line: 371, column: 1, scope: !1047)
!1098 = !DILocation(line: 371, column: 1, scope: !1099)
!1099 = !DILexicalBlockFile(scope: !1047, file: !351, discriminator: 1)
!1100 = distinct !DISubprogram(name: "sig_server_connected", scope: !351, file: !351, line: 373, type: !1019, isLocal: true, isDefinition: true, scopeLine: 374, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!1101 = !DILocalVariable(name: "server", arg: 1, scope: !1100, file: !351, line: 373, type: !659)
!1102 = !DILocation(line: 373, column: 46, scope: !1100)
!1103 = !DILocation(line: 375, column: 2, scope: !1100)
!1104 = distinct !{!1104, !1103}
!1105 = !DILocation(line: 375, column: 10, scope: !1106)
!1106 = !DILexicalBlockFile(scope: !1107, file: !351, discriminator: 1)
!1107 = distinct !DILexicalBlock(scope: !1108, file: !351, line: 375, column: 10)
!1108 = distinct !DILexicalBlock(scope: !1100, file: !351, line: 375, column: 4)
!1109 = !DILocation(line: 375, column: 17, scope: !1106)
!1110 = !DILocation(line: 375, column: 5, scope: !1111)
!1111 = !DILexicalBlockFile(scope: !1112, file: !351, discriminator: 2)
!1112 = distinct !DILexicalBlock(scope: !1107, file: !351, line: 375, column: 3)
!1113 = !DILocation(line: 375, column: 14, scope: !1114)
!1114 = !DILexicalBlockFile(scope: !1115, file: !351, discriminator: 3)
!1115 = distinct !DILexicalBlock(scope: !1107, file: !351, line: 375, column: 12)
!1116 = !DILocation(line: 375, column: 101, scope: !1114)
!1117 = !DILocation(line: 375, column: 112, scope: !1118)
!1118 = !DILexicalBlockFile(scope: !1108, file: !351, discriminator: 4)
!1119 = !DILocation(line: 377, column: 39, scope: !1100)
!1120 = !DILocation(line: 377, column: 54, scope: !1100)
!1121 = !DILocation(line: 377, column: 62, scope: !1100)
!1122 = !DILocation(line: 377, column: 71, scope: !1100)
!1123 = !DILocation(line: 377, column: 2, scope: !1100)
!1124 = !DILocation(line: 379, column: 1, scope: !1100)
!1125 = !DILocation(line: 379, column: 1, scope: !1126)
!1126 = !DILexicalBlockFile(scope: !1100, file: !351, discriminator: 1)
!1127 = distinct !DISubprogram(name: "sig_connect_failed", scope: !351, file: !351, line: 381, type: !1128, isLocal: true, isDefinition: true, scopeLine: 382, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{null, !659, !342}
!1130 = !DILocalVariable(name: "server", arg: 1, scope: !1127, file: !351, line: 381, type: !659)
!1131 = !DILocation(line: 381, column: 44, scope: !1127)
!1132 = !DILocalVariable(name: "msg", arg: 2, scope: !1127, file: !351, line: 381, type: !342)
!1133 = !DILocation(line: 381, column: 59, scope: !1127)
!1134 = !DILocation(line: 383, column: 2, scope: !1127)
!1135 = distinct !{!1135, !1134}
!1136 = !DILocation(line: 383, column: 10, scope: !1137)
!1137 = !DILexicalBlockFile(scope: !1138, file: !351, discriminator: 1)
!1138 = distinct !DILexicalBlock(scope: !1139, file: !351, line: 383, column: 10)
!1139 = distinct !DILexicalBlock(scope: !1127, file: !351, line: 383, column: 4)
!1140 = !DILocation(line: 383, column: 17, scope: !1137)
!1141 = !DILocation(line: 383, column: 5, scope: !1142)
!1142 = !DILexicalBlockFile(scope: !1143, file: !351, discriminator: 2)
!1143 = distinct !DILexicalBlock(scope: !1138, file: !351, line: 383, column: 3)
!1144 = !DILocation(line: 383, column: 14, scope: !1145)
!1145 = !DILexicalBlockFile(scope: !1146, file: !351, discriminator: 3)
!1146 = distinct !DILexicalBlock(scope: !1138, file: !351, line: 383, column: 12)
!1147 = !DILocation(line: 383, column: 101, scope: !1145)
!1148 = !DILocation(line: 383, column: 112, scope: !1149)
!1149 = !DILexicalBlockFile(scope: !1139, file: !351, discriminator: 4)
!1150 = !DILocation(line: 385, column: 6, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1127, file: !351, line: 385, column: 6)
!1152 = !DILocation(line: 385, column: 10, scope: !1151)
!1153 = !DILocation(line: 385, column: 6, scope: !1127)
!1154 = !DILocation(line: 388, column: 40, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1151, file: !351, line: 385, column: 18)
!1156 = !DILocation(line: 388, column: 48, scope: !1155)
!1157 = !DILocation(line: 388, column: 56, scope: !1155)
!1158 = !DILocation(line: 388, column: 65, scope: !1155)
!1159 = !DILocation(line: 388, column: 3, scope: !1155)
!1160 = !DILocation(line: 390, column: 2, scope: !1155)
!1161 = !DILocation(line: 391, column: 40, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1151, file: !351, line: 390, column: 9)
!1163 = !DILocation(line: 391, column: 44, scope: !1162)
!1164 = !DILocation(line: 391, column: 52, scope: !1162)
!1165 = !DILocation(line: 391, column: 61, scope: !1162)
!1166 = !DILocation(line: 391, column: 70, scope: !1162)
!1167 = !DILocation(line: 391, column: 78, scope: !1162)
!1168 = !DILocation(line: 391, column: 87, scope: !1162)
!1169 = !DILocation(line: 391, column: 93, scope: !1162)
!1170 = !DILocation(line: 391, column: 3, scope: !1162)
!1171 = !DILocation(line: 394, column: 1, scope: !1127)
!1172 = distinct !DISubprogram(name: "sig_server_disconnected", scope: !351, file: !351, line: 396, type: !1019, isLocal: true, isDefinition: true, scopeLine: 397, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!1173 = !DILocalVariable(name: "server", arg: 1, scope: !1172, file: !351, line: 396, type: !659)
!1174 = !DILocation(line: 396, column: 49, scope: !1172)
!1175 = !DILocation(line: 398, column: 2, scope: !1172)
!1176 = distinct !{!1176, !1175}
!1177 = !DILocation(line: 398, column: 10, scope: !1178)
!1178 = !DILexicalBlockFile(scope: !1179, file: !351, discriminator: 1)
!1179 = distinct !DILexicalBlock(scope: !1180, file: !351, line: 398, column: 10)
!1180 = distinct !DILexicalBlock(scope: !1172, file: !351, line: 398, column: 4)
!1181 = !DILocation(line: 398, column: 17, scope: !1178)
!1182 = !DILocation(line: 398, column: 5, scope: !1183)
!1183 = !DILexicalBlockFile(scope: !1184, file: !351, discriminator: 2)
!1184 = distinct !DILexicalBlock(scope: !1179, file: !351, line: 398, column: 3)
!1185 = !DILocation(line: 398, column: 14, scope: !1186)
!1186 = !DILexicalBlockFile(scope: !1187, file: !351, discriminator: 3)
!1187 = distinct !DILexicalBlock(scope: !1179, file: !351, line: 398, column: 12)
!1188 = !DILocation(line: 398, column: 101, scope: !1186)
!1189 = !DILocation(line: 398, column: 112, scope: !1190)
!1190 = !DILexicalBlockFile(scope: !1180, file: !351, discriminator: 4)
!1191 = !DILocation(line: 400, column: 39, scope: !1172)
!1192 = !DILocation(line: 400, column: 47, scope: !1172)
!1193 = !DILocation(line: 400, column: 55, scope: !1172)
!1194 = !DILocation(line: 400, column: 64, scope: !1172)
!1195 = !DILocation(line: 400, column: 2, scope: !1172)
!1196 = !DILocation(line: 402, column: 1, scope: !1172)
!1197 = !DILocation(line: 402, column: 1, scope: !1198)
!1198 = !DILexicalBlockFile(scope: !1172, file: !351, discriminator: 1)
!1199 = distinct !DISubprogram(name: "sig_server_quit", scope: !351, file: !351, line: 404, type: !1200, isLocal: true, isDefinition: true, scopeLine: 405, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{null, !659, !345}
!1202 = !DILocalVariable(name: "server", arg: 1, scope: !1199, file: !351, line: 404, type: !659)
!1203 = !DILocation(line: 404, column: 41, scope: !1199)
!1204 = !DILocalVariable(name: "msg", arg: 2, scope: !1199, file: !351, line: 404, type: !345)
!1205 = !DILocation(line: 404, column: 61, scope: !1199)
!1206 = !DILocation(line: 406, column: 2, scope: !1199)
!1207 = distinct !{!1207, !1206}
!1208 = !DILocation(line: 406, column: 10, scope: !1209)
!1209 = !DILexicalBlockFile(scope: !1210, file: !351, discriminator: 1)
!1210 = distinct !DILexicalBlock(scope: !1211, file: !351, line: 406, column: 10)
!1211 = distinct !DILexicalBlock(scope: !1199, file: !351, line: 406, column: 4)
!1212 = !DILocation(line: 406, column: 17, scope: !1209)
!1213 = !DILocation(line: 406, column: 5, scope: !1214)
!1214 = !DILexicalBlockFile(scope: !1215, file: !351, discriminator: 2)
!1215 = distinct !DILexicalBlock(scope: !1210, file: !351, line: 406, column: 3)
!1216 = !DILocation(line: 406, column: 14, scope: !1217)
!1217 = !DILexicalBlockFile(scope: !1218, file: !351, discriminator: 3)
!1218 = distinct !DILexicalBlock(scope: !1210, file: !351, line: 406, column: 12)
!1219 = !DILocation(line: 406, column: 101, scope: !1217)
!1220 = !DILocation(line: 406, column: 112, scope: !1221)
!1221 = !DILexicalBlockFile(scope: !1211, file: !351, discriminator: 4)
!1222 = !DILocation(line: 408, column: 39, scope: !1199)
!1223 = !DILocation(line: 408, column: 43, scope: !1199)
!1224 = !DILocation(line: 408, column: 51, scope: !1199)
!1225 = !DILocation(line: 408, column: 60, scope: !1199)
!1226 = !DILocation(line: 408, column: 69, scope: !1199)
!1227 = !DILocation(line: 408, column: 2, scope: !1199)
!1228 = !DILocation(line: 410, column: 1, scope: !1199)
!1229 = !DILocation(line: 410, column: 1, scope: !1230)
!1230 = !DILexicalBlockFile(scope: !1199, file: !351, discriminator: 1)
!1231 = distinct !DISubprogram(name: "sig_server_lag_disconnected", scope: !351, file: !351, line: 412, type: !1019, isLocal: true, isDefinition: true, scopeLine: 413, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!1232 = !DILocalVariable(name: "server", arg: 1, scope: !1231, file: !351, line: 412, type: !659)
!1233 = !DILocation(line: 412, column: 53, scope: !1231)
!1234 = !DILocation(line: 414, column: 2, scope: !1231)
!1235 = distinct !{!1235, !1234}
!1236 = !DILocation(line: 414, column: 10, scope: !1237)
!1237 = !DILexicalBlockFile(scope: !1238, file: !351, discriminator: 1)
!1238 = distinct !DILexicalBlock(scope: !1239, file: !351, line: 414, column: 10)
!1239 = distinct !DILexicalBlock(scope: !1231, file: !351, line: 414, column: 4)
!1240 = !DILocation(line: 414, column: 17, scope: !1237)
!1241 = !DILocation(line: 414, column: 5, scope: !1242)
!1242 = !DILexicalBlockFile(scope: !1243, file: !351, discriminator: 2)
!1243 = distinct !DILexicalBlock(scope: !1238, file: !351, line: 414, column: 3)
!1244 = !DILocation(line: 414, column: 14, scope: !1245)
!1245 = !DILexicalBlockFile(scope: !1246, file: !351, discriminator: 3)
!1246 = distinct !DILexicalBlock(scope: !1238, file: !351, line: 414, column: 12)
!1247 = !DILocation(line: 414, column: 101, scope: !1245)
!1248 = !DILocation(line: 414, column: 112, scope: !1249)
!1249 = !DILexicalBlockFile(scope: !1239, file: !351, discriminator: 4)
!1250 = !DILocation(line: 416, column: 39, scope: !1231)
!1251 = !DILocation(line: 416, column: 48, scope: !1231)
!1252 = !DILocation(line: 416, column: 56, scope: !1231)
!1253 = !DILocation(line: 416, column: 65, scope: !1231)
!1254 = !DILocation(line: 416, column: 74, scope: !1231)
!1255 = !DILocation(line: 416, column: 3, scope: !1231)
!1256 = !DILocation(line: 416, column: 11, scope: !1231)
!1257 = !DILocation(line: 416, column: 20, scope: !1231)
!1258 = !DILocation(line: 416, column: 2, scope: !1231)
!1259 = !DILocation(line: 416, column: 2, scope: !1260)
!1260 = !DILexicalBlockFile(scope: !1231, file: !351, discriminator: 1)
!1261 = !DILocation(line: 419, column: 1, scope: !1231)
!1262 = !DILocation(line: 419, column: 1, scope: !1260)
!1263 = distinct !DISubprogram(name: "sig_server_reconnect_removed", scope: !351, file: !351, line: 421, type: !1264, isLocal: true, isDefinition: true, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{null, !1266}
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "RECONNECT_REC", file: !1268, line: 13, baseType: !1269)
!1268 = !DIFile(filename: "../../../src/core/servers-reconnect.h", directory: "/home/lichi/Desktop/irssi/task1")
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1268, line: 8, size: 192, align: 64, elements: !1270)
!1270 = !{!1271, !1272, !1273}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1269, file: !1268, line: 9, baseType: !494, size: 32, align: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "next_connect", scope: !1269, file: !1268, line: 10, baseType: !547, size: 64, align: 64, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !1269, file: !1268, line: 12, baseType: !669, size: 64, align: 64, offset: 128)
!1274 = !DILocalVariable(name: "reconnect", arg: 1, scope: !1263, file: !351, line: 421, type: !1266)
!1275 = !DILocation(line: 421, column: 57, scope: !1263)
!1276 = !DILocation(line: 423, column: 2, scope: !1263)
!1277 = distinct !{!1277, !1276}
!1278 = !DILocation(line: 423, column: 10, scope: !1279)
!1279 = !DILexicalBlockFile(scope: !1280, file: !351, discriminator: 1)
!1280 = distinct !DILexicalBlock(scope: !1281, file: !351, line: 423, column: 10)
!1281 = distinct !DILexicalBlock(scope: !1263, file: !351, line: 423, column: 4)
!1282 = !DILocation(line: 423, column: 20, scope: !1279)
!1283 = !DILocation(line: 423, column: 5, scope: !1284)
!1284 = !DILexicalBlockFile(scope: !1285, file: !351, discriminator: 2)
!1285 = distinct !DILexicalBlock(scope: !1280, file: !351, line: 423, column: 3)
!1286 = !DILocation(line: 423, column: 14, scope: !1287)
!1287 = !DILexicalBlockFile(scope: !1288, file: !351, discriminator: 3)
!1288 = distinct !DILexicalBlock(scope: !1280, file: !351, line: 423, column: 12)
!1289 = !DILocation(line: 423, column: 104, scope: !1287)
!1290 = !DILocation(line: 423, column: 115, scope: !1291)
!1291 = !DILexicalBlockFile(scope: !1281, file: !351, discriminator: 4)
!1292 = !DILocation(line: 425, column: 49, scope: !1263)
!1293 = !DILocation(line: 425, column: 60, scope: !1263)
!1294 = !DILocation(line: 425, column: 66, scope: !1263)
!1295 = !DILocation(line: 425, column: 75, scope: !1263)
!1296 = !DILocation(line: 425, column: 86, scope: !1263)
!1297 = !DILocation(line: 425, column: 92, scope: !1263)
!1298 = !DILocation(line: 425, column: 98, scope: !1263)
!1299 = !DILocation(line: 425, column: 109, scope: !1263)
!1300 = !DILocation(line: 425, column: 115, scope: !1263)
!1301 = !DILocation(line: 425, column: 123, scope: !1263)
!1302 = !DILocation(line: 425, column: 98, scope: !1303)
!1303 = !DILexicalBlockFile(scope: !1263, file: !351, discriminator: 1)
!1304 = !DILocation(line: 425, column: 8, scope: !1305)
!1305 = !DILexicalBlockFile(scope: !1263, file: !351, discriminator: 2)
!1306 = !DILocation(line: 425, column: 19, scope: !1305)
!1307 = !DILocation(line: 425, column: 25, scope: !1305)
!1308 = !DILocation(line: 425, column: 98, scope: !1305)
!1309 = !DILocation(line: 425, column: 98, scope: !1310)
!1310 = !DILexicalBlockFile(scope: !1263, file: !351, discriminator: 3)
!1311 = !DILocation(line: 425, column: 2, scope: !1310)
!1312 = !DILocation(line: 428, column: 1, scope: !1263)
!1313 = !DILocation(line: 428, column: 1, scope: !1303)
!1314 = distinct !DISubprogram(name: "sig_server_reconnect_not_found", scope: !351, file: !351, line: 430, type: !376, isLocal: true, isDefinition: true, scopeLine: 431, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!1315 = !DILocalVariable(name: "tag", arg: 1, scope: !1314, file: !351, line: 430, type: !345)
!1316 = !DILocation(line: 430, column: 56, scope: !1314)
!1317 = !DILocation(line: 432, column: 2, scope: !1314)
!1318 = distinct !{!1318, !1317}
!1319 = !DILocation(line: 432, column: 10, scope: !1320)
!1320 = !DILexicalBlockFile(scope: !1321, file: !351, discriminator: 1)
!1321 = distinct !DILexicalBlock(scope: !1322, file: !351, line: 432, column: 10)
!1322 = distinct !DILexicalBlock(scope: !1314, file: !351, line: 432, column: 4)
!1323 = !DILocation(line: 432, column: 14, scope: !1320)
!1324 = !DILocation(line: 432, column: 5, scope: !1325)
!1325 = !DILexicalBlockFile(scope: !1326, file: !351, discriminator: 2)
!1326 = distinct !DILexicalBlock(scope: !1321, file: !351, line: 432, column: 3)
!1327 = !DILocation(line: 432, column: 14, scope: !1328)
!1328 = !DILexicalBlockFile(scope: !1329, file: !351, discriminator: 3)
!1329 = distinct !DILexicalBlock(scope: !1321, file: !351, line: 432, column: 12)
!1330 = !DILocation(line: 432, column: 98, scope: !1328)
!1331 = !DILocation(line: 432, column: 109, scope: !1332)
!1332 = !DILexicalBlockFile(scope: !1322, file: !351, discriminator: 4)
!1333 = !DILocation(line: 434, column: 51, scope: !1314)
!1334 = !DILocation(line: 434, column: 2, scope: !1314)
!1335 = !DILocation(line: 436, column: 1, scope: !1314)
!1336 = !DILocation(line: 436, column: 1, scope: !1337)
!1337 = !DILexicalBlockFile(scope: !1314, file: !351, discriminator: 1)
!1338 = distinct !DISubprogram(name: "sig_chat_protocol_unknown", scope: !351, file: !351, line: 438, type: !376, isLocal: true, isDefinition: true, scopeLine: 439, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!1339 = !DILocalVariable(name: "protocol", arg: 1, scope: !1338, file: !351, line: 438, type: !345)
!1340 = !DILocation(line: 438, column: 51, scope: !1338)
!1341 = !DILocation(line: 440, column: 2, scope: !1338)
!1342 = distinct !{!1342, !1341}
!1343 = !DILocation(line: 440, column: 10, scope: !1344)
!1344 = !DILexicalBlockFile(scope: !1345, file: !351, discriminator: 1)
!1345 = distinct !DILexicalBlock(scope: !1346, file: !351, line: 440, column: 10)
!1346 = distinct !DILexicalBlock(scope: !1338, file: !351, line: 440, column: 4)
!1347 = !DILocation(line: 440, column: 19, scope: !1344)
!1348 = !DILocation(line: 440, column: 5, scope: !1349)
!1349 = !DILexicalBlockFile(scope: !1350, file: !351, discriminator: 2)
!1350 = distinct !DILexicalBlock(scope: !1345, file: !351, line: 440, column: 3)
!1351 = !DILocation(line: 440, column: 14, scope: !1352)
!1352 = !DILexicalBlockFile(scope: !1353, file: !351, discriminator: 3)
!1353 = distinct !DILexicalBlock(scope: !1345, file: !351, line: 440, column: 12)
!1354 = !DILocation(line: 440, column: 103, scope: !1352)
!1355 = !DILocation(line: 440, column: 114, scope: !1356)
!1356 = !DILexicalBlockFile(scope: !1346, file: !351, discriminator: 4)
!1357 = !DILocation(line: 442, column: 52, scope: !1338)
!1358 = !DILocation(line: 442, column: 2, scope: !1338)
!1359 = !DILocation(line: 444, column: 1, scope: !1338)
!1360 = !DILocation(line: 444, column: 1, scope: !1361)
!1361 = !DILexicalBlockFile(scope: !1338, file: !351, discriminator: 1)
!1362 = distinct !DISubprogram(name: "fe_server_deinit", scope: !351, file: !351, line: 473, type: !352, isLocal: false, isDefinition: true, scopeLine: 474, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!1363 = !DILocation(line: 475, column: 2, scope: !1362)
!1364 = !DILocation(line: 476, column: 2, scope: !1362)
!1365 = !DILocation(line: 477, column: 2, scope: !1362)
!1366 = !DILocation(line: 478, column: 2, scope: !1362)
!1367 = !DILocation(line: 479, column: 2, scope: !1362)
!1368 = !DILocation(line: 480, column: 2, scope: !1362)
!1369 = !DILocation(line: 481, column: 2, scope: !1362)
!1370 = !DILocation(line: 483, column: 2, scope: !1362)
!1371 = !DILocation(line: 484, column: 2, scope: !1362)
!1372 = !DILocation(line: 485, column: 2, scope: !1362)
!1373 = !DILocation(line: 486, column: 2, scope: !1362)
!1374 = !DILocation(line: 487, column: 2, scope: !1362)
!1375 = !DILocation(line: 488, column: 2, scope: !1362)
!1376 = !DILocation(line: 490, column: 2, scope: !1362)
!1377 = !DILocation(line: 491, column: 2, scope: !1362)
!1378 = !DILocation(line: 492, column: 2, scope: !1362)
!1379 = !DILocation(line: 494, column: 2, scope: !1362)
!1380 = !DILocation(line: 495, column: 1, scope: !1362)
!1381 = distinct !DISubprogram(name: "print_servers", scope: !351, file: !351, line: 37, type: !352, isLocal: true, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!1382 = !DILocalVariable(name: "tmp", scope: !1381, file: !351, line: 39, type: !817)
!1383 = !DILocation(line: 39, column: 10, scope: !1381)
!1384 = !DILocation(line: 41, column: 13, scope: !1385)
!1385 = distinct !DILexicalBlock(scope: !1381, file: !351, line: 41, column: 2)
!1386 = !DILocation(line: 41, column: 11, scope: !1385)
!1387 = !DILocation(line: 41, column: 7, scope: !1385)
!1388 = !DILocation(line: 41, column: 22, scope: !1389)
!1389 = !DILexicalBlockFile(scope: !1390, file: !351, discriminator: 1)
!1390 = distinct !DILexicalBlock(scope: !1385, file: !351, line: 41, column: 2)
!1391 = !DILocation(line: 41, column: 26, scope: !1389)
!1392 = !DILocation(line: 41, column: 2, scope: !1389)
!1393 = !DILocalVariable(name: "rec", scope: !1394, file: !351, line: 42, type: !659)
!1394 = distinct !DILexicalBlock(scope: !1390, file: !351, line: 41, column: 51)
!1395 = !DILocation(line: 42, column: 15, scope: !1394)
!1396 = !DILocation(line: 42, column: 21, scope: !1394)
!1397 = !DILocation(line: 42, column: 26, scope: !1394)
!1398 = !DILocation(line: 44, column: 36, scope: !1394)
!1399 = !DILocation(line: 44, column: 41, scope: !1394)
!1400 = !DILocation(line: 44, column: 46, scope: !1394)
!1401 = !DILocation(line: 44, column: 51, scope: !1394)
!1402 = !DILocation(line: 44, column: 60, scope: !1394)
!1403 = !DILocation(line: 44, column: 69, scope: !1394)
!1404 = !DILocation(line: 44, column: 74, scope: !1394)
!1405 = !DILocation(line: 44, column: 83, scope: !1394)
!1406 = !DILocation(line: 44, column: 89, scope: !1394)
!1407 = !DILocation(line: 44, column: 94, scope: !1394)
!1408 = !DILocation(line: 44, column: 103, scope: !1394)
!1409 = !DILocation(line: 44, column: 111, scope: !1394)
!1410 = !DILocation(line: 44, column: 89, scope: !1411)
!1411 = !DILexicalBlockFile(scope: !1394, file: !351, discriminator: 1)
!1412 = !DILocation(line: 44, column: 9, scope: !1413)
!1413 = !DILexicalBlockFile(scope: !1394, file: !351, discriminator: 2)
!1414 = !DILocation(line: 44, column: 14, scope: !1413)
!1415 = !DILocation(line: 44, column: 23, scope: !1413)
!1416 = !DILocation(line: 44, column: 89, scope: !1413)
!1417 = !DILocation(line: 44, column: 89, scope: !1418)
!1418 = !DILexicalBlockFile(scope: !1394, file: !351, discriminator: 3)
!1419 = !DILocation(line: 44, column: 32, scope: !1418)
!1420 = !DILocation(line: 44, column: 37, scope: !1418)
!1421 = !DILocation(line: 44, column: 46, scope: !1418)
!1422 = !DILocation(line: 44, column: 3, scope: !1418)
!1423 = !DILocation(line: 47, column: 2, scope: !1394)
!1424 = !DILocation(line: 41, column: 40, scope: !1425)
!1425 = !DILexicalBlockFile(scope: !1390, file: !351, discriminator: 2)
!1426 = !DILocation(line: 41, column: 45, scope: !1425)
!1427 = !DILocation(line: 41, column: 38, scope: !1425)
!1428 = !DILocation(line: 41, column: 2, scope: !1425)
!1429 = distinct !{!1429, !1430}
!1430 = !DILocation(line: 41, column: 2, scope: !1381)
!1431 = !DILocation(line: 48, column: 1, scope: !1381)
!1432 = distinct !DISubprogram(name: "print_lookup_servers", scope: !351, file: !351, line: 50, type: !352, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!1433 = !DILocalVariable(name: "tmp", scope: !1432, file: !351, line: 52, type: !817)
!1434 = !DILocation(line: 52, column: 10, scope: !1432)
!1435 = !DILocation(line: 53, column: 13, scope: !1436)
!1436 = distinct !DILexicalBlock(scope: !1432, file: !351, line: 53, column: 2)
!1437 = !DILocation(line: 53, column: 11, scope: !1436)
!1438 = !DILocation(line: 53, column: 7, scope: !1436)
!1439 = !DILocation(line: 53, column: 29, scope: !1440)
!1440 = !DILexicalBlockFile(scope: !1441, file: !351, discriminator: 1)
!1441 = distinct !DILexicalBlock(scope: !1436, file: !351, line: 53, column: 2)
!1442 = !DILocation(line: 53, column: 33, scope: !1440)
!1443 = !DILocation(line: 53, column: 2, scope: !1440)
!1444 = !DILocalVariable(name: "rec", scope: !1445, file: !351, line: 54, type: !659)
!1445 = distinct !DILexicalBlock(scope: !1441, file: !351, line: 53, column: 58)
!1446 = !DILocation(line: 54, column: 15, scope: !1445)
!1447 = !DILocation(line: 54, column: 21, scope: !1445)
!1448 = !DILocation(line: 54, column: 26, scope: !1445)
!1449 = !DILocation(line: 56, column: 43, scope: !1445)
!1450 = !DILocation(line: 56, column: 48, scope: !1445)
!1451 = !DILocation(line: 56, column: 53, scope: !1445)
!1452 = !DILocation(line: 56, column: 58, scope: !1445)
!1453 = !DILocation(line: 56, column: 67, scope: !1445)
!1454 = !DILocation(line: 56, column: 76, scope: !1445)
!1455 = !DILocation(line: 56, column: 81, scope: !1445)
!1456 = !DILocation(line: 56, column: 90, scope: !1445)
!1457 = !DILocation(line: 56, column: 96, scope: !1445)
!1458 = !DILocation(line: 56, column: 101, scope: !1445)
!1459 = !DILocation(line: 56, column: 110, scope: !1445)
!1460 = !DILocation(line: 56, column: 118, scope: !1445)
!1461 = !DILocation(line: 56, column: 96, scope: !1462)
!1462 = !DILexicalBlockFile(scope: !1445, file: !351, discriminator: 1)
!1463 = !DILocation(line: 56, column: 9, scope: !1464)
!1464 = !DILexicalBlockFile(scope: !1445, file: !351, discriminator: 2)
!1465 = !DILocation(line: 56, column: 14, scope: !1464)
!1466 = !DILocation(line: 56, column: 23, scope: !1464)
!1467 = !DILocation(line: 56, column: 96, scope: !1464)
!1468 = !DILocation(line: 56, column: 96, scope: !1469)
!1469 = !DILexicalBlockFile(scope: !1445, file: !351, discriminator: 3)
!1470 = !DILocation(line: 56, column: 32, scope: !1469)
!1471 = !DILocation(line: 56, column: 37, scope: !1469)
!1472 = !DILocation(line: 56, column: 46, scope: !1469)
!1473 = !DILocation(line: 56, column: 3, scope: !1469)
!1474 = !DILocation(line: 59, column: 2, scope: !1445)
!1475 = !DILocation(line: 53, column: 47, scope: !1476)
!1476 = !DILexicalBlockFile(scope: !1441, file: !351, discriminator: 2)
!1477 = !DILocation(line: 53, column: 52, scope: !1476)
!1478 = !DILocation(line: 53, column: 45, scope: !1476)
!1479 = !DILocation(line: 53, column: 2, scope: !1476)
!1480 = distinct !{!1480, !1481}
!1481 = !DILocation(line: 53, column: 2, scope: !1432)
!1482 = !DILocation(line: 60, column: 1, scope: !1432)
!1483 = distinct !DISubprogram(name: "print_reconnects", scope: !351, file: !351, line: 62, type: !352, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!1484 = !DILocalVariable(name: "tmp", scope: !1483, file: !351, line: 64, type: !817)
!1485 = !DILocation(line: 64, column: 10, scope: !1483)
!1486 = !DILocalVariable(name: "tag", scope: !1483, file: !351, line: 65, type: !420)
!1487 = !DILocation(line: 65, column: 8, scope: !1483)
!1488 = !DILocalVariable(name: "next_connect", scope: !1483, file: !351, line: 65, type: !420)
!1489 = !DILocation(line: 65, column: 14, scope: !1483)
!1490 = !DILocalVariable(name: "left", scope: !1483, file: !351, line: 66, type: !494)
!1491 = !DILocation(line: 66, column: 6, scope: !1483)
!1492 = !DILocation(line: 68, column: 13, scope: !1493)
!1493 = distinct !DILexicalBlock(scope: !1483, file: !351, line: 68, column: 2)
!1494 = !DILocation(line: 68, column: 11, scope: !1493)
!1495 = !DILocation(line: 68, column: 7, scope: !1493)
!1496 = !DILocation(line: 68, column: 25, scope: !1497)
!1497 = !DILexicalBlockFile(scope: !1498, file: !351, discriminator: 1)
!1498 = distinct !DILexicalBlock(scope: !1493, file: !351, line: 68, column: 2)
!1499 = !DILocation(line: 68, column: 29, scope: !1497)
!1500 = !DILocation(line: 68, column: 2, scope: !1497)
!1501 = !DILocalVariable(name: "rec", scope: !1502, file: !351, line: 69, type: !1266)
!1502 = distinct !DILexicalBlock(scope: !1498, file: !351, line: 68, column: 54)
!1503 = !DILocation(line: 69, column: 18, scope: !1502)
!1504 = !DILocation(line: 69, column: 24, scope: !1502)
!1505 = !DILocation(line: 69, column: 29, scope: !1502)
!1506 = !DILocalVariable(name: "conn", scope: !1502, file: !351, line: 70, type: !669)
!1507 = !DILocation(line: 70, column: 23, scope: !1502)
!1508 = !DILocation(line: 70, column: 30, scope: !1502)
!1509 = !DILocation(line: 70, column: 35, scope: !1502)
!1510 = !DILocation(line: 72, column: 37, scope: !1502)
!1511 = !DILocation(line: 72, column: 42, scope: !1502)
!1512 = !DILocation(line: 72, column: 9, scope: !1502)
!1513 = !DILocation(line: 72, column: 7, scope: !1502)
!1514 = !DILocation(line: 73, column: 10, scope: !1502)
!1515 = !DILocation(line: 73, column: 15, scope: !1502)
!1516 = !DILocation(line: 73, column: 28, scope: !1502)
!1517 = !DILocation(line: 73, column: 27, scope: !1502)
!1518 = !DILocation(line: 73, column: 8, scope: !1502)
!1519 = !DILocation(line: 74, column: 47, scope: !1502)
!1520 = !DILocation(line: 74, column: 51, scope: !1502)
!1521 = !DILocation(line: 74, column: 56, scope: !1502)
!1522 = !DILocation(line: 74, column: 60, scope: !1502)
!1523 = !DILocation(line: 74, column: 18, scope: !1502)
!1524 = !DILocation(line: 74, column: 16, scope: !1502)
!1525 = !DILocation(line: 75, column: 46, scope: !1502)
!1526 = !DILocation(line: 75, column: 51, scope: !1502)
!1527 = !DILocation(line: 75, column: 57, scope: !1502)
!1528 = !DILocation(line: 75, column: 66, scope: !1502)
!1529 = !DILocation(line: 75, column: 72, scope: !1502)
!1530 = !DILocation(line: 75, column: 78, scope: !1502)
!1531 = !DILocation(line: 75, column: 84, scope: !1502)
!1532 = !DILocation(line: 75, column: 92, scope: !1502)
!1533 = !DILocation(line: 75, column: 78, scope: !1534)
!1534 = !DILexicalBlockFile(scope: !1502, file: !351, discriminator: 1)
!1535 = !DILocation(line: 75, column: 9, scope: !1536)
!1536 = !DILexicalBlockFile(scope: !1502, file: !351, discriminator: 2)
!1537 = !DILocation(line: 75, column: 15, scope: !1536)
!1538 = !DILocation(line: 75, column: 78, scope: !1536)
!1539 = !DILocation(line: 75, column: 78, scope: !1540)
!1540 = !DILexicalBlockFile(scope: !1502, file: !351, discriminator: 3)
!1541 = !DILocation(line: 75, column: 24, scope: !1540)
!1542 = !DILocation(line: 75, column: 30, scope: !1540)
!1543 = !DILocation(line: 75, column: 36, scope: !1540)
!1544 = !DILocation(line: 75, column: 3, scope: !1540)
!1545 = !DILocation(line: 79, column: 10, scope: !1502)
!1546 = !DILocation(line: 79, column: 3, scope: !1502)
!1547 = !DILocation(line: 80, column: 10, scope: !1502)
!1548 = !DILocation(line: 80, column: 3, scope: !1502)
!1549 = !DILocation(line: 81, column: 2, scope: !1502)
!1550 = !DILocation(line: 68, column: 43, scope: !1551)
!1551 = !DILexicalBlockFile(scope: !1498, file: !351, discriminator: 2)
!1552 = !DILocation(line: 68, column: 48, scope: !1551)
!1553 = !DILocation(line: 68, column: 41, scope: !1551)
!1554 = !DILocation(line: 68, column: 2, scope: !1551)
!1555 = distinct !{!1555, !1556}
!1556 = !DILocation(line: 68, column: 2, scope: !1483)
!1557 = !DILocation(line: 82, column: 1, scope: !1483)
!1558 = distinct !DISubprogram(name: "cmd_server_add_modify", scope: !351, file: !351, line: 107, type: !1559, isLocal: true, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !354)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{null, !345, !778}
!1561 = !DILocalVariable(name: "data", arg: 1, scope: !1558, file: !351, line: 107, type: !345)
!1562 = !DILocation(line: 107, column: 47, scope: !1558)
!1563 = !DILocalVariable(name: "add", arg: 2, scope: !1558, file: !351, line: 107, type: !778)
!1564 = !DILocation(line: 107, column: 62, scope: !1558)
!1565 = !DILocalVariable(name: "optlist", scope: !1558, file: !351, line: 109, type: !414)
!1566 = !DILocation(line: 109, column: 21, scope: !1558)
!1567 = !DILocalVariable(name: "rec", scope: !1558, file: !351, line: 110, type: !486)
!1568 = !DILocation(line: 110, column: 20, scope: !1558)
!1569 = !DILocalVariable(name: "addr", scope: !1558, file: !351, line: 111, type: !420)
!1570 = !DILocation(line: 111, column: 8, scope: !1558)
!1571 = !DILocalVariable(name: "portstr", scope: !1558, file: !351, line: 111, type: !420)
!1572 = !DILocation(line: 111, column: 15, scope: !1558)
!1573 = !DILocalVariable(name: "password", scope: !1558, file: !351, line: 111, type: !420)
!1574 = !DILocation(line: 111, column: 25, scope: !1558)
!1575 = !DILocalVariable(name: "value", scope: !1558, file: !351, line: 111, type: !420)
!1576 = !DILocation(line: 111, column: 36, scope: !1558)
!1577 = !DILocalVariable(name: "chatnet", scope: !1558, file: !351, line: 111, type: !420)
!1578 = !DILocation(line: 111, column: 44, scope: !1558)
!1579 = !DILocalVariable(name: "free_arg", scope: !1558, file: !351, line: 112, type: !337)
!1580 = !DILocation(line: 112, column: 8, scope: !1558)
!1581 = !DILocalVariable(name: "port", scope: !1558, file: !351, line: 113, type: !494)
!1582 = !DILocation(line: 113, column: 6, scope: !1558)
!1583 = !DILocation(line: 115, column: 22, scope: !1584)
!1584 = distinct !DILexicalBlock(scope: !1558, file: !351, line: 115, column: 6)
!1585 = !DILocation(line: 115, column: 7, scope: !1584)
!1586 = !DILocation(line: 115, column: 6, scope: !1558)
!1587 = !DILocation(line: 117, column: 3, scope: !1584)
!1588 = !DILocation(line: 119, column: 7, scope: !1589)
!1589 = distinct !DILexicalBlock(scope: !1558, file: !351, line: 119, column: 6)
!1590 = !DILocation(line: 119, column: 6, scope: !1589)
!1591 = !DILocation(line: 119, column: 12, scope: !1589)
!1592 = !DILocation(line: 119, column: 6, scope: !1558)
!1593 = !DILocation(line: 119, column: 21, scope: !1594)
!1594 = !DILexicalBlockFile(scope: !1589, file: !351, discriminator: 1)
!1595 = distinct !{!1595, !1596}
!1596 = !DILocation(line: 119, column: 21, scope: !1589)
!1597 = !DILocation(line: 119, column: 42, scope: !1598)
!1598 = !DILexicalBlockFile(scope: !1599, file: !351, discriminator: 2)
!1599 = distinct !DILexicalBlock(scope: !1589, file: !351, line: 119, column: 24)
!1600 = !DILocation(line: 119, column: 26, scope: !1598)
!1601 = !DILocation(line: 119, column: 53, scope: !1598)
!1602 = distinct !{!1602, !1603}
!1603 = !DILocation(line: 119, column: 53, scope: !1599)
!1604 = !DILocation(line: 119, column: 58, scope: !1605)
!1605 = !DILexicalBlockFile(scope: !1606, file: !351, discriminator: 3)
!1606 = distinct !DILexicalBlock(scope: !1599, file: !351, line: 119, column: 56)
!1607 = !DILocation(line: 119, column: 140, scope: !1608)
!1608 = !DILexicalBlockFile(scope: !1605, file: !351, discriminator: 6)
!1609 = !DILocation(line: 119, column: 155, scope: !1605)
!1610 = !DILocation(line: 119, column: 176, scope: !1611)
!1611 = !DILexicalBlockFile(scope: !1599, file: !351, discriminator: 4)
!1612 = !DILocation(line: 119, column: 176, scope: !1613)
!1613 = !DILexicalBlockFile(scope: !1599, file: !351, discriminator: 5)
