; ModuleID = './line12-write.o.i'
source_filename = "./line12-write.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._CONFIG_REC = type { i8*, i32, i32, i8*, %struct._CONFIG_NODE*, %struct._GHashTable*, %struct._GHashTable*, %struct._GScanner*, %struct._GIOChannel*, i32, i32 }
%struct._CONFIG_NODE = type { i32, i8*, i8* }
%struct._GHashTable = type opaque
%struct._GScanner = type { i8*, i32, i32, i8*, %struct._GData*, %struct._GScannerConfig*, i32, %union._GTokenValue, i32, i32, i32, %union._GTokenValue, i32, i32, %struct._GHashTable*, i32, i8*, i8*, i8*, i32, void (%struct._GScanner*, i8*, i32)* }
%struct._GData = type opaque
%struct._GScannerConfig = type { i8*, i8*, i8*, i8*, i24, i32 }
%union._GTokenValue = type { i8* }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }

!23 = !DIEnumerator(name: "G_TOKEN_STRING", value: 264)
!24 = !DIEnumerator(name: "G_TOKEN_SYMBOL", value: 265)
!25 = !DIEnumerator(name: "G_TOKEN_IDENTIFIER", value: 266)
!26 = !DIEnumerator(name: "G_TOKEN_IDENTIFIER_NULL", value: 267)
!27 = !DIEnumerator(name: "G_TOKEN_COMMENT_SINGLE", value: 268)
!28 = !DIEnumerator(name: "G_TOKEN_COMMENT_MULTI", value: 269)
!29 = !DIEnumerator(name: "G_TOKEN_LAST", value: 270)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 69, size: 32, align: 32, elements: !32)
!31 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!32 = !{!33, !34, !35, !36}
!33 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!34 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!35 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!36 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 77, size: 32, align: 32, elements: !38)
!38 = !{!39, !40, !41}
!39 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!40 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!41 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 31, size: 32, align: 32, elements: !44)
!43 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!44 = !{!45, !46, !47, !48, !49, !50}
!45 = !DIEnumerator(name: "G_IO_IN", value: 1)
!46 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!47 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!48 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!49 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!50 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 84, size: 32, align: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61}
!53 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!54 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!55 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!56 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!57 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!58 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!59 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!60 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!61 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 4, size: 32, align: 32, elements: !64)
!63 = !DIFile(filename: "iconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!64 = !{!65, !66, !67, !68, !69}
!65 = !DIEnumerator(name: "NODE_TYPE_KEY", value: 0)
!66 = !DIEnumerator(name: "NODE_TYPE_VALUE", value: 1)
!67 = !DIEnumerator(name: "NODE_TYPE_BLOCK", value: 2)
!68 = !DIEnumerator(name: "NODE_TYPE_LIST", value: 3)
!69 = !DIEnumerator(name: "NODE_TYPE_COMMENT", value: 4)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !71, line: 46, size: 32, align: 32, elements: !72)
!71 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/irssi/task1")
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84}
!73 = !DIEnumerator(name: "_ISupper", value: 256)
!74 = !DIEnumerator(name: "_ISlower", value: 512)
!75 = !DIEnumerator(name: "_ISalpha", value: 1024)
!76 = !DIEnumerator(name: "_ISdigit", value: 2048)
!77 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!78 = !DIEnumerator(name: "_ISspace", value: 8192)
!79 = !DIEnumerator(name: "_ISprint", value: 16384)
!80 = !DIEnumerator(name: "_ISgraph", value: 32768)
!81 = !DIEnumerator(name: "_ISblank", value: 1)
!82 = !DIEnumerator(name: "_IScntrl", value: 2)
!83 = !DIEnumerator(name: "_ISpunct", value: 4)
!84 = !DIEnumerator(name: "_ISalnum", value: 8)
!85 = !{!86, !87, !91, !93, !94, !95}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !89, line: 46, baseType: !90)
!89 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!90 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!93 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!94 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!95 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!96 = !{!97}
!97 = distinct !DIGlobalVariable(name: "indent_block", scope: !0, file: !98, line: 27, type: !91, isLocal: true, isDefinition: true, variable: i8** @indent_block)
!98 = !DIFile(filename: "write.c", directory: "/home/lichi/Desktop/irssi/task1")
!99 = !{i32 2, !"Dwarf Version", i32 4}
!100 = !{i32 2, !"Debug Info Version", i32 3}
!101 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!102 = distinct !DISubprogram(name: "config_write", scope: !98, file: !98, line: 300, type: !103, isLocal: false, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !398)
!103 = !DISubroutineType(types: !104)
!104 = !{!93, !105, !91, !93}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_REC", file: !63, line: 18, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_REC", file: !63, line: 49, size: 576, align: 64, elements: !108)
!108 = !{!109, !111, !112, !113, !114, !122, !127, !128, !223, !396, !397}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !107, file: !63, line: 50, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "create_mode", scope: !107, file: !63, line: 51, baseType: !93, size: 32, align: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "modifycounter", scope: !107, file: !63, line: 52, baseType: !93, size: 32, align: 32, offset: 96)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !107, file: !63, line: 54, baseType: !110, size: 64, align: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "mainnode", scope: !107, file: !63, line: 55, baseType: !115, size: 64, align: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_NODE", file: !63, line: 17, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_NODE", file: !63, line: 20, size: 192, align: 64, elements: !118)
!118 = !{!119, !120, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !117, file: !63, line: 21, baseType: !93, size: 32, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !117, file: !63, line: 22, baseType: !110, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !117, file: !63, line: 23, baseType: !86, size: 64, align: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !107, file: !63, line: 56, baseType: !123, size: 64, align: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !125, line: 37, baseType: !126)
!125 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !125, line: 37, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "cache_nodes", scope: !107, file: !63, line: 57, baseType: !123, size: 64, align: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "scanner", scope: !107, file: !63, line: 59, baseType: !129, size: 64, align: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScanner", file: !4, line: 37, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GScanner", file: !4, line: 169, size: 1152, align: 64, elements: !132)
!132 = !{!133, !135, !138, !139, !142, !147, !179, !181, !204, !205, !206, !207, !208, !209, !210, !211, !213, !214, !215, !216, !217}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !131, file: !4, line: 172, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !89, line: 77, baseType: !86)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "max_parse_errors", scope: !131, file: !4, line: 173, baseType: !136, size: 32, align: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !89, line: 55, baseType: !137)
!137 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "parse_errors", scope: !131, file: !4, line: 176, baseType: !136, size: 32, align: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "input_name", scope: !131, file: !4, line: 179, baseType: !140, size: 64, align: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "qdata", scope: !131, file: !4, line: 182, baseType: !143, size: 64, align: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GData", file: !145, line: 36, baseType: !146)
!145 = !DIFile(filename: "/usr/include/glib-2.0/glib/gdataset.h", directory: "/home/lichi/Desktop/irssi/task1")
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GData", file: !145, line: 36, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !131, file: !4, line: 185, baseType: !148, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScannerConfig", file: !4, line: 38, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GScannerConfig", file: !4, line: 127, size: 320, align: 64, elements: !151)
!151 = !{!152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "cset_skip_characters", scope: !150, file: !4, line: 131, baseType: !87, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "cset_identifier_first", scope: !150, file: !4, line: 132, baseType: !87, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "cset_identifier_nth", scope: !150, file: !4, line: 133, baseType: !87, size: 64, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "cpair_comment_single", scope: !150, file: !4, line: 134, baseType: !87, size: 64, align: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "case_sensitive", scope: !150, file: !4, line: 138, baseType: !136, size: 1, align: 32, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "skip_comment_multi", scope: !150, file: !4, line: 143, baseType: !136, size: 1, align: 32, offset: 257, flags: DIFlagBitField, extraData: i64 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "skip_comment_single", scope: !150, file: !4, line: 144, baseType: !136, size: 1, align: 32, offset: 258, flags: DIFlagBitField, extraData: i64 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "scan_comment_multi", scope: !150, file: !4, line: 145, baseType: !136, size: 1, align: 32, offset: 259, flags: DIFlagBitField, extraData: i64 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier", scope: !150, file: !4, line: 146, baseType: !136, size: 1, align: 32, offset: 260, flags: DIFlagBitField, extraData: i64 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier_1char", scope: !150, file: !4, line: 147, baseType: !136, size: 1, align: 32, offset: 261, flags: DIFlagBitField, extraData: i64 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier_NULL", scope: !150, file: !4, line: 148, baseType: !136, size: 1, align: 32, offset: 262, flags: DIFlagBitField, extraData: i64 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "scan_symbols", scope: !150, file: !4, line: 149, baseType: !136, size: 1, align: 32, offset: 263, flags: DIFlagBitField, extraData: i64 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "scan_binary", scope: !150, file: !4, line: 150, baseType: !136, size: 1, align: 32, offset: 264, flags: DIFlagBitField, extraData: i64 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "scan_octal", scope: !150, file: !4, line: 151, baseType: !136, size: 1, align: 32, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "scan_float", scope: !150, file: !4, line: 152, baseType: !136, size: 1, align: 32, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "scan_hex", scope: !150, file: !4, line: 153, baseType: !136, size: 1, align: 32, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "scan_hex_dollar", scope: !150, file: !4, line: 154, baseType: !136, size: 1, align: 32, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "scan_string_sq", scope: !150, file: !4, line: 155, baseType: !136, size: 1, align: 32, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "scan_string_dq", scope: !150, file: !4, line: 156, baseType: !136, size: 1, align: 32, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "numbers_2_int", scope: !150, file: !4, line: 157, baseType: !136, size: 1, align: 32, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "int_2_float", scope: !150, file: !4, line: 158, baseType: !136, size: 1, align: 32, offset: 272, flags: DIFlagBitField, extraData: i64 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "identifier_2_string", scope: !150, file: !4, line: 159, baseType: !136, size: 1, align: 32, offset: 273, flags: DIFlagBitField, extraData: i64 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "char_2_token", scope: !150, file: !4, line: 160, baseType: !136, size: 1, align: 32, offset: 274, flags: DIFlagBitField, extraData: i64 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_2_token", scope: !150, file: !4, line: 161, baseType: !136, size: 1, align: 32, offset: 275, flags: DIFlagBitField, extraData: i64 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "scope_0_fallback", scope: !150, file: !4, line: 162, baseType: !136, size: 1, align: 32, offset: 276, flags: DIFlagBitField, extraData: i64 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "store_int64", scope: !150, file: !4, line: 163, baseType: !136, size: 1, align: 32, offset: 277, flags: DIFlagBitField, extraData: i64 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "padding_dummy", scope: !150, file: !4, line: 166, baseType: !136, size: 32, align: 32, offset: 288)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !131, file: !4, line: 188, baseType: !180, size: 32, align: 32, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTokenType", file: !4, line: 109, baseType: !3)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !131, file: !4, line: 189, baseType: !182, size: 64, align: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTokenValue", file: !4, line: 39, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GTokenValue", file: !4, line: 111, size: 64, align: 64, elements: !184)
!184 = !{!185, !186, !187, !190, !191, !192, !195, !198, !199, !200, !201, !203}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "v_symbol", scope: !183, file: !4, line: 113, baseType: !134, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "v_identifier", scope: !183, file: !4, line: 114, baseType: !87, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "v_binary", scope: !183, file: !4, line: 115, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "gulong", file: !89, line: 54, baseType: !189)
!189 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "v_octal", scope: !183, file: !4, line: 116, baseType: !188, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "v_int", scope: !183, file: !4, line: 117, baseType: !188, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "v_int64", scope: !183, file: !4, line: 118, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint64", file: !194, line: 52, baseType: !189)
!194 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!195 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !183, file: !4, line: 119, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "gdouble", file: !89, line: 58, baseType: !197)
!197 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "v_hex", scope: !183, file: !4, line: 120, baseType: !188, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !183, file: !4, line: 121, baseType: !87, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "v_comment", scope: !183, file: !4, line: 122, baseType: !87, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "v_char", scope: !183, file: !4, line: 123, baseType: !202, size: 8, align: 8)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "guchar", file: !89, line: 52, baseType: !94)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v_error", scope: !183, file: !4, line: 124, baseType: !136, size: 32, align: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !131, file: !4, line: 190, baseType: !136, size: 32, align: 32, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !131, file: !4, line: 191, baseType: !136, size: 32, align: 32, offset: 480)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next_token", scope: !131, file: !4, line: 194, baseType: !180, size: 32, align: 32, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next_value", scope: !131, file: !4, line: 195, baseType: !182, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !131, file: !4, line: 196, baseType: !136, size: 32, align: 32, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next_position", scope: !131, file: !4, line: 197, baseType: !136, size: 32, align: 32, offset: 672)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_table", scope: !131, file: !4, line: 201, baseType: !123, size: 64, align: 64, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "input_fd", scope: !131, file: !4, line: 202, baseType: !212, size: 32, align: 32, offset: 768)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !89, line: 49, baseType: !93)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !131, file: !4, line: 203, baseType: !140, size: 64, align: 64, offset: 832)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "text_end", scope: !131, file: !4, line: 204, baseType: !140, size: 64, align: 64, offset: 896)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !131, file: !4, line: 205, baseType: !87, size: 64, align: 64, offset: 960)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "scope_id", scope: !131, file: !4, line: 206, baseType: !136, size: 32, align: 32, offset: 1024)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "msg_handler", scope: !131, file: !4, line: 210, baseType: !218, size: 64, align: 64, offset: 1088)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScannerMsgFunc", file: !4, line: 41, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !129, !87, !222}
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !89, line: 50, baseType: !212)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !107, file: !63, line: 62, baseType: !224, size: 64, align: 64, offset: 448)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !31, line: 41, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !31, line: 97, size: 896, align: 64, elements: !227)
!227 = !{!228, !229, !363, !364, !369, !370, !371, !372, !373, !382, !383, !384, !388, !389, !390, !391, !392, !393, !394, !395}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !226, file: !31, line: 100, baseType: !212, size: 32, align: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !226, file: !31, line: 101, baseType: !230, size: 64, align: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !31, line: 42, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !31, line: 131, size: 512, align: 64, elements: !233)
!233 = !{!234, !253, !257, !264, !268, !350, !354, !359}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !232, file: !31, line: 133, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!238, !224, !87, !239, !240, !241}
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !31, line: 75, baseType: !30)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !194, line: 66, baseType: !189)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !244, line: 42, baseType: !245)
!244 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !244, line: 44, size: 128, align: 64, elements: !246)
!246 = !{!247, !251, !252}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !245, file: !244, line: 46, baseType: !248, size: 32, align: 32)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !249, line: 36, baseType: !250)
!249 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !194, line: 45, baseType: !137)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !245, file: !244, line: 47, baseType: !212, size: 32, align: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !245, file: !244, line: 48, baseType: !87, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !232, file: !31, line: 138, baseType: !254, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!238, !224, !140, !239, !240, !241}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !232, file: !31, line: 143, baseType: !258, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!238, !224, !261, !263, !241}
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !194, line: 51, baseType: !262)
!262 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !31, line: 82, baseType: !37)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !232, file: !31, line: 147, baseType: !265, size: 64, align: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!238, !224, !241}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !232, file: !31, line: 149, baseType: !269, size: 64, align: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!272, !224, !349}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !43, line: 64, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !43, line: 171, size: 768, align: 64, elements: !275)
!275 = !{!276, !277, !297, !326, !327, !331, !332, !333, !334, !342, !343, !344, !345}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !274, file: !43, line: 174, baseType: !134, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !274, file: !43, line: 175, baseType: !278, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !43, line: 77, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !43, line: 196, size: 192, align: 64, elements: !281)
!281 = !{!282, !286, !287}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !280, file: !43, line: 198, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !134}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !280, file: !43, line: 199, baseType: !283, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !280, file: !43, line: 200, baseType: !288, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !134, !272, !291, !296}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !43, line: 155, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!222, !134}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !274, file: !43, line: 177, baseType: !298, size: 64, align: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !43, line: 130, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !43, line: 214, size: 384, align: 64, elements: !302)
!302 = !{!303, !308, !312, !316, !320, !321}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !301, file: !43, line: 216, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!222, !272, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !301, file: !43, line: 218, baseType: !309, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!222, !272}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !301, file: !43, line: 219, baseType: !313, size: 64, align: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!222, !272, !292, !134}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !301, file: !43, line: 222, baseType: !317, size: 64, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !272}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !301, file: !43, line: 226, baseType: !292, size: 64, align: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !301, file: !43, line: 227, baseType: !322, size: 64, align: 64, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !43, line: 212, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{null}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !274, file: !43, line: 178, baseType: !136, size: 32, align: 32, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !274, file: !43, line: 180, baseType: !328, size: 64, align: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !43, line: 48, baseType: !330)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !43, line: 48, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !274, file: !43, line: 182, baseType: !212, size: 32, align: 32, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !274, file: !43, line: 183, baseType: !136, size: 32, align: 32, offset: 352)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !274, file: !43, line: 184, baseType: !136, size: 32, align: 32, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !274, file: !43, line: 186, baseType: !335, size: 64, align: 64, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !337, line: 37, baseType: !338)
!337 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !337, line: 39, size: 128, align: 64, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !338, file: !337, line: 41, baseType: !134, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !338, file: !337, line: 42, baseType: !335, size: 64, align: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !274, file: !43, line: 188, baseType: !272, size: 64, align: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !43, line: 189, baseType: !272, size: 64, align: 64, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !274, file: !43, line: 191, baseType: !110, size: 64, align: 64, offset: 640)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !274, file: !43, line: 193, baseType: !346, size: 64, align: 64, offset: 704)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !43, line: 65, baseType: !348)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !43, line: 65, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !43, line: 39, baseType: !42)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !232, file: !31, line: 151, baseType: !351, size: 64, align: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !224}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !232, file: !31, line: 152, baseType: !355, size: 64, align: 64, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!238, !224, !358, !241}
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !31, line: 95, baseType: !51)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !232, file: !31, line: 155, baseType: !360, size: 64, align: 64, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!358, !224}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !226, file: !31, line: 103, baseType: !87, size: 64, align: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !226, file: !31, line: 104, baseType: !365, size: 64, align: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !366, line: 77, baseType: !367)
!366 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !366, line: 77, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !226, file: !31, line: 105, baseType: !365, size: 64, align: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !226, file: !31, line: 106, baseType: !87, size: 64, align: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !226, file: !31, line: 107, baseType: !136, size: 32, align: 32, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !226, file: !31, line: 109, baseType: !239, size: 64, align: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !226, file: !31, line: 110, baseType: !374, size: 64, align: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !376, line: 39, baseType: !377)
!376 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !376, line: 41, size: 192, align: 64, elements: !378)
!378 = !{!379, !380, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !377, file: !376, line: 43, baseType: !87, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !377, file: !376, line: 44, baseType: !239, size: 64, align: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !377, file: !376, line: 45, baseType: !239, size: 64, align: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !226, file: !31, line: 111, baseType: !374, size: 64, align: 64, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !226, file: !31, line: 112, baseType: !374, size: 64, align: 64, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !226, file: !31, line: 113, baseType: !385, size: 48, align: 8, offset: 704)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 48, align: 8, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 6)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !226, file: !31, line: 117, baseType: !136, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !226, file: !31, line: 118, baseType: !136, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !226, file: !31, line: 119, baseType: !136, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !226, file: !31, line: 120, baseType: !136, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !226, file: !31, line: 121, baseType: !136, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !226, file: !31, line: 122, baseType: !136, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !226, file: !31, line: 124, baseType: !134, size: 64, align: 64, offset: 768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !226, file: !31, line: 125, baseType: !134, size: 64, align: 64, offset: 832)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_indent_level", scope: !107, file: !63, line: 63, baseType: !93, size: 32, align: 32, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_last_lf", scope: !107, file: !63, line: 64, baseType: !93, size: 32, align: 32, offset: 544)
!398 = !{}
!399 = !DILocalVariable(name: "rec", arg: 1, scope: !102, file: !98, line: 300, type: !105)
!400 = !DIExpression()
!401 = !DILocation(line: 300, column: 30, scope: !102)
!402 = !DILocalVariable(name: "fname", arg: 2, scope: !102, file: !98, line: 300, type: !91)
!403 = !DILocation(line: 300, column: 47, scope: !102)
!404 = !DILocalVariable(name: "create_mode", arg: 3, scope: !102, file: !98, line: 300, type: !93)
!405 = !DILocation(line: 300, column: 58, scope: !102)
!406 = !DILocalVariable(name: "ret", scope: !102, file: !98, line: 302, type: !93)
!407 = !DILocation(line: 302, column: 6, scope: !102)
!408 = !DILocalVariable(name: "fd", scope: !102, file: !98, line: 303, type: !93)
!409 = !DILocation(line: 303, column: 6, scope: !102)
!410 = !DILocalVariable(name: "save_errno", scope: !102, file: !98, line: 304, type: !93)
!411 = !DILocation(line: 304, column: 6, scope: !102)
!412 = !DILocalVariable(name: "base_name", scope: !102, file: !98, line: 305, type: !91)
!413 = !DILocation(line: 305, column: 14, scope: !102)
!414 = !DILocalVariable(name: "tmp_name", scope: !102, file: !98, line: 306, type: !110)
!415 = !DILocation(line: 306, column: 8, scope: !102)
!416 = !DILocalVariable(name: "dest_name", scope: !102, file: !98, line: 307, type: !110)
!417 = !DILocation(line: 307, column: 8, scope: !102)
!418 = !DILocation(line: 309, column: 2, scope: !102)
!419 = distinct !{!419, !418}
!420 = !DILocation(line: 309, column: 10, scope: !421)
!421 = !DILexicalBlockFile(scope: !422, file: !98, discriminator: 1)
!422 = distinct !DILexicalBlock(scope: !423, file: !98, line: 309, column: 10)
!423 = distinct !DILexicalBlock(scope: !102, file: !98, line: 309, column: 4)
!424 = !DILocation(line: 309, column: 14, scope: !421)
!425 = !DILocation(line: 309, column: 5, scope: !426)
!426 = !DILexicalBlockFile(scope: !427, file: !98, discriminator: 2)
!427 = distinct !DILexicalBlock(scope: !422, file: !98, line: 309, column: 3)
!428 = !DILocation(line: 309, column: 14, scope: !429)
!429 = !DILexicalBlockFile(scope: !430, file: !98, discriminator: 3)
!430 = distinct !DILexicalBlock(scope: !422, file: !98, line: 309, column: 12)
!431 = !DILocation(line: 309, column: 98, scope: !429)
!432 = !DILocation(line: 309, column: 114, scope: !433)
!433 = !DILexicalBlockFile(scope: !423, file: !98, discriminator: 4)
!434 = !DILocation(line: 310, column: 9, scope: !102)
!435 = distinct !{!435, !434}
!436 = !DILocation(line: 310, column: 17, scope: !437)
!437 = !DILexicalBlockFile(scope: !438, file: !98, discriminator: 1)
!438 = distinct !DILexicalBlock(scope: !439, file: !98, line: 310, column: 17)
!439 = distinct !DILexicalBlock(scope: !102, file: !98, line: 310, column: 11)
!440 = !DILocation(line: 310, column: 23, scope: !437)
!441 = !DILocation(line: 310, column: 8, scope: !437)
!442 = !DILocation(line: 310, column: 11, scope: !443)
!443 = !DILexicalBlockFile(scope: !438, file: !98, discriminator: 2)
!444 = !DILocation(line: 310, column: 16, scope: !443)
!445 = !DILocation(line: 310, column: 22, scope: !443)
!446 = !DILocation(line: 310, column: 17, scope: !443)
!447 = !DILocation(line: 310, column: 12, scope: !448)
!448 = !DILexicalBlockFile(scope: !449, file: !98, discriminator: 3)
!449 = distinct !DILexicalBlock(scope: !438, file: !98, line: 310, column: 10)
!450 = !DILocation(line: 310, column: 21, scope: !451)
!451 = !DILexicalBlockFile(scope: !452, file: !98, discriminator: 4)
!452 = distinct !DILexicalBlock(scope: !438, file: !98, line: 310, column: 19)
!453 = !DILocation(line: 310, column: 129, scope: !451)
!454 = !DILocation(line: 310, column: 145, scope: !455)
!455 = !DILexicalBlockFile(scope: !439, file: !98, discriminator: 5)
!456 = !DILocation(line: 311, column: 9, scope: !102)
!457 = distinct !{!457, !456}
!458 = !DILocation(line: 311, column: 17, scope: !459)
