; ModuleID = './ulCondVar.o.i'
source_filename = "./ulCondVar.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.MXUserCondVar = type { i32, %struct.MXUserHeader*, %struct.MXRecLock*, %struct.Atomic_uint32, %union.pthread_cond_t }
%struct.Atomic_uint32 = type { i32 }
%union.pthread_cond_t = type { %struct.anon.0 }
%struct.anon.0 = type { i32, i32, i64, i64, i64, i8*, i32, i32 }
%struct.MXUserHeader = type { i32, i8*, i32, %struct.anon, void (%struct.MXUserHeader*)*, void (%struct.MXUserHeader*)*, %struct.ListItem }
%struct.anon = type { i32 }
%struct.ListItem = type { %struct.ListItem*, %struct.ListItem* }
%struct.MXRecLock = type { %union.pthread_mutex_t, i32, i64 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%union.pthread_condattr_t = type { i32 }
%struct.timeval = type { i64, i64 }
%struct.timespec = type { i64, i64 }
%struct.timezone = type { i32, i32 }

@.str = private unnamed_addr constant [47 x i8] c"%s: native lock initialization routine failed\0A\00", align 1
@__FUNCTION__.MXUserCreateCondVar = private unnamed_addr constant [20 x i8] c"MXUserCreateCondVar\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15)
!1 = !DIFile(filename: "ulCondVar.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line483")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 440, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "ulInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line483")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "MXUSER_TYPE_NEVER_USE", value: 0)
!7 = !DIEnumerator(name: "MXUSER_TYPE_RW", value: 1)
!8 = !DIEnumerator(name: "MXUSER_TYPE_REC", value: 2)
!9 = !DIEnumerator(name: "MXUSER_TYPE_RANK", value: 3)
!10 = !DIEnumerator(name: "MXUSER_TYPE_EXCL", value: 4)
!11 = !DIEnumerator(name: "MXUSER_TYPE_SEMA", value: 5)
!12 = !DIEnumerator(name: "MXUSER_TYPE_CONDVAR", value: 6)
!13 = !DIEnumerator(name: "MXUSER_TYPE_BARRIER", value: 7)
!14 = !DIEnumerator(name: "MXUSER_TYPE_EVENT", value: 8)
!15 = !{!16, !17, !22, !26}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !18, line: 171, baseType: !19)
!18 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line483")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !20, line: 55, baseType: !21)
!20 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line483")
!21 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !23, line: 75, baseType: !24)
!23 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line483")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !25, line: 139, baseType: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line483")
!26 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!27 = !{i32 2, !"Dwarf Version", i32 4}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!30 = distinct !DISubprogram(name: "MXUserCreateCondVar", scope: !31, file: !31, line: 390, type: !32, isLocal: false, isDefinition: true, scopeLine: 392, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !140)
!31 = !DIFile(filename: "ulCondVar.c", directory: "/home/lichi/Desktop/open-vm-tools/line483")
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !44, !74}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserCondVar", file: !36, line: 42, baseType: !37)
!36 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/userlock.h", directory: "/home/lichi/Desktop/open-vm-tools/line483")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserCondVar", file: !31, line: 37, size: 640, align: 64, elements: !38)
!38 = !{!39, !43, !73, !111, !118}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !37, file: !31, line: 38, baseType: !40, size: 32, align: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !18, line: 173, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !20, line: 51, baseType: !42)
!42 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !37, file: !31, line: 39, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserHeader", file: !4, line: 469, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserHeader", file: !4, line: 456, size: 448, align: 64, elements: !47)
!47 = !{!48, !49, !52, !54, !59, !64, !65}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !46, file: !4, line: 457, baseType: !40, size: 32, align: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !46, file: !4, line: 458, baseType: !50, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !46, file: !4, line: 459, baseType: !53, size: 32, align: 32, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "MX_Rank", file: !18, line: 1167, baseType: !40)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !46, file: !4, line: 464, baseType: !55, size: 32, align: 32, offset: 160)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !4, line: 461, size: 32, align: 32, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !55, file: !4, line: 462, baseType: !42, size: 24, align: 32, flags: DIFlagBitField, extraData: i64 0)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "badHeader", scope: !55, file: !4, line: 463, baseType: !42, size: 1, align: 32, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "dumpFunc", scope: !46, file: !4, line: 466, baseType: !60, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !63}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "statsFunc", scope: !46, file: !4, line: 467, baseType: !60, size: 64, align: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !46, file: !4, line: 468, baseType: !66, size: 128, align: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem", file: !67, line: 45, baseType: !68)
!67 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/circList.h", directory: "/home/lichi/Desktop/open-vm-tools/line483")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListItem", file: !67, line: 42, size: 128, align: 64, elements: !69)
!69 = !{!70, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !68, file: !67, line: 43, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !67, line: 44, baseType: !71, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ownerLock", scope: !37, file: !31, line: 40, baseType: !74, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXRecLock", file: !4, line: 67, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 58, size: 448, align: 64, elements: !77)
!77 = !{!78, !107, !108}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "nativeLock", scope: !76, file: !4, line: 62, baseType: !79, size: 320, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !80, line: 128, baseType: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line483")
!81 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !80, line: 90, size: 320, align: 64, elements: !82)
!82 = !{!83, !102, !106}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !81, file: !80, line: 125, baseType: !84, size: 320, align: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !80, line: 92, size: 320, align: 64, elements: !85)
!85 = !{!86, !88, !89, !90, !91, !92, !94, !95}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !84, file: !80, line: 94, baseType: !87, size: 32, align: 32)
!87 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !84, file: !80, line: 95, baseType: !42, size: 32, align: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !84, file: !80, line: 96, baseType: !87, size: 32, align: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !84, file: !80, line: 98, baseType: !42, size: 32, align: 32, offset: 96)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !84, file: !80, line: 102, baseType: !87, size: 32, align: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !84, file: !80, line: 104, baseType: !93, size: 16, align: 16, offset: 160)
!93 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !84, file: !80, line: 105, baseType: !93, size: 16, align: 16, offset: 176)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !84, file: !80, line: 106, baseType: !96, size: 128, align: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !80, line: 79, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !80, line: 75, size: 128, align: 64, elements: !98)
!98 = !{!99, !101}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !97, file: !80, line: 77, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !97, file: !80, line: 78, baseType: !100, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !81, file: !80, line: 126, baseType: !103, size: 320, align: 8)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 320, align: 8, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 40)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !81, file: !80, line: 127, baseType: !26, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "referenceCount", scope: !76, file: !4, line: 65, baseType: !87, size: 32, align: 32, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "nativeThreadID", scope: !76, file: !4, line: 66, baseType: !109, size: 64, align: 64, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserThreadID", file: !4, line: 39, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !80, line: 60, baseType: !21)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "referenceCount", scope: !37, file: !31, line: 41, baseType: !112, size: 32, align: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint32", file: !113, line: 135, baseType: !114)
!113 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_atomic.h", directory: "/home/lichi/Desktop/open-vm-tools/line483")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint32", file: !113, line: 133, size: 32, align: 32, elements: !115)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !114, file: !113, line: 134, baseType: !117, size: 32, align: 32)
!117 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !40)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "condObject", scope: !37, file: !31, line: 46, baseType: !119, size: 384, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !80, line: 154, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !80, line: 139, size: 384, align: 64, elements: !121)
!121 = !{!122, !134, !138}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !120, file: !80, line: 151, baseType: !123, size: 384, align: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !120, file: !80, line: 141, size: 384, align: 64, elements: !124)
!124 = !{!125, !126, !127, !129, !130, !131, !132, !133}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !123, file: !80, line: 143, baseType: !87, size: 32, align: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__futex", scope: !123, file: !80, line: 144, baseType: !42, size: 32, align: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__total_seq", scope: !123, file: !80, line: 145, baseType: !128, size: 64, align: 64, offset: 64)
!128 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__wakeup_seq", scope: !123, file: !80, line: 146, baseType: !128, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__woken_seq", scope: !123, file: !80, line: 147, baseType: !128, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__mutex", scope: !123, file: !80, line: 148, baseType: !16, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__nwaiters", scope: !123, file: !80, line: 149, baseType: !42, size: 32, align: 32, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__broadcast_seq", scope: !123, file: !80, line: 150, baseType: !42, size: 32, align: 32, offset: 352)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !120, file: !80, line: 152, baseType: !135, size: 384, align: 8)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 384, align: 8, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 48)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !120, file: !80, line: 153, baseType: !139, size: 64, align: 64)
!139 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!140 = !{}
!141 = !DILocalVariable(name: "header", arg: 1, scope: !30, file: !31, line: 390, type: !44)
!142 = !DIExpression()
!143 = !DILocation(line: 390, column: 35, scope: !30)
!144 = !DILocalVariable(name: "lock", arg: 2, scope: !30, file: !31, line: 391, type: !74)
!145 = !DILocation(line: 391, column: 32, scope: !30)
!146 = !DILocalVariable(name: "condVar", scope: !30, file: !31, line: 393, type: !34)
!147 = !DILocation(line: 393, column: 19, scope: !30)
!148 = !DILocation(line: 393, column: 29, scope: !30)
!149 = !DILocation(line: 395, column: 48, scope: !150)
!150 = distinct !DILexicalBlock(scope: !30, file: !31, line: 395, column: 8)
!151 = !DILocation(line: 395, column: 27, scope: !150)
!152 = !DILocation(line: 395, column: 26, scope: !150)
!153 = !DILocation(line: 395, column: 25, scope: !150)
!154 = !DILocation(line: 395, column: 8, scope: !150)
!155 = !DILocation(line: 395, column: 8, scope: !30)
!156 = !DILocation(line: 396, column: 7, scope: !157)
!157 = distinct !DILexicalBlock(scope: !150, file: !31, line: 395, column: 63)
!158 = !DILocation(line: 399, column: 25, scope: !30)
!159 = !DILocation(line: 399, column: 4, scope: !30)
!160 = !DILocation(line: 399, column: 13, scope: !30)
!161 = !DILocation(line: 399, column: 23, scope: !30)
!162 = !DILocation(line: 400, column: 22, scope: !30)
!163 = !DILocation(line: 400, column: 4, scope: !30)
!164 = !DILocation(line: 400, column: 13, scope: !30)
!165 = !DILocation(line: 400, column: 20, scope: !30)
!166 = !DILocation(line: 401, column: 25, scope: !30)
!167 = !DILocation(line: 401, column: 4, scope: !30)
!168 = !DILocation(line: 401, column: 13, scope: !30)
!169 = !DILocation(line: 401, column: 23, scope: !30)
!170 = !DILocation(line: 403, column: 11, scope: !30)
!171 = !DILocation(line: 403, column: 4, scope: !30)
!172 = distinct !DISubprogram(name: "MXUserCreateInternal", scope: !31, file: !31, line: 217, type: !173, isLocal: true, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !140)
!173 = !DISubroutineType(types: !174)
!174 = !{!175, !34}
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !18, line: 230, baseType: !51)
!176 = !DILocalVariable(name: "condVar", arg: 1, scope: !172, file: !31, line: 217, type: !34)
!177 = !DILocation(line: 217, column: 37, scope: !172)
!178 = !DILocation(line: 219, column: 30, scope: !172)
!179 = !DILocation(line: 219, column: 39, scope: !172)
!180 = !DILocation(line: 219, column: 11, scope: !172)
!181 = !DILocation(line: 219, column: 56, scope: !172)
!182 = !DILocation(line: 219, column: 4, scope: !172)
!183 = distinct !DISubprogram(name: "MXUserWaitCondVar", scope: !31, file: !31, line: 425, type: !184, isLocal: false, isDefinition: true, scopeLine: 429, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !140)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !44, !74, !34, !40}
!186 = !DILocalVariable(name: "header", arg: 1, scope: !183, file: !31, line: 425, type: !44)
!187 = !DILocation(line: 425, column: 33, scope: !183)
!188 = !DILocalVariable(name: "lock", arg: 2, scope: !183, file: !31, line: 426, type: !74)
!189 = !DILocation(line: 426, column: 30, scope: !183)
!190 = !DILocalVariable(name: "condVar", arg: 3, scope: !183, file: !31, line: 427, type: !34)
!191 = !DILocation(line: 427, column: 34, scope: !183)
!192 = !DILocalVariable(name: "waitTimeMsec", arg: 4, scope: !183, file: !31, line: 428, type: !40)
!193 = !DILocation(line: 428, column: 26, scope: !183)
!194 = !DILocation(line: 435, column: 8, scope: !195)
!195 = distinct !DILexicalBlock(scope: !183, file: !31, line: 435, column: 8)
!196 = !DILocation(line: 435, column: 17, scope: !195)
!197 = !DILocation(line: 435, column: 30, scope: !195)
!198 = !DILocation(line: 435, column: 27, scope: !195)
!199 = !DILocation(line: 435, column: 8, scope: !183)
!200 = !DILocation(line: 437, column: 28, scope: !201)
!201 = distinct !DILexicalBlock(scope: !195, file: !31, line: 435, column: 36)
!202 = !DILocation(line: 437, column: 36, scope: !201)
!203 = !DILocation(line: 437, column: 42, scope: !201)
!204 = !DILocation(line: 437, column: 51, scope: !201)
!205 = !DILocation(line: 437, column: 60, scope: !201)
!206 = !DILocation(line: 437, column: 68, scope: !201)
!207 = !DILocation(line: 436, column: 7, scope: !201)
!208 = !DILocation(line: 445, column: 18, scope: !183)
!209 = !DILocation(line: 445, column: 27, scope: !183)
!210 = !DILocation(line: 445, column: 4, scope: !183)
!211 = !DILocation(line: 446, column: 23, scope: !183)
!212 = !DILocation(line: 446, column: 29, scope: !183)
!213 = !DILocation(line: 446, column: 38, scope: !183)
!214 = !DILocation(line: 446, column: 4, scope: !183)
!215 = !DILocation(line: 447, column: 18, scope: !183)
!216 = !DILocation(line: 447, column: 27, scope: !183)
!217 = !DILocation(line: 447, column: 4, scope: !183)
!218 = !DILocation(line: 448, column: 1, scope: !183)
!219 = distinct !DISubprogram(name: "Atomic_Inc32", scope: !113, file: !113, line: 1636, type: !220, isLocal: true, isDefinition: true, scopeLine: 1637, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !140)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !222}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!223 = !DILocalVariable(name: "var", arg: 1, scope: !219, file: !113, line: 1636, type: !222)
!224 = !DILocation(line: 1636, column: 29, scope: !219)
!225 = !DILocation(line: 1645, column: 15, scope: !219)
!226 = !DILocation(line: 1645, column: 20, scope: !219)
!227 = !DILocation(line: 1643, column: 4, scope: !219)
!228 = !{i32 149736}
!229 = !DILocation(line: 1655, column: 1, scope: !219)
!230 = distinct !DISubprogram(name: "MXUserWaitInternal", scope: !31, file: !31, line: 265, type: !231, isLocal: true, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !140)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !74, !34, !40}
!233 = !DILocalVariable(name: "lock", arg: 1, scope: !230, file: !31, line: 265, type: !74)
!234 = !DILocation(line: 265, column: 31, scope: !230)
!235 = !DILocalVariable(name: "condVar", arg: 2, scope: !230, file: !31, line: 266, type: !34)
!236 = !DILocation(line: 266, column: 35, scope: !230)
!237 = !DILocalVariable(name: "waitTimeMsec", arg: 3, scope: !230, file: !31, line: 267, type: !40)
!238 = !DILocation(line: 267, column: 27, scope: !230)
!239 = !DILocalVariable(name: "err", scope: !230, file: !31, line: 269, type: !87)
!240 = !DILocation(line: 269, column: 8, scope: !230)
!241 = !DILocalVariable(name: "lockCount", scope: !230, file: !31, line: 270, type: !87)
!242 = !DILocation(line: 270, column: 8, scope: !230)
!243 = !DILocation(line: 270, column: 35, scope: !230)
!244 = !DILocation(line: 270, column: 20, scope: !230)
!245 = !DILocation(line: 280, column: 22, scope: !230)
!246 = !DILocation(line: 280, column: 28, scope: !230)
!247 = !DILocation(line: 280, column: 4, scope: !230)
!248 = !DILocation(line: 282, column: 8, scope: !249)
!249 = distinct !DILexicalBlock(scope: !230, file: !31, line: 282, column: 8)
!250 = !DILocation(line: 282, column: 21, scope: !249)
!251 = !DILocation(line: 282, column: 8, scope: !230)
!252 = !DILocation(line: 283, column: 32, scope: !253)
!253 = distinct !DILexicalBlock(scope: !249, file: !31, line: 282, column: 36)
!254 = !DILocation(line: 283, column: 41, scope: !253)
!255 = !DILocation(line: 283, column: 54, scope: !253)
!256 = !DILocation(line: 283, column: 60, scope: !253)
!257 = !DILocation(line: 283, column: 13, scope: !253)
!258 = !DILocation(line: 283, column: 11, scope: !253)
!259 = !DILocation(line: 284, column: 4, scope: !253)
!260 = !DILocalVariable(name: "curTime", scope: !261, file: !31, line: 285, type: !262)
!261 = distinct !DILexicalBlock(scope: !249, file: !31, line: 284, column: 11)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !263, line: 30, size: 128, align: 64, elements: !264)
!263 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line483")
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !262, file: !263, line: 32, baseType: !24, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !262, file: !263, line: 33, baseType: !267, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !25, line: 141, baseType: !26)
!268 = !DILocation(line: 285, column: 22, scope: !261)
!269 = !DILocalVariable(name: "endTime", scope: !261, file: !31, line: 286, type: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !23, line: 120, size: 128, align: 64, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !270, file: !23, line: 122, baseType: !24, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !270, file: !23, line: 123, baseType: !274, size: 64, align: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !25, line: 175, baseType: !26)
!275 = !DILocation(line: 286, column: 23, scope: !261)
!276 = !DILocalVariable(name: "endNS", scope: !261, file: !31, line: 287, type: !17)
!277 = !DILocation(line: 287, column: 14, scope: !261)
!278 = !DILocation(line: 295, column: 7, scope: !261)
!279 = !DILocation(line: 296, column: 33, scope: !261)
!280 = !DILocation(line: 296, column: 40, scope: !261)
!281 = !DILocation(line: 297, column: 33, scope: !261)
!282 = !DILocation(line: 297, column: 41, scope: !261)
!283 = !DILocation(line: 296, column: 64, scope: !261)
!284 = !DILocation(line: 298, column: 25, scope: !261)
!285 = !DILocation(line: 298, column: 16, scope: !261)
!286 = !DILocation(line: 298, column: 38, scope: !261)
!287 = !DILocation(line: 297, column: 49, scope: !261)
!288 = !DILocation(line: 296, column: 13, scope: !261)
!289 = !DILocation(line: 300, column: 34, scope: !261)
!290 = !DILocation(line: 300, column: 40, scope: !261)
!291 = !DILocation(line: 300, column: 15, scope: !261)
!292 = !DILocation(line: 300, column: 22, scope: !261)
!293 = !DILocation(line: 301, column: 37, scope: !261)
!294 = !DILocation(line: 301, column: 43, scope: !261)
!295 = !DILocation(line: 301, column: 15, scope: !261)
!296 = !DILocation(line: 301, column: 23, scope: !261)
!297 = !DILocation(line: 304, column: 37, scope: !261)
!298 = !DILocation(line: 304, column: 46, scope: !261)
!299 = !DILocation(line: 304, column: 59, scope: !261)
!300 = !DILocation(line: 304, column: 65, scope: !261)
!301 = !DILocation(line: 304, column: 13, scope: !261)
!302 = !DILocation(line: 304, column: 11, scope: !261)
!303 = !DILocation(line: 308, column: 22, scope: !230)
!304 = !DILocation(line: 308, column: 28, scope: !230)
!305 = !DILocation(line: 308, column: 4, scope: !230)
!306 = !DILocation(line: 310, column: 8, scope: !307)
!307 = distinct !DILexicalBlock(scope: !230, file: !31, line: 310, column: 8)
!308 = !DILocation(line: 310, column: 12, scope: !307)
!309 = !DILocation(line: 310, column: 8, scope: !230)
!310 = !DILocation(line: 311, column: 11, scope: !311)
!311 = distinct !DILexicalBlock(scope: !312, file: !31, line: 311, column: 11)
!312 = distinct !DILexicalBlock(scope: !307, file: !31, line: 310, column: 18)
!313 = !DILocation(line: 311, column: 15, scope: !311)
!314 = !DILocation(line: 311, column: 11, scope: !312)
!315 = !DILocation(line: 312, column: 72, scope: !316)
!316 = distinct !DILexicalBlock(scope: !311, file: !31, line: 311, column: 28)
!317 = !DILocation(line: 313, column: 16, scope: !316)
!318 = !DILocation(line: 313, column: 25, scope: !316)
!319 = !DILocation(line: 313, column: 34, scope: !316)
!320 = !DILocation(line: 313, column: 42, scope: !316)
!321 = !DILocation(line: 312, column: 10, scope: !316)
!322 = !DILocation(line: 315, column: 4, scope: !312)
!323 = !DILocation(line: 316, column: 1, scope: !230)
!324 = distinct !DISubprogram(name: "Atomic_Dec32", scope: !113, file: !113, line: 1676, type: !220, isLocal: true, isDefinition: true, scopeLine: 1677, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !140)
!325 = !DILocalVariable(name: "var", arg: 1, scope: !324, file: !113, line: 1676, type: !222)
!326 = !DILocation(line: 1676, column: 29, scope: !324)
!327 = !DILocation(line: 1685, column: 15, scope: !324)
!328 = !DILocation(line: 1685, column: 20, scope: !324)
!329 = !DILocation(line: 1683, column: 4, scope: !324)
!330 = !{i32 150026}
!331 = !DILocation(line: 1695, column: 1, scope: !324)
!332 = distinct !DISubprogram(name: "MXUser_SignalCondVar", scope: !31, file: !31, line: 469, type: !333, isLocal: false, isDefinition: true, scopeLine: 470, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !140)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !34}
