; ModuleID = './xferlogs.o.i'
source_filename = "./xferlogs.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@vm_version = constant [20 x i8] c"version=10.3.0.5330\00", section ".modinfo", align 16
@.str = private unnamed_addr constant [3 x i8] c"-h\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"--help\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"enc\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"dec\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"upd\00", align 1
@.str.5 = private unnamed_addr constant [26 x i8] c"tools.vmsupport.status %d\00", align 1
@.str.6 = private unnamed_addr constant [31 x i8] c"xferlogs <options> <filename>\0A\00", align 1
@.str.7 = private unnamed_addr constant [10 x i8] c"options:\0A\00", align 1
@.str.8 = private unnamed_addr constant [35 x i8] c"\09-h | --help - prints this usage.\0A\00", align 1
@.str.9 = private unnamed_addr constant [57 x i8] c"\09enc - encodes and transfers <filename> to the VMX log.\0A\00", align 1

!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!22 = !DILocalVariable(name: "argc", arg: 1, scope: !16, file: !7, line: 283, type: !19)
!23 = !DIExpression()
!24 = !DILocation(line: 283, column: 10, scope: !16)
!25 = !DILocalVariable(name: "argv", arg: 2, scope: !16, file: !7, line: 284, type: !20)
!26 = !DILocation(line: 284, column: 12, scope: !16)
!27 = !DILocalVariable(name: "status", scope: !16, file: !7, line: 286, type: !19)
!28 = !DILocation(line: 286, column: 8, scope: !16)
!29 = !DILocation(line: 288, column: 8, scope: !30)
!30 = distinct !DILexicalBlock(scope: !16, file: !7, line: 288, column: 8)
!31 = !DILocation(line: 288, column: 13, scope: !30)
!32 = !DILocation(line: 288, column: 18, scope: !30)
!33 = !DILocation(line: 289, column: 18, scope: !30)
!34 = !DILocation(line: 289, column: 10, scope: !30)
!35 = !DILocation(line: 289, column: 36, scope: !30)
!36 = !DILocation(line: 290, column: 18, scope: !30)
!37 = !DILocation(line: 290, column: 10, scope: !30)
!38 = !DILocation(line: 288, column: 8, scope: !39)
!39 = !DILexicalBlockFile(scope: !16, file: !7, discriminator: 1)
!40 = !DILocation(line: 291, column: 7, scope: !41)
!41 = distinct !DILexicalBlock(scope: !30, file: !7, line: 290, column: 42)
!42 = !DILocation(line: 292, column: 7, scope: !41)
!43 = !DILocation(line: 295, column: 8, scope: !44)
!44 = distinct !DILexicalBlock(scope: !16, file: !7, line: 295, column: 8)
!45 = !DILocation(line: 295, column: 13, scope: !44)
!46 = !DILocation(line: 295, column: 8, scope: !16)
!47 = !DILocation(line: 296, column: 7, scope: !48)
!48 = distinct !DILexicalBlock(scope: !44, file: !7, line: 295, column: 19)
!49 = !DILocation(line: 297, column: 7, scope: !48)
!50 = !DILocation(line: 300, column: 17, scope: !51)
!51 = distinct !DILexicalBlock(scope: !16, file: !7, line: 300, column: 8)
!52 = !DILocation(line: 300, column: 9, scope: !51)
!53 = !DILocation(line: 300, column: 8, scope: !16)
!54 = !DILocation(line: 301, column: 16, scope: !55)
!55 = distinct !DILexicalBlock(scope: !51, file: !7, line: 300, column: 37)
!56 = !DILocation(line: 301, column: 7, scope: !55)
!57 = !DILocation(line: 302, column: 4, scope: !55)
!58 = !DILocation(line: 302, column: 24, scope: !59)
!59 = !DILexicalBlockFile(scope: !60, file: !7, discriminator: 1)
!60 = distinct !DILexicalBlock(scope: !51, file: !7, line: 302, column: 15)
!61 = !DILocation(line: 302, column: 16, scope: !59)
!62 = !DILocation(line: 302, column: 15, scope: !59)
!63 = !DILocation(line: 303, column: 19, scope: !64)
!64 = distinct !DILexicalBlock(scope: !60, file: !7, line: 302, column: 44)
!65 = !DILocation(line: 303, column: 7, scope: !64)
!66 = !DILocation(line: 304, column: 4, scope: !64)
!67 = !DILocation(line: 304, column: 24, scope: !68)
!68 = !DILexicalBlockFile(scope: !69, file: !7, discriminator: 1)
!69 = distinct !DILexicalBlock(scope: !60, file: !7, line: 304, column: 15)
!70 = !DILocation(line: 304, column: 16, scope: !68)
!71 = !DILocation(line: 304, column: 15, scope: !68)
!72 = !DILocation(line: 305, column: 37, scope: !73)
!73 = distinct !DILexicalBlock(scope: !74, file: !7, line: 305, column: 11)
!74 = distinct !DILexicalBlock(scope: !69, file: !7, line: 304, column: 44)
!75 = !DILocation(line: 305, column: 11, scope: !73)
!76 = !DILocation(line: 305, column: 11, scope: !74)
!77 = !DILocation(line: 306, column: 68, scope: !78)
!78 = distinct !DILexicalBlock(scope: !73, file: !7, line: 305, column: 47)
!79 = !DILocation(line: 306, column: 10, scope: !78)
!80 = !DILocation(line: 307, column: 7, scope: !78)
!81 = !DILocation(line: 308, column: 10, scope: !82)
!82 = distinct !DILexicalBlock(scope: !73, file: !7, line: 307, column: 14)
!83 = !DILocation(line: 310, column: 4, scope: !74)
!84 = !DILocation(line: 311, column: 7, scope: !85)
!85 = distinct !DILexicalBlock(scope: !69, file: !7, line: 310, column: 11)
!86 = !DILocation(line: 312, column: 7, scope: !85)
!87 = !DILocation(line: 314, column: 4, scope: !16)
!88 = !DILocation(line: 315, column: 1, scope: !16)
!89 = distinct !DISubprogram(name: "usage", scope: !7, file: !7, line: 272, type: !90, isLocal: true, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!90 = !DISubroutineType(types: !91)
!91 = !{null}
!92 = !DILocation(line: 274, column: 4, scope: !89)
!93 = !DILocation(line: 275, column: 4, scope: !89)
!94 = !DILocation(line: 276, column: 4, scope: !89)
!95 = !DILocation(line: 277, column: 4, scope: !89)
!96 = !DILocation(line: 278, column: 4, scope: !89)
!97 = !DILocation(line: 279, column: 1, scope: !89)
!98 = distinct !DISubprogram(name: "xmitFile", scope: !7, file: !7, line: 103, type: !99, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !21}
!101 = !DILocalVariable(name: "filename", arg: 1, scope: !98, file: !7, line: 103, type: !21)
!102 = !DILocation(line: 103, column: 16, scope: !98)
!103 = !DILocalVariable(name: "fp", scope: !98, file: !7, line: 105, type: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !106, line: 48, baseType: !107)
!106 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1655")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !108, line: 241, size: 1728, align: 64, elements: !109)
!108 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1655")
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !130, !131, !132, !133, !137, !139, !141, !145, !148, !150, !151, !152, !153, !154, !158, !159}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !107, file: !108, line: 242, baseType: !19, size: 32, align: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !107, file: !108, line: 247, baseType: !21, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !107, file: !108, line: 248, baseType: !21, size: 64, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !107, file: !108, line: 249, baseType: !21, size: 64, align: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !107, file: !108, line: 250, baseType: !21, size: 64, align: 64, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !107, file: !108, line: 251, baseType: !21, size: 64, align: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !107, file: !108, line: 252, baseType: !21, size: 64, align: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !107, file: !108, line: 253, baseType: !21, size: 64, align: 64, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !107, file: !108, line: 254, baseType: !21, size: 64, align: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !107, file: !108, line: 256, baseType: !21, size: 64, align: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !107, file: !108, line: 257, baseType: !21, size: 64, align: 64, offset: 640)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !107, file: !108, line: 258, baseType: !21, size: 64, align: 64, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !107, file: !108, line: 260, baseType: !123, size: 64, align: 64, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !108, line: 156, size: 192, align: 64, elements: !125)
!125 = !{!126, !127, !129}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !124, file: !108, line: 157, baseType: !123, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !124, file: !108, line: 158, baseType: !128, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !124, file: !108, line: 162, baseType: !19, size: 32, align: 32, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !107, file: !108, line: 262, baseType: !128, size: 64, align: 64, offset: 832)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !107, file: !108, line: 264, baseType: !19, size: 32, align: 32, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !107, file: !108, line: 268, baseType: !19, size: 32, align: 32, offset: 928)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !107, file: !108, line: 270, baseType: !134, size: 64, align: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !135, line: 131, baseType: !136)
!135 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1655")
!136 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !107, file: !108, line: 274, baseType: !138, size: 16, align: 16, offset: 1024)
!138 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !107, file: !108, line: 275, baseType: !140, size: 8, align: 8, offset: 1040)
!140 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !107, file: !108, line: 276, baseType: !142, size: 8, align: 8, offset: 1048)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, align: 8, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 1)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !107, file: !108, line: 280, baseType: !146, size: 64, align: 64, offset: 1088)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !108, line: 150, baseType: null)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !107, file: !108, line: 289, baseType: !149, size: 64, align: 64, offset: 1152)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !135, line: 132, baseType: !136)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !107, file: !108, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !107, file: !108, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !107, file: !108, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !107, file: !108, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !107, file: !108, line: 302, baseType: !155, size: 64, align: 64, offset: 1472)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !156, line: 216, baseType: !157)
!156 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1655")
!157 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !107, file: !108, line: 303, baseType: !19, size: 32, align: 32, offset: 1536)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !107, file: !108, line: 305, baseType: !160, size: 160, align: 8, offset: 1568)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, align: 8, elements: !11)
!161 = !DILocation(line: 105, column: 10, scope: !98)
!162 = !DILocalVariable(name: "readLen", scope: !98, file: !7, line: 106, type: !155)
!163 = !DILocation(line: 106, column: 11, scope: !98)
!164 = !DILocalVariable(name: "buf", scope: !98, file: !7, line: 107, type: !165)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 456, align: 8, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 57)
!168 = !DILocation(line: 107, column: 9, scope: !98)
!169 = !DILocalVariable(name: "base64B", scope: !98, file: !7, line: 113, type: !170)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 912, align: 8, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 114)
!173 = !DILocation(line: 113, column: 9, scope: !98)
!174 = !DILocalVariable(name: "base64Buf", scope: !98, file: !7, line: 114, type: !21)
!175 = !DILocation(line: 114, column: 10, scope: !98)
!176 = !DILocation(line: 114, column: 22, scope: !98)
!177 = !DILocation(line: 114, column: 30, scope: !98)
!178 = !DILocation(line: 116, column: 21, scope: !179)
!179 = distinct !DILexicalBlock(scope: !98, file: !7, line: 116, column: 8)
!180 = !DILocation(line: 116, column: 15, scope: !179)
!181 = !DILocation(line: 116, column: 13, scope: !179)
!182 = !DILocation(line: 116, column: 8, scope: !98)
!183 = !DILocation(line: 117, column: 57, scope: !184)
!184 = distinct !DILexicalBlock(scope: !179, file: !7, line: 116, column: 39)
!185 = !DILocation(line: 117, column: 68, scope: !184)
!186 = !DILocation(line: 117, column: 67, scope: !184)
!187 = !DILocation(line: 117, column: 7, scope: !188)
!188 = !DILexicalBlockFile(scope: !184, file: !7, discriminator: 1)
!189 = !DILocation(line: 118, column: 7, scope: !184)
!190 = !DILocation(line: 122, column: 55, scope: !98)
!191 = !DILocation(line: 122, column: 4, scope: !98)
!192 = !DILocation(line: 123, column: 4, scope: !98)
!193 = !DILocation(line: 123, column: 28, scope: !194)
!194 = !DILexicalBlockFile(scope: !98, file: !7, discriminator: 1)
!195 = !DILocation(line: 123, column: 48, scope: !194)
!196 = !DILocation(line: 123, column: 22, scope: !194)
!197 = !DILocation(line: 123, column: 20, scope: !194)
!198 = !DILocation(line: 123, column: 53, scope: !194)
!199 = !DILocation(line: 123, column: 4, scope: !194)
!200 = !DILocation(line: 124, column: 25, scope: !201)
!201 = distinct !DILexicalBlock(scope: !202, file: !7, line: 124, column: 11)
!202 = distinct !DILexicalBlock(scope: !98, file: !7, line: 123, column: 59)
!203 = !DILocation(line: 124, column: 30, scope: !201)
!204 = !DILocation(line: 124, column: 39, scope: !201)
!205 = !DILocation(line: 124, column: 11, scope: !201)
!206 = !DILocation(line: 124, column: 11, scope: !202)
!207 = !DILocation(line: 125, column: 27, scope: !208)
!208 = distinct !DILexicalBlock(scope: !201, file: !7, line: 124, column: 76)
!209 = !DILocation(line: 125, column: 10, scope: !208)
!210 = !DILocation(line: 126, column: 7, scope: !208)
!211 = !DILocation(line: 127, column: 10, scope: !212)
!212 = distinct !DILexicalBlock(scope: !201, file: !7, line: 126, column: 14)
!213 = !DILocation(line: 128, column: 10, scope: !212)
!214 = !DILocation(line: 123, column: 4, scope: !215)
!215 = !DILexicalBlockFile(scope: !98, file: !7, discriminator: 2)
!216 = distinct !{!216, !192}
!217 = !DILocation(line: 123, column: 4, scope: !218)
!218 = !DILexicalBlockFile(scope: !98, file: !7, discriminator: 3)
!219 = !DILocation(line: 132, column: 4, scope: !98)
!220 = !DILocation(line: 133, column: 11, scope: !98)
!221 = !DILocation(line: 133, column: 4, scope: !98)
!222 = !DILocation(line: 134, column: 1, scope: !98)
