; ModuleID = './vmtoolsd-threadPool.o.i'
source_filename = "./vmtoolsd-threadPool.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ToolsServiceProperty = type { i8* }
%struct.ThreadPoolState = type { %struct.ToolsCorePool, i32, %struct.ToolsAppCtx*, %struct._GThreadPool*, %struct._GQueue*, %struct._GPtrArray*, %union._GMutex*, i32 }
%struct.ToolsCorePool = type { i32 (%struct.ToolsAppCtx*, void (%struct.ToolsAppCtx*, i8*)*, i8*, void (i8*)*)*, void (i32)*, i32 (%struct.ToolsAppCtx*, void (%struct.ToolsAppCtx*, i8*)*, void (%struct.ToolsAppCtx*, i8*)*, i8*, void (i8*)*)* }
%struct.ToolsAppCtx = type { i32, i8*, i32, i32, %struct._GMainLoop*, %struct._RpcChannel*, %struct._GKeyFile*, i32, i32, i8**, i8* }
%struct._GMainLoop = type opaque
%struct._RpcChannel = type opaque
%struct._GKeyFile = type opaque
%struct._GThreadPool = type { void (i8*, i8*)*, i8*, i32 }
%struct._GQueue = type { %struct._GList*, %struct._GList*, i32 }
%struct._GList = type { i8*, %struct._GList*, %struct._GList* }
%struct._GPtrArray = type { i8**, i32 }
%union._GMutex = type { i8* }
%struct._GError = type { i32, i32, i8* }
%struct.ToolsCoreService = type { %struct._GObject, %union._GMutex*, %struct._GArray* }
%struct._GObject = type { %struct._GTypeInstance, i32, %struct._GData* }
%struct._GTypeInstance = type { %struct._GTypeClass* }
%struct._GTypeClass = type { i64 }
%struct._GData = type opaque
%struct._GArray = type { i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !26, globals: !31)
!1 = !DIFile(filename: "vmtoolsd-threadPool.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!2 = !{!3, !7, !19}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 232, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/plugin.h", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!5 = !{!6}
!6 = !DIEnumerator(name: "TOOLS_CORE_API_V1", value: 1)
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 51, size: 32, align: 32, elements: !9)
!8 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!9 = !{!10, !11, !12, !13, !14, !15, !16, !17, !18}
!10 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!11 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!12 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!13 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!14 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!15 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!16 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!17 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!18 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 38, size: 32, align: 32, elements: !21)
!20 = !DIFile(filename: "/usr/include/glib-2.0/glib/deprecated/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "G_THREAD_PRIORITY_LOW", value: 0)
!23 = !DIEnumerator(name: "G_THREAD_PRIORITY_NORMAL", value: 1)
!24 = !DIEnumerator(name: "G_THREAD_PRIORITY_HIGH", value: 2)
!25 = !DIEnumerator(name: "G_THREAD_PRIORITY_URGENT", value: 3)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!31 = !{!32}
!32 = distinct !DIGlobalVariable(name: "gState", scope: !0, file: !33, line: 67, type: !34, isLocal: true, isDefinition: true, variable: %struct.ThreadPoolState* @gState)
!33 = !DIFile(filename: "threadPool.c", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadPoolState", file: !33, line: 45, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadPoolState", file: !33, line: 36, size: 640, align: 64, elements: !36)
!36 = !{!37, !101, !102, !103, !116, !133, !142, !153}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !35, file: !33, line: 37, baseType: !38, size: 192, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCorePool", file: !39, line: 77, baseType: !40)
!39 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/threadPool.h", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsCorePool", file: !39, line: 66, size: 192, align: 64, elements: !41)
!41 = !{!42, !93, !97}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !40, file: !39, line: 67, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!46, !49, !85, !84, !89}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !47, line: 55, baseType: !48)
!47 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!48 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCtx", file: !4, line: 274, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCtx", file: !4, line: 241, size: 576, align: 64, elements: !52)
!52 = !{!53, !55, !59, !63, !64, !69, !74, !79, !80, !81, !83}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !51, file: !4, line: 243, baseType: !54, size: 32, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreAPI", file: !4, line: 234, baseType: !3)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !51, file: !4, line: 245, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !47, line: 46, baseType: !30)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "isVMware", scope: !51, file: !4, line: 247, baseType: !60, size: 32, align: 32, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !47, line: 50, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !47, line: 49, baseType: !62)
!62 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "errorCode", scope: !51, file: !4, line: 249, baseType: !62, size: 32, align: 32, offset: 160)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mainLoop", scope: !51, file: !4, line: 251, baseType: !65, size: 64, align: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !67, line: 56, baseType: !68)
!67 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !67, line: 56, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !51, file: !4, line: 253, baseType: !70, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !72, line: 48, baseType: !73)
!72 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !72, line: 48, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !51, file: !4, line: 255, baseType: !75, size: 64, align: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !77, line: 48, baseType: !78)
!77 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !77, line: 48, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "blockFD", scope: !51, file: !4, line: 261, baseType: !62, size: 32, align: 32, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "uinputFD", scope: !51, file: !4, line: 263, baseType: !62, size: 32, align: 32, offset: 416)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !51, file: !4, line: 265, baseType: !82, size: 64, align: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "serviceObj", scope: !51, file: !4, line: 273, baseType: !84, size: 64, align: 64, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !47, line: 77, baseType: !27)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCorePoolCb", file: !39, line: 54, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !49, !84}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "GDestroyNotify", file: !47, line: 87, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !84}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !40, file: !39, line: 71, baseType: !94, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !46}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !40, file: !39, line: 72, baseType: !98, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!60, !49, !85, !85, !84, !89}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !35, file: !33, line: 38, baseType: !60, size: 32, align: 32, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !35, file: !33, line: 39, baseType: !49, size: 64, align: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !35, file: !33, line: 40, baseType: !104, size: 64, align: 64, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "GThreadPool", file: !106, line: 36, baseType: !107)
!106 = !DIFile(filename: "/usr/include/glib-2.0/glib/gthreadpool.h", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GThreadPool", file: !106, line: 41, size: 192, align: 64, elements: !108)
!108 = !{!109, !114, !115}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !107, file: !106, line: 43, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !47, line: 88, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !84, !84}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !107, file: !106, line: 44, baseType: !84, size: 64, align: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "exclusive", scope: !107, file: !106, line: 45, baseType: !60, size: 32, align: 32, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "workQueue", scope: !35, file: !33, line: 41, baseType: !117, size: 64, align: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQueue", file: !119, line: 36, baseType: !120)
!119 = !DIFile(filename: "/usr/include/glib-2.0/glib/gqueue.h", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GQueue", file: !119, line: 47, size: 192, align: 64, elements: !121)
!121 = !{!122, !131, !132}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !120, file: !119, line: 49, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !125, line: 37, baseType: !126)
!125 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !125, line: 39, size: 192, align: 64, elements: !127)
!127 = !{!128, !129, !130}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !125, line: 41, baseType: !84, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !126, file: !125, line: 42, baseType: !123, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !126, file: !125, line: 43, baseType: !123, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !120, file: !119, line: 50, baseType: !123, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !120, file: !119, line: 51, baseType: !46, size: 32, align: 32, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !35, file: !33, line: 42, baseType: !134, size: 64, align: 64, offset: 448)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPtrArray", file: !136, line: 39, baseType: !137)
!136 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GPtrArray", file: !136, line: 53, size: 128, align: 64, elements: !138)
!138 = !{!139, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !137, file: !136, line: 55, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !137, file: !136, line: 56, baseType: !46, size: 32, align: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !35, file: !33, line: 43, baseType: !143, size: 64, align: 64, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMutex", file: !145, line: 51, baseType: !146)
!145 = !DIFile(filename: "/usr/include/glib-2.0/glib/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!146 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GMutex", file: !145, line: 58, size: 64, align: 64, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !146, file: !145, line: 61, baseType: !84, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !146, file: !145, line: 62, baseType: !150, size: 64, align: 32)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 64, align: 32, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 2)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nextWorkId", scope: !35, file: !33, line: 44, baseType: !46, size: 32, align: 32, offset: 576)
!154 = !{i32 2, !"Dwarf Version", i32 4}
!155 = !{i32 2, !"Debug Info Version", i32 3}
!156 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!157 = distinct !DISubprogram(name: "ToolsCorePool_Init", scope: !33, file: !33, line: 477, type: !158, isLocal: false, isDefinition: true, scopeLine: 478, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !160)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !49}
!160 = !{}
!161 = !DILocalVariable(name: "ctx", arg: 1, scope: !157, file: !33, line: 477, type: !49)
!162 = !DIExpression()
!163 = !DILocation(line: 477, column: 33, scope: !157)
!164 = !DILocalVariable(name: "maxThreads", scope: !157, file: !33, line: 479, type: !61)
!165 = !DILocation(line: 479, column: 9, scope: !157)
!166 = !DILocalVariable(name: "err", scope: !157, file: !33, line: 480, type: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !169, line: 42, baseType: !170)
!169 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !169, line: 44, size: 128, align: 64, elements: !171)
!171 = !{!172, !177, !178}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !170, file: !169, line: 46, baseType: !173, size: 32, align: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !174, line: 36, baseType: !175)
!174 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !176, line: 45, baseType: !48)
!176 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line1391")
!177 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !170, file: !169, line: 47, baseType: !61, size: 32, align: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !170, file: !169, line: 48, baseType: !179, size: 64, align: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!180 = !DILocation(line: 480, column: 12, scope: !157)
!181 = !DILocalVariable(name: "prop", scope: !157, file: !33, line: 482, type: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsServiceProperty", file: !4, line: 468, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsServiceProperty", file: !4, line: 466, size: 64, align: 64, elements: !184)
!184 = !{!185}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !183, file: !4, line: 467, baseType: !28, size: 64, align: 64)
!186 = !DILocation(line: 482, column: 25, scope: !157)
!187 = !DILocation(line: 484, column: 24, scope: !157)
!188 = !DILocation(line: 485, column: 24, scope: !157)
!189 = !DILocation(line: 486, column: 23, scope: !157)
!190 = !DILocation(line: 487, column: 17, scope: !157)
!191 = !DILocation(line: 487, column: 15, scope: !157)
!192 = !DILocation(line: 489, column: 40, scope: !157)
!193 = !DILocation(line: 489, column: 45, scope: !157)
!194 = !DILocation(line: 489, column: 53, scope: !157)
!195 = !DILocation(line: 489, column: 58, scope: !157)
!196 = !DILocation(line: 489, column: 17, scope: !157)
!197 = !DILocation(line: 489, column: 15, scope: !157)
!198 = !DILocation(line: 491, column: 8, scope: !199)
!199 = distinct !DILexicalBlock(scope: !157, file: !33, line: 491, column: 8)
!200 = !DILocation(line: 491, column: 12, scope: !199)
!201 = !DILocation(line: 491, column: 8, scope: !157)
!202 = !DILocation(line: 492, column: 18, scope: !203)
!203 = distinct !DILexicalBlock(scope: !199, file: !33, line: 491, column: 20)
!204 = !DILocation(line: 493, column: 7, scope: !203)
!205 = !DILocation(line: 494, column: 4, scope: !203)
!206 = !DILocation(line: 496, column: 8, scope: !207)
!207 = distinct !DILexicalBlock(scope: !157, file: !33, line: 496, column: 8)
!208 = !DILocation(line: 496, column: 19, scope: !207)
!209 = !DILocation(line: 496, column: 8, scope: !157)
!210 = !DILocation(line: 498, column: 44, scope: !211)
!211 = distinct !DILexicalBlock(scope: !207, file: !33, line: 496, column: 24)
!212 = !DILocation(line: 497, column: 21, scope: !211)
!213 = !DILocation(line: 497, column: 19, scope: !211)
!214 = !DILocation(line: 499, column: 11, scope: !215)
!215 = distinct !DILexicalBlock(scope: !211, file: !33, line: 499, column: 11)
!216 = !DILocation(line: 499, column: 15, scope: !215)
!217 = !DILocation(line: 499, column: 11, scope: !211)
!218 = !DILocalVariable(name: "maxIdleTime", scope: !219, file: !33, line: 501, type: !61)
!219 = distinct !DILexicalBlock(scope: !215, file: !33, line: 499, column: 23)
!220 = !DILocation(line: 501, column: 15, scope: !219)
!221 = !DILocalVariable(name: "maxUnused", scope: !219, file: !33, line: 502, type: !61)
!222 = !DILocation(line: 502, column: 15, scope: !219)
!223 = !DILocation(line: 504, column: 47, scope: !219)
!224 = !DILocation(line: 504, column: 52, scope: !219)
!225 = !DILocation(line: 504, column: 60, scope: !219)
!226 = !DILocation(line: 504, column: 65, scope: !219)
!227 = !DILocation(line: 504, column: 24, scope: !219)
!228 = !DILocation(line: 504, column: 22, scope: !219)
!229 = !DILocation(line: 506, column: 14, scope: !230)
!230 = distinct !DILexicalBlock(scope: !219, file: !33, line: 506, column: 14)
!231 = !DILocation(line: 506, column: 18, scope: !230)
!232 = !DILocation(line: 506, column: 25, scope: !230)
!233 = !DILocation(line: 506, column: 28, scope: !234)
!234 = !DILexicalBlockFile(scope: !230, file: !33, discriminator: 1)
!235 = !DILocation(line: 506, column: 40, scope: !234)
!236 = !DILocation(line: 506, column: 14, scope: !234)
!237 = !DILocation(line: 507, column: 25, scope: !238)
!238 = distinct !DILexicalBlock(scope: !230, file: !33, line: 506, column: 46)
!239 = !DILocation(line: 508, column: 13, scope: !238)
!240 = !DILocation(line: 509, column: 10, scope: !238)
!241 = !DILocation(line: 511, column: 45, scope: !219)
!242 = !DILocation(line: 511, column: 50, scope: !219)
!243 = !DILocation(line: 511, column: 58, scope: !219)
!244 = !DILocation(line: 511, column: 63, scope: !219)
!245 = !DILocation(line: 511, column: 22, scope: !219)
!246 = !DILocation(line: 511, column: 20, scope: !219)
!247 = !DILocation(line: 513, column: 14, scope: !248)
!248 = distinct !DILexicalBlock(scope: !219, file: !33, line: 513, column: 14)
!249 = !DILocation(line: 513, column: 18, scope: !248)
!250 = !DILocation(line: 513, column: 25, scope: !248)
!251 = !DILocation(line: 513, column: 28, scope: !252)
!252 = !DILexicalBlockFile(scope: !248, file: !33, discriminator: 1)
!253 = !DILocation(line: 513, column: 38, scope: !252)
!254 = !DILocation(line: 513, column: 14, scope: !252)
!255 = !DILocation(line: 514, column: 23, scope: !256)
!256 = distinct !DILexicalBlock(scope: !248, file: !33, line: 513, column: 43)
!257 = !DILocation(line: 515, column: 13, scope: !256)
!258 = !DILocation(line: 516, column: 10, scope: !256)
!259 = !DILocation(line: 518, column: 42, scope: !219)
!260 = !DILocation(line: 518, column: 10, scope: !219)
!261 = !DILocation(line: 519, column: 47, scope: !219)
!262 = !DILocation(line: 519, column: 10, scope: !219)
!263 = !DILocation(line: 521, column: 7, scope: !219)
!264 = !DILocation(line: 522, column: 113, scope: !265)
!265 = distinct !DILexicalBlock(scope: !215, file: !33, line: 521, column: 14)
!266 = !DILocation(line: 522, column: 118, scope: !265)
!267 = !DILocation(line: 522, column: 10, scope: !265)
!268 = !DILocation(line: 524, column: 10, scope: !265)
!269 = !DILocation(line: 526, column: 4, scope: !211)
!270 = !DILocation(line: 528, column: 18, scope: !157)
!271 = !DILocation(line: 529, column: 18, scope: !157)
!272 = !DILocation(line: 529, column: 16, scope: !157)
!273 = !DILocation(line: 530, column: 21, scope: !157)
!274 = !DILocation(line: 530, column: 19, scope: !157)
!275 = !DILocation(line: 531, column: 23, scope: !157)
!276 = !DILocation(line: 531, column: 21, scope: !157)
!277 = !DILocation(line: 533, column: 38, scope: !157)
!278 = !DILocation(line: 533, column: 43, scope: !157)
!279 = !DILocation(line: 533, column: 4, scope: !157)
!280 = !DILocation(line: 534, column: 17, scope: !157)
!281 = !DILocation(line: 534, column: 22, scope: !157)
!282 = !DILocation(line: 534, column: 4, scope: !157)
!283 = !DILocation(line: 535, column: 1, scope: !157)
!284 = distinct !DISubprogram(name: "ToolsCorePoolSubmit", scope: !33, file: !33, line: 290, type: !44, isLocal: true, isDefinition: true, scopeLine: 294, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !160)
!285 = !DILocalVariable(name: "ctx", arg: 1, scope: !284, file: !33, line: 290, type: !49)
!286 = !DILocation(line: 290, column: 34, scope: !284)
!287 = !DILocalVariable(name: "cb", arg: 2, scope: !284, file: !33, line: 291, type: !85)
!288 = !DILocation(line: 291, column: 37, scope: !284)
!289 = !DILocalVariable(name: "data", arg: 3, scope: !284, file: !33, line: 292, type: !84)
!290 = !DILocation(line: 292, column: 30, scope: !284)
!291 = !DILocalVariable(name: "dtor", arg: 4, scope: !284, file: !33, line: 293, type: !89)
!292 = !DILocation(line: 293, column: 36, scope: !284)
!293 = !DILocalVariable(name: "id", scope: !284, file: !33, line: 295, type: !46)
!294 = !DILocation(line: 295, column: 10, scope: !284)
!295 = !DILocalVariable(name: "task", scope: !284, file: !33, line: 296, type: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "WorkerTask", file: !33, line: 54, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WorkerTask", file: !33, line: 48, size: 256, align: 64, elements: !299)
!299 = !{!300, !301, !302, !303, !304}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !298, file: !33, line: 49, baseType: !46, size: 32, align: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "srcId", scope: !298, file: !33, line: 50, baseType: !46, size: 32, align: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !298, file: !33, line: 51, baseType: !85, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !298, file: !33, line: 52, baseType: !84, size: 64, align: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "dtor", scope: !298, file: !33, line: 53, baseType: !89, size: 64, align: 64, offset: 192)
!305 = !DILocation(line: 296, column: 16, scope: !284)
!306 = !DILocation(line: 296, column: 23, scope: !284)
!307 = !DILocation(line: 298, column: 4, scope: !284)
!308 = !DILocation(line: 298, column: 10, scope: !284)
!309 = !DILocation(line: 298, column: 16, scope: !284)
!310 = !DILocation(line: 299, column: 15, scope: !284)
!311 = !DILocation(line: 299, column: 4, scope: !284)
!312 = !DILocation(line: 299, column: 10, scope: !284)
!313 = !DILocation(line: 299, column: 13, scope: !284)
!314 = !DILocation(line: 300, column: 17, scope: !284)
!315 = !DILocation(line: 300, column: 4, scope: !284)
!316 = !DILocation(line: 300, column: 10, scope: !284)
!317 = !DILocation(line: 300, column: 15, scope: !284)
!318 = !DILocation(line: 301, column: 17, scope: !284)
!319 = !DILocation(line: 301, column: 4, scope: !284)
!320 = !DILocation(line: 301, column: 10, scope: !284)
!321 = !DILocation(line: 301, column: 15, scope: !284)
!322 = !DILocation(line: 303, column: 24, scope: !284)
!323 = !DILocation(line: 303, column: 4, scope: !284)
!324 = !DILocation(line: 305, column: 16, scope: !325)
!325 = distinct !DILexicalBlock(scope: !284, file: !33, line: 305, column: 8)
!326 = !DILocation(line: 305, column: 9, scope: !325)
!327 = !DILocation(line: 305, column: 8, scope: !284)
!328 = !DILocation(line: 306, column: 14, scope: !329)
!329 = distinct !DILexicalBlock(scope: !325, file: !33, line: 305, column: 24)
!330 = !DILocation(line: 306, column: 7, scope: !329)
!331 = !DILocation(line: 307, column: 7, scope: !329)
!332 = !DILocation(line: 317, column: 15, scope: !333)
!333 = distinct !DILexicalBlock(scope: !284, file: !33, line: 317, column: 8)
!334 = !DILocation(line: 317, column: 26, scope: !333)
!335 = !DILocation(line: 317, column: 30, scope: !333)
!336 = !DILocation(line: 317, column: 8, scope: !284)
!337 = !DILocation(line: 318, column: 7, scope: !338)
!338 = distinct !DILexicalBlock(scope: !333, file: !33, line: 317, column: 42)
!339 = !DILocation(line: 318, column: 13, scope: !338)
!340 = !DILocation(line: 318, column: 16, scope: !338)
!341 = !DILocation(line: 319, column: 25, scope: !338)
!342 = !DILocation(line: 320, column: 4, scope: !338)
!343 = !DILocation(line: 321, column: 18, scope: !344)
!344 = distinct !DILexicalBlock(scope: !333, file: !33, line: 320, column: 11)
!345 = !DILocation(line: 321, column: 7, scope: !344)
!346 = !DILocation(line: 321, column: 13, scope: !344)
!347 = !DILocation(line: 321, column: 16, scope: !344)
!348 = !DILocation(line: 324, column: 9, scope: !284)
!349 = !DILocation(line: 324, column: 15, scope: !284)
!350 = !DILocation(line: 324, column: 7, scope: !284)
!351 = !DILocation(line: 331, column: 29, scope: !284)
!352 = !DILocation(line: 331, column: 40, scope: !284)
!353 = !DILocation(line: 331, column: 4, scope: !284)
!354 = !DILocation(line: 333, column: 15, scope: !355)
!355 = distinct !DILexicalBlock(scope: !284, file: !33, line: 333, column: 8)
!356 = !DILocation(line: 333, column: 20, scope: !355)
!357 = !DILocation(line: 333, column: 8, scope: !284)
!358 = !DILocalVariable(name: "err", scope: !359, file: !33, line: 334, type: !167)
!359 = distinct !DILexicalBlock(scope: !355, file: !33, line: 333, column: 28)
!360 = !DILocation(line: 334, column: 15, scope: !359)
!361 = !DILocation(line: 337, column: 33, scope: !359)
!362 = !DILocation(line: 337, column: 7, scope: !359)
!363 = !DILocation(line: 338, column: 11, scope: !364)
!364 = distinct !DILexicalBlock(scope: !359, file: !33, line: 338, column: 11)
!365 = !DILocation(line: 338, column: 15, scope: !364)
!366 = !DILocation(line: 338, column: 11, scope: !359)
!367 = !DILocation(line: 339, column: 10, scope: !368)
!368 = distinct !DILexicalBlock(scope: !364, file: !33, line: 338, column: 23)
!369 = !DILocation(line: 341, column: 113, scope: !370)
!370 = distinct !DILexicalBlock(scope: !364, file: !33, line: 340, column: 14)
!371 = !DILocation(line: 341, column: 118, scope: !370)
!372 = !DILocation(line: 341, column: 10, scope: !370)
!373 = !DILocation(line: 343, column: 10, scope: !370)
!374 = !DILocation(line: 345, column: 4, scope: !359)
!375 = !DILocation(line: 350, column: 34, scope: !284)
!376 = !DILocation(line: 348, column: 18, scope: !284)
!377 = !DILocation(line: 348, column: 4, scope: !284)
!378 = !DILocation(line: 348, column: 10, scope: !284)
!379 = !DILocation(line: 348, column: 16, scope: !284)
!380 = !DILocation(line: 354, column: 26, scope: !284)
!381 = !DILocation(line: 354, column: 4, scope: !284)
!382 = !DILocation(line: 355, column: 11, scope: !284)
!383 = !DILocation(line: 355, column: 4, scope: !284)
!384 = distinct !DISubprogram(name: "ToolsCorePoolCancel", scope: !33, file: !33, line: 373, type: !95, isLocal: true, isDefinition: true, scopeLine: 374, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !160)
!385 = !DILocalVariable(name: "id", arg: 1, scope: !384, file: !33, line: 373, type: !46)
!386 = !DILocation(line: 373, column: 27, scope: !384)
!387 = !DILocalVariable(name: "taskLnk", scope: !384, file: !33, line: 375, type: !123)
!388 = !DILocation(line: 375, column: 11, scope: !384)
!389 = !DILocalVariable(name: "task", scope: !384, file: !33, line: 376, type: !296)
!390 = !DILocation(line: 376, column: 16, scope: !384)
!391 = !DILocalVariable(name: "search", scope: !384, file: !33, line: 377, type: !297)
!392 = !DILocation(line: 377, column: 15, scope: !384)
!393 = !DILocation(line: 377, column: 24, scope: !384)
!394 = !DILocation(line: 377, column: 26, scope: !384)
!395 = !DILocation(line: 379, column: 4, scope: !384)
!396 = distinct !{!396, !395}
!397 = !DILocation(line: 379, column: 12, scope: !398)
!398 = !DILexicalBlockFile(scope: !399, file: !33, discriminator: 1)
!399 = distinct !DILexicalBlock(scope: !400, file: !33, line: 379, column: 12)
!400 = distinct !DILexicalBlock(scope: !384, file: !33, line: 379, column: 6)
!401 = !DILocation(line: 379, column: 15, scope: !398)
!402 = !DILocation(line: 379, column: 23, scope: !403)
!403 = !DILexicalBlockFile(scope: !404, file: !33, discriminator: 2)
!404 = distinct !DILexicalBlock(scope: !399, file: !33, line: 379, column: 21)
!405 = !DILocation(line: 379, column: 32, scope: !406)
!406 = !DILexicalBlockFile(scope: !407, file: !33, discriminator: 3)
!407 = distinct !DILexicalBlock(scope: !399, file: !33, line: 379, column: 30)
!408 = !DILocation(line: 379, column: 110, scope: !406)
!409 = !DILocation(line: 379, column: 121, scope: !410)
!410 = !DILexicalBlockFile(scope: !400, file: !33, discriminator: 4)
!411 = !DILocation(line: 381, column: 24, scope: !384)
!412 = !DILocation(line: 381, column: 4, scope: !384)
!413 = !DILocation(line: 382, column: 16, scope: !414)
!414 = distinct !DILexicalBlock(scope: !384, file: !33, line: 382, column: 8)
!415 = !DILocation(line: 382, column: 9, scope: !414)
!416 = !DILocation(line: 382, column: 8, scope: !384)
!417 = !DILocation(line: 383, column: 7, scope: !418)
!418 = distinct !DILexicalBlock(scope: !414, file: !33, line: 382, column: 24)
!419 = !DILocation(line: 386, column: 41, scope: !384)
!420 = !DILocation(line: 386, column: 52, scope: !384)
!421 = !DILocation(line: 386, column: 14, scope: !384)
!422 = !DILocation(line: 386, column: 12, scope: !384)
!423 = !DILocation(line: 387, column: 8, scope: !424)
!424 = distinct !DILexicalBlock(scope: !384, file: !33, line: 387, column: 8)
!425 = !DILocation(line: 387, column: 16, scope: !424)
!426 = !DILocation(line: 387, column: 8, scope: !384)
!427 = !DILocation(line: 388, column: 14, scope: !428)
!428 = distinct !DILexicalBlock(scope: !424, file: !33, line: 387, column: 24)
!429 = !DILocation(line: 388, column: 23, scope: !428)
!430 = !DILocation(line: 388, column: 12, scope: !428)
!431 = !DILocation(line: 389, column: 34, scope: !428)
!432 = !DILocation(line: 389, column: 45, scope: !428)
!433 = !DILocation(line: 389, column: 7, scope: !428)
!434 = !DILocation(line: 390, column: 4, scope: !428)
!435 = !DILocation(line: 387, column: 28, scope: !436)
!436 = !DILexicalBlockFile(scope: !424, file: !33, discriminator: 1)
!437 = !DILocation(line: 393, column: 26, scope: !384)
!438 = !DILocation(line: 393, column: 4, scope: !384)
!439 = !DILocation(line: 395, column: 8, scope: !440)
!440 = distinct !DILexicalBlock(scope: !384, file: !33, line: 395, column: 8)
!441 = !DILocation(line: 395, column: 13, scope: !440)
!442 = !DILocation(line: 395, column: 8, scope: !384)
!443 = !DILocation(line: 396, column: 11, scope: !444)
!444 = distinct !DILexicalBlock(scope: !445, file: !33, line: 396, column: 11)
!445 = distinct !DILexicalBlock(scope: !440, file: !33, line: 395, column: 21)
!446 = !DILocation(line: 396, column: 17, scope: !444)
!447 = !DILocation(line: 396, column: 23, scope: !444)
!448 = !DILocation(line: 396, column: 11, scope: !445)
!449 = !DILocation(line: 397, column: 26, scope: !450)
!450 = distinct !DILexicalBlock(scope: !444, file: !33, line: 396, column: 28)
!451 = !DILocation(line: 397, column: 32, scope: !450)
!452 = !DILocation(line: 397, column: 10, scope: !450)
!453 = !DILocation(line: 398, column: 7, scope: !450)
!454 = !DILocation(line: 399, column: 35, scope: !455)
!455 = distinct !DILexicalBlock(scope: !444, file: !33, line: 398, column: 14)
!456 = !DILocation(line: 399, column: 10, scope: !455)
!457 = !DILocation(line: 401, column: 4, scope: !445)
!458 = !DILocation(line: 402, column: 1, scope: !384)
!459 = distinct !DISubprogram(name: "ToolsCorePoolStart", scope: !33, file: !33, line: 425, type: !99, isLocal: true, isDefinition: true, scopeLine: 430, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !160)
!460 = !DILocalVariable(name: "ctx", arg: 1, scope: !459, file: !33, line: 425, type: !49)
!461 = !DILocation(line: 425, column: 33, scope: !459)
!462 = !DILocalVariable(name: "cb", arg: 2, scope: !459, file: !33, line: 426, type: !85)
!463 = !DILocation(line: 426, column: 36, scope: !459)
!464 = !DILocalVariable(name: "interrupt", arg: 3, scope: !459, file: !33, line: 427, type: !85)
!465 = !DILocation(line: 427, column: 36, scope: !459)
!466 = !DILocalVariable(name: "data", arg: 4, scope: !459, file: !33, line: 428, type: !84)
!467 = !DILocation(line: 428, column: 29, scope: !459)
!468 = !DILocalVariable(name: "dtor", arg: 5, scope: !459, file: !33, line: 429, type: !89)
!469 = !DILocation(line: 429, column: 35, scope: !459)
!470 = !DILocalVariable(name: "err", scope: !459, file: !33, line: 431, type: !167)
!471 = !DILocation(line: 431, column: 12, scope: !459)
!472 = !DILocalVariable(name: "task", scope: !459, file: !33, line: 432, type: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "StandaloneTask", file: !33, line: 64, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StandaloneTask", file: !33, line: 57, size: 384, align: 64, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !495}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !475, file: !33, line: 58, baseType: !60, size: 32, align: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !475, file: !33, line: 59, baseType: !85, size: 64, align: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt", scope: !475, file: !33, line: 60, baseType: !85, size: 64, align: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !475, file: !33, line: 61, baseType: !84, size: 64, align: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !475, file: !33, line: 62, baseType: !482, size: 64, align: 64, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "GThread", file: !145, line: 49, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GThread", file: !20, line: 48, size: 192, align: 64, elements: !485)
!485 = !{!486, !491, !492, !493}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !484, file: !20, line: 51, baseType: !487, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "GThreadFunc", file: !145, line: 47, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!84, !84}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !484, file: !20, line: 52, baseType: !84, size: 64, align: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "joinable", scope: !484, file: !20, line: 53, baseType: !60, size: 32, align: 32, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !484, file: !20, line: 54, baseType: !494, size: 32, align: 32, offset: 160)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "GThreadPriority", file: !20, line: 44, baseType: !19)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dtor", scope: !475, file: !33, line: 63, baseType: !89, size: 64, align: 64, offset: 320)
!496 = !DILocation(line: 432, column: 20, scope: !459)
!497 = !DILocation(line: 434, column: 24, scope: !459)
!498 = !DILocation(line: 434, column: 4, scope: !459)
!499 = !DILocation(line: 435, column: 16, scope: !500)
!500 = distinct !DILexicalBlock(scope: !459, file: !33, line: 435, column: 8)
!501 = !DILocation(line: 435, column: 9, scope: !500)
!502 = !DILocation(line: 435, column: 8, scope: !459)
!503 = !DILocation(line: 436, column: 7, scope: !504)
!504 = distinct !DILexicalBlock(scope: !500, file: !33, line: 435, column: 24)
!505 = !DILocation(line: 439, column: 11, scope: !459)
!506 = !DILocation(line: 439, column: 9, scope: !459)
!507 = !DILocation(line: 440, column: 4, scope: !459)
!508 = !DILocation(line: 440, column: 10, scope: !459)
!509 = !DILocation(line: 440, column: 17, scope: !459)
!510 = !DILocation(line: 441, column: 15, scope: !459)
!511 = !DILocation(line: 441, column: 4, scope: !459)
!512 = !DILocation(line: 441, column: 10, scope: !459)
!513 = !DILocation(line: 441, column: 13, scope: !459)
!514 = !DILocation(line: 442, column: 22, scope: !459)
!515 = !DILocation(line: 442, column: 4, scope: !459)
!516 = !DILocation(line: 442, column: 10, scope: !459)
!517 = !DILocation(line: 442, column: 20, scope: !459)
!518 = !DILocation(line: 443, column: 17, scope: !459)
!519 = !DILocation(line: 443, column: 4, scope: !459)
!520 = !DILocation(line: 443, column: 10, scope: !459)
!521 = !DILocation(line: 443, column: 15, scope: !459)
!522 = !DILocation(line: 444, column: 17, scope: !459)
!523 = !DILocation(line: 444, column: 4, scope: !459)
!524 = !DILocation(line: 444, column: 10, scope: !459)
!525 = !DILocation(line: 444, column: 15, scope: !459)
!526 = !DILocation(line: 445, column: 59, scope: !459)
!527 = !DILocation(line: 445, column: 19, scope: !459)
!528 = !DILocation(line: 445, column: 4, scope: !459)
!529 = !DILocation(line: 445, column: 10, scope: !459)
!530 = !DILocation(line: 445, column: 17, scope: !459)
!531 = !DILocation(line: 447, column: 8, scope: !532)
!532 = distinct !DILexicalBlock(scope: !459, file: !33, line: 447, column: 8)
!533 = !DILocation(line: 447, column: 12, scope: !532)
!534 = !DILocation(line: 447, column: 8, scope: !459)
!535 = !DILocation(line: 448, column: 30, scope: !536)
!536 = distinct !DILexicalBlock(scope: !532, file: !33, line: 447, column: 20)
!537 = !DILocation(line: 448, column: 39, scope: !536)
!538 = !DILocation(line: 448, column: 7, scope: !536)
!539 = !DILocation(line: 449, column: 4, scope: !536)
!540 = !DILocation(line: 450, column: 78, scope: !541)
!541 = distinct !DILexicalBlock(scope: !532, file: !33, line: 449, column: 11)
!542 = !DILocation(line: 450, column: 83, scope: !541)
!543 = !DILocation(line: 450, column: 7, scope: !541)
!544 = !DILocation(line: 451, column: 7, scope: !541)
!545 = !DILocation(line: 452, column: 14, scope: !541)
!546 = !DILocation(line: 452, column: 7, scope: !541)
!547 = !DILocation(line: 453, column: 12, scope: !541)
!548 = !DILocation(line: 447, column: 24, scope: !549)
!549 = !DILexicalBlockFile(scope: !532, file: !33, discriminator: 1)
!550 = !DILocation(line: 457, column: 26, scope: !459)
!551 = !DILocation(line: 457, column: 4, scope: !459)
!552 = !DILocation(line: 458, column: 11, scope: !459)
!553 = !DILocation(line: 458, column: 16, scope: !459)
!554 = !DILocation(line: 458, column: 4, scope: !459)
!555 = distinct !DISubprogram(name: "ToolsCorePoolRunWorker", scope: !33, file: !33, line: 255, type: !112, isLocal: true, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !160)
!556 = !DILocalVariable(name: "state", arg: 1, scope: !555, file: !33, line: 255, type: !84)
!557 = !DILocation(line: 255, column: 33, scope: !555)
!558 = !DILocalVariable(name: "clientData", arg: 2, scope: !555, file: !33, line: 256, type: !84)
