; ModuleID = './[inter]src--.libs--matvar_cell.o.i'
source_filename = "./[inter]src--.libs--matvar_cell.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.matvar_t = type { i64, i32, i32, i32, i32, i32, i32, i32, i64*, i8*, i8*, i32, i32, %struct.matvar_internal* }
%struct.matvar_internal = type { i64, i32, i8**, %struct.z_stream_s*, i8* }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.internal_state = type opaque

; Function Attrs: nounwind uwtable
define %struct.matvar_t* @Mat_VarGetCell(%struct.matvar_t*, i32) #0 !dbg !132 {
  %3 = alloca %struct.matvar_t*, align 8
  %4 = alloca %struct.matvar_t*, align 8
  %5 = alloca i32, align 4
  %6 = alloca i64, align 8
  %7 = alloca %struct.matvar_t*, align 8
  store %struct.matvar_t* %0, %struct.matvar_t** %4, align 8
  call void @llvm.dbg.declare(metadata %struct.matvar_t** %4, metadata !137, metadata !138), !dbg !139
  store i32 %1, i32* %5, align 4
  call void @llvm.dbg.declare(metadata i32* %5, metadata !140, metadata !138), !dbg !141
  call void @llvm.dbg.declare(metadata i64* %6, metadata !142, metadata !138), !dbg !143
  store i64 1, i64* %6, align 8, !dbg !143
  call void @llvm.dbg.declare(metadata %struct.matvar_t** %7, metadata !144, metadata !138), !dbg !145
  store %struct.matvar_t* null, %struct.matvar_t** %7, align 8, !dbg !145

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !51)
!1 = !DIFile(filename: "[inter]src--.libs--matvar_cell.o.i", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!2 = !{!3, !27, !47}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "matio_types", file: !4, line: 77, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "matio.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!6 = !DIEnumerator(name: "MAT_T_UNKNOWN", value: 0)
!7 = !DIEnumerator(name: "MAT_T_INT8", value: 1)
!8 = !DIEnumerator(name: "MAT_T_UINT8", value: 2)
!9 = !DIEnumerator(name: "MAT_T_INT16", value: 3)
!10 = !DIEnumerator(name: "MAT_T_UINT16", value: 4)
!11 = !DIEnumerator(name: "MAT_T_INT32", value: 5)
!12 = !DIEnumerator(name: "MAT_T_UINT32", value: 6)
!13 = !DIEnumerator(name: "MAT_T_SINGLE", value: 7)
!14 = !DIEnumerator(name: "MAT_T_DOUBLE", value: 9)
!15 = !DIEnumerator(name: "MAT_T_INT64", value: 12)
!16 = !DIEnumerator(name: "MAT_T_UINT64", value: 13)
!17 = !DIEnumerator(name: "MAT_T_MATRIX", value: 14)
!18 = !DIEnumerator(name: "MAT_T_COMPRESSED", value: 15)
!19 = !DIEnumerator(name: "MAT_T_UTF8", value: 16)
!20 = !DIEnumerator(name: "MAT_T_UTF16", value: 17)
!21 = !DIEnumerator(name: "MAT_T_UTF32", value: 18)
!22 = !DIEnumerator(name: "MAT_T_STRING", value: 20)
!23 = !DIEnumerator(name: "MAT_T_CELL", value: 21)
!24 = !DIEnumerator(name: "MAT_T_STRUCT", value: 22)
!25 = !DIEnumerator(name: "MAT_T_ARRAY", value: 23)
!26 = !DIEnumerator(name: "MAT_T_FUNCTION", value: 24)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "matio_classes", file: !4, line: 107, size: 32, align: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!29 = !DIEnumerator(name: "MAT_C_EMPTY", value: 0)
!30 = !DIEnumerator(name: "MAT_C_CELL", value: 1)
!31 = !DIEnumerator(name: "MAT_C_STRUCT", value: 2)
!32 = !DIEnumerator(name: "MAT_C_OBJECT", value: 3)
!33 = !DIEnumerator(name: "MAT_C_CHAR", value: 4)
!34 = !DIEnumerator(name: "MAT_C_SPARSE", value: 5)
!35 = !DIEnumerator(name: "MAT_C_DOUBLE", value: 6)
!36 = !DIEnumerator(name: "MAT_C_SINGLE", value: 7)
!37 = !DIEnumerator(name: "MAT_C_INT8", value: 8)
!38 = !DIEnumerator(name: "MAT_C_UINT8", value: 9)
!39 = !DIEnumerator(name: "MAT_C_INT16", value: 10)
!40 = !DIEnumerator(name: "MAT_C_UINT16", value: 11)
!41 = !DIEnumerator(name: "MAT_C_INT32", value: 12)
!42 = !DIEnumerator(name: "MAT_C_UINT32", value: 13)
!43 = !DIEnumerator(name: "MAT_C_INT64", value: 14)
!44 = !DIEnumerator(name: "MAT_C_UINT64", value: 15)
!45 = !DIEnumerator(name: "MAT_C_FUNCTION", value: 16)
!46 = !DIEnumerator(name: "MAT_C_OPAQUE", value: 17)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "matio_compression", file: !4, line: 145, size: 32, align: 32, elements: !48)
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "MAT_COMPRESSION_NONE", value: 0)
!50 = !DIEnumerator(name: "MAT_COMPRESSION_ZLIB", value: 1)
!51 = !{!52, !53}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "matvar_t", file: !4, line: 200, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "matvar_t", file: !4, line: 185, size: 640, align: 64, elements: !57)
!57 = !{!58, !62, !64, !65, !66, !67, !68, !69, !70, !72, !75, !76, !77, !78}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !56, file: !4, line: 186, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !60, line: 216, baseType: !61)
!60 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!61 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !56, file: !4, line: 187, baseType: !63, size: 32, align: 32, offset: 64)
!63 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !56, file: !4, line: 188, baseType: !3, size: 32, align: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !56, file: !4, line: 189, baseType: !63, size: 32, align: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "class_type", scope: !56, file: !4, line: 190, baseType: !27, size: 32, align: 32, offset: 160)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "isComplex", scope: !56, file: !4, line: 191, baseType: !63, size: 32, align: 32, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "isGlobal", scope: !56, file: !4, line: 192, baseType: !63, size: 32, align: 32, offset: 224)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "isLogical", scope: !56, file: !4, line: 193, baseType: !63, size: 32, align: 32, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !56, file: !4, line: 194, baseType: !71, size: 64, align: 64, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !56, file: !4, line: 195, baseType: !73, size: 64, align: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !56, file: !4, line: 196, baseType: !52, size: 64, align: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mem_conserve", scope: !56, file: !4, line: 197, baseType: !63, size: 32, align: 32, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !56, file: !4, line: 198, baseType: !47, size: 32, align: 32, offset: 544)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !56, file: !4, line: 199, baseType: !79, size: 64, align: 64, offset: 576)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "matvar_internal", file: !81, line: 80, size: 320, align: 64, elements: !82)
!81 = !DIFile(filename: "matio_private.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!82 = !{!83, !85, !87, !89, !128}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "datapos", scope: !80, file: !81, line: 86, baseType: !84, size: 64, align: 64)
!84 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "num_fields", scope: !80, file: !81, line: 87, baseType: !86, size: 32, align: 32, offset: 64)
!86 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "fieldnames", scope: !80, file: !81, line: 88, baseType: !88, size: 64, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !80, file: !81, line: 90, baseType: !90, size: 64, align: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_streamp", file: !91, line: 108, baseType: !92)
!91 = !DIFile(filename: "/usr/local/include/zlib.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !91, line: 106, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !91, line: 86, size: 896, align: 64, elements: !95)
!95 = !{!96, !102, !104, !106, !107, !108, !109, !110, !113, !119, !124, !125, !126, !127}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !94, file: !91, line: 87, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !99, line: 400, baseType: !100)
!99 = !DIFile(filename: "/usr/local/include/zconf.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !99, line: 391, baseType: !101)
!101 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !94, file: !91, line: 88, baseType: !103, size: 32, align: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !99, line: 393, baseType: !86)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !94, file: !91, line: 89, baseType: !105, size: 64, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !99, line: 394, baseType: !61)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !94, file: !91, line: 91, baseType: !97, size: 64, align: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !94, file: !91, line: 92, baseType: !103, size: 32, align: 32, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !94, file: !91, line: 93, baseType: !105, size: 64, align: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !94, file: !91, line: 95, baseType: !73, size: 64, align: 64, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !94, file: !91, line: 96, baseType: !111, size: 64, align: 64, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !91, line: 84, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !94, file: !91, line: 98, baseType: !114, size: 64, align: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !91, line: 81, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !118, !103, !103}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !99, line: 409, baseType: !52)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !94, file: !91, line: 99, baseType: !120, size: 64, align: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !91, line: 82, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !118, !118}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !94, file: !91, line: 100, baseType: !118, size: 64, align: 64, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !94, file: !91, line: 102, baseType: !63, size: 32, align: 32, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !94, file: !91, line: 104, baseType: !105, size: 64, align: 64, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !94, file: !91, line: 105, baseType: !105, size: 64, align: 64, offset: 832)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !80, file: !81, line: 91, baseType: !52, size: 64, align: 64, offset: 256)
!129 = !{i32 2, !"Dwarf Version", i32 4}
!130 = !{i32 2, !"Debug Info Version", i32 3}
!131 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!132 = distinct !DISubprogram(name: "Mat_VarGetCell", scope: !133, file: !133, line: 41, type: !134, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !136)
!133 = !DIFile(filename: "matvar_cell.c", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!134 = !DISubroutineType(types: !135)
!135 = !{!54, !54, !63}
!136 = !{}
!137 = !DILocalVariable(name: "matvar", arg: 1, scope: !132, file: !133, line: 41, type: !54)
!138 = !DIExpression()
!139 = !DILocation(line: 41, column: 26, scope: !132)
!140 = !DILocalVariable(name: "index", arg: 2, scope: !132, file: !133, line: 41, type: !63)
!141 = !DILocation(line: 41, column: 37, scope: !132)
!142 = !DILocalVariable(name: "nelems", scope: !132, file: !133, line: 43, type: !59)
!143 = !DILocation(line: 43, column: 12, scope: !132)
!144 = !DILocalVariable(name: "cell", scope: !132, file: !133, line: 44, type: !54)
!145 = !DILocation(line: 44, column: 15, scope: !132)
!146 = !DILocation(line: 46, column: 10, scope: !147)
!147 = distinct !DILexicalBlock(scope: !132, file: !133, line: 46, column: 10)
!148 = !DILocation(line: 46, column: 17, scope: !147)
!149 = !DILocation(line: 46, column: 10, scope: !132)
!150 = !DILocation(line: 47, column: 9, scope: !147)
!151 = !DILocation(line: 49, column: 17, scope: !132)
!152 = !DILocation(line: 49, column: 5, scope: !132)
!153 = !DILocation(line: 51, column: 15, scope: !154)
!154 = distinct !DILexicalBlock(scope: !132, file: !133, line: 51, column: 10)
!155 = !DILocation(line: 51, column: 12, scope: !154)
!156 = !DILocation(line: 51, column: 21, scope: !154)
!157 = !DILocation(line: 51, column: 24, scope: !158)
!158 = !DILexicalBlockFile(scope: !154, file: !133, discriminator: 1)
!159 = !DILocation(line: 51, column: 32, scope: !158)
!160 = !DILocation(line: 51, column: 30, scope: !158)
!161 = !DILocation(line: 51, column: 10, scope: !158)
!162 = !DILocation(line: 52, column: 31, scope: !154)
!163 = !DILocation(line: 52, column: 39, scope: !154)
!164 = !DILocation(line: 52, column: 18, scope: !154)
!165 = !DILocation(line: 52, column: 46, scope: !154)
!166 = !DILocation(line: 52, column: 44, scope: !154)
!167 = !DILocation(line: 52, column: 16, scope: !154)
!168 = !DILocation(line: 52, column: 14, scope: !154)
!169 = !DILocation(line: 52, column: 9, scope: !154)
!170 = !DILocation(line: 54, column: 12, scope: !132)
!171 = !DILocation(line: 54, column: 5, scope: !132)
!172 = !DILocation(line: 55, column: 1, scope: !132)
!173 = distinct !DISubprogram(name: "Mat_VarGetCells", scope: !133, file: !133, line: 77, type: !174, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !136)
!174 = !DISubroutineType(types: !175)
!175 = !{!53, !54, !176, !176, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!177 = !DILocalVariable(name: "matvar", arg: 1, scope: !173, file: !133, line: 77, type: !54)
!178 = !DILocation(line: 77, column: 27, scope: !173)
!179 = !DILocalVariable(name: "start", arg: 2, scope: !173, file: !133, line: 77, type: !176)
!180 = !DILocation(line: 77, column: 39, scope: !173)
!181 = !DILocalVariable(name: "stride", arg: 3, scope: !173, file: !133, line: 77, type: !176)
!182 = !DILocation(line: 77, column: 50, scope: !173)
!183 = !DILocalVariable(name: "edge", arg: 4, scope: !173, file: !133, line: 77, type: !176)
!184 = !DILocation(line: 77, column: 62, scope: !173)
!185 = !DILocalVariable(name: "i", scope: !173, file: !133, line: 79, type: !63)
!186 = !DILocation(line: 79, column: 9, scope: !173)
!187 = !DILocalVariable(name: "j", scope: !173, file: !133, line: 79, type: !63)
