; ModuleID = './[inter]src--.libs--mat4.o.i'
source_filename = "./[inter]src--.libs--mat4.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._mat_t = type { i8*, i8*, i8*, i8*, i32, i32, i32, i64, i64, i64, i8** }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.matvar_t = type { i64, i32, i32, i32, i32, i32, i32, i32, i64*, i8*, i8*, i32, i32, %struct.matvar_internal* }
%struct.matvar_internal = type { i64, i32, i8**, %struct.z_stream_s*, i8* }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.internal_state = type opaque
%struct.Fmatrix = type { i32, i32, i32, i32, i32 }
%struct.mat_complex_split_t = type { i8*, i8* }
%struct.mat_sparse_t = type { i32, i32*, i32, i32*, i32, i32, i8* }
%union.anon = type { i32 }

@.str = private unnamed_addr constant [4 x i8] c"w+b\00", align 1
@.str.1 = private unnamed_addr constant [42 x i8] c"Couldn't allocate memory for the MAT file\00", align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.3 = private unnamed_addr constant [46 x i8] c"Couldn't allocate memory for the complex data\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !57)
!1 = !DIFile(filename: "[inter]src--.libs--mat4.o.i", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!2 = !{!3, !10, !33, !53}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mat_ft", file: !4, line: 65, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "matio.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "MAT_FT_MAT73", value: 512)
!7 = !DIEnumerator(name: "MAT_FT_MAT5", value: 256)
!8 = !DIEnumerator(name: "MAT_FT_MAT4", value: 16)
!9 = !DIEnumerator(name: "MAT_FT_UNDEFINED", value: 0)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "matio_types", file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32}
!12 = !DIEnumerator(name: "MAT_T_UNKNOWN", value: 0)
!13 = !DIEnumerator(name: "MAT_T_INT8", value: 1)
!14 = !DIEnumerator(name: "MAT_T_UINT8", value: 2)
!15 = !DIEnumerator(name: "MAT_T_INT16", value: 3)
!16 = !DIEnumerator(name: "MAT_T_UINT16", value: 4)
!17 = !DIEnumerator(name: "MAT_T_INT32", value: 5)
!18 = !DIEnumerator(name: "MAT_T_UINT32", value: 6)
!19 = !DIEnumerator(name: "MAT_T_SINGLE", value: 7)
!20 = !DIEnumerator(name: "MAT_T_DOUBLE", value: 9)
!21 = !DIEnumerator(name: "MAT_T_INT64", value: 12)
!22 = !DIEnumerator(name: "MAT_T_UINT64", value: 13)
!23 = !DIEnumerator(name: "MAT_T_MATRIX", value: 14)
!24 = !DIEnumerator(name: "MAT_T_COMPRESSED", value: 15)
!25 = !DIEnumerator(name: "MAT_T_UTF8", value: 16)
!26 = !DIEnumerator(name: "MAT_T_UTF16", value: 17)
!27 = !DIEnumerator(name: "MAT_T_UTF32", value: 18)
!28 = !DIEnumerator(name: "MAT_T_STRING", value: 20)
!29 = !DIEnumerator(name: "MAT_T_CELL", value: 21)
!30 = !DIEnumerator(name: "MAT_T_STRUCT", value: 22)
!31 = !DIEnumerator(name: "MAT_T_ARRAY", value: 23)
!32 = !DIEnumerator(name: "MAT_T_FUNCTION", value: 24)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "matio_classes", file: !4, line: 107, size: 32, align: 32, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!35 = !DIEnumerator(name: "MAT_C_EMPTY", value: 0)
!36 = !DIEnumerator(name: "MAT_C_CELL", value: 1)
!37 = !DIEnumerator(name: "MAT_C_STRUCT", value: 2)
!38 = !DIEnumerator(name: "MAT_C_OBJECT", value: 3)
!39 = !DIEnumerator(name: "MAT_C_CHAR", value: 4)
!40 = !DIEnumerator(name: "MAT_C_SPARSE", value: 5)
!41 = !DIEnumerator(name: "MAT_C_DOUBLE", value: 6)
!42 = !DIEnumerator(name: "MAT_C_SINGLE", value: 7)
!43 = !DIEnumerator(name: "MAT_C_INT8", value: 8)
!44 = !DIEnumerator(name: "MAT_C_UINT8", value: 9)
!45 = !DIEnumerator(name: "MAT_C_INT16", value: 10)
!46 = !DIEnumerator(name: "MAT_C_UINT16", value: 11)
!47 = !DIEnumerator(name: "MAT_C_INT32", value: 12)
!48 = !DIEnumerator(name: "MAT_C_UINT32", value: 13)
!49 = !DIEnumerator(name: "MAT_C_INT64", value: 14)
!50 = !DIEnumerator(name: "MAT_C_UINT64", value: 15)
!51 = !DIEnumerator(name: "MAT_C_FUNCTION", value: 16)
!52 = !DIEnumerator(name: "MAT_C_OPAQUE", value: 17)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "matio_compression", file: !4, line: 145, size: 32, align: 32, elements: !54)
!54 = !{!55, !56}
!55 = !DIEnumerator(name: "MAT_COMPRESSION_NONE", value: 0)
!56 = !DIEnumerator(name: "MAT_COMPRESSION_ZLIB", value: 1)
!57 = !{!58, !64, !83, !87, !142, !148, !66, !160, !162, !154, !77, !71, !167, !169, !173, !176, !75}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_t", file: !4, line: 175, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mat_t", file: !61, line: 58, size: 640, align: 64, elements: !62)
!61 = !DIFile(filename: "matio_private.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!62 = !{!63, !65, !68, !69, !70, !72, !73, !74, !76, !80, !81}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !60, file: !61, line: 59, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !60, file: !61, line: 60, baseType: !66, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "subsys_offset", scope: !60, file: !61, line: 61, baseType: !66, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !60, file: !61, line: 62, baseType: !66, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !60, file: !61, line: 63, baseType: !71, size: 32, align: 32, offset: 256)
!71 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "byteswap", scope: !60, file: !61, line: 64, baseType: !71, size: 32, align: 32, offset: 288)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !60, file: !61, line: 65, baseType: !71, size: 32, align: 32, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "bof", scope: !60, file: !61, line: 66, baseType: !75, size: 64, align: 64, offset: 384)
!75 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next_index", scope: !60, file: !61, line: 67, baseType: !77, size: 64, align: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !78, line: 216, baseType: !79)
!78 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!79 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "num_datasets", scope: !60, file: !61, line: 68, baseType: !77, size: 64, align: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !60, file: !61, line: 72, baseType: !82, size: 64, align: 64, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_int32_t", file: !84, line: 94, baseType: !85)
!84 = !DIFile(filename: "matio_pubconf.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !86, line: 196, baseType: !71)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !89, line: 48, baseType: !90)
!89 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !91, line: 241, size: 1728, align: 64, elements: !92)
!91 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!92 = !{!93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !113, !114, !115, !116, !119, !121, !123, !127, !130, !132, !133, !134, !135, !136, !137, !138}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !90, file: !91, line: 242, baseType: !71, size: 32, align: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !90, file: !91, line: 247, baseType: !66, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !90, file: !91, line: 248, baseType: !66, size: 64, align: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !90, file: !91, line: 249, baseType: !66, size: 64, align: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !90, file: !91, line: 250, baseType: !66, size: 64, align: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !90, file: !91, line: 251, baseType: !66, size: 64, align: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !90, file: !91, line: 252, baseType: !66, size: 64, align: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !90, file: !91, line: 253, baseType: !66, size: 64, align: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !90, file: !91, line: 254, baseType: !66, size: 64, align: 64, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !90, file: !91, line: 256, baseType: !66, size: 64, align: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !90, file: !91, line: 257, baseType: !66, size: 64, align: 64, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !90, file: !91, line: 258, baseType: !66, size: 64, align: 64, offset: 704)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !90, file: !91, line: 260, baseType: !106, size: 64, align: 64, offset: 768)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !91, line: 156, size: 192, align: 64, elements: !108)
!108 = !{!109, !110, !112}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !107, file: !91, line: 157, baseType: !106, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !107, file: !91, line: 158, baseType: !111, size: 64, align: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !107, file: !91, line: 162, baseType: !71, size: 32, align: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !90, file: !91, line: 262, baseType: !111, size: 64, align: 64, offset: 832)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !90, file: !91, line: 264, baseType: !71, size: 32, align: 32, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !90, file: !91, line: 268, baseType: !71, size: 32, align: 32, offset: 928)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !90, file: !91, line: 270, baseType: !117, size: 64, align: 64, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !118, line: 131, baseType: !75)
!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !90, file: !91, line: 274, baseType: !120, size: 16, align: 16, offset: 1024)
!120 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !90, file: !91, line: 275, baseType: !122, size: 8, align: 8, offset: 1040)
!122 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !90, file: !91, line: 276, baseType: !124, size: 8, align: 8, offset: 1048)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 8, align: 8, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 1)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !90, file: !91, line: 280, baseType: !128, size: 64, align: 64, offset: 1088)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !91, line: 150, baseType: null)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !90, file: !91, line: 289, baseType: !131, size: 64, align: 64, offset: 1152)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !118, line: 132, baseType: !75)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !90, file: !91, line: 297, baseType: !64, size: 64, align: 64, offset: 1216)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !90, file: !91, line: 298, baseType: !64, size: 64, align: 64, offset: 1280)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !90, file: !91, line: 299, baseType: !64, size: 64, align: 64, offset: 1344)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !90, file: !91, line: 300, baseType: !64, size: 64, align: 64, offset: 1408)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !90, file: !91, line: 302, baseType: !77, size: 64, align: 64, offset: 1472)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !90, file: !91, line: 303, baseType: !71, size: 32, align: 32, offset: 1536)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !90, file: !91, line: 305, baseType: !139, size: 160, align: 8, offset: 1568)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 160, align: 8, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 20)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_complex_split_t", file: !4, line: 168, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mat_complex_split_t", file: !4, line: 165, size: 128, align: 64, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "Re", scope: !144, file: !4, line: 166, baseType: !64, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Im", scope: !144, file: !4, line: 167, baseType: !64, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_sparse_t", file: !4, line: 220, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mat_sparse_t", file: !4, line: 207, size: 384, align: 64, elements: !151)
!151 = !{!152, !153, !155, !156, !157, !158, !159}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nzmax", scope: !150, file: !4, line: 208, baseType: !71, size: 32, align: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ir", scope: !150, file: !4, line: 209, baseType: !154, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nir", scope: !150, file: !4, line: 212, baseType: !71, size: 32, align: 32, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "jc", scope: !150, file: !4, line: 213, baseType: !154, size: 64, align: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "njc", scope: !150, file: !4, line: 217, baseType: !71, size: 32, align: 32, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ndata", scope: !150, file: !4, line: 218, baseType: !71, size: 32, align: 32, offset: 288)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !150, file: !4, line: 219, baseType: !64, size: 64, align: 64, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_uint8_t", file: !84, line: 109, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !165, line: 48, baseType: !166)
!165 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!166 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_int16_t", file: !84, line: 100, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !86, line: 195, baseType: !172)
!172 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_uint16_t", file: !84, line: 103, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !165, line: 49, baseType: !120)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!177 = !{i32 2, !"Dwarf Version", i32 4}
!178 = !{i32 2, !"Debug Info Version", i32 3}
!179 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!180 = distinct !DISubprogram(name: "Mat_Create4", scope: !181, file: !181, line: 53, type: !182, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !186)
!181 = !DIFile(filename: "mat4.c", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!182 = !DISubroutineType(types: !183)
!183 = !{!58, !184}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!186 = !{}
!187 = !DILocalVariable(name: "matname", arg: 1, scope: !180, file: !181, line: 53, type: !184)
!188 = !DIExpression()
!189 = !DILocation(line: 53, column: 25, scope: !180)
!190 = !DILocalVariable(name: "fp", scope: !180, file: !181, line: 55, type: !87)
!191 = !DILocation(line: 55, column: 11, scope: !180)
!192 = !DILocalVariable(name: "mat", scope: !180, file: !181, line: 56, type: !58)
!193 = !DILocation(line: 56, column: 12, scope: !180)
!194 = !DILocation(line: 58, column: 16, scope: !180)
!195 = !DILocation(line: 58, column: 10, scope: !180)
!196 = !DILocation(line: 58, column: 8, scope: !180)
!197 = !DILocation(line: 59, column: 11, scope: !198)
!198 = distinct !DILexicalBlock(scope: !180, file: !181, line: 59, column: 10)
!199 = !DILocation(line: 59, column: 10, scope: !180)
!200 = !DILocation(line: 60, column: 9, scope: !198)
!201 = !DILocation(line: 62, column: 19, scope: !180)
!202 = !DILocation(line: 62, column: 11, scope: !180)
!203 = !DILocation(line: 62, column: 9, scope: !180)
!204 = !DILocation(line: 63, column: 17, scope: !205)
!205 = distinct !DILexicalBlock(scope: !180, file: !181, line: 63, column: 9)
!206 = !DILocation(line: 63, column: 14, scope: !205)
!207 = !DILocation(line: 63, column: 9, scope: !180)
!208 = !DILocation(line: 64, column: 16, scope: !209)
!209 = distinct !DILexicalBlock(scope: !205, file: !181, line: 63, column: 23)
!210 = !DILocation(line: 64, column: 9, scope: !209)
!211 = !DILocation(line: 65, column: 9, scope: !209)
!212 = !DILocation(line: 66, column: 9, scope: !209)
!213 = !DILocation(line: 69, column: 15, scope: !180)
!214 = !DILocation(line: 69, column: 5, scope: !180)
!215 = !DILocation(line: 69, column: 10, scope: !180)
!216 = !DILocation(line: 69, column: 13, scope: !180)
!217 = !DILocation(line: 70, column: 5, scope: !180)
!218 = !DILocation(line: 70, column: 10, scope: !180)
!219 = !DILocation(line: 70, column: 17, scope: !180)
!220 = !DILocation(line: 71, column: 5, scope: !180)
!221 = !DILocation(line: 71, column: 10, scope: !180)
!222 = !DILocation(line: 71, column: 24, scope: !180)
!223 = !DILocation(line: 72, column: 40, scope: !180)
!224 = !DILocation(line: 72, column: 21, scope: !180)
!225 = !DILocation(line: 72, column: 5, scope: !180)
!226 = !DILocation(line: 72, column: 10, scope: !180)
!227 = !DILocation(line: 72, column: 19, scope: !180)
!228 = !DILocation(line: 73, column: 5, scope: !180)
!229 = !DILocation(line: 73, column: 10, scope: !180)
!230 = !DILocation(line: 73, column: 18, scope: !180)
!231 = !DILocation(line: 74, column: 5, scope: !180)
!232 = !DILocation(line: 74, column: 10, scope: !180)
!233 = !DILocation(line: 74, column: 19, scope: !180)
!234 = !DILocation(line: 75, column: 5, scope: !180)
!235 = !DILocation(line: 75, column: 10, scope: !180)
!236 = !DILocation(line: 75, column: 15, scope: !180)
!237 = !DILocation(line: 76, column: 5, scope: !180)
!238 = !DILocation(line: 76, column: 10, scope: !180)
!239 = !DILocation(line: 76, column: 14, scope: !180)
!240 = !DILocation(line: 77, column: 5, scope: !180)
!241 = !DILocation(line: 77, column: 10, scope: !180)
!242 = !DILocation(line: 77, column: 21, scope: !180)
!243 = !DILocation(line: 78, column: 5, scope: !180)
!244 = !DILocation(line: 78, column: 10, scope: !180)
!245 = !DILocation(line: 78, column: 23, scope: !180)
!246 = !DILocation(line: 82, column: 5, scope: !180)
!247 = !DILocation(line: 82, column: 10, scope: !180)
!248 = !DILocation(line: 82, column: 14, scope: !180)
!249 = !DILocation(line: 84, column: 16, scope: !180)
!250 = !DILocation(line: 84, column: 5, scope: !180)
!251 = !DILocation(line: 86, column: 12, scope: !180)
!252 = !DILocation(line: 86, column: 5, scope: !180)
!253 = !DILocation(line: 87, column: 1, scope: !180)
!254 = distinct !DISubprogram(name: "Mat_VarWrite4", scope: !181, file: !181, line: 99, type: !255, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !186)
!255 = !DISubroutineType(types: !256)
!256 = !{!71, !58, !257}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "matvar_t", file: !4, line: 200, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "matvar_t", file: !4, line: 185, size: 640, align: 64, elements: !260)
!260 = !{!261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !259, file: !4, line: 186, baseType: !77, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !259, file: !4, line: 187, baseType: !71, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !259, file: !4, line: 188, baseType: !10, size: 32, align: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !259, file: !4, line: 189, baseType: !71, size: 32, align: 32, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "class_type", scope: !259, file: !4, line: 190, baseType: !33, size: 32, align: 32, offset: 160)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "isComplex", scope: !259, file: !4, line: 191, baseType: !71, size: 32, align: 32, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "isGlobal", scope: !259, file: !4, line: 192, baseType: !71, size: 32, align: 32, offset: 224)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "isLogical", scope: !259, file: !4, line: 193, baseType: !71, size: 32, align: 32, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !259, file: !4, line: 194, baseType: !176, size: 64, align: 64, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !259, file: !4, line: 195, baseType: !66, size: 64, align: 64, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !259, file: !4, line: 196, baseType: !64, size: 64, align: 64, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "mem_conserve", scope: !259, file: !4, line: 197, baseType: !71, size: 32, align: 32, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !259, file: !4, line: 198, baseType: !53, size: 32, align: 32, offset: 544)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !259, file: !4, line: 199, baseType: !275, size: 64, align: 64, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "matvar_internal", file: !61, line: 80, size: 320, align: 64, elements: !277)
!277 = !{!278, !279, !281, !282, !320}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "datapos", scope: !276, file: !61, line: 86, baseType: !75, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "num_fields", scope: !276, file: !61, line: 87, baseType: !280, size: 32, align: 32, offset: 64)
!280 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "fieldnames", scope: !276, file: !61, line: 88, baseType: !82, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !276, file: !61, line: 90, baseType: !283, size: 64, align: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_streamp", file: !284, line: 108, baseType: !285)
!284 = !DIFile(filename: "/usr/local/include/zlib.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !284, line: 106, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !284, line: 86, size: 896, align: 64, elements: !288)
!288 = !{!289, !294, !296, !298, !299, !300, !301, !302, !305, !311, !316, !317, !318, !319}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !287, file: !284, line: 87, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !292, line: 400, baseType: !293)
!292 = !DIFile(filename: "/usr/local/include/zconf.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.so.9.1.0")
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !292, line: 391, baseType: !166)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !287, file: !284, line: 88, baseType: !295, size: 32, align: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !292, line: 393, baseType: !280)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !287, file: !284, line: 89, baseType: !297, size: 64, align: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !292, line: 394, baseType: !79)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !287, file: !284, line: 91, baseType: !290, size: 64, align: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !287, file: !284, line: 92, baseType: !295, size: 32, align: 32, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !287, file: !284, line: 93, baseType: !297, size: 64, align: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !287, file: !284, line: 95, baseType: !66, size: 64, align: 64, offset: 384)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !287, file: !284, line: 96, baseType: !303, size: 64, align: 64, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !284, line: 84, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !287, file: !284, line: 98, baseType: !306, size: 64, align: 64, offset: 512)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !284, line: 81, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!310, !310, !295, !295}
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !292, line: 409, baseType: !64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !287, file: !284, line: 99, baseType: !312, size: 64, align: 64, offset: 576)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !284, line: 82, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !310, !310}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !287, file: !284, line: 100, baseType: !310, size: 64, align: 64, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !287, file: !284, line: 102, baseType: !71, size: 32, align: 32, offset: 704)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !287, file: !284, line: 104, baseType: !297, size: 64, align: 64, offset: 768)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !287, file: !284, line: 105, baseType: !297, size: 64, align: 64, offset: 832)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !276, file: !61, line: 91, baseType: !64, size: 64, align: 64, offset: 256)
!321 = !DILocalVariable(name: "mat", arg: 1, scope: !254, file: !181, line: 99, type: !58)
!322 = !DILocation(line: 99, column: 22, scope: !254)
!323 = !DILocalVariable(name: "matvar", arg: 2, scope: !254, file: !181, line: 99, type: !257)
!324 = !DILocation(line: 99, column: 36, scope: !254)
!325 = !DILocalVariable(name: "nelems", scope: !254, file: !181, line: 109, type: !83)
!326 = !DILocation(line: 109, column: 17, scope: !254)
!327 = !DILocalVariable(name: "i", scope: !254, file: !181, line: 109, type: !83)
!328 = !DILocation(line: 109, column: 29, scope: !254)
!329 = !DILocalVariable(name: "x", scope: !254, file: !181, line: 110, type: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "Fmatrix", scope: !254, file: !181, line: 107, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !181, line: 101, size: 160, align: 32, elements: !332)
!332 = !{!333, !334, !335, !336, !337}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !331, file: !181, line: 102, baseType: !83, size: 32, align: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mrows", scope: !331, file: !181, line: 103, baseType: !83, size: 32, align: 32, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ncols", scope: !331, file: !181, line: 104, baseType: !83, size: 32, align: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "imagf", scope: !331, file: !181, line: 105, baseType: !83, size: 32, align: 32, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "namelen", scope: !331, file: !181, line: 106, baseType: !83, size: 32, align: 32, offset: 128)
!338 = !DILocation(line: 110, column: 13, scope: !254)
!339 = !DILocation(line: 112, column: 17, scope: !340)
!340 = distinct !DILexicalBlock(scope: !254, file: !181, line: 112, column: 9)
!341 = !DILocation(line: 112, column: 14, scope: !340)
!342 = !DILocation(line: 112, column: 21, scope: !340)
!343 = !DILocation(line: 112, column: 32, scope: !344)
!344 = !DILexicalBlockFile(scope: !340, file: !181, discriminator: 1)
!345 = !DILocation(line: 112, column: 29, scope: !344)
!346 = !DILocation(line: 112, column: 39, scope: !344)
!347 = !DILocation(line: 112, column: 50, scope: !348)
!348 = !DILexicalBlockFile(scope: !340, file: !181, discriminator: 2)
!349 = !DILocation(line: 112, column: 58, scope: !348)
!350 = !DILocation(line: 112, column: 47, scope: !348)
!351 = !DILocation(line: 112, column: 63, scope: !348)
!352 = !DILocation(line: 112, column: 66, scope: !353)
!353 = !DILexicalBlockFile(scope: !340, file: !181, discriminator: 3)
!354 = !DILocation(line: 112, column: 74, scope: !353)
!355 = !DILocation(line: 112, column: 79, scope: !353)
!356 = !DILocation(line: 112, column: 9, scope: !353)
!357 = !DILocation(line: 113, column: 9, scope: !340)
!358 = !DILocation(line: 115, column: 14, scope: !254)
!359 = !DILocation(line: 115, column: 22, scope: !254)
!360 = !DILocation(line: 115, column: 5, scope: !254)
!361 = !DILocation(line: 117, column: 15, scope: !362)
!362 = distinct !DILexicalBlock(scope: !254, file: !181, line: 115, column: 34)
!363 = !DILocation(line: 117, column: 20, scope: !362)
!364 = !DILocation(line: 118, column: 13, scope: !362)
!365 = !DILocation(line: 120, column: 15, scope: !362)
!366 = !DILocation(line: 120, column: 20, scope: !362)
!367 = !DILocation(line: 121, column: 13, scope: !362)
!368 = !DILocation(line: 123, column: 15, scope: !362)
!369 = !DILocation(line: 123, column: 20, scope: !362)
!370 = !DILocation(line: 124, column: 13, scope: !362)
!371 = !DILocation(line: 126, column: 15, scope: !362)
!372 = !DILocation(line: 126, column: 20, scope: !362)
!373 = !DILocation(line: 127, column: 13, scope: !362)
!374 = !DILocation(line: 129, column: 15, scope: !362)
!375 = !DILocation(line: 129, column: 20, scope: !362)
!376 = !DILocation(line: 130, column: 13, scope: !362)
!377 = !DILocation(line: 132, column: 15, scope: !362)
!378 = !DILocation(line: 132, column: 20, scope: !362)
!379 = !DILocation(line: 133, column: 13, scope: !362)
!380 = !DILocation(line: 135, column: 13, scope: !362)
!381 = !DILocation(line: 159, column: 37, scope: !254)
!382 = !DILocation(line: 159, column: 45, scope: !254)
!383 = !DILocation(line: 159, column: 30, scope: !254)
!384 = !DILocation(line: 159, column: 17, scope: !254)
!385 = !DILocation(line: 159, column: 51, scope: !254)
!386 = !DILocation(line: 159, column: 7, scope: !254)
!387 = !DILocation(line: 159, column: 15, scope: !254)
!388 = !DILocation(line: 162, column: 24, scope: !254)
!389 = !DILocation(line: 162, column: 29, scope: !254)
!390 = !DILocation(line: 162, column: 17, scope: !254)
!391 = !DILocation(line: 162, column: 11, scope: !254)
!392 = !DILocation(line: 164, column: 14, scope: !254)
!393 = !DILocation(line: 164, column: 22, scope: !254)
!394 = !DILocation(line: 164, column: 5, scope: !254)
!395 = !DILocation(line: 166, column: 15, scope: !396)
!396 = distinct !DILexicalBlock(scope: !254, file: !181, line: 164, column: 35)
!397 = !DILocation(line: 166, column: 19, scope: !396)
!398 = !DILocation(line: 166, column: 13, scope: !396)
!399 = !DILocation(line: 174, column: 21, scope: !400)
!400 = distinct !DILexicalBlock(scope: !396, file: !181, line: 174, column: 13)
!401 = !DILocation(line: 174, column: 19, scope: !400)
!402 = !DILocation(line: 174, column: 26, scope: !403)
!403 = !DILexicalBlockFile(scope: !404, file: !181, discriminator: 1)
!404 = distinct !DILexicalBlock(scope: !400, file: !181, line: 174, column: 13)
