; ModuleID = './libresolutionCommon_la-resolutionDL.o.i'
source_filename = "./libresolutionCommon_la-resolutionDL.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Udev1Interface = type { i8* (%struct.udev_device*)*, %struct.udev_device* (%struct.udev_device*, i8*, i8*)*, i8* (%struct.udev_device*, i8*)*, %struct.udev_device* (%struct.udev*, i8*)*, %struct.udev_device* (%struct.udev_device*)*, i32 (%struct.udev_enumerate*, i8*, i8*)*, i32 (%struct.udev_enumerate*, i8*)*, %struct.udev_list_entry* (%struct.udev_enumerate*)*, %struct.udev_enumerate* (%struct.udev*)*, i32 (%struct.udev_enumerate*)*, %struct.udev_enumerate* (%struct.udev_enumerate*)*, i8* (%struct.udev_list_entry*)*, %struct.udev_list_entry* (%struct.udev_list_entry*)*, %struct.udev* ()*, %struct.udev* (%struct.udev*)* }
%struct.udev_device = type opaque
%struct.udev = type opaque
%struct.udev_enumerate = type opaque
%struct.udev_list_entry = type opaque
%struct.Drm2Interface = type { i32 (i8*, i8*)*, i32 (i32)*, %struct._drmVersion* (i32)*, void (%struct._drmVersion*)*, i32 (i32)*, i32 (i32, i64, i8*, i64)* }
%struct._drmVersion = type { i32, i32, i32, i32, i8*, i32, i8*, i32, i8* }
%struct.FuncToResolv = type { i64, i8* }

@udevi = global %struct.Udev1Interface* null, align 8
@drmi = global %struct.Drm2Interface* null, align 8
@dlhandle = internal global i8* null, align 8
@.str = private unnamed_addr constant [13 x i8] c"libudev.so.1\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15, globals: !19)
!1 = !DIFile(filename: "libresolutionCommon_la-resolutionDL.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1484")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 51, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1484")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!7 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!8 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!9 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!10 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!11 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!12 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!13 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!14 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!15 = !{!16, !17, !18}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!18 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!19 = !{!20, !98, !137, !138, !148}
!20 = distinct !DIGlobalVariable(name: "udevi", scope: !0, file: !21, line: 77, type: !22, isLocal: false, isDefinition: true, variable: %struct.Udev1Interface** @udevi)
!21 = !DIFile(filename: "resolutionDL.c", directory: "/home/lichi/Desktop/open-vm-tools/line1484")
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Udev1Interface", file: !24, line: 47, size: 960, align: 64, elements: !25)
!24 = !DIFile(filename: "resolutionDL.h", directory: "/home/lichi/Desktop/open-vm-tools/line1484")
!25 = !{!26, !35, !39, !43, !49, !53, !60, !64, !70, !74, !78, !82, !86, !90, !94}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_device_get_devnode", scope: !23, file: !24, line: 49, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{!30, !33}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "udev_device", file: !24, line: 35, flags: DIFlagFwdDecl)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_device_get_parent_with_subsystem_devtype", scope: !23, file: !24, line: 51, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!33, !33, !30, !30}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_device_get_sysattr_value", scope: !23, file: !24, line: 54, baseType: !40, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!30, !33, !30}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_device_new_from_syspath", scope: !23, file: !24, line: 56, baseType: !44, size: 64, align: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!33, !47, !30}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "udev", file: !24, line: 34, flags: DIFlagFwdDecl)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_device_unref", scope: !23, file: !24, line: 58, baseType: !50, size: 64, align: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!33, !33}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_enumerate_add_match_property", scope: !23, file: !24, line: 60, baseType: !54, size: 64, align: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !58, !30, !30}
!57 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "udev_enumerate", file: !24, line: 36, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_enumerate_add_match_subsystem", scope: !23, file: !24, line: 63, baseType: !61, size: 64, align: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!57, !58, !30}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_enumerate_get_list_entry", scope: !23, file: !24, line: 65, baseType: !65, size: 64, align: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !58}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "udev_list_entry", file: !24, line: 64, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_enumerate_new", scope: !23, file: !24, line: 67, baseType: !71, size: 64, align: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!58, !47}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_enumerate_scan_devices", scope: !23, file: !24, line: 69, baseType: !75, size: 64, align: 64, offset: 576)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!57, !58}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_enumerate_unref", scope: !23, file: !24, line: 71, baseType: !79, size: 64, align: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!58, !58}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_list_entry_get_name", scope: !23, file: !24, line: 73, baseType: !83, size: 64, align: 64, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!30, !68}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_list_entry_get_next", scope: !23, file: !24, line: 75, baseType: !87, size: 64, align: 64, offset: 768)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!68, !68}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !23, file: !24, line: 77, baseType: !91, size: 64, align: 64, offset: 832)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!47}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_unref", scope: !23, file: !24, line: 79, baseType: !95, size: 64, align: 64, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!47, !47}
!98 = distinct !DIGlobalVariable(name: "drmi", scope: !0, file: !21, line: 78, type: !99, isLocal: false, isDefinition: true, variable: %struct.Drm2Interface** @drmi)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Drm2Interface", file: !24, line: 146, size: 384, align: 64, elements: !101)
!101 = !{!102, !106, !110, !128, !132, !133}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Open", scope: !100, file: !24, line: 147, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!57, !30, !30}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Close", scope: !100, file: !24, line: 148, baseType: !107, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!57, !57}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "GetVersion", scope: !100, file: !24, line: 149, baseType: !111, size: 64, align: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!114, !57}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "drmVersionPtr", file: !24, line: 102, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_drmVersion", file: !24, line: 92, size: 448, align: 64, elements: !117)
!117 = !{!118, !119, !120, !121, !122, !124, !125, !126, !127}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "version_major", scope: !116, file: !24, line: 93, baseType: !57, size: 32, align: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "version_minor", scope: !116, file: !24, line: 94, baseType: !57, size: 32, align: 32, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "version_patchlevel", scope: !116, file: !24, line: 95, baseType: !57, size: 32, align: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "name_len", scope: !116, file: !24, line: 96, baseType: !57, size: 32, align: 32, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !24, line: 97, baseType: !123, size: 64, align: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "date_len", scope: !116, file: !24, line: 98, baseType: !57, size: 32, align: 32, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !116, file: !24, line: 99, baseType: !123, size: 64, align: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "desc_len", scope: !116, file: !24, line: 100, baseType: !57, size: 32, align: 32, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !116, file: !24, line: 101, baseType: !123, size: 64, align: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "FreeVersion", scope: !100, file: !24, line: 150, baseType: !129, size: 64, align: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !114}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "DropMaster", scope: !100, file: !24, line: 151, baseType: !107, size: 64, align: 64, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "CommandWrite", scope: !100, file: !24, line: 152, baseType: !134, size: 64, align: 64, offset: 320)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!57, !57, !18, !16, !18}
!137 = distinct !DIGlobalVariable(name: "dlhandle", scope: !0, file: !21, line: 80, type: !16, isLocal: true, isDefinition: true, variable: i8** @dlhandle)
!138 = distinct !DIGlobalVariable(name: "udev1Table", scope: !0, file: !21, line: 50, type: !139, isLocal: true, isDefinition: true, variable: [15 x %struct.FuncToResolv]* @udev1Table)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 1920, align: 64, elements: !146)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FuncToResolv", file: !21, line: 36, size: 128, align: 64, elements: !141)
!141 = !{!142, !145}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !140, file: !21, line: 37, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !144, line: 216, baseType: !18)
!144 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1484")
!145 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !21, line: 38, baseType: !30, size: 64, align: 64, offset: 64)
!146 = !{!147}
!147 = !DISubrange(count: 15)
!148 = distinct !DIGlobalVariable(name: "drm2Table", scope: !0, file: !21, line: 68, type: !149, isLocal: true, isDefinition: true, variable: [6 x %struct.FuncToResolv]* @drm2Table)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 768, align: 64, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 6)
!152 = !{i32 2, !"Dwarf Version", i32 4}
!153 = !{i32 2, !"Debug Info Version", i32 3}
!154 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!155 = distinct !DISubprogram(name: "resolutionDLClose", scope: !21, file: !21, line: 96, type: !156, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !158)
!156 = !DISubroutineType(types: !157)
!157 = !{null}
!158 = !{}
!159 = !DILocation(line: 98, column: 9, scope: !160)
!160 = distinct !DILexicalBlock(scope: !155, file: !21, line: 98, column: 9)
!161 = !DILocation(line: 98, column: 9, scope: !155)
!162 = !DILocation(line: 99, column: 7, scope: !163)
!163 = distinct !DILexicalBlock(scope: !160, file: !21, line: 98, column: 16)
!164 = !DILocation(line: 99, column: 2, scope: !163)
!165 = !DILocation(line: 100, column: 8, scope: !163)
!166 = !DILocation(line: 101, column: 5, scope: !163)
!167 = !DILocation(line: 103, column: 9, scope: !168)
!168 = distinct !DILexicalBlock(scope: !155, file: !21, line: 103, column: 9)
!169 = !DILocation(line: 103, column: 9, scope: !155)
!170 = !DILocation(line: 104, column: 7, scope: !171)
!171 = distinct !DILexicalBlock(scope: !168, file: !21, line: 103, column: 15)
!172 = !DILocation(line: 104, column: 2, scope: !171)
!173 = !DILocation(line: 105, column: 7, scope: !171)
!174 = !DILocation(line: 106, column: 5, scope: !171)
!175 = !DILocation(line: 108, column: 9, scope: !176)
!176 = distinct !DILexicalBlock(scope: !155, file: !21, line: 108, column: 9)
!177 = !DILocation(line: 108, column: 9, scope: !155)
!178 = !DILocation(line: 109, column: 10, scope: !179)
!179 = distinct !DILexicalBlock(scope: !176, file: !21, line: 108, column: 19)
!180 = !DILocation(line: 109, column: 2, scope: !179)
!181 = !DILocation(line: 110, column: 11, scope: !179)
!182 = !DILocation(line: 111, column: 5, scope: !179)
!183 = !DILocation(line: 112, column: 1, scope: !155)
!184 = distinct !DISubprogram(name: "resolutionDLOpen", scope: !21, file: !21, line: 191, type: !185, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !158)
!185 = !DISubroutineType(types: !186)
!186 = !{!57}
!187 = !DILocation(line: 194, column: 9, scope: !188)
!188 = distinct !DILexicalBlock(scope: !184, file: !21, line: 194, column: 9)
!189 = !DILocation(line: 195, column: 66, scope: !188)
!190 = !DILocation(line: 196, column: 2, scope: !188)
!191 = !DILocation(line: 194, column: 9, scope: !192)
!192 = !DILexicalBlockFile(scope: !184, file: !21, discriminator: 1)
!193 = !DILocation(line: 198, column: 2, scope: !188)
!194 = !DILocation(line: 200, column: 9, scope: !195)
!195 = distinct !DILexicalBlock(scope: !184, file: !21, line: 200, column: 9)
!196 = !DILocation(line: 200, column: 9, scope: !184)
!197 = !DILocation(line: 202, column: 2, scope: !195)
!198 = !DILocation(line: 204, column: 5, scope: !184)
!199 = !DILocation(line: 205, column: 1, scope: !184)
!200 = distinct !DISubprogram(name: "resolutionDLResolve", scope: !21, file: !21, line: 130, type: !201, isLocal: true, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !158)
!201 = !DISubroutineType(types: !202)
!202 = !{!57, !17, !143, !30, !203, !57}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
