; ModuleID = './libNicInfo_la-nicInfo.o.i'
source_filename = "./libNicInfo_la-nicInfo.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GPtrArray = type { i8**, i32 }
%struct._GPatternSpec = type opaque
%struct.NicInfoV3 = type { %struct.anon, %struct.anon.3, %struct.DnsConfigInfo*, %struct.WinsConfigInfo*, %struct.DhcpConfigInfo*, %struct.DhcpConfigInfo* }
%struct.anon = type { i32, %struct.GuestNicV3* }
%struct.GuestNicV3 = type { i8*, %struct.anon.0, %struct.DnsConfigInfo*, %struct.WinsConfigInfo*, %struct.DhcpConfigInfo*, %struct.DhcpConfigInfo* }
%struct.anon.0 = type { i32, %struct.IpAddressEntry* }
%struct.IpAddressEntry = type { %struct.TypedIpAddress, i32, i32*, i32* }
%struct.TypedIpAddress = type { i32, %struct.InetAddress }
%struct.InetAddress = type { i32, i8* }
%struct.anon.3 = type { i32, %struct.InetCidrRouteEntry* }
%struct.InetCidrRouteEntry = type { %struct.TypedIpAddress, i32, %struct.TypedIpAddress*, i32, i32, i32 }
%struct.DnsConfigInfo = type { i8**, i8**, %struct.anon.1, %struct.anon.2 }
%struct.anon.1 = type { i32, %struct.TypedIpAddress* }
%struct.anon.2 = type { i32, i8** }
%struct.WinsConfigInfo = type { %struct.TypedIpAddress, %struct.TypedIpAddress }
%struct.DhcpConfigInfo = type { i32, i8* }
%struct.XDR = type { i32, %struct.xdr_ops*, i8*, i8*, i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !65, globals: !278)
!1 = !DIFile(filename: "libNicInfo_la-nicInfo.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line759")
!2 = !{!3, !10, !22, !31, !38, !48, !54, !60}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 34, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/nicInfo.h", directory: "/home/lichi/Desktop/open-vm-tools/line759")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "NICINFO_PRIORITY_PRIMARY", value: 0)
!7 = !DIEnumerator(name: "NICINFO_PRIORITY_NORMAL", value: 1)
!8 = !DIEnumerator(name: "NICINFO_PRIORITY_LOW", value: 2)
!9 = !DIEnumerator(name: "NICINFO_PRIORITY_MAX", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 51, size: 32, align: 32, elements: !12)
!11 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line759")
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20, !21}
!13 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!14 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!15 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!16 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!17 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!18 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!19 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!20 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!21 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "InetAddressType", file: !23, line: 65, size: 32, align: 32, elements: !24)
!23 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/guestrpc/nicinfo.h", directory: "/home/lichi/Desktop/open-vm-tools/line759")
!24 = !{!25, !26, !27, !28, !29, !30}
!25 = !DIEnumerator(name: "IAT_UNKNOWN", value: 0)
!26 = !DIEnumerator(name: "IAT_IPV4", value: 1)
!27 = !DIEnumerator(name: "IAT_IPV6", value: 2)
!28 = !DIEnumerator(name: "IAT_IPV4Z", value: 3)
!29 = !DIEnumerator(name: "IAT_IPV6Z", value: 4)
!30 = !DIEnumerator(name: "IAT_DNS", value: 16)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IpAddressOrigin", file: !23, line: 77, size: 32, align: 32, elements: !32)
!32 = !{!33, !34, !35, !36, !37}
!33 = !DIEnumerator(name: "IAO_OTHER", value: 1)
!34 = !DIEnumerator(name: "IAO_MANUAL", value: 2)
!35 = !DIEnumerator(name: "IAO_DHCP", value: 4)
!36 = !DIEnumerator(name: "IAO_LINKLAYER", value: 5)
!37 = !DIEnumerator(name: "IAO_RANDOM", value: 6)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IpAddressStatus", file: !23, line: 86, size: 32, align: 32, elements: !39)
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47}
!40 = !DIEnumerator(name: "IAS_PREFERRED", value: 1)
!41 = !DIEnumerator(name: "IAS_DEPRECATED", value: 2)
!42 = !DIEnumerator(name: "IAS_INVALID", value: 3)
!43 = !DIEnumerator(name: "IAS_INACCESSIBLE", value: 4)
!44 = !DIEnumerator(name: "IAS_UNKNOWN", value: 5)
!45 = !DIEnumerator(name: "IAS_TENTATIVE", value: 6)
!46 = !DIEnumerator(name: "IAS_DUPLICATE", value: 7)
!47 = !DIEnumerator(name: "IAS_OPTIMISTIC", value: 8)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "InetCidrRouteType", file: !23, line: 138, size: 32, align: 32, elements: !49)
!49 = !{!50, !51, !52, !53}
!50 = !DIEnumerator(name: "ICRT_OTHER", value: 1)
!51 = !DIEnumerator(name: "ICRT_REJECT", value: 2)
!52 = !DIEnumerator(name: "ICRT_LOCAL", value: 3)
!53 = !DIEnumerator(name: "ICRT_REMOTE", value: 4)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdr_op", file: !55, line: 81, size: 32, align: 32, elements: !56)
!55 = !DIFile(filename: "/usr/include/rpc/xdr.h", directory: "/home/lichi/Desktop/open-vm-tools/line759")
!56 = !{!57, !58, !59}
!57 = !DIEnumerator(name: "XDR_ENCODE", value: 0)
!58 = !DIEnumerator(name: "XDR_DECODE", value: 1)
!59 = !DIEnumerator(name: "XDR_FREE", value: 2)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 49, size: 32, align: 32, elements: !62)
!61 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/netutil.h", directory: "/home/lichi/Desktop/open-vm-tools/line759")
!62 = !{!63, !64}
!63 = !DIEnumerator(name: "IANA_IFTYPE_OTHER", value: 1)
!64 = !DIEnumerator(name: "IANA_IFTYPE_ETHERNETCSMACD", value: 6)
!65 = !{!66, !67, !71, !107, !151, !220, !161, !221, !244, !268, !273}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line759")
!70 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdrproc_t", file: !55, line: 152, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!75, !78, !66, null}
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool_t", file: !76, line: 37, baseType: !77)
!76 = !DIFile(filename: "/usr/include/rpc/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line759")
!77 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDR", file: !55, line: 109, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "XDR", file: !55, line: 110, size: 384, align: 64, elements: !81)
!81 = !{!82, !83, !147, !148, !149, !150}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "x_op", scope: !80, file: !55, line: 112, baseType: !54, size: 32, align: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "x_ops", scope: !80, file: !55, line: 136, baseType: !84, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdr_ops", file: !55, line: 113, size: 640, align: 64, elements: !86)
!86 = !{!87, !93, !99, !111, !117, !123, !127, !133, !137, !141}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "x_getlong", scope: !85, file: !55, line: 115, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!75, !78, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "x_putlong", scope: !85, file: !55, line: 117, baseType: !94, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!75, !78, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "x_getbytes", scope: !85, file: !55, line: 119, baseType: !100, size: 64, align: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!75, !78, !103, !108}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !104, line: 116, baseType: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line759")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__caddr_t", file: !106, line: 183, baseType: !107)
!106 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line759")
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !104, line: 35, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !106, line: 32, baseType: !110)
!110 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "x_putbytes", scope: !85, file: !55, line: 121, baseType: !112, size: 64, align: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!75, !78, !115, !108}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "x_getpostn", scope: !85, file: !55, line: 123, baseType: !118, size: 64, align: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!108, !121}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "x_setpostn", scope: !85, file: !55, line: 125, baseType: !124, size: 64, align: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!75, !78, !108}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "x_inline", scope: !85, file: !55, line: 127, baseType: !128, size: 64, align: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !78, !108}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !104, line: 196, baseType: !77)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "x_destroy", scope: !85, file: !55, line: 129, baseType: !134, size: 64, align: 64, offset: 448)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !78}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "x_getint32", scope: !85, file: !55, line: 131, baseType: !138, size: 64, align: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!75, !78, !131}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "x_putint32", scope: !85, file: !55, line: 133, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!75, !78, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "x_public", scope: !80, file: !55, line: 137, baseType: !103, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "x_private", scope: !80, file: !55, line: 138, baseType: !103, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "x_base", scope: !80, file: !55, line: 139, baseType: !103, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "x_handy", scope: !80, file: !55, line: 140, baseType: !108, size: 32, align: 32, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestNicV3", file: !23, line: 174, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestNicV3", file: !23, line: 163, size: 448, align: 64, elements: !154)
!154 = !{!155, !156, !185, !205, !212, !219}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "macAddress", scope: !153, file: !23, line: 164, baseType: !107, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ips", scope: !153, file: !23, line: 168, baseType: !157, size: 128, align: 64, offset: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !153, file: !23, line: 165, size: 128, align: 64, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ips_len", scope: !157, file: !23, line: 166, baseType: !108, size: 32, align: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ips_val", scope: !157, file: !23, line: 167, baseType: !161, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "IpAddressEntry", file: !23, line: 110, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IpAddressEntry", file: !23, line: 104, size: 384, align: 64, elements: !164)
!164 = !{!165, !177, !179, !182}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressAddr", scope: !163, file: !23, line: 105, baseType: !166, size: 192, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "TypedIpAddress", file: !23, line: 102, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TypedIpAddress", file: !23, line: 98, size: 192, align: 64, elements: !168)
!168 = !{!169, !171}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressAddrType", scope: !167, file: !23, line: 99, baseType: !170, size: 32, align: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "InetAddressType", file: !23, line: 73, baseType: !22)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressAddr", scope: !167, file: !23, line: 100, baseType: !172, size: 128, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "InetAddress", file: !23, line: 63, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 60, size: 128, align: 64, elements: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "InetAddress_len", scope: !173, file: !23, line: 61, baseType: !108, size: 32, align: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "InetAddress_val", scope: !173, file: !23, line: 62, baseType: !107, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressPrefixLength", scope: !163, file: !23, line: 106, baseType: !178, size: 32, align: 32, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "InetAddressPrefixLength", file: !23, line: 75, baseType: !108)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressOrigin", scope: !163, file: !23, line: 107, baseType: !180, size: 64, align: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "IpAddressOrigin", file: !23, line: 84, baseType: !31)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressStatus", scope: !163, file: !23, line: 108, baseType: !183, size: 64, align: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "IpAddressStatus", file: !23, line: 96, baseType: !38)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dnsConfigInfo", scope: !153, file: !23, line: 169, baseType: !186, size: 64, align: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "DnsConfigInfo", file: !23, line: 129, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DnsConfigInfo", file: !23, line: 117, size: 384, align: 64, elements: !189)
!189 = !{!190, !193, !194, !200}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "hostName", scope: !188, file: !23, line: 118, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "DnsHostname", file: !23, line: 113, baseType: !107)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "domainName", scope: !188, file: !23, line: 119, baseType: !191, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "serverList", scope: !188, file: !23, line: 123, baseType: !195, size: 128, align: 64, offset: 128)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !188, file: !23, line: 120, size: 128, align: 64, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "serverList_len", scope: !195, file: !23, line: 121, baseType: !108, size: 32, align: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "serverList_val", scope: !195, file: !23, line: 122, baseType: !199, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "searchSuffixes", scope: !188, file: !23, line: 127, baseType: !201, size: 128, align: 64, offset: 256)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !188, file: !23, line: 124, size: 128, align: 64, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "searchSuffixes_len", scope: !201, file: !23, line: 125, baseType: !108, size: 32, align: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "searchSuffixes_val", scope: !201, file: !23, line: 126, baseType: !191, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "winsConfigInfo", scope: !153, file: !23, line: 170, baseType: !206, size: 64, align: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "WinsConfigInfo", file: !23, line: 135, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WinsConfigInfo", file: !23, line: 131, size: 384, align: 64, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "primary", scope: !208, file: !23, line: 132, baseType: !166, size: 192, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !208, file: !23, line: 133, baseType: !166, size: 192, align: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "dhcpConfigInfov4", scope: !153, file: !23, line: 171, baseType: !213, size: 64, align: 64, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "DhcpConfigInfo", file: !23, line: 161, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DhcpConfigInfo", file: !23, line: 157, size: 128, align: 64, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !215, file: !23, line: 158, baseType: !75, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "dhcpSettings", scope: !215, file: !23, line: 159, baseType: !107, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "dhcpConfigInfov6", scope: !153, file: !23, line: 172, baseType: !213, size: 64, align: 64, offset: 384)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !223, line: 239, size: 128, align: 32, elements: !224)
!223 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/open-vm-tools/line759")
!224 = !{!225, !229, !233, !239}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !222, file: !223, line: 241, baseType: !226, size: 16, align: 16)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !227, line: 28, baseType: !228)
!227 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/open-vm-tools/line759")
!228 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !222, file: !223, line: 242, baseType: !230, size: 16, align: 16, offset: 16)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !223, line: 119, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !232, line: 49, baseType: !228)
!232 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line759")
!233 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !222, file: !223, line: 243, baseType: !234, size: 32, align: 32, offset: 32)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !223, line: 31, size: 32, align: 32, elements: !235)
!235 = !{!236}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !234, file: !223, line: 33, baseType: !237, size: 32, align: 32)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !223, line: 30, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !232, line: 51, baseType: !110)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !222, file: !223, line: 246, baseType: !240, size: 64, align: 8, offset: 64)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 64, align: 8, elements: !242)
!241 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!242 = !{!243}
!243 = !DISubrange(count: 8)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !223, line: 254, size: 224, align: 32, elements: !246)
!246 = !{!247, !248, !249, !250, !267}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !245, file: !223, line: 256, baseType: !226, size: 16, align: 16)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !245, file: !223, line: 257, baseType: !230, size: 16, align: 16, offset: 16)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !245, file: !223, line: 258, baseType: !238, size: 32, align: 32, offset: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !245, file: !223, line: 259, baseType: !251, size: 128, align: 32, offset: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !223, line: 211, size: 128, align: 32, elements: !252)
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !251, file: !223, line: 220, baseType: !254, size: 128, align: 32)
!254 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !251, file: !223, line: 213, size: 128, align: 32, elements: !255)
!255 = !{!256, !261, !263}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !254, file: !223, line: 215, baseType: !257, size: 128, align: 8)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 128, align: 8, elements: !259)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !232, line: 48, baseType: !241)
!259 = !{!260}
!260 = !DISubrange(count: 16)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !254, file: !223, line: 217, baseType: !262, size: 128, align: 16)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 128, align: 16, elements: !242)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !254, file: !223, line: 218, baseType: !264, size: 128, align: 32)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 128, align: 32, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 4)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !245, file: !223, line: 260, baseType: !238, size: 32, align: 32, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !270, line: 171, baseType: !271)
!270 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line759")
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !232, line: 55, baseType: !272)
!272 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "GDestroyNotify", file: !69, line: 87, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !277}
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !69, line: 77, baseType: !66)
!278 = !{!279, !299, !300, !310, !311}
!279 = distinct !DIGlobalVariable(name: "defaultStatus", scope: !280, file: !281, line: 460, type: !297, isLocal: true, isDefinition: true, variable: i32* @GuestInfoAddIpAddress.defaultStatus)
!280 = distinct !DISubprogram(name: "GuestInfoAddIpAddress", scope: !281, file: !281, line: 434, type: !282, isLocal: false, isDefinition: true, scopeLine: 439, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!281 = !DIFile(filename: "nicInfo.c", directory: "/home/lichi/Desktop/open-vm-tools/line759")
!282 = !DISubroutineType(types: !283)
!283 = !{!161, !151, !284, !178, !294, !296}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !287, line: 153, size: 128, align: 16, elements: !288)
!287 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/open-vm-tools/line759")
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !286, file: !287, line: 155, baseType: !226, size: 16, align: 16)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !286, file: !287, line: 156, baseType: !291, size: 112, align: 8, offset: 16)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 112, align: 8, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 14)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!298 = !{}
!299 = distinct !DIGlobalVariable(name: "defaultStatus", scope: !280, file: !281, line: 472, type: !297, isLocal: true, isDefinition: true, variable: i32* @GuestInfoAddIpAddress.defaultStatus.6)
!300 = distinct !DIGlobalVariable(name: "gIfacePrimaryPatterns", scope: !0, file: !281, line: 42, type: !301, isLocal: true, isDefinition: true, variable: %struct._GPtrArray** @gIfacePrimaryPatterns)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPtrArray", file: !303, line: 39, baseType: !304)
!303 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line759")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GPtrArray", file: !303, line: 53, size: 128, align: 64, elements: !305)
!305 = !{!306, !308}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !304, file: !303, line: 55, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !304, file: !303, line: 56, baseType: !309, size: 32, align: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !69, line: 55, baseType: !110)
!310 = distinct !DIGlobalVariable(name: "gIfaceLowPriorityPatterns", scope: !0, file: !281, line: 43, type: !301, isLocal: true, isDefinition: true, variable: %struct._GPtrArray** @gIfaceLowPriorityPatterns)
!311 = distinct !DIGlobalVariable(name: "gIfaceExcludePatterns", scope: !0, file: !281, line: 41, type: !301, isLocal: true, isDefinition: true, variable: %struct._GPtrArray** @gIfaceExcludePatterns)
!312 = !{i32 2, !"Dwarf Version", i32 4}
!313 = !{i32 2, !"Debug Info Version", i32 3}
!314 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!315 = distinct !DISubprogram(name: "GuestInfo_SetIfacePrimaryList", scope: !281, file: !281, line: 117, type: !316, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!319 = !DILocalVariable(name: "list", arg: 1, scope: !315, file: !281, line: 117, type: !318)
!320 = !DIExpression()
!321 = !DILocation(line: 117, column: 38, scope: !315)
!322 = !DILocation(line: 119, column: 30, scope: !315)
!323 = !DILocation(line: 119, column: 4, scope: !315)
!324 = !DILocation(line: 120, column: 1, scope: !315)
!325 = distinct !DISubprogram(name: "GuestInfoResetPatternList", scope: !281, file: !281, line: 80, type: !326, isLocal: true, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !318, !328}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!329 = !DILocalVariable(name: "list", arg: 1, scope: !325, file: !281, line: 80, type: !318)
!330 = !DILocation(line: 80, column: 34, scope: !325)
!331 = !DILocalVariable(name: "pPatternList", arg: 2, scope: !325, file: !281, line: 81, type: !328)
!332 = !DILocation(line: 81, column: 39, scope: !325)
!333 = !DILocalVariable(name: "i", scope: !325, file: !281, line: 83, type: !309)
!334 = !DILocation(line: 83, column: 10, scope: !325)
!335 = !DILocation(line: 85, column: 9, scope: !336)
!336 = distinct !DILexicalBlock(scope: !325, file: !281, line: 85, column: 8)
!337 = !DILocation(line: 85, column: 8, scope: !336)
!338 = !DILocation(line: 85, column: 22, scope: !336)
!339 = !DILocation(line: 85, column: 8, scope: !325)
!340 = !DILocation(line: 86, column: 25, scope: !341)
!341 = distinct !DILexicalBlock(scope: !336, file: !281, line: 85, column: 30)
!342 = !DILocation(line: 86, column: 24, scope: !341)
!343 = !DILocation(line: 86, column: 7, scope: !341)
!344 = !DILocation(line: 87, column: 8, scope: !341)
!345 = !DILocation(line: 87, column: 21, scope: !341)
!346 = !DILocation(line: 88, column: 4, scope: !341)
!347 = !DILocation(line: 90, column: 8, scope: !348)
!348 = distinct !DILexicalBlock(scope: !325, file: !281, line: 90, column: 8)
!349 = !DILocation(line: 90, column: 13, scope: !348)
!350 = !DILocation(line: 90, column: 8, scope: !325)
!351 = !DILocation(line: 92, column: 10, scope: !352)
!352 = distinct !DILexicalBlock(scope: !348, file: !281, line: 90, column: 21)
!353 = !DILocation(line: 91, column: 8, scope: !352)
!354 = !DILocation(line: 91, column: 21, scope: !352)
!355 = !DILocation(line: 93, column: 14, scope: !356)
!356 = distinct !DILexicalBlock(scope: !352, file: !281, line: 93, column: 7)
!357 = !DILocation(line: 93, column: 12, scope: !356)
!358 = !DILocation(line: 93, column: 24, scope: !359)
!359 = !DILexicalBlockFile(scope: !360, file: !281, discriminator: 1)
!360 = distinct !DILexicalBlock(scope: !356, file: !281, line: 93, column: 7)
!361 = !DILocation(line: 93, column: 19, scope: !359)
!362 = !DILocation(line: 93, column: 27, scope: !359)
!363 = !DILocation(line: 93, column: 7, scope: !359)
!364 = !DILocation(line: 94, column: 19, scope: !365)
!365 = distinct !DILexicalBlock(scope: !366, file: !281, line: 94, column: 14)
!366 = distinct !DILexicalBlock(scope: !360, file: !281, line: 93, column: 40)
!367 = !DILocation(line: 94, column: 14, scope: !365)
!368 = !DILocation(line: 94, column: 25, scope: !365)
!369 = !DILocation(line: 94, column: 14, scope: !366)
!370 = !DILocation(line: 95, column: 30, scope: !371)
!371 = distinct !DILexicalBlock(scope: !365, file: !281, line: 94, column: 34)
!372 = !DILocation(line: 95, column: 29, scope: !371)
!373 = !DILocation(line: 95, column: 68, scope: !371)
!374 = !DILocation(line: 95, column: 63, scope: !371)
!375 = !DILocation(line: 95, column: 44, scope: !371)
!376 = !DILocation(line: 95, column: 13, scope: !377)
!377 = !DILexicalBlockFile(scope: !371, file: !281, discriminator: 1)
!378 = !DILocation(line: 96, column: 10, scope: !371)
!379 = !DILocation(line: 97, column: 7, scope: !366)
!380 = !DILocation(line: 93, column: 36, scope: !381)
!381 = !DILexicalBlockFile(scope: !360, file: !281, discriminator: 2)
!382 = !DILocation(line: 93, column: 7, scope: !381)
!383 = distinct !{!383, !384}
!384 = !DILocation(line: 93, column: 7, scope: !352)
!385 = !DILocation(line: 98, column: 4, scope: !352)
!386 = !DILocation(line: 99, column: 1, scope: !325)
!387 = distinct !DISubprogram(name: "GuestInfo_SetIfaceLowPriorityList", scope: !281, file: !281, line: 138, type: !316, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!388 = !DILocalVariable(name: "list", arg: 1, scope: !387, file: !281, line: 138, type: !318)
!389 = !DILocation(line: 138, column: 42, scope: !387)
!390 = !DILocation(line: 140, column: 30, scope: !387)
!391 = !DILocation(line: 140, column: 4, scope: !387)
!392 = !DILocation(line: 141, column: 1, scope: !387)
!393 = distinct !DISubprogram(name: "GuestInfo_SetIfaceExcludeList", scope: !281, file: !281, line: 160, type: !316, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!394 = !DILocalVariable(name: "list", arg: 1, scope: !393, file: !281, line: 160, type: !318)
!395 = !DILocation(line: 160, column: 38, scope: !393)
!396 = !DILocation(line: 162, column: 30, scope: !393)
!397 = !DILocation(line: 162, column: 4, scope: !393)
!398 = !DILocation(line: 163, column: 1, scope: !393)
!399 = distinct !DISubprogram(name: "GuestInfo_IfaceIsExcluded", scope: !281, file: !281, line: 216, type: !400, isLocal: false, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!400 = !DISubroutineType(types: !401)
!401 = !{!402, !115}
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !270, line: 230, baseType: !70)
!403 = !DILocalVariable(name: "name", arg: 1, scope: !399, file: !281, line: 216, type: !115)
!404 = !DILocation(line: 216, column: 44, scope: !399)
!405 = !DILocation(line: 219, column: 11, scope: !399)
!406 = !DILocation(line: 219, column: 33, scope: !399)
!407 = !DILocation(line: 219, column: 40, scope: !399)
!408 = !DILocation(line: 220, column: 39, scope: !399)
!409 = !DILocation(line: 220, column: 45, scope: !399)
!410 = !DILocation(line: 220, column: 11, scope: !399)
!411 = !DILocation(line: 219, column: 40, scope: !412)
!412 = !DILexicalBlockFile(scope: !399, file: !281, discriminator: 1)
!413 = !DILocation(line: 219, column: 40, scope: !414)
!414 = !DILexicalBlockFile(scope: !399, file: !281, discriminator: 2)
!415 = !DILocation(line: 219, column: 11, scope: !414)
!416 = !DILocation(line: 219, column: 4, scope: !414)
!417 = distinct !DISubprogram(name: "GuestInfoMatchesPatternList", scope: !281, file: !281, line: 182, type: !418, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!418 = !DISubroutineType(types: !419)
!419 = !{!402, !115, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!422 = !DILocalVariable(name: "name", arg: 1, scope: !417, file: !281, line: 182, type: !115)
!423 = !DILocation(line: 182, column: 41, scope: !417)
!424 = !DILocalVariable(name: "patterns", arg: 2, scope: !417, file: !281, line: 183, type: !420)
!425 = !DILocation(line: 183, column: 46, scope: !417)
!426 = !DILocalVariable(name: "i", scope: !417, file: !281, line: 185, type: !77)
!427 = !DILocation(line: 185, column: 8, scope: !417)
!428 = !DILocation(line: 190, column: 11, scope: !429)
!429 = distinct !DILexicalBlock(scope: !417, file: !281, line: 190, column: 4)
!430 = !DILocation(line: 190, column: 9, scope: !429)
!431 = !DILocation(line: 190, column: 16, scope: !432)
!432 = !DILexicalBlockFile(scope: !433, file: !281, discriminator: 1)
!433 = distinct !DILexicalBlock(scope: !429, file: !281, line: 190, column: 4)
!434 = !DILocation(line: 190, column: 20, scope: !432)
!435 = !DILocation(line: 190, column: 30, scope: !432)
!436 = !DILocation(line: 190, column: 18, scope: !432)
!437 = !DILocation(line: 190, column: 4, scope: !432)
!438 = !DILocation(line: 191, column: 54, scope: !439)
!439 = distinct !DILexicalBlock(scope: !440, file: !281, line: 191, column: 11)
!440 = distinct !DILexicalBlock(scope: !433, file: !281, line: 190, column: 40)
!441 = !DILocation(line: 191, column: 34, scope: !439)
!442 = !DILocation(line: 191, column: 36, scope: !439)
!443 = !DILocation(line: 191, column: 47, scope: !439)
!444 = !DILocation(line: 192, column: 34, scope: !439)
!445 = !DILocation(line: 191, column: 11, scope: !439)
!446 = !DILocation(line: 191, column: 11, scope: !440)
!447 = !DILocation(line: 193, column: 103, scope: !448)
!448 = distinct !DILexicalBlock(scope: !439, file: !281, line: 192, column: 41)
!449 = !DILocation(line: 193, column: 109, scope: !448)
!450 = !DILocation(line: 193, column: 10, scope: !448)
!451 = !DILocation(line: 195, column: 10, scope: !448)
!452 = !DILocation(line: 197, column: 4, scope: !440)
!453 = !DILocation(line: 190, column: 36, scope: !454)
!454 = !DILexicalBlockFile(scope: !433, file: !281, discriminator: 2)
!455 = !DILocation(line: 190, column: 4, scope: !454)
!456 = distinct !{!456, !457}
!457 = !DILocation(line: 190, column: 4, scope: !417)
!458 = !DILocation(line: 198, column: 4, scope: !417)
!459 = !DILocation(line: 199, column: 1, scope: !417)
!460 = distinct !DISubprogram(name: "GuestInfo_IfaceGetPriority", scope: !281, file: !281, line: 240, type: !461, isLocal: false, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!461 = !DISubroutineType(types: !462)
!462 = !{!463, !115}
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "NicInfoPriority", file: !4, line: 39, baseType: !3)
!464 = !DILocalVariable(name: "name", arg: 1, scope: !460, file: !281, line: 240, type: !115)
!465 = !DILocation(line: 240, column: 40, scope: !460)
!466 = !DILocation(line: 243, column: 77, scope: !460)
!467 = !DILocation(line: 243, column: 4, scope: !460)
!468 = !DILocation(line: 244, column: 8, scope: !469)
!469 = distinct !DILexicalBlock(scope: !460, file: !281, line: 244, column: 8)
!470 = !DILocation(line: 244, column: 30, scope: !469)
!471 = !DILocation(line: 244, column: 37, scope: !469)
!472 = !DILocation(line: 245, column: 36, scope: !469)
!473 = !DILocation(line: 245, column: 42, scope: !469)
!474 = !DILocation(line: 245, column: 8, scope: !469)
!475 = !DILocation(line: 244, column: 8, scope: !476)
!476 = !DILexicalBlockFile(scope: !460, file: !281, discriminator: 1)
!477 = !DILocation(line: 246, column: 7, scope: !478)
!478 = distinct !DILexicalBlock(scope: !469, file: !281, line: 245, column: 66)
!479 = !DILocation(line: 247, column: 15, scope: !480)
!480 = distinct !DILexicalBlock(scope: !469, file: !281, line: 247, column: 15)
!481 = !DILocation(line: 247, column: 41, scope: !480)
!482 = !DILocation(line: 247, column: 48, scope: !480)
!483 = !DILocation(line: 248, column: 43, scope: !480)
!484 = !DILocation(line: 248, column: 49, scope: !480)
!485 = !DILocation(line: 248, column: 15, scope: !480)
!486 = !DILocation(line: 247, column: 15, scope: !487)
!487 = !DILexicalBlockFile(scope: !469, file: !281, discriminator: 1)
!488 = !DILocation(line: 249, column: 7, scope: !489)
!489 = distinct !DILexicalBlock(scope: !480, file: !281, line: 248, column: 77)
!490 = !DILocation(line: 251, column: 4, scope: !460)
!491 = !DILocation(line: 252, column: 1, scope: !460)
!492 = distinct !DISubprogram(name: "GuestInfo_GetFqdn", scope: !281, file: !281, line: 271, type: !493, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!493 = !DISubroutineType(types: !494)
!494 = !{!402, !77, !107}
!495 = !DILocalVariable(name: "outBufLen", arg: 1, scope: !492, file: !281, line: 271, type: !77)
!496 = !DILocation(line: 271, column: 23, scope: !492)
!497 = !DILocalVariable(name: "fqdn", arg: 2, scope: !492, file: !281, line: 272, type: !107)
!498 = !DILocation(line: 272, column: 24, scope: !492)
!499 = !DILocation(line: 274, column: 28, scope: !492)
!500 = !DILocation(line: 274, column: 39, scope: !492)
!501 = !DILocation(line: 274, column: 11, scope: !492)
!502 = !DILocation(line: 274, column: 4, scope: !492)
!503 = distinct !DISubprogram(name: "GuestInfo_GetNicInfo", scope: !281, file: !281, line: 298, type: !504, isLocal: false, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!504 = !DISubroutineType(types: !505)
!505 = !{!402, !110, !110, !506}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "NicInfoV3", file: !23, line: 190, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NicInfoV3", file: !23, line: 176, size: 512, align: 64, elements: !510)
!510 = !{!511, !516, !533, !534, !535, !536}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nics", scope: !509, file: !23, line: 180, baseType: !512, size: 128, align: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !23, line: 177, size: 128, align: 64, elements: !513)
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "nics_len", scope: !512, file: !23, line: 178, baseType: !108, size: 32, align: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nics_val", scope: !512, file: !23, line: 179, baseType: !151, size: 64, align: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "routes", scope: !509, file: !23, line: 184, baseType: !517, size: 128, align: 64, offset: 128)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !509, file: !23, line: 181, size: 128, align: 64, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "routes_len", scope: !517, file: !23, line: 182, baseType: !108, size: 32, align: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "routes_val", scope: !517, file: !23, line: 183, baseType: !521, size: 64, align: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "InetCidrRouteEntry", file: !23, line: 154, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InetCidrRouteEntry", file: !23, line: 146, size: 448, align: 64, elements: !524)
!524 = !{!525, !526, !527, !528, !530, !532}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRouteDest", scope: !523, file: !23, line: 147, baseType: !166, size: 192, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRoutePfxLen", scope: !523, file: !23, line: 148, baseType: !178, size: 32, align: 32, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRouteNextHop", scope: !523, file: !23, line: 149, baseType: !199, size: 64, align: 64, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRouteIfIndex", scope: !523, file: !23, line: 150, baseType: !529, size: 32, align: 32, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !270, line: 173, baseType: !238)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRouteType", scope: !523, file: !23, line: 151, baseType: !531, size: 32, align: 32, offset: 352)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "InetCidrRouteType", file: !23, line: 144, baseType: !48)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRouteMetric", scope: !523, file: !23, line: 152, baseType: !529, size: 32, align: 32, offset: 384)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "dnsConfigInfo", scope: !509, file: !23, line: 185, baseType: !186, size: 64, align: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "winsConfigInfo", scope: !509, file: !23, line: 186, baseType: !206, size: 64, align: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "dhcpConfigInfov4", scope: !509, file: !23, line: 187, baseType: !213, size: 64, align: 64, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dhcpConfigInfov6", scope: !509, file: !23, line: 188, baseType: !213, size: 64, align: 64, offset: 448)
!537 = !DILocalVariable(name: "maxIPv4Routes", arg: 1, scope: !503, file: !281, line: 298, type: !110)
!538 = !DILocation(line: 298, column: 35, scope: !503)
!539 = !DILocalVariable(name: "maxIPv6Routes", arg: 2, scope: !503, file: !281, line: 299, type: !110)
!540 = !DILocation(line: 299, column: 35, scope: !503)
!541 = !DILocalVariable(name: "nicInfo", arg: 3, scope: !503, file: !281, line: 300, type: !506)
!542 = !DILocation(line: 300, column: 34, scope: !503)
!543 = !DILocalVariable(name: "retval", scope: !503, file: !281, line: 302, type: !402)
!544 = !DILocation(line: 302, column: 9, scope: !503)
!545 = !DILocation(line: 304, column: 15, scope: !503)
!546 = !DILocation(line: 304, column: 5, scope: !503)
!547 = !DILocation(line: 304, column: 13, scope: !503)
!548 = !DILocation(line: 306, column: 33, scope: !503)
!549 = !DILocation(line: 306, column: 48, scope: !503)
!550 = !DILocation(line: 306, column: 64, scope: !503)
!551 = !DILocation(line: 306, column: 63, scope: !503)
!552 = !DILocation(line: 306, column: 13, scope: !503)
!553 = !DILocation(line: 306, column: 11, scope: !503)
!554 = !DILocation(line: 307, column: 9, scope: !555)
!555 = distinct !DILexicalBlock(scope: !503, file: !281, line: 307, column: 8)
!556 = !DILocation(line: 307, column: 8, scope: !503)
!557 = !DILocation(line: 308, column: 30, scope: !558)
!558 = distinct !DILexicalBlock(scope: !555, file: !281, line: 307, column: 17)
!559 = !DILocation(line: 308, column: 29, scope: !558)
!560 = !DILocation(line: 308, column: 7, scope: !558)
!561 = !DILocation(line: 309, column: 8, scope: !558)
!562 = !DILocation(line: 309, column: 16, scope: !558)
!563 = !DILocation(line: 310, column: 4, scope: !558)
!564 = !DILocation(line: 312, column: 11, scope: !503)
!565 = !DILocation(line: 312, column: 4, scope: !503)
!566 = distinct !DISubprogram(name: "GuestInfo_FreeNicInfo", scope: !281, file: !281, line: 330, type: !567, isLocal: false, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !507}
!569 = !DILocalVariable(name: "nicInfo", arg: 1, scope: !566, file: !281, line: 330, type: !507)
!570 = !DILocation(line: 330, column: 34, scope: !566)
!571 = !DILocation(line: 332, column: 8, scope: !572)
!572 = distinct !DILexicalBlock(scope: !566, file: !281, line: 332, column: 8)
!573 = !DILocation(line: 332, column: 16, scope: !572)
!574 = !DILocation(line: 332, column: 8, scope: !566)
!575 = !DILocation(line: 333, column: 53, scope: !576)
!576 = distinct !DILexicalBlock(scope: !572, file: !281, line: 332, column: 24)
!577 = !DILocation(line: 333, column: 44, scope: !576)
!578 = !DILocation(line: 333, column: 7, scope: !576)
!579 = !DILocation(line: 334, column: 12, scope: !576)
!580 = !DILocation(line: 334, column: 7, scope: !576)
!581 = !DILocation(line: 335, column: 4, scope: !576)
!582 = !DILocation(line: 336, column: 1, scope: !566)
!583 = distinct !DISubprogram(name: "GuestInfo_GetPrimaryIP", scope: !281, file: !281, line: 354, type: !584, isLocal: false, isDefinition: true, scopeLine: 355, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!584 = !DISubroutineType(types: !585)
!585 = !{!107}
!586 = !DILocalVariable(name: "ipstr", scope: !583, file: !281, line: 356, type: !107)
!587 = !DILocation(line: 356, column: 10, scope: !583)
!588 = !DILocation(line: 356, column: 18, scope: !583)
!589 = !DILocation(line: 358, column: 8, scope: !590)
!590 = distinct !DILexicalBlock(scope: !583, file: !281, line: 358, column: 8)
!591 = !DILocation(line: 358, column: 14, scope: !590)
!592 = !DILocation(line: 358, column: 8, scope: !583)
!593 = !DILocation(line: 359, column: 15, scope: !594)
!594 = distinct !DILexicalBlock(scope: !590, file: !281, line: 358, column: 22)
!595 = !DILocation(line: 359, column: 13, scope: !594)
