; ModuleID = './vmware_guestproxycerttool-cert_tool.o.i'
source_filename = "./vmware_guestproxycerttool-cert_tool.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._options = type { i8*, i8*, i8*, i32, i32, i32, i32, i32, i32 }
%struct._GOptionEntry = type { i8*, i8, i32, i32, i8*, i8*, i8* }
%struct._GError = type { i32, i32, i8* }
%struct._GOptionContext = type opaque
%struct._GMappedFile = type opaque

@vm_version = constant [20 x i8] c"version=10.3.0.5330\00", section ".modinfo", align 16
@gIsLogEnabled = global i32 0, align 4
@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [77 x i8] c"%s: Please re-run this program as the super user to execute this operation.\0A\00", align 1
@options = internal global %struct._options zeroinitializer, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !23, globals: !25)
!1 = !DIFile(filename: "vmware_guestproxycerttool-cert_tool.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1366")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 118, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/goption.h", directory: "/home/lichi/Desktop/open-vm-tools/line1366")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "G_OPTION_ARG_NONE", value: 0)
!7 = !DIEnumerator(name: "G_OPTION_ARG_STRING", value: 1)
!8 = !DIEnumerator(name: "G_OPTION_ARG_INT", value: 2)
!9 = !DIEnumerator(name: "G_OPTION_ARG_CALLBACK", value: 3)
!10 = !DIEnumerator(name: "G_OPTION_ARG_FILENAME", value: 4)
!11 = !DIEnumerator(name: "G_OPTION_ARG_STRING_ARRAY", value: 5)
!12 = !DIEnumerator(name: "G_OPTION_ARG_FILENAME_ARRAY", value: 6)
!13 = !DIEnumerator(name: "G_OPTION_ARG_DOUBLE", value: 7)
!14 = !DIEnumerator(name: "G_OPTION_ARG_INT64", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 66, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gfileutils.h", directory: "/home/lichi/Desktop/open-vm-tools/line1366")
!17 = !{!18, !19, !20, !21, !22}
!18 = !DIEnumerator(name: "G_FILE_TEST_IS_REGULAR", value: 1)
!19 = !DIEnumerator(name: "G_FILE_TEST_IS_SYMLINK", value: 2)
!20 = !DIEnumerator(name: "G_FILE_TEST_IS_DIR", value: 4)
!21 = !DIEnumerator(name: "G_FILE_TEST_IS_EXECUTABLE", value: 8)
!22 = !DIEnumerator(name: "G_FILE_TEST_EXISTS", value: 16)
!23 = !{!24}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!25 = !{!26, !33, !38, !57, !70, !71, !72, !73, !74}
!26 = distinct !DIGlobalVariable(name: "vm_version", scope: !0, file: !27, line: 43, type: !28, isLocal: false, isDefinition: true, variable: [20 x i8]* @vm_version)
!27 = !DIFile(filename: "cert_tool.c", directory: "/home/lichi/Desktop/open-vm-tools/line1366")
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 160, align: 8, elements: !31)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!31 = !{!32}
!32 = !DISubrange(count: 20)
!33 = distinct !DIGlobalVariable(name: "gIsLogEnabled", scope: !0, file: !27, line: 60, type: !34, isLocal: false, isDefinition: true, variable: i32* @gIsLogEnabled)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !35, line: 50, baseType: !36)
!35 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1366")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !35, line: 49, baseType: !37)
!37 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!38 = distinct !DIGlobalVariable(name: "cmdOptions", scope: !0, file: !27, line: 565, type: !39, isLocal: true, isDefinition: true, variable: [9 x %struct._GOptionEntry]* @cmdOptions)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 3456, align: 64, elements: !55)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOptionEntry", file: !4, line: 52, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GOptionEntry", file: !4, line: 257, size: 384, align: 64, elements: !42)
!42 = !{!43, !47, !48, !49, !51, !53, !54}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !41, file: !4, line: 259, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !35, line: 46, baseType: !30)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "short_name", scope: !41, file: !4, line: 260, baseType: !46, size: 8, align: 8, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !41, file: !4, line: 261, baseType: !36, size: 32, align: 32, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !41, file: !4, line: 263, baseType: !50, size: 32, align: 32, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOptionArg", file: !4, line: 129, baseType: !3)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "arg_data", scope: !41, file: !4, line: 264, baseType: !52, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !35, line: 77, baseType: !24)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !41, file: !4, line: 266, baseType: !44, size: 64, align: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "arg_description", scope: !41, file: !4, line: 267, baseType: !44, size: 64, align: 64, offset: 320)
!55 = !{!56}
!56 = !DISubrange(count: 9)
!57 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !27, line: 547, type: !58, isLocal: true, isDefinition: true, variable: %struct._options* @options)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_options", file: !27, line: 537, size: 384, align: 64, elements: !59)
!59 = !{!60, !62, !63, !64, !65, !66, !67, !68, !69}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "addCert", scope: !58, file: !27, line: 538, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "deleteCert", scope: !58, file: !27, line: 539, baseType: !61, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "outputCert", scope: !58, file: !27, line: 540, baseType: !61, size: 64, align: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "displayCert", scope: !58, file: !27, line: 541, baseType: !34, size: 32, align: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "generateCert", scope: !58, file: !27, line: 542, baseType: !34, size: 32, align: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !58, file: !27, line: 543, baseType: !34, size: 32, align: 32, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !58, file: !27, line: 544, baseType: !34, size: 32, align: 32, offset: 288)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "force", scope: !58, file: !27, line: 545, baseType: !34, size: 32, align: 32, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "erase", scope: !58, file: !27, line: 546, baseType: !34, size: 32, align: 32, offset: 352)
!70 = distinct !DIGlobalVariable(name: "guestProxyDir", scope: !0, file: !27, line: 51, type: !61, isLocal: true, isDefinition: true, variable: i8** @guestProxyDir)
!71 = distinct !DIGlobalVariable(name: "guestProxyServerDir", scope: !0, file: !27, line: 52, type: !61, isLocal: true, isDefinition: true, variable: i8** @guestProxyServerDir)
!72 = distinct !DIGlobalVariable(name: "guestProxyTrustedDir", scope: !0, file: !27, line: 53, type: !61, isLocal: true, isDefinition: true, variable: i8** @guestProxyTrustedDir)
!73 = distinct !DIGlobalVariable(name: "guestProxySslConf", scope: !0, file: !27, line: 54, type: !61, isLocal: true, isDefinition: true, variable: i8** @guestProxySslConf)
!74 = distinct !DIGlobalVariable(name: "initialized", scope: !0, file: !27, line: 50, type: !34, isLocal: true, isDefinition: true, variable: i32* @initialized)
!75 = !{i32 2, !"Dwarf Version", i32 4}
!76 = !{i32 2, !"Debug Info Version", i32 3}
!77 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!78 = distinct !DISubprogram(name: "CheckRootPriv", scope: !27, file: !27, line: 132, type: !79, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!79 = !DISubroutineType(types: !80)
!80 = !{!34}
!81 = !{}
!82 = !DILocation(line: 134, column: 8, scope: !83)
!83 = distinct !DILexicalBlock(scope: !78, file: !27, line: 134, column: 8)
!84 = !DILocation(line: 134, column: 18, scope: !83)
!85 = !DILocation(line: 134, column: 8, scope: !78)
!86 = !DILocation(line: 135, column: 6, scope: !87)
!87 = distinct !DILexicalBlock(scope: !83, file: !27, line: 134, column: 24)
!88 = !DILocation(line: 135, column: 95, scope: !87)
!89 = !DILocation(line: 135, column: 7, scope: !90)
!90 = !DILexicalBlockFile(scope: !87, file: !27, discriminator: 1)
!91 = !DILocation(line: 137, column: 7, scope: !87)
!92 = !DILocation(line: 139, column: 4, scope: !78)
!93 = !DILocation(line: 140, column: 1, scope: !78)
!94 = distinct !DISubprogram(name: "main", scope: !27, file: !27, line: 629, type: !95, isLocal: false, isDefinition: true, scopeLine: 630, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!95 = !DISubroutineType(types: !96)
!96 = !{!37, !37, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!99 = !DILocalVariable(name: "argc", arg: 1, scope: !94, file: !27, line: 629, type: !37)
!100 = !DIExpression()
!101 = !DILocation(line: 629, column: 10, scope: !94)
!102 = !DILocalVariable(name: "argv", arg: 2, scope: !94, file: !27, line: 629, type: !97)
!103 = !DILocation(line: 629, column: 23, scope: !94)
!104 = !DILocation(line: 631, column: 4, scope: !94)
!105 = !DILocation(line: 632, column: 16, scope: !106)
!106 = distinct !DILexicalBlock(scope: !94, file: !27, line: 632, column: 8)
!107 = !DILocation(line: 632, column: 8, scope: !106)
!108 = !DILocation(line: 632, column: 8, scope: !94)
!109 = !DILocation(line: 633, column: 18, scope: !110)
!110 = distinct !DILexicalBlock(scope: !106, file: !27, line: 632, column: 23)
!111 = !DILocation(line: 633, column: 7, scope: !112)
!112 = !DILexicalBlockFile(scope: !110, file: !27, discriminator: 1)
!113 = !DILocation(line: 634, column: 7, scope: !110)
!114 = !DILocation(line: 637, column: 16, scope: !115)
!115 = distinct !DILexicalBlock(scope: !94, file: !27, line: 637, column: 8)
!116 = !DILocation(line: 637, column: 8, scope: !115)
!117 = !DILocation(line: 637, column: 8, scope: !94)
!118 = !DILocation(line: 638, column: 21, scope: !119)
!119 = distinct !DILexicalBlock(scope: !115, file: !27, line: 637, column: 25)
!120 = !DILocation(line: 639, column: 4, scope: !119)
!121 = !DILocation(line: 641, column: 19, scope: !94)
!122 = !DILocation(line: 641, column: 4, scope: !123)
!123 = !DILexicalBlockFile(scope: !94, file: !27, discriminator: 1)
!124 = !DILocation(line: 663, column: 17, scope: !125)
!125 = distinct !DILexicalBlock(scope: !94, file: !27, line: 663, column: 8)
!126 = !DILocation(line: 663, column: 9, scope: !125)
!127 = !DILocation(line: 663, column: 30, scope: !125)
!128 = !DILocation(line: 663, column: 56, scope: !129)
!129 = !DILexicalBlockFile(scope: !125, file: !27, discriminator: 1)
!130 = !DILocation(line: 663, column: 34, scope: !129)
!131 = !DILocation(line: 663, column: 64, scope: !129)
!132 = !DILocation(line: 664, column: 17, scope: !125)
!133 = !DILocation(line: 664, column: 9, scope: !125)
!134 = !DILocation(line: 664, column: 29, scope: !125)
!135 = !DILocation(line: 664, column: 59, scope: !129)
!136 = !DILocation(line: 664, column: 33, scope: !129)
!137 = !DILocation(line: 664, column: 72, scope: !129)
!138 = !DILocation(line: 665, column: 17, scope: !125)
!139 = !DILocation(line: 665, column: 9, scope: !125)
!140 = !DILocation(line: 665, column: 25, scope: !125)
!141 = !DILocation(line: 665, column: 50, scope: !129)
!142 = !DILocation(line: 665, column: 29, scope: !129)
!143 = !DILocation(line: 665, column: 60, scope: !129)
!144 = !DILocation(line: 666, column: 17, scope: !125)
!145 = !DILocation(line: 666, column: 9, scope: !125)
!146 = !DILocation(line: 666, column: 28, scope: !125)
!147 = !DILocation(line: 666, column: 56, scope: !129)
!148 = !DILocation(line: 666, column: 32, scope: !129)
!149 = !DILocation(line: 666, column: 69, scope: !129)
!150 = !DILocation(line: 667, column: 17, scope: !125)
!151 = !DILocation(line: 667, column: 9, scope: !125)
!152 = !DILocation(line: 667, column: 23, scope: !125)
!153 = !DILocation(line: 667, column: 27, scope: !129)
!154 = !DILocation(line: 663, column: 8, scope: !155)
!155 = !DILexicalBlockFile(scope: !94, file: !27, discriminator: 2)
!156 = !DILocation(line: 668, column: 7, scope: !157)
!157 = distinct !DILexicalBlock(scope: !125, file: !27, line: 667, column: 46)
!158 = !DILocation(line: 670, column: 7, scope: !159)
!159 = distinct !DILexicalBlock(scope: !125, file: !27, line: 669, column: 11)
!160 = !DILocation(line: 672, column: 1, scope: !94)
!161 = distinct !DISubprogram(name: "ParseOptions", scope: !27, file: !27, line: 604, type: !162, isLocal: true, isDefinition: true, scopeLine: 606, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !164, !165}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!166 = !DILocalVariable(name: "argc", arg: 1, scope: !161, file: !27, line: 604, type: !164)
!167 = !DILocation(line: 604, column: 19, scope: !161)
!168 = !DILocalVariable(name: "argv", arg: 2, scope: !161, file: !27, line: 605, type: !165)
!169 = !DILocation(line: 605, column: 22, scope: !161)
!170 = !DILocalVariable(name: "error", scope: !161, file: !27, line: 607, type: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !173, line: 42, baseType: !174)
!173 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/open-vm-tools/line1366")
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !173, line: 44, size: 128, align: 64, elements: !175)
!175 = !{!176, !182, !183}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !174, file: !173, line: 46, baseType: !177, size: 32, align: 32)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !178, line: 36, baseType: !179)
!178 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/open-vm-tools/line1366")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !180, line: 45, baseType: !181)
!180 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line1366")
!181 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !174, file: !173, line: 47, baseType: !36, size: 32, align: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !174, file: !173, line: 48, baseType: !61, size: 64, align: 64, offset: 64)
!184 = !DILocation(line: 607, column: 12, scope: !161)
!185 = !DILocalVariable(name: "context", scope: !161, file: !27, line: 608, type: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOptionContext", file: !4, line: 38, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GOptionContext", file: !4, line: 38, flags: DIFlagFwdDecl)
!189 = !DILocation(line: 608, column: 20, scope: !161)
!190 = !DILocation(line: 610, column: 14, scope: !161)
!191 = !DILocation(line: 610, column: 12, scope: !161)
!192 = !DILocation(line: 611, column: 38, scope: !161)
!193 = !DILocation(line: 611, column: 4, scope: !161)
!194 = !DILocation(line: 617, column: 38, scope: !161)
!195 = !DILocation(line: 617, column: 4, scope: !161)
!196 = !DILocation(line: 619, column: 32, scope: !197)
!197 = distinct !DILexicalBlock(scope: !161, file: !27, line: 619, column: 8)
!198 = !DILocation(line: 619, column: 41, scope: !197)
!199 = !DILocation(line: 619, column: 47, scope: !197)
!200 = !DILocation(line: 619, column: 9, scope: !197)
!201 = !DILocation(line: 619, column: 8, scope: !161)
!202 = !DILocation(line: 620, column: 45, scope: !203)
!203 = distinct !DILexicalBlock(scope: !197, file: !27, line: 619, column: 62)
!204 = !DILocation(line: 620, column: 52, scope: !203)
!205 = !DILocation(line: 620, column: 7, scope: !203)
!206 = !DILocation(line: 621, column: 18, scope: !203)
!207 = !DILocation(line: 621, column: 7, scope: !208)
!208 = !DILexicalBlockFile(scope: !203, file: !27, discriminator: 1)
!209 = !DILocation(line: 622, column: 7, scope: !203)
!210 = !DILocation(line: 625, column: 26, scope: !161)
!211 = !DILocation(line: 625, column: 4, scope: !161)
!212 = !DILocation(line: 626, column: 1, scope: !161)
!213 = distinct !DISubprogram(name: "PrintUsage", scope: !27, file: !27, line: 79, type: !214, isLocal: true, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !44}
!216 = !DILocalVariable(name: "cmd", arg: 1, scope: !213, file: !27, line: 79, type: !44)
!217 = !DILocation(line: 79, column: 25, scope: !213)
!218 = !DILocation(line: 81, column: 11, scope: !213)
!219 = !DILocation(line: 81, column: 4, scope: !213)
!220 = !DILocation(line: 82, column: 11, scope: !213)
!221 = !DILocation(line: 82, column: 57, scope: !213)
!222 = !DILocation(line: 82, column: 4, scope: !213)
!223 = !DILocation(line: 83, column: 11, scope: !213)
!224 = !DILocation(line: 83, column: 4, scope: !213)
!225 = !DILocation(line: 101, column: 1, scope: !213)
!226 = distinct !DISubprogram(name: "InitProxyPaths", scope: !27, file: !27, line: 105, type: !214, isLocal: true, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!227 = !DILocalVariable(name: "toolDir", arg: 1, scope: !226, file: !27, line: 105, type: !44)
!228 = !DILocation(line: 105, column: 29, scope: !226)
!229 = !DILocation(line: 107, column: 37, scope: !226)
!230 = !DILocation(line: 107, column: 20, scope: !226)
!231 = !DILocation(line: 107, column: 18, scope: !226)
!232 = !DILocation(line: 108, column: 43, scope: !226)
!233 = !DILocation(line: 108, column: 26, scope: !226)
!234 = !DILocation(line: 108, column: 24, scope: !226)
!235 = !DILocation(line: 109, column: 44, scope: !226)
!236 = !DILocation(line: 109, column: 27, scope: !226)
!237 = !DILocation(line: 109, column: 25, scope: !226)
!238 = !DILocation(line: 110, column: 41, scope: !226)
!239 = !DILocation(line: 110, column: 24, scope: !226)
!240 = !DILocation(line: 110, column: 22, scope: !226)
!241 = !DILocation(line: 111, column: 1, scope: !226)
!242 = distinct !DISubprogram(name: "CreateKeyCert", scope: !27, file: !27, line: 371, type: !243, isLocal: true, isDefinition: true, scopeLine: 372, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!243 = !DISubroutineType(types: !244)
!244 = !{!34, !34}
!245 = !DILocalVariable(name: "force", arg: 1, scope: !242, file: !27, line: 371, type: !34)
!246 = !DILocation(line: 371, column: 24, scope: !242)
!247 = !DILocalVariable(name: "ret", scope: !242, file: !27, line: 373, type: !34)
!248 = !DILocation(line: 373, column: 13, scope: !242)
!249 = !DILocalVariable(name: "cert", scope: !242, file: !27, line: 374, type: !61)
!250 = !DILocation(line: 374, column: 11, scope: !242)
!251 = !DILocalVariable(name: "key", scope: !242, file: !27, line: 375, type: !61)
!252 = !DILocation(line: 375, column: 11, scope: !242)
!253 = !DILocation(line: 377, column: 9, scope: !254)
!254 = distinct !DILexicalBlock(scope: !242, file: !27, line: 377, column: 8)
!255 = !DILocation(line: 377, column: 8, scope: !242)
!256 = !DILocation(line: 378, column: 7, scope: !257)
!257 = distinct !DILexicalBlock(scope: !254, file: !27, line: 377, column: 38)
!258 = !DILocation(line: 381, column: 27, scope: !242)
!259 = !DILocation(line: 381, column: 10, scope: !242)
!260 = !DILocation(line: 381, column: 8, scope: !242)
!261 = !DILocation(line: 382, column: 28, scope: !242)
!262 = !DILocation(line: 382, column: 11, scope: !242)
!263 = !DILocation(line: 382, column: 9, scope: !242)
!264 = !DILocation(line: 389, column: 20, scope: !265)
!265 = distinct !DILexicalBlock(scope: !242, file: !27, line: 389, column: 8)
!266 = !DILocation(line: 389, column: 8, scope: !265)
!267 = !DILocation(line: 389, column: 49, scope: !265)
!268 = !DILocation(line: 390, column: 20, scope: !265)
!269 = !DILocation(line: 390, column: 8, scope: !265)
!270 = !DILocation(line: 390, column: 50, scope: !265)
!271 = !DILocation(line: 390, column: 54, scope: !272)
!272 = !DILexicalBlockFile(scope: !265, file: !27, discriminator: 1)
!273 = !DILocation(line: 389, column: 8, scope: !274)
!274 = !DILexicalBlockFile(scope: !242, file: !27, discriminator: 1)
!275 = !DILocation(line: 394, column: 14, scope: !276)
!276 = distinct !DILexicalBlock(scope: !265, file: !27, line: 390, column: 61)
!277 = !DILocation(line: 394, column: 19, scope: !276)
!278 = !DILocation(line: 394, column: 25, scope: !276)
!279 = !DILocation(line: 391, column: 7, scope: !276)
!280 = !DILocation(line: 395, column: 11, scope: !276)
!281 = !DILocation(line: 396, column: 7, scope: !276)
!282 = !DILocation(line: 399, column: 4, scope: !242)
!283 = !DILocation(line: 402, column: 33, scope: !284)
!284 = distinct !DILexicalBlock(scope: !242, file: !27, line: 401, column: 8)
!285 = !DILocation(line: 402, column: 52, scope: !284)
!286 = !DILocation(line: 402, column: 57, scope: !284)
!287 = !DILocation(line: 401, column: 9, scope: !284)
!288 = !DILocation(line: 401, column: 8, scope: !242)
!289 = !DILocation(line: 403, column: 7, scope: !290)
!290 = distinct !DILexicalBlock(scope: !284, file: !27, line: 402, column: 64)
!291 = !DILocation(line: 406, column: 8, scope: !242)
!292 = !DILocation(line: 407, column: 4, scope: !242)
!293 = !DILocation(line: 410, column: 11, scope: !242)
!294 = !DILocation(line: 410, column: 4, scope: !242)
!295 = !DILocation(line: 411, column: 11, scope: !242)
!296 = !DILocation(line: 411, column: 4, scope: !242)
!297 = !DILocation(line: 413, column: 11, scope: !242)
!298 = !DILocation(line: 413, column: 4, scope: !242)
!299 = distinct !DISubprogram(name: "DisplayServerCert", scope: !27, file: !27, line: 295, type: !300, isLocal: true, isDefinition: true, scopeLine: 296, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!300 = !DISubroutineType(types: !301)
!301 = !{!34, !44}
!302 = !DILocalVariable(name: "serverCertPemFile", arg: 1, scope: !299, file: !27, line: 295, type: !44)
!303 = !DILocation(line: 295, column: 32, scope: !299)
!304 = !DILocalVariable(name: "ret", scope: !299, file: !27, line: 297, type: !34)
!305 = !DILocation(line: 297, column: 13, scope: !299)
!306 = !DILocalVariable(name: "cert", scope: !299, file: !27, line: 298, type: !61)
!307 = !DILocation(line: 298, column: 11, scope: !299)
!308 = !DILocalVariable(name: "file", scope: !299, file: !27, line: 299, type: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !311, line: 48, baseType: !312)
!311 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1366")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !313, line: 241, size: 1728, align: 64, elements: !314)
!313 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1366")
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !335, !336, !337, !338, !342, !344, !346, !350, !353, !355, !356, !357, !358, !359, !363, !364}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !312, file: !313, line: 242, baseType: !37, size: 32, align: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !312, file: !313, line: 247, baseType: !98, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !312, file: !313, line: 248, baseType: !98, size: 64, align: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !312, file: !313, line: 249, baseType: !98, size: 64, align: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !312, file: !313, line: 250, baseType: !98, size: 64, align: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !312, file: !313, line: 251, baseType: !98, size: 64, align: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !312, file: !313, line: 252, baseType: !98, size: 64, align: 64, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !312, file: !313, line: 253, baseType: !98, size: 64, align: 64, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !312, file: !313, line: 254, baseType: !98, size: 64, align: 64, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !312, file: !313, line: 256, baseType: !98, size: 64, align: 64, offset: 576)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !312, file: !313, line: 257, baseType: !98, size: 64, align: 64, offset: 640)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !312, file: !313, line: 258, baseType: !98, size: 64, align: 64, offset: 704)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !312, file: !313, line: 260, baseType: !328, size: 64, align: 64, offset: 768)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !313, line: 156, size: 192, align: 64, elements: !330)
!330 = !{!331, !332, !334}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !329, file: !313, line: 157, baseType: !328, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !329, file: !313, line: 158, baseType: !333, size: 64, align: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !329, file: !313, line: 162, baseType: !37, size: 32, align: 32, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !312, file: !313, line: 262, baseType: !333, size: 64, align: 64, offset: 832)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !312, file: !313, line: 264, baseType: !37, size: 32, align: 32, offset: 896)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !312, file: !313, line: 268, baseType: !37, size: 32, align: 32, offset: 928)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !312, file: !313, line: 270, baseType: !339, size: 64, align: 64, offset: 960)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !340, line: 131, baseType: !341)
!340 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1366")
!341 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !312, file: !313, line: 274, baseType: !343, size: 16, align: 16, offset: 1024)
!343 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !312, file: !313, line: 275, baseType: !345, size: 8, align: 8, offset: 1040)
!345 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !312, file: !313, line: 276, baseType: !347, size: 8, align: 8, offset: 1048)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, align: 8, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 1)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !312, file: !313, line: 280, baseType: !351, size: 64, align: 64, offset: 1088)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !313, line: 150, baseType: null)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !312, file: !313, line: 289, baseType: !354, size: 64, align: 64, offset: 1152)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !340, line: 132, baseType: !341)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !312, file: !313, line: 297, baseType: !24, size: 64, align: 64, offset: 1216)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !312, file: !313, line: 298, baseType: !24, size: 64, align: 64, offset: 1280)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !312, file: !313, line: 299, baseType: !24, size: 64, align: 64, offset: 1344)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !312, file: !313, line: 300, baseType: !24, size: 64, align: 64, offset: 1408)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !312, file: !313, line: 302, baseType: !360, size: 64, align: 64, offset: 1472)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !361, line: 216, baseType: !362)
!361 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1366")
!362 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !312, file: !313, line: 303, baseType: !37, size: 32, align: 32, offset: 1536)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !312, file: !313, line: 305, baseType: !365, size: 160, align: 8, offset: 1568)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 160, align: 8, elements: !31)
!366 = !DILocation(line: 299, column: 10, scope: !299)
!367 = !DILocalVariable(name: "fmap", scope: !299, file: !27, line: 300, type: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMappedFile", file: !370, line: 32, baseType: !371)
!370 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmappedfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1366")
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMappedFile", file: !370, line: 32, flags: DIFlagFwdDecl)
!372 = !DILocation(line: 300, column: 17, scope: !299)
!373 = !DILocation(line: 302, column: 9, scope: !374)
!374 = distinct !DILexicalBlock(scope: !299, file: !27, line: 302, column: 8)
!375 = !DILocation(line: 302, column: 8, scope: !299)
!376 = !DILocation(line: 303, column: 7, scope: !377)
!377 = distinct !DILexicalBlock(scope: !374, file: !27, line: 302, column: 35)
!378 = !DILocation(line: 306, column: 28, scope: !299)
!379 = !DILocation(line: 306, column: 11, scope: !299)
!380 = !DILocation(line: 306, column: 9, scope: !299)
!381 = !DILocation(line: 307, column: 21, scope: !382)
!382 = distinct !DILexicalBlock(scope: !299, file: !27, line: 307, column: 8)
!383 = !DILocation(line: 307, column: 9, scope: !382)
!384 = !DILocation(line: 307, column: 8, scope: !299)
!385 = !DILocation(line: 308, column: 6, scope: !386)
!386 = distinct !DILexicalBlock(scope: !382, file: !27, line: 307, column: 52)
!387 = !DILocation(line: 308, column: 67, scope: !386)
!388 = !DILocation(line: 308, column: 84, scope: !386)
!389 = !DILocation(line: 308, column: 7, scope: !390)
!390 = !DILexicalBlockFile(scope: !386, file: !27, discriminator: 1)
!391 = !DILocation(line: 309, column: 7, scope: !386)
!392 = !DILocation(line: 312, column: 8, scope: !393)
!393 = distinct !DILexicalBlock(scope: !299, file: !27, line: 312, column: 8)
!394 = !DILocation(line: 312, column: 26, scope: !393)
!395 = !DILocation(line: 312, column: 36, scope: !396)
!396 = !DILexicalBlockFile(scope: !393, file: !27, discriminator: 1)
!397 = !DILocation(line: 312, column: 29, scope: !396)
!398 = !DILocation(line: 312, column: 8, scope: !396)
!399 = !DILocation(line: 313, column: 57, scope: !400)
!400 = distinct !DILexicalBlock(scope: !393, file: !27, line: 312, column: 56)
!401 = !DILocation(line: 313, column: 7, scope: !400)
!402 = !DILocation(line: 315, column: 30, scope: !403)
!403 = distinct !DILexicalBlock(scope: !400, file: !27, line: 315, column: 11)
!404 = !DILocation(line: 315, column: 36, scope: !403)
!405 = !DILocation(line: 315, column: 12, scope: !403)
!406 = !DILocation(line: 315, column: 11, scope: !400)
!407 = !DILocation(line: 316, column: 9, scope: !408)
!408 = distinct !DILexicalBlock(scope: !403, file: !27, line: 315, column: 56)
!409 = !DILocation(line: 316, column: 72, scope: !408)
!410 = !DILocation(line: 316, column: 10, scope: !411)
!411 = !DILexicalBlockFile(scope: !408, file: !27, discriminator: 1)
!412 = !DILocation(line: 317, column: 10, scope: !408)
!413 = !DILocation(line: 319, column: 7, scope: !400)
!414 = !DILocation(line: 321, column: 4, scope: !400)
!415 = !DILocation(line: 323, column: 32, scope: !416)
!416 = distinct !DILexicalBlock(scope: !393, file: !27, line: 321, column: 11)
!417 = !DILocation(line: 323, column: 14, scope: !416)
!418 = !DILocation(line: 323, column: 12, scope: !416)
!419 = !DILocation(line: 324, column: 11, scope: !420)
!420 = distinct !DILexicalBlock(scope: !416, file: !27, line: 324, column: 11)
!421 = !DILocation(line: 324, column: 11, scope: !416)
!422 = !DILocalVariable(name: "content", scope: !423, file: !27, line: 326, type: !44)
!423 = distinct !DILexicalBlock(scope: !420, file: !27, line: 324, column: 17)
