; ModuleID = './libtimeSync_la-pllLinux.o.i'
source_filename = "./libtimeSync_la-pllLinux.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.timex = type { i32, i64, i64, i64, i64, i32, i64, i64, i64, %struct.timeval, i64, i64, i64, i32, i64, i64, i64, i64, i64, i32, [44 x i8] }
%struct.timeval = type { i64, i64 }

@.str = private unnamed_addr constant [9 x i8] c"timeSync\00", align 1
@.str.1 = private unnamed_addr constant [28 x i8] c"%s: adjtimex failed: %d %s\0A\00", align 1
@__FUNCTION__.TimeSync_PLLSetFrequency = private unnamed_addr constant [25 x i8] c"TimeSync_PLLSetFrequency\00", align 1
@.str.2 = private unnamed_addr constant [31 x i8] c"%s: clamped offset at -500000\0A\00", align 1
@__FUNCTION__.TimeSync_PLLUpdate = private unnamed_addr constant [19 x i8] c"TimeSync_PLLUpdate\00", align 1
@.str.3 = private unnamed_addr constant [30 x i8] c"%s: clamped offset at 500000\0A\00", align 1
@.str.4 = private unnamed_addr constant [39 x i8] c"%s: adjtimex set offset failed: %d %s\0A\00", align 1
@.str.5 = private unnamed_addr constant [46 x i8] c"%s: adjtimex set time constant failed: %d %s\0A\00", align 1
@.str.6 = private unnamed_addr constant [23 x i8] c"Set PLL time constant\0A\00", align 1
@.str.7 = private unnamed_addr constant [39 x i8] c"%s: adjtimex set status failed: %d %s\0A\00", align 1
@.str.8 = private unnamed_addr constant [16 x i8] c"Set PLL status\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "libtimeSync_la-pllLinux.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1525")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 51, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1525")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!7 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!8 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!9 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!10 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!11 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!12 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!13 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!14 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!15 = !{i32 2, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!18 = distinct !DISubprogram(name: "TimeSync_PLLSupported", scope: !19, file: !19, line: 60, type: !20, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !25)
!19 = !DIFile(filename: "pllLinux.c", directory: "/home/lichi/Desktop/open-vm-tools/line1525")
!20 = !DISubroutineType(types: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !23, line: 230, baseType: !24)
!23 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1525")
!24 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!25 = !{}
!26 = !DILocation(line: 62, column: 4, scope: !18)
!27 = distinct !DISubprogram(name: "TimeSync_PLLSetFrequency", scope: !19, file: !19, line: 82, type: !28, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !25)
!28 = !DISubroutineType(types: !29)
!29 = !{!22, !30}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !23, line: 172, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !32, line: 40, baseType: !33)
!32 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line1525")
!33 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!34 = !DILocalVariable(name: "ppmCorrection", arg: 1, scope: !27, file: !19, line: 82, type: !30)
!35 = !DIExpression()
!36 = !DILocation(line: 82, column: 32, scope: !27)
!37 = !DILocalVariable(name: "tx", scope: !27, file: !19, line: 84, type: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timex", file: !39, line: 25, size: 1664, align: 64, elements: !40)
!39 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/timex.h", directory: "/home/lichi/Desktop/open-vm-tools/line1525")
!40 = !{!41, !43, !46, !47, !48, !49, !51, !52, !53, !54, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !38, file: !39, line: 27, baseType: !42, size: 32, align: 32)
!42 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !38, file: !39, line: 28, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !45, line: 175, baseType: !33)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1525")
!46 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !38, file: !39, line: 29, baseType: !44, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "maxerror", scope: !38, file: !39, line: 30, baseType: !44, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "esterror", scope: !38, file: !39, line: 31, baseType: !44, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !38, file: !39, line: 32, baseType: !50, size: 32, align: 32, offset: 320)
!50 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "constant", scope: !38, file: !39, line: 33, baseType: !44, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !38, file: !39, line: 34, baseType: !44, size: 64, align: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tolerance", scope: !38, file: !39, line: 35, baseType: !44, size: 64, align: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !38, file: !39, line: 36, baseType: !55, size: 128, align: 64, offset: 576)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !56, line: 30, size: 128, align: 64, elements: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line1525")
!57 = !{!58, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !55, file: !56, line: 32, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !45, line: 139, baseType: !33)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !55, file: !56, line: 33, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !45, line: 141, baseType: !33)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tick", scope: !38, file: !39, line: 37, baseType: !44, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ppsfreq", scope: !38, file: !39, line: 38, baseType: !44, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "jitter", scope: !38, file: !39, line: 39, baseType: !44, size: 64, align: 64, offset: 832)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !38, file: !39, line: 40, baseType: !50, size: 32, align: 32, offset: 896)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "stabil", scope: !38, file: !39, line: 41, baseType: !44, size: 64, align: 64, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "jitcnt", scope: !38, file: !39, line: 42, baseType: !44, size: 64, align: 64, offset: 1024)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "calcnt", scope: !38, file: !39, line: 43, baseType: !44, size: 64, align: 64, offset: 1088)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "errcnt", scope: !38, file: !39, line: 44, baseType: !44, size: 64, align: 64, offset: 1152)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "stbcnt", scope: !38, file: !39, line: 45, baseType: !44, size: 64, align: 64, offset: 1216)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tai", scope: !38, file: !39, line: 47, baseType: !50, size: 32, align: 32, offset: 1280)
!72 = !DILocation(line: 84, column: 17, scope: !27)
!73 = !DILocalVariable(name: "error", scope: !27, file: !19, line: 85, type: !50)
!74 = !DILocation(line: 85, column: 8, scope: !27)
!75 = !DILocation(line: 87, column: 7, scope: !27)
!76 = !DILocation(line: 87, column: 13, scope: !27)
!77 = !DILocation(line: 88, column: 14, scope: !27)
!78 = !DILocation(line: 88, column: 7, scope: !27)
!79 = !DILocation(line: 88, column: 12, scope: !27)
!80 = !DILocation(line: 90, column: 12, scope: !27)
!81 = !DILocation(line: 90, column: 10, scope: !27)
!82 = !DILocation(line: 91, column: 8, scope: !83)
!83 = distinct !DILexicalBlock(scope: !27, file: !19, line: 91, column: 8)
!84 = !DILocation(line: 91, column: 14, scope: !83)
!85 = !DILocation(line: 91, column: 8, scope: !27)
!86 = !DILocation(line: 92, column: 91, scope: !87)
!87 = distinct !DILexicalBlock(scope: !83, file: !19, line: 91, column: 21)
!88 = !DILocation(line: 92, column: 8, scope: !87)
!89 = !DILocation(line: 92, column: 7, scope: !87)
!90 = !DILocation(line: 92, column: 98, scope: !91)
!91 = !DILexicalBlockFile(scope: !87, file: !19, discriminator: 1)
!92 = !DILocation(line: 92, column: 7, scope: !93)
!93 = !DILexicalBlockFile(scope: !87, file: !19, discriminator: 2)
!94 = !DILocation(line: 94, column: 10, scope: !87)
!95 = !DILocation(line: 96, column: 4, scope: !27)
!96 = !DILocation(line: 98, column: 4, scope: !27)
!97 = !DILocation(line: 99, column: 1, scope: !27)
!98 = distinct !DISubprogram(name: "TimeSyncLogPLLState", scope: !19, file: !19, line: 39, type: !99, isLocal: true, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !25)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !101, !103}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!104 = !DILocalVariable(name: "prefix", arg: 1, scope: !98, file: !19, line: 39, type: !101)
!105 = !DILocation(line: 39, column: 33, scope: !98)
!106 = !DILocalVariable(name: "tx", arg: 2, scope: !98, file: !19, line: 39, type: !103)
!107 = !DILocation(line: 39, column: 55, scope: !98)
!108 = !DILocation(line: 41, column: 151, scope: !98)
!109 = !DILocation(line: 41, column: 159, scope: !98)
!110 = !DILocation(line: 41, column: 163, scope: !98)
!111 = !DILocation(line: 41, column: 171, scope: !98)
!112 = !DILocation(line: 41, column: 175, scope: !98)
!113 = !DILocation(line: 41, column: 181, scope: !98)
!114 = !DILocation(line: 41, column: 185, scope: !98)
!115 = !DILocation(line: 41, column: 195, scope: !98)
!116 = !DILocation(line: 41, column: 199, scope: !98)
!117 = !DILocation(line: 41, column: 209, scope: !98)
!118 = !DILocation(line: 41, column: 213, scope: !98)
!119 = !DILocation(line: 41, column: 221, scope: !98)
!120 = !DILocation(line: 41, column: 225, scope: !98)
!121 = !DILocation(line: 41, column: 235, scope: !98)
!122 = !DILocation(line: 41, column: 239, scope: !98)
!123 = !DILocation(line: 41, column: 250, scope: !98)
!124 = !DILocation(line: 41, column: 254, scope: !98)
!125 = !DILocation(line: 41, column: 265, scope: !98)
!126 = !DILocation(line: 41, column: 269, scope: !98)
!127 = !DILocation(line: 41, column: 4, scope: !98)
!128 = !DILocation(line: 45, column: 1, scope: !98)
!129 = distinct !DISubprogram(name: "TimeSync_PLLUpdate", scope: !19, file: !19, line: 116, type: !28, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !25)
!130 = !DILocalVariable(name: "offset", arg: 1, scope: !129, file: !19, line: 116, type: !30)
!131 = !DILocation(line: 116, column: 26, scope: !129)
!132 = !DILocalVariable(name: "tx", scope: !129, file: !19, line: 118, type: !38)
