; ModuleID = './hgfsServer.o.i'
source_filename = "./hgfsServer.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.HgfsServerMgrCallbacks = type { %struct.HgfsServerResEnumCallbacks }
%struct.HgfsServerResEnumCallbacks = type { i8* ()*, i8 (i8*, i8**, i64*, i8*)*, i8 (i8*)* }
%struct.HgfsServerConfig = type { i32, i32 }
%struct.DblLnkLst_Links = type { %struct.DblLnkLst_Links*, %struct.DblLnkLst_Links* }
%struct.MXUserExclLock = type opaque
%struct.HgfsServerCallbacks = type { %struct.HgfsServerSessionCallbacks }
%struct.HgfsServerSessionCallbacks = type { i8 (i8*, %struct.HgfsServerChannelCallbacks*, %struct.HgfsServerChannelData*, i8**)*, void (i8*)*, void (i8*)*, void (%struct.HgfsPacket*, i8*)*, void (i8*, %struct.DblLnkLst_Links*)*, i32 (i8*)*, void (%struct.HgfsPacket*, i8*)*, void (i8*, i32)* }
%struct.HgfsServerChannelCallbacks = type { void ()*, void ()*, i8* (i64, i32, i8**)*, i8* (i64, i32, i8**)*, void (i8**)*, i8 (i8*, %struct.HgfsPacket*, i32)* }
%struct.HgfsPacket = type { i64, i64, i8*, i64, i32, i64, i8, i32, i8*, i64, i32, i64, i32, i8, i32, i8*, i64, i64, i8, [2 x %struct.HgfsVmxIov], i32, [1 x %struct.HgfsVmxIov] }
%struct.HgfsVmxIov = type { i8*, i64, i32, i8* }
%struct.HgfsServerChannelData = type { i32, i32 }
%struct.HgfsServerNotifyCallbacks = type { void (%struct.HgfsSessionInfo*)*, void (%struct.HgfsSessionInfo*)*, void (i32, i64, i8*, i32, %struct.HgfsSessionInfo*)* }

!497 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20004", value: 280)
!498 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20005", value: 281)
!499 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20105", value: 282)
!500 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20106", value: 283)
!501 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20107", value: 284)
!502 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20108", value: 285)
!503 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20269", value: 286)
!504 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20833", value: 287)
!505 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20949", value: 288)
!506 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_21025", value: 289)
!507 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_21027", value: 290)
!508 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_29001", value: 291)
!509 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_38598", value: 292)
!510 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50221", value: 293)
!511 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50222", value: 294)
!512 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50229", value: 295)
!513 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50930", value: 296)
!514 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50931", value: 297)
!515 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50933", value: 298)
!516 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50935", value: 299)
!517 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50936", value: 300)
!518 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50937", value: 301)
!519 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50939", value: 302)
!520 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_51936", value: 303)
!521 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_51950", value: 304)
!522 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57002", value: 305)
!523 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57003", value: 306)
!524 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57004", value: 307)
!525 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57005", value: 308)
!526 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57006", value: 309)
!527 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57007", value: 310)
!528 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57008", value: 311)
!529 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57009", value: 312)
!530 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57010", value: 313)
!531 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57011", value: 314)
!532 = !DIEnumerator(name: "STRING_ENCODING_IBM_813", value: 315)
!533 = !DIEnumerator(name: "STRING_ENCODING_IBM_943_P130_1999", value: 316)
!534 = !DIEnumerator(name: "STRING_ENCODING_IBM_33722", value: 317)
!535 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_949", value: 318)
!536 = !DIEnumerator(name: "STRING_ENCODING_IBM_1363", value: 319)
!537 = !DIEnumerator(name: "STRING_ENCODING_IBM_1386", value: 320)
!538 = !DIEnumerator(name: "STRING_ENCODING_IBM_1373", value: 321)
!539 = !DIEnumerator(name: "STRING_ENCODING_IBM_5471", value: 322)
!540 = !DIEnumerator(name: "STRING_ENCODING_IBM_874", value: 323)
!541 = !DIEnumerator(name: "STRING_ENCODING_MAX_SPECIFIED", value: 324)
!542 = !DIEnumerator(name: "STRING_ENCODING_DEFAULT", value: -1)
!543 = !DIEnumerator(name: "STRING_ENCODING_UNKNOWN", value: -2)
!544 = !DIEnumerator(name: "STRING_ENCODING_UTF16", value: 1)
!545 = !DIEnumerator(name: "STRING_ENCODING_UTF32", value: 4)
!546 = !{!547, !548, !553, !555, !558, !779, !728, !781, !788, !789, !790, !807, !824, !736, !634, !846, !690}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !549, line: 173, baseType: !550)
!549 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line375")
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !551, line: 51, baseType: !552)
!551 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line375")
!552 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!554 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !549, line: 171, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !551, line: 55, baseType: !557)
!557 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSessionInfo", file: !4, line: 389, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsSessionInfo", file: !4, line: 309, size: 5824, align: 64, elements: !561)
!561 = !{!562, !570, !572, !574, !575, !576, !683, !684, !685, !687, !688, !689, !729, !730, !731, !732, !733, !734, !735, !755, !756, !757, !768, !769}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !560, file: !4, line: 311, baseType: !563, size: 128, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "DblLnkLst_Links", file: !564, line: 94, baseType: !565)
!564 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dbllnklst.h", directory: "/home/lichi/Desktop/open-vm-tools/line375")
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DblLnkLst_Links", file: !564, line: 91, size: 128, align: 64, elements: !566)
!566 = !{!567, !569}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !565, file: !564, line: 92, baseType: !568, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !565, file: !564, line: 93, baseType: !568, size: 64, align: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "isInactive", scope: !560, file: !4, line: 313, baseType: !571, size: 8, align: 8, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !549, line: 230, baseType: !554)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !560, file: !4, line: 316, baseType: !573, size: 32, align: 32, offset: 160)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSessionFlags", file: !19, line: 1834, baseType: !548)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sessionId", scope: !560, file: !4, line: 319, baseType: !555, size: 64, align: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "maxPacketSize", scope: !560, file: !4, line: 322, baseType: !548, size: 32, align: 32, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "transportSession", scope: !560, file: !4, line: 325, baseType: !577, size: 64, align: 64, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsTransportSessionInfo", file: !4, line: 96, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsTransportSessionInfo", file: !580, line: 129, size: 640, align: 64, elements: !581)
!580 = !DIFile(filename: "hgfsServer.c", directory: "/home/lichi/Desktop/open-vm-tools/line375")
!581 = !{!582, !583, !588, !589, !590, !591, !592, !594, !596, !669, !676}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "defaultSessionId", scope: !579, file: !580, line: 131, baseType: !555, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "sessionArrayLock", scope: !579, file: !580, line: 134, baseType: !584, size: 64, align: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserExclLock", file: !586, line: 38, baseType: !587)
!586 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/userlock.h", directory: "/home/lichi/Desktop/open-vm-tools/line375")
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserExclLock", file: !586, line: 38, flags: DIFlagFwdDecl)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "sessionArray", scope: !579, file: !580, line: 137, baseType: !563, size: 128, align: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "maxPacketSize", scope: !579, file: !580, line: 140, baseType: !548, size: 32, align: 32, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "numSessions", scope: !579, file: !580, line: 143, baseType: !548, size: 32, align: 32, offset: 288)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "transportData", scope: !579, file: !580, line: 146, baseType: !547, size: 64, align: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !579, file: !580, line: 149, baseType: !593, size: 32, align: 32, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSessionInfoState", file: !4, line: 300, baseType: !3)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !579, file: !580, line: 152, baseType: !595, size: 32, align: 32, offset: 416)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSessionInfoType", file: !4, line: 294, baseType: !8)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "channelCbTable", scope: !579, file: !580, line: 155, baseType: !597, size: 64, align: 64, offset: 448)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerChannelCallbacks", file: !13, line: 190, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerChannelCallbacks", file: !13, line: 183, size: 384, align: 64, elements: !600)
!600 = !{!601, !606, !608, !614, !615, !620}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "registerThread", scope: !599, file: !13, line: 184, baseType: !602, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelRegisterThreadFunc", file: !13, line: 180, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{null}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "unregisterThread", scope: !599, file: !13, line: 185, baseType: !607, size: 64, align: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelUnregisterThreadFunc", file: !13, line: 181, baseType: !603)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "getReadVa", scope: !599, file: !13, line: 186, baseType: !609, size: 64, align: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelMapVirtAddrFunc", file: !13, line: 178, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64, align: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!547, !555, !548, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "getWriteVa", scope: !599, file: !13, line: 187, baseType: !609, size: 64, align: 64, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "putVa", scope: !599, file: !13, line: 188, baseType: !616, size: 64, align: 64, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelUnmapVirtAddrFunc", file: !13, line: 179, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64, align: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !613}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !599, file: !13, line: 189, baseType: !621, size: 64, align: 64, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelSendFunc", file: !13, line: 175, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!571, !547, !625, !668}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsPacket", file: !13, line: 78, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsPacket", file: !13, line: 45, size: 1920, align: 64, elements: !628)
!628 = !{!629, !630, !632, !633, !636, !637, !638, !639, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !663, !664}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !627, file: !13, line: 46, baseType: !555, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !627, file: !13, line: 48, baseType: !631, size: 64, align: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsStateFlags", file: !13, line: 42, baseType: !555)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacket", scope: !627, file: !13, line: 51, baseType: !547, size: 64, align: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacketSize", scope: !627, file: !13, line: 52, baseType: !634, size: 64, align: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !635, line: 216, baseType: !557)
!635 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line375")
!636 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacketMappedIov", scope: !627, file: !13, line: 53, baseType: !548, size: 32, align: 32, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacketDataSize", scope: !627, file: !13, line: 54, baseType: !634, size: 64, align: 64, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacketIsAllocated", scope: !627, file: !13, line: 55, baseType: !571, size: 8, align: 8, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "metaMappingType", scope: !627, file: !13, line: 56, baseType: !640, size: 32, align: 32, offset: 416)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "MappingType", file: !13, line: 40, baseType: !12)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacket", scope: !627, file: !13, line: 58, baseType: !547, size: 64, align: 64, offset: 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketSize", scope: !627, file: !13, line: 59, baseType: !634, size: 64, align: 64, offset: 512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketMappedIov", scope: !627, file: !13, line: 60, baseType: !548, size: 32, align: 32, offset: 576)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketDataSize", scope: !627, file: !13, line: 61, baseType: !634, size: 64, align: 64, offset: 640)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketIovIndex", scope: !627, file: !13, line: 62, baseType: !548, size: 32, align: 32, offset: 704)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketIsAllocated", scope: !627, file: !13, line: 63, baseType: !571, size: 8, align: 8, offset: 736)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "dataMappingType", scope: !627, file: !13, line: 65, baseType: !640, size: 32, align: 32, offset: 768)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "replyPacket", scope: !627, file: !13, line: 67, baseType: !547, size: 64, align: 64, offset: 832)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "replyPacketSize", scope: !627, file: !13, line: 68, baseType: !634, size: 64, align: 64, offset: 896)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "replyPacketDataSize", scope: !627, file: !13, line: 69, baseType: !634, size: 64, align: 64, offset: 960)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "replyPacketIsAllocated", scope: !627, file: !13, line: 70, baseType: !571, size: 8, align: 8, offset: 1024)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "channelIov", scope: !627, file: !13, line: 73, baseType: !653, size: 512, align: 64, offset: 1088)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 512, align: 64, elements: !661)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsVmxIov", file: !13, line: 34, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsVmxIov", file: !13, line: 29, size: 256, align: 64, elements: !656)
!656 = !{!657, !658, !659, !660}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "va", scope: !655, file: !13, line: 30, baseType: !547, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "pa", scope: !655, file: !13, line: 31, baseType: !555, size: 64, align: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !655, file: !13, line: 32, baseType: !548, size: 32, align: 32, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !655, file: !13, line: 33, baseType: !547, size: 64, align: 64, offset: 192)
!661 = !{!662}
!662 = !DISubrange(count: 2)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "iovCount", scope: !627, file: !13, line: 75, baseType: !548, size: 32, align: 32, offset: 1600)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !627, file: !13, line: 76, baseType: !665, size: 256, align: 64, offset: 1664)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 256, align: 64, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 1)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSendFlags", file: !13, line: 98, baseType: !548)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", scope: !579, file: !580, line: 157, baseType: !670, size: 32, align: 32, offset: 512)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint32", file: !671, line: 135, baseType: !672)
!671 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_atomic.h", directory: "/home/lichi/Desktop/open-vm-tools/line375")
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint32", file: !671, line: 133, size: 32, align: 32, elements: !673)
!673 = !{!674}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !672, file: !671, line: 134, baseType: !675, size: 32, align: 32)
!675 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !548)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "channelCapabilities", scope: !579, file: !580, line: 159, baseType: !677, size: 64, align: 32, offset: 544)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerChannelData", file: !13, line: 111, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerChannelData", file: !13, line: 108, size: 64, align: 32, elements: !679)
!679 = !{!680, !682}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !678, file: !13, line: 109, baseType: !681, size: 32, align: 32)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelFlags", file: !13, line: 104, baseType: !548)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "maxPacketSize", scope: !678, file: !13, line: 110, baseType: !548, size: 32, align: 32, offset: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !560, file: !4, line: 328, baseType: !593, size: 32, align: 32, offset: 384)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "fileIOLock", scope: !560, file: !4, line: 331, baseType: !584, size: 64, align: 64, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "numInvalidationAttempts", scope: !560, file: !4, line: 333, baseType: !686, size: 32, align: 32, offset: 512)
!686 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", scope: !560, file: !4, line: 335, baseType: !670, size: 32, align: 32, offset: 544)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "nodeArrayLock", scope: !560, file: !4, line: 343, baseType: !584, size: 64, align: 64, offset: 576)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "nodeArray", scope: !560, file: !4, line: 346, baseType: !690, size: 64, align: 64, offset: 640)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsFileNode", file: !4, line: 227, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsFileNode", file: !4, line: 177, size: 1024, align: 64, elements: !693)
!693 = !{!694, !695, !697, !698, !699, !700, !701, !707, !709, !710, !711, !713, !715, !716, !717}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !692, file: !4, line: 179, baseType: !563, size: 128, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !692, file: !4, line: 182, baseType: !696, size: 32, align: 32, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsHandle", file: !19, line: 58, baseType: !548)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "utf8Name", scope: !692, file: !4, line: 185, baseType: !553, size: 64, align: 64, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "utf8NameLen", scope: !692, file: !4, line: 188, baseType: !634, size: 64, align: 64, offset: 256)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "shareName", scope: !692, file: !4, line: 191, baseType: !553, size: 64, align: 64, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "shareNameLen", scope: !692, file: !4, line: 194, baseType: !634, size: 64, align: 64, offset: 384)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "localId", scope: !692, file: !4, line: 197, baseType: !702, size: 128, align: 64, offset: 448)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsLocalId", file: !4, line: 102, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsLocalId", file: !4, line: 99, size: 128, align: 64, elements: !704)
!704 = !{!705, !706}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "volumeId", scope: !703, file: !4, line: 100, baseType: !555, size: 64, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "fileId", scope: !703, file: !4, line: 101, baseType: !555, size: 64, align: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "fileDesc", scope: !692, file: !4, line: 200, baseType: !708, size: 32, align: 32, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "fileDesc", file: !4, line: 28, baseType: !686)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !692, file: !4, line: 203, baseType: !548, size: 32, align: 32, offset: 608)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "shareAccess", scope: !692, file: !4, line: 206, baseType: !548, size: 32, align: 32, offset: 640)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "serverLock", scope: !692, file: !4, line: 209, baseType: !712, size: 32, align: 32, offset: 672)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsLockType", file: !19, line: 301, baseType: !18)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !692, file: !4, line: 212, baseType: !714, size: 32, align: 32, offset: 704)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "FileNodeState", file: !4, line: 115, baseType: !27)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !692, file: !4, line: 215, baseType: !548, size: 32, align: 32, offset: 736)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "fileCtx", scope: !692, file: !4, line: 223, baseType: !547, size: 64, align: 64, offset: 768)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "shareInfo", scope: !692, file: !4, line: 226, baseType: !718, size: 192, align: 64, offset: 832)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsShareInfo", file: !4, line: 163, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsShareInfo", file: !4, line: 145, size: 192, align: 64, elements: !720)
!720 = !{!721, !724, !725, !726, !727}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "rootDir", scope: !719, file: !4, line: 147, baseType: !722, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !554)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "rootDirLen", scope: !719, file: !4, line: 150, baseType: !634, size: 64, align: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "readPermissions", scope: !719, file: !4, line: 153, baseType: !571, size: 8, align: 8, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "writePermissions", scope: !719, file: !4, line: 156, baseType: !571, size: 8, align: 8, offset: 136)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !719, file: !4, line: 162, baseType: !728, size: 32, align: 32, offset: 160)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSharedFolderHandle", file: !13, line: 134, baseType: !548)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "numNodes", scope: !560, file: !4, line: 349, baseType: !548, size: 32, align: 32, offset: 704)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "nodeFreeList", scope: !560, file: !4, line: 352, baseType: !563, size: 128, align: 64, offset: 768)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "nodeCachedList", scope: !560, file: !4, line: 355, baseType: !563, size: 128, align: 64, offset: 896)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "numCachedOpenNodes", scope: !560, file: !4, line: 358, baseType: !552, size: 32, align: 32, offset: 1024)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "numCachedLockedNodes", scope: !560, file: !4, line: 361, baseType: !552, size: 32, align: 32, offset: 1056)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "searchArrayLock", scope: !560, file: !4, line: 370, baseType: !584, size: 64, align: 64, offset: 1088)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "searchArray", scope: !560, file: !4, line: 373, baseType: !736, size: 64, align: 64, offset: 1152)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64, align: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSearch", file: !4, line: 283, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsSearch", file: !4, line: 246, size: 768, align: 64, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745, !746, !747, !751, !752, !754}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !738, file: !4, line: 248, baseType: !563, size: 128, align: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !738, file: !4, line: 251, baseType: !548, size: 32, align: 32, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !738, file: !4, line: 254, baseType: !696, size: 32, align: 32, offset: 160)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "utf8Dir", scope: !738, file: !4, line: 257, baseType: !553, size: 64, align: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "utf8DirLen", scope: !738, file: !4, line: 260, baseType: !634, size: 64, align: 64, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "utf8ShareName", scope: !738, file: !4, line: 263, baseType: !553, size: 64, align: 64, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "utf8ShareNameLen", scope: !738, file: !4, line: 266, baseType: !634, size: 64, align: 64, offset: 384)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "dents", scope: !738, file: !4, line: 269, baseType: !748, size: 64, align: 64, offset: 448)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64, align: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64, align: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "DirectoryEntry", file: !4, line: 25, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "numDents", scope: !738, file: !4, line: 272, baseType: !548, size: 32, align: 32, offset: 512)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !738, file: !4, line: 279, baseType: !753, size: 32, align: 32, offset: 544)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "DirectorySearchType", file: !4, line: 123, baseType: !32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "shareInfo", scope: !738, file: !4, line: 282, baseType: !718, size: 192, align: 64, offset: 576)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "numSearches", scope: !560, file: !4, line: 376, baseType: !548, size: 32, align: 32, offset: 1216)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "searchFreeList", scope: !560, file: !4, line: 379, baseType: !563, size: 128, align: 64, offset: 1280)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "hgfsSessionCapabilities", scope: !560, file: !4, line: 383, baseType: !758, size: 4160, align: 8, offset: 1408)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 4160, align: 8, elements: !766)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsOpCapability", file: !19, line: 1808, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsOpCapability", file: !19, line: 1803, size: 64, align: 8, elements: !761)
!761 = !{!762, !764}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !760, file: !19, line: 1804, baseType: !763, size: 32, align: 32)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsOp", file: !19, line: 152, baseType: !37)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !760, file: !19, line: 1805, baseType: !765, size: 32, align: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsOpCapFlags", file: !19, line: 1702, baseType: !548)
!766 = !{!767}
!767 = !DISubrange(count: 65)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "numberOfCapabilities", scope: !560, file: !4, line: 385, baseType: !548, size: 32, align: 32, offset: 5568)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "asyncRequestsInfo", scope: !560, file: !4, line: 388, baseType: !770, size: 192, align: 64, offset: 5632)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsAsyncRequestInfo", file: !4, line: 307, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsAsyncRequestInfo", file: !4, line: 302, size: 192, align: 64, elements: !772)
!772 = !{!773, !774, !775}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "requestCount", scope: !771, file: !4, line: 304, baseType: !670, size: 32, align: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !771, file: !4, line: 305, baseType: !584, size: 64, align: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "requestCountIsZero", scope: !771, file: !4, line: 306, baseType: !776, size: 64, align: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64, align: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserCondVar", file: !586, line: 42, baseType: !778)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserCondVar", file: !586, line: 42, flags: DIFlagFwdDecl)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !551, line: 119, baseType: !780)
!780 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64, align: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSharedFolderProperties", file: !580, line: 283, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsSharedFolderProperties", file: !580, line: 279, size: 256, align: 64, elements: !784)
!784 = !{!785, !786, !787}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !783, file: !580, line: 280, baseType: !563, size: 128, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !783, file: !580, line: 281, baseType: !553, size: 64, align: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "notificationHandle", scope: !783, file: !580, line: 282, baseType: !728, size: 32, align: 32, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSubscriberHandle", file: !19, line: 1953, baseType: !555)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64, align: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsInputParam", file: !580, line: 175, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsInputParam", file: !580, line: 163, size: 640, align: 64, elements: !793)
!793 = !{!794, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !792, file: !580, line: 164, baseType: !795, size: 64, align: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64, align: 64)
!796 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "requestSize", scope: !792, file: !580, line: 165, baseType: !634, size: 64, align: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !792, file: !580, line: 166, baseType: !558, size: 64, align: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "transportSession", scope: !792, file: !580, line: 167, baseType: !577, size: 64, align: 64, offset: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "packet", scope: !792, file: !580, line: 168, baseType: !625, size: 64, align: 64, offset: 256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !792, file: !580, line: 169, baseType: !795, size: 64, align: 64, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "payloadOffset", scope: !792, file: !580, line: 170, baseType: !548, size: 32, align: 32, offset: 384)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "payloadSize", scope: !792, file: !580, line: 171, baseType: !634, size: 64, align: 64, offset: 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !792, file: !580, line: 172, baseType: !763, size: 32, align: 32, offset: 512)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !792, file: !580, line: 173, baseType: !548, size: 32, align: 32, offset: 544)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "sessionEnabled", scope: !792, file: !580, line: 174, baseType: !571, size: 8, align: 8, offset: 576)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64, align: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSharedFolder", file: !809, line: 68, baseType: !810)
!809 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hgfsServerPolicy.h", directory: "/home/lichi/Desktop/open-vm-tools/line375")
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsSharedFolder", file: !809, line: 45, size: 640, align: 64, elements: !811)
!811 = !{!812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !823}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !810, file: !809, line: 46, baseType: !563, size: 128, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !810, file: !809, line: 47, baseType: !722, size: 64, align: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !810, file: !809, line: 48, baseType: !722, size: 64, align: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "shareTags", scope: !810, file: !809, line: 52, baseType: !722, size: 64, align: 64, offset: 256)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "shareTagsLen", scope: !810, file: !809, line: 53, baseType: !634, size: 64, align: 64, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "nameLen", scope: !810, file: !809, line: 54, baseType: !634, size: 64, align: 64, offset: 384)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "pathLen", scope: !810, file: !809, line: 55, baseType: !634, size: 64, align: 64, offset: 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "readAccess", scope: !810, file: !809, line: 56, baseType: !571, size: 8, align: 8, offset: 512)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "writeAccess", scope: !810, file: !809, line: 57, baseType: !571, size: 8, align: 8, offset: 520)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "configOptions", scope: !810, file: !809, line: 58, baseType: !822, size: 32, align: 32, offset: 544)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsShareOptions", file: !809, line: 39, baseType: !548)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !810, file: !809, line: 59, baseType: !728, size: 32, align: 32, offset: 576)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64, align: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsHeader", file: !19, line: 1700, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsHeader", file: !19, line: 1685, size: 416, align: 8, elements: !827)
!827 = !{!828, !832, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !826, file: !19, line: 1686, baseType: !829, size: 8, align: 8)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !549, line: 177, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !551, line: 48, baseType: !831)
!831 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !826, file: !19, line: 1687, baseType: !833, size: 24, align: 8, offset: 8)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 24, align: 8, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 3)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !826, file: !19, line: 1688, baseType: !763, size: 32, align: 32, offset: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "packetSize", scope: !826, file: !19, line: 1689, baseType: !548, size: 32, align: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "headerSize", scope: !826, file: !19, line: 1690, baseType: !548, size: 32, align: 32, offset: 96)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "requestId", scope: !826, file: !19, line: 1691, baseType: !548, size: 32, align: 32, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !826, file: !19, line: 1692, baseType: !763, size: 32, align: 32, offset: 160)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !826, file: !19, line: 1693, baseType: !548, size: 32, align: 32, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !826, file: !19, line: 1694, baseType: !548, size: 32, align: 32, offset: 224)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "information", scope: !826, file: !19, line: 1695, baseType: !548, size: 32, align: 32, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "sessionId", scope: !826, file: !19, line: 1696, baseType: !555, size: 64, align: 64, offset: 288)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !826, file: !19, line: 1697, baseType: !555, size: 64, align: 64, offset: 352)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!847 = !{!848, !849, !875, !882, !883, !920, !934, !952, !953}
!848 = distinct !DIGlobalVariable(name: "gHgfsSharedFoldersList", scope: !0, file: !580, line: 270, type: !563, isLocal: true, isDefinition: true, variable: %struct.DblLnkLst_Links* @gHgfsSharedFoldersList)
!849 = distinct !DIGlobalVariable(name: "gHgfsMgrData", scope: !0, file: !580, line: 192, type: !850, isLocal: true, isDefinition: true, variable: %struct.HgfsServerMgrCallbacks** @gHgfsMgrData)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64, align: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerMgrCallbacks", file: !13, line: 162, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerMgrCallbacks", file: !13, line: 160, size: 192, align: 64, elements: !853)
!853 = !{!854}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "enumResources", scope: !852, file: !13, line: 161, baseType: !855, size: 192, align: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerResEnumCallbacks", file: !13, line: 153, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerResEnumCallbacks", file: !13, line: 149, size: 192, align: 64, elements: !857)
!857 = !{!858, !863, !870}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !856, file: !13, line: 150, baseType: !859, size: 64, align: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerResEnumInitFunc", file: !13, line: 142, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64, align: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!547}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !856, file: !13, line: 151, baseType: !864, size: 64, align: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerResEnumGetFunc", file: !13, line: 143, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64, align: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!571, !547, !789, !868, !869}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !856, file: !13, line: 152, baseType: !871, size: 64, align: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerResEnumExitFunc", file: !13, line: 147, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64, align: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!571, !547}
!875 = distinct !DIGlobalVariable(name: "gHgfsCfgSettings", scope: !0, file: !580, line: 181, type: !876, isLocal: true, isDefinition: true, variable: %struct.HgfsServerConfig* @gHgfsCfgSettings)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerConfig", file: !13, line: 127, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerConfig", file: !13, line: 124, size: 64, align: 32, elements: !878)
!878 = !{!879, !881}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !877, file: !13, line: 125, baseType: !880, size: 32, align: 32)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsConfigFlags", file: !13, line: 117, baseType: !548)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "maxCachedOpenNodes", scope: !877, file: !13, line: 126, baseType: !548, size: 32, align: 32, offset: 32)
!882 = distinct !DIGlobalVariable(name: "gHgfsSharedFoldersLock", scope: !0, file: !580, line: 267, type: !584, isLocal: true, isDefinition: true, variable: %struct.MXUserExclLock** @gHgfsSharedFoldersLock)
!883 = distinct !DIGlobalVariable(name: "gHgfsServerCBTable", scope: !0, file: !580, line: 235, type: !884, isLocal: true, isDefinition: true, variable: %struct.HgfsServerCallbacks* @gHgfsServerCBTable)
!884 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerCallbacks", file: !13, line: 206, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerCallbacks", file: !13, line: 204, size: 512, align: 64, elements: !887)
!887 = !{!888}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !886, file: !13, line: 205, baseType: !889, size: 512, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerSessionCallbacks", file: !13, line: 201, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerSessionCallbacks", file: !13, line: 192, size: 512, align: 64, elements: !891)
!891 = !{!892, !897, !901, !902, !906, !910, !914, !915}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "connect", scope: !890, file: !13, line: 193, baseType: !893, size: 64, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64, align: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!571, !547, !597, !896, !613}
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64, align: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !890, file: !13, line: 194, baseType: !898, size: 64, align: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !547}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !890, file: !13, line: 195, baseType: !898, size: 64, align: 64, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "receive", scope: !890, file: !13, line: 196, baseType: !903, size: 64, align: 64, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{null, !625, !547}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "invalidateObjects", scope: !890, file: !13, line: 197, baseType: !907, size: 64, align: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{null, !547, !846}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "invalidateInactiveSessions", scope: !890, file: !13, line: 198, baseType: !911, size: 64, align: 64, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!548, !547}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "sendComplete", scope: !890, file: !13, line: 199, baseType: !903, size: 64, align: 64, offset: 384)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "quiesce", scope: !890, file: !13, line: 200, baseType: !916, size: 64, align: 64, offset: 448)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !547, !919}
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsQuiesceOp", file: !13, line: 167, baseType: !148)
!920 = distinct !DIGlobalVariable(name: "handlers", scope: !0, file: !580, line: 2848, type: !921, isLocal: true, isDefinition: true, variable: [49 x %struct.anon]* @handlers)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !922, size: 6272, align: 64, elements: !932)
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !580, line: 2840, size: 128, align: 64, elements: !924)
!924 = !{!925, !929, !930}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !923, file: !580, line: 2841, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !790}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "minReqSize", scope: !923, file: !580, line: 2843, baseType: !552, size: 32, align: 32, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "reqType", scope: !923, file: !580, line: 2846, baseType: !931, size: 32, align: 32, offset: 96)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "RequestHint", file: !4, line: 107, baseType: !190)
!932 = !{!933}
!933 = !DISubrange(count: 49)
!934 = distinct !DIGlobalVariable(name: "gHgfsServerNotifyCBTable", scope: !0, file: !580, line: 260, type: !935, isLocal: true, isDefinition: true, variable: %struct.HgfsServerNotifyCallbacks* @gHgfsServerNotifyCBTable)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerNotifyCallbacks", file: !209, line: 65, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerNotifyCallbacks", file: !209, line: 61, size: 192, align: 64, elements: !938)
!938 = !{!939, !945, !947}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "registerThread", scope: !937, file: !209, line: 62, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsNotifyRegisterThreadCb", file: !209, line: 53, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !944}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "unregisterThread", scope: !937, file: !209, line: 63, baseType: !946, size: 64, align: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsNotifyUnregisterThreadCb", file: !209, line: 54, baseType: !941)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "eventReceive", scope: !937, file: !209, line: 64, baseType: !948, size: 64, align: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsNotifyEventReceiveCb", file: !209, line: 55, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{null, !728, !788, !553, !548, !944}
!952 = distinct !DIGlobalVariable(name: "gHgfsDirNotifyActive", scope: !0, file: !580, line: 277, type: !571, isLocal: true, isDefinition: true, variable: i8* @gHgfsDirNotifyActive)
!953 = distinct !DIGlobalVariable(name: "hgfsHandleCounter", scope: !0, file: !580, line: 190, type: !670, isLocal: true, isDefinition: true, variable: %struct.Atomic_uint32* @hgfsHandleCounter)
!954 = !{i32 2, !"Dwarf Version", i32 4}
!955 = !{i32 2, !"Debug Info Version", i32 3}
!956 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!957 = distinct !DISubprogram(name: "HgfsServerTransportSessionGet", scope: !580, file: !580, line: 467, type: !958, isLocal: false, isDefinition: true, scopeLine: 468, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !577}
!960 = !{}
!961 = !DILocalVariable(name: "transportSession", arg: 1, scope: !957, file: !580, line: 467, type: !577)
!962 = !DIExpression()
!963 = !DILocation(line: 467, column: 57, scope: !957)
!964 = !DILocation(line: 470, column: 18, scope: !957)
!965 = !DILocation(line: 470, column: 36, scope: !957)
!966 = !DILocation(line: 470, column: 4, scope: !957)
!967 = !DILocation(line: 471, column: 1, scope: !957)
!968 = distinct !DISubprogram(name: "Atomic_Inc32", scope: !671, file: !671, line: 1636, type: !969, isLocal: true, isDefinition: true, scopeLine: 1637, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!969 = !DISubroutineType(types: !970)
!970 = !{null, !971}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64, align: 64)
!972 = !DILocalVariable(name: "var", arg: 1, scope: !968, file: !671, line: 1636, type: !971)
!973 = !DILocation(line: 1636, column: 29, scope: !968)
!974 = !DILocation(line: 1645, column: 15, scope: !968)
!975 = !DILocation(line: 1645, column: 20, scope: !968)
!976 = !DILocation(line: 1643, column: 4, scope: !968)
!977 = !{i32 211931}
!978 = !DILocation(line: 1655, column: 1, scope: !968)
!979 = distinct !DISubprogram(name: "HgfsHandle2FileDesc", scope: !580, file: !580, line: 704, type: !980, isLocal: false, isDefinition: true, scopeLine: 708, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!980 = !DISubroutineType(types: !981)
!981 = !{!571, !696, !558, !982, !613}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64, align: 64)
!983 = !DILocalVariable(name: "handle", arg: 1, scope: !979, file: !580, line: 704, type: !696)
!984 = !DILocation(line: 704, column: 32, scope: !979)
!985 = !DILocalVariable(name: "session", arg: 2, scope: !979, file: !580, line: 705, type: !558)
!986 = !DILocation(line: 705, column: 38, scope: !979)
!987 = !DILocalVariable(name: "fd", arg: 3, scope: !979, file: !580, line: 706, type: !982)
!988 = !DILocation(line: 706, column: 31, scope: !979)
!989 = !DILocalVariable(name: "fileCtx", arg: 4, scope: !979, file: !580, line: 707, type: !613)
!990 = !DILocation(line: 707, column: 28, scope: !979)
!991 = !DILocalVariable(name: "found", scope: !979, file: !580, line: 709, type: !571)
!992 = !DILocation(line: 709, column: 9, scope: !979)
!993 = !DILocalVariable(name: "fileNode", scope: !979, file: !580, line: 710, type: !690)
!994 = !DILocation(line: 710, column: 18, scope: !979)
!995 = !DILocation(line: 712, column: 27, scope: !979)
!996 = !DILocation(line: 712, column: 36, scope: !979)
!997 = !DILocation(line: 712, column: 4, scope: !979)
!998 = !DILocation(line: 713, column: 35, scope: !979)
!999 = !DILocation(line: 713, column: 43, scope: !979)
!1000 = !DILocation(line: 713, column: 15, scope: !979)
!1001 = !DILocation(line: 713, column: 13, scope: !979)
!1002 = !DILocation(line: 714, column: 8, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !979, file: !580, line: 714, column: 8)
!1004 = !DILocation(line: 714, column: 17, scope: !1003)
!1005 = !DILocation(line: 714, column: 8, scope: !979)
!1006 = !DILocation(line: 715, column: 7, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1003, file: !580, line: 714, column: 25)
!1008 = !DILocation(line: 718, column: 10, scope: !979)
!1009 = !DILocation(line: 718, column: 20, scope: !979)
!1010 = !DILocation(line: 718, column: 5, scope: !979)
!1011 = !DILocation(line: 718, column: 8, scope: !979)
!1012 = !DILocation(line: 719, column: 8, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !979, file: !580, line: 719, column: 8)
!1014 = !DILocation(line: 719, column: 8, scope: !979)
!1015 = !DILocation(line: 720, column: 18, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1013, file: !580, line: 719, column: 17)
!1017 = !DILocation(line: 720, column: 28, scope: !1016)
!1018 = !DILocation(line: 720, column: 8, scope: !1016)
!1019 = !DILocation(line: 720, column: 16, scope: !1016)
!1020 = !DILocation(line: 721, column: 4, scope: !1016)
!1021 = !DILocation(line: 722, column: 10, scope: !979)
!1022 = !DILocation(line: 722, column: 4, scope: !979)
!1023 = !DILocation(line: 725, column: 27, scope: !979)
!1024 = !DILocation(line: 725, column: 36, scope: !979)
!1025 = !DILocation(line: 725, column: 4, scope: !979)
!1026 = !DILocation(line: 727, column: 11, scope: !979)
!1027 = !DILocation(line: 727, column: 4, scope: !979)
!1028 = distinct !DISubprogram(name: "HgfsHandle2FileNode", scope: !580, file: !580, line: 595, type: !1029, isLocal: true, isDefinition: true, scopeLine: 597, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!690, !696, !558}
!1031 = !DILocalVariable(name: "handle", arg: 1, scope: !1028, file: !580, line: 595, type: !696)
!1032 = !DILocation(line: 595, column: 32, scope: !1028)
!1033 = !DILocalVariable(name: "session", arg: 2, scope: !1028, file: !580, line: 596, type: !558)
!1034 = !DILocation(line: 596, column: 38, scope: !1028)
!1035 = !DILocalVariable(name: "i", scope: !1028, file: !580, line: 598, type: !552)
!1036 = !DILocation(line: 598, column: 17, scope: !1028)
!1037 = !DILocalVariable(name: "fileNode", scope: !1028, file: !580, line: 599, type: !690)
!1038 = !DILocation(line: 599, column: 18, scope: !1028)
!1039 = !DILocation(line: 605, column: 11, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1028, file: !580, line: 605, column: 4)
!1041 = !DILocation(line: 605, column: 9, scope: !1040)
!1042 = !DILocation(line: 605, column: 16, scope: !1043)
!1043 = !DILexicalBlockFile(scope: !1044, file: !580, discriminator: 1)
!1044 = distinct !DILexicalBlock(scope: !1040, file: !580, line: 605, column: 4)
!1045 = !DILocation(line: 605, column: 20, scope: !1043)
!1046 = !DILocation(line: 605, column: 29, scope: !1043)
!1047 = !DILocation(line: 605, column: 18, scope: !1043)
!1048 = !DILocation(line: 605, column: 4, scope: !1043)
!1049 = !DILocation(line: 606, column: 30, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1051, file: !580, line: 606, column: 11)
!1051 = distinct !DILexicalBlock(scope: !1044, file: !580, line: 605, column: 44)
!1052 = !DILocation(line: 606, column: 11, scope: !1050)
!1053 = !DILocation(line: 606, column: 20, scope: !1050)
!1054 = !DILocation(line: 606, column: 33, scope: !1050)
!1055 = !DILocation(line: 606, column: 39, scope: !1050)
!1056 = !DILocation(line: 606, column: 64, scope: !1050)
!1057 = !DILocation(line: 607, column: 30, scope: !1050)
!1058 = !DILocation(line: 607, column: 11, scope: !1050)
!1059 = !DILocation(line: 607, column: 20, scope: !1050)
!1060 = !DILocation(line: 607, column: 33, scope: !1050)
!1061 = !DILocation(line: 607, column: 43, scope: !1050)
!1062 = !DILocation(line: 607, column: 40, scope: !1050)
!1063 = !DILocation(line: 606, column: 11, scope: !1064)
!1064 = !DILexicalBlockFile(scope: !1051, file: !580, discriminator: 1)
!1065 = !DILocation(line: 608, column: 41, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1050, file: !580, line: 607, column: 51)
!1067 = !DILocation(line: 608, column: 22, scope: !1066)
!1068 = !DILocation(line: 608, column: 31, scope: !1066)
!1069 = !DILocation(line: 608, column: 19, scope: !1066)
!1070 = !DILocation(line: 609, column: 10, scope: !1066)
!1071 = !DILocation(line: 611, column: 4, scope: !1051)
!1072 = !DILocation(line: 605, column: 40, scope: !1073)
!1073 = !DILexicalBlockFile(scope: !1044, file: !580, discriminator: 2)
!1074 = !DILocation(line: 605, column: 4, scope: !1073)
!1075 = distinct !{!1075, !1076}
!1076 = !DILocation(line: 605, column: 4, scope: !1028)
!1077 = !DILocation(line: 613, column: 11, scope: !1028)
!1078 = !DILocation(line: 613, column: 4, scope: !1028)
!1079 = distinct !DISubprogram(name: "HgfsHandle2AppendFlag", scope: !580, file: !580, line: 750, type: !1080, isLocal: false, isDefinition: true, scopeLine: 753, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!571, !696, !558, !869}
!1082 = !DILocalVariable(name: "handle", arg: 1, scope: !1079, file: !580, line: 750, type: !696)
!1083 = !DILocation(line: 750, column: 34, scope: !1079)
!1084 = !DILocalVariable(name: "session", arg: 2, scope: !1079, file: !580, line: 751, type: !558)
!1085 = !DILocation(line: 751, column: 40, scope: !1079)
!1086 = !DILocalVariable(name: "appendFlag", arg: 3, scope: !1079, file: !580, line: 752, type: !869)
!1087 = !DILocation(line: 752, column: 29, scope: !1079)
!1088 = !DILocalVariable(name: "found", scope: !1079, file: !580, line: 754, type: !571)
!1089 = !DILocation(line: 754, column: 9, scope: !1079)
!1090 = !DILocalVariable(name: "fileNode", scope: !1079, file: !580, line: 755, type: !690)
!1091 = !DILocation(line: 755, column: 18, scope: !1079)
!1092 = !DILocation(line: 757, column: 27, scope: !1079)
!1093 = !DILocation(line: 757, column: 36, scope: !1079)
!1094 = !DILocation(line: 757, column: 4, scope: !1079)
!1095 = !DILocation(line: 758, column: 35, scope: !1079)
!1096 = !DILocation(line: 758, column: 43, scope: !1079)
!1097 = !DILocation(line: 758, column: 15, scope: !1079)
!1098 = !DILocation(line: 758, column: 13, scope: !1079)
!1099 = !DILocation(line: 759, column: 8, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1079, file: !580, line: 759, column: 8)
!1101 = !DILocation(line: 759, column: 17, scope: !1100)
!1102 = !DILocation(line: 759, column: 8, scope: !1079)
!1103 = !DILocation(line: 760, column: 7, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1100, file: !580, line: 759, column: 25)
!1105 = !DILocation(line: 763, column: 18, scope: !1079)
!1106 = !DILocation(line: 763, column: 28, scope: !1079)
!1107 = !DILocation(line: 763, column: 34, scope: !1079)
!1108 = !DILocation(line: 763, column: 5, scope: !1079)
!1109 = !DILocation(line: 763, column: 16, scope: !1079)
!1110 = !DILocation(line: 764, column: 10, scope: !1079)
!1111 = !DILocation(line: 764, column: 4, scope: !1079)
!1112 = !DILocation(line: 767, column: 27, scope: !1079)
!1113 = !DILocation(line: 767, column: 36, scope: !1079)
!1114 = !DILocation(line: 767, column: 4, scope: !1079)
!1115 = !DILocation(line: 769, column: 11, scope: !1079)
!1116 = !DILocation(line: 769, column: 4, scope: !1079)
!1117 = distinct !DISubprogram(name: "HgfsHandle2LocalId", scope: !580, file: !580, line: 792, type: !1118, isLocal: false, isDefinition: true, scopeLine: 795, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!571, !696, !558, !1120}
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64, align: 64)
!1121 = !DILocalVariable(name: "handle", arg: 1, scope: !1117, file: !580, line: 792, type: !696)
!1122 = !DILocation(line: 792, column: 31, scope: !1117)
!1123 = !DILocalVariable(name: "session", arg: 2, scope: !1117, file: !580, line: 793, type: !558)
!1124 = !DILocation(line: 793, column: 37, scope: !1117)
!1125 = !DILocalVariable(name: "localId", arg: 3, scope: !1117, file: !580, line: 794, type: !1120)
!1126 = !DILocation(line: 794, column: 33, scope: !1117)
!1127 = !DILocalVariable(name: "found", scope: !1117, file: !580, line: 796, type: !571)
!1128 = !DILocation(line: 796, column: 9, scope: !1117)
!1129 = !DILocalVariable(name: "fileNode", scope: !1117, file: !580, line: 797, type: !690)
!1130 = !DILocation(line: 797, column: 18, scope: !1117)
!1131 = !DILocation(line: 801, column: 27, scope: !1117)
!1132 = !DILocation(line: 801, column: 36, scope: !1117)
!1133 = !DILocation(line: 801, column: 4, scope: !1117)
!1134 = !DILocation(line: 802, column: 35, scope: !1117)
!1135 = !DILocation(line: 802, column: 43, scope: !1117)
!1136 = !DILocation(line: 802, column: 15, scope: !1117)
!1137 = !DILocation(line: 802, column: 13, scope: !1117)
!1138 = !DILocation(line: 803, column: 8, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1117, file: !580, line: 803, column: 8)
!1140 = !DILocation(line: 803, column: 17, scope: !1139)
!1141 = !DILocation(line: 803, column: 8, scope: !1117)
!1142 = !DILocation(line: 804, column: 7, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1139, file: !580, line: 803, column: 25)
!1144 = !DILocation(line: 807, column: 24, scope: !1117)
!1145 = !DILocation(line: 807, column: 34, scope: !1117)
!1146 = !DILocation(line: 807, column: 42, scope: !1117)
!1147 = !DILocation(line: 807, column: 4, scope: !1117)
!1148 = !DILocation(line: 807, column: 13, scope: !1117)
!1149 = !DILocation(line: 807, column: 22, scope: !1117)
!1150 = !DILocation(line: 808, column: 22, scope: !1117)
!1151 = !DILocation(line: 808, column: 32, scope: !1117)
!1152 = !DILocation(line: 808, column: 40, scope: !1117)
!1153 = !DILocation(line: 808, column: 4, scope: !1117)
!1154 = !DILocation(line: 808, column: 13, scope: !1117)
!1155 = !DILocation(line: 808, column: 20, scope: !1117)
!1156 = !DILocation(line: 810, column: 10, scope: !1117)
!1157 = !DILocation(line: 810, column: 4, scope: !1117)
!1158 = !DILocation(line: 813, column: 27, scope: !1117)
!1159 = !DILocation(line: 813, column: 36, scope: !1117)
!1160 = !DILocation(line: 813, column: 4, scope: !1117)
!1161 = !DILocation(line: 815, column: 11, scope: !1117)
!1162 = !DILocation(line: 815, column: 4, scope: !1117)
!1163 = distinct !DISubprogram(name: "HgfsFileDesc2Handle", scope: !580, file: !580, line: 837, type: !1164, isLocal: false, isDefinition: true, scopeLine: 840, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!571, !708, !558, !1166}
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!1167 = !DILocalVariable(name: "fd", arg: 1, scope: !1163, file: !580, line: 837, type: !708)
!1168 = !DILocation(line: 837, column: 30, scope: !1163)
!1169 = !DILocalVariable(name: "session", arg: 2, scope: !1163, file: !580, line: 838, type: !558)
!1170 = !DILocation(line: 838, column: 38, scope: !1163)
!1171 = !DILocalVariable(name: "handle", arg: 3, scope: !1163, file: !580, line: 839, type: !1166)
!1172 = !DILocation(line: 839, column: 33, scope: !1163)
!1173 = !DILocalVariable(name: "i", scope: !1163, file: !580, line: 841, type: !552)
!1174 = !DILocation(line: 841, column: 17, scope: !1163)
!1175 = !DILocalVariable(name: "found", scope: !1163, file: !580, line: 842, type: !571)
!1176 = !DILocation(line: 842, column: 9, scope: !1163)
!1177 = !DILocalVariable(name: "existingFileNode", scope: !1163, file: !580, line: 843, type: !690)
!1178 = !DILocation(line: 843, column: 18, scope: !1163)
!1179 = !DILocation(line: 848, column: 27, scope: !1163)
!1180 = !DILocation(line: 848, column: 36, scope: !1163)
!1181 = !DILocation(line: 848, column: 4, scope: !1163)
!1182 = !DILocation(line: 850, column: 11, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1163, file: !580, line: 850, column: 4)
!1184 = !DILocation(line: 850, column: 9, scope: !1183)
!1185 = !DILocation(line: 850, column: 16, scope: !1186)
!1186 = !DILexicalBlockFile(scope: !1187, file: !580, discriminator: 1)
!1187 = distinct !DILexicalBlock(scope: !1183, file: !580, line: 850, column: 4)
!1188 = !DILocation(line: 850, column: 20, scope: !1186)
!1189 = !DILocation(line: 850, column: 29, scope: !1186)
!1190 = !DILocation(line: 850, column: 18, scope: !1186)
!1191 = !DILocation(line: 850, column: 4, scope: !1186)
!1192 = !DILocation(line: 851, column: 46, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1187, file: !580, line: 850, column: 44)
!1194 = !DILocation(line: 851, column: 27, scope: !1193)
!1195 = !DILocation(line: 851, column: 36, scope: !1193)
!1196 = !DILocation(line: 851, column: 24, scope: !1193)
!1197 = !DILocation(line: 852, column: 12, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1193, file: !580, line: 852, column: 11)
!1199 = !DILocation(line: 852, column: 30, scope: !1198)
!1200 = !DILocation(line: 852, column: 36, scope: !1198)
!1201 = !DILocation(line: 852, column: 69, scope: !1198)
!1202 = !DILocation(line: 853, column: 12, scope: !1198)
!1203 = !DILocation(line: 853, column: 30, scope: !1198)
!1204 = !DILocation(line: 853, column: 42, scope: !1198)
!1205 = !DILocation(line: 853, column: 39, scope: !1198)
!1206 = !DILocation(line: 852, column: 11, scope: !1207)
!1207 = !DILexicalBlockFile(scope: !1193, file: !580, discriminator: 1)
!1208 = !DILocation(line: 854, column: 40, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1198, file: !580, line: 853, column: 47)
!1210 = !DILocation(line: 854, column: 20, scope: !1209)
!1211 = !DILocation(line: 854, column: 11, scope: !1209)
!1212 = !DILocation(line: 854, column: 18, scope: !1209)
!1213 = !DILocation(line: 855, column: 16, scope: !1209)
!1214 = !DILocation(line: 856, column: 10, scope: !1209)
!1215 = !DILocation(line: 858, column: 4, scope: !1193)
!1216 = !DILocation(line: 850, column: 40, scope: !1217)
!1217 = !DILexicalBlockFile(scope: !1187, file: !580, discriminator: 2)
!1218 = !DILocation(line: 850, column: 4, scope: !1217)
!1219 = distinct !{!1219, !1220}
!1220 = !DILocation(line: 850, column: 4, scope: !1163)
!1221 = !DILocation(line: 860, column: 27, scope: !1163)
!1222 = !DILocation(line: 860, column: 36, scope: !1163)
!1223 = !DILocation(line: 860, column: 4, scope: !1163)
!1224 = !DILocation(line: 862, column: 11, scope: !1163)
!1225 = !DILocation(line: 862, column: 4, scope: !1163)
!1226 = distinct !DISubprogram(name: "HgfsFileNode2Handle", scope: !580, file: !580, line: 637, type: !1227, isLocal: true, isDefinition: true, scopeLine: 638, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!696, !1229}
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !691)
!1231 = !DILocalVariable(name: "fileNode", arg: 1, scope: !1226, file: !580, line: 637, type: !1229)
!1232 = !DILocation(line: 637, column: 41, scope: !1226)
!1233 = !DILocation(line: 641, column: 11, scope: !1226)
!1234 = !DILocation(line: 641, column: 21, scope: !1226)
!1235 = !DILocation(line: 641, column: 4, scope: !1226)
!1236 = distinct !DISubprogram(name: "HgfsHandle2ShareMode", scope: !580, file: !580, line: 884, type: !1237, isLocal: false, isDefinition: true, scopeLine: 887, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!571, !696, !558, !1239}
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsOpenMode", file: !107, line: 125, baseType: !106)
!1241 = !DILocalVariable(name: "handle", arg: 1, scope: !1236, file: !580, line: 884, type: !696)
!1242 = !DILocation(line: 884, column: 33, scope: !1236)
!1243 = !DILocalVariable(name: "session", arg: 2, scope: !1236, file: !580, line: 885, type: !558)
!1244 = !DILocation(line: 885, column: 39, scope: !1236)
!1245 = !DILocalVariable(name: "shareMode", arg: 3, scope: !1236, file: !580, line: 886, type: !1239)
!1246 = !DILocation(line: 886, column: 36, scope: !1236)
!1247 = !DILocalVariable(name: "found", scope: !1236, file: !580, line: 888, type: !571)
!1248 = !DILocation(line: 888, column: 9, scope: !1236)
!1249 = !DILocalVariable(name: "existingFileNode", scope: !1236, file: !580, line: 889, type: !690)
!1250 = !DILocation(line: 889, column: 18, scope: !1236)
!1251 = !DILocalVariable(name: "nameStatus", scope: !1236, file: !580, line: 890, type: !1252)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsNameStatus", file: !114, line: 79, baseType: !113)
!1253 = !DILocation(line: 890, column: 19, scope: !1236)
!1254 = !DILocation(line: 892, column: 8, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1236, file: !580, line: 892, column: 8)
!1256 = !DILocation(line: 892, column: 18, scope: !1255)
!1257 = !DILocation(line: 892, column: 8, scope: !1236)
!1258 = !DILocation(line: 893, column: 14, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1255, file: !580, line: 892, column: 26)
!1260 = !DILocation(line: 893, column: 7, scope: !1259)
!1261 = !DILocation(line: 896, column: 27, scope: !1236)
!1262 = !DILocation(line: 896, column: 36, scope: !1236)
!1263 = !DILocation(line: 896, column: 4, scope: !1236)
!1264 = !DILocation(line: 898, column: 43, scope: !1236)
!1265 = !DILocation(line: 898, column: 51, scope: !1236)
!1266 = !DILocation(line: 898, column: 23, scope: !1236)
!1267 = !DILocation(line: 898, column: 21, scope: !1236)
!1268 = !DILocation(line: 899, column: 8, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1236, file: !580, line: 899, column: 8)
!1270 = !DILocation(line: 899, column: 25, scope: !1269)
!1271 = !DILocation(line: 899, column: 8, scope: !1236)
!1272 = !DILocation(line: 900, column: 7, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1269, file: !580, line: 899, column: 33)
!1274 = !DILocation(line: 903, column: 47, scope: !1236)
!1275 = !DILocation(line: 903, column: 65, scope: !1236)
!1276 = !DILocation(line: 904, column: 47, scope: !1236)
!1277 = !DILocation(line: 904, column: 65, scope: !1236)
!1278 = !DILocation(line: 905, column: 47, scope: !1236)
!1279 = !DILocation(line: 903, column: 17, scope: !1236)
!1280 = !DILocation(line: 903, column: 15, scope: !1236)
!1281 = !DILocation(line: 906, column: 13, scope: !1236)
!1282 = !DILocation(line: 906, column: 24, scope: !1236)
!1283 = !DILocation(line: 906, column: 12, scope: !1236)
!1284 = !DILocation(line: 906, column: 10, scope: !1236)
!1285 = !DILocation(line: 906, column: 4, scope: !1236)
!1286 = !DILocation(line: 909, column: 27, scope: !1236)
!1287 = !DILocation(line: 909, column: 36, scope: !1236)
!1288 = !DILocation(line: 909, column: 4, scope: !1236)
!1289 = !DILocation(line: 911, column: 11, scope: !1236)
!1290 = !DILocation(line: 911, column: 4, scope: !1236)
!1291 = !DILocation(line: 912, column: 1, scope: !1236)
!1292 = distinct !DISubprogram(name: "HgfsHandle2FileName", scope: !580, file: !580, line: 933, type: !1293, isLocal: false, isDefinition: true, scopeLine: 937, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{!571, !696, !558, !1295, !868}
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!1296 = !DILocalVariable(name: "handle", arg: 1, scope: !1292, file: !580, line: 933, type: !696)
!1297 = !DILocation(line: 933, column: 32, scope: !1292)
!1298 = !DILocalVariable(name: "session", arg: 2, scope: !1292, file: !580, line: 934, type: !558)
!1299 = !DILocation(line: 934, column: 38, scope: !1292)
!1300 = !DILocalVariable(name: "fileName", arg: 3, scope: !1292, file: !580, line: 935, type: !1295)
!1301 = !DILocation(line: 935, column: 28, scope: !1292)
!1302 = !DILocalVariable(name: "fileNameSize", arg: 4, scope: !1292, file: !580, line: 936, type: !868)
!1303 = !DILocation(line: 936, column: 29, scope: !1292)
!1304 = !DILocalVariable(name: "unused1", scope: !1292, file: !580, line: 938, type: !571)
!1305 = !DILocation(line: 938, column: 9, scope: !1292)
!1306 = !DILocalVariable(name: "unused2", scope: !1292, file: !580, line: 938, type: !571)
!1307 = !DILocation(line: 938, column: 18, scope: !1292)
!1308 = !DILocation(line: 939, column: 35, scope: !1292)
!1309 = !DILocation(line: 939, column: 43, scope: !1292)
!1310 = !DILocation(line: 939, column: 72, scope: !1292)
!1311 = !DILocation(line: 940, column: 35, scope: !1292)
!1312 = !DILocation(line: 939, column: 11, scope: !1292)
!1313 = !DILocation(line: 939, column: 4, scope: !1292)
!1314 = distinct !DISubprogram(name: "HgfsHandle2FileNameMode", scope: !580, file: !580, line: 963, type: !1315, isLocal: false, isDefinition: true, scopeLine: 969, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{!571, !696, !558, !869, !869, !1295, !868}
!1317 = !DILocalVariable(name: "handle", arg: 1, scope: !1314, file: !580, line: 963, type: !696)
!1318 = !DILocation(line: 963, column: 36, scope: !1314)
!1319 = !DILocalVariable(name: "session", arg: 2, scope: !1314, file: !580, line: 964, type: !558)
!1320 = !DILocation(line: 964, column: 42, scope: !1314)
!1321 = !DILocalVariable(name: "readPermissions", arg: 3, scope: !1314, file: !580, line: 965, type: !869)
!1322 = !DILocation(line: 965, column: 31, scope: !1314)
!1323 = !DILocalVariable(name: "writePermissions", arg: 4, scope: !1314, file: !580, line: 966, type: !869)
!1324 = !DILocation(line: 966, column: 31, scope: !1314)
!1325 = !DILocalVariable(name: "fileName", arg: 5, scope: !1314, file: !580, line: 967, type: !1295)
!1326 = !DILocation(line: 967, column: 32, scope: !1314)
!1327 = !DILocalVariable(name: "fileNameSize", arg: 6, scope: !1314, file: !580, line: 968, type: !868)
!1328 = !DILocation(line: 968, column: 33, scope: !1314)
!1329 = !DILocalVariable(name: "found", scope: !1314, file: !580, line: 970, type: !571)
!1330 = !DILocation(line: 970, column: 9, scope: !1314)
!1331 = !DILocalVariable(name: "existingFileNode", scope: !1314, file: !580, line: 971, type: !690)
!1332 = !DILocation(line: 971, column: 18, scope: !1314)
!1333 = !DILocalVariable(name: "name", scope: !1314, file: !580, line: 972, type: !553)
!1334 = !DILocation(line: 972, column: 10, scope: !1314)
!1335 = !DILocalVariable(name: "nameSize", scope: !1314, file: !580, line: 973, type: !634)
!1336 = !DILocation(line: 973, column: 11, scope: !1314)
!1337 = !DILocation(line: 975, column: 9, scope: !1338)
!1338 = distinct !DILexicalBlock(scope: !1314, file: !580, line: 975, column: 8)
!1339 = !DILocation(line: 975, column: 18, scope: !1338)
!1340 = !DILocation(line: 975, column: 26, scope: !1338)
!1341 = !DILocation(line: 975, column: 30, scope: !1342)
!1342 = !DILexicalBlockFile(scope: !1338, file: !580, discriminator: 1)
!1343 = !DILocation(line: 975, column: 43, scope: !1342)
!1344 = !DILocation(line: 975, column: 8, scope: !1342)
!1345 = !DILocation(line: 976, column: 14, scope: !1346)
!1346 = distinct !DILexicalBlock(scope: !1338, file: !580, line: 975, column: 53)
!1347 = !DILocation(line: 976, column: 7, scope: !1346)
!1348 = !DILocation(line: 979, column: 27, scope: !1314)
!1349 = !DILocation(line: 979, column: 36, scope: !1314)
!1350 = !DILocation(line: 979, column: 4, scope: !1314)
!1351 = !DILocation(line: 981, column: 43, scope: !1314)
!1352 = !DILocation(line: 981, column: 51, scope: !1314)
!1353 = !DILocation(line: 981, column: 23, scope: !1314)
!1354 = !DILocation(line: 981, column: 21, scope: !1314)
!1355 = !DILocation(line: 982, column: 8, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1314, file: !580, line: 982, column: 8)
!1357 = !DILocation(line: 982, column: 25, scope: !1356)
!1358 = !DILocation(line: 982, column: 8, scope: !1314)
!1359 = !DILocation(line: 983, column: 7, scope: !1360)
!1360 = distinct !DILexicalBlock(scope: !1356, file: !580, line: 982, column: 33)
!1361 = !DILocation(line: 986, column: 18, scope: !1314)
!1362 = !DILocation(line: 986, column: 36, scope: !1314)
!1363 = !DILocation(line: 986, column: 48, scope: !1314)
!1364 = !DILocation(line: 986, column: 11, scope: !1314)
!1365 = !DILocation(line: 986, column: 9, scope: !1314)
!1366 = !DILocation(line: 987, column: 8, scope: !1367)
!1367 = distinct !DILexicalBlock(scope: !1314, file: !580, line: 987, column: 8)
!1368 = !DILocation(line: 987, column: 13, scope: !1367)
!1369 = !DILocation(line: 987, column: 8, scope: !1314)
!1370 = !DILocation(line: 988, column: 7, scope: !1371)
!1371 = distinct !DILexicalBlock(scope: !1367, file: !580, line: 987, column: 21)
!1372 = !DILocation(line: 990, column: 23, scope: !1314)
!1373 = !DILocation(line: 990, column: 41, scope: !1314)
!1374 = !DILocation(line: 990, column: 51, scope: !1314)
!1375 = !DILocation(line: 990, column: 5, scope: !1314)
!1376 = !DILocation(line: 990, column: 21, scope: !1314)
!1377 = !DILocation(line: 991, column: 24, scope: !1314)
!1378 = !DILocation(line: 991, column: 42, scope: !1314)
!1379 = !DILocation(line: 991, column: 52, scope: !1314)
!1380 = !DILocation(line: 991, column: 5, scope: !1314)
!1381 = !DILocation(line: 991, column: 22, scope: !1314)
!1382 = !DILocation(line: 992, column: 15, scope: !1314)
!1383 = !DILocation(line: 992, column: 33, scope: !1314)
!1384 = !DILocation(line: 992, column: 13, scope: !1314)
!1385 = !DILocation(line: 993, column: 11, scope: !1314)
!1386 = !DILocation(line: 993, column: 17, scope: !1314)
!1387 = !DILocation(line: 993, column: 35, scope: !1314)
!1388 = !DILocation(line: 993, column: 45, scope: !1314)
!1389 = !DILocation(line: 993, column: 4, scope: !1314)
!1390 = !DILocation(line: 994, column: 9, scope: !1314)
!1391 = !DILocation(line: 994, column: 4, scope: !1314)
!1392 = !DILocation(line: 994, column: 19, scope: !1314)
!1393 = !DILocation(line: 995, column: 10, scope: !1314)
!1394 = !DILocation(line: 995, column: 4, scope: !1314)
!1395 = !DILocation(line: 998, column: 27, scope: !1314)
!1396 = !DILocation(line: 998, column: 36, scope: !1314)
!1397 = !DILocation(line: 998, column: 4, scope: !1314)
!1398 = !DILocation(line: 1000, column: 16, scope: !1314)
!1399 = !DILocation(line: 1000, column: 5, scope: !1314)
!1400 = !DILocation(line: 1000, column: 14, scope: !1314)
!1401 = !DILocation(line: 1001, column: 20, scope: !1314)
!1402 = !DILocation(line: 1001, column: 5, scope: !1314)
!1403 = !DILocation(line: 1001, column: 18, scope: !1314)
!1404 = !DILocation(line: 1003, column: 11, scope: !1314)
!1405 = !DILocation(line: 1003, column: 4, scope: !1314)
!1406 = !DILocation(line: 1004, column: 1, scope: !1314)
!1407 = distinct !DISubprogram(name: "HgfsGetNodeCopy", scope: !580, file: !580, line: 1079, type: !1408, isLocal: false, isDefinition: true, scopeLine: 1083, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!1408 = !DISubroutineType(types: !1409)
!1409 = !{!571, !696, !558, !571, !690}
!1410 = !DILocalVariable(name: "handle", arg: 1, scope: !1407, file: !580, line: 1079, type: !696)
!1411 = !DILocation(line: 1079, column: 28, scope: !1407)
!1412 = !DILocalVariable(name: "session", arg: 2, scope: !1407, file: !580, line: 1080, type: !558)
!1413 = !DILocation(line: 1080, column: 34, scope: !1407)
!1414 = !DILocalVariable(name: "copyName", arg: 3, scope: !1407, file: !580, line: 1081, type: !571)
!1415 = !DILocation(line: 1081, column: 22, scope: !1407)
!1416 = !DILocalVariable(name: "copy", arg: 4, scope: !1407, file: !580, line: 1082, type: !690)
!1417 = !DILocation(line: 1082, column: 31, scope: !1407)
!1418 = !DILocalVariable(name: "original", scope: !1407, file: !580, line: 1084, type: !690)
!1419 = !DILocation(line: 1084, column: 18, scope: !1407)
!1420 = !DILocalVariable(name: "found", scope: !1407, file: !580, line: 1085, type: !571)
!1421 = !DILocation(line: 1085, column: 9, scope: !1407)
!1422 = !DILocation(line: 1089, column: 27, scope: !1407)
!1423 = !DILocation(line: 1089, column: 36, scope: !1407)
!1424 = !DILocation(line: 1089, column: 4, scope: !1407)
!1425 = !DILocation(line: 1091, column: 35, scope: !1407)
!1426 = !DILocation(line: 1091, column: 43, scope: !1407)
!1427 = !DILocation(line: 1091, column: 15, scope: !1407)
!1428 = !DILocation(line: 1091, column: 13, scope: !1407)
!1429 = !DILocation(line: 1092, column: 8, scope: !1430)
!1430 = distinct !DILexicalBlock(scope: !1407, file: !580, line: 1092, column: 8)
!1431 = !DILocation(line: 1092, column: 17, scope: !1430)
!1432 = !DILocation(line: 1092, column: 8, scope: !1407)
!1433 = !DILocation(line: 1093, column: 7, scope: !1434)
!1434 = distinct !DILexicalBlock(scope: !1430, file: !580, line: 1092, column: 25)
!1435 = !DILocation(line: 1096, column: 8, scope: !1436)
!1436 = distinct !DILexicalBlock(scope: !1407, file: !580, line: 1096, column: 8)
!1437 = !DILocation(line: 1096, column: 8, scope: !1407)
!1438 = !DILocation(line: 1097, column: 31, scope: !1439)
!1439 = distinct !DILexicalBlock(scope: !1436, file: !580, line: 1096, column: 18)
!1440 = !DILocation(line: 1097, column: 41, scope: !1439)
!1441 = !DILocation(line: 1097, column: 53, scope: !1439)
!1442 = !DILocation(line: 1097, column: 24, scope: !1439)
!1443 = !DILocation(line: 1097, column: 7, scope: !1439)
!1444 = !DILocation(line: 1097, column: 13, scope: !1439)
!1445 = !DILocation(line: 1097, column: 22, scope: !1439)
!1446 = !DILocation(line: 1098, column: 11, scope: !1447)
!1447 = distinct !DILexicalBlock(scope: !1439, file: !580, line: 1098, column: 11)
!1448 = !DILocation(line: 1098, column: 17, scope: !1447)
!1449 = !DILocation(line: 1098, column: 26, scope: !1447)
!1450 = !DILocation(line: 1098, column: 11, scope: !1439)
!1451 = !DILocation(line: 1099, column: 10, scope: !1452)
!1452 = distinct !DILexicalBlock(scope: !1447, file: !580, line: 1098, column: 34)
!1453 = !DILocation(line: 1101, column: 27, scope: !1439)
!1454 = !DILocation(line: 1101, column: 37, scope: !1439)
!1455 = !DILocation(line: 1101, column: 7, scope: !1439)
!1456 = !DILocation(line: 1101, column: 13, scope: !1439)
!1457 = !DILocation(line: 1101, column: 25, scope: !1439)
!1458 = !DILocation(line: 1102, column: 14, scope: !1439)
!1459 = !DILocation(line: 1102, column: 20, scope: !1439)
!1460 = !DILocation(line: 1102, column: 30, scope: !1439)
!1461 = !DILocation(line: 1102, column: 40, scope: !1439)
!1462 = !DILocation(line: 1102, column: 50, scope: !1439)
!1463 = !DILocation(line: 1102, column: 56, scope: !1439)
!1464 = !DILocation(line: 1102, column: 7, scope: !1439)
!1465 = !DILocation(line: 1103, column: 22, scope: !1439)
!1466 = !DILocation(line: 1103, column: 28, scope: !1439)
!1467 = !DILocation(line: 1103, column: 7, scope: !1439)
!1468 = !DILocation(line: 1103, column: 13, scope: !1439)
!1469 = !DILocation(line: 1103, column: 41, scope: !1439)
!1470 = !DILocation(line: 1104, column: 4, scope: !1439)
!1471 = !DILocation(line: 1105, column: 7, scope: !1472)
!1472 = distinct !DILexicalBlock(scope: !1436, file: !580, line: 1104, column: 11)
!1473 = !DILocation(line: 1105, column: 13, scope: !1472)
!1474 = !DILocation(line: 1105, column: 22, scope: !1472)
!1475 = !DILocation(line: 1106, column: 7, scope: !1472)
!1476 = !DILocation(line: 1106, column: 13, scope: !1472)
!1477 = !DILocation(line: 1106, column: 25, scope: !1472)
!1478 = !DILocation(line: 1109, column: 4, scope: !1407)
!1479 = !DILocation(line: 1109, column: 10, scope: !1407)
!1480 = !DILocation(line: 1109, column: 20, scope: !1407)
!1481 = !DILocation(line: 1109, column: 30, scope: !1407)
!1482 = !DILocation(line: 1110, column: 21, scope: !1407)
!1483 = !DILocation(line: 1110, column: 31, scope: !1407)
!1484 = !DILocation(line: 1110, column: 4, scope: !1407)
!1485 = !DILocation(line: 1110, column: 10, scope: !1407)
!1486 = !DILocation(line: 1110, column: 19, scope: !1407)
!1487 = !DILocation(line: 1111, column: 17, scope: !1407)
!1488 = !DILocation(line: 1111, column: 27, scope: !1407)
!1489 = !DILocation(line: 1111, column: 4, scope: !1407)
!1490 = !DILocation(line: 1111, column: 10, scope: !1407)
!1491 = !DILocation(line: 1111, column: 15, scope: !1407)
!1492 = !DILocation(line: 1112, column: 24, scope: !1407)
!1493 = !DILocation(line: 1112, column: 34, scope: !1407)
!1494 = !DILocation(line: 1112, column: 4, scope: !1407)
!1495 = !DILocation(line: 1112, column: 10, scope: !1407)
!1496 = !DILocation(line: 1112, column: 22, scope: !1407)
!1497 = !DILocation(line: 1113, column: 18, scope: !1407)
!1498 = !DILocation(line: 1113, column: 28, scope: !1407)
!1499 = !DILocation(line: 1113, column: 4, scope: !1407)
!1500 = !DILocation(line: 1113, column: 10, scope: !1407)
!1501 = !DILocation(line: 1113, column: 16, scope: !1407)
!1502 = !DILocation(line: 1114, column: 18, scope: !1407)
!1503 = !DILocation(line: 1114, column: 28, scope: !1407)
!1504 = !DILocation(line: 1114, column: 4, scope: !1407)
!1505 = !DILocation(line: 1114, column: 10, scope: !1407)
!1506 = !DILocation(line: 1114, column: 16, scope: !1407)
!1507 = !DILocation(line: 1115, column: 19, scope: !1407)
!1508 = !DILocation(line: 1115, column: 29, scope: !1407)
!1509 = !DILocation(line: 1115, column: 4, scope: !1407)
!1510 = !DILocation(line: 1115, column: 10, scope: !1407)
!1511 = !DILocation(line: 1115, column: 17, scope: !1407)
!1512 = !DILocation(line: 1116, column: 20, scope: !1407)
!1513 = !DILocation(line: 1116, column: 30, scope: !1407)
!1514 = !DILocation(line: 1116, column: 4, scope: !1407)
!1515 = !DILocation(line: 1116, column: 10, scope: !1407)
!1516 = !DILocation(line: 1116, column: 18, scope: !1407)
!1517 = !DILocation(line: 1117, column: 10, scope: !1407)
!1518 = !DILocation(line: 1117, column: 4, scope: !1407)
!1519 = !DILocation(line: 1120, column: 27, scope: !1407)
!1520 = !DILocation(line: 1120, column: 36, scope: !1407)
!1521 = !DILocation(line: 1120, column: 4, scope: !1407)
!1522 = !DILocation(line: 1122, column: 11, scope: !1407)
!1523 = !DILocation(line: 1122, column: 4, scope: !1407)
!1524 = distinct !DISubprogram(name: "HgfsHandleIsSequentialOpen", scope: !580, file: !580, line: 1144, type: !1080, isLocal: false, isDefinition: true, scopeLine: 1147, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!1525 = !DILocalVariable(name: "handle", arg: 1, scope: !1524, file: !580, line: 1144, type: !696)
!1526 = !DILocation(line: 1144, column: 39, scope: !1524)
!1527 = !DILocalVariable(name: "session", arg: 2, scope: !1524, file: !580, line: 1145, type: !558)
!1528 = !DILocation(line: 1145, column: 45, scope: !1524)
!1529 = !DILocalVariable(name: "sequentialOpen", arg: 3, scope: !1524, file: !580, line: 1146, type: !869)
!1530 = !DILocation(line: 1146, column: 34, scope: !1524)
!1531 = !DILocalVariable(name: "node", scope: !1524, file: !580, line: 1148, type: !690)
!1532 = !DILocation(line: 1148, column: 18, scope: !1524)
!1533 = !DILocalVariable(name: "success", scope: !1524, file: !580, line: 1149, type: !571)
!1534 = !DILocation(line: 1149, column: 9, scope: !1524)
!1535 = !DILocation(line: 1153, column: 27, scope: !1524)
!1536 = !DILocation(line: 1153, column: 36, scope: !1524)
!1537 = !DILocation(line: 1153, column: 4, scope: !1524)
!1538 = !DILocation(line: 1155, column: 31, scope: !1524)
!1539 = !DILocation(line: 1155, column: 39, scope: !1524)
!1540 = !DILocation(line: 1155, column: 11, scope: !1524)
!1541 = !DILocation(line: 1155, column: 9, scope: !1524)
!1542 = !DILocation(line: 1156, column: 8, scope: !1543)
!1543 = distinct !DILexicalBlock(scope: !1524, file: !580, line: 1156, column: 8)
!1544 = !DILocation(line: 1156, column: 13, scope: !1543)
!1545 = !DILocation(line: 1156, column: 8, scope: !1524)
!1546 = !DILocation(line: 1157, column: 7, scope: !1547)
!1547 = distinct !DILexicalBlock(scope: !1543, file: !580, line: 1156, column: 21)
!1548 = !DILocation(line: 1160, column: 22, scope: !1524)
!1549 = !DILocation(line: 1160, column: 28, scope: !1524)
!1550 = !DILocation(line: 1160, column: 34, scope: !1524)
!1551 = !DILocation(line: 1160, column: 5, scope: !1524)
!1552 = !DILocation(line: 1160, column: 20, scope: !1524)
!1553 = !DILocation(line: 1161, column: 12, scope: !1524)
!1554 = !DILocation(line: 1161, column: 4, scope: !1524)
!1555 = !DILocation(line: 1164, column: 27, scope: !1524)
!1556 = !DILocation(line: 1164, column: 36, scope: !1524)
!1557 = !DILocation(line: 1164, column: 4, scope: !1524)
!1558 = !DILocation(line: 1166, column: 11, scope: !1524)
!1559 = !DILocation(line: 1166, column: 4, scope: !1524)
!1560 = distinct !DISubprogram(name: "HgfsHandleIsSharedFolderOpen", scope: !580, file: !580, line: 1188, type: !1080, isLocal: false, isDefinition: true, scopeLine: 1191, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!1561 = !DILocalVariable(name: "handle", arg: 1, scope: !1560, file: !580, line: 1188, type: !696)
!1562 = !DILocation(line: 1188, column: 41, scope: !1560)
!1563 = !DILocalVariable(name: "session", arg: 2, scope: !1560, file: !580, line: 1189, type: !558)
!1564 = !DILocation(line: 1189, column: 47, scope: !1560)
!1565 = !DILocalVariable(name: "sharedFolderOpen", arg: 3, scope: !1560, file: !580, line: 1190, type: !869)
!1566 = !DILocation(line: 1190, column: 36, scope: !1560)
!1567 = !DILocalVariable(name: "node", scope: !1560, file: !580, line: 1192, type: !690)
!1568 = !DILocation(line: 1192, column: 18, scope: !1560)
!1569 = !DILocalVariable(name: "success", scope: !1560, file: !580, line: 1193, type: !571)
!1570 = !DILocation(line: 1193, column: 9, scope: !1560)
!1571 = !DILocation(line: 1197, column: 27, scope: !1560)
!1572 = !DILocation(line: 1197, column: 36, scope: !1560)
!1573 = !DILocation(line: 1197, column: 4, scope: !1560)
!1574 = !DILocation(line: 1199, column: 31, scope: !1560)
!1575 = !DILocation(line: 1199, column: 39, scope: !1560)
!1576 = !DILocation(line: 1199, column: 11, scope: !1560)
!1577 = !DILocation(line: 1199, column: 9, scope: !1560)
!1578 = !DILocation(line: 1200, column: 8, scope: !1579)
!1579 = distinct !DILexicalBlock(scope: !1560, file: !580, line: 1200, column: 8)
!1580 = !DILocation(line: 1200, column: 13, scope: !1579)
!1581 = !DILocation(line: 1200, column: 8, scope: !1560)
!1582 = !DILocation(line: 1201, column: 7, scope: !1583)
!1583 = distinct !DILexicalBlock(scope: !1579, file: !580, line: 1200, column: 21)
!1584 = !DILocation(line: 1204, column: 24, scope: !1560)
!1585 = !DILocation(line: 1204, column: 30, scope: !1560)
!1586 = !DILocation(line: 1204, column: 36, scope: !1560)
!1587 = !DILocation(line: 1204, column: 5, scope: !1560)
!1588 = !DILocation(line: 1204, column: 22, scope: !1560)
!1589 = !DILocation(line: 1205, column: 12, scope: !1560)
!1590 = !DILocation(line: 1205, column: 4, scope: !1560)
!1591 = !DILocation(line: 1208, column: 27, scope: !1560)
!1592 = !DILocation(line: 1208, column: 36, scope: !1560)
!1593 = !DILocation(line: 1208, column: 4, scope: !1560)
!1594 = !DILocation(line: 1210, column: 11, scope: !1560)
!1595 = !DILocation(line: 1210, column: 4, scope: !1560)
!1596 = distinct !DISubprogram(name: "HgfsUpdateNodeFileDesc", scope: !580, file: !580, line: 1233, type: !1597, isLocal: false, isDefinition: true, scopeLine: 1237, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{!571, !696, !558, !708, !547}
!1599 = !DILocalVariable(name: "handle", arg: 1, scope: !1596, file: !580, line: 1233, type: !696)
!1600 = !DILocation(line: 1233, column: 35, scope: !1596)
!1601 = !DILocalVariable(name: "session", arg: 2, scope: !1596, file: !580, line: 1234, type: !558)
!1602 = !DILocation(line: 1234, column: 41, scope: !1596)
!1603 = !DILocalVariable(name: "fd", arg: 3, scope: !1596, file: !580, line: 1235, type: !708)
!1604 = !DILocation(line: 1235, column: 33, scope: !1596)
!1605 = !DILocalVariable(name: "fileCtx", arg: 4, scope: !1596, file: !580, line: 1236, type: !547)
!1606 = !DILocation(line: 1236, column: 30, scope: !1596)
!1607 = !DILocalVariable(name: "node", scope: !1596, file: !580, line: 1238, type: !690)
!1608 = !DILocation(line: 1238, column: 18, scope: !1596)
!1609 = !DILocalVariable(name: "updated", scope: !1596, file: !580, line: 1239, type: !571)
!1610 = !DILocation(line: 1239, column: 9, scope: !1596)
!1611 = !DILocation(line: 1241, column: 27, scope: !1596)
!1612 = !DILocation(line: 1241, column: 36, scope: !1596)
!1613 = !DILocation(line: 1241, column: 4, scope: !1596)
!1614 = !DILocation(line: 1243, column: 31, scope: !1596)
!1615 = !DILocation(line: 1243, column: 39, scope: !1596)
!1616 = !DILocation(line: 1243, column: 11, scope: !1596)
!1617 = !DILocation(line: 1243, column: 9, scope: !1596)
!1618 = !DILocation(line: 1244, column: 8, scope: !1619)
!1619 = distinct !DILexicalBlock(scope: !1596, file: !580, line: 1244, column: 8)
!1620 = !DILocation(line: 1244, column: 13, scope: !1619)
!1621 = !DILocation(line: 1244, column: 8, scope: !1596)
!1622 = !DILocation(line: 1245, column: 7, scope: !1623)
!1623 = distinct !DILexicalBlock(scope: !1619, file: !580, line: 1244, column: 21)
!1624 = !DILocation(line: 1248, column: 21, scope: !1596)
!1625 = !DILocation(line: 1248, column: 4, scope: !1596)
!1626 = !DILocation(line: 1248, column: 10, scope: !1596)
!1627 = !DILocation(line: 1248, column: 19, scope: !1596)
!1628 = !DILocation(line: 1249, column: 20, scope: !1596)
!1629 = !DILocation(line: 1249, column: 4, scope: !1596)
!1630 = !DILocation(line: 1249, column: 10, scope: !1596)
!1631 = !DILocation(line: 1249, column: 18, scope: !1596)
!1632 = !DILocation(line: 1250, column: 12, scope: !1596)
!1633 = !DILocation(line: 1250, column: 4, scope: !1596)
!1634 = !DILocation(line: 1253, column: 27, scope: !1596)
!1635 = !DILocation(line: 1253, column: 36, scope: !1596)
!1636 = !DILocation(line: 1253, column: 4, scope: !1596)
!1637 = !DILocation(line: 1255, column: 11, scope: !1596)
!1638 = !DILocation(line: 1255, column: 4, scope: !1596)
!1639 = distinct !DISubprogram(name: "HgfsUpdateNodeServerLock", scope: !580, file: !580, line: 1278, type: !1640, isLocal: false, isDefinition: true, scopeLine: 1281, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !960)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{!571, !708, !558, !712}
!1642 = !DILocalVariable(name: "fd", arg: 1, scope: !1639, file: !580, line: 1278, type: !708)
!1643 = !DILocation(line: 1278, column: 35, scope: !1639)
!1644 = !DILocalVariable(name: "session", arg: 2, scope: !1639, file: !580, line: 1279, type: !558)
!1645 = !DILocation(line: 1279, column: 43, scope: !1639)
!1646 = !DILocalVariable(name: "serverLock", arg: 3, scope: !1639, file: !580, line: 1280, type: !712)
!1647 = !DILocation(line: 1280, column: 39, scope: !1639)
!1648 = !DILocalVariable(name: "i", scope: !1639, file: !580, line: 1282, type: !552)
!1649 = !DILocation(line: 1282, column: 17, scope: !1639)
!1650 = !DILocalVariable(name: "existingFileNode", scope: !1639, file: !580, line: 1283, type: !690)
!1651 = !DILocation(line: 1283, column: 18, scope: !1639)
!1652 = !DILocalVariable(name: "updated", scope: !1639, file: !580, line: 1284, type: !571)
!1653 = !DILocation(line: 1284, column: 9, scope: !1639)
!1654 = !DILocation(line: 1289, column: 27, scope: !1639)
!1655 = !DILocation(line: 1289, column: 36, scope: !1639)
!1656 = !DILocation(line: 1289, column: 4, scope: !1639)
!1657 = !DILocation(line: 1291, column: 11, scope: !1658)
!1658 = distinct !DILexicalBlock(scope: !1639, file: !580, line: 1291, column: 4)
!1659 = !DILocation(line: 1291, column: 9, scope: !1658)
!1660 = !DILocation(line: 1291, column: 16, scope: !1661)
!1661 = !DILexicalBlockFile(scope: !1662, file: !580, discriminator: 1)
!1662 = distinct !DILexicalBlock(scope: !1658, file: !580, line: 1291, column: 4)
!1663 = !DILocation(line: 1291, column: 20, scope: !1661)
!1664 = !DILocation(line: 1291, column: 29, scope: !1661)
!1665 = !DILocation(line: 1291, column: 18, scope: !1661)
!1666 = !DILocation(line: 1291, column: 4, scope: !1661)
!1667 = !DILocation(line: 1292, column: 46, scope: !1668)
!1668 = distinct !DILexicalBlock(scope: !1662, file: !580, line: 1291, column: 44)
!1669 = !DILocation(line: 1292, column: 27, scope: !1668)
!1670 = !DILocation(line: 1292, column: 36, scope: !1668)
!1671 = !DILocation(line: 1292, column: 24, scope: !1668)
!1672 = !DILocation(line: 1293, column: 11, scope: !1673)
!1673 = distinct !DILexicalBlock(scope: !1668, file: !580, line: 1293, column: 11)
!1674 = !DILocation(line: 1293, column: 29, scope: !1673)
!1675 = !DILocation(line: 1293, column: 35, scope: !1673)
!1676 = !DILocation(line: 1293, column: 11, scope: !1668)
!1677 = !DILocation(line: 1294, column: 14, scope: !1678)
!1678 = distinct !DILexicalBlock(scope: !1679, file: !580, line: 1294, column: 14)
!1679 = distinct !DILexicalBlock(scope: !1673, file: !580, line: 1293, column: 61)
!1680 = !DILocation(line: 1294, column: 32, scope: !1678)
!1681 = !DILocation(line: 1294, column: 44, scope: !1678)
!1682 = !DILocation(line: 1294, column: 41, scope: !1678)
!1683 = !DILocation(line: 1294, column: 14, scope: !1679)
!1684 = !DILocation(line: 1295, column: 44, scope: !1685)
!1685 = distinct !DILexicalBlock(scope: !1678, file: !580, line: 1294, column: 48)
!1686 = !DILocation(line: 1295, column: 13, scope: !1685)
!1687 = !DILocation(line: 1295, column: 31, scope: !1685)
!1688 = !DILocation(line: 1295, column: 42, scope: !1685)
!1689 = !DILocation(line: 1296, column: 21, scope: !1685)
