; ModuleID = './libSyncDriver_la-syncDriverLinux.o.i'
source_filename = "./libSyncDriver_la-syncDriverLinux.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct.SyncHandle = type { i32 (%struct.SyncHandle*)*, void (%struct.SyncHandle*)*, void (%struct.SyncHandle*, i8**, i8*)* }
%struct.DynBuf = type { i8*, i64, i64 }
%struct.LinuxDriver = type { %struct.SyncHandle, i64, i32* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [44 x i8] c"SyncDriver: Freezing using Linux ioctls...\0A\00", align 1
@.str.1 = private unnamed_addr constant [14 x i8] c"VERIFY %s:%d\0A\00", align 1
@.str.2 = private unnamed_addr constant [18 x i8] c"syncDriverLinux.c\00", align 1
@.str.3 = private unnamed_addr constant [32 x i8] c"SyncDriver: opening path '%s'.\0A\00", align 1
@.str.4 = private unnamed_addr constant [45 x i8] c"SyncDriver: cannot find the directory '%s'.\0A\00", align 1
@.str.5 = private unnamed_addr constant [51 x i8] c"SyncDriver: cannot access mounted directory '%s'.\0A\00", align 1
@.str.6 = private unnamed_addr constant [45 x i8] c"SyncDriver: no such device or address '%s'.\0A\00", align 1
@.str.7 = private unnamed_addr constant [47 x i8] c"SyncDriver: I/O error reading directory '%s'.\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9)
!1 = !DIFile(filename: "libSyncDriver_la-syncDriverLinux.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line974")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 37, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "syncDriverInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line974")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "SD_SUCCESS", value: 0)
!7 = !DIEnumerator(name: "SD_ERROR", value: 1)
!8 = !DIEnumerator(name: "SD_UNAVAILABLE", value: 2)
!9 = !{!10, !11, !20}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !13, line: 37, baseType: !14)
!13 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line974")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !13, line: 39, size: 128, align: 64, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !14, file: !13, line: 41, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !18, line: 77, baseType: !10)
!18 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line974")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !14, file: !13, line: 42, baseType: !11, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinuxDriver", file: !22, line: 50, baseType: !23)
!22 = !DIFile(filename: "syncDriverLinux.c", directory: "/home/lichi/Desktop/open-vm-tools/line974")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinuxDriver", file: !22, line: 46, size: 320, align: 64, elements: !24)
!24 = !{!25, !53, !57}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !23, file: !22, line: 47, baseType: !26, size: 192, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyncHandle", file: !4, line: 53, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SyncHandle", file: !4, line: 46, size: 192, align: 64, elements: !28)
!28 = !{!29, !38, !42}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "thaw", scope: !27, file: !4, line: 47, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyncDriverErr", file: !4, line: 41, baseType: !3)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyncDriverHandle", file: !36, line: 41, baseType: !37)
!36 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/syncDriver.h", directory: "/home/lichi/Desktop/open-vm-tools/line974")
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !27, file: !4, line: 48, baseType: !39, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !35}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !27, file: !4, line: 50, baseType: !43, size: 64, align: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !34, !46, !50}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!49 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !52, line: 230, baseType: !49)
!52 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line974")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "fdCnt", scope: !23, file: !22, line: 48, baseType: !54, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !55, line: 216, baseType: !56)
!55 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line974")
!56 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !23, file: !22, line: 49, baseType: !58, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!60 = !{i32 2, !"Dwarf Version", i32 4}
!61 = !{i32 2, !"Debug Info Version", i32 3}
!62 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!63 = distinct !DISubprogram(name: "LinuxDriver_Freeze", scope: !22, file: !22, line: 165, type: !64, isLocal: false, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !69)
!64 = !DISubroutineType(types: !65)
!65 = !{!33, !66, !68}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!69 = !{}
!70 = !DILocalVariable(name: "paths", arg: 1, scope: !63, file: !22, line: 165, type: !66)
!71 = !DIExpression()
!72 = !DILocation(line: 165, column: 34, scope: !63)
!73 = !DILocalVariable(name: "handle", arg: 2, scope: !63, file: !22, line: 166, type: !68)
!74 = !DILocation(line: 166, column: 38, scope: !63)
!75 = !DILocalVariable(name: "count", scope: !63, file: !22, line: 168, type: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !77, line: 109, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line974")
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !79, line: 172, baseType: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line974")
!80 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!81 = !DILocation(line: 168, column: 12, scope: !63)
!82 = !DILocalVariable(name: "first", scope: !63, file: !22, line: 169, type: !51)
!83 = !DILocation(line: 169, column: 9, scope: !63)
!84 = !DILocalVariable(name: "fds", scope: !63, file: !22, line: 170, type: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "DynBuf", file: !86, line: 40, baseType: !87)
!86 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dynbuf.h", directory: "/home/lichi/Desktop/open-vm-tools/line974")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynBuf", file: !86, line: 36, size: 192, align: 64, elements: !88)
!88 = !{!89, !91, !92}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !87, file: !86, line: 37, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !87, file: !86, line: 38, baseType: !54, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !87, file: !86, line: 39, baseType: !54, size: 64, align: 64, offset: 128)
!93 = !DILocation(line: 170, column: 11, scope: !63)
!94 = !DILocalVariable(name: "sync", scope: !63, file: !22, line: 171, type: !20)
!95 = !DILocation(line: 171, column: 17, scope: !63)
!96 = !DILocalVariable(name: "err", scope: !63, file: !22, line: 172, type: !33)
!97 = !DILocation(line: 172, column: 18, scope: !63)
!98 = !DILocation(line: 174, column: 4, scope: !63)
!99 = !DILocation(line: 176, column: 4, scope: !63)
!100 = !DILocation(line: 178, column: 11, scope: !63)
!101 = !DILocation(line: 178, column: 9, scope: !63)
!102 = !DILocation(line: 179, column: 8, scope: !103)
!103 = distinct !DILexicalBlock(scope: !63, file: !22, line: 179, column: 8)
!104 = !DILocation(line: 179, column: 13, scope: !103)
!105 = !DILocation(line: 179, column: 8, scope: !63)
!106 = !DILocation(line: 180, column: 7, scope: !107)
!107 = distinct !DILexicalBlock(scope: !103, file: !22, line: 179, column: 21)
!108 = !DILocation(line: 183, column: 4, scope: !63)
!109 = !DILocation(line: 183, column: 10, scope: !63)
!110 = !DILocation(line: 183, column: 17, scope: !63)
!111 = !DILocation(line: 183, column: 22, scope: !63)
!112 = !DILocation(line: 184, column: 4, scope: !63)
!113 = !DILocation(line: 184, column: 10, scope: !63)
!114 = !DILocation(line: 184, column: 17, scope: !63)
!115 = !DILocation(line: 184, column: 23, scope: !63)
!116 = !DILocation(line: 185, column: 4, scope: !63)
!117 = !DILocation(line: 185, column: 10, scope: !63)
!118 = !DILocation(line: 185, column: 17, scope: !63)
!119 = !DILocation(line: 185, column: 25, scope: !63)
!120 = !DILocation(line: 190, column: 30, scope: !121)
!121 = distinct !DILexicalBlock(scope: !122, file: !22, line: 190, column: 10)
!122 = distinct !DILexicalBlock(scope: !63, file: !22, line: 190, column: 5)
!123 = !DILocation(line: 190, column: 36, scope: !121)
!124 = !DILocation(line: 190, column: 28, scope: !121)
!125 = !DILocation(line: 190, column: 27, scope: !121)
!126 = !DILocation(line: 190, column: 10, scope: !121)
!127 = !DILocation(line: 190, column: 10, scope: !122)
!128 = !DILocation(line: 190, column: 13, scope: !129)
!129 = !DILexicalBlockFile(scope: !130, file: !22, discriminator: 1)
!130 = distinct !DILexicalBlock(scope: !121, file: !22, line: 190, column: 11)
!131 = !DILocation(line: 197, column: 4, scope: !63)
!132 = !DILocation(line: 197, column: 11, scope: !133)
!133 = !DILexicalBlockFile(scope: !63, file: !22, discriminator: 1)
!134 = !DILocation(line: 197, column: 17, scope: !133)
!135 = !DILocation(line: 197, column: 4, scope: !133)
!136 = !DILocalVariable(name: "fd", scope: !137, file: !22, line: 198, type: !59)
!137 = distinct !DILexicalBlock(scope: !63, file: !22, line: 197, column: 25)
!138 = !DILocation(line: 198, column: 11, scope: !137)
!139 = !DILocalVariable(name: "sbuf", scope: !137, file: !22, line: 199, type: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !141, line: 46, size: 1152, align: 64, elements: !142)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/open-vm-tools/line974")
!142 = !{!143, !145, !147, !149, !152, !154, !156, !157, !158, !160, !162, !164, !172, !173, !174}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !140, file: !141, line: 48, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !79, line: 124, baseType: !56)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !140, file: !141, line: 53, baseType: !146, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !79, line: 127, baseType: !56)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !140, file: !141, line: 61, baseType: !148, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !79, line: 130, baseType: !56)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !140, file: !141, line: 62, baseType: !150, size: 32, align: 32, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !79, line: 129, baseType: !151)
!151 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !140, file: !141, line: 64, baseType: !153, size: 32, align: 32, offset: 224)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !79, line: 125, baseType: !151)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !140, file: !141, line: 65, baseType: !155, size: 32, align: 32, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !79, line: 126, baseType: !151)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !140, file: !141, line: 67, baseType: !59, size: 32, align: 32, offset: 288)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !140, file: !141, line: 69, baseType: !144, size: 64, align: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !140, file: !141, line: 74, baseType: !159, size: 64, align: 64, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !79, line: 131, baseType: !80)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !140, file: !141, line: 78, baseType: !161, size: 64, align: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !79, line: 153, baseType: !80)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !140, file: !141, line: 80, baseType: !163, size: 64, align: 64, offset: 512)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !79, line: 158, baseType: !80)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !140, file: !141, line: 91, baseType: !165, size: 128, align: 64, offset: 576)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !166, line: 120, size: 128, align: 64, elements: !167)
!166 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line974")
!167 = !{!168, !170}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !165, file: !166, line: 122, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !79, line: 139, baseType: !80)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !165, file: !166, line: 123, baseType: !171, size: 64, align: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !79, line: 175, baseType: !80)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !140, file: !141, line: 92, baseType: !165, size: 128, align: 64, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !140, file: !141, line: 93, baseType: !165, size: 128, align: 64, offset: 832)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !140, file: !141, line: 106, baseType: !175, size: 192, align: 64, offset: 960)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 192, align: 64, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 3)
!178 = !DILocation(line: 199, column: 19, scope: !137)
!179 = !DILocalVariable(name: "path", scope: !137, file: !22, line: 200, type: !47)
!180 = !DILocation(line: 200, column: 19, scope: !137)
!181 = !DILocation(line: 200, column: 26, scope: !137)
!182 = !DILocation(line: 200, column: 33, scope: !137)
!183 = !DILocation(line: 201, column: 52, scope: !137)
!184 = !DILocation(line: 201, column: 7, scope: !137)
!185 = !DILocation(line: 202, column: 17, scope: !137)
!186 = !DILocation(line: 202, column: 16, scope: !137)
!187 = !DILocation(line: 202, column: 39, scope: !188)
!188 = !DILexicalBlockFile(scope: !137, file: !22, discriminator: 1)
!189 = !DILocation(line: 202, column: 48, scope: !188)
!190 = !DILocation(line: 202, column: 16, scope: !188)
!191 = !DILocation(line: 202, column: 16, scope: !192)
!192 = !DILexicalBlockFile(scope: !137, file: !22, discriminator: 2)
!193 = !DILocation(line: 202, column: 16, scope: !194)
!194 = !DILexicalBlockFile(scope: !137, file: !22, discriminator: 3)
!195 = !DILocation(line: 202, column: 13, scope: !194)
!196 = !DILocation(line: 203, column: 17, scope: !137)
!197 = !DILocation(line: 203, column: 12, scope: !137)
!198 = !DILocation(line: 203, column: 10, scope: !137)
!199 = !DILocation(line: 204, column: 11, scope: !200)
!200 = distinct !DILexicalBlock(scope: !137, file: !22, line: 204, column: 11)
!201 = !DILocation(line: 204, column: 14, scope: !200)
!202 = !DILocation(line: 204, column: 11, scope: !137)
!203 = !DILocation(line: 205, column: 19, scope: !204)
!204 = distinct !DILexicalBlock(scope: !200, file: !22, line: 204, column: 21)
!205 = !DILocation(line: 205, column: 18, scope: !204)
!206 = !DILocation(line: 205, column: 10, scope: !204)
!207 = !DILocation(line: 211, column: 71, scope: !208)
!208 = distinct !DILexicalBlock(scope: !204, file: !22, line: 205, column: 24)
!209 = !DILocation(line: 211, column: 13, scope: !208)
!210 = !DILocation(line: 212, column: 13, scope: !208)
!211 = distinct !{!211, !131}
!212 = !DILocation(line: 219, column: 77, scope: !208)
!213 = !DILocation(line: 219, column: 13, scope: !208)
!214 = !DILocation(line: 220, column: 13, scope: !208)
!215 = !DILocation(line: 227, column: 71, scope: !208)
!216 = !DILocation(line: 227, column: 13, scope: !208)
!217 = !DILocation(line: 228, column: 13, scope: !208)
!218 = !DILocation(line: 236, column: 73, scope: !208)
!219 = !DILocation(line: 236, column: 13, scope: !208)
!220 = !DILocation(line: 237, column: 13, scope: !208)
!221 = !DILocation(line: 241, column: 19, scope: !208)
!222 = !DILocation(line: 241, column: 26, scope: !208)
!223 = !DILocation(line: 241, column: 25, scope: !208)
!224 = !DILocation(line: 241, column: 42, scope: !225)
!225 = !DILexicalBlockFile(scope: !208, file: !22, discriminator: 1)
!226 = !DILocation(line: 241, column: 41, scope: !208)
!227 = !DILocation(line: 241, column: 31, scope: !228)
!228 = !DILexicalBlockFile(scope: !208, file: !22, discriminator: 2)
!229 = !DILocation(line: 240, column: 13, scope: !208)
!230 = !DILocation(line: 242, column: 17, scope: !208)
!231 = !DILocation(line: 243, column: 13, scope: !208)
!232 = !DILocation(line: 247, column: 17, scope: !233)
!233 = distinct !DILexicalBlock(scope: !137, file: !22, line: 247, column: 11)
!234 = !DILocation(line: 247, column: 11, scope: !233)
!235 = !DILocation(line: 247, column: 28, scope: !233)
!236 = !DILocation(line: 247, column: 11, scope: !137)
!237 = !DILocation(line: 248, column: 16, scope: !238)
!238 = distinct !DILexicalBlock(scope: !233, file: !22, line: 247, column: 35)
!239 = !DILocation(line: 248, column: 10, scope: !238)
!240 = !DILocation(line: 250, column: 16, scope: !238)
!241 = !DILocation(line: 250, column: 23, scope: !238)
