; ModuleID = './[inter]dpkg-split--join.o.i'
source_filename = "./[inter]dpkg-split--join.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.cmdinfo = type { i8*, i8, i32, i32*, i8**, void (%struct.cmdinfo*, i8*)*, i32, i8*, i32 (i8**)* }
%struct.partinfo = type { %struct.deb_version, i8*, i8*, i8*, i8*, i8*, i64, i32, i32, i64, i64, i64, i64, i64 }
%struct.deb_version = type { i32, i32 }
%struct.dpkg_error = type { i32, i32, i8* }
%struct.partqueue = type { %struct.partqueue*, %struct.partinfo }

@.str = private unnamed_addr constant [43 x i8] c"Putting package %s together from %d part: \00", align 1
@.str.1 = private unnamed_addr constant [44 x i8] c"Putting package %s together from %d parts: \00", align 1
@.str.2 = private unnamed_addr constant [36 x i8] c"unable to open output file '%.250s'\00", align 1
@.str.3 = private unnamed_addr constant [44 x i8] c"unable to (re)open input part file '%.250s'\00", align 1
@.str.4 = private unnamed_addr constant [46 x i8] c"cannot skip split package header for '%s': %s\00", align 1
@.str.5 = private unnamed_addr constant [50 x i8] c"cannot append split package part '%s' to '%s': %s\00", align 1
@.str.6 = private unnamed_addr constant [4 x i8] c"%u \00", align 1
@.str.7 = private unnamed_addr constant [25 x i8] c"unable to sync file '%s'\00", align 1
@.str.8 = private unnamed_addr constant [26 x i8] c"unable to close file '%s'\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9)
!1 = !DIFile(filename: "[inter]dpkg-split--join.o.i", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_msg_type", file: !4, line: 36, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../lib/dpkg/error.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "DPKG_MSG_NONE", value: 0)
!7 = !DIEnumerator(name: "DPKG_MSG_WARN", value: 1)
!8 = !DIEnumerator(name: "DPKG_MSG_ERROR", value: 2)
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !{i32 2, !"Dwarf Version", i32 4}
!12 = !{i32 2, !"Debug Info Version", i32 3}
!13 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!14 = distinct !DISubprogram(name: "reassemble", scope: !15, file: !15, line: 39, type: !16, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !52)
!15 = !DIFile(filename: "join.c", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!16 = !DISubroutineType(types: !17)
!17 = !{null, !18, !31}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partinfo", file: !21, line: 35, size: 832, align: 64, elements: !22)
!21 = !DIFile(filename: "dpkg-split.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!22 = !{!23, !30, !34, !35, !36, !37, !38, !44, !46, !47, !48, !49, !50, !51}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "fmtversion", scope: !20, file: !21, line: 36, baseType: !24, size: 64, align: 32)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deb_version", file: !25, line: 37, size: 64, align: 32, elements: !26)
!25 = !DIFile(filename: "../lib/dpkg/deb-version.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!26 = !{!27, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !24, file: !25, line: 38, baseType: !28, size: 32, align: 32)
!28 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !24, file: !25, line: 39, baseType: !28, size: 32, align: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !20, file: !21, line: 37, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !20, file: !21, line: 38, baseType: !31, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !20, file: !21, line: 39, baseType: !31, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !20, file: !21, line: 40, baseType: !31, size: 64, align: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !20, file: !21, line: 41, baseType: !31, size: 64, align: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "orglength", scope: !20, file: !21, line: 42, baseType: !39, size: 64, align: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !40, line: 86, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !42, line: 131, baseType: !43)
!42 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!43 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "thispartn", scope: !20, file: !21, line: 43, baseType: !45, size: 32, align: 32, offset: 448)
!45 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "maxpartn", scope: !20, file: !21, line: 43, baseType: !45, size: 32, align: 32, offset: 480)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "maxpartlen", scope: !20, file: !21, line: 44, baseType: !39, size: 64, align: 64, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "thispartoffset", scope: !20, file: !21, line: 45, baseType: !39, size: 64, align: 64, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "thispartlen", scope: !20, file: !21, line: 46, baseType: !39, size: 64, align: 64, offset: 640)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "headerlen", scope: !20, file: !21, line: 48, baseType: !39, size: 64, align: 64, offset: 704)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "filesize", scope: !20, file: !21, line: 49, baseType: !39, size: 64, align: 64, offset: 768)
!52 = !{}
!53 = !DILocalVariable(name: "partlist", arg: 1, scope: !14, file: !15, line: 39, type: !18)
!54 = !DIExpression()
!55 = !DILocation(line: 39, column: 35, scope: !14)
!56 = !DILocalVariable(name: "outputfile", arg: 2, scope: !14, file: !15, line: 39, type: !31)
!57 = !DILocation(line: 39, column: 57, scope: !14)
!58 = !DILocalVariable(name: "err", scope: !14, file: !15, line: 40, type: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_error", file: !4, line: 42, size: 128, align: 64, elements: !60)
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !4, line: 43, baseType: !3, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "syserrno", scope: !59, file: !4, line: 45, baseType: !28, size: 32, align: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !59, file: !4, line: 46, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!65 = !DILocation(line: 40, column: 21, scope: !14)
!66 = !DILocalVariable(name: "fd_out", scope: !14, file: !15, line: 41, type: !28)
!67 = !DILocation(line: 41, column: 7, scope: !14)
!68 = !DILocalVariable(name: "fd_in", scope: !14, file: !15, line: 41, type: !28)
!69 = !DILocation(line: 41, column: 15, scope: !14)
!70 = !DILocalVariable(name: "i", scope: !14, file: !15, line: 42, type: !45)
!71 = !DILocation(line: 42, column: 16, scope: !14)
!72 = !DILocation(line: 44, column: 112, scope: !14)
!73 = !DILocation(line: 44, column: 125, scope: !14)
!74 = !DILocation(line: 44, column: 10, scope: !14)
!75 = !DILocation(line: 47, column: 10, scope: !14)
!76 = !DILocation(line: 47, column: 23, scope: !14)
!77 = !DILocation(line: 47, column: 31, scope: !14)
!78 = !DILocation(line: 47, column: 44, scope: !14)
!79 = !DILocation(line: 44, column: 3, scope: !80)
!80 = !DILexicalBlockFile(scope: !14, file: !15, discriminator: 1)
!81 = !DILocation(line: 49, column: 18, scope: !14)
!82 = !DILocation(line: 49, column: 12, scope: !14)
!83 = !DILocation(line: 49, column: 10, scope: !14)
!84 = !DILocation(line: 50, column: 7, scope: !85)
!85 = distinct !DILexicalBlock(scope: !14, file: !15, line: 50, column: 7)
!86 = !DILocation(line: 50, column: 14, scope: !85)
!87 = !DILocation(line: 50, column: 7, scope: !14)
!88 = !DILocation(line: 51, column: 13, scope: !85)
!89 = !DILocation(line: 51, column: 61, scope: !85)
!90 = !DILocation(line: 51, column: 5, scope: !91)
!91 = !DILexicalBlockFile(scope: !85, file: !15, discriminator: 1)
!92 = !DILocation(line: 51, column: 5, scope: !85)
!93 = !DILocation(line: 52, column: 9, scope: !94)
!94 = distinct !DILexicalBlock(scope: !14, file: !15, line: 52, column: 3)
!95 = !DILocation(line: 52, column: 8, scope: !94)
!96 = !DILocation(line: 52, column: 13, scope: !97)
!97 = !DILexicalBlockFile(scope: !98, file: !15, discriminator: 1)
!98 = distinct !DILexicalBlock(scope: !94, file: !15, line: 52, column: 3)
!99 = !DILocation(line: 52, column: 15, scope: !97)
!100 = !DILocation(line: 52, column: 28, scope: !97)
!101 = !DILocation(line: 52, column: 14, scope: !97)
!102 = !DILocation(line: 52, column: 3, scope: !97)
!103 = !DILocalVariable(name: "pi", scope: !104, file: !15, line: 53, type: !19)
!104 = distinct !DILexicalBlock(scope: !98, file: !15, line: 52, column: 43)
!105 = !DILocation(line: 53, column: 22, scope: !104)
!106 = !DILocation(line: 53, column: 36, scope: !104)
!107 = !DILocation(line: 53, column: 27, scope: !104)
!108 = !DILocation(line: 55, column: 18, scope: !104)
!109 = !DILocation(line: 55, column: 22, scope: !104)
!110 = !DILocation(line: 55, column: 13, scope: !104)
!111 = !DILocation(line: 55, column: 11, scope: !104)
!112 = !DILocation(line: 56, column: 9, scope: !113)
!113 = distinct !DILexicalBlock(scope: !104, file: !15, line: 56, column: 9)
!114 = !DILocation(line: 56, column: 15, scope: !113)
!115 = !DILocation(line: 56, column: 9, scope: !104)
!116 = !DILocation(line: 57, column: 15, scope: !113)
!117 = !DILocation(line: 57, column: 71, scope: !113)
!118 = !DILocation(line: 57, column: 75, scope: !113)
!119 = !DILocation(line: 57, column: 7, scope: !120)
!120 = !DILexicalBlockFile(scope: !113, file: !15, discriminator: 1)
!121 = !DILocation(line: 57, column: 7, scope: !113)
!122 = !DILocation(line: 58, column: 25, scope: !123)
!123 = distinct !DILexicalBlock(scope: !104, file: !15, line: 58, column: 9)
!124 = !DILocation(line: 58, column: 35, scope: !123)
!125 = !DILocation(line: 58, column: 39, scope: !123)
!126 = !DILocation(line: 58, column: 9, scope: !123)
!127 = !DILocation(line: 58, column: 56, scope: !123)
!128 = !DILocation(line: 58, column: 9, scope: !104)
!129 = !DILocation(line: 59, column: 14, scope: !123)
!130 = !DILocation(line: 59, column: 72, scope: !123)
!131 = !DILocation(line: 59, column: 76, scope: !123)
!132 = !DILocation(line: 60, column: 18, scope: !123)
!133 = !DILocation(line: 59, column: 7, scope: !134)
!134 = !DILexicalBlockFile(scope: !123, file: !15, discriminator: 1)
!135 = !DILocation(line: 59, column: 7, scope: !123)
!136 = !DILocation(line: 61, column: 28, scope: !137)
!137 = distinct !DILexicalBlock(scope: !104, file: !15, line: 61, column: 9)
!138 = !DILocation(line: 61, column: 13, scope: !137)
!139 = !DILocation(line: 61, column: 24, scope: !137)
!140 = !DILocation(line: 61, column: 9, scope: !137)
!141 = !DILocation(line: 61, column: 47, scope: !137)
!142 = !DILocation(line: 61, column: 9, scope: !104)
!143 = !DILocation(line: 62, column: 14, scope: !137)
!144 = !DILocation(line: 63, column: 14, scope: !137)
!145 = !DILocation(line: 63, column: 18, scope: !137)
!146 = !DILocation(line: 63, column: 28, scope: !137)
!147 = !DILocation(line: 63, column: 44, scope: !137)
!148 = !DILocation(line: 62, column: 7, scope: !149)
!149 = !DILexicalBlockFile(scope: !137, file: !15, discriminator: 1)
!150 = !DILocation(line: 62, column: 7, scope: !137)
!151 = !DILocation(line: 64, column: 11, scope: !104)
!152 = !DILocation(line: 64, column: 5, scope: !104)
!153 = !DILocation(line: 66, column: 19, scope: !104)
!154 = !DILocation(line: 66, column: 21, scope: !104)
!155 = !DILocation(line: 66, column: 5, scope: !104)
!156 = !DILocation(line: 67, column: 3, scope: !104)
!157 = !DILocation(line: 52, column: 39, scope: !158)
!158 = !DILexicalBlockFile(scope: !98, file: !15, discriminator: 2)
!159 = !DILocation(line: 52, column: 3, scope: !158)
!160 = distinct !{!160, !161}
!161 = !DILocation(line: 52, column: 3, scope: !14)
!162 = !DILocation(line: 68, column: 13, scope: !163)
!163 = distinct !DILexicalBlock(scope: !14, file: !15, line: 68, column: 7)
!164 = !DILocation(line: 68, column: 7, scope: !163)
!165 = !DILocation(line: 68, column: 7, scope: !14)
!166 = !DILocation(line: 69, column: 13, scope: !163)
!167 = !DILocation(line: 69, column: 50, scope: !163)
!168 = !DILocation(line: 69, column: 5, scope: !169)
!169 = !DILexicalBlockFile(scope: !163, file: !15, discriminator: 1)
!170 = !DILocation(line: 69, column: 5, scope: !163)
!171 = !DILocation(line: 70, column: 13, scope: !172)
!172 = distinct !DILexicalBlock(scope: !14, file: !15, line: 70, column: 7)
!173 = !DILocation(line: 70, column: 7, scope: !172)
!174 = !DILocation(line: 70, column: 7, scope: !14)
!175 = !DILocation(line: 71, column: 13, scope: !172)
!176 = !DILocation(line: 71, column: 51, scope: !172)
!177 = !DILocation(line: 71, column: 5, scope: !178)
!178 = !DILexicalBlockFile(scope: !172, file: !15, discriminator: 1)
!179 = !DILocation(line: 71, column: 5, scope: !172)
!180 = !DILocation(line: 73, column: 10, scope: !14)
!181 = !DILocation(line: 73, column: 3, scope: !80)
!182 = !DILocation(line: 74, column: 1, scope: !14)
!183 = distinct !DISubprogram(name: "addtopartlist", scope: !15, file: !15, line: 77, type: !184, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !52)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !18, !19, !19}
!186 = !DILocalVariable(name: "partlist", arg: 1, scope: !183, file: !15, line: 77, type: !18)
!187 = !DILocation(line: 77, column: 38, scope: !183)
!188 = !DILocalVariable(name: "pi", arg: 2, scope: !183, file: !15, line: 78, type: !19)
!189 = !DILocation(line: 78, column: 37, scope: !183)
!190 = !DILocalVariable(name: "refi", arg: 3, scope: !183, file: !15, line: 78, type: !19)
!191 = !DILocation(line: 78, column: 58, scope: !183)
!192 = !DILocalVariable(name: "i", scope: !183, file: !15, line: 79, type: !28)
!193 = !DILocation(line: 79, column: 7, scope: !183)
!194 = !DILocation(line: 81, column: 14, scope: !195)
!195 = distinct !DILexicalBlock(scope: !183, file: !15, line: 81, column: 7)
!196 = !DILocation(line: 81, column: 18, scope: !195)
!197 = !DILocation(line: 81, column: 26, scope: !195)
!198 = !DILocation(line: 81, column: 32, scope: !195)
!199 = !DILocation(line: 81, column: 7, scope: !195)
!200 = !DILocation(line: 81, column: 41, scope: !195)
!201 = !DILocation(line: 82, column: 14, scope: !195)
!202 = !DILocation(line: 82, column: 18, scope: !195)
!203 = !DILocation(line: 82, column: 26, scope: !195)
!204 = !DILocation(line: 82, column: 32, scope: !195)
!205 = !DILocation(line: 82, column: 7, scope: !195)
!206 = !DILocation(line: 82, column: 41, scope: !195)
!207 = !DILocation(line: 83, column: 14, scope: !195)
!208 = !DILocation(line: 83, column: 18, scope: !195)
!209 = !DILocation(line: 83, column: 25, scope: !195)
!210 = !DILocation(line: 83, column: 31, scope: !195)
!211 = !DILocation(line: 83, column: 7, scope: !195)
!212 = !DILocation(line: 83, column: 39, scope: !195)
!213 = !DILocation(line: 84, column: 7, scope: !195)
!214 = !DILocation(line: 84, column: 11, scope: !195)
!215 = !DILocation(line: 84, column: 24, scope: !195)
!216 = !DILocation(line: 84, column: 30, scope: !195)
!217 = !DILocation(line: 84, column: 21, scope: !195)
!218 = !DILocation(line: 84, column: 40, scope: !195)
!219 = !DILocation(line: 85, column: 7, scope: !195)
!220 = !DILocation(line: 85, column: 11, scope: !195)
!221 = !DILocation(line: 85, column: 23, scope: !195)
!222 = !DILocation(line: 85, column: 29, scope: !195)
!223 = !DILocation(line: 85, column: 20, scope: !195)
!224 = !DILocation(line: 85, column: 38, scope: !195)
!225 = !DILocation(line: 86, column: 7, scope: !195)
!226 = !DILocation(line: 86, column: 11, scope: !195)
!227 = !DILocation(line: 86, column: 25, scope: !195)
!228 = !DILocation(line: 86, column: 31, scope: !195)
!229 = !DILocation(line: 86, column: 22, scope: !195)
!230 = !DILocation(line: 81, column: 7, scope: !231)
!231 = !DILexicalBlockFile(scope: !183, file: !15, discriminator: 1)
!232 = !DILocation(line: 87, column: 16, scope: !233)
!233 = distinct !DILexicalBlock(scope: !195, file: !15, line: 86, column: 43)
!234 = !DILocation(line: 87, column: 5, scope: !233)
!235 = !DILocation(line: 88, column: 16, scope: !233)
!236 = !DILocation(line: 88, column: 5, scope: !233)
!237 = !DILocation(line: 89, column: 12, scope: !233)
!238 = !DILocation(line: 90, column: 12, scope: !233)
!239 = !DILocation(line: 90, column: 16, scope: !233)
!240 = !DILocation(line: 90, column: 25, scope: !233)
!241 = !DILocation(line: 90, column: 31, scope: !233)
!242 = !DILocation(line: 89, column: 5, scope: !243)
!243 = !DILexicalBlockFile(scope: !233, file: !15, discriminator: 1)
!244 = !DILocation(line: 89, column: 5, scope: !233)
!245 = !DILocation(line: 92, column: 6, scope: !183)
!246 = !DILocation(line: 92, column: 10, scope: !183)
!247 = !DILocation(line: 92, column: 19, scope: !183)
!248 = !DILocation(line: 92, column: 4, scope: !183)
!249 = !DILocation(line: 93, column: 16, scope: !250)
!250 = distinct !DILexicalBlock(scope: !183, file: !15, line: 93, column: 7)
!251 = !DILocation(line: 93, column: 7, scope: !250)
!252 = !DILocation(line: 93, column: 7, scope: !183)
!253 = !DILocation(line: 94, column: 12, scope: !250)
!254 = !DILocation(line: 95, column: 12, scope: !250)
!255 = !DILocation(line: 95, column: 16, scope: !250)
!256 = !DILocation(line: 95, column: 27, scope: !250)
!257 = !DILocation(line: 95, column: 31, scope: !250)
!258 = !DILocation(line: 95, column: 50, scope: !250)
!259 = !DILocation(line: 95, column: 41, scope: !250)
!260 = !DILocation(line: 95, column: 54, scope: !250)
!261 = !DILocation(line: 94, column: 5, scope: !262)
!262 = !DILexicalBlockFile(scope: !250, file: !15, discriminator: 1)
!263 = !DILocation(line: 94, column: 5, scope: !250)
!264 = !DILocation(line: 96, column: 16, scope: !183)
!265 = !DILocation(line: 96, column: 12, scope: !183)
!266 = !DILocation(line: 96, column: 3, scope: !183)
!267 = !DILocation(line: 96, column: 14, scope: !183)
!268 = !DILocation(line: 97, column: 1, scope: !183)
!269 = distinct !DISubprogram(name: "do_join", scope: !15, file: !15, line: 100, type: !270, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !52)
!270 = !DISubroutineType(types: !271)
!271 = !{!28, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!274 = !DILocalVariable(name: "argv", arg: 1, scope: !269, file: !15, line: 100, type: !272)
!275 = !DILocation(line: 100, column: 28, scope: !269)
!276 = !DILocalVariable(name: "thisarg", scope: !269, file: !15, line: 102, type: !31)
!277 = !DILocation(line: 102, column: 15, scope: !269)
!278 = !DILocalVariable(name: "queue", scope: !269, file: !15, line: 103, type: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partqueue", file: !21, line: 52, size: 896, align: 64, elements: !281)
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nextinqueue", scope: !280, file: !21, line: 53, baseType: !279, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !280, file: !21, line: 58, baseType: !20, size: 832, align: 64, offset: 64)
!284 = !DILocation(line: 103, column: 21, scope: !269)
!285 = !DILocalVariable(name: "pq", scope: !269, file: !15, line: 104, type: !279)
!286 = !DILocation(line: 104, column: 21, scope: !269)
!287 = !DILocalVariable(name: "refi", scope: !269, file: !15, line: 105, type: !19)
!288 = !DILocation(line: 105, column: 20, scope: !269)
!289 = !DILocalVariable(name: "partlist", scope: !269, file: !15, line: 105, type: !18)
!290 = !DILocation(line: 105, column: 28, scope: !269)
!291 = !DILocalVariable(name: "i", scope: !269, file: !15, line: 106, type: !45)
!292 = !DILocation(line: 106, column: 16, scope: !269)
!293 = !DILocation(line: 108, column: 9, scope: !294)
!294 = distinct !DILexicalBlock(scope: !269, file: !15, line: 108, column: 7)
!295 = !DILocation(line: 108, column: 8, scope: !294)
!296 = !DILocation(line: 108, column: 7, scope: !269)
!297 = !DILocation(line: 109, column: 14, scope: !294)
!298 = !DILocation(line: 110, column: 14, scope: !294)
!299 = !DILocation(line: 110, column: 25, scope: !294)
!300 = !DILocation(line: 109, column: 5, scope: !301)
!301 = !DILexicalBlockFile(scope: !294, file: !15, discriminator: 1)
!302 = !DILocation(line: 109, column: 5, scope: !294)
!303 = !DILocation(line: 111, column: 3, scope: !269)
!304 = !DILocation(line: 111, column: 25, scope: !305)
!305 = !DILexicalBlockFile(scope: !269, file: !15, discriminator: 1)
!306 = !DILocation(line: 111, column: 20, scope: !305)
!307 = !DILocation(line: 111, column: 18, scope: !305)
!308 = !DILocation(line: 111, column: 3, scope: !305)
!309 = !DILocation(line: 112, column: 10, scope: !310)
!310 = distinct !DILexicalBlock(scope: !269, file: !15, line: 111, column: 30)
!311 = !DILocation(line: 112, column: 8, scope: !310)
!312 = !DILocation(line: 114, column: 21, scope: !310)
!313 = !DILocation(line: 114, column: 30, scope: !310)
!314 = !DILocation(line: 114, column: 34, scope: !310)
!315 = !DILocation(line: 114, column: 5, scope: !310)
!316 = !DILocation(line: 116, column: 22, scope: !310)
!317 = !DILocation(line: 116, column: 5, scope: !310)
!318 = !DILocation(line: 116, column: 9, scope: !310)
!319 = !DILocation(line: 116, column: 20, scope: !310)
!320 = !DILocation(line: 117, column: 12, scope: !310)
!321 = !DILocation(line: 117, column: 10, scope: !310)
!322 = !DILocation(line: 111, column: 3, scope: !323)
!323 = !DILexicalBlockFile(scope: !269, file: !15, discriminator: 2)
!324 = distinct !{!324, !303}
!325 = !DILocation(line: 119, column: 7, scope: !269)
!326 = !DILocation(line: 120, column: 12, scope: !327)
!327 = distinct !DILexicalBlock(scope: !269, file: !15, line: 120, column: 3)
!328 = !DILocation(line: 120, column: 10, scope: !327)
!329 = !DILocation(line: 120, column: 8, scope: !327)
!330 = !DILocation(line: 120, column: 19, scope: !331)
!331 = !DILexicalBlockFile(scope: !332, file: !15, discriminator: 1)
!332 = distinct !DILexicalBlock(scope: !327, file: !15, line: 120, column: 3)
!333 = !DILocation(line: 120, column: 3, scope: !331)
!334 = !DILocation(line: 121, column: 10, scope: !335)
!335 = distinct !DILexicalBlock(scope: !332, file: !15, line: 121, column: 9)
!336 = !DILocation(line: 121, column: 15, scope: !335)
!337 = !DILocation(line: 121, column: 18, scope: !338)
!338 = !DILexicalBlockFile(scope: !335, file: !15, discriminator: 1)
!339 = !DILocation(line: 121, column: 22, scope: !338)
!340 = !DILocation(line: 121, column: 27, scope: !338)
!341 = !DILocation(line: 121, column: 39, scope: !338)
!342 = !DILocation(line: 121, column: 45, scope: !338)
!343 = !DILocation(line: 121, column: 37, scope: !338)
!344 = !DILocation(line: 121, column: 9, scope: !338)
!345 = !DILocation(line: 121, column: 63, scope: !346)
!346 = !DILexicalBlockFile(scope: !335, file: !15, discriminator: 2)
!347 = !DILocation(line: 121, column: 67, scope: !346)
!348 = !DILocation(line: 121, column: 60, scope: !346)
