; ModuleID = './[inter]dpkg-split--queue.o.i'
source_filename = "./[inter]dpkg-split--queue.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.cmdinfo = type { i8*, i8, i32, i32*, i8**, void (%struct.cmdinfo*, i8*)*, i32, i8*, i32 (i8**)* }
%struct.partinfo = type { %struct.deb_version, i8*, i8*, i8*, i8*, i8*, i64, i32, i32, i64, i64, i64, i64, i64 }
%struct.deb_version = type { i32, i32 }
%struct.partqueue = type { %struct.partqueue*, %struct.partinfo }
%struct.dpkg_ar = type { i8*, i32, i64, i64, i32 }
%struct.dpkg_error = type { i32, i32, i8* }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@opt_outputfile = external global i8*, align 8
@.str = private unnamed_addr constant [47 x i8] c"--auto requires the use of the --output option\00", align 1
@.str.1 = private unnamed_addr constant [47 x i8] c"--auto requires exactly one part file argument\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15)
!1 = !DIFile(filename: "[inter]dpkg-split--queue.o.i", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_msg_type", file: !4, line: 36, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../lib/dpkg/error.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "DPKG_MSG_NONE", value: 0)
!7 = !DIEnumerator(name: "DPKG_MSG_WARN", value: 1)
!8 = !DIEnumerator(name: "DPKG_MSG_ERROR", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "discard_which", file: !10, line: 307, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "queue.c", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "DISCARD_PART_JUNK", value: 0)
!13 = !DIEnumerator(name: "DISCARD_PART_PACKAGE", value: 1)
!14 = !DIEnumerator(name: "DISCARD_PART_ALL", value: 2)
!15 = !{!16, !17, !18, !20, !21}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !19, line: 134, baseType: !17)
!19 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!20 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !{i32 2, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!25 = distinct !DISubprogram(name: "do_auto", scope: !10, file: !10, line: 135, type: !26, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !33)
!26 = !DISubroutineType(types: !27)
!27 = !{!21, !28}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!33 = !{}
!34 = !DILocalVariable(name: "argv", arg: 1, scope: !25, file: !10, line: 135, type: !28)
!35 = !DIExpression()
!36 = !DILocation(line: 135, column: 28, scope: !25)
!37 = !DILocalVariable(name: "partfile", scope: !25, file: !10, line: 137, type: !30)
!38 = !DILocation(line: 137, column: 15, scope: !25)
!39 = !DILocalVariable(name: "refi", scope: !25, file: !10, line: 138, type: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partinfo", file: !42, line: 35, size: 832, align: 64, elements: !43)
!42 = !DIFile(filename: "dpkg-split.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!43 = !{!44, !50, !51, !52, !53, !54, !55, !60, !61, !62, !63, !64, !65, !66}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "fmtversion", scope: !41, file: !42, line: 36, baseType: !45, size: 64, align: 32)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deb_version", file: !46, line: 37, size: 64, align: 32, elements: !47)
!46 = !DIFile(filename: "../lib/dpkg/deb-version.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !45, file: !46, line: 38, baseType: !21, size: 32, align: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !45, file: !46, line: 39, baseType: !21, size: 32, align: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !41, file: !42, line: 37, baseType: !30, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !41, file: !42, line: 38, baseType: !30, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !41, file: !42, line: 39, baseType: !30, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !41, file: !42, line: 40, baseType: !30, size: 64, align: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !41, file: !42, line: 41, baseType: !30, size: 64, align: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "orglength", scope: !41, file: !42, line: 42, baseType: !56, size: 64, align: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !57, line: 73, baseType: !58)
!57 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !59, line: 131, baseType: !17)
!59 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!60 = !DIDerivedType(tag: DW_TAG_member, name: "thispartn", scope: !41, file: !42, line: 43, baseType: !20, size: 32, align: 32, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "maxpartn", scope: !41, file: !42, line: 43, baseType: !20, size: 32, align: 32, offset: 480)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "maxpartlen", scope: !41, file: !42, line: 44, baseType: !56, size: 64, align: 64, offset: 512)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "thispartoffset", scope: !41, file: !42, line: 45, baseType: !56, size: 64, align: 64, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "thispartlen", scope: !41, file: !42, line: 46, baseType: !56, size: 64, align: 64, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "headerlen", scope: !41, file: !42, line: 48, baseType: !56, size: 64, align: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "filesize", scope: !41, file: !42, line: 49, baseType: !56, size: 64, align: 64, offset: 768)
!67 = !DILocation(line: 138, column: 20, scope: !25)
!68 = !DILocalVariable(name: "partlist", scope: !25, file: !10, line: 138, type: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!70 = !DILocation(line: 138, column: 28, scope: !25)
!71 = !DILocalVariable(name: "otherthispart", scope: !25, file: !10, line: 138, type: !40)
!72 = !DILocation(line: 138, column: 39, scope: !25)
!73 = !DILocalVariable(name: "queue", scope: !25, file: !10, line: 139, type: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partqueue", file: !42, line: 52, size: 896, align: 64, elements: !76)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "nextinqueue", scope: !75, file: !42, line: 53, baseType: !74, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !75, file: !42, line: 58, baseType: !41, size: 832, align: 64, offset: 64)
!79 = !DILocation(line: 139, column: 21, scope: !25)
!80 = !DILocalVariable(name: "pq", scope: !25, file: !10, line: 140, type: !74)
!81 = !DILocation(line: 140, column: 21, scope: !25)
!82 = !DILocalVariable(name: "part", scope: !25, file: !10, line: 141, type: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_ar", file: !85, line: 57, size: 320, align: 64, elements: !86)
!85 = !DIFile(filename: "../lib/dpkg/ar.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!86 = !{!87, !88, !91, !95, !96}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !84, file: !85, line: 58, baseType: !30, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !84, file: !85, line: 59, baseType: !89, size: 32, align: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !57, line: 62, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !59, line: 129, baseType: !20)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !84, file: !85, line: 60, baseType: !92, size: 64, align: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !93, line: 75, baseType: !94)
!93 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !59, line: 139, baseType: !17)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !84, file: !85, line: 61, baseType: !56, size: 64, align: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !84, file: !85, line: 62, baseType: !21, size: 32, align: 32, offset: 256)
!97 = !DILocation(line: 141, column: 19, scope: !25)
!98 = !DILocalVariable(name: "i", scope: !25, file: !10, line: 142, type: !20)
!99 = !DILocation(line: 142, column: 16, scope: !25)
!100 = !DILocalVariable(name: "j", scope: !25, file: !10, line: 143, type: !21)
!101 = !DILocation(line: 143, column: 7, scope: !25)
!102 = !DILocation(line: 145, column: 8, scope: !103)
!103 = distinct !DILexicalBlock(scope: !25, file: !10, line: 145, column: 7)
!104 = !DILocation(line: 145, column: 7, scope: !25)
!105 = !DILocation(line: 146, column: 14, scope: !103)
!106 = !DILocation(line: 146, column: 5, scope: !107)
!107 = !DILexicalBlockFile(scope: !103, file: !10, discriminator: 1)
!108 = !DILocation(line: 146, column: 5, scope: !103)
!109 = !DILocation(line: 147, column: 19, scope: !25)
!110 = !DILocation(line: 147, column: 14, scope: !25)
!111 = !DILocation(line: 147, column: 12, scope: !25)
!112 = !DILocation(line: 148, column: 7, scope: !113)
!113 = distinct !DILexicalBlock(scope: !25, file: !10, line: 148, column: 7)
!114 = !DILocation(line: 148, column: 16, scope: !113)
!115 = !DILocation(line: 148, column: 23, scope: !113)
!116 = !DILocation(line: 148, column: 27, scope: !117)
!117 = !DILexicalBlockFile(scope: !113, file: !10, discriminator: 1)
!118 = !DILocation(line: 148, column: 26, scope: !117)
!119 = !DILocation(line: 148, column: 7, scope: !117)
!120 = !DILocation(line: 149, column: 14, scope: !113)
!121 = !DILocation(line: 149, column: 5, scope: !117)
!122 = !DILocation(line: 149, column: 5, scope: !113)
!123 = !DILocation(line: 151, column: 10, scope: !25)
!124 = !DILocation(line: 151, column: 8, scope: !25)
!125 = !DILocation(line: 152, column: 23, scope: !25)
!126 = !DILocation(line: 152, column: 10, scope: !25)
!127 = !DILocation(line: 152, column: 8, scope: !25)
!128 = !DILocation(line: 153, column: 8, scope: !129)
!129 = distinct !DILexicalBlock(scope: !25, file: !10, line: 153, column: 7)
!130 = !DILocation(line: 153, column: 7, scope: !25)
!131 = !DILocation(line: 154, column: 13, scope: !129)
!132 = !DILocation(line: 154, column: 59, scope: !129)
!133 = !DILocation(line: 154, column: 5, scope: !134)
!134 = !DILexicalBlockFile(scope: !129, file: !10, discriminator: 1)
!135 = !DILocation(line: 154, column: 5, scope: !129)
!136 = !DILocation(line: 155, column: 18, scope: !137)
!137 = distinct !DILexicalBlock(scope: !25, file: !10, line: 155, column: 7)
!138 = !DILocation(line: 155, column: 24, scope: !137)
!139 = !DILocation(line: 155, column: 8, scope: !137)
!140 = !DILocation(line: 155, column: 7, scope: !25)
!141 = !DILocation(line: 156, column: 10, scope: !142)
!142 = distinct !DILexicalBlock(scope: !143, file: !10, line: 156, column: 9)
!143 = distinct !DILexicalBlock(scope: !137, file: !10, line: 155, column: 31)
!144 = !DILocation(line: 156, column: 9, scope: !143)
!145 = !DILocation(line: 157, column: 14, scope: !142)
!146 = !DILocation(line: 157, column: 78, scope: !142)
!147 = !DILocation(line: 157, column: 7, scope: !148)
!148 = !DILexicalBlockFile(scope: !142, file: !10, discriminator: 1)
!149 = !DILocation(line: 157, column: 7, scope: !142)
!150 = !DILocation(line: 158, column: 13, scope: !143)
!151 = !DILocation(line: 158, column: 21, scope: !143)
!152 = !DILocation(line: 158, column: 5, scope: !153)
!153 = !DILexicalBlockFile(scope: !143, file: !10, discriminator: 1)
!154 = !DILocation(line: 159, column: 5, scope: !143)
!155 = !DILocation(line: 161, column: 17, scope: !25)
!156 = !DILocation(line: 161, column: 3, scope: !25)
!157 = !DILocation(line: 163, column: 11, scope: !25)
!158 = !DILocation(line: 163, column: 9, scope: !25)
!159 = !DILocation(line: 164, column: 43, scope: !25)
!160 = !DILocation(line: 164, column: 49, scope: !25)
!161 = !DILocation(line: 164, column: 41, scope: !25)
!162 = !DILocation(line: 164, column: 14, scope: !25)
!163 = !DILocation(line: 164, column: 12, scope: !25)
!164 = !DILocation(line: 165, column: 10, scope: !165)
!165 = distinct !DILexicalBlock(scope: !25, file: !10, line: 165, column: 3)
!166 = !DILocation(line: 165, column: 8, scope: !165)
!167 = !DILocation(line: 165, column: 15, scope: !168)
!168 = !DILexicalBlockFile(scope: !169, file: !10, discriminator: 1)
!169 = distinct !DILexicalBlock(scope: !165, file: !10, line: 165, column: 3)
!170 = !DILocation(line: 165, column: 19, scope: !168)
!171 = !DILocation(line: 165, column: 25, scope: !168)
!172 = !DILocation(line: 165, column: 17, scope: !168)
!173 = !DILocation(line: 165, column: 3, scope: !168)
!174 = !DILocation(line: 166, column: 14, scope: !169)
!175 = !DILocation(line: 166, column: 5, scope: !169)
!176 = !DILocation(line: 166, column: 17, scope: !169)
!177 = !DILocation(line: 165, column: 36, scope: !178)
!178 = !DILexicalBlockFile(scope: !169, file: !10, discriminator: 2)
!179 = !DILocation(line: 165, column: 3, scope: !178)
!180 = distinct !{!180, !181}
!181 = !DILocation(line: 165, column: 3, scope: !25)
!182 = !DILocation(line: 167, column: 12, scope: !183)
!183 = distinct !DILexicalBlock(scope: !25, file: !10, line: 167, column: 3)
!184 = !DILocation(line: 167, column: 10, scope: !183)
!185 = !DILocation(line: 167, column: 8, scope: !183)
!186 = !DILocation(line: 167, column: 19, scope: !187)
!187 = !DILexicalBlockFile(scope: !188, file: !10, discriminator: 1)
!188 = distinct !DILexicalBlock(scope: !183, file: !10, line: 167, column: 3)
!189 = !DILocation(line: 167, column: 3, scope: !187)
!190 = !DILocalVariable(name: "npi", scope: !191, file: !10, line: 168, type: !40)
!191 = distinct !DILexicalBlock(scope: !188, file: !10, line: 167, column: 44)
!192 = !DILocation(line: 168, column: 22, scope: !191)
!193 = !DILocalVariable(name: "pi", scope: !191, file: !10, line: 168, type: !40)
!194 = !DILocation(line: 168, column: 28, scope: !191)
!195 = !DILocation(line: 168, column: 34, scope: !191)
!196 = !DILocation(line: 168, column: 38, scope: !191)
!197 = !DILocation(line: 170, column: 22, scope: !198)
!198 = distinct !DILexicalBlock(scope: !191, file: !10, line: 170, column: 9)
!199 = !DILocation(line: 170, column: 25, scope: !198)
!200 = !DILocation(line: 170, column: 10, scope: !198)
!201 = !DILocation(line: 170, column: 9, scope: !191)
!202 = !DILocation(line: 170, column: 32, scope: !203)
!203 = !DILexicalBlockFile(scope: !198, file: !10, discriminator: 1)
!204 = !DILocation(line: 171, column: 11, scope: !191)
!205 = !DILocation(line: 171, column: 9, scope: !191)
!206 = !DILocation(line: 172, column: 21, scope: !191)
!207 = !DILocation(line: 172, column: 25, scope: !191)
!208 = !DILocation(line: 172, column: 34, scope: !191)
!209 = !DILocation(line: 172, column: 5, scope: !191)
!210 = !DILocation(line: 173, column: 19, scope: !191)
!211 = !DILocation(line: 173, column: 28, scope: !191)
!212 = !DILocation(line: 173, column: 32, scope: !191)
!213 = !DILocation(line: 173, column: 5, scope: !191)
!214 = !DILocation(line: 174, column: 3, scope: !191)
!215 = !DILocation(line: 167, column: 27, scope: !216)
!216 = !DILexicalBlockFile(scope: !188, file: !10, discriminator: 2)
!217 = !DILocation(line: 167, column: 31, scope: !216)
!218 = !DILocation(line: 167, column: 25, scope: !216)
!219 = !DILocation(line: 167, column: 3, scope: !216)
!220 = distinct !{!220, !221}
!221 = !DILocation(line: 167, column: 3, scope: !25)
!222 = !DILocation(line: 179, column: 27, scope: !25)
!223 = !DILocation(line: 179, column: 33, scope: !25)
!224 = !DILocation(line: 179, column: 42, scope: !25)
!225 = !DILocation(line: 179, column: 18, scope: !25)
!226 = !DILocation(line: 179, column: 16, scope: !25)
!227 = !DILocation(line: 180, column: 32, scope: !25)
!228 = !DILocation(line: 180, column: 12, scope: !25)
!229 = !DILocation(line: 180, column: 18, scope: !25)
!230 = !DILocation(line: 180, column: 27, scope: !25)
!231 = !DILocation(line: 180, column: 3, scope: !25)
!232 = !DILocation(line: 180, column: 30, scope: !25)
!233 = !DILocation(line: 181, column: 10, scope: !234)
!234 = distinct !DILexicalBlock(scope: !25, file: !10, line: 181, column: 3)
!235 = !DILocation(line: 181, column: 16, scope: !234)
!236 = !DILocation(line: 181, column: 24, scope: !234)
!237 = !DILocation(line: 181, column: 9, scope: !234)
!238 = !DILocation(line: 181, column: 8, scope: !234)
!239 = !DILocation(line: 181, column: 28, scope: !240)
!240 = !DILexicalBlockFile(scope: !241, file: !10, discriminator: 1)
!241 = distinct !DILexicalBlock(scope: !234, file: !10, line: 181, column: 3)
!242 = !DILocation(line: 181, column: 29, scope: !240)
!243 = !DILocation(line: 181, column: 33, scope: !240)
!244 = !DILocation(line: 181, column: 45, scope: !245)
!245 = !DILexicalBlockFile(scope: !241, file: !10, discriminator: 2)
!246 = !DILocation(line: 181, column: 36, scope: !245)
!247 = !DILocation(line: 181, column: 33, scope: !245)
!248 = !DILocation(line: 181, column: 3, scope: !249)
!249 = !DILexicalBlockFile(scope: !234, file: !10, discriminator: 3)
!250 = !DILocation(line: 181, column: 3, scope: !251)
!251 = !DILexicalBlockFile(scope: !234, file: !10, discriminator: 4)
!252 = !DILocation(line: 181, column: 50, scope: !253)
!253 = !DILexicalBlockFile(scope: !241, file: !10, discriminator: 5)
!254 = !DILocation(line: 181, column: 3, scope: !253)
!255 = distinct !{!255, !256}
!256 = !DILocation(line: 181, column: 3, scope: !25)
!257 = !DILocation(line: 183, column: 7, scope: !258)
!258 = distinct !DILexicalBlock(scope: !25, file: !10, line: 183, column: 7)
!259 = !DILocation(line: 183, column: 8, scope: !258)
!260 = !DILocation(line: 183, column: 7, scope: !25)
!261 = !DILocalVariable(name: "err", scope: !262, file: !10, line: 184, type: !263)
!262 = distinct !DILexicalBlock(scope: !258, file: !10, line: 183, column: 13)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_error", file: !4, line: 42, size: 128, align: 64, elements: !264)
!264 = !{!265, !266, !267}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !263, file: !4, line: 43, baseType: !3, size: 32, align: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "syserrno", scope: !263, file: !4, line: 45, baseType: !21, size: 32, align: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !263, file: !4, line: 46, baseType: !268, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!269 = !DILocation(line: 184, column: 23, scope: !262)
!270 = !DILocalVariable(name: "fd_src", scope: !262, file: !10, line: 185, type: !21)
!271 = !DILocation(line: 185, column: 9, scope: !262)
!272 = !DILocalVariable(name: "fd_dst", scope: !262, file: !10, line: 185, type: !21)
!273 = !DILocation(line: 185, column: 17, scope: !262)
!274 = !DILocalVariable(name: "ap", scope: !262, file: !10, line: 186, type: !21)
!275 = !DILocation(line: 186, column: 9, scope: !262)
!276 = !DILocalVariable(name: "p", scope: !262, file: !10, line: 187, type: !268)
!277 = !DILocation(line: 187, column: 11, scope: !262)
!278 = !DILocalVariable(name: "q", scope: !262, file: !10, line: 187, type: !268)
!279 = !DILocation(line: 187, column: 15, scope: !262)
!280 = !DILocation(line: 189, column: 29, scope: !262)
!281 = !DILocation(line: 189, column: 49, scope: !262)
!282 = !DILocation(line: 189, column: 43, scope: !262)
!283 = !DILocation(line: 189, column: 9, scope: !284)
!284 = !DILexicalBlockFile(scope: !262, file: !10, discriminator: 1)
!285 = !DILocation(line: 189, column: 7, scope: !262)
!286 = !DILocation(line: 190, column: 36, scope: !262)
!287 = !DILocation(line: 190, column: 50, scope: !262)
!288 = !DILocation(line: 190, column: 56, scope: !262)
!289 = !DILocation(line: 191, column: 27, scope: !262)
!290 = !DILocation(line: 191, column: 33, scope: !262)
!291 = !DILocation(line: 191, column: 45, scope: !262)
!292 = !DILocation(line: 191, column: 51, scope: !262)
!293 = !DILocation(line: 191, column: 62, scope: !262)
!294 = !DILocation(line: 191, column: 68, scope: !262)
!295 = !DILocation(line: 190, column: 9, scope: !262)
!296 = !DILocation(line: 190, column: 7, scope: !262)
!297 = !DILocation(line: 193, column: 19, scope: !262)
!298 = !DILocation(line: 193, column: 14, scope: !262)
!299 = !DILocation(line: 193, column: 12, scope: !262)
!300 = !DILocation(line: 194, column: 9, scope: !301)
!301 = distinct !DILexicalBlock(scope: !262, file: !10, line: 194, column: 9)
!302 = !DILocation(line: 194, column: 16, scope: !301)
!303 = !DILocation(line: 194, column: 9, scope: !262)
!304 = !DILocation(line: 195, column: 15, scope: !301)
!305 = !DILocation(line: 195, column: 63, scope: !301)
!306 = !DILocation(line: 195, column: 7, scope: !307)
!307 = !DILexicalBlockFile(scope: !301, file: !10, discriminator: 1)
!308 = !DILocation(line: 195, column: 7, scope: !301)
!309 = !DILocation(line: 196, column: 20, scope: !262)
!310 = !DILocation(line: 196, column: 14, scope: !262)
!311 = !DILocation(line: 196, column: 12, scope: !262)
!312 = !DILocation(line: 197, column: 9, scope: !313)
!313 = distinct !DILexicalBlock(scope: !262, file: !10, line: 197, column: 9)
!314 = !DILocation(line: 197, column: 16, scope: !313)
!315 = !DILocation(line: 197, column: 9, scope: !262)
!316 = !DILocation(line: 198, column: 15, scope: !313)
!317 = !DILocation(line: 198, column: 66, scope: !313)
!318 = !DILocation(line: 198, column: 7, scope: !319)
!319 = !DILexicalBlockFile(scope: !313, file: !10, discriminator: 1)
!320 = !DILocation(line: 198, column: 7, scope: !313)
!321 = !DILocation(line: 200, column: 28, scope: !322)
!322 = distinct !DILexicalBlock(scope: !262, file: !10, line: 200, column: 9)
!323 = !DILocation(line: 200, column: 13, scope: !322)
!324 = !DILocation(line: 200, column: 24, scope: !322)
!325 = !DILocation(line: 200, column: 30, scope: !322)
!326 = !DILocation(line: 200, column: 9, scope: !322)
!327 = !DILocation(line: 200, column: 46, scope: !322)
!328 = !DILocation(line: 200, column: 9, scope: !262)
!329 = !DILocation(line: 201, column: 14, scope: !322)
!330 = !DILocation(line: 202, column: 14, scope: !322)
!331 = !DILocation(line: 202, column: 28, scope: !322)
!332 = !DILocation(line: 201, column: 7, scope: !333)
!333 = !DILexicalBlockFile(scope: !322, file: !10, discriminator: 1)
!334 = !DILocation(line: 201, column: 7, scope: !322)
!335 = !DILocation(line: 204, column: 15, scope: !336)
!336 = distinct !DILexicalBlock(scope: !262, file: !10, line: 204, column: 9)
!337 = !DILocation(line: 204, column: 9, scope: !336)
!338 = !DILocation(line: 204, column: 9, scope: !262)
!339 = !DILocation(line: 205, column: 15, scope: !336)
!340 = !DILocation(line: 205, column: 52, scope: !336)
!341 = !DILocation(line: 205, column: 7, scope: !342)
!342 = !DILexicalBlockFile(scope: !336, file: !10, discriminator: 1)
!343 = !DILocation(line: 205, column: 7, scope: !336)
!344 = !DILocation(line: 206, column: 15, scope: !345)
!345 = distinct !DILexicalBlock(scope: !262, file: !10, line: 206, column: 9)
!346 = !DILocation(line: 206, column: 9, scope: !345)
!347 = !DILocation(line: 206, column: 9, scope: !262)
!348 = !DILocation(line: 207, column: 15, scope: !345)
!349 = !DILocation(line: 207, column: 53, scope: !345)
!350 = !DILocation(line: 207, column: 7, scope: !351)
!351 = !DILexicalBlockFile(scope: !345, file: !10, discriminator: 1)
!352 = !DILocation(line: 207, column: 7, scope: !345)
!353 = !DILocation(line: 208, column: 11, scope: !262)
!354 = !DILocation(line: 208, column: 5, scope: !262)
!355 = !DILocation(line: 210, column: 16, scope: !356)
!356 = distinct !DILexicalBlock(scope: !262, file: !10, line: 210, column: 9)
!357 = !DILocation(line: 210, column: 19, scope: !356)
!358 = !DILocation(line: 210, column: 9, scope: !356)
!359 = !DILocation(line: 210, column: 9, scope: !262)
!360 = !DILocation(line: 211, column: 15, scope: !356)
!361 = !DILocation(line: 211, column: 80, scope: !356)
!362 = !DILocation(line: 211, column: 83, scope: !356)
!363 = !DILocation(line: 211, column: 7, scope: !364)
!364 = !DILexicalBlockFile(scope: !356, file: !10, discriminator: 1)
!365 = !DILocation(line: 211, column: 7, scope: !356)
!366 = !DILocation(line: 212, column: 10, scope: !262)
!367 = !DILocation(line: 212, column: 5, scope: !262)
!368 = !DILocation(line: 213, column: 10, scope: !262)
!369 = !DILocation(line: 213, column: 5, scope: !262)
!370 = !DILocation(line: 215, column: 12, scope: !262)
!371 = !DILocation(line: 215, column: 64, scope: !262)
!372 = !DILocation(line: 215, column: 70, scope: !262)
!373 = !DILocation(line: 215, column: 80, scope: !262)
!374 = !DILocation(line: 215, column: 86, scope: !262)
!375 = !DILocation(line: 215, column: 5, scope: !284)
!376 = !DILocation(line: 217, column: 11, scope: !377)
!377 = distinct !DILexicalBlock(scope: !262, file: !10, line: 217, column: 5)
!378 = !DILocation(line: 217, column: 17, scope: !377)
!379 = !DILocation(line: 217, column: 10, scope: !377)
!380 = !DILocation(line: 217, column: 21, scope: !381)
!381 = !DILexicalBlockFile(scope: !382, file: !10, discriminator: 1)
!382 = distinct !DILexicalBlock(scope: !377, file: !10, line: 217, column: 5)
!383 = !DILocation(line: 217, column: 23, scope: !381)
!384 = !DILocation(line: 217, column: 29, scope: !381)
!385 = !DILocation(line: 217, column: 22, scope: !381)
!386 = !DILocation(line: 217, column: 5, scope: !381)
!387 = !DILocation(line: 218, column: 21, scope: !388)
!388 = distinct !DILexicalBlock(scope: !382, file: !10, line: 218, column: 11)
!389 = !DILocation(line: 218, column: 12, scope: !388)
!390 = !DILocation(line: 218, column: 11, scope: !382)
!391 = !DILocation(line: 219, column: 27, scope: !388)
!392 = !DILocation(line: 219, column: 24, scope: !388)
!393 = !DILocation(line: 219, column: 24, scope: !394)
!394 = !DILexicalBlockFile(scope: !388, file: !10, discriminator: 1)
!395 = !DILocation(line: 219, column: 37, scope: !396)
!396 = !DILexicalBlockFile(scope: !388, file: !10, discriminator: 2)
!397 = !DILocation(line: 219, column: 56, scope: !396)
!398 = !DILocation(line: 219, column: 39, scope: !396)
!399 = !DILocation(line: 219, column: 60, scope: !400)
!400 = !DILexicalBlockFile(scope: !388, file: !10, discriminator: 3)
!401 = !DILocation(line: 219, column: 37, scope: !400)
!402 = !DILocation(line: 219, column: 37, scope: !403)
!403 = !DILexicalBlockFile(scope: !388, file: !10, discriminator: 4)
!404 = !DILocation(line: 219, column: 37, scope: !405)
!405 = !DILexicalBlockFile(scope: !388, file: !10, discriminator: 5)
!406 = !DILocation(line: 219, column: 24, scope: !405)
!407 = !DILocation(line: 219, column: 24, scope: !408)
!408 = !DILexicalBlockFile(scope: !388, file: !10, discriminator: 6)
!409 = !DILocation(line: 219, column: 85, scope: !408)
!410 = !DILocation(line: 219, column: 87, scope: !408)
!411 = !DILocation(line: 219, column: 9, scope: !408)
!412 = !DILocation(line: 218, column: 22, scope: !394)
!413 = !DILocation(line: 217, column: 40, scope: !414)
!414 = !DILexicalBlockFile(scope: !382, file: !10, discriminator: 2)
!415 = !DILocation(line: 217, column: 5, scope: !414)
!416 = distinct !{!416, !417}
!417 = !DILocation(line: 217, column: 5, scope: !262)
!418 = !DILocation(line: 220, column: 5, scope: !262)
!419 = !DILocation(line: 222, column: 19, scope: !262)
!420 = !DILocation(line: 222, column: 5, scope: !262)
!421 = !DILocation(line: 223, column: 3, scope: !262)
!422 = !DILocation(line: 226, column: 16, scope: !423)
!423 = distinct !DILexicalBlock(scope: !258, file: !10, line: 223, column: 10)
!424 = !DILocation(line: 226, column: 26, scope: !423)
!425 = !DILocation(line: 226, column: 5, scope: !423)
!426 = !DILocation(line: 229, column: 34, scope: !423)
!427 = !DILocation(line: 229, column: 14, scope: !423)
!428 = !DILocation(line: 229, column: 20, scope: !423)
!429 = !DILocation(line: 229, column: 29, scope: !423)
!430 = !DILocation(line: 229, column: 5, scope: !423)
!431 = !DILocation(line: 229, column: 32, scope: !423)
!432 = !DILocation(line: 230, column: 11, scope: !433)
!433 = distinct !DILexicalBlock(scope: !423, file: !10, line: 230, column: 5)
!434 = !DILocation(line: 230, column: 10, scope: !433)
!435 = !DILocation(line: 230, column: 15, scope: !436)
!436 = !DILexicalBlockFile(scope: !437, file: !10, discriminator: 1)
!437 = distinct !DILexicalBlock(scope: !433, file: !10, line: 230, column: 5)
!438 = !DILocation(line: 230, column: 17, scope: !436)
!439 = !DILocation(line: 230, column: 23, scope: !436)
!440 = !DILocation(line: 230, column: 16, scope: !436)
!441 = !DILocation(line: 230, column: 5, scope: !436)
!442 = !DILocation(line: 231, column: 20, scope: !443)
!443 = distinct !DILexicalBlock(scope: !437, file: !10, line: 231, column: 11)
!444 = !DILocation(line: 231, column: 11, scope: !443)
!445 = !DILocation(line: 231, column: 11, scope: !437)
!446 = !DILocation(line: 232, column: 29, scope: !447)
!447 = distinct !DILexicalBlock(scope: !443, file: !10, line: 232, column: 13)
!448 = !DILocation(line: 232, column: 20, scope: !447)
!449 = !DILocation(line: 232, column: 33, scope: !447)
!450 = !DILocation(line: 232, column: 13, scope: !447)
!451 = !DILocation(line: 232, column: 13, scope: !443)
!452 = !DILocation(line: 233, column: 19, scope: !447)
!453 = !DILocation(line: 234, column: 28, scope: !447)
!454 = !DILocation(line: 234, column: 19, scope: !447)
!455 = !DILocation(line: 234, column: 32, scope: !447)
!456 = !DILocation(line: 233, column: 11, scope: !457)
!457 = !DILexicalBlockFile(scope: !447, file: !10, discriminator: 1)
!458 = !DILocation(line: 233, column: 11, scope: !447)
!459 = !DILocation(line: 232, column: 41, scope: !457)
!460 = !DILocation(line: 231, column: 21, scope: !461)
!461 = !DILexicalBlockFile(scope: !443, file: !10, discriminator: 1)
!462 = !DILocation(line: 230, column: 34, scope: !463)
!463 = !DILexicalBlockFile(scope: !437, file: !10, discriminator: 2)
!464 = !DILocation(line: 230, column: 5, scope: !463)
!465 = distinct !{!465, !466}
!466 = !DILocation(line: 230, column: 5, scope: !423)
!467 = !DILocation(line: 238, column: 11, scope: !25)
!468 = !DILocation(line: 238, column: 19, scope: !25)
!469 = !DILocation(line: 238, column: 3, scope: !470)
!470 = !DILexicalBlockFile(scope: !25, file: !10, discriminator: 1)
!471 = !DILocation(line: 240, column: 3, scope: !25)
!472 = !DILocation(line: 241, column: 1, scope: !25)
!473 = distinct !DISubprogram(name: "scandepot", scope: !10, file: !10, line: 88, type: !474, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !33)
!474 = !DISubroutineType(types: !475)
!475 = !{!74}
!476 = !DILocalVariable(name: "depot", scope: !473, file: !10, line: 90, type: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !479, line: 127, baseType: !480)
!479 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !479, line: 127, flags: DIFlagFwdDecl)
!481 = !DILocation(line: 90, column: 8, scope: !473)
!482 = !DILocalVariable(name: "de", scope: !473, file: !10, line: 91, type: !483)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64, align: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !485, line: 22, size: 2240, align: 64, elements: !486)
!485 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!486 = !{!487, !490, !491, !493, !495}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !484, file: !485, line: 25, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !59, line: 127, baseType: !489)
!489 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !484, file: !485, line: 26, baseType: !58, size: 64, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !484, file: !485, line: 31, baseType: !492, size: 16, align: 16, offset: 128)
!492 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !484, file: !485, line: 32, baseType: !494, size: 8, align: 8, offset: 144)
!494 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !484, file: !485, line: 33, baseType: !496, size: 2048, align: 8, offset: 152)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, align: 8, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 256)
!499 = !DILocation(line: 91, column: 18, scope: !473)
!500 = !DILocalVariable(name: "queue", scope: !473, file: !10, line: 92, type: !74)
!501 = !DILocation(line: 92, column: 21, scope: !473)
!502 = !DILocation(line: 94, column: 19, scope: !473)
!503 = !DILocation(line: 94, column: 11, scope: !473)
!504 = !DILocation(line: 94, column: 9, scope: !473)
!505 = !DILocation(line: 95, column: 8, scope: !506)
!506 = distinct !DILexicalBlock(scope: !473, file: !10, line: 95, column: 7)
!507 = !DILocation(line: 95, column: 7, scope: !473)
!508 = !DILocation(line: 96, column: 13, scope: !506)
!509 = !DILocation(line: 96, column: 65, scope: !506)
!510 = !DILocation(line: 96, column: 5, scope: !511)
!511 = !DILexicalBlockFile(scope: !506, file: !10, discriminator: 1)
!512 = !DILocation(line: 96, column: 5, scope: !506)
!513 = !DILocation(line: 97, column: 3, scope: !473)
!514 = !DILocation(line: 97, column: 23, scope: !515)
!515 = !DILexicalBlockFile(scope: !473, file: !10, discriminator: 1)
!516 = !DILocation(line: 97, column: 15, scope: !515)
!517 = !DILocation(line: 97, column: 13, scope: !515)
!518 = !DILocation(line: 97, column: 3, scope: !515)
!519 = !DILocalVariable(name: "pq", scope: !520, file: !10, line: 98, type: !74)
!520 = distinct !DILexicalBlock(scope: !473, file: !10, line: 97, column: 32)
!521 = !DILocation(line: 98, column: 23, scope: !520)
!522 = !DILocalVariable(name: "p", scope: !520, file: !10, line: 99, type: !268)
!523 = !DILocation(line: 99, column: 11, scope: !520)
!524 = !DILocation(line: 101, column: 9, scope: !525)
!525 = distinct !DILexicalBlock(scope: !520, file: !10, line: 101, column: 9)
!526 = !DILocation(line: 101, column: 13, scope: !525)
!527 = !DILocation(line: 101, column: 23, scope: !525)
!528 = !DILocation(line: 101, column: 9, scope: !520)
!529 = !DILocation(line: 101, column: 31, scope: !530)
!530 = !DILexicalBlockFile(scope: !525, file: !10, discriminator: 1)
!531 = distinct !{!531, !513}
!532 = !DILocation(line: 102, column: 10, scope: !520)
!533 = !DILocation(line: 102, column: 8, scope: !520)
!534 = !DILocation(line: 103, column: 5, scope: !520)
!535 = !DILocation(line: 103, column: 9, scope: !520)
!536 = !DILocation(line: 103, column: 14, scope: !520)
!537 = !DILocation(line: 103, column: 25, scope: !520)
!538 = !DILocation(line: 103, column: 31, scope: !520)
!539 = !DILocation(line: 104, column: 5, scope: !520)
!540 = !DILocation(line: 104, column: 9, scope: !520)
!541 = !DILocation(line: 104, column: 14, scope: !520)
!542 = !DILocation(line: 104, column: 25, scope: !520)
!543 = !DILocation(line: 104, column: 31, scope: !520)
!544 = !DILocation(line: 105, column: 5, scope: !520)
!545 = !DILocation(line: 105, column: 9, scope: !520)
!546 = !DILocation(line: 105, column: 14, scope: !520)
!547 = !DILocation(line: 105, column: 22, scope: !520)
!548 = !DILocation(line: 106, column: 5, scope: !520)
!549 = !DILocation(line: 106, column: 9, scope: !520)
!550 = !DILocation(line: 106, column: 14, scope: !520)
!551 = !DILocation(line: 106, column: 22, scope: !520)
!552 = !DILocation(line: 107, column: 5, scope: !520)
!553 = !DILocation(line: 107, column: 9, scope: !520)
!554 = !DILocation(line: 107, column: 14, scope: !520)
!555 = !DILocation(line: 107, column: 19, scope: !520)
!556 = !DILocation(line: 108, column: 50, scope: !520)
!557 = !DILocation(line: 108, column: 54, scope: !520)
!558 = !DILocation(line: 108, column: 59, scope: !520)
!559 = !DILocation(line: 108, column: 70, scope: !520)
!560 = !DILocation(line: 108, column: 25, scope: !520)
!561 = !DILocation(line: 108, column: 29, scope: !520)
!562 = !DILocation(line: 108, column: 34, scope: !520)
!563 = !DILocation(line: 108, column: 48, scope: !520)
!564 = !DILocation(line: 108, column: 5, scope: !520)
!565 = !DILocation(line: 108, column: 9, scope: !520)
!566 = !DILocation(line: 108, column: 14, scope: !520)
!567 = !DILocation(line: 108, column: 23, scope: !520)
!568 = !DILocation(line: 109, column: 5, scope: !520)
!569 = !DILocation(line: 109, column: 9, scope: !520)
!570 = !DILocation(line: 109, column: 14, scope: !520)
!571 = !DILocation(line: 109, column: 23, scope: !520)
!572 = !DILocation(line: 110, column: 25, scope: !520)
!573 = !DILocation(line: 110, column: 18, scope: !520)
!574 = !DILocation(line: 110, column: 39, scope: !520)
!575 = !DILocation(line: 110, column: 52, scope: !520)
!576 = !DILocation(line: 110, column: 56, scope: !520)
!577 = !DILocation(line: 110, column: 45, scope: !578)
!578 = !DILexicalBlockFile(scope: !520, file: !10, discriminator: 1)
!579 = !DILocation(line: 110, column: 43, scope: !520)
!580 = !DILocation(line: 110, column: 64, scope: !520)
!581 = !DILocation(line: 110, column: 9, scope: !582)
!582 = !DILexicalBlockFile(scope: !520, file: !10, discriminator: 2)
!583 = !DILocation(line: 110, column: 7, scope: !520)
!584 = !DILocation(line: 111, column: 13, scope: !520)
!585 = !DILocation(line: 111, column: 25, scope: !520)
!586 = !DILocation(line: 111, column: 39, scope: !520)
!587 = !DILocation(line: 111, column: 43, scope: !520)
!588 = !DILocation(line: 111, column: 5, scope: !520)
!589 = !DILocation(line: 112, column: 24, scope: !520)
!590 = !DILocation(line: 112, column: 5, scope: !520)
!591 = !DILocation(line: 112, column: 9, scope: !520)
!592 = !DILocation(line: 112, column: 14, scope: !520)
!593 = !DILocation(line: 112, column: 22, scope: !520)
!594 = !DILocation(line: 113, column: 29, scope: !595)
!595 = distinct !DILexicalBlock(scope: !520, file: !10, line: 113, column: 9)
!596 = !DILocation(line: 113, column: 33, scope: !595)
!597 = !DILocation(line: 113, column: 40, scope: !595)
!598 = !DILocation(line: 113, column: 10, scope: !595)
!599 = !DILocation(line: 113, column: 9, scope: !520)
!600 = !DILocation(line: 114, column: 7, scope: !601)
!601 = distinct !DILexicalBlock(scope: !595, file: !10, line: 113, column: 45)
!602 = !DILocation(line: 114, column: 11, scope: !601)
!603 = !DILocation(line: 114, column: 16, scope: !601)
!604 = !DILocation(line: 114, column: 22, scope: !601)
!605 = !DILocation(line: 115, column: 48, scope: !601)
!606 = !DILocation(line: 115, column: 52, scope: !601)
!607 = !DILocation(line: 115, column: 57, scope: !601)
!608 = !DILocation(line: 115, column: 65, scope: !601)
!609 = !DILocation(line: 115, column: 28, scope: !601)
!610 = !DILocation(line: 115, column: 32, scope: !601)
!611 = !DILocation(line: 115, column: 37, scope: !601)
!612 = !DILocation(line: 115, column: 46, scope: !601)
!613 = !DILocation(line: 115, column: 7, scope: !601)
!614 = !DILocation(line: 115, column: 11, scope: !601)
!615 = !DILocation(line: 115, column: 16, scope: !601)
!616 = !DILocation(line: 115, column: 26, scope: !601)
!617 = !DILocation(line: 116, column: 5, scope: !601)
!618 = !DILocation(line: 117, column: 22, scope: !520)
!619 = !DILocation(line: 117, column: 5, scope: !520)
!620 = !DILocation(line: 117, column: 9, scope: !520)
!621 = !DILocation(line: 117, column: 20, scope: !520)
!622 = !DILocation(line: 118, column: 12, scope: !520)
!623 = !DILocation(line: 118, column: 10, scope: !520)
!624 = !DILocation(line: 97, column: 3, scope: !625)
!625 = !DILexicalBlockFile(scope: !473, file: !10, discriminator: 2)
!626 = !DILocation(line: 120, column: 12, scope: !473)
!627 = !DILocation(line: 120, column: 3, scope: !473)
!628 = !DILocation(line: 122, column: 10, scope: !473)
!629 = !DILocation(line: 122, column: 3, scope: !473)
!630 = distinct !DISubprogram(name: "partmatches", scope: !10, file: !10, line: 126, type: !631, isLocal: true, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !33)
!631 = !DISubroutineType(types: !632)
!632 = !{!633, !40, !40}
!633 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!634 = !DILocalVariable(name: "pi", arg: 1, scope: !630, file: !10, line: 126, type: !40)
!635 = !DILocation(line: 126, column: 30, scope: !630)
!636 = !DILocalVariable(name: "refi", arg: 2, scope: !630, file: !10, line: 126, type: !40)
!637 = !DILocation(line: 126, column: 51, scope: !630)
!638 = !DILocation(line: 128, column: 11, scope: !630)
!639 = !DILocation(line: 128, column: 15, scope: !630)
!640 = !DILocation(line: 128, column: 22, scope: !630)
!641 = !DILocation(line: 129, column: 18, scope: !630)
!642 = !DILocation(line: 129, column: 22, scope: !630)
!643 = !DILocation(line: 129, column: 30, scope: !630)
!644 = !DILocation(line: 129, column: 36, scope: !630)
!645 = !DILocation(line: 129, column: 11, scope: !630)
!646 = !DILocation(line: 129, column: 44, scope: !630)
!647 = !DILocation(line: 129, column: 49, scope: !630)
!648 = !DILocation(line: 130, column: 11, scope: !630)
!649 = !DILocation(line: 130, column: 15, scope: !630)
!650 = !DILocation(line: 130, column: 27, scope: !630)
!651 = !DILocation(line: 130, column: 33, scope: !630)
!652 = !DILocation(line: 130, column: 24, scope: !630)
!653 = !DILocation(line: 130, column: 42, scope: !630)
!654 = !DILocation(line: 131, column: 11, scope: !630)
!655 = !DILocation(line: 131, column: 15, scope: !630)
!656 = !DILocation(line: 131, column: 29, scope: !630)
!657 = !DILocation(line: 131, column: 35, scope: !630)
!658 = !DILocation(line: 131, column: 26, scope: !630)
!659 = !DILocation(line: 128, column: 3, scope: !660)
!660 = !DILexicalBlockFile(scope: !630, file: !10, discriminator: 1)
!661 = distinct !DISubprogram(name: "do_queue", scope: !10, file: !10, line: 244, type: !26, isLocal: false, isDefinition: true, scopeLine: 245, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !33)
!662 = !DILocalVariable(name: "argv", arg: 1, scope: !661, file: !10, line: 244, type: !28)
!663 = !DILocation(line: 244, column: 29, scope: !661)
!664 = !DILocalVariable(name: "queue", scope: !661, file: !10, line: 246, type: !74)
!665 = !DILocation(line: 246, column: 21, scope: !661)
!666 = !DILocalVariable(name: "pq", scope: !661, file: !10, line: 247, type: !74)
!667 = !DILocation(line: 247, column: 21, scope: !661)
!668 = !DILocalVariable(name: "head", scope: !661, file: !10, line: 248, type: !30)
!669 = !DILocation(line: 248, column: 15, scope: !661)
!670 = !DILocalVariable(name: "stab", scope: !661, file: !10, line: 249, type: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !672, line: 46, size: 1152, align: 64, elements: !673)
!672 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!673 = !{!674, !676, !677, !679, !680, !682, !684, !685, !686, !687, !689, !691, !697, !698, !699}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !671, file: !672, line: 48, baseType: !675, size: 64, align: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !59, line: 124, baseType: !489)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !671, file: !672, line: 53, baseType: !488, size: 64, align: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !671, file: !672, line: 61, baseType: !678, size: 64, align: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !59, line: 130, baseType: !489)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !671, file: !672, line: 62, baseType: !90, size: 32, align: 32, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !671, file: !672, line: 64, baseType: !681, size: 32, align: 32, offset: 224)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !59, line: 125, baseType: !20)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !671, file: !672, line: 65, baseType: !683, size: 32, align: 32, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !59, line: 126, baseType: !20)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !671, file: !672, line: 67, baseType: !21, size: 32, align: 32, offset: 288)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !671, file: !672, line: 69, baseType: !675, size: 64, align: 64, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !671, file: !672, line: 74, baseType: !58, size: 64, align: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !671, file: !672, line: 78, baseType: !688, size: 64, align: 64, offset: 448)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !59, line: 153, baseType: !17)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !671, file: !672, line: 80, baseType: !690, size: 64, align: 64, offset: 512)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !59, line: 158, baseType: !17)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !671, file: !672, line: 91, baseType: !692, size: 128, align: 64, offset: 576)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !93, line: 120, size: 128, align: 64, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !692, file: !93, line: 122, baseType: !94, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !692, file: !93, line: 123, baseType: !696, size: 64, align: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !59, line: 175, baseType: !17)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !671, file: !672, line: 92, baseType: !692, size: 128, align: 64, offset: 704)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !671, file: !672, line: 93, baseType: !692, size: 128, align: 64, offset: 832)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !671, file: !672, line: 106, baseType: !700, size: 192, align: 64, offset: 960)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 192, align: 64, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 3)
!703 = !DILocation(line: 249, column: 15, scope: !661)
!704 = !DILocalVariable(name: "bytes", scope: !661, file: !10, line: 250, type: !56)
!705 = !DILocation(line: 250, column: 9, scope: !661)
!706 = !DILocation(line: 252, column: 8, scope: !707)
!707 = distinct !DILexicalBlock(scope: !661, file: !10, line: 252, column: 7)
!708 = !DILocation(line: 252, column: 7, scope: !707)
!709 = !DILocation(line: 252, column: 7, scope: !661)
!710 = !DILocation(line: 253, column: 14, scope: !707)
!711 = !DILocation(line: 253, column: 50, scope: !707)
!712 = !DILocation(line: 253, column: 61, scope: !707)
!713 = !DILocation(line: 253, column: 5, scope: !714)
!714 = !DILexicalBlockFile(scope: !707, file: !10, discriminator: 1)
!715 = !DILocation(line: 253, column: 5, scope: !707)
!716 = !DILocation(line: 255, column: 11, scope: !661)
!717 = !DILocation(line: 255, column: 9, scope: !661)
!718 = !DILocation(line: 257, column: 7, scope: !661)
!719 = !DILocation(line: 258, column: 12, scope: !720)
!720 = distinct !DILexicalBlock(scope: !661, file: !10, line: 258, column: 3)
!721 = !DILocation(line: 258, column: 10, scope: !720)
!722 = !DILocation(line: 258, column: 8, scope: !720)
!723 = !DILocation(line: 258, column: 19, scope: !724)
!724 = !DILexicalBlockFile(scope: !725, file: !10, discriminator: 1)
!725 = distinct !DILexicalBlock(scope: !720, file: !10, line: 258, column: 3)
!726 = !DILocation(line: 258, column: 3, scope: !724)
!727 = !DILocation(line: 259, column: 9, scope: !728)
!728 = distinct !DILexicalBlock(scope: !729, file: !10, line: 259, column: 9)
!729 = distinct !DILexicalBlock(scope: !725, file: !10, line: 258, column: 44)
!730 = !DILocation(line: 259, column: 13, scope: !728)
!731 = !DILocation(line: 259, column: 18, scope: !728)
!732 = !DILocation(line: 259, column: 9, scope: !729)
!733 = !DILocation(line: 259, column: 26, scope: !734)
!734 = !DILexicalBlockFile(scope: !728, file: !10, discriminator: 1)
!735 = !DILocation(line: 260, column: 19, scope: !729)
!736 = !DILocation(line: 260, column: 11, scope: !729)
!737 = !DILocation(line: 260, column: 24, scope: !729)
!738 = !DILocation(line: 260, column: 5, scope: !739)
!739 = !DILexicalBlockFile(scope: !729, file: !10, discriminator: 1)
!740 = !DILocation(line: 260, column: 37, scope: !729)
!741 = !DILocation(line: 261, column: 15, scope: !742)
!742 = distinct !DILexicalBlock(scope: !729, file: !10, line: 261, column: 9)
!743 = !DILocation(line: 261, column: 19, scope: !742)
!744 = !DILocation(line: 261, column: 24, scope: !742)
!745 = !DILocation(line: 261, column: 9, scope: !742)
!746 = !DILocation(line: 261, column: 9, scope: !729)
!747 = !DILocation(line: 262, column: 14, scope: !742)
!748 = !DILocation(line: 262, column: 50, scope: !742)
!749 = !DILocation(line: 262, column: 54, scope: !742)
!750 = !DILocation(line: 262, column: 59, scope: !742)
!751 = !DILocation(line: 262, column: 7, scope: !752)
!752 = !DILexicalBlockFile(scope: !742, file: !10, discriminator: 1)
!753 = !DILocation(line: 262, column: 7, scope: !742)
!754 = !DILocation(line: 263, column: 13, scope: !755)
!755 = distinct !DILexicalBlock(scope: !729, file: !10, line: 263, column: 8)
!756 = !DILocation(line: 263, column: 11, scope: !755)
!757 = !DILocation(line: 263, column: 22, scope: !755)
!758 = !DILocation(line: 263, column: 8, scope: !729)
!759 = !DILocation(line: 264, column: 19, scope: !760)
!760 = distinct !DILexicalBlock(scope: !755, file: !10, line: 263, column: 31)
!761 = !DILocation(line: 264, column: 12, scope: !760)
!762 = !DILocation(line: 265, column: 14, scope: !760)
!763 = !DILocation(line: 265, column: 44, scope: !760)
!764 = !DILocation(line: 265, column: 48, scope: !760)
