; ModuleID = './[inter]dpkg-split--split.o.i'
source_filename = "./[inter]dpkg-split--split.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.1, i32 }
%struct.anon.1 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }
%struct.pkgbin = type { %struct.dependency*, i8, i32, %struct.dpkg_arch*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.dpkg_version, %struct.conffile*, %struct.arbitraryfield* }
%struct.conffile = type { %struct.conffile*, i8*, i8*, i8 }
%struct.arbitraryfield = type { %struct.arbitraryfield*, i8*, i8* }
%struct.perpackagestate = type opaque
%struct.archivedetails = type { %struct.archivedetails*, i8*, i8*, i8*, i8* }
%struct.anon = type { %struct.trigaw*, %struct.trigaw* }

!148 = !DILocalVariable(name: "argv", arg: 1, scope: !137, file: !138, line: 264, type: !142)
!149 = !DIExpression()
!150 = !DILocation(line: 264, column: 29, scope: !137)
!151 = !DILocalVariable(name: "sourcefile", scope: !137, file: !138, line: 266, type: !144)
!152 = !DILocation(line: 266, column: 14, scope: !137)
!153 = !DILocalVariable(name: "prefix", scope: !137, file: !138, line: 266, type: !144)
!154 = !DILocation(line: 266, column: 27, scope: !137)
!155 = !DILocation(line: 268, column: 20, scope: !137)
!156 = !DILocation(line: 268, column: 15, scope: !137)
!157 = !DILocation(line: 268, column: 13, scope: !137)
!158 = !DILocation(line: 269, column: 7, scope: !159)
!159 = distinct !DILexicalBlock(scope: !137, file: !138, line: 269, column: 6)
!160 = !DILocation(line: 269, column: 6, scope: !137)
!161 = !DILocation(line: 270, column: 12, scope: !159)
!162 = !DILocation(line: 270, column: 3, scope: !163)
!163 = !DILexicalBlockFile(scope: !159, file: !138, discriminator: 1)
!164 = !DILocation(line: 270, column: 3, scope: !159)
!165 = !DILocation(line: 271, column: 16, scope: !137)
!166 = !DILocation(line: 271, column: 11, scope: !137)
!167 = !DILocation(line: 271, column: 9, scope: !137)
!168 = !DILocation(line: 272, column: 6, scope: !169)
!169 = distinct !DILexicalBlock(scope: !137, file: !138, line: 272, column: 6)
!170 = !DILocation(line: 272, column: 13, scope: !169)
!171 = !DILocation(line: 272, column: 17, scope: !172)
!172 = !DILexicalBlockFile(scope: !169, file: !138, discriminator: 1)
!173 = !DILocation(line: 272, column: 16, scope: !172)
!174 = !DILocation(line: 272, column: 6, scope: !172)
!175 = !DILocation(line: 273, column: 12, scope: !169)
!176 = !DILocation(line: 273, column: 3, scope: !172)
!177 = !DILocation(line: 273, column: 3, scope: !169)
!178 = !DILocation(line: 274, column: 7, scope: !179)
!179 = distinct !DILexicalBlock(scope: !137, file: !138, line: 274, column: 6)
!180 = !DILocation(line: 274, column: 6, scope: !137)
!181 = !DILocalVariable(name: "sourcefile_len", scope: !182, file: !138, line: 275, type: !183)
!182 = distinct !DILexicalBlock(scope: !179, file: !138, line: 274, column: 15)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !184, line: 216, baseType: !185)
!184 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!185 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!186 = !DILocation(line: 275, column: 10, scope: !182)
!187 = !DILocation(line: 275, column: 34, scope: !182)
!188 = !DILocation(line: 275, column: 27, scope: !182)
!189 = !DILocation(line: 277, column: 21, scope: !190)
!190 = distinct !DILexicalBlock(scope: !182, file: !138, line: 277, column: 7)
!191 = !DILocation(line: 277, column: 7, scope: !190)
!192 = !DILocation(line: 277, column: 7, scope: !182)
!193 = !DILocation(line: 278, column: 19, scope: !190)
!194 = !DILocation(line: 278, column: 4, scope: !190)
!195 = !DILocation(line: 280, column: 23, scope: !182)
!196 = !DILocation(line: 280, column: 35, scope: !182)
!197 = !DILocation(line: 280, column: 12, scope: !182)
!198 = !DILocation(line: 280, column: 10, scope: !182)
!199 = !DILocation(line: 281, column: 2, scope: !182)
!200 = !DILocation(line: 283, column: 10, scope: !137)
!201 = !DILocation(line: 283, column: 22, scope: !137)
!202 = !DILocation(line: 283, column: 30, scope: !137)
!203 = !DILocation(line: 283, column: 47, scope: !137)
!204 = !DILocation(line: 283, column: 2, scope: !137)
!205 = !DILocation(line: 285, column: 2, scope: !137)
!206 = distinct !DISubprogram(name: "mksplit", scope: !138, file: !138, line: 128, type: !207, isLocal: true, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !147)
!207 = !DISubroutineType(types: !208)
!208 = !{!141, !144, !144, !209, !213}
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !210, line: 86, baseType: !211)
!210 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !212, line: 131, baseType: !132)
!212 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!213 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!214 = !DILocalVariable(name: "file_src", arg: 1, scope: !206, file: !138, line: 128, type: !144)
!215 = !DILocation(line: 128, column: 21, scope: !206)
!216 = !DILocalVariable(name: "prefix", arg: 2, scope: !206, file: !138, line: 128, type: !144)
!217 = !DILocation(line: 128, column: 43, scope: !206)
!218 = !DILocalVariable(name: "maxpartsize", arg: 3, scope: !206, file: !138, line: 128, type: !209)
!219 = !DILocation(line: 128, column: 57, scope: !206)
!220 = !DILocalVariable(name: "msdos", arg: 4, scope: !206, file: !138, line: 129, type: !213)
!221 = !DILocation(line: 129, column: 13, scope: !206)
!222 = !DILocalVariable(name: "pkg", scope: !206, file: !138, line: 131, type: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !225)
!225 = !{!226, !273, !274, !275, !276, !277, !278, !279, !280, !281, !311, !312, !315, !324, !340, !341, !347, !350, !351, !352}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !224, file: !4, line: 196, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !229)
!229 = !{!230, !231, !232, !233, !272}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !4, line: 243, baseType: !227, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !228, file: !4, line: 244, baseType: !144, size: 64, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !228, file: !4, line: 245, baseType: !224, size: 3072, align: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !228, file: !4, line: 249, baseType: !234, size: 128, align: 64, offset: 3200)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !228, file: !4, line: 246, size: 128, align: 64, elements: !235)
!235 = !{!236, !271}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !234, file: !4, line: 247, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !239)
!239 = !{!240, !248, !249, !250, !251, !252, !261, !268, !269, !270}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !238, file: !4, line: 64, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !243)
!243 = !{!244, !245, !246, !247}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !242, file: !4, line: 57, baseType: !223, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !4, line: 58, baseType: !241, size: 64, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !242, file: !4, line: 59, baseType: !237, size: 64, align: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !242, file: !4, line: 60, baseType: !3, size: 32, align: 32, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !238, file: !4, line: 65, baseType: !227, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !4, line: 66, baseType: !237, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !238, file: !4, line: 66, baseType: !237, size: 64, align: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !238, file: !4, line: 66, baseType: !237, size: 64, align: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !238, file: !4, line: 67, baseType: !253, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !16, line: 48, size: 192, align: 64, elements: !256)
!256 = !{!257, !259, !260}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !255, file: !16, line: 49, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !255, file: !16, line: 50, baseType: !144, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !255, file: !16, line: 51, baseType: !15, size: 32, align: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !238, file: !4, line: 68, baseType: !262, size: 192, align: 64, offset: 384)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !27, line: 42, size: 192, align: 64, elements: !263)
!263 = !{!264, !266, !267}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !262, file: !27, line: 44, baseType: !265, size: 32, align: 32)
!265 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !262, file: !27, line: 46, baseType: !144, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !262, file: !27, line: 48, baseType: !144, size: 64, align: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !238, file: !4, line: 69, baseType: !26, size: 32, align: 32, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !238, file: !4, line: 70, baseType: !213, size: 8, align: 8, offset: 608)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !238, file: !4, line: 71, baseType: !213, size: 8, align: 8, offset: 616)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !234, file: !4, line: 248, baseType: !237, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !228, file: !4, line: 250, baseType: !141, size: 32, align: 32, offset: 3328)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !224, file: !4, line: 197, baseType: !223, size: 64, align: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !224, file: !4, line: 199, baseType: !35, size: 32, align: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !224, file: !4, line: 201, baseType: !43, size: 32, align: 32, offset: 160)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !224, file: !4, line: 202, baseType: !47, size: 32, align: 32, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !224, file: !4, line: 203, baseType: !57, size: 32, align: 32, offset: 224)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !224, file: !4, line: 204, baseType: !144, size: 64, align: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !224, file: !4, line: 205, baseType: !144, size: 64, align: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !224, file: !4, line: 206, baseType: !262, size: 192, align: 64, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !224, file: !4, line: 207, baseType: !282, size: 960, align: 64, offset: 576)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !304}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !282, file: !4, line: 108, baseType: !241, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !282, file: !4, line: 110, baseType: !213, size: 8, align: 8, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !282, file: !4, line: 111, baseType: !67, size: 32, align: 32, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !282, file: !4, line: 112, baseType: !253, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !282, file: !4, line: 115, baseType: !144, size: 64, align: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !282, file: !4, line: 116, baseType: !144, size: 64, align: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !282, file: !4, line: 117, baseType: !144, size: 64, align: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !282, file: !4, line: 118, baseType: !144, size: 64, align: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !282, file: !4, line: 119, baseType: !144, size: 64, align: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !282, file: !4, line: 120, baseType: !144, size: 64, align: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !282, file: !4, line: 121, baseType: !144, size: 64, align: 64, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !282, file: !4, line: 122, baseType: !262, size: 192, align: 64, offset: 640)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !282, file: !4, line: 123, baseType: !297, size: 64, align: 64, offset: 832)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !299)
!299 = !{!300, !301, !302, !303}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !4, line: 81, baseType: !297, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !4, line: 82, baseType: !144, size: 64, align: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !298, file: !4, line: 83, baseType: !144, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !298, file: !4, line: 84, baseType: !213, size: 8, align: 8, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !282, file: !4, line: 124, baseType: !305, size: 64, align: 64, offset: 896)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !307)
!307 = !{!308, !309, !310}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !306, file: !4, line: 75, baseType: !305, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !4, line: 76, baseType: !144, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !306, file: !4, line: 77, baseType: !144, size: 64, align: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !224, file: !4, line: 208, baseType: !282, size: 960, align: 64, offset: 1536)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !224, file: !4, line: 209, baseType: !313, size: 64, align: 64, offset: 2496)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !4, line: 151, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !224, file: !4, line: 211, baseType: !316, size: 64, align: 64, offset: 2560)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !318)
!318 = !{!319, !320, !321, !322, !323}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !4, line: 88, baseType: !316, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !317, file: !4, line: 89, baseType: !144, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !317, file: !4, line: 90, baseType: !144, size: 64, align: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !317, file: !4, line: 91, baseType: !144, size: 64, align: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !317, file: !4, line: 92, baseType: !144, size: 64, align: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !224, file: !4, line: 216, baseType: !325, size: 128, align: 64, offset: 2624)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !224, file: !4, line: 213, size: 128, align: 64, elements: !326)
!326 = !{!327, !339}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !325, file: !4, line: 215, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !330)
!330 = !{!331, !332, !333, !334}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !329, file: !4, line: 143, baseType: !223, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !329, file: !4, line: 143, baseType: !223, size: 64, align: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !329, file: !4, line: 144, baseType: !328, size: 64, align: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !329, file: !4, line: 147, baseType: !335, size: 128, align: 64, offset: 192)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !329, file: !4, line: 145, size: 128, align: 64, elements: !336)
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !335, file: !4, line: 146, baseType: !328, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !335, file: !4, line: 146, baseType: !328, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !325, file: !4, line: 215, baseType: !328, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !224, file: !4, line: 219, baseType: !328, size: 64, align: 64, offset: 2752)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !224, file: !4, line: 220, baseType: !342, size: 64, align: 64, offset: 2816)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !343, file: !4, line: 135, baseType: !342, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !343, file: !4, line: 136, baseType: !144, size: 64, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !224, file: !4, line: 231, baseType: !348, size: 64, align: 64, offset: 2880)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !4, line: 231, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !224, file: !4, line: 232, baseType: !209, size: 64, align: 64, offset: 2944)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !224, file: !4, line: 233, baseType: !213, size: 8, align: 8, offset: 3008)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !224, file: !4, line: 236, baseType: !213, size: 8, align: 8, offset: 3016)
!353 = !DILocation(line: 131, column: 18, scope: !206)
!354 = !DILocalVariable(name: "err", scope: !206, file: !138, line: 132, type: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_error", file: !74, line: 42, size: 128, align: 64, elements: !356)
!356 = !{!357, !358, !359}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !355, file: !74, line: 43, baseType: !73, size: 32, align: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "syserrno", scope: !355, file: !74, line: 45, baseType: !141, size: 32, align: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !355, file: !74, line: 46, baseType: !360, size: 64, align: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!361 = !DILocation(line: 132, column: 20, scope: !206)
!362 = !DILocalVariable(name: "fd_src", scope: !206, file: !138, line: 133, type: !141)
!363 = !DILocation(line: 133, column: 6, scope: !206)
!364 = !DILocalVariable(name: "st", scope: !206, file: !138, line: 134, type: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !366, line: 46, size: 1152, align: 64, elements: !367)
!366 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!367 = !{!368, !370, !372, !374, !376, !378, !380, !381, !382, !383, !385, !387, !395, !396, !397}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !365, file: !366, line: 48, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !212, line: 124, baseType: !185)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !365, file: !366, line: 53, baseType: !371, size: 64, align: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !212, line: 127, baseType: !185)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !365, file: !366, line: 61, baseType: !373, size: 64, align: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !212, line: 130, baseType: !185)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !365, file: !366, line: 62, baseType: !375, size: 32, align: 32, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !212, line: 129, baseType: !265)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !365, file: !366, line: 64, baseType: !377, size: 32, align: 32, offset: 224)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !212, line: 125, baseType: !265)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !365, file: !366, line: 65, baseType: !379, size: 32, align: 32, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !212, line: 126, baseType: !265)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !365, file: !366, line: 67, baseType: !141, size: 32, align: 32, offset: 288)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !365, file: !366, line: 69, baseType: !369, size: 64, align: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !365, file: !366, line: 74, baseType: !211, size: 64, align: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !365, file: !366, line: 78, baseType: !384, size: 64, align: 64, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !212, line: 153, baseType: !132)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !365, file: !366, line: 80, baseType: !386, size: 64, align: 64, offset: 512)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !212, line: 158, baseType: !132)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !365, file: !366, line: 91, baseType: !388, size: 128, align: 64, offset: 576)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !389, line: 120, size: 128, align: 64, elements: !390)
!389 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!390 = !{!391, !393}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !388, file: !389, line: 122, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !212, line: 139, baseType: !132)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !388, file: !389, line: 123, baseType: !394, size: 64, align: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !212, line: 175, baseType: !132)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !365, file: !366, line: 92, baseType: !388, size: 128, align: 64, offset: 704)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !365, file: !366, line: 93, baseType: !388, size: 128, align: 64, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !365, file: !366, line: 106, baseType: !398, size: 192, align: 64, offset: 960)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 192, align: 64, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 3)
!401 = !DILocation(line: 134, column: 14, scope: !206)
!402 = !DILocalVariable(name: "timestamp", scope: !206, file: !138, line: 135, type: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !389, line: 75, baseType: !392)
!404 = !DILocation(line: 135, column: 9, scope: !206)
!405 = !DILocalVariable(name: "timestamp_str", scope: !206, file: !138, line: 136, type: !144)
!406 = !DILocation(line: 136, column: 14, scope: !206)
!407 = !DILocalVariable(name: "version", scope: !206, file: !138, line: 137, type: !144)
!408 = !DILocation(line: 137, column: 14, scope: !206)
!409 = !DILocalVariable(name: "hash", scope: !206, file: !138, line: 138, type: !410)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 264, align: 8, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 33)
!413 = !DILocation(line: 138, column: 7, scope: !206)
!414 = !DILocalVariable(name: "nparts", scope: !206, file: !138, line: 139, type: !141)
!415 = !DILocation(line: 139, column: 6, scope: !206)
!416 = !DILocalVariable(name: "curpart", scope: !206, file: !138, line: 139, type: !141)
!417 = !DILocation(line: 139, column: 14, scope: !206)
!418 = !DILocalVariable(name: "partsize", scope: !206, file: !138, line: 140, type: !209)
!419 = !DILocation(line: 140, column: 8, scope: !206)
!420 = !DILocalVariable(name: "cur_partsize", scope: !206, file: !138, line: 141, type: !209)
!421 = !DILocation(line: 141, column: 8, scope: !206)
!422 = !DILocalVariable(name: "last_partsize", scope: !206, file: !138, line: 141, type: !209)
!423 = !DILocation(line: 141, column: 22, scope: !206)
!424 = !DILocalVariable(name: "prefixdir", scope: !206, file: !138, line: 142, type: !360)
!425 = !DILocation(line: 142, column: 8, scope: !206)
!426 = !DILocalVariable(name: "msdos_prefix", scope: !206, file: !138, line: 142, type: !360)
!427 = !DILocation(line: 142, column: 26, scope: !206)
!428 = !DILocalVariable(name: "file_dst", scope: !206, file: !138, line: 143, type: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !430, line: 55, size: 192, align: 64, elements: !431)
!430 = !DIFile(filename: "../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!431 = !{!432, !433, !434}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !429, file: !430, line: 56, baseType: !183, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !429, file: !430, line: 56, baseType: !183, size: 64, align: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !429, file: !430, line: 57, baseType: !360, size: 64, align: 64, offset: 128)
!435 = !DILocation(line: 143, column: 16, scope: !206)
!436 = !DILocalVariable(name: "partmagic", scope: !206, file: !138, line: 144, type: !429)
!437 = !DILocation(line: 144, column: 16, scope: !206)
!438 = !DILocalVariable(name: "partname", scope: !206, file: !138, line: 145, type: !429)
!439 = !DILocation(line: 145, column: 16, scope: !206)
!440 = !DILocation(line: 147, column: 16, scope: !206)
!441 = !DILocation(line: 147, column: 11, scope: !206)
!442 = !DILocation(line: 147, column: 9, scope: !206)
!443 = !DILocation(line: 148, column: 6, scope: !444)
!444 = distinct !DILexicalBlock(scope: !206, file: !138, line: 148, column: 6)
!445 = !DILocation(line: 148, column: 13, scope: !444)
!446 = !DILocation(line: 148, column: 6, scope: !206)
!447 = !DILocation(line: 149, column: 11, scope: !444)
!448 = !DILocation(line: 149, column: 59, scope: !444)
!449 = !DILocation(line: 149, column: 3, scope: !450)
!450 = !DILexicalBlockFile(scope: !444, file: !138, discriminator: 1)
!451 = !DILocation(line: 149, column: 3, scope: !444)
!452 = !DILocation(line: 150, column: 12, scope: !453)
!453 = distinct !DILexicalBlock(scope: !206, file: !138, line: 150, column: 6)
!454 = !DILocation(line: 150, column: 6, scope: !453)
!455 = !DILocation(line: 150, column: 6, scope: !206)
!456 = !DILocation(line: 151, column: 11, scope: !453)
!457 = !DILocation(line: 151, column: 3, scope: !458)
!458 = !DILexicalBlockFile(scope: !453, file: !138, discriminator: 1)
!459 = !DILocation(line: 151, column: 3, scope: !453)
!460 = !DILocation(line: 152, column: 9, scope: !461)
!461 = distinct !DILexicalBlock(scope: !206, file: !138, line: 152, column: 6)
!462 = !DILocation(line: 152, column: 20, scope: !461)
!463 = !DILocation(line: 152, column: 6, scope: !206)
!464 = !DILocation(line: 153, column: 10, scope: !461)
!465 = !DILocation(line: 153, column: 60, scope: !461)
!466 = !DILocation(line: 153, column: 3, scope: !467)
!467 = !DILexicalBlockFile(scope: !461, file: !138, discriminator: 1)
!468 = !DILocation(line: 153, column: 3, scope: !461)
!469 = !DILocation(line: 155, column: 25, scope: !470)
!470 = distinct !DILexicalBlock(scope: !206, file: !138, line: 155, column: 6)
!471 = !DILocation(line: 155, column: 36, scope: !470)
!472 = !DILocation(line: 155, column: 6, scope: !470)
!473 = !DILocation(line: 155, column: 20, scope: !470)
!474 = !DILocation(line: 155, column: 6, scope: !206)
!475 = !DILocation(line: 156, column: 10, scope: !470)
!476 = !DILocation(line: 157, column: 10, scope: !470)
!477 = !DILocation(line: 157, column: 24, scope: !470)
!478 = !DILocation(line: 156, column: 3, scope: !479)
!479 = !DILexicalBlockFile(scope: !470, file: !138, discriminator: 1)
!480 = !DILocation(line: 156, column: 3, scope: !470)
!481 = !DILocation(line: 158, column: 8, scope: !206)
!482 = !DILocation(line: 158, column: 2, scope: !206)
!483 = !DILocation(line: 160, column: 26, scope: !206)
!484 = !DILocation(line: 160, column: 8, scope: !206)
!485 = !DILocation(line: 160, column: 6, scope: !206)
!486 = !DILocation(line: 161, column: 29, scope: !206)
!487 = !DILocation(line: 161, column: 34, scope: !206)
!488 = !DILocation(line: 161, column: 44, scope: !206)
!489 = !DILocation(line: 161, column: 12, scope: !206)
!490 = !DILocation(line: 161, column: 10, scope: !206)
!491 = !DILocation(line: 163, column: 18, scope: !206)
!492 = !DILocation(line: 163, column: 16, scope: !206)
!493 = !DILocation(line: 164, column: 6, scope: !494)
!494 = distinct !DILexicalBlock(scope: !206, file: !138, line: 164, column: 6)
!495 = !DILocation(line: 164, column: 6, scope: !206)
!496 = !DILocation(line: 165, column: 31, scope: !494)
!497 = !DILocation(line: 165, column: 15, scope: !494)
!498 = !DILocation(line: 165, column: 13, scope: !494)
!499 = !DILocation(line: 165, column: 3, scope: !494)
!500 = !DILocation(line: 167, column: 15, scope: !494)
!501 = !DILocation(line: 167, column: 13, scope: !494)
!502 = !DILocation(line: 169, column: 13, scope: !206)
!503 = !DILocation(line: 169, column: 25, scope: !206)
!504 = !DILocation(line: 169, column: 11, scope: !206)
!505 = !DILocation(line: 170, column: 21, scope: !206)
!506 = !DILocation(line: 170, column: 31, scope: !206)
!507 = !DILocation(line: 170, column: 29, scope: !206)
!508 = !DILocation(line: 170, column: 16, scope: !206)
!509 = !DILocation(line: 171, column: 6, scope: !510)
!510 = distinct !DILexicalBlock(scope: !206, file: !138, line: 171, column: 6)
!511 = !DILocation(line: 171, column: 20, scope: !510)
!512 = !DILocation(line: 171, column: 6, scope: !206)
!513 = !DILocation(line: 172, column: 19, scope: !510)
!514 = !DILocation(line: 172, column: 17, scope: !510)
!515 = !DILocation(line: 172, column: 3, scope: !510)
!516 = !DILocation(line: 173, column: 15, scope: !206)
!517 = !DILocation(line: 173, column: 25, scope: !206)
!518 = !DILocation(line: 173, column: 23, scope: !206)
!519 = !DILocation(line: 173, column: 34, scope: !206)
!520 = !DILocation(line: 173, column: 41, scope: !206)
!521 = !DILocation(line: 173, column: 39, scope: !206)
!522 = !DILocation(line: 173, column: 11, scope: !206)
!523 = !DILocation(line: 173, column: 9, scope: !206)
!524 = !DILocation(line: 175, column: 97, scope: !206)
!525 = !DILocation(line: 175, column: 9, scope: !206)
!526 = !DILocation(line: 177, column: 9, scope: !206)
!527 = !DILocation(line: 177, column: 14, scope: !206)
!528 = !DILocation(line: 177, column: 19, scope: !206)
!529 = !DILocation(line: 177, column: 25, scope: !206)
!530 = !DILocation(line: 175, column: 2, scope: !531)
!531 = !DILexicalBlockFile(scope: !206, file: !138, discriminator: 1)
!532 = !DILocation(line: 179, column: 6, scope: !533)
!533 = distinct !DILexicalBlock(scope: !206, file: !138, line: 179, column: 6)
!534 = !DILocation(line: 179, column: 6, scope: !206)
!535 = !DILocalVariable(name: "t", scope: !536, file: !138, line: 180, type: !360)
!536 = distinct !DILexicalBlock(scope: !533, file: !138, line: 179, column: 13)
!537 = !DILocation(line: 180, column: 9, scope: !536)
!538 = !DILocation(line: 182, column: 16, scope: !536)
!539 = !DILocation(line: 182, column: 7, scope: !536)
!540 = !DILocation(line: 182, column: 5, scope: !536)
!541 = !DILocation(line: 183, column: 32, scope: !536)
!542 = !DILocation(line: 183, column: 24, scope: !536)
!543 = !DILocation(line: 183, column: 15, scope: !544)
!544 = !DILexicalBlockFile(scope: !536, file: !138, discriminator: 1)
!545 = !DILocation(line: 183, column: 13, scope: !536)
!546 = !DILocation(line: 184, column: 8, scope: !536)
!547 = !DILocation(line: 184, column: 3, scope: !536)
!548 = !DILocation(line: 186, column: 41, scope: !536)
!549 = !DILocation(line: 186, column: 27, scope: !536)
!550 = !DILocation(line: 186, column: 18, scope: !544)
!551 = !DILocation(line: 186, column: 16, scope: !536)
!552 = !DILocation(line: 187, column: 33, scope: !536)
!553 = !DILocation(line: 187, column: 12, scope: !536)
!554 = !DILocation(line: 187, column: 10, scope: !536)
!555 = !DILocation(line: 188, column: 2, scope: !536)
!556 = !DILocation(line: 190, column: 15, scope: !557)
!557 = distinct !DILexicalBlock(scope: !206, file: !138, line: 190, column: 2)
!558 = !DILocation(line: 190, column: 7, scope: !557)
!559 = !DILocation(line: 190, column: 20, scope: !560)
!560 = !DILexicalBlockFile(scope: !561, file: !138, discriminator: 1)
!561 = distinct !DILexicalBlock(scope: !557, file: !138, line: 190, column: 2)
!562 = !DILocation(line: 190, column: 31, scope: !560)
!563 = !DILocation(line: 190, column: 28, scope: !560)
!564 = !DILocation(line: 190, column: 2, scope: !560)
!565 = !DILocalVariable(name: "ar", scope: !566, file: !138, line: 191, type: !567)
!566 = distinct !DILexicalBlock(scope: !561, file: !138, line: 190, column: 50)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64, align: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_ar", file: !569, line: 57, size: 320, align: 64, elements: !570)
!569 = !DIFile(filename: "../lib/dpkg/ar.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!570 = !{!571, !572, !574, !575, !576}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !568, file: !569, line: 58, baseType: !144, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !568, file: !569, line: 59, baseType: !573, size: 32, align: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !210, line: 70, baseType: !375)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !568, file: !569, line: 60, baseType: !403, size: 64, align: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !568, file: !569, line: 61, baseType: !209, size: 64, align: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !568, file: !569, line: 62, baseType: !141, size: 32, align: 32, offset: 256)
!577 = !DILocation(line: 191, column: 19, scope: !566)
!578 = !DILocation(line: 193, column: 3, scope: !566)
!579 = !DILocation(line: 195, column: 7, scope: !580)
!580 = distinct !DILexicalBlock(scope: !566, file: !138, line: 195, column: 7)
!581 = !DILocation(line: 195, column: 7, scope: !566)
!582 = !DILocalVariable(name: "refname", scope: !583, file: !138, line: 196, type: !360)
!583 = distinct !DILexicalBlock(scope: !580, file: !138, line: 195, column: 14)
!584 = !DILocation(line: 196, column: 10, scope: !583)
!585 = !DILocalVariable(name: "prefix_max", scope: !583, file: !138, line: 197, type: !141)
!586 = !DILocation(line: 197, column: 8, scope: !583)
!587 = !DILocation(line: 199, column: 32, scope: !583)
!588 = !DILocation(line: 199, column: 41, scope: !583)
!589 = !DILocation(line: 199, column: 14, scope: !583)
!590 = !DILocation(line: 199, column: 12, scope: !583)
!591 = !DILocation(line: 200, column: 30, scope: !583)
!592 = !DILocation(line: 200, column: 23, scope: !583)
!593 = !DILocation(line: 200, column: 21, scope: !583)
!594 = !DILocation(line: 200, column: 40, scope: !583)
!595 = !DILocation(line: 200, column: 18, scope: !583)
!596 = !DILocation(line: 200, column: 60, scope: !597)
!597 = !DILexicalBlockFile(scope: !583, file: !138, discriminator: 1)
!598 = !DILocation(line: 200, column: 53, scope: !597)
!599 = !DILocation(line: 200, column: 51, scope: !597)
!600 = !DILocation(line: 200, column: 18, scope: !597)
!601 = !DILocation(line: 200, column: 18, scope: !602)
!602 = !DILexicalBlockFile(scope: !583, file: !138, discriminator: 2)
!603 = !DILocation(line: 200, column: 18, scope: !604)
!604 = !DILexicalBlockFile(scope: !583, file: !138, discriminator: 3)
!605 = !DILocation(line: 200, column: 17, scope: !604)
!606 = !DILocation(line: 200, column: 15, scope: !604)
!607 = !DILocation(line: 202, column: 18, scope: !583)
!608 = !DILocation(line: 202, column: 29, scope: !583)
!609 = !DILocation(line: 202, column: 41, scope: !583)
!610 = !DILocation(line: 202, column: 49, scope: !583)
!611 = !DILocation(line: 201, column: 4, scope: !583)
!612 = !DILocation(line: 203, column: 9, scope: !583)
!613 = !DILocation(line: 203, column: 4, scope: !583)
!614 = !DILocation(line: 204, column: 3, scope: !583)
!615 = !DILocation(line: 206, column: 18, scope: !616)
!616 = distinct !DILexicalBlock(scope: !580, file: !138, line: 204, column: 10)
!617 = !DILocation(line: 206, column: 26, scope: !616)
!618 = !DILocation(line: 206, column: 35, scope: !616)
!619 = !DILocation(line: 205, column: 4, scope: !616)
!620 = !DILocation(line: 209, column: 7, scope: !621)
!621 = distinct !DILexicalBlock(scope: !566, file: !138, line: 209, column: 7)
!622 = !DILocation(line: 209, column: 18, scope: !621)
!623 = !DILocation(line: 209, column: 15, scope: !621)
!624 = !DILocation(line: 209, column: 7, scope: !566)
!625 = !DILocation(line: 210, column: 19, scope: !621)
!626 = !DILocation(line: 210, column: 17, scope: !621)
!627 = !DILocation(line: 210, column: 4, scope: !621)
!628 = !DILocation(line: 212, column: 19, scope: !621)
!629 = !DILocation(line: 212, column: 17, scope: !621)
!630 = !DILocation(line: 214, column: 7, scope: !631)
!631 = distinct !DILexicalBlock(scope: !566, file: !138, line: 214, column: 7)
!632 = !DILocation(line: 214, column: 22, scope: !631)
!633 = !DILocation(line: 214, column: 20, scope: !631)
!634 = !DILocation(line: 214, column: 7, scope: !566)
!635 = !DILocation(line: 215, column: 11, scope: !636)
!636 = distinct !DILexicalBlock(scope: !631, file: !138, line: 214, column: 35)
!637 = !DILocation(line: 215, column: 4, scope: !638)
!638 = !DILexicalBlockFile(scope: !636, file: !138, discriminator: 1)
!639 = !DILocation(line: 215, column: 4, scope: !636)
!640 = !DILocation(line: 222, column: 32, scope: !566)
!641 = !DILocation(line: 222, column: 8, scope: !566)
!642 = !DILocation(line: 222, column: 6, scope: !566)
!643 = !DILocation(line: 223, column: 21, scope: !566)
!644 = !DILocation(line: 223, column: 25, scope: !566)
!645 = !DILocation(line: 223, column: 3, scope: !566)
!646 = !DILocation(line: 226, column: 21, scope: !566)
!647 = !DILocation(line: 226, column: 3, scope: !566)
!648 = !DILocation(line: 231, column: 24, scope: !566)
!649 = !DILocation(line: 231, column: 29, scope: !566)
!650 = !DILocation(line: 231, column: 34, scope: !566)
!651 = !DILocation(line: 231, column: 40, scope: !566)
!652 = !DILocation(line: 231, column: 49, scope: !566)
!653 = !DILocation(line: 232, column: 30, scope: !566)
!654 = !DILocation(line: 232, column: 49, scope: !566)
!655 = !DILocation(line: 233, column: 17, scope: !566)
!656 = !DILocation(line: 233, column: 26, scope: !566)
!657 = !DILocation(line: 233, column: 34, scope: !566)
!658 = !DILocation(line: 233, column: 39, scope: !566)
!659 = !DILocation(line: 233, column: 49, scope: !566)
!660 = !DILocation(line: 233, column: 55, scope: !566)
!661 = !DILocation(line: 229, column: 3, scope: !566)
!662 = !DILocation(line: 234, column: 26, scope: !566)
!663 = !DILocation(line: 235, column: 36, scope: !566)
!664 = !DILocation(line: 235, column: 51, scope: !566)
!665 = !DILocation(line: 234, column: 3, scope: !566)
!666 = !DILocation(line: 236, column: 3, scope: !566)
!667 = !DILocation(line: 239, column: 39, scope: !566)
!668 = !DILocation(line: 239, column: 3, scope: !566)
!669 = !DILocation(line: 240, column: 27, scope: !566)
!670 = !DILocation(line: 240, column: 40, scope: !566)
!671 = !DILocation(line: 241, column: 27, scope: !566)
!672 = !DILocation(line: 241, column: 35, scope: !566)
!673 = !DILocation(line: 240, column: 3, scope: !566)
!674 = !DILocation(line: 242, column: 3, scope: !566)
!675 = !DILocation(line: 244, column: 17, scope: !566)
!676 = !DILocation(line: 244, column: 3, scope: !566)
!677 = !DILocation(line: 246, column: 17, scope: !566)
!678 = !DILocation(line: 246, column: 3, scope: !566)
!679 = !DILocation(line: 247, column: 2, scope: !566)
!680 = !DILocation(line: 190, column: 46, scope: !681)
!681 = !DILexicalBlockFile(scope: !561, file: !138, discriminator: 2)
!682 = !DILocation(line: 190, column: 2, scope: !681)
!683 = distinct !{!683, !684}
!684 = !DILocation(line: 190, column: 2, scope: !206)
!685 = !DILocation(line: 249, column: 2, scope: !206)
!686 = !DILocation(line: 250, column: 2, scope: !206)
!687 = !DILocation(line: 251, column: 2, scope: !206)
!688 = !DILocation(line: 253, column: 7, scope: !206)
!689 = !DILocation(line: 253, column: 2, scope: !206)
!690 = !DILocation(line: 254, column: 7, scope: !206)
!691 = !DILocation(line: 254, column: 2, scope: !206)
!692 = !DILocation(line: 256, column: 8, scope: !206)
!693 = !DILocation(line: 256, column: 2, scope: !206)
!694 = !DILocation(line: 258, column: 9, scope: !206)
!695 = !DILocation(line: 258, column: 2, scope: !531)
!696 = !DILocation(line: 260, column: 2, scope: !206)
!697 = distinct !DISubprogram(name: "deb_parse_control", scope: !138, file: !138, line: 58, type: !698, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !147)
!698 = !DISubroutineType(types: !699)
!699 = !{!223, !144}
!700 = !DILocalVariable(name: "filename", arg: 1, scope: !697, file: !138, line: 58, type: !144)
!701 = !DILocation(line: 58, column: 31, scope: !697)
!702 = !DILocalVariable(name: "ps", scope: !697, file: !138, line: 60, type: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parsedb_state", file: !85, line: 48, size: 640, align: 64, elements: !705)
!705 = !{!706, !707, !708, !709, !710, !712, !713, !714, !715, !716, !717}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !704, file: !85, line: 49, baseType: !84, size: 32, align: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !704, file: !85, line: 50, baseType: !91, size: 32, align: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !704, file: !85, line: 51, baseType: !355, size: 128, align: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !704, file: !85, line: 52, baseType: !223, size: 64, align: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pkgbin", scope: !704, file: !85, line: 53, baseType: !711, size: 64, align: 64, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !704, file: !85, line: 54, baseType: !360, size: 64, align: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "dataptr", scope: !704, file: !85, line: 55, baseType: !360, size: 64, align: 64, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "endptr", scope: !704, file: !85, line: 56, baseType: !360, size: 64, align: 64, offset: 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !704, file: !85, line: 57, baseType: !144, size: 64, align: 64, offset: 512)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !704, file: !85, line: 58, baseType: !141, size: 32, align: 32, offset: 576)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "lno", scope: !704, file: !85, line: 59, baseType: !141, size: 32, align: 32, offset: 608)
!718 = !DILocation(line: 60, column: 24, scope: !697)
!719 = !DILocalVariable(name: "pkg", scope: !697, file: !138, line: 61, type: !223)
!720 = !DILocation(line: 61, column: 18, scope: !697)
!721 = !DILocalVariable(name: "pid", scope: !697, file: !138, line: 62, type: !722)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !210, line: 98, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !212, line: 133, baseType: !141)
!724 = !DILocation(line: 62, column: 8, scope: !697)
!725 = !DILocalVariable(name: "p", scope: !697, file: !138, line: 63, type: !726)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 64, align: 32, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 2)
!729 = !DILocation(line: 63, column: 6, scope: !697)
!730 = !DILocation(line: 65, column: 9, scope: !697)
!731 = !DILocation(line: 65, column: 2, scope: !697)
!732 = !DILocation(line: 67, column: 8, scope: !697)
!733 = !DILocation(line: 67, column: 6, scope: !697)
!734 = !DILocation(line: 68, column: 6, scope: !735)
!735 = distinct !DILexicalBlock(scope: !697, file: !138, line: 68, column: 6)
!736 = !DILocation(line: 68, column: 10, scope: !735)
!737 = !DILocation(line: 68, column: 6, scope: !697)
!738 = !DILocation(line: 70, column: 10, scope: !739)
!739 = distinct !DILexicalBlock(scope: !735, file: !138, line: 68, column: 16)
!740 = !DILocation(line: 70, column: 3, scope: !739)
!741 = !DILocation(line: 71, column: 9, scope: !739)
!742 = !DILocation(line: 71, column: 3, scope: !739)
!743 = !DILocation(line: 72, column: 9, scope: !739)
!744 = !DILocation(line: 72, column: 3, scope: !739)
!745 = !DILocation(line: 74, column: 44, scope: !739)
!746 = !DILocation(line: 74, column: 3, scope: !739)
!747 = !DILocation(line: 75, column: 11, scope: !739)
!748 = !DILocation(line: 76, column: 11, scope: !739)
!749 = !DILocation(line: 75, column: 3, scope: !750)
!750 = !DILexicalBlockFile(scope: !739, file: !138, discriminator: 1)
!751 = !DILocation(line: 75, column: 3, scope: !739)
!752 = !DILocation(line: 78, column: 8, scope: !697)
!753 = !DILocation(line: 78, column: 2, scope: !697)
!754 = !DILocation(line: 81, column: 19, scope: !697)
!755 = !DILocation(line: 81, column: 54, scope: !697)
!756 = !DILocation(line: 81, column: 7, scope: !757)
!757 = !DILexicalBlockFile(scope: !697, file: !138, discriminator: 1)
!758 = !DILocation(line: 81, column: 5, scope: !697)
!759 = !DILocation(line: 82, column: 15, scope: !697)
!760 = !DILocation(line: 82, column: 2, scope: !697)
!761 = !DILocation(line: 83, column: 16, scope: !697)
!762 = !DILocation(line: 83, column: 2, scope: !697)
!763 = !DILocation(line: 84, column: 16, scope: !697)
!764 = !DILocation(line: 84, column: 2, scope: !697)
!765 = !DILocation(line: 86, column: 8, scope: !697)
!766 = !DILocation(line: 86, column: 2, scope: !697)
!767 = !DILocation(line: 88, column: 15, scope: !697)
!768 = !DILocation(line: 88, column: 20, scope: !697)
!769 = !DILocation(line: 88, column: 2, scope: !757)
!770 = !DILocation(line: 90, column: 9, scope: !697)
!771 = !DILocation(line: 90, column: 2, scope: !697)
!772 = distinct !DISubprogram(name: "parse_timestamp", scope: !138, file: !138, line: 94, type: !773, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !147)
!773 = !DISubroutineType(types: !774)
!774 = !{!403, !144}
!775 = !DILocalVariable(name: "value", arg: 1, scope: !772, file: !138, line: 94, type: !144)
!776 = !DILocation(line: 94, column: 29, scope: !772)
!777 = !DILocalVariable(name: "timestamp", scope: !772, file: !138, line: 96, type: !403)
!778 = !DILocation(line: 96, column: 9, scope: !772)
!779 = !DILocalVariable(name: "end", scope: !772, file: !138, line: 97, type: !360)
!780 = !DILocation(line: 97, column: 8, scope: !772)
