; ModuleID = './[inter]dpkg-split--info.o.i'
source_filename = "./[inter]dpkg-split--info.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.cmdinfo = type { i8*, i8, i32, i32*, i8**, void (%struct.cmdinfo*, i8*)*, i32, i8*, i32 (i8**)* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.dpkg_ar = type { i8*, i32, i64, i64, i32 }
%struct.partinfo = type { %struct.deb_version, i8*, i8*, i8*, i8*, i8*, i64, i32, i32, i64, i64, i64, i64, i64 }
%struct.deb_version = type { i32, i32 }
%struct.dpkg_ar_hdr = type { [16 x i8], [12 x i8], [6 x i8], [6 x i8], [8 x i8], [10 x i8], [2 x i8] }

@read_info.readinfobuf = internal global i8* null, align 8
@read_info.readinfobuflen = internal global i64 0, align 8
@.str = private unnamed_addr constant [21 x i8] c"error reading %.250s\00", align 1
@.str.1 = private unnamed_addr constant [9 x i8] c"!<arch>\0A\00", align 1
@.str.2 = private unnamed_addr constant [10 x i8] c"ar header\00", align 1
@.str.3 = private unnamed_addr constant [13 x i8] c"debian-split\00", align 1
@.str.4 = private unnamed_addr constant [60 x i8] c"file '%.250s' is corrupt - bad magic at end of first header\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !14, globals: !22)
!1 = !DIFile(filename: "[inter]dpkg-split--info.o.i", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_ctype_bit", file: !4, line: 32, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../lib/dpkg/c-ctype.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13}
!6 = !DIEnumerator(name: "C_CTYPE_BLANK", value: 1)
!7 = !DIEnumerator(name: "C_CTYPE_WHITE", value: 2)
!8 = !DIEnumerator(name: "C_CTYPE_SPACE", value: 4)
!9 = !DIEnumerator(name: "C_CTYPE_UPPER", value: 8)
!10 = !DIEnumerator(name: "C_CTYPE_LOWER", value: 16)
!11 = !DIEnumerator(name: "C_CTYPE_DIGIT", value: 32)
!12 = !DIEnumerator(name: "C_CTYPE_ALPHA", value: 24)
!13 = !DIEnumerator(name: "C_CTYPE_ALNUM", value: 56)
!14 = !{!15, !20}
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !16, line: 223, baseType: !17)
!16 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !18, line: 172, baseType: !19)
!18 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!19 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !21, line: 134, baseType: !19)
!21 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!22 = !{!23, !75}
!23 = distinct !DIGlobalVariable(name: "readinfobuf", scope: !24, file: !25, line: 89, type: !74, isLocal: true, isDefinition: true, variable: i8** @read_info.readinfobuf)
!24 = distinct !DISubprogram(name: "read_info", scope: !25, file: !25, line: 87, type: !26, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !73)
!25 = !DIFile(filename: "info.c", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !59, !28}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partinfo", file: !30, line: 35, size: 832, align: 64, elements: !31)
!30 = !DIFile(filename: "dpkg-split.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!31 = !{!32, !39, !43, !44, !45, !46, !47, !51, !53, !54, !55, !56, !57, !58}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "fmtversion", scope: !29, file: !30, line: 36, baseType: !33, size: 64, align: 32)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deb_version", file: !34, line: 37, size: 64, align: 32, elements: !35)
!34 = !DIFile(filename: "../lib/dpkg/deb-version.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!35 = !{!36, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !33, file: !34, line: 38, baseType: !37, size: 32, align: 32)
!37 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !33, file: !34, line: 39, baseType: !37, size: 32, align: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !29, file: !30, line: 37, baseType: !40, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !29, file: !30, line: 38, baseType: !40, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !29, file: !30, line: 39, baseType: !40, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !29, file: !30, line: 40, baseType: !40, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !29, file: !30, line: 41, baseType: !40, size: 64, align: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "orglength", scope: !29, file: !30, line: 42, baseType: !48, size: 64, align: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !49, line: 73, baseType: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !18, line: 131, baseType: !19)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "thispartn", scope: !29, file: !30, line: 43, baseType: !52, size: 32, align: 32, offset: 448)
!52 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "maxpartn", scope: !29, file: !30, line: 43, baseType: !52, size: 32, align: 32, offset: 480)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "maxpartlen", scope: !29, file: !30, line: 44, baseType: !48, size: 64, align: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "thispartoffset", scope: !29, file: !30, line: 45, baseType: !48, size: 64, align: 64, offset: 576)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "thispartlen", scope: !29, file: !30, line: 46, baseType: !48, size: 64, align: 64, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "headerlen", scope: !29, file: !30, line: 48, baseType: !48, size: 64, align: 64, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "filesize", scope: !29, file: !30, line: 49, baseType: !48, size: 64, align: 64, offset: 768)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_ar", file: !61, line: 57, size: 320, align: 64, elements: !62)
!61 = !DIFile(filename: "../lib/dpkg/ar.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!62 = !{!63, !64, !67, !71, !72}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !60, file: !61, line: 58, baseType: !40, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !60, file: !61, line: 59, baseType: !65, size: 32, align: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !49, line: 62, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !18, line: 129, baseType: !52)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !60, file: !61, line: 60, baseType: !68, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !69, line: 75, baseType: !70)
!69 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !18, line: 139, baseType: !19)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !60, file: !61, line: 61, baseType: !48, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !60, file: !61, line: 62, baseType: !37, size: 32, align: 32, offset: 256)
!73 = !{}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!75 = distinct !DIGlobalVariable(name: "readinfobuflen", scope: !24, file: !25, line: 90, type: !76, isLocal: true, isDefinition: true, variable: i64* @read_info.readinfobuflen)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !77, line: 216, baseType: !78)
!77 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!78 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!79 = !{i32 2, !"Dwarf Version", i32 4}
!80 = !{i32 2, !"Debug Info Version", i32 3}
!81 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!82 = !DILocalVariable(name: "ar", arg: 1, scope: !24, file: !25, line: 87, type: !59)
!83 = !DIExpression()
!84 = !DILocation(line: 87, column: 27, scope: !24)
!85 = !DILocalVariable(name: "ir", arg: 2, scope: !24, file: !25, line: 87, type: !28)
!86 = !DILocation(line: 87, column: 48, scope: !24)
!87 = !DILocalVariable(name: "thisilen", scope: !24, file: !25, line: 92, type: !76)
!88 = !DILocation(line: 92, column: 10, scope: !24)
!89 = !DILocalVariable(name: "templong", scope: !24, file: !25, line: 93, type: !20)
!90 = !DILocation(line: 93, column: 12, scope: !24)
!91 = !DILocalVariable(name: "magicbuf", scope: !24, file: !25, line: 94, type: !92)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 64, align: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 8)
!95 = !DILocation(line: 94, column: 8, scope: !24)
!96 = !DILocalVariable(name: "rip", scope: !24, file: !25, line: 94, type: !74)
!97 = !DILocation(line: 94, column: 44, scope: !24)
!98 = !DILocalVariable(name: "partnums", scope: !24, file: !25, line: 94, type: !74)
!99 = !DILocation(line: 94, column: 50, scope: !24)
!100 = !DILocalVariable(name: "slash", scope: !24, file: !25, line: 94, type: !74)
!101 = !DILocation(line: 94, column: 61, scope: !24)
!102 = !DILocalVariable(name: "err", scope: !24, file: !25, line: 95, type: !40)
!103 = !DILocation(line: 95, column: 15, scope: !24)
!104 = !DILocalVariable(name: "arh", scope: !24, file: !25, line: 96, type: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_ar_hdr", file: !61, line: 45, size: 480, align: 8, elements: !106)
!106 = !{!107, !111, !115, !119, !120, !121, !125}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ar_name", scope: !105, file: !61, line: 46, baseType: !108, size: 128, align: 8)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 128, align: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 16)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ar_date", scope: !105, file: !61, line: 47, baseType: !112, size: 96, align: 8, offset: 128)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 96, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 12)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ar_uid", scope: !105, file: !61, line: 48, baseType: !116, size: 48, align: 8, offset: 224)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 48, align: 8, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 6)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ar_gid", scope: !105, file: !61, line: 48, baseType: !116, size: 48, align: 8, offset: 272)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ar_mode", scope: !105, file: !61, line: 49, baseType: !92, size: 64, align: 8, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ar_size", scope: !105, file: !61, line: 50, baseType: !122, size: 80, align: 8, offset: 384)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 80, align: 8, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 10)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ar_fmag", scope: !105, file: !61, line: 51, baseType: !126, size: 16, align: 8, offset: 464)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 16, align: 8, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 2)
!129 = !DILocation(line: 96, column: 22, scope: !24)
!130 = !DILocalVariable(name: "rc", scope: !24, file: !25, line: 97, type: !15)
!131 = !DILocation(line: 97, column: 11, scope: !24)
!132 = !DILocation(line: 99, column: 16, scope: !24)
!133 = !DILocation(line: 99, column: 20, scope: !24)
!134 = !DILocation(line: 99, column: 24, scope: !24)
!135 = !DILocation(line: 99, column: 8, scope: !24)
!136 = !DILocation(line: 99, column: 6, scope: !24)
!137 = !DILocation(line: 100, column: 7, scope: !138)
!138 = distinct !DILexicalBlock(scope: !24, file: !25, line: 100, column: 7)
!139 = !DILocation(line: 100, column: 10, scope: !138)
!140 = !DILocation(line: 100, column: 7, scope: !24)
!141 = !DILocation(line: 101, column: 9, scope: !142)
!142 = distinct !DILexicalBlock(scope: !143, file: !25, line: 101, column: 9)
!143 = distinct !DILexicalBlock(scope: !138, file: !25, line: 100, column: 31)
!144 = !DILocation(line: 101, column: 12, scope: !142)
!145 = !DILocation(line: 101, column: 9, scope: !143)
!146 = !DILocation(line: 102, column: 15, scope: !142)
!147 = !DILocation(line: 102, column: 48, scope: !142)
!148 = !DILocation(line: 102, column: 52, scope: !142)
!149 = !DILocation(line: 102, column: 7, scope: !150)
!150 = !DILexicalBlockFile(scope: !142, file: !25, discriminator: 1)
!151 = !DILocation(line: 102, column: 7, scope: !142)
!152 = !DILocation(line: 104, column: 7, scope: !142)
!153 = !DILocation(line: 106, column: 14, scope: !154)
!154 = distinct !DILexicalBlock(scope: !24, file: !25, line: 106, column: 7)
!155 = !DILocation(line: 106, column: 7, scope: !154)
!156 = !DILocation(line: 106, column: 7, scope: !24)
!157 = !DILocation(line: 107, column: 5, scope: !154)
!158 = !DILocation(line: 109, column: 16, scope: !24)
!159 = !DILocation(line: 109, column: 20, scope: !24)
!160 = !DILocation(line: 109, column: 24, scope: !24)
!161 = !DILocation(line: 109, column: 8, scope: !24)
!162 = !DILocation(line: 109, column: 6, scope: !24)
!163 = !DILocation(line: 110, column: 7, scope: !164)
!164 = distinct !DILexicalBlock(scope: !24, file: !25, line: 110, column: 7)
!165 = !DILocation(line: 110, column: 10, scope: !164)
!166 = !DILocation(line: 110, column: 7, scope: !24)
!167 = !DILocation(line: 111, column: 15, scope: !164)
!168 = !DILocation(line: 111, column: 19, scope: !164)
!169 = !DILocation(line: 111, column: 23, scope: !164)
!170 = !DILocation(line: 111, column: 5, scope: !164)
!171 = !DILocation(line: 113, column: 3, scope: !24)
!172 = !DILocation(line: 115, column: 19, scope: !173)
!173 = distinct !DILexicalBlock(scope: !24, file: !25, line: 115, column: 7)
!174 = !DILocation(line: 115, column: 15, scope: !173)
!175 = !DILocation(line: 115, column: 7, scope: !173)
!176 = !DILocation(line: 115, column: 65, scope: !173)
!177 = !DILocation(line: 115, column: 7, scope: !24)
!178 = !DILocation(line: 116, column: 5, scope: !173)
!179 = !DILocation(line: 117, column: 7, scope: !180)
!180 = distinct !DILexicalBlock(scope: !24, file: !25, line: 117, column: 7)
!181 = !DILocation(line: 117, column: 7, scope: !24)
!182 = !DILocation(line: 118, column: 12, scope: !180)
!183 = !DILocation(line: 119, column: 12, scope: !180)
!184 = !DILocation(line: 119, column: 16, scope: !180)
!185 = !DILocation(line: 118, column: 5, scope: !186)
!186 = !DILexicalBlockFile(scope: !180, file: !25, discriminator: 1)
!187 = !DILocation(line: 118, column: 5, scope: !180)
!188 = !DILocation(line: 120, column: 38, scope: !24)
!189 = !DILocation(line: 120, column: 14, scope: !24)
!190 = !DILocation(line: 120, column: 12, scope: !24)
!191 = !DILocation(line: 121, column: 7, scope: !192)
!192 = distinct !DILexicalBlock(scope: !24, file: !25, line: 121, column: 7)
