; ModuleID = './[inter]dpkg-split--main.o.i'
source_filename = "./[inter]dpkg-split--main.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.cmdinfo = type { i8*, i8, i32, i32*, i8**, void (%struct.cmdinfo*, i8*)*, i32, i8*, i32 (i8**)* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@opt_maxpartsize = global i64 460800, align 8
@opt_outputfile = global i8* null, align 8
@opt_npquiet = global i32 0, align 4
@opt_msdos = global i32 0, align 4
@.str = private unnamed_addr constant [39 x i8] c"unexpected end of file in %s in %.255s\00", align 1
@.str.1 = private unnamed_addr constant [34 x i8] c"error reading %s from file %.255s\00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"dpkg\00", align 1
@.str.3 = private unnamed_addr constant [11 x i8] c"dpkg-split\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !5)
!1 = !DIFile(filename: "[inter]dpkg-split--main.o.i", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !13, !17, !19, !20, !21, !22, !51}
!6 = distinct !DIGlobalVariable(name: "opt_maxpartsize", scope: !0, file: !7, line: 105, type: !8, isLocal: false, isDefinition: true, variable: i64* @opt_maxpartsize)
!7 = !DIFile(filename: "main.c", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !9, line: 86, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !11, line: 131, baseType: !12)
!11 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!12 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!13 = distinct !DIGlobalVariable(name: "opt_outputfile", scope: !0, file: !7, line: 108, type: !14, isLocal: false, isDefinition: true, variable: i8** @opt_outputfile)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!16 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!17 = distinct !DIGlobalVariable(name: "opt_npquiet", scope: !0, file: !7, line: 109, type: !18, isLocal: false, isDefinition: true, variable: i32* @opt_npquiet)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = distinct !DIGlobalVariable(name: "opt_msdos", scope: !0, file: !7, line: 110, type: !18, isLocal: false, isDefinition: true, variable: i32* @opt_msdos)
!20 = distinct !DIGlobalVariable(name: "admindir", scope: !0, file: !7, line: 106, type: !14, isLocal: true, isDefinition: true, variable: i8** @admindir)
!21 = distinct !DIGlobalVariable(name: "opt_depotdir", scope: !0, file: !7, line: 107, type: !14, isLocal: false, isDefinition: true, variable: i8** @opt_depotdir)
!22 = distinct !DIGlobalVariable(name: "cmdinfos", scope: !0, file: !7, line: 140, type: !23, isLocal: true, isDefinition: true, variable: [14 x %struct.cmdinfo]* @cmdinfos)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 7168, align: 64, elements: !49)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmdinfo", file: !26, line: 38, size: 512, align: 64, elements: !27)
!26 = !DIFile(filename: "../lib/dpkg/options.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-split--dpkg-split")
!27 = !{!28, !29, !30, !31, !33, !35, !40, !41, !42}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "olong", scope: !25, file: !26, line: 39, baseType: !14, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "oshort", scope: !25, file: !26, line: 40, baseType: !16, size: 8, align: 8, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "takesvalue", scope: !25, file: !26, line: 48, baseType: !18, size: 32, align: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "iassignto", scope: !25, file: !26, line: 49, baseType: !32, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "sassignto", scope: !25, file: !26, line: 50, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !25, file: !26, line: 51, baseType: !36, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !39, !14}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "arg_int", scope: !25, file: !26, line: 53, baseType: !18, size: 32, align: 32, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "arg_ptr", scope: !25, file: !26, line: 54, baseType: !4, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !25, file: !26, line: 56, baseType: !43, size: 64, align: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "action_func", file: !26, line: 36, baseType: !45)
!45 = !DISubroutineType(types: !46)
!46 = !{!18, !47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!49 = !{!50}
!50 = !DISubrange(count: 14)
!51 = distinct !DIGlobalVariable(name: "printforhelp", scope: !0, file: !7, line: 103, type: !52, isLocal: true, isDefinition: true, variable: [33 x i8]* @printforhelp)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 264, align: 8, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 33)
!55 = !{i32 2, !"Dwarf Version", i32 4}
!56 = !{i32 2, !"Debug Info Version", i32 3}
!57 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!58 = distinct !DISubprogram(name: "read_fail", scope: !7, file: !7, line: 113, type: !59, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !18, !14, !14}
!61 = !DILocalVariable(name: "rc", arg: 1, scope: !58, file: !7, line: 113, type: !18)
!62 = !DIExpression()
!63 = !DILocation(line: 113, column: 15, scope: !58)
!64 = !DILocalVariable(name: "filename", arg: 2, scope: !58, file: !7, line: 113, type: !14)
!65 = !DILocation(line: 113, column: 31, scope: !58)
!66 = !DILocalVariable(name: "what", arg: 3, scope: !58, file: !7, line: 113, type: !14)
!67 = !DILocation(line: 113, column: 53, scope: !58)
!68 = !DILocation(line: 115, column: 7, scope: !69)
!69 = distinct !DILexicalBlock(scope: !58, file: !7, line: 115, column: 7)
!70 = !DILocation(line: 115, column: 10, scope: !69)
!71 = !DILocation(line: 115, column: 7, scope: !58)
!72 = !DILocation(line: 116, column: 12, scope: !69)
!73 = !DILocation(line: 116, column: 63, scope: !69)
!74 = !DILocation(line: 116, column: 69, scope: !69)
!75 = !DILocation(line: 116, column: 5, scope: !76)
!76 = !DILexicalBlockFile(scope: !69, file: !7, discriminator: 1)
!77 = !DILocation(line: 116, column: 5, scope: !69)
!78 = !DILocation(line: 118, column: 13, scope: !69)
!79 = !DILocation(line: 118, column: 59, scope: !69)
!80 = !DILocation(line: 118, column: 65, scope: !69)
!81 = !DILocation(line: 118, column: 5, scope: !76)
!82 = !DILocation(line: 118, column: 5, scope: !69)
!83 = !DILocation(line: 119, column: 1, scope: !58)
!84 = distinct !DISubprogram(name: "main", scope: !7, file: !7, line: 158, type: !85, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!85 = !DISubroutineType(types: !86)
!86 = !{!18, !18, !47}
!87 = !DILocalVariable(name: "argc", arg: 1, scope: !84, file: !7, line: 158, type: !18)
!88 = !DILocation(line: 158, column: 14, scope: !84)
!89 = !DILocalVariable(name: "argv", arg: 2, scope: !84, file: !7, line: 158, type: !47)
!90 = !DILocation(line: 158, column: 39, scope: !84)
!91 = !DILocalVariable(name: "ret", scope: !84, file: !7, line: 159, type: !18)
!92 = !DILocation(line: 159, column: 7, scope: !84)
!93 = !DILocation(line: 161, column: 3, scope: !84)
!94 = !DILocation(line: 162, column: 3, scope: !84)
!95 = !DILocation(line: 163, column: 3, scope: !84)
!96 = !DILocation(line: 165, column: 30, scope: !84)
!97 = !DILocation(line: 165, column: 14, scope: !84)
!98 = !DILocation(line: 165, column: 12, scope: !84)
!99 = !DILocation(line: 166, column: 7, scope: !100)
!100 = distinct !DILexicalBlock(scope: !84, file: !7, line: 166, column: 7)
!101 = !DILocation(line: 166, column: 20, scope: !100)
!102 = !DILocation(line: 166, column: 7, scope: !84)
!103 = !DILocation(line: 167, column: 20, scope: !100)
!104 = !DILocation(line: 167, column: 18, scope: !100)
