; ModuleID = './hgfsServerPolicyGuest.o.i'
source_filename = "./hgfsServerPolicyGuest.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.HgfsServerPolicyState = type { %struct.DblLnkLst_Links }
%struct.DblLnkLst_Links = type { %struct.DblLnkLst_Links*, %struct.DblLnkLst_Links* }
%struct.HgfsServerResEnumCallbacks = type { i8* ()*, i8 (i8*, i8**, i64*, i8*)*, i8 (i8*)* }
%struct.HgfsSharedFolder = type { %struct.DblLnkLst_Links, i8*, i8*, i8*, i64, i64, i64, i8, i8, i32, i32 }
%struct.State = type { %struct.DblLnkLst_Links* }

@myState = internal global %struct.HgfsServerPolicyState zeroinitializer, align 8
@.str = private unnamed_addr constant [7 x i8] c"%s:%s:\00", align 1
@.str.1 = private unnamed_addr constant [6 x i8] c"hgfsd\00", align 1
@__FUNCTION__.HgfsServerPolicy_Init = private unnamed_addr constant [22 x i8] c"HgfsServerPolicy_Init\00", align 1
@.str.2 = private unnamed_addr constant [49 x i8] c"HgfsServerPolicy_Init: memory allocation failed\0A\00", align 1
@.str.3 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"root\00", align 1
@__FUNCTION__.HgfsServerPolicy_GetSharePath = private unnamed_addr constant [30 x i8] c"HgfsServerPolicy_GetSharePath\00", align 1
@.str.5 = private unnamed_addr constant [55 x i8] c"HgfsServerPolicy_GetSharePath: No matching share name\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !26, globals: !77)
!1 = !DIFile(filename: "hgfsServerPolicyGuest.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line448")
!2 = !{!3, !19}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 65, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/cpName.h", directory: "/home/lichi/Desktop/open-vm-tools/line448")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!6 = !DIEnumerator(name: "HGFS_NAME_STATUS_COMPLETE", value: 0)
!7 = !DIEnumerator(name: "HGFS_NAME_STATUS_FAILURE", value: 1)
!8 = !DIEnumerator(name: "HGFS_NAME_STATUS_INCOMPLETE_BASE", value: 2)
!9 = !DIEnumerator(name: "HGFS_NAME_STATUS_INCOMPLETE_ROOT", value: 3)
!10 = !DIEnumerator(name: "HGFS_NAME_STATUS_INCOMPLETE_DRIVE", value: 4)
!11 = !DIEnumerator(name: "HGFS_NAME_STATUS_INCOMPLETE_UNC", value: 5)
!12 = !DIEnumerator(name: "HGFS_NAME_STATUS_INCOMPLETE_UNC_MACH", value: 6)
!13 = !DIEnumerator(name: "HGFS_NAME_STATUS_DOES_NOT_EXIST", value: 7)
!14 = !DIEnumerator(name: "HGFS_NAME_STATUS_ACCESS_DENIED", value: 8)
!15 = !DIEnumerator(name: "HGFS_NAME_STATUS_SYMBOLIC_LINK", value: 9)
!16 = !DIEnumerator(name: "HGFS_NAME_STATUS_OUT_OF_MEMORY", value: 10)
!17 = !DIEnumerator(name: "HGFS_NAME_STATUS_TOO_LONG", value: 11)
!18 = !DIEnumerator(name: "HGFS_NAME_STATUS_NOT_A_DIRECTORY", value: 12)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 119, size: 32, align: 32, elements: !21)
!20 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hgfs.h", directory: "/home/lichi/Desktop/open-vm-tools/line448")
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "HGFS_OPEN_MODE_READ_ONLY", value: 0)
!23 = !DIEnumerator(name: "HGFS_OPEN_MODE_WRITE_ONLY", value: 1)
!24 = !DIEnumerator(name: "HGFS_OPEN_MODE_READ_WRITE", value: 2)
!25 = !DIEnumerator(name: "HGFS_OPEN_MODE_ACCMODES", value: 3)
!26 = !{!27, !63, !65, !66, !67, !69, !70}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSharedFolder", file: !29, line: 68, baseType: !30)
!29 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hgfsServerPolicy.h", directory: "/home/lichi/Desktop/open-vm-tools/line448")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsSharedFolder", file: !29, line: 45, size: 640, align: 64, elements: !31)
!31 = !{!32, !40, !44, !45, !46, !50, !51, !52, !55, !56, !62}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !30, file: !29, line: 46, baseType: !33, size: 128, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "DblLnkLst_Links", file: !34, line: 94, baseType: !35)
!34 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dbllnklst.h", directory: "/home/lichi/Desktop/open-vm-tools/line448")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DblLnkLst_Links", file: !34, line: 91, size: 128, align: 64, elements: !36)
!36 = !{!37, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !35, file: !34, line: 92, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !35, file: !34, line: 93, baseType: !38, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !30, file: !29, line: 47, baseType: !41, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !30, file: !29, line: 48, baseType: !41, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "shareTags", scope: !30, file: !29, line: 52, baseType: !41, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "shareTagsLen", scope: !30, file: !29, line: 53, baseType: !47, size: 64, align: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 216, baseType: !49)
!48 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line448")
!49 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "nameLen", scope: !30, file: !29, line: 54, baseType: !47, size: 64, align: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "pathLen", scope: !30, file: !29, line: 55, baseType: !47, size: 64, align: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "readAccess", scope: !30, file: !29, line: 56, baseType: !53, size: 8, align: 8, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !54, line: 230, baseType: !43)
!54 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line448")
!55 = !DIDerivedType(tag: DW_TAG_member, name: "writeAccess", scope: !30, file: !29, line: 57, baseType: !53, size: 8, align: 8, offset: 520)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "configOptions", scope: !30, file: !29, line: 58, baseType: !57, size: 32, align: 32, offset: 544)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsShareOptions", file: !29, line: 39, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !54, line: 173, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !60, line: 51, baseType: !61)
!60 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line448")
!61 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !30, file: !29, line: 59, baseType: !63, size: 32, align: 32, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSharedFolderHandle", file: !64, line: 134, baseType: !58)
!64 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hgfsServer.h", directory: "/home/lichi/Desktop/open-vm-tools/line448")
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !60, line: 119, baseType: !68)
!68 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetSharesState", file: !72, line: 325, baseType: !73)
!72 = !DIFile(filename: "hgfsServerPolicyGuest.c", directory: "/home/lichi/Desktop/open-vm-tools/line448")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "State", file: !72, line: 323, size: 64, align: 64, elements: !74)
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !73, file: !72, line: 324, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!77 = !{!78}
!78 = distinct !DIGlobalVariable(name: "myState", scope: !0, file: !72, line: 71, type: !79, isLocal: true, isDefinition: true, variable: %struct.HgfsServerPolicyState* @myState)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerPolicyState", file: !72, line: 68, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerPolicyState", file: !72, line: 62, size: 128, align: 64, elements: !81)
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "shares", scope: !80, file: !72, line: 67, baseType: !33, size: 128, align: 64)
!83 = !{i32 2, !"Dwarf Version", i32 4}
!84 = !{i32 2, !"Debug Info Version", i32 3}
!85 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!86 = distinct !DISubprogram(name: "HgfsServerPolicy_Init", scope: !72, file: !72, line: 160, type: !87, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !114)
!87 = !DISubroutineType(types: !88)
!88 = !{!53, !89, !93}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsInvalidateObjectsFunc", file: !64, line: 173, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !76}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerResEnumCallbacks", file: !64, line: 153, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerResEnumCallbacks", file: !64, line: 149, size: 192, align: 64, elements: !96)
!96 = !{!97, !102, !109}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !95, file: !64, line: 150, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerResEnumInitFunc", file: !64, line: 142, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!69}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !95, file: !64, line: 151, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerResEnumGetFunc", file: !64, line: 143, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!53, !69, !65, !107, !108}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !95, file: !64, line: 152, baseType: !110, size: 64, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerResEnumExitFunc", file: !64, line: 147, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!53, !69}
!114 = !{}
!115 = !DILocalVariable(name: "invalidateObjects", arg: 1, scope: !86, file: !72, line: 160, type: !89)
!116 = !DIExpression()
!117 = !DILocation(line: 160, column: 49, scope: !86)
!118 = !DILocalVariable(name: "enumResources", arg: 2, scope: !86, file: !72, line: 161, type: !93)
!119 = !DILocation(line: 161, column: 51, scope: !86)
!120 = !DILocalVariable(name: "rootShare", scope: !86, file: !72, line: 163, type: !27)
!121 = !DILocation(line: 163, column: 22, scope: !86)
!122 = !DILocation(line: 171, column: 4, scope: !86)
!123 = !DILocation(line: 174, column: 36, scope: !86)
!124 = !DILocation(line: 174, column: 16, scope: !86)
!125 = !DILocation(line: 174, column: 14, scope: !86)
!126 = !DILocation(line: 175, column: 9, scope: !127)
!127 = distinct !DILexicalBlock(scope: !86, file: !72, line: 175, column: 8)
!128 = !DILocation(line: 175, column: 8, scope: !86)
!129 = !DILocation(line: 176, column: 7, scope: !130)
!130 = distinct !DILexicalBlock(scope: !127, file: !72, line: 175, column: 20)
!131 = distinct !{!131, !129}
!132 = !DILocation(line: 176, column: 33, scope: !133)
!133 = !DILexicalBlockFile(scope: !134, file: !72, discriminator: 1)
!134 = distinct !DILexicalBlock(scope: !135, file: !72, line: 176, column: 31)
!135 = distinct !DILexicalBlock(scope: !136, file: !72, line: 176, column: 16)
!136 = distinct !DILexicalBlock(scope: !130, file: !72, line: 176, column: 10)
!137 = !DILocation(line: 176, column: 73, scope: !138)
!138 = !DILexicalBlockFile(scope: !133, file: !72, discriminator: 2)
!139 = !DILocation(line: 176, column: 136, scope: !133)
!140 = !DILocation(line: 177, column: 7, scope: !130)
!141 = !DILocation(line: 180, column: 20, scope: !86)
!142 = !DILocation(line: 180, column: 31, scope: !86)
!143 = !DILocation(line: 180, column: 4, scope: !86)
!144 = !DILocation(line: 188, column: 4, scope: !86)
!145 = !DILocation(line: 188, column: 15, scope: !86)
!146 = !DILocation(line: 188, column: 20, scope: !86)
!147 = !DILocation(line: 189, column: 4, scope: !86)
!148 = !DILocation(line: 189, column: 15, scope: !86)
!149 = !DILocation(line: 189, column: 20, scope: !86)
!150 = !DILocation(line: 190, column: 4, scope: !86)
!151 = !DILocation(line: 190, column: 15, scope: !86)
!152 = !DILocation(line: 190, column: 26, scope: !86)
!153 = !DILocation(line: 191, column: 4, scope: !86)
!154 = !DILocation(line: 191, column: 15, scope: !86)
!155 = !DILocation(line: 191, column: 27, scope: !86)
!156 = !DILocation(line: 193, column: 32, scope: !86)
!157 = !DILocation(line: 193, column: 43, scope: !86)
!158 = !DILocation(line: 193, column: 25, scope: !86)
!159 = !DILocation(line: 193, column: 4, scope: !86)
!160 = !DILocation(line: 193, column: 15, scope: !86)
!161 = !DILocation(line: 193, column: 23, scope: !86)
!162 = !DILocation(line: 194, column: 32, scope: !86)
!163 = !DILocation(line: 194, column: 43, scope: !86)
!164 = !DILocation(line: 194, column: 25, scope: !86)
!165 = !DILocation(line: 194, column: 4, scope: !86)
!166 = !DILocation(line: 194, column: 15, scope: !86)
!167 = !DILocation(line: 194, column: 23, scope: !86)
!168 = !DILocation(line: 195, column: 4, scope: !86)
!169 = !DILocation(line: 195, column: 15, scope: !86)
!170 = !DILocation(line: 195, column: 22, scope: !86)
!171 = !DILocation(line: 198, column: 41, scope: !86)
!172 = !DILocation(line: 198, column: 52, scope: !86)
!173 = !DILocation(line: 198, column: 4, scope: !86)
!174 = !DILocation(line: 203, column: 4, scope: !86)
!175 = !DILocation(line: 203, column: 19, scope: !86)
!176 = !DILocation(line: 203, column: 24, scope: !86)
