; ModuleID = './backdoor.o.i'
source_filename = "./backdoor.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%union.Backdoor_proto = type { %struct.anon }
%struct.anon = type { %union.anon, i64, %union.anon.2, %union.anon.5, %union.anon.8, %union.anon.11 }
%union.anon = type { i64 }
%union.anon.2 = type { i64 }
%union.anon.5 = type { i64 }
%union.anon.8 = type { i64 }
%union.anon.11 = type { i64 }
%struct.anon.6 = type { i16, i16 }
%union.Backdoor_proto_hb = type { %struct.anon.33 }
%struct.anon.33 = type { %union.anon.34, %union.anon.37, i64, %union.anon.40, i64, i64, %union.anon.43 }
%union.anon.34 = type { i64 }
%union.anon.37 = type { i64 }
%union.anon.40 = type { i64 }
%union.anon.43 = type { i64 }
%struct.anon.41 = type { i16, i16 }

; Function Attrs: nounwind uwtable
define void @Backdoor(%union.Backdoor_proto*) #0 !dbg !6 {
  %2 = alloca %union.Backdoor_proto*, align 8
  store %union.Backdoor_proto* %0, %union.Backdoor_proto** %2, align 8
  call void @llvm.dbg.declare(metadata %union.Backdoor_proto** %2, metadata !200, metadata !201), !dbg !202
  %3 = load %union.Backdoor_proto*, %union.Backdoor_proto** %2, align 8, !dbg !203
  %4 = bitcast %union.Backdoor_proto* %3 to %struct.anon*, !dbg !204
  %5 = getelementptr inbounds %struct.anon, %struct.anon* %4, i32 0, i32 0, !dbg !205
  %6 = bitcast %union.anon* %5 to i32*, !dbg !206
  store i32 1447909480, i32* %6, align 8, !dbg !207

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "backdoor.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line33")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!6 = distinct !DISubprogram(name: "Backdoor", scope: !7, file: !7, line: 201, type: !8, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!7 = !DIFile(filename: "backdoor.c", directory: "/home/lichi/Desktop/open-vm-tools/line33")
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Backdoor_proto", file: !12, line: 102, baseType: !13)
!12 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/backdoor_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line33")
!13 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !12, line: 85, size: 384, align: 64, elements: !14)
!14 = !{!15, !107}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !13, file: !12, line: 93, baseType: !16, size: 384, align: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !13, file: !12, line: 86, size: 384, align: 64, elements: !17)
!17 = !{!18, !44, !47, !62, !77, !92}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !16, file: !12, line: 87, baseType: !19, size: 64, align: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !16, file: !12, line: 87, size: 64, align: 64, elements: !20)
!20 = !{!21, !31, !35, !40}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !19, file: !12, line: 87, baseType: !22, size: 32, align: 16)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !19, file: !12, line: 87, size: 32, align: 16, elements: !23)
!23 = !{!24, !30}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !22, file: !12, line: 87, baseType: !25, size: 16, align: 16)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !26, line: 175, baseType: !27)
!26 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line33")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !28, line: 49, baseType: !29)
!28 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line33")
!29 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !22, file: !12, line: 87, baseType: !25, size: 16, align: 16, offset: 16)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !19, file: !12, line: 87, baseType: !32, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !26, line: 173, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !28, line: 51, baseType: !34)
!34 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !19, file: !12, line: 87, baseType: !36, size: 64, align: 32)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !19, file: !12, line: 87, size: 64, align: 32, elements: !37)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !36, file: !12, line: 87, baseType: !32, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !36, file: !12, line: 87, baseType: !32, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !19, file: !12, line: 87, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !26, line: 171, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !28, line: 55, baseType: !43)
!43 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !16, file: !12, line: 88, baseType: !45, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !46, line: 216, baseType: !43)
!46 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line33")
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !16, file: !12, line: 89, baseType: !48, size: 64, align: 64, offset: 128)
!48 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !16, file: !12, line: 89, size: 64, align: 64, elements: !49)
!49 = !{!50, !55, !56, !61}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !48, file: !12, line: 89, baseType: !51, size: 32, align: 16)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !48, file: !12, line: 89, size: 32, align: 16, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !51, file: !12, line: 89, baseType: !25, size: 16, align: 16)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !51, file: !12, line: 89, baseType: !25, size: 16, align: 16, offset: 16)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !48, file: !12, line: 89, baseType: !32, size: 32, align: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !48, file: !12, line: 89, baseType: !57, size: 64, align: 32)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !48, file: !12, line: 89, size: 64, align: 32, elements: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !57, file: !12, line: 89, baseType: !32, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !57, file: !12, line: 89, baseType: !32, size: 32, align: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !48, file: !12, line: 89, baseType: !41, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !16, file: !12, line: 90, baseType: !63, size: 64, align: 64, offset: 192)
!63 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !16, file: !12, line: 90, size: 64, align: 64, elements: !64)
!64 = !{!65, !70, !71, !76}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !63, file: !12, line: 90, baseType: !66, size: 32, align: 16)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !63, file: !12, line: 90, size: 32, align: 16, elements: !67)
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !66, file: !12, line: 90, baseType: !25, size: 16, align: 16)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !66, file: !12, line: 90, baseType: !25, size: 16, align: 16, offset: 16)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !63, file: !12, line: 90, baseType: !32, size: 32, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !63, file: !12, line: 90, baseType: !72, size: 64, align: 32)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !63, file: !12, line: 90, size: 64, align: 32, elements: !73)
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !72, file: !12, line: 90, baseType: !32, size: 32, align: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !72, file: !12, line: 90, baseType: !32, size: 32, align: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !63, file: !12, line: 90, baseType: !41, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "si", scope: !16, file: !12, line: 91, baseType: !78, size: 64, align: 64, offset: 256)
!78 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !16, file: !12, line: 91, size: 64, align: 64, elements: !79)
!79 = !{!80, !85, !86, !91}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !78, file: !12, line: 91, baseType: !81, size: 32, align: 16)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !12, line: 91, size: 32, align: 16, elements: !82)
!82 = !{!83, !84}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !81, file: !12, line: 91, baseType: !25, size: 16, align: 16)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !81, file: !12, line: 91, baseType: !25, size: 16, align: 16, offset: 16)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !78, file: !12, line: 91, baseType: !32, size: 32, align: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !78, file: !12, line: 91, baseType: !87, size: 64, align: 32)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !12, line: 91, size: 64, align: 32, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !87, file: !12, line: 91, baseType: !32, size: 32, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !87, file: !12, line: 91, baseType: !32, size: 32, align: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !78, file: !12, line: 91, baseType: !41, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !16, file: !12, line: 92, baseType: !93, size: 64, align: 64, offset: 320)
!93 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !16, file: !12, line: 92, size: 64, align: 64, elements: !94)
!94 = !{!95, !100, !101, !106}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !93, file: !12, line: 92, baseType: !96, size: 32, align: 16)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !93, file: !12, line: 92, size: 32, align: 16, elements: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !96, file: !12, line: 92, baseType: !25, size: 16, align: 16)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !96, file: !12, line: 92, baseType: !25, size: 16, align: 16, offset: 16)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !93, file: !12, line: 92, baseType: !32, size: 32, align: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !93, file: !12, line: 92, baseType: !102, size: 64, align: 32)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !93, file: !12, line: 92, size: 64, align: 32, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !102, file: !12, line: 92, baseType: !32, size: 32, align: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !102, file: !12, line: 92, baseType: !32, size: 32, align: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !93, file: !12, line: 92, baseType: !41, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !13, file: !12, line: 101, baseType: !108, size: 384, align: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !13, file: !12, line: 94, size: 384, align: 64, elements: !109)
!109 = !{!110, !125, !140, !155, !170, !185}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !108, file: !12, line: 95, baseType: !111, size: 64, align: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !108, file: !12, line: 95, size: 64, align: 64, elements: !112)
!112 = !{!113, !118, !119, !124}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !111, file: !12, line: 95, baseType: !114, size: 32, align: 16)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !111, file: !12, line: 95, size: 32, align: 16, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !114, file: !12, line: 95, baseType: !25, size: 16, align: 16)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !114, file: !12, line: 95, baseType: !25, size: 16, align: 16, offset: 16)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !111, file: !12, line: 95, baseType: !32, size: 32, align: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !111, file: !12, line: 95, baseType: !120, size: 64, align: 32)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !111, file: !12, line: 95, size: 64, align: 32, elements: !121)
!121 = !{!122, !123}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !120, file: !12, line: 95, baseType: !32, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !120, file: !12, line: 95, baseType: !32, size: 32, align: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !111, file: !12, line: 95, baseType: !41, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "bx", scope: !108, file: !12, line: 96, baseType: !126, size: 64, align: 64, offset: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !108, file: !12, line: 96, size: 64, align: 64, elements: !127)
!127 = !{!128, !133, !134, !139}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !126, file: !12, line: 96, baseType: !129, size: 32, align: 16)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !126, file: !12, line: 96, size: 32, align: 16, elements: !130)
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !129, file: !12, line: 96, baseType: !25, size: 16, align: 16)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !129, file: !12, line: 96, baseType: !25, size: 16, align: 16, offset: 16)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !126, file: !12, line: 96, baseType: !32, size: 32, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !126, file: !12, line: 96, baseType: !135, size: 64, align: 32)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !126, file: !12, line: 96, size: 64, align: 32, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !135, file: !12, line: 96, baseType: !32, size: 32, align: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !135, file: !12, line: 96, baseType: !32, size: 32, align: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !126, file: !12, line: 96, baseType: !41, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !108, file: !12, line: 97, baseType: !141, size: 64, align: 64, offset: 128)
!141 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !108, file: !12, line: 97, size: 64, align: 64, elements: !142)
!142 = !{!143, !148, !149, !154}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !141, file: !12, line: 97, baseType: !144, size: 32, align: 16)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !12, line: 97, size: 32, align: 16, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !144, file: !12, line: 97, baseType: !25, size: 16, align: 16)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !144, file: !12, line: 97, baseType: !25, size: 16, align: 16, offset: 16)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !141, file: !12, line: 97, baseType: !32, size: 32, align: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !141, file: !12, line: 97, baseType: !150, size: 64, align: 32)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !12, line: 97, size: 64, align: 32, elements: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !150, file: !12, line: 97, baseType: !32, size: 32, align: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !150, file: !12, line: 97, baseType: !32, size: 32, align: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !141, file: !12, line: 97, baseType: !41, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !108, file: !12, line: 98, baseType: !156, size: 64, align: 64, offset: 192)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !108, file: !12, line: 98, size: 64, align: 64, elements: !157)
!157 = !{!158, !163, !164, !169}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !156, file: !12, line: 98, baseType: !159, size: 32, align: 16)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !156, file: !12, line: 98, size: 32, align: 16, elements: !160)
!160 = !{!161, !162}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !159, file: !12, line: 98, baseType: !25, size: 16, align: 16)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !159, file: !12, line: 98, baseType: !25, size: 16, align: 16, offset: 16)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !156, file: !12, line: 98, baseType: !32, size: 32, align: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !156, file: !12, line: 98, baseType: !165, size: 64, align: 32)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !156, file: !12, line: 98, size: 64, align: 32, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !165, file: !12, line: 98, baseType: !32, size: 32, align: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !165, file: !12, line: 98, baseType: !32, size: 32, align: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !156, file: !12, line: 98, baseType: !41, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "si", scope: !108, file: !12, line: 99, baseType: !171, size: 64, align: 64, offset: 256)
!171 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !108, file: !12, line: 99, size: 64, align: 64, elements: !172)
!172 = !{!173, !178, !179, !184}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !171, file: !12, line: 99, baseType: !174, size: 32, align: 16)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !171, file: !12, line: 99, size: 32, align: 16, elements: !175)
!175 = !{!176, !177}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !174, file: !12, line: 99, baseType: !25, size: 16, align: 16)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !174, file: !12, line: 99, baseType: !25, size: 16, align: 16, offset: 16)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !171, file: !12, line: 99, baseType: !32, size: 32, align: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !171, file: !12, line: 99, baseType: !180, size: 64, align: 32)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !171, file: !12, line: 99, size: 64, align: 32, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !180, file: !12, line: 99, baseType: !32, size: 32, align: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !180, file: !12, line: 99, baseType: !32, size: 32, align: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !171, file: !12, line: 99, baseType: !41, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !108, file: !12, line: 100, baseType: !186, size: 64, align: 64, offset: 320)
!186 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !108, file: !12, line: 100, size: 64, align: 64, elements: !187)
!187 = !{!188, !193, !194, !199}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !186, file: !12, line: 100, baseType: !189, size: 32, align: 16)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !12, line: 100, size: 32, align: 16, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !189, file: !12, line: 100, baseType: !25, size: 16, align: 16)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !189, file: !12, line: 100, baseType: !25, size: 16, align: 16, offset: 16)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !186, file: !12, line: 100, baseType: !32, size: 32, align: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !186, file: !12, line: 100, baseType: !195, size: 64, align: 32)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !12, line: 100, size: 64, align: 32, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !195, file: !12, line: 100, baseType: !32, size: 32, align: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !195, file: !12, line: 100, baseType: !32, size: 32, align: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !186, file: !12, line: 100, baseType: !41, size: 64, align: 64)
!200 = !DILocalVariable(name: "myBp", arg: 1, scope: !6, file: !7, line: 201, type: !10)
!201 = !DIExpression()
!202 = !DILocation(line: 201, column: 26, scope: !6)
!203 = !DILocation(line: 205, column: 4, scope: !6)
!204 = !DILocation(line: 205, column: 10, scope: !6)
!205 = !DILocation(line: 205, column: 13, scope: !6)
!206 = !DILocation(line: 205, column: 16, scope: !6)
!207 = !DILocation(line: 205, column: 21, scope: !6)
!208 = !DILocation(line: 206, column: 4, scope: !6)
!209 = !DILocation(line: 206, column: 10, scope: !6)
!210 = !DILocation(line: 206, column: 13, scope: !6)
!211 = !DILocation(line: 206, column: 16, scope: !6)
!212 = !DILocation(line: 206, column: 22, scope: !6)
!213 = !DILocation(line: 206, column: 26, scope: !6)
!214 = !DILocation(line: 214, column: 19, scope: !6)
!215 = !DILocation(line: 214, column: 4, scope: !6)
!216 = !DILocation(line: 219, column: 1, scope: !6)
!217 = distinct !DISubprogram(name: "Backdoor_HbOut", scope: !7, file: !7, line: 248, type: !218, isLocal: false, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !220}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "Backdoor_proto_hb", file: !12, line: 123, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !12, line: 104, size: 448, align: 64, elements: !223)
!223 = !{!224, !291}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !222, file: !12, line: 113, baseType: !225, size: 448, align: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !222, file: !12, line: 105, size: 448, align: 64, elements: !226)
!226 = !{!227, !242, !257, !258, !273, !275, !276}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !225, file: !12, line: 106, baseType: !228, size: 64, align: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !225, file: !12, line: 106, size: 64, align: 64, elements: !229)
!229 = !{!230, !235, !236, !241}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !228, file: !12, line: 106, baseType: !231, size: 32, align: 16)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !228, file: !12, line: 106, size: 32, align: 16, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !231, file: !12, line: 106, baseType: !25, size: 16, align: 16)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !231, file: !12, line: 106, baseType: !25, size: 16, align: 16, offset: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !228, file: !12, line: 106, baseType: !32, size: 32, align: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !228, file: !12, line: 106, baseType: !237, size: 64, align: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !228, file: !12, line: 106, size: 64, align: 32, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !237, file: !12, line: 106, baseType: !32, size: 32, align: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !237, file: !12, line: 106, baseType: !32, size: 32, align: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !228, file: !12, line: 106, baseType: !41, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "bx", scope: !225, file: !12, line: 107, baseType: !243, size: 64, align: 64, offset: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !225, file: !12, line: 107, size: 64, align: 64, elements: !244)
!244 = !{!245, !250, !251, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !243, file: !12, line: 107, baseType: !246, size: 32, align: 16)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !243, file: !12, line: 107, size: 32, align: 16, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !246, file: !12, line: 107, baseType: !25, size: 16, align: 16)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !246, file: !12, line: 107, baseType: !25, size: 16, align: 16, offset: 16)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !243, file: !12, line: 107, baseType: !32, size: 32, align: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !243, file: !12, line: 107, baseType: !252, size: 64, align: 32)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !243, file: !12, line: 107, size: 64, align: 32, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !252, file: !12, line: 107, baseType: !32, size: 32, align: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !252, file: !12, line: 107, baseType: !32, size: 32, align: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !243, file: !12, line: 107, baseType: !41, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !225, file: !12, line: 108, baseType: !45, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !225, file: !12, line: 109, baseType: !259, size: 64, align: 64, offset: 192)
!259 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !225, file: !12, line: 109, size: 64, align: 64, elements: !260)
!260 = !{!261, !266, !267, !272}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !259, file: !12, line: 109, baseType: !262, size: 32, align: 16)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !259, file: !12, line: 109, size: 32, align: 16, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !262, file: !12, line: 109, baseType: !25, size: 16, align: 16)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !262, file: !12, line: 109, baseType: !25, size: 16, align: 16, offset: 16)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !259, file: !12, line: 109, baseType: !32, size: 32, align: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !259, file: !12, line: 109, baseType: !268, size: 64, align: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !259, file: !12, line: 109, size: 64, align: 32, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !268, file: !12, line: 109, baseType: !32, size: 32, align: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !268, file: !12, line: 109, baseType: !32, size: 32, align: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !259, file: !12, line: 109, baseType: !41, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "srcAddr", scope: !225, file: !12, line: 110, baseType: !274, size: 64, align: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !28, line: 122, baseType: !43)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "dstAddr", scope: !225, file: !12, line: 111, baseType: !274, size: 64, align: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bp", scope: !225, file: !12, line: 112, baseType: !277, size: 64, align: 64, offset: 384)
!277 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !225, file: !12, line: 112, size: 64, align: 64, elements: !278)
!278 = !{!279, !284, !285, !290}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !277, file: !12, line: 112, baseType: !280, size: 32, align: 16)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !277, file: !12, line: 112, size: 32, align: 16, elements: !281)
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !280, file: !12, line: 112, baseType: !25, size: 16, align: 16)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !280, file: !12, line: 112, baseType: !25, size: 16, align: 16, offset: 16)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !277, file: !12, line: 112, baseType: !32, size: 32, align: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !277, file: !12, line: 112, baseType: !286, size: 64, align: 32)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !277, file: !12, line: 112, size: 64, align: 32, elements: !287)
!287 = !{!288, !289}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !286, file: !12, line: 112, baseType: !32, size: 32, align: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !286, file: !12, line: 112, baseType: !32, size: 32, align: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !277, file: !12, line: 112, baseType: !41, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !222, file: !12, line: 122, baseType: !292, size: 448, align: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !222, file: !12, line: 114, size: 448, align: 64, elements: !293)
!293 = !{!294, !309, !324, !339, !354, !369, !384}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !292, file: !12, line: 115, baseType: !295, size: 64, align: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !12, line: 115, size: 64, align: 64, elements: !296)
!296 = !{!297, !302, !303, !308}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !295, file: !12, line: 115, baseType: !298, size: 32, align: 16)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !295, file: !12, line: 115, size: 32, align: 16, elements: !299)
!299 = !{!300, !301}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !298, file: !12, line: 115, baseType: !25, size: 16, align: 16)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !298, file: !12, line: 115, baseType: !25, size: 16, align: 16, offset: 16)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !295, file: !12, line: 115, baseType: !32, size: 32, align: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !295, file: !12, line: 115, baseType: !304, size: 64, align: 32)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !295, file: !12, line: 115, size: 64, align: 32, elements: !305)
!305 = !{!306, !307}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !304, file: !12, line: 115, baseType: !32, size: 32, align: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !304, file: !12, line: 115, baseType: !32, size: 32, align: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !295, file: !12, line: 115, baseType: !41, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bx", scope: !292, file: !12, line: 116, baseType: !310, size: 64, align: 64, offset: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !12, line: 116, size: 64, align: 64, elements: !311)
!311 = !{!312, !317, !318, !323}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !310, file: !12, line: 116, baseType: !313, size: 32, align: 16)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !310, file: !12, line: 116, size: 32, align: 16, elements: !314)
!314 = !{!315, !316}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !313, file: !12, line: 116, baseType: !25, size: 16, align: 16)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !313, file: !12, line: 116, baseType: !25, size: 16, align: 16, offset: 16)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !310, file: !12, line: 116, baseType: !32, size: 32, align: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !310, file: !12, line: 116, baseType: !319, size: 64, align: 32)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !310, file: !12, line: 116, size: 64, align: 32, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !319, file: !12, line: 116, baseType: !32, size: 32, align: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !319, file: !12, line: 116, baseType: !32, size: 32, align: 32, offset: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !310, file: !12, line: 116, baseType: !41, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !292, file: !12, line: 117, baseType: !325, size: 64, align: 64, offset: 128)
!325 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !12, line: 117, size: 64, align: 64, elements: !326)
!326 = !{!327, !332, !333, !338}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !325, file: !12, line: 117, baseType: !328, size: 32, align: 16)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !325, file: !12, line: 117, size: 32, align: 16, elements: !329)
!329 = !{!330, !331}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !328, file: !12, line: 117, baseType: !25, size: 16, align: 16)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !328, file: !12, line: 117, baseType: !25, size: 16, align: 16, offset: 16)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !325, file: !12, line: 117, baseType: !32, size: 32, align: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !325, file: !12, line: 117, baseType: !334, size: 64, align: 32)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !325, file: !12, line: 117, size: 64, align: 32, elements: !335)
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !334, file: !12, line: 117, baseType: !32, size: 32, align: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !334, file: !12, line: 117, baseType: !32, size: 32, align: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !325, file: !12, line: 117, baseType: !41, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !292, file: !12, line: 118, baseType: !340, size: 64, align: 64, offset: 192)
!340 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !12, line: 118, size: 64, align: 64, elements: !341)
!341 = !{!342, !347, !348, !353}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !340, file: !12, line: 118, baseType: !343, size: 32, align: 16)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !340, file: !12, line: 118, size: 32, align: 16, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !343, file: !12, line: 118, baseType: !25, size: 16, align: 16)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !343, file: !12, line: 118, baseType: !25, size: 16, align: 16, offset: 16)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !340, file: !12, line: 118, baseType: !32, size: 32, align: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !340, file: !12, line: 118, baseType: !349, size: 64, align: 32)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !340, file: !12, line: 118, size: 64, align: 32, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !349, file: !12, line: 118, baseType: !32, size: 32, align: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !349, file: !12, line: 118, baseType: !32, size: 32, align: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !340, file: !12, line: 118, baseType: !41, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "si", scope: !292, file: !12, line: 119, baseType: !355, size: 64, align: 64, offset: 256)
!355 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !12, line: 119, size: 64, align: 64, elements: !356)
!356 = !{!357, !362, !363, !368}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !355, file: !12, line: 119, baseType: !358, size: 32, align: 16)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !355, file: !12, line: 119, size: 32, align: 16, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !358, file: !12, line: 119, baseType: !25, size: 16, align: 16)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !358, file: !12, line: 119, baseType: !25, size: 16, align: 16, offset: 16)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !355, file: !12, line: 119, baseType: !32, size: 32, align: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !355, file: !12, line: 119, baseType: !364, size: 64, align: 32)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !355, file: !12, line: 119, size: 64, align: 32, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !364, file: !12, line: 119, baseType: !32, size: 32, align: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !364, file: !12, line: 119, baseType: !32, size: 32, align: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !355, file: !12, line: 119, baseType: !41, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !292, file: !12, line: 120, baseType: !370, size: 64, align: 64, offset: 320)
!370 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !12, line: 120, size: 64, align: 64, elements: !371)
!371 = !{!372, !377, !378, !383}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !370, file: !12, line: 120, baseType: !373, size: 32, align: 16)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !370, file: !12, line: 120, size: 32, align: 16, elements: !374)
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !373, file: !12, line: 120, baseType: !25, size: 16, align: 16)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !373, file: !12, line: 120, baseType: !25, size: 16, align: 16, offset: 16)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !370, file: !12, line: 120, baseType: !32, size: 32, align: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !370, file: !12, line: 120, baseType: !379, size: 64, align: 32)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !370, file: !12, line: 120, size: 64, align: 32, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !379, file: !12, line: 120, baseType: !32, size: 32, align: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !379, file: !12, line: 120, baseType: !32, size: 32, align: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !370, file: !12, line: 120, baseType: !41, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "bp", scope: !292, file: !12, line: 121, baseType: !385, size: 64, align: 64, offset: 384)
!385 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !12, line: 121, size: 64, align: 64, elements: !386)
!386 = !{!387, !392, !393, !398}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !385, file: !12, line: 121, baseType: !388, size: 32, align: 16)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !385, file: !12, line: 121, size: 32, align: 16, elements: !389)
!389 = !{!390, !391}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !388, file: !12, line: 121, baseType: !25, size: 16, align: 16)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !388, file: !12, line: 121, baseType: !25, size: 16, align: 16, offset: 16)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !385, file: !12, line: 121, baseType: !32, size: 32, align: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !385, file: !12, line: 121, baseType: !394, size: 64, align: 32)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !385, file: !12, line: 121, size: 64, align: 32, elements: !395)
!395 = !{!396, !397}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !394, file: !12, line: 121, baseType: !32, size: 32, align: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !394, file: !12, line: 121, baseType: !32, size: 32, align: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !385, file: !12, line: 121, baseType: !41, size: 64, align: 64)
!399 = !DILocalVariable(name: "myBp", arg: 1, scope: !217, file: !7, line: 248, type: !220)
!400 = !DILocation(line: 248, column: 35, scope: !217)
!401 = !DILocation(line: 252, column: 4, scope: !217)
!402 = !DILocation(line: 252, column: 10, scope: !217)
!403 = !DILocation(line: 252, column: 13, scope: !217)
!404 = !DILocation(line: 252, column: 16, scope: !217)
!405 = !DILocation(line: 252, column: 21, scope: !217)
!406 = !DILocation(line: 253, column: 4, scope: !217)
!407 = !DILocation(line: 253, column: 10, scope: !217)
!408 = !DILocation(line: 253, column: 13, scope: !217)
!409 = !DILocation(line: 253, column: 16, scope: !217)
!410 = !DILocation(line: 253, column: 22, scope: !217)
!411 = !DILocation(line: 253, column: 26, scope: !217)
!412 = !DILocation(line: 261, column: 18, scope: !217)
!413 = !DILocation(line: 261, column: 4, scope: !217)
!414 = !DILocation(line: 266, column: 1, scope: !217)
!415 = distinct !DISubprogram(name: "Backdoor_HbIn", scope: !7, file: !7, line: 295, type: !218, isLocal: false, isDefinition: true, scopeLine: 296, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!416 = !DILocalVariable(name: "myBp", arg: 1, scope: !415, file: !7, line: 295, type: !220)
!417 = !DILocation(line: 295, column: 34, scope: !415)
!418 = !DILocation(line: 299, column: 4, scope: !415)
!419 = !DILocation(line: 299, column: 10, scope: !415)
!420 = !DILocation(line: 299, column: 13, scope: !415)
!421 = !DILocation(line: 299, column: 16, scope: !415)
!422 = !DILocation(line: 299, column: 21, scope: !415)
!423 = !DILocation(line: 300, column: 4, scope: !415)
!424 = !DILocation(line: 300, column: 10, scope: !415)
!425 = !DILocation(line: 300, column: 13, scope: !415)
!426 = !DILocation(line: 300, column: 16, scope: !415)
!427 = !DILocation(line: 300, column: 22, scope: !415)
!428 = !DILocation(line: 300, column: 26, scope: !415)
!429 = !DILocation(line: 308, column: 17, scope: !415)
!430 = !DILocation(line: 308, column: 4, scope: !415)
!431 = !DILocation(line: 313, column: 1, scope: !415)
