; ModuleID = './line9-socks5.o.i'
source_filename = "./line9-socks5.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }

@.str = private unnamed_addr constant [88 x i8] c"socks5connect: reply with requested authentication method does not say version 5 (%02x)\00", align 1
@.str.1 = private unnamed_addr constant [63 x i8] c"socks5connect: socks5 refuses our authentication methods: %02x\00", align 1
@.str.2 = private unnamed_addr constant [71 x i8] c"socks5connect: socks5 server requests username/password authentication\00", align 1
@.str.3 = private unnamed_addr constant [9 x i8] c"%c%s%c%s\00", align 1
@.str.4 = private unnamed_addr constant [70 x i8] c"socks5connect: failed transmitting username/password to socks5 server\00", align 1
@.str.5 = private unnamed_addr constant [53 x i8] c"socks5connect: failed receiving authentication reply\00", align 1
@.str.6 = private unnamed_addr constant [46 x i8] c"socks5connect: password authentication failed\00", align 1
@.str.7 = private unnamed_addr constant [18 x i8] c"Cannot resolve %s\00", align 1
@.str.8 = private unnamed_addr constant [52 x i8] c"socks5connect: failed to transmit associate request\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "line9-socks5.o.i", directory: "/home/lichi/Desktop/httping/task1")
!2 = !{}
!3 = !{!4, !5, !7}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!8 = !{i32 2, !"Dwarf Version", i32 4}
!9 = !{i32 2, !"Debug Info Version", i32 3}
!10 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!11 = distinct !DISubprogram(name: "socks5connect", scope: !12, file: !12, line: 19, type: !13, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!12 = !DIFile(filename: "socks5.c", directory: "/home/lichi/Desktop/httping/task1")
!13 = !DISubroutineType(types: !14)
!14 = !{!7, !7, !15, !44, !45, !45, !45, !7, !6}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !17, line: 567, size: 384, align: 64, elements: !18)
!17 = !DIFile(filename: "/usr/include/netdb.h", directory: "/home/lichi/Desktop/httping/task1")
!18 = !{!19, !20, !21, !22, !23, !29, !42, !43}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !16, file: !17, line: 569, baseType: !7, size: 32, align: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !16, file: !17, line: 570, baseType: !7, size: 32, align: 32, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !16, file: !17, line: 571, baseType: !7, size: 32, align: 32, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !16, file: !17, line: 572, baseType: !7, size: 32, align: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !16, file: !17, line: 573, baseType: !24, size: 32, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !25, line: 277, baseType: !26)
!25 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/httping/task1")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !27, line: 189, baseType: !28)
!27 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/httping/task1")
!28 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !16, file: !17, line: 574, baseType: !30, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !32, line: 153, size: 128, align: 16, elements: !33)
!32 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/httping/task1")
!33 = !{!34, !38}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !31, file: !32, line: 155, baseType: !35, size: 16, align: 16)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !36, line: 28, baseType: !37)
!36 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/httping/task1")
!37 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !31, file: !32, line: 156, baseType: !39, size: 112, align: 8, offset: 16)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 112, align: 8, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 14)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !16, file: !17, line: 575, baseType: !5, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !16, file: !17, line: 576, baseType: !15, size: 64, align: 64, offset: 320)
!44 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!47 = !DILocalVariable(name: "fd", arg: 1, scope: !11, file: !12, line: 19, type: !7)
!48 = !DIExpression()
!49 = !DILocation(line: 19, column: 23, scope: !11)
!50 = !DILocalVariable(name: "ai", arg: 2, scope: !11, file: !12, line: 19, type: !15)
!51 = !DILocation(line: 19, column: 44, scope: !11)
!52 = !DILocalVariable(name: "timeout", arg: 3, scope: !11, file: !12, line: 19, type: !44)
!53 = !DILocation(line: 19, column: 55, scope: !11)
!54 = !DILocalVariable(name: "socks5_username", arg: 4, scope: !11, file: !12, line: 19, type: !45)
!55 = !DILocation(line: 19, column: 76, scope: !11)
!56 = !DILocalVariable(name: "socks5_password", arg: 5, scope: !11, file: !12, line: 19, type: !45)
!57 = !DILocation(line: 19, column: 105, scope: !11)
!58 = !DILocalVariable(name: "host", arg: 6, scope: !11, file: !12, line: 19, type: !45)
!59 = !DILocation(line: 19, column: 134, scope: !11)
!60 = !DILocalVariable(name: "port", arg: 7, scope: !11, file: !12, line: 19, type: !7)
!61 = !DILocation(line: 19, column: 144, scope: !11)
!62 = !DILocalVariable(name: "abort_on_resolve_failure", arg: 8, scope: !11, file: !12, line: 19, type: !6)
!63 = !DILocation(line: 19, column: 155, scope: !11)
!64 = !DILocalVariable(name: "sai", scope: !11, file: !12, line: 21, type: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !66, line: 239, size: 128, align: 32, elements: !67)
!66 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/httping/task1")
!67 = !{!68, !69, !73, !79}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !65, file: !66, line: 241, baseType: !35, size: 16, align: 16)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !65, file: !66, line: 242, baseType: !70, size: 16, align: 16, offset: 16)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !66, line: 119, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !72, line: 49, baseType: !37)
!72 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/httping/task1")
!73 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !65, file: !66, line: 243, baseType: !74, size: 32, align: 32, offset: 32)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !66, line: 31, size: 32, align: 32, elements: !75)
!75 = !{!76}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !74, file: !66, line: 33, baseType: !77, size: 32, align: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !66, line: 30, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !72, line: 51, baseType: !28)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !65, file: !66, line: 246, baseType: !80, size: 64, align: 8, offset: 64)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 64, align: 8, elements: !82)
!81 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!82 = !{!83}
!83 = !DISubrange(count: 8)
!84 = !DILocation(line: 21, column: 21, scope: !11)
!85 = !DILocalVariable(name: "addr", scope: !11, file: !12, line: 22, type: !78)
!86 = !DILocation(line: 22, column: 11, scope: !11)
!87 = !DILocalVariable(name: "io_buffer", scope: !11, file: !12, line: 23, type: !88)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 2048, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 256)
!91 = !DILocation(line: 23, column: 16, scope: !11)
!92 = !DILocalVariable(name: "io_len", scope: !11, file: !12, line: 24, type: !7)
!93 = !DILocation(line: 24, column: 6, scope: !11)
!94 = !DILocalVariable(name: "rc", scope: !11, file: !12, line: 24, type: !7)
!95 = !DILocation(line: 24, column: 18, scope: !11)
!96 = !DILocation(line: 26, column: 23, scope: !97)
!97 = distinct !DILexicalBlock(scope: !11, file: !12, line: 26, column: 6)
!98 = !DILocation(line: 26, column: 27, scope: !97)
!99 = !DILocation(line: 26, column: 31, scope: !97)
!100 = !DILocation(line: 26, column: 12, scope: !97)
!101 = !DILocation(line: 26, column: 10, scope: !97)
!102 = !DILocation(line: 26, column: 61, scope: !97)
!103 = !DILocation(line: 26, column: 6, scope: !11)
!104 = !DILocation(line: 27, column: 10, scope: !97)
!105 = !DILocation(line: 27, column: 3, scope: !97)
!106 = !DILocation(line: 30, column: 6, scope: !107)
!107 = distinct !DILexicalBlock(scope: !11, file: !12, line: 30, column: 6)
!108 = !DILocation(line: 30, column: 22, scope: !107)
!109 = !DILocation(line: 30, column: 6, scope: !11)
!110 = !DILocation(line: 32, column: 3, scope: !111)
!111 = distinct !DILexicalBlock(scope: !107, file: !12, line: 31, column: 2)
!112 = !DILocation(line: 32, column: 16, scope: !111)
!113 = !DILocation(line: 33, column: 3, scope: !111)
!114 = !DILocation(line: 33, column: 16, scope: !111)
!115 = !DILocation(line: 34, column: 3, scope: !111)
!116 = !DILocation(line: 34, column: 16, scope: !111)
!117 = !DILocation(line: 35, column: 3, scope: !111)
!118 = !DILocation(line: 35, column: 16, scope: !111)
!119 = !DILocation(line: 36, column: 10, scope: !111)
!120 = !DILocation(line: 37, column: 2, scope: !111)
!121 = !DILocation(line: 40, column: 3, scope: !122)
!122 = distinct !DILexicalBlock(scope: !107, file: !12, line: 39, column: 2)
!123 = !DILocation(line: 40, column: 16, scope: !122)
!124 = !DILocation(line: 41, column: 3, scope: !122)
!125 = !DILocation(line: 41, column: 16, scope: !122)
!126 = !DILocation(line: 42, column: 3, scope: !122)
!127 = !DILocation(line: 42, column: 16, scope: !122)
!128 = !DILocation(line: 43, column: 10, scope: !122)
!129 = !DILocation(line: 46, column: 20, scope: !130)
!130 = distinct !DILexicalBlock(scope: !11, file: !12, line: 46, column: 6)
!131 = !DILocation(line: 46, column: 32, scope: !130)
!132 = !DILocation(line: 46, column: 43, scope: !130)
!133 = !DILocation(line: 46, column: 51, scope: !130)
!134 = !DILocation(line: 46, column: 12, scope: !130)
!135 = !DILocation(line: 46, column: 10, scope: !130)
!136 = !DILocation(line: 46, column: 61, scope: !130)
!137 = !DILocation(line: 46, column: 6, scope: !11)
!138 = !DILocation(line: 47, column: 10, scope: !130)
!139 = !DILocation(line: 47, column: 3, scope: !130)
!140 = !DILocation(line: 50, column: 19, scope: !141)
!141 = distinct !DILexicalBlock(scope: !11, file: !12, line: 50, column: 6)
!142 = !DILocation(line: 50, column: 31, scope: !141)
!143 = !DILocation(line: 50, column: 45, scope: !141)
!144 = !DILocation(line: 50, column: 12, scope: !141)
!145 = !DILocation(line: 50, column: 10, scope: !141)
!146 = !DILocation(line: 50, column: 55, scope: !141)
!147 = !DILocation(line: 50, column: 6, scope: !11)
