; ModuleID = './line12-help.o.i'
source_filename = "./line12-help.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.utsname = type { [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8] }

@.str = private unnamed_addr constant [17 x i8] c"/tmp/httping.dat\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"2.6\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.5 = private unnamed_addr constant [42 x i8] c"Welcome to the new HTTPing version 2.6!\0A\0A\00", align 1
@.str.6 = private unnamed_addr constant [133 x i8] c"Did you know that if you compile this program with NCURSES, that it then includes a nice GUI with lots more information and graphs?\0A\00", align 1
@.str.7 = private unnamed_addr constant [3 x i8] c"\0A\0A\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.8 = private unnamed_addr constant [52 x i8] c"HTTPing v2.6, (C) 2003-2017 folkert@vanheusden.com\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "line12-help.o.i", directory: "/home/lichi/Desktop/httping/task1")
!2 = !{}
!3 = !{!4, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !{i32 2, !"Dwarf Version", i32 4}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!10 = distinct !DISubprogram(name: "new_version_alert", scope: !11, file: !11, line: 13, type: !12, isLocal: false, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!11 = !DIFile(filename: "help.c", directory: "/home/lichi/Desktop/httping/task1")
!12 = !DISubroutineType(types: !13)
!13 = !{null}
!14 = !DILocalVariable(name: "new_version", scope: !10, file: !11, line: 15, type: !5)
!15 = !DIExpression()
!16 = !DILocation(line: 15, column: 7, scope: !10)
!17 = !DILocalVariable(name: "fh", scope: !10, file: !11, line: 16, type: !18)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 48, baseType: !21)
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/httping/task1")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !22, line: 241, size: 1728, align: 64, elements: !23)
!22 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/httping/task1")
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !44, !45, !46, !47, !51, !53, !55, !59, !62, !64, !66, !67, !68, !69, !73, !74}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !21, file: !22, line: 242, baseType: !6, size: 32, align: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !21, file: !22, line: 247, baseType: !4, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !21, file: !22, line: 248, baseType: !4, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !21, file: !22, line: 249, baseType: !4, size: 64, align: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !21, file: !22, line: 250, baseType: !4, size: 64, align: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !21, file: !22, line: 251, baseType: !4, size: 64, align: 64, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !21, file: !22, line: 252, baseType: !4, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !21, file: !22, line: 253, baseType: !4, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !21, file: !22, line: 254, baseType: !4, size: 64, align: 64, offset: 512)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !21, file: !22, line: 256, baseType: !4, size: 64, align: 64, offset: 576)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !21, file: !22, line: 257, baseType: !4, size: 64, align: 64, offset: 640)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !21, file: !22, line: 258, baseType: !4, size: 64, align: 64, offset: 704)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !21, file: !22, line: 260, baseType: !37, size: 64, align: 64, offset: 768)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !22, line: 156, size: 192, align: 64, elements: !39)
!39 = !{!40, !41, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !38, file: !22, line: 157, baseType: !37, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !38, file: !22, line: 158, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !38, file: !22, line: 162, baseType: !6, size: 32, align: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !21, file: !22, line: 262, baseType: !42, size: 64, align: 64, offset: 832)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !21, file: !22, line: 264, baseType: !6, size: 32, align: 32, offset: 896)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !21, file: !22, line: 268, baseType: !6, size: 32, align: 32, offset: 928)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !21, file: !22, line: 270, baseType: !48, size: 64, align: 64, offset: 960)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !49, line: 131, baseType: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/httping/task1")
!50 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !21, file: !22, line: 274, baseType: !52, size: 16, align: 16, offset: 1024)
!52 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !21, file: !22, line: 275, baseType: !54, size: 8, align: 8, offset: 1040)
!54 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !21, file: !22, line: 276, baseType: !56, size: 8, align: 8, offset: 1048)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8, align: 8, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 1)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !21, file: !22, line: 280, baseType: !60, size: 64, align: 64, offset: 1088)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !22, line: 150, baseType: null)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !21, file: !22, line: 289, baseType: !63, size: 64, align: 64, offset: 1152)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !49, line: 132, baseType: !50)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !21, file: !22, line: 297, baseType: !65, size: 64, align: 64, offset: 1216)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !21, file: !22, line: 298, baseType: !65, size: 64, align: 64, offset: 1280)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !21, file: !22, line: 299, baseType: !65, size: 64, align: 64, offset: 1344)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !21, file: !22, line: 300, baseType: !65, size: 64, align: 64, offset: 1408)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !21, file: !22, line: 302, baseType: !70, size: 64, align: 64, offset: 1472)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 216, baseType: !72)
!71 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/httping/task1")
!72 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !21, file: !22, line: 303, baseType: !6, size: 32, align: 32, offset: 1536)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !21, file: !22, line: 305, baseType: !75, size: 160, align: 8, offset: 1568)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 160, align: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 20)
!78 = !DILocation(line: 16, column: 8, scope: !10)
!79 = !DILocation(line: 16, column: 13, scope: !10)
!80 = !DILocation(line: 17, column: 7, scope: !81)
!81 = distinct !DILexicalBlock(scope: !10, file: !11, line: 17, column: 6)
!82 = !DILocation(line: 17, column: 6, scope: !10)
!83 = !DILocation(line: 18, column: 15, scope: !81)
!84 = !DILocation(line: 18, column: 3, scope: !81)
!85 = !DILocalVariable(name: "buffer", scope: !86, file: !11, line: 21, type: !87)
!86 = distinct !DILexicalBlock(scope: !81, file: !11, line: 20, column: 2)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 32768, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 4096)
!90 = !DILocation(line: 21, column: 8, scope: !86)
!91 = !DILocalVariable(name: "dummy", scope: !86, file: !11, line: 21, type: !4)
!92 = !DILocation(line: 21, column: 23, scope: !86)
!93 = !DILocation(line: 23, column: 9, scope: !86)
!94 = !DILocation(line: 23, column: 32, scope: !86)
!95 = !DILocation(line: 23, column: 3, scope: !86)
!96 = !DILocation(line: 25, column: 10, scope: !86)
!97 = !DILocation(line: 25, column: 3, scope: !86)
!98 = !DILocation(line: 27, column: 18, scope: !86)
!99 = !DILocation(line: 27, column: 11, scope: !86)
!100 = !DILocation(line: 27, column: 9, scope: !86)
!101 = !DILocation(line: 28, column: 7, scope: !102)
!102 = distinct !DILexicalBlock(scope: !86, file: !11, line: 28, column: 7)
!103 = !DILocation(line: 28, column: 7, scope: !86)
!104 = !DILocation(line: 29, column: 5, scope: !102)
!105 = !DILocation(line: 29, column: 11, scope: !102)
!106 = !DILocation(line: 29, column: 4, scope: !102)
!107 = !DILocation(line: 31, column: 14, scope: !108)
!108 = distinct !DILexicalBlock(scope: !86, file: !11, line: 31, column: 7)
!109 = !DILocation(line: 31, column: 7, scope: !108)
!110 = !DILocation(line: 31, column: 29, scope: !108)
!111 = !DILocation(line: 31, column: 7, scope: !86)
!112 = !DILocation(line: 32, column: 16, scope: !108)
!113 = !DILocation(line: 32, column: 4, scope: !108)
!114 = !DILocation(line: 35, column: 6, scope: !115)
!115 = distinct !DILexicalBlock(scope: !10, file: !11, line: 35, column: 6)
!116 = !DILocation(line: 35, column: 6, scope: !10)
!117 = !DILocalVariable(name: "buf", scope: !118, file: !11, line: 37, type: !119)
!118 = distinct !DILexicalBlock(scope: !115, file: !11, line: 36, column: 2)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !120, line: 48, size: 3120, align: 8, elements: !121)
!120 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/utsname.h", directory: "/home/lichi/Desktop/httping/task1")
!121 = !{!122, !126, !127, !128, !129, !130}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !119, file: !120, line: 51, baseType: !123, size: 520, align: 8)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 520, align: 8, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 65)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !119, file: !120, line: 54, baseType: !123, size: 520, align: 8, offset: 520)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !119, file: !120, line: 57, baseType: !123, size: 520, align: 8, offset: 1040)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !119, file: !120, line: 59, baseType: !123, size: 520, align: 8, offset: 1560)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !119, file: !120, line: 62, baseType: !123, size: 520, align: 8, offset: 2080)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__domainname", scope: !119, file: !120, line: 69, baseType: !123, size: 520, align: 8, offset: 2600)
!131 = !DILocation(line: 37, column: 18, scope: !118)
!132 = !DILocalVariable(name: "fh", scope: !118, file: !11, line: 38, type: !18)
!133 = !DILocation(line: 38, column: 9, scope: !118)
!134 = !DILocation(line: 38, column: 14, scope: !118)
!135 = !DILocation(line: 39, column: 7, scope: !136)
!136 = distinct !DILexicalBlock(scope: !118, file: !11, line: 39, column: 7)
!137 = !DILocation(line: 39, column: 7, scope: !118)
!138 = !DILocation(line: 41, column: 12, scope: !139)
!139 = distinct !DILexicalBlock(scope: !136, file: !11, line: 40, column: 3)
!140 = !DILocation(line: 41, column: 4, scope: !139)
!141 = !DILocation(line: 43, column: 11, scope: !139)
!142 = !DILocation(line: 43, column: 4, scope: !139)
!143 = !DILocation(line: 44, column: 3, scope: !139)
!144 = !DILocation(line: 46, column: 3, scope: !118)
!145 = !DILocation(line: 53, column: 3, scope: !118)
!146 = !DILocation(line: 71, column: 3, scope: !118)
!147 = !DILocation(line: 72, column: 2, scope: !118)
!148 = !DILocation(line: 73, column: 1, scope: !10)
!149 = distinct !DISubprogram(name: "version", scope: !11, file: !11, line: 75, type: !12, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!150 = !DILocation(line: 77, column: 9, scope: !149)
!151 = !DILocation(line: 77, column: 17, scope: !149)
!152 = !DILocation(line: 77, column: 2, scope: !153)
!153 = !DILexicalBlockFile(scope: !149, file: !11, discriminator: 1)
!154 = !DILocation(line: 79, column: 9, scope: !149)
!155 = !DILocation(line: 79, column: 17, scope: !149)
!156 = !DILocation(line: 79, column: 2, scope: !153)
!157 = !DILocation(line: 91, column: 9, scope: !149)
!158 = !DILocation(line: 91, column: 17, scope: !149)
!159 = !DILocation(line: 91, column: 2, scope: !153)
!160 = !DILocation(line: 93, column: 9, scope: !149)
!161 = !DILocation(line: 93, column: 17, scope: !149)
!162 = !DILocation(line: 93, column: 2, scope: !153)
!163 = !DILocation(line: 94, column: 1, scope: !149)
!164 = distinct !DISubprogram(name: "format_help", scope: !11, file: !11, line: 96, type: !165, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !167, !167, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!169 = !DILocalVariable(name: "short_str", arg: 1, scope: !164, file: !11, line: 96, type: !167)
!170 = !DILocation(line: 96, column: 30, scope: !164)
!171 = !DILocalVariable(name: "long_str", arg: 2, scope: !164, file: !11, line: 96, type: !167)
!172 = !DILocation(line: 96, column: 53, scope: !164)
!173 = !DILocalVariable(name: "descr", arg: 3, scope: !164, file: !11, line: 96, type: !167)
!174 = !DILocation(line: 96, column: 75, scope: !164)
!175 = !DILocalVariable(name: "par_width", scope: !164, file: !11, line: 98, type: !6)
!176 = !DILocation(line: 98, column: 6, scope: !164)
!177 = !DILocalVariable(name: "max_wrap_width", scope: !164, file: !11, line: 98, type: !6)
!178 = !DILocation(line: 98, column: 22, scope: !164)
!179 = !DILocation(line: 98, column: 39, scope: !164)
!180 = !DILocation(line: 98, column: 49, scope: !164)
!181 = !DILocalVariable(name: "cur_par_width", scope: !164, file: !11, line: 98, type: !6)
!182 = !DILocation(line: 98, column: 54, scope: !164)
!183 = !DILocalVariable(name: "descr_width", scope: !164, file: !11, line: 99, type: !6)
!184 = !DILocation(line: 99, column: 6, scope: !164)
!185 = !DILocation(line: 99, column: 20, scope: !164)
!186 = !DILocation(line: 99, column: 29, scope: !164)
!187 = !DILocation(line: 99, column: 39, scope: !164)
!188 = !DILocation(line: 99, column: 26, scope: !164)
!189 = !DILocalVariable(name: "line", scope: !164, file: !11, line: 100, type: !4)
