; ModuleID = './[inter]eth.o.i'
source_filename = "./[inter]eth.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.pcap_pkthdr = type { %struct.timeval, i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.pcap = type opaque
%struct.pcap_dumper = type opaque
%struct.pcap_stat = type { i32, i32, i32 }
%struct.bpf_program = type { i32, %struct.bpf_insn* }
%struct.bpf_insn = type { i16, i8, i8, i32 }
%struct.libnet_ethernet_hdr = type { [6 x i8], [6 x i8], i16 }

@logd = common global %struct._IO_FILE* null, align 8
@offset = common global i16 0, align 2
@npkt = common global i32 0, align 4
@packet = common global i8* null, align 8
@buf = common global i8* null, align 8
@hdr = common global %struct.pcap_pkthdr zeroinitializer, align 8
@descr = common global %struct.pcap* null, align 8
@dumper = common global %struct.pcap_dumper* null, align 8
@statistic = common global %struct.pcap_stat zeroinitializer, align 4
@maskp = common global i32 0, align 4
@netp = common global i32 0, align 4
@datalink = common global i32 0, align 4
@fp = common global %struct.bpf_program zeroinitializer, align 8
@logname = common global i8* null, align 8
@tcpdl = common global i8* null, align 8
@tr = common global i16 0, align 2
@tl = common global i16 0, align 2
@graph = common global i16 0, align 2
@cont = common global i16 0, align 2
@stream_glob = common global i32 0, align 4
@bc_glob = common global i32 0, align 4
@sniff_glob = common global i32 0, align 4
@rst_glob = common global i32 0, align 4
@arp_glob = common global i32 0, align 4
@pt = common global [2 x i64] zeroinitializer, align 16
@lg = common global i32 0, align 4
@tm = common global i64 0, align 8
@timed = common global [60 x i8] zeroinitializer, align 16
@demonize = common global i16 0, align 2
@line_s = common global i32 0, align 4
@row_s = common global i32 0, align 4

; Function Attrs: nounwind uwtable
define zeroext i16 @handle_ethernet(i8*) #0 !dbg !174 {
  %2 = alloca i8*, align 8
  %3 = alloca %struct.libnet_ethernet_hdr*, align 8
  %4 = alloca i16, align 2
  store i8* %0, i8** %2, align 8
  call void @llvm.dbg.declare(metadata i8** %2, metadata !179, metadata !180), !dbg !181
  call void @llvm.dbg.declare(metadata %struct.libnet_ethernet_hdr** %3, metadata !182, metadata !180), !dbg !183
  call void @llvm.dbg.declare(metadata i16* %4, metadata !184, metadata !180), !dbg !185
  %5 = load i8*, i8** %2, align 8, !dbg !186
  %6 = bitcast i8* %5 to %struct.libnet_ethernet_hdr*, !dbg !187
  store %struct.libnet_ethernet_hdr* %6, %struct.libnet_ethernet_hdr** %3, align 8, !dbg !188
  %7 = load %struct.libnet_ethernet_hdr*, %struct.libnet_ethernet_hdr** %3, align 8, !dbg !189
  %8 = getelementptr inbounds %struct.libnet_ethernet_hdr, %struct.libnet_ethernet_hdr* %7, i32 0, i32 2, !dbg !190
  %9 = load i16, i16* %8, align 2, !dbg !190
  %10 = call zeroext i16 @ntohs(i16 zeroext %9) #1, !dbg !191
  store i16 %10, i16* %4, align 2, !dbg !192
  %11 = load i16, i16* %4, align 2, !dbg !193
  ret i16 %11, !dbg !194
}

; Function Attrs: nounwind readnone
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

; Function Attrs: nounwind readnone
declare zeroext i16 @ntohs(i16 zeroext) #2

attributes #0 = { nounwind uwtable "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="true" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-jump-tables"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #1 = { nounwind readnone }
attributes #2 = { nounwind readnone "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="true" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }

!llvm.dbg.cu = !{!0}
!llvm.module.flags = !{!171, !172}
!llvm.ident = !{!173}

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !19)
!1 = !DIFile(filename: "[inter]eth.o.i", directory: "/home/lichi/Desktop/nast/[task]nast")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_ethernet_hdr", file: !6, line: 497, size: 112, align: 16, elements: !7)
!6 = !DIFile(filename: "/usr/local/include/libnet/libnet-headers.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!7 = !{!8, !15, !16}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "ether_dhost", scope: !5, file: !6, line: 499, baseType: !9, size: 48, align: 8)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 48, align: 8, elements: !13)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !11, line: 48, baseType: !12)
!11 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!12 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!13 = !{!14}
!14 = !DISubrange(count: 6)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "ether_shost", scope: !5, file: !6, line: 500, baseType: !9, size: 48, align: 8, offset: 48)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ether_type", scope: !5, file: !6, line: 501, baseType: !17, size: 16, align: 16, offset: 96)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !11, line: 49, baseType: !18)
!18 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!19 = !{!20, !84, !86, !87, !92, !93, !112, !116, !120, !126, !127, !128, !129, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !160, !161, !164, !168, !169, !170}
!20 = distinct !DIGlobalVariable(name: "logd", scope: !0, file: !21, line: 98, type: !22, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @logd)
!21 = !DIFile(filename: "include/nast.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !24, line: 48, baseType: !25)
!24 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !26, line: 241, size: 1728, align: 64, elements: !27)
!26 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!27 = !{!28, !30, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !51, !52, !53, !54, !58, !59, !61, !65, !68, !70, !72, !73, !74, !75, !79, !80}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !25, file: !26, line: 242, baseType: !29, size: 32, align: 32)
!29 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !25, file: !26, line: 247, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !25, file: !26, line: 248, baseType: !31, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !25, file: !26, line: 249, baseType: !31, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !25, file: !26, line: 250, baseType: !31, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !25, file: !26, line: 251, baseType: !31, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !25, file: !26, line: 252, baseType: !31, size: 64, align: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !25, file: !26, line: 253, baseType: !31, size: 64, align: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !25, file: !26, line: 254, baseType: !31, size: 64, align: 64, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !25, file: !26, line: 256, baseType: !31, size: 64, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !25, file: !26, line: 257, baseType: !31, size: 64, align: 64, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !25, file: !26, line: 258, baseType: !31, size: 64, align: 64, offset: 704)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !25, file: !26, line: 260, baseType: !44, size: 64, align: 64, offset: 768)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !26, line: 156, size: 192, align: 64, elements: !46)
!46 = !{!47, !48, !50}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !45, file: !26, line: 157, baseType: !44, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !45, file: !26, line: 158, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !45, file: !26, line: 162, baseType: !29, size: 32, align: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !25, file: !26, line: 262, baseType: !49, size: 64, align: 64, offset: 832)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !25, file: !26, line: 264, baseType: !29, size: 32, align: 32, offset: 896)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !25, file: !26, line: 268, baseType: !29, size: 32, align: 32, offset: 928)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !25, file: !26, line: 270, baseType: !55, size: 64, align: 64, offset: 960)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !56, line: 131, baseType: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!57 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !25, file: !26, line: 274, baseType: !18, size: 16, align: 16, offset: 1024)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !25, file: !26, line: 275, baseType: !60, size: 8, align: 8, offset: 1040)
!60 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !25, file: !26, line: 276, baseType: !62, size: 8, align: 8, offset: 1048)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8, align: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 1)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !25, file: !26, line: 280, baseType: !66, size: 64, align: 64, offset: 1088)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !26, line: 150, baseType: null)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !25, file: !26, line: 289, baseType: !69, size: 64, align: 64, offset: 1152)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !56, line: 132, baseType: !57)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !25, file: !26, line: 297, baseType: !71, size: 64, align: 64, offset: 1216)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !25, file: !26, line: 298, baseType: !71, size: 64, align: 64, offset: 1280)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !25, file: !26, line: 299, baseType: !71, size: 64, align: 64, offset: 1344)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !25, file: !26, line: 300, baseType: !71, size: 64, align: 64, offset: 1408)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !25, file: !26, line: 302, baseType: !76, size: 64, align: 64, offset: 1472)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !77, line: 216, baseType: !78)
!77 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!78 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !25, file: !26, line: 303, baseType: !29, size: 32, align: 32, offset: 1536)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !25, file: !26, line: 305, baseType: !81, size: 160, align: 8, offset: 1568)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 20)
!84 = distinct !DIGlobalVariable(name: "offset", scope: !0, file: !21, line: 99, type: !85, isLocal: false, isDefinition: true, variable: i16* @offset)
!85 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!86 = distinct !DIGlobalVariable(name: "npkt", scope: !0, file: !21, line: 100, type: !29, isLocal: false, isDefinition: true, variable: i32* @npkt)
!87 = distinct !DIGlobalVariable(name: "packet", scope: !0, file: !21, line: 101, type: !88, isLocal: false, isDefinition: true, variable: i8** @packet)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !90, line: 33, baseType: !91)
!90 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !56, line: 30, baseType: !12)
!92 = distinct !DIGlobalVariable(name: "buf", scope: !0, file: !21, line: 102, type: !88, isLocal: false, isDefinition: true, variable: i8** @buf)
!93 = distinct !DIGlobalVariable(name: "hdr", scope: !0, file: !21, line: 103, type: !94, isLocal: false, isDefinition: true, variable: %struct.pcap_pkthdr* @hdr)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_pkthdr", file: !95, line: 199, size: 192, align: 64, elements: !96)
!95 = !DIFile(filename: "/usr/local/include/pcap/pcap.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!96 = !{!97, !105, !111}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !94, file: !95, line: 200, baseType: !98, size: 128, align: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !99, line: 30, size: 128, align: 64, elements: !100)
!99 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!100 = !{!101, !103}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !98, file: !99, line: 32, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !56, line: 139, baseType: !57)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !98, file: !99, line: 33, baseType: !104, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !56, line: 141, baseType: !57)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "caplen", scope: !94, file: !95, line: 201, baseType: !106, size: 32, align: 32, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "bpf_u_int32", file: !107, line: 85, baseType: !108)
!107 = !DIFile(filename: "/usr/local/include/pcap/bpf.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !90, line: 35, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !56, line: 32, baseType: !110)
!110 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !94, file: !95, line: 202, baseType: !106, size: 32, align: 32, offset: 160)
!112 = distinct !DIGlobalVariable(name: "descr", scope: !0, file: !21, line: 104, type: !113, isLocal: false, isDefinition: true, variable: %struct.pcap** @descr)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_t", file: !95, line: 118, baseType: !115)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap", file: !95, line: 118, flags: DIFlagFwdDecl)
!116 = distinct !DIGlobalVariable(name: "dumper", scope: !0, file: !21, line: 105, type: !117, isLocal: false, isDefinition: true, variable: %struct.pcap_dumper** @dumper)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_dumper_t", file: !95, line: 119, baseType: !119)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_dumper", file: !95, line: 119, flags: DIFlagFwdDecl)
!120 = distinct !DIGlobalVariable(name: "statistic", scope: !0, file: !21, line: 106, type: !121, isLocal: false, isDefinition: true, variable: %struct.pcap_stat* @statistic)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_stat", file: !95, line: 208, size: 96, align: 32, elements: !122)
!122 = !{!123, !124, !125}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ps_recv", scope: !121, file: !95, line: 209, baseType: !108, size: 32, align: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ps_drop", scope: !121, file: !95, line: 210, baseType: !108, size: 32, align: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ps_ifdrop", scope: !121, file: !95, line: 211, baseType: !108, size: 32, align: 32, offset: 64)
!126 = distinct !DIGlobalVariable(name: "maskp", scope: !0, file: !21, line: 107, type: !106, isLocal: false, isDefinition: true, variable: i32* @maskp)
!127 = distinct !DIGlobalVariable(name: "netp", scope: !0, file: !21, line: 108, type: !106, isLocal: false, isDefinition: true, variable: i32* @netp)
!128 = distinct !DIGlobalVariable(name: "datalink", scope: !0, file: !21, line: 109, type: !29, isLocal: false, isDefinition: true, variable: i32* @datalink)
!129 = distinct !DIGlobalVariable(name: "fp", scope: !0, file: !21, line: 110, type: !130, isLocal: false, isDefinition: true, variable: %struct.bpf_program* @fp)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_program", file: !107, line: 104, size: 128, align: 64, elements: !131)
!131 = !{!132, !133}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "bf_len", scope: !130, file: !107, line: 105, baseType: !108, size: 32, align: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "bf_insns", scope: !130, file: !107, line: 106, baseType: !134, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_insn", file: !107, line: 234, size: 64, align: 32, elements: !136)
!136 = !{!137, !140, !141, !142}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !135, file: !107, line: 235, baseType: !138, size: 16, align: 16)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !90, line: 34, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !56, line: 31, baseType: !18)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "jt", scope: !135, file: !107, line: 236, baseType: !89, size: 8, align: 8, offset: 16)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "jf", scope: !135, file: !107, line: 237, baseType: !89, size: 8, align: 8, offset: 24)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !135, file: !107, line: 238, baseType: !106, size: 32, align: 32, offset: 32)
!143 = distinct !DIGlobalVariable(name: "logname", scope: !0, file: !21, line: 111, type: !31, isLocal: false, isDefinition: true, variable: i8** @logname)
!144 = distinct !DIGlobalVariable(name: "tcpdl", scope: !0, file: !21, line: 112, type: !31, isLocal: false, isDefinition: true, variable: i8** @tcpdl)
!145 = distinct !DIGlobalVariable(name: "tr", scope: !0, file: !21, line: 113, type: !138, isLocal: false, isDefinition: true, variable: i16* @tr)
!146 = distinct !DIGlobalVariable(name: "tl", scope: !0, file: !21, line: 113, type: !138, isLocal: false, isDefinition: true, variable: i16* @tl)
!147 = distinct !DIGlobalVariable(name: "graph", scope: !0, file: !21, line: 114, type: !138, isLocal: false, isDefinition: true, variable: i16* @graph)
!148 = distinct !DIGlobalVariable(name: "cont", scope: !0, file: !21, line: 115, type: !138, isLocal: false, isDefinition: true, variable: i16* @cont)
!149 = distinct !DIGlobalVariable(name: "stream_glob", scope: !0, file: !21, line: 117, type: !29, isLocal: false, isDefinition: true, variable: i32* @stream_glob)
!150 = distinct !DIGlobalVariable(name: "bc_glob", scope: !0, file: !21, line: 118, type: !29, isLocal: false, isDefinition: true, variable: i32* @bc_glob)
!151 = distinct !DIGlobalVariable(name: "sniff_glob", scope: !0, file: !21, line: 119, type: !29, isLocal: false, isDefinition: true, variable: i32* @sniff_glob)
!152 = distinct !DIGlobalVariable(name: "rst_glob", scope: !0, file: !21, line: 120, type: !29, isLocal: false, isDefinition: true, variable: i32* @rst_glob)
!153 = distinct !DIGlobalVariable(name: "arp_glob", scope: !0, file: !21, line: 121, type: !29, isLocal: false, isDefinition: true, variable: i32* @arp_glob)
!154 = distinct !DIGlobalVariable(name: "pt", scope: !0, file: !21, line: 122, type: !155, isLocal: false, isDefinition: true, variable: [2 x i64]* @pt)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 128, align: 64, elements: !158)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !157, line: 60, baseType: !78)
!157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!158 = !{!159}
!159 = !DISubrange(count: 2)
!160 = distinct !DIGlobalVariable(name: "lg", scope: !0, file: !21, line: 123, type: !29, isLocal: false, isDefinition: true, variable: i32* @lg)
!161 = distinct !DIGlobalVariable(name: "tm", scope: !0, file: !21, line: 132, type: !162, isLocal: false, isDefinition: true, variable: i64* @tm)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !163, line: 75, baseType: !102)
!163 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!164 = distinct !DIGlobalVariable(name: "timed", scope: !0, file: !21, line: 133, type: !165, isLocal: false, isDefinition: true, variable: [60 x i8]* @timed)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 480, align: 8, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 60)
!168 = distinct !DIGlobalVariable(name: "demonize", scope: !0, file: !21, line: 136, type: !138, isLocal: false, isDefinition: true, variable: i16* @demonize)
!169 = distinct !DIGlobalVariable(name: "line_s", scope: !0, file: !21, line: 138, type: !29, isLocal: false, isDefinition: true, variable: i32* @line_s)
!170 = distinct !DIGlobalVariable(name: "row_s", scope: !0, file: !21, line: 139, type: !29, isLocal: false, isDefinition: true, variable: i32* @row_s)
!171 = !{i32 2, !"Dwarf Version", i32 4}
!172 = !{i32 2, !"Debug Info Version", i32 3}
!173 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!174 = distinct !DISubprogram(name: "handle_ethernet", scope: !175, file: !175, line: 26, type: !176, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!175 = !DIFile(filename: "eth.c", directory: "/home/lichi/Desktop/nast/[task]nast")
!176 = !DISubroutineType(types: !177)
!177 = !{!178, !88}
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int16_t", file: !90, line: 201, baseType: !18)
!179 = !DILocalVariable(name: "packet", arg: 1, scope: !174, file: !175, line: 26, type: !88)
!180 = !DIExpression()
!181 = !DILocation(line: 26, column: 36, scope: !174)
!182 = !DILocalVariable(name: "eptr", scope: !174, file: !175, line: 28, type: !4)
!183 = !DILocation(line: 28, column: 33, scope: !174)
!184 = !DILocalVariable(name: "ether_type", scope: !174, file: !175, line: 29, type: !138)
!185 = !DILocation(line: 29, column: 13, scope: !174)
!186 = !DILocation(line: 31, column: 43, scope: !174)
!187 = !DILocation(line: 31, column: 12, scope: !174)
!188 = !DILocation(line: 31, column: 10, scope: !174)
!189 = !DILocation(line: 32, column: 25, scope: !174)
!190 = !DILocation(line: 32, column: 31, scope: !174)
!191 = !DILocation(line: 32, column: 18, scope: !174)
!192 = !DILocation(line: 32, column: 16, scope: !174)
!193 = !DILocation(line: 34, column: 12, scope: !174)
!194 = !DILocation(line: 34, column: 5, scope: !174)
