; ModuleID = './[inter]bcount.o.i'
source_filename = "./[inter]bcount.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pcap = type opaque
%struct.bpf_program = type { i32, %struct.bpf_insn* }
%struct.bpf_insn = type { i16, i8, i8, i32 }
%struct.pcap_pkthdr = type { %struct.timeval, i32, i32 }
%struct.timeval = type { i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.statistics = type { i64, i64, i16, i16, double, i32 }
%struct.pcap_dumper = type opaque
%struct.pcap_stat = type { i32, i32, i32 }
%union.pthread_attr_t = type { i64, [48 x i8] }
%struct.libnet_ipv4_hdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %struct.in_addr, %struct.in_addr }
%struct.in_addr = type { i32 }
%struct.libnet_tcp_hdr = type { i16, i16, i32, i32, i8, i8, i16, i16, i16 }

@nconns = global i32 0, align 4
@liness = global i32 13, align 4
@.str = private unnamed_addr constant [17 x i8] c"Device is null!\0A\00", align 1
@graph = common global i16 0, align 2
@demonize = common global i16 0, align 2
@.str.1 = private unnamed_addr constant [6 x i8] c"winfo\00", align 1
@.str.2 = private unnamed_addr constant [53 x i8] c"Is very useless demonize me in finding gateway! Omit\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !52)
!1 = !DIFile(filename: "[inter]bcount.o.i", directory: "/home/lichi/Desktop/nast/[task]nast")
!2 = !{}
!3 = !{!4, !5, !11, !12, !13, !39}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !7, line: 33, baseType: !8)
!7 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !9, line: 30, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!10 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_ipv4_hdr", file: !15, line: 666, size: 160, align: 32, elements: !16)
!15 = !DIFile(filename: "/usr/local/include/libnet/libnet-headers.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!16 = !{!17, !20, !21, !22, !25, !26, !27, !28, !29, !30, !38}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ip_hl", scope: !14, file: !15, line: 669, baseType: !18, size: 4, align: 8, flags: DIFlagBitField, extraData: i64 0)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !19, line: 48, baseType: !10)
!19 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ip_v", scope: !14, file: !15, line: 670, baseType: !18, size: 4, align: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ip_tos", scope: !14, file: !15, line: 676, baseType: !18, size: 8, align: 8, offset: 8)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ip_len", scope: !14, file: !15, line: 689, baseType: !23, size: 16, align: 16, offset: 16)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !19, line: 49, baseType: !24)
!24 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !14, file: !15, line: 690, baseType: !23, size: 16, align: 16, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ip_off", scope: !14, file: !15, line: 691, baseType: !23, size: 16, align: 16, offset: 48)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl", scope: !14, file: !15, line: 704, baseType: !18, size: 8, align: 8, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ip_p", scope: !14, file: !15, line: 705, baseType: !18, size: 8, align: 8, offset: 72)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ip_sum", scope: !14, file: !15, line: 706, baseType: !23, size: 16, align: 16, offset: 80)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ip_src", scope: !14, file: !15, line: 707, baseType: !31, size: 32, align: 32, offset: 96)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !32, line: 31, size: 32, align: 32, elements: !33)
!32 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!33 = !{!34}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !31, file: !32, line: 33, baseType: !35, size: 32, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !32, line: 30, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !19, line: 51, baseType: !37)
!37 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ip_dst", scope: !14, file: !15, line: 707, baseType: !31, size: 32, align: 32, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_tcp_hdr", file: !15, line: 1653, size: 160, align: 32, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "th_sport", scope: !40, file: !15, line: 1655, baseType: !23, size: 16, align: 16)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "th_dport", scope: !40, file: !15, line: 1656, baseType: !23, size: 16, align: 16, offset: 16)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "th_seq", scope: !40, file: !15, line: 1657, baseType: !36, size: 32, align: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "th_ack", scope: !40, file: !15, line: 1658, baseType: !36, size: 32, align: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "th_x2", scope: !40, file: !15, line: 1660, baseType: !18, size: 4, align: 8, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "th_off", scope: !40, file: !15, line: 1661, baseType: !18, size: 4, align: 8, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "th_flags", scope: !40, file: !15, line: 1667, baseType: !18, size: 8, align: 8, offset: 104)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "th_win", scope: !40, file: !15, line: 1692, baseType: !23, size: 16, align: 16, offset: 112)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "th_sum", scope: !40, file: !15, line: 1693, baseType: !23, size: 16, align: 16, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "th_urp", scope: !40, file: !15, line: 1694, baseType: !23, size: 16, align: 16, offset: 144)
!52 = !{!53, !55, !56, !117, !119, !120, !121, !122, !140, !144, !148, !154, !155, !156, !157, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !188, !189, !192, !196, !197, !198, !199, !211, !212, !213}
!53 = distinct !DIGlobalVariable(name: "nconns", scope: !0, file: !54, line: 43, type: !12, isLocal: false, isDefinition: true, variable: i32* @nconns)
!54 = !DIFile(filename: "bcount.c", directory: "/home/lichi/Desktop/nast/[task]nast")
!55 = distinct !DIGlobalVariable(name: "liness", scope: !0, file: !54, line: 44, type: !12, isLocal: false, isDefinition: true, variable: i32* @liness)
!56 = distinct !DIGlobalVariable(name: "logd", scope: !0, file: !57, line: 98, type: !58, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @logd)
!57 = !DIFile(filename: "include/nast.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !60, line: 48, baseType: !61)
!60 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 241, size: 1728, align: 64, elements: !63)
!62 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!63 = !{!64, !65, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !86, !87, !88, !89, !92, !93, !95, !99, !102, !104, !105, !106, !107, !108, !112, !113}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !61, file: !62, line: 242, baseType: !12, size: 32, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !61, file: !62, line: 247, baseType: !66, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !61, file: !62, line: 248, baseType: !66, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !61, file: !62, line: 249, baseType: !66, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !61, file: !62, line: 250, baseType: !66, size: 64, align: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !61, file: !62, line: 251, baseType: !66, size: 64, align: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !61, file: !62, line: 252, baseType: !66, size: 64, align: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !61, file: !62, line: 253, baseType: !66, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !61, file: !62, line: 254, baseType: !66, size: 64, align: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !61, file: !62, line: 256, baseType: !66, size: 64, align: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !61, file: !62, line: 257, baseType: !66, size: 64, align: 64, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !61, file: !62, line: 258, baseType: !66, size: 64, align: 64, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !61, file: !62, line: 260, baseType: !79, size: 64, align: 64, offset: 768)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !62, line: 156, size: 192, align: 64, elements: !81)
!81 = !{!82, !83, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !80, file: !62, line: 157, baseType: !79, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !80, file: !62, line: 158, baseType: !84, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !80, file: !62, line: 162, baseType: !12, size: 32, align: 32, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !61, file: !62, line: 262, baseType: !84, size: 64, align: 64, offset: 832)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !61, file: !62, line: 264, baseType: !12, size: 32, align: 32, offset: 896)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !61, file: !62, line: 268, baseType: !12, size: 32, align: 32, offset: 928)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !61, file: !62, line: 270, baseType: !90, size: 64, align: 64, offset: 960)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !9, line: 131, baseType: !91)
!91 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !61, file: !62, line: 274, baseType: !24, size: 16, align: 16, offset: 1024)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !61, file: !62, line: 275, baseType: !94, size: 8, align: 8, offset: 1040)
!94 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !61, file: !62, line: 276, baseType: !96, size: 8, align: 8, offset: 1048)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 8, align: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 1)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !61, file: !62, line: 280, baseType: !100, size: 64, align: 64, offset: 1088)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !62, line: 150, baseType: null)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !61, file: !62, line: 289, baseType: !103, size: 64, align: 64, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !9, line: 132, baseType: !91)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !61, file: !62, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !61, file: !62, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !61, file: !62, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !61, file: !62, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !61, file: !62, line: 302, baseType: !109, size: 64, align: 64, offset: 1472)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !110, line: 216, baseType: !111)
!110 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!111 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !61, file: !62, line: 303, baseType: !12, size: 32, align: 32, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !61, file: !62, line: 305, baseType: !114, size: 160, align: 8, offset: 1568)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 160, align: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 20)
!117 = distinct !DIGlobalVariable(name: "offset", scope: !0, file: !57, line: 99, type: !118, isLocal: false, isDefinition: true, variable: i16* @offset)
!118 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!119 = distinct !DIGlobalVariable(name: "npkt", scope: !0, file: !57, line: 100, type: !12, isLocal: false, isDefinition: true, variable: i32* @npkt)
!120 = distinct !DIGlobalVariable(name: "packet", scope: !0, file: !57, line: 101, type: !5, isLocal: false, isDefinition: true, variable: i8** @packet)
!121 = distinct !DIGlobalVariable(name: "buf", scope: !0, file: !57, line: 102, type: !5, isLocal: false, isDefinition: true, variable: i8** @buf)
!122 = distinct !DIGlobalVariable(name: "hdr", scope: !0, file: !57, line: 103, type: !123, isLocal: false, isDefinition: true, variable: %struct.pcap_pkthdr* @hdr)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_pkthdr", file: !124, line: 199, size: 192, align: 64, elements: !125)
!124 = !DIFile(filename: "/usr/local/include/pcap/pcap.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!125 = !{!126, !134, !139}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !123, file: !124, line: 200, baseType: !127, size: 128, align: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !128, line: 30, size: 128, align: 64, elements: !129)
!128 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!129 = !{!130, !132}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !127, file: !128, line: 32, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !9, line: 139, baseType: !91)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !127, file: !128, line: 33, baseType: !133, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !9, line: 141, baseType: !91)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "caplen", scope: !123, file: !124, line: 201, baseType: !135, size: 32, align: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "bpf_u_int32", file: !136, line: 85, baseType: !137)
!136 = !DIFile(filename: "/usr/local/include/pcap/bpf.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !7, line: 35, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !9, line: 32, baseType: !37)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !123, file: !124, line: 202, baseType: !135, size: 32, align: 32, offset: 160)
!140 = distinct !DIGlobalVariable(name: "descr", scope: !0, file: !57, line: 104, type: !141, isLocal: false, isDefinition: true, variable: %struct.pcap** @descr)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_t", file: !124, line: 118, baseType: !143)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap", file: !124, line: 118, flags: DIFlagFwdDecl)
!144 = distinct !DIGlobalVariable(name: "dumper", scope: !0, file: !57, line: 105, type: !145, isLocal: false, isDefinition: true, variable: %struct.pcap_dumper** @dumper)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_dumper_t", file: !124, line: 119, baseType: !147)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_dumper", file: !124, line: 119, flags: DIFlagFwdDecl)
!148 = distinct !DIGlobalVariable(name: "statistic", scope: !0, file: !57, line: 106, type: !149, isLocal: false, isDefinition: true, variable: %struct.pcap_stat* @statistic)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_stat", file: !124, line: 208, size: 96, align: 32, elements: !150)
!150 = !{!151, !152, !153}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ps_recv", scope: !149, file: !124, line: 209, baseType: !137, size: 32, align: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ps_drop", scope: !149, file: !124, line: 210, baseType: !137, size: 32, align: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ps_ifdrop", scope: !149, file: !124, line: 211, baseType: !137, size: 32, align: 32, offset: 64)
!154 = distinct !DIGlobalVariable(name: "maskp", scope: !0, file: !57, line: 107, type: !135, isLocal: false, isDefinition: true, variable: i32* @maskp)
!155 = distinct !DIGlobalVariable(name: "netp", scope: !0, file: !57, line: 108, type: !135, isLocal: false, isDefinition: true, variable: i32* @netp)
!156 = distinct !DIGlobalVariable(name: "datalink", scope: !0, file: !57, line: 109, type: !12, isLocal: false, isDefinition: true, variable: i32* @datalink)
!157 = distinct !DIGlobalVariable(name: "fp", scope: !0, file: !57, line: 110, type: !158, isLocal: false, isDefinition: true, variable: %struct.bpf_program* @fp)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_program", file: !136, line: 104, size: 128, align: 64, elements: !159)
!159 = !{!160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "bf_len", scope: !158, file: !136, line: 105, baseType: !137, size: 32, align: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "bf_insns", scope: !158, file: !136, line: 106, baseType: !162, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_insn", file: !136, line: 234, size: 64, align: 32, elements: !164)
!164 = !{!165, !168, !169, !170}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !163, file: !136, line: 235, baseType: !166, size: 16, align: 16)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !7, line: 34, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !9, line: 31, baseType: !24)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "jt", scope: !163, file: !136, line: 236, baseType: !6, size: 8, align: 8, offset: 16)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "jf", scope: !163, file: !136, line: 237, baseType: !6, size: 8, align: 8, offset: 24)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !163, file: !136, line: 238, baseType: !135, size: 32, align: 32, offset: 32)
!171 = distinct !DIGlobalVariable(name: "logname", scope: !0, file: !57, line: 111, type: !66, isLocal: false, isDefinition: true, variable: i8** @logname)
!172 = distinct !DIGlobalVariable(name: "tcpdl", scope: !0, file: !57, line: 112, type: !66, isLocal: false, isDefinition: true, variable: i8** @tcpdl)
!173 = distinct !DIGlobalVariable(name: "tr", scope: !0, file: !57, line: 113, type: !166, isLocal: false, isDefinition: true, variable: i16* @tr)
!174 = distinct !DIGlobalVariable(name: "tl", scope: !0, file: !57, line: 113, type: !166, isLocal: false, isDefinition: true, variable: i16* @tl)
!175 = distinct !DIGlobalVariable(name: "graph", scope: !0, file: !57, line: 114, type: !166, isLocal: false, isDefinition: true, variable: i16* @graph)
!176 = distinct !DIGlobalVariable(name: "cont", scope: !0, file: !57, line: 115, type: !166, isLocal: false, isDefinition: true, variable: i16* @cont)
!177 = distinct !DIGlobalVariable(name: "stream_glob", scope: !0, file: !57, line: 117, type: !12, isLocal: false, isDefinition: true, variable: i32* @stream_glob)
!178 = distinct !DIGlobalVariable(name: "bc_glob", scope: !0, file: !57, line: 118, type: !12, isLocal: false, isDefinition: true, variable: i32* @bc_glob)
!179 = distinct !DIGlobalVariable(name: "sniff_glob", scope: !0, file: !57, line: 119, type: !12, isLocal: false, isDefinition: true, variable: i32* @sniff_glob)
!180 = distinct !DIGlobalVariable(name: "rst_glob", scope: !0, file: !57, line: 120, type: !12, isLocal: false, isDefinition: true, variable: i32* @rst_glob)
!181 = distinct !DIGlobalVariable(name: "arp_glob", scope: !0, file: !57, line: 121, type: !12, isLocal: false, isDefinition: true, variable: i32* @arp_glob)
!182 = distinct !DIGlobalVariable(name: "pt", scope: !0, file: !57, line: 122, type: !183, isLocal: false, isDefinition: true, variable: [2 x i64]* @pt)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 128, align: 64, elements: !186)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !185, line: 60, baseType: !111)
!185 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!186 = !{!187}
!187 = !DISubrange(count: 2)
!188 = distinct !DIGlobalVariable(name: "lg", scope: !0, file: !57, line: 123, type: !12, isLocal: false, isDefinition: true, variable: i32* @lg)
!189 = distinct !DIGlobalVariable(name: "tm", scope: !0, file: !57, line: 132, type: !190, isLocal: false, isDefinition: true, variable: i64* @tm)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !191, line: 75, baseType: !131)
!191 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!192 = distinct !DIGlobalVariable(name: "timed", scope: !0, file: !57, line: 133, type: !193, isLocal: false, isDefinition: true, variable: [60 x i8]* @timed)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 480, align: 8, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 60)
!196 = distinct !DIGlobalVariable(name: "demonize", scope: !0, file: !57, line: 136, type: !166, isLocal: false, isDefinition: true, variable: i16* @demonize)
!197 = distinct !DIGlobalVariable(name: "line_s", scope: !0, file: !57, line: 138, type: !12, isLocal: false, isDefinition: true, variable: i32* @line_s)
!198 = distinct !DIGlobalVariable(name: "row_s", scope: !0, file: !57, line: 139, type: !12, isLocal: false, isDefinition: true, variable: i32* @row_s)
!199 = distinct !DIGlobalVariable(name: "stat_conn", scope: !0, file: !54, line: 36, type: !200, isLocal: false, isDefinition: true, variable: [100 x %struct.statistics]* @stat_conn)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 32000, align: 64, elements: !209)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statistics", file: !54, line: 27, size: 320, align: 64, elements: !202)
!202 = !{!203, !204, !205, !206, !207, !208}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "s_ip", scope: !201, file: !54, line: 29, baseType: !111, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "d_ip", scope: !201, file: !54, line: 30, baseType: !111, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "s_port", scope: !201, file: !54, line: 31, baseType: !24, size: 16, align: 16, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "d_port", scope: !201, file: !54, line: 32, baseType: !24, size: 16, align: 16, offset: 144)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !201, file: !54, line: 33, baseType: !11, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "lin", scope: !201, file: !54, line: 34, baseType: !12, size: 32, align: 32, offset: 256)
!209 = !{!210}
!210 = !DISubrange(count: 100)
!211 = distinct !DIGlobalVariable(name: "ptime", scope: !0, file: !54, line: 46, type: !111, isLocal: false, isDefinition: true, variable: i64* @ptime)
!212 = distinct !DIGlobalVariable(name: "partial", scope: !0, file: !54, line: 48, type: !11, isLocal: false, isDefinition: true, variable: double* @partial)
!213 = distinct !DIGlobalVariable(name: "begin", scope: !0, file: !54, line: 49, type: !190, isLocal: false, isDefinition: true, variable: i64* @begin)
!214 = !{i32 2, !"Dwarf Version", i32 4}
!215 = !{i32 2, !"Debug Info Version", i32 3}
!216 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!217 = distinct !DISubprogram(name: "run_bc", scope: !54, file: !54, line: 51, type: !218, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!218 = !DISubroutineType(types: !219)
!219 = !{!12, !66, !66}
!220 = !DILocalVariable(name: "dev", arg: 1, scope: !217, file: !54, line: 51, type: !66)
!221 = !DIExpression()
!222 = !DILocation(line: 51, column: 19, scope: !217)
!223 = !DILocalVariable(name: "filter", arg: 2, scope: !217, file: !54, line: 51, type: !66)
!224 = !DILocation(line: 51, column: 30, scope: !217)
!225 = !DILocalVariable(name: "ebuf", scope: !217, file: !54, line: 53, type: !226)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 2048, align: 8, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 256)
!229 = !DILocation(line: 53, column: 9, scope: !217)
!230 = !DILocation(line: 55, column: 9, scope: !231)
!231 = distinct !DILexicalBlock(scope: !217, file: !54, line: 55, column: 8)
!232 = !DILocation(line: 55, column: 8, scope: !217)
!233 = !DILocation(line: 57, column: 2, scope: !234)
!234 = distinct !DILexicalBlock(scope: !231, file: !54, line: 56, column: 6)
!235 = !DILocation(line: 58, column: 6, scope: !234)
!236 = !DILocation(line: 60, column: 8, scope: !237)
!237 = distinct !DILexicalBlock(scope: !217, file: !54, line: 60, column: 8)
!238 = !DILocation(line: 60, column: 8, scope: !217)
!239 = !DILocation(line: 61, column: 6, scope: !237)
!240 = !DILocation(line: 64, column: 8, scope: !241)
!241 = distinct !DILexicalBlock(scope: !217, file: !54, line: 64, column: 8)
!242 = !DILocation(line: 64, column: 8, scope: !217)
!243 = !DILocation(line: 65, column: 6, scope: !241)
!244 = !DILocation(line: 68, column: 9, scope: !217)
!245 = !DILocation(line: 70, column: 12, scope: !217)
!246 = !DILocation(line: 70, column: 10, scope: !217)
!247 = !DILocation(line: 73, column: 24, scope: !248)
!248 = distinct !DILexicalBlock(scope: !217, file: !54, line: 73, column: 8)
!249 = !DILocation(line: 73, column: 44, scope: !248)
!250 = !DILocation(line: 73, column: 9, scope: !248)
!251 = !DILocation(line: 73, column: 50, scope: !248)
!252 = !DILocation(line: 73, column: 8, scope: !217)
!253 = !DILocation(line: 75, column: 44, scope: !254)
!254 = distinct !DILexicalBlock(scope: !248, file: !54, line: 74, column: 6)
!255 = !DILocation(line: 75, column: 2, scope: !254)
!256 = !DILocation(line: 76, column: 6, scope: !254)
!257 = !DILocation(line: 77, column: 32, scope: !258)
!258 = distinct !DILexicalBlock(scope: !217, file: !54, line: 77, column: 8)
!259 = !DILocation(line: 77, column: 51, scope: !258)
!260 = !DILocation(line: 77, column: 17, scope: !258)
!261 = !DILocation(line: 77, column: 15, scope: !258)
!262 = !DILocation(line: 77, column: 57, scope: !258)
!263 = !DILocation(line: 77, column: 8, scope: !217)
!264 = !DILocation(line: 79, column: 45, scope: !265)
!265 = distinct !DILexicalBlock(scope: !258, file: !54, line: 78, column: 6)
!266 = !DILocation(line: 79, column: 2, scope: !265)
!267 = !DILocation(line: 80, column: 6, scope: !265)
!268 = !DILocation(line: 82, column: 24, scope: !269)
!269 = distinct !DILexicalBlock(scope: !217, file: !54, line: 82, column: 8)
