; ModuleID = './[inter]ncurses--n_scroll_win.o.i'
source_filename = "./[inter]ncurses--n_scroll_win.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.pcap_pkthdr = type { %struct.timeval, i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.pcap = type opaque
%struct.pcap_dumper = type opaque
%struct.pcap_stat = type { i32, i32, i32 }
%struct.bpf_program = type { i32, %struct.bpf_insn* }
%struct.bpf_insn = type { i16, i8, i8, i32 }
%struct._win_st = type { i16, i16, i16, i16, i16, i16, i16, i64, i64, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, %struct.ldat*, i16, i16, i32, i32, %struct._win_st*, %struct.pdat, i16 }
%struct.ldat = type opaque
%struct.pdat = type { i16, i16, i16, i16, i16, i16 }
%struct.scrolling_window = type { %struct._win_st*, %struct._win_st*, i32, i32, i32, i32, i32, i32, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !10)
!1 = !DIFile(filename: "[inter]ncurses--n_scroll_win.o.i", directory: "/home/lichi/Desktop/nast/[task]nast")
!2 = !{}
!3 = !{!4, !6, !8, !9}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "attr_t", file: !5, line: 374, baseType: !6)
!5 = !DIFile(filename: "/usr/include/curses.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "chtype", file: !5, line: 164, baseType: !7)
!7 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!8 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!10 = !{!11, !74, !76, !77, !82, !83, !102, !106, !111, !117, !118, !119, !120, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !151, !152, !155, !159, !160, !161, !162, !205, !206, !207, !221, !222, !223, !224, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !317, !318, !322, !323, !324, !325, !326, !330, !345, !355, !361, !374, !390}
!11 = distinct !DIGlobalVariable(name: "logd", scope: !0, file: !12, line: 98, type: !13, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @logd)
!12 = !DIFile(filename: "ncurses/../include/nast.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !15, line: 48, baseType: !16)
!15 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !17, line: 241, size: 1728, align: 64, elements: !18)
!17 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!18 = !{!19, !21, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !42, !43, !44, !45, !49, !51, !53, !57, !60, !62, !63, !64, !65, !66, !69, !70}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !16, file: !17, line: 242, baseType: !20, size: 32, align: 32)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !16, file: !17, line: 247, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !16, file: !17, line: 248, baseType: !22, size: 64, align: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !16, file: !17, line: 249, baseType: !22, size: 64, align: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !16, file: !17, line: 250, baseType: !22, size: 64, align: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !16, file: !17, line: 251, baseType: !22, size: 64, align: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !16, file: !17, line: 252, baseType: !22, size: 64, align: 64, offset: 384)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !16, file: !17, line: 253, baseType: !22, size: 64, align: 64, offset: 448)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !16, file: !17, line: 254, baseType: !22, size: 64, align: 64, offset: 512)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !16, file: !17, line: 256, baseType: !22, size: 64, align: 64, offset: 576)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !16, file: !17, line: 257, baseType: !22, size: 64, align: 64, offset: 640)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !16, file: !17, line: 258, baseType: !22, size: 64, align: 64, offset: 704)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !16, file: !17, line: 260, baseType: !35, size: 64, align: 64, offset: 768)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !17, line: 156, size: 192, align: 64, elements: !37)
!37 = !{!38, !39, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !36, file: !17, line: 157, baseType: !35, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !36, file: !17, line: 158, baseType: !40, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !36, file: !17, line: 162, baseType: !20, size: 32, align: 32, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !16, file: !17, line: 262, baseType: !40, size: 64, align: 64, offset: 832)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !16, file: !17, line: 264, baseType: !20, size: 32, align: 32, offset: 896)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !16, file: !17, line: 268, baseType: !20, size: 32, align: 32, offset: 928)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !16, file: !17, line: 270, baseType: !46, size: 64, align: 64, offset: 960)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !47, line: 131, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!48 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !16, file: !17, line: 274, baseType: !50, size: 16, align: 16, offset: 1024)
!50 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !16, file: !17, line: 275, baseType: !52, size: 8, align: 8, offset: 1040)
!52 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !16, file: !17, line: 276, baseType: !54, size: 8, align: 8, offset: 1048)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, align: 8, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 1)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !16, file: !17, line: 280, baseType: !58, size: 64, align: 64, offset: 1088)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !17, line: 150, baseType: null)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !16, file: !17, line: 289, baseType: !61, size: 64, align: 64, offset: 1152)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !47, line: 132, baseType: !48)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !16, file: !17, line: 297, baseType: !9, size: 64, align: 64, offset: 1216)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !16, file: !17, line: 298, baseType: !9, size: 64, align: 64, offset: 1280)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !16, file: !17, line: 299, baseType: !9, size: 64, align: 64, offset: 1344)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !16, file: !17, line: 300, baseType: !9, size: 64, align: 64, offset: 1408)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !16, file: !17, line: 302, baseType: !67, size: 64, align: 64, offset: 1472)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !68, line: 216, baseType: !7)
!68 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !16, file: !17, line: 303, baseType: !20, size: 32, align: 32, offset: 1536)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !16, file: !17, line: 305, baseType: !71, size: 160, align: 8, offset: 1568)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, align: 8, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 20)
!74 = distinct !DIGlobalVariable(name: "offset", scope: !0, file: !12, line: 99, type: !75, isLocal: false, isDefinition: true, variable: i16* @offset)
!75 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!76 = distinct !DIGlobalVariable(name: "npkt", scope: !0, file: !12, line: 100, type: !20, isLocal: false, isDefinition: true, variable: i32* @npkt)
!77 = distinct !DIGlobalVariable(name: "packet", scope: !0, file: !12, line: 101, type: !78, isLocal: false, isDefinition: true, variable: i8** @packet)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !80, line: 33, baseType: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !47, line: 30, baseType: !8)
!82 = distinct !DIGlobalVariable(name: "buf", scope: !0, file: !12, line: 102, type: !78, isLocal: false, isDefinition: true, variable: i8** @buf)
!83 = distinct !DIGlobalVariable(name: "hdr", scope: !0, file: !12, line: 103, type: !84, isLocal: false, isDefinition: true, variable: %struct.pcap_pkthdr* @hdr)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_pkthdr", file: !85, line: 199, size: 192, align: 64, elements: !86)
!85 = !DIFile(filename: "/usr/local/include/pcap/pcap.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!86 = !{!87, !95, !101}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !84, file: !85, line: 200, baseType: !88, size: 128, align: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !89, line: 30, size: 128, align: 64, elements: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!90 = !{!91, !93}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !88, file: !89, line: 32, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !47, line: 139, baseType: !48)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !88, file: !89, line: 33, baseType: !94, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !47, line: 141, baseType: !48)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "caplen", scope: !84, file: !85, line: 201, baseType: !96, size: 32, align: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "bpf_u_int32", file: !97, line: 85, baseType: !98)
!97 = !DIFile(filename: "/usr/local/include/pcap/bpf.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !80, line: 35, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !47, line: 32, baseType: !100)
!100 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !84, file: !85, line: 202, baseType: !96, size: 32, align: 32, offset: 160)
!102 = distinct !DIGlobalVariable(name: "descr", scope: !0, file: !12, line: 104, type: !103, isLocal: false, isDefinition: true, variable: %struct.pcap** @descr)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_t", file: !85, line: 118, baseType: !105)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap", file: !85, line: 118, flags: DIFlagFwdDecl)
!106 = distinct !DIGlobalVariable(name: "dumper", scope: !0, file: !107, line: 113, type: !108, isLocal: false, isDefinition: true, variable: %struct.pcap_dumper** @dumper)
!107 = !DIFile(filename: "ncurses/n_nast.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_dumper_t", file: !85, line: 119, baseType: !110)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_dumper", file: !85, line: 119, flags: DIFlagFwdDecl)
!111 = distinct !DIGlobalVariable(name: "statistic", scope: !0, file: !12, line: 106, type: !112, isLocal: false, isDefinition: true, variable: %struct.pcap_stat* @statistic)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_stat", file: !85, line: 208, size: 96, align: 32, elements: !113)
!113 = !{!114, !115, !116}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ps_recv", scope: !112, file: !85, line: 209, baseType: !98, size: 32, align: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ps_drop", scope: !112, file: !85, line: 210, baseType: !98, size: 32, align: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ps_ifdrop", scope: !112, file: !85, line: 211, baseType: !98, size: 32, align: 32, offset: 64)
!117 = distinct !DIGlobalVariable(name: "maskp", scope: !0, file: !12, line: 107, type: !96, isLocal: false, isDefinition: true, variable: i32* @maskp)
!118 = distinct !DIGlobalVariable(name: "netp", scope: !0, file: !12, line: 108, type: !96, isLocal: false, isDefinition: true, variable: i32* @netp)
!119 = distinct !DIGlobalVariable(name: "datalink", scope: !0, file: !12, line: 109, type: !20, isLocal: false, isDefinition: true, variable: i32* @datalink)
!120 = distinct !DIGlobalVariable(name: "fp", scope: !0, file: !12, line: 110, type: !121, isLocal: false, isDefinition: true, variable: %struct.bpf_program* @fp)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_program", file: !97, line: 104, size: 128, align: 64, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "bf_len", scope: !121, file: !97, line: 105, baseType: !98, size: 32, align: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "bf_insns", scope: !121, file: !97, line: 106, baseType: !125, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_insn", file: !97, line: 234, size: 64, align: 32, elements: !127)
!127 = !{!128, !131, !132, !133}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !126, file: !97, line: 235, baseType: !129, size: 16, align: 16)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !80, line: 34, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !47, line: 31, baseType: !50)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "jt", scope: !126, file: !97, line: 236, baseType: !79, size: 8, align: 8, offset: 16)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "jf", scope: !126, file: !97, line: 237, baseType: !79, size: 8, align: 8, offset: 24)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !126, file: !97, line: 238, baseType: !96, size: 32, align: 32, offset: 32)
!134 = distinct !DIGlobalVariable(name: "logname", scope: !0, file: !12, line: 111, type: !22, isLocal: false, isDefinition: true, variable: i8** @logname)
!135 = distinct !DIGlobalVariable(name: "tcpdl", scope: !0, file: !12, line: 112, type: !22, isLocal: false, isDefinition: true, variable: i8** @tcpdl)
!136 = distinct !DIGlobalVariable(name: "tr", scope: !0, file: !12, line: 113, type: !129, isLocal: false, isDefinition: true, variable: i16* @tr)
!137 = distinct !DIGlobalVariable(name: "tl", scope: !0, file: !12, line: 113, type: !129, isLocal: false, isDefinition: true, variable: i16* @tl)
!138 = distinct !DIGlobalVariable(name: "graph", scope: !0, file: !12, line: 114, type: !129, isLocal: false, isDefinition: true, variable: i16* @graph)
!139 = distinct !DIGlobalVariable(name: "cont", scope: !0, file: !12, line: 115, type: !129, isLocal: false, isDefinition: true, variable: i16* @cont)
!140 = distinct !DIGlobalVariable(name: "stream_glob", scope: !0, file: !12, line: 117, type: !20, isLocal: false, isDefinition: true, variable: i32* @stream_glob)
!141 = distinct !DIGlobalVariable(name: "bc_glob", scope: !0, file: !12, line: 118, type: !20, isLocal: false, isDefinition: true, variable: i32* @bc_glob)
!142 = distinct !DIGlobalVariable(name: "sniff_glob", scope: !0, file: !12, line: 119, type: !20, isLocal: false, isDefinition: true, variable: i32* @sniff_glob)
!143 = distinct !DIGlobalVariable(name: "rst_glob", scope: !0, file: !12, line: 120, type: !20, isLocal: false, isDefinition: true, variable: i32* @rst_glob)
!144 = distinct !DIGlobalVariable(name: "arp_glob", scope: !0, file: !12, line: 121, type: !20, isLocal: false, isDefinition: true, variable: i32* @arp_glob)
!145 = distinct !DIGlobalVariable(name: "pt", scope: !0, file: !12, line: 122, type: !146, isLocal: false, isDefinition: true, variable: [2 x i64]* @pt)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 128, align: 64, elements: !149)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !148, line: 60, baseType: !7)
!148 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!149 = !{!150}
!150 = !DISubrange(count: 2)
!151 = distinct !DIGlobalVariable(name: "lg", scope: !0, file: !12, line: 123, type: !20, isLocal: false, isDefinition: true, variable: i32* @lg)
!152 = distinct !DIGlobalVariable(name: "tm", scope: !0, file: !12, line: 132, type: !153, isLocal: false, isDefinition: true, variable: i64* @tm)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !154, line: 75, baseType: !92)
!154 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!155 = distinct !DIGlobalVariable(name: "timed", scope: !0, file: !12, line: 133, type: !156, isLocal: false, isDefinition: true, variable: [60 x i8]* @timed)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 480, align: 8, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 60)
!159 = distinct !DIGlobalVariable(name: "demonize", scope: !0, file: !12, line: 136, type: !129, isLocal: false, isDefinition: true, variable: i16* @demonize)
!160 = distinct !DIGlobalVariable(name: "line_s", scope: !0, file: !12, line: 138, type: !20, isLocal: false, isDefinition: true, variable: i32* @line_s)
!161 = distinct !DIGlobalVariable(name: "row_s", scope: !0, file: !12, line: 139, type: !20, isLocal: false, isDefinition: true, variable: i32* @row_s)
!162 = distinct !DIGlobalVariable(name: "query", scope: !0, file: !107, line: 87, type: !163, isLocal: false, isDefinition: true, variable: %struct._win_st** @query)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW", file: !5, line: 372, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_win_st", file: !5, line: 421, size: 768, align: 64, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !190, !191, !192, !193, !194, !195, !204}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_cury", scope: !165, file: !5, line: 423, baseType: !75, size: 16, align: 16)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_curx", scope: !165, file: !5, line: 423, baseType: !75, size: 16, align: 16, offset: 16)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_maxy", scope: !165, file: !5, line: 426, baseType: !75, size: 16, align: 16, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_maxx", scope: !165, file: !5, line: 426, baseType: !75, size: 16, align: 16, offset: 48)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_begy", scope: !165, file: !5, line: 427, baseType: !75, size: 16, align: 16, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_begx", scope: !165, file: !5, line: 427, baseType: !75, size: 16, align: 16, offset: 80)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !165, file: !5, line: 429, baseType: !75, size: 16, align: 16, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_attrs", scope: !165, file: !5, line: 432, baseType: !4, size: 64, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_bkgd", scope: !165, file: !5, line: 433, baseType: !6, size: 64, align: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_notimeout", scope: !165, file: !5, line: 436, baseType: !177, size: 8, align: 8, offset: 256)
!177 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_clear", scope: !165, file: !5, line: 437, baseType: !177, size: 8, align: 8, offset: 264)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_leaveok", scope: !165, file: !5, line: 438, baseType: !177, size: 8, align: 8, offset: 272)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_scroll", scope: !165, file: !5, line: 439, baseType: !177, size: 8, align: 8, offset: 280)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_idlok", scope: !165, file: !5, line: 440, baseType: !177, size: 8, align: 8, offset: 288)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_idcok", scope: !165, file: !5, line: 441, baseType: !177, size: 8, align: 8, offset: 296)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_immed", scope: !165, file: !5, line: 442, baseType: !177, size: 8, align: 8, offset: 304)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_sync", scope: !165, file: !5, line: 443, baseType: !177, size: 8, align: 8, offset: 312)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_use_keypad", scope: !165, file: !5, line: 444, baseType: !177, size: 8, align: 8, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_delay", scope: !165, file: !5, line: 445, baseType: !20, size: 32, align: 32, offset: 352)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_line", scope: !165, file: !5, line: 447, baseType: !188, size: 64, align: 64, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldat", file: !5, line: 419, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_regtop", scope: !165, file: !5, line: 450, baseType: !75, size: 16, align: 16, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_regbottom", scope: !165, file: !5, line: 451, baseType: !75, size: 16, align: 16, offset: 464)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_parx", scope: !165, file: !5, line: 454, baseType: !20, size: 32, align: 32, offset: 480)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_pary", scope: !165, file: !5, line: 455, baseType: !20, size: 32, align: 32, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_parent", scope: !165, file: !5, line: 456, baseType: !163, size: 64, align: 64, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !165, file: !5, line: 464, baseType: !196, size: 96, align: 16, offset: 640)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pdat", file: !5, line: 459, size: 96, align: 16, elements: !197)
!197 = !{!198, !199, !200, !201, !202, !203}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_y", scope: !196, file: !5, line: 461, baseType: !75, size: 16, align: 16)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_x", scope: !196, file: !5, line: 461, baseType: !75, size: 16, align: 16, offset: 16)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_top", scope: !196, file: !5, line: 462, baseType: !75, size: 16, align: 16, offset: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_left", scope: !196, file: !5, line: 462, baseType: !75, size: 16, align: 16, offset: 48)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_bottom", scope: !196, file: !5, line: 463, baseType: !75, size: 16, align: 16, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_right", scope: !196, file: !5, line: 463, baseType: !75, size: 16, align: 16, offset: 80)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_yoffset", scope: !165, file: !5, line: 466, baseType: !75, size: 16, align: 16, offset: 736)
!205 = distinct !DIGlobalVariable(name: "werror", scope: !0, file: !107, line: 88, type: !163, isLocal: false, isDefinition: true, variable: %struct._win_st** @werror)
!206 = distinct !DIGlobalVariable(name: "help", scope: !0, file: !107, line: 89, type: !163, isLocal: false, isDefinition: true, variable: %struct._win_st** @help)
!207 = distinct !DIGlobalVariable(name: "princ", scope: !0, file: !107, line: 90, type: !208, isLocal: false, isDefinition: true, variable: %struct.scrolling_window** @princ)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "N_SCROLLWIN", file: !107, line: 61, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "scrolling_window", file: !107, line: 49, size: 384, align: 64, elements: !211)
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !210, file: !107, line: 51, baseType: !163, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !210, file: !107, line: 52, baseType: !163, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "y_scroll", scope: !210, file: !107, line: 53, baseType: !20, size: 32, align: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "y_max", scope: !210, file: !107, line: 54, baseType: !20, size: 32, align: 32, offset: 160)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !210, file: !107, line: 55, baseType: !20, size: 32, align: 32, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "cols", scope: !210, file: !107, line: 56, baseType: !20, size: 32, align: 32, offset: 224)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !210, file: !107, line: 57, baseType: !20, size: 32, align: 32, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !210, file: !107, line: 58, baseType: !20, size: 32, align: 32, offset: 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !210, file: !107, line: 59, baseType: !22, size: 64, align: 64, offset: 320)
!221 = distinct !DIGlobalVariable(name: "winfo", scope: !0, file: !107, line: 91, type: !208, isLocal: false, isDefinition: true, variable: %struct.scrolling_window** @winfo)
!222 = distinct !DIGlobalVariable(name: "wstream", scope: !0, file: !107, line: 92, type: !208, isLocal: false, isDefinition: true, variable: %struct.scrolling_window** @wstream)
!223 = distinct !DIGlobalVariable(name: "wconn", scope: !0, file: !107, line: 93, type: !208, isLocal: false, isDefinition: true, variable: %struct.scrolling_window** @wconn)
!224 = distinct !DIGlobalVariable(name: "my_nmenu", scope: !0, file: !107, line: 95, type: !225, isLocal: false, isDefinition: true, variable: %struct.tagMENU** @my_nmenu)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "MENU", file: !227, line: 132, baseType: !228)
!227 = !DIFile(filename: "/usr/include/menu.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tagMENU", file: !227, line: 90, size: 1600, align: 64, elements: !229)
!229 = !{!230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !279, !280, !281, !282, !283, !284, !285, !286, !291, !292, !293, !294, !295, !296, !298}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !228, file: !227, line: 92, baseType: !75, size: 16, align: 16)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !228, file: !227, line: 93, baseType: !75, size: 16, align: 16, offset: 16)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !228, file: !227, line: 94, baseType: !75, size: 16, align: 16, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "cols", scope: !228, file: !227, line: 95, baseType: !75, size: 16, align: 16, offset: 48)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "frows", scope: !228, file: !227, line: 96, baseType: !75, size: 16, align: 16, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "fcols", scope: !228, file: !227, line: 97, baseType: !75, size: 16, align: 16, offset: 80)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "arows", scope: !228, file: !227, line: 98, baseType: !75, size: 16, align: 16, offset: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "namelen", scope: !228, file: !227, line: 99, baseType: !75, size: 16, align: 16, offset: 112)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "desclen", scope: !228, file: !227, line: 100, baseType: !75, size: 16, align: 16, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "marklen", scope: !228, file: !227, line: 101, baseType: !75, size: 16, align: 16, offset: 144)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "itemlen", scope: !228, file: !227, line: 102, baseType: !75, size: 16, align: 16, offset: 160)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "spc_desc", scope: !228, file: !227, line: 103, baseType: !75, size: 16, align: 16, offset: 176)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "spc_cols", scope: !228, file: !227, line: 104, baseType: !75, size: 16, align: 16, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "spc_rows", scope: !228, file: !227, line: 105, baseType: !75, size: 16, align: 16, offset: 208)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !228, file: !227, line: 106, baseType: !22, size: 64, align: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pindex", scope: !228, file: !227, line: 107, baseType: !75, size: 16, align: 16, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !228, file: !227, line: 108, baseType: !163, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !228, file: !227, line: 109, baseType: !163, size: 64, align: 64, offset: 448)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "userwin", scope: !228, file: !227, line: 110, baseType: !163, size: 64, align: 64, offset: 512)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "usersub", scope: !228, file: !227, line: 111, baseType: !163, size: 64, align: 64, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !228, file: !227, line: 112, baseType: !251, size: 64, align: 64, offset: 640)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "ITEM", file: !227, line: 86, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tagITEM", file: !227, line: 69, size: 768, align: 64, elements: !255)
!255 = !{!256, !264, !265, !267, !268, !270, !271, !272, !273, !274, !276, !277, !278}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !254, file: !227, line: 71, baseType: !257, size: 128, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT", file: !227, line: 67, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 63, size: 128, align: 64, elements: !259)
!259 = !{!260, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !258, file: !227, line: 65, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !258, file: !227, line: 66, baseType: !50, size: 16, align: 16, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !254, file: !227, line: 72, baseType: !257, size: 128, align: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "imenu", scope: !254, file: !227, line: 73, baseType: !266, size: 64, align: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "userptr", scope: !254, file: !227, line: 74, baseType: !9, size: 64, align: 64, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !254, file: !227, line: 75, baseType: !269, size: 32, align: 32, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "Item_Options", file: !227, line: 50, baseType: !20)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !254, file: !227, line: 76, baseType: !75, size: 16, align: 16, offset: 416)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !254, file: !227, line: 77, baseType: !75, size: 16, align: 16, offset: 432)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !254, file: !227, line: 78, baseType: !75, size: 16, align: 16, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !254, file: !227, line: 79, baseType: !177, size: 8, align: 8, offset: 464)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !254, file: !227, line: 81, baseType: !275, size: 64, align: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !254, file: !227, line: 82, baseType: !275, size: 64, align: 64, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !254, file: !227, line: 83, baseType: !275, size: 64, align: 64, offset: 640)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !254, file: !227, line: 84, baseType: !275, size: 64, align: 64, offset: 704)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "nitems", scope: !228, file: !227, line: 113, baseType: !75, size: 16, align: 16, offset: 704)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "curitem", scope: !228, file: !227, line: 114, baseType: !252, size: 64, align: 64, offset: 768)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "toprow", scope: !228, file: !227, line: 115, baseType: !75, size: 16, align: 16, offset: 832)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "fore", scope: !228, file: !227, line: 116, baseType: !6, size: 64, align: 64, offset: 896)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !228, file: !227, line: 117, baseType: !6, size: 64, align: 64, offset: 960)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "grey", scope: !228, file: !227, line: 118, baseType: !6, size: 64, align: 64, offset: 1024)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !228, file: !227, line: 119, baseType: !8, size: 8, align: 8, offset: 1088)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "menuinit", scope: !228, file: !227, line: 121, baseType: !287, size: 64, align: 64, offset: 1152)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "Menu_Hook", file: !227, line: 88, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !266}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "menuterm", scope: !228, file: !227, line: 122, baseType: !287, size: 64, align: 64, offset: 1216)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "iteminit", scope: !228, file: !227, line: 123, baseType: !287, size: 64, align: 64, offset: 1280)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "itemterm", scope: !228, file: !227, line: 124, baseType: !287, size: 64, align: 64, offset: 1344)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "userptr", scope: !228, file: !227, line: 126, baseType: !9, size: 64, align: 64, offset: 1408)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !228, file: !227, line: 127, baseType: !22, size: 64, align: 64, offset: 1472)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !228, file: !227, line: 129, baseType: !297, size: 32, align: 32, offset: 1536)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "Menu_Options", file: !227, line: 49, baseType: !20)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !228, file: !227, line: 130, baseType: !50, size: 16, align: 16, offset: 1568)
!299 = distinct !DIGlobalVariable(name: "curr_item", scope: !0, file: !107, line: 96, type: !252, isLocal: false, isDefinition: true, variable: %struct.tagITEM** @curr_item)
!300 = distinct !DIGlobalVariable(name: "my_nmenu_win", scope: !0, file: !107, line: 97, type: !163, isLocal: false, isDefinition: true, variable: %struct._win_st** @my_nmenu_win)
!301 = distinct !DIGlobalVariable(name: "pop_up", scope: !0, file: !107, line: 98, type: !163, isLocal: false, isDefinition: true, variable: %struct._win_st** @pop_up)
!302 = distinct !DIGlobalVariable(name: "mvar", scope: !0, file: !107, line: 100, type: !129, isLocal: false, isDefinition: true, variable: i16* @mvar)
!303 = distinct !DIGlobalVariable(name: "promisc", scope: !0, file: !107, line: 101, type: !129, isLocal: false, isDefinition: true, variable: i16* @promisc)
!304 = distinct !DIGlobalVariable(name: "hex", scope: !0, file: !107, line: 101, type: !129, isLocal: false, isDefinition: true, variable: i16* @hex)
!305 = distinct !DIGlobalVariable(name: "ascii", scope: !0, file: !107, line: 101, type: !129, isLocal: false, isDefinition: true, variable: i16* @ascii)
!306 = distinct !DIGlobalVariable(name: "ld", scope: !0, file: !107, line: 101, type: !129, isLocal: false, isDefinition: true, variable: i16* @ld)
!307 = distinct !DIGlobalVariable(name: "f", scope: !0, file: !107, line: 101, type: !129, isLocal: false, isDefinition: true, variable: i16* @f)
!308 = distinct !DIGlobalVariable(name: "lr", scope: !0, file: !107, line: 101, type: !129, isLocal: false, isDefinition: true, variable: i16* @lr)
!309 = distinct !DIGlobalVariable(name: "l", scope: !0, file: !107, line: 101, type: !129, isLocal: false, isDefinition: true, variable: i16* @l)
!310 = distinct !DIGlobalVariable(name: "flg", scope: !0, file: !107, line: 102, type: !129, isLocal: false, isDefinition: true, variable: i16* @flg)
!311 = distinct !DIGlobalVariable(name: "linm", scope: !0, file: !107, line: 103, type: !20, isLocal: false, isDefinition: true, variable: i32* @linm)
!312 = distinct !DIGlobalVariable(name: "fileds", scope: !0, file: !107, line: 104, type: !20, isLocal: false, isDefinition: true, variable: i32* @fileds)
!313 = distinct !DIGlobalVariable(name: "dev", scope: !0, file: !107, line: 105, type: !314, isLocal: false, isDefinition: true, variable: [10 x i8]* @dev)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 80, align: 8, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 10)
!317 = distinct !DIGlobalVariable(name: "n_filter", scope: !0, file: !107, line: 106, type: !156, isLocal: false, isDefinition: true, variable: [60 x i8]* @n_filter)
!318 = distinct !DIGlobalVariable(name: "ldfile", scope: !0, file: !107, line: 107, type: !319, isLocal: false, isDefinition: true, variable: [50 x i8]* @ldfile)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 400, align: 8, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 50)
!322 = distinct !DIGlobalVariable(name: "tcpdfile", scope: !0, file: !107, line: 108, type: !319, isLocal: false, isDefinition: true, variable: [50 x i8]* @tcpdfile)
!323 = distinct !DIGlobalVariable(name: "reportl", scope: !0, file: !107, line: 109, type: !319, isLocal: false, isDefinition: true, variable: [50 x i8]* @reportl)
!324 = distinct !DIGlobalVariable(name: "logfile", scope: !0, file: !107, line: 110, type: !319, isLocal: false, isDefinition: true, variable: [50 x i8]* @logfile)
!325 = distinct !DIGlobalVariable(name: "str", scope: !0, file: !107, line: 112, type: !103, isLocal: false, isDefinition: true, variable: %struct.pcap** @str)
!326 = distinct !DIGlobalVariable(name: "thID", scope: !0, file: !107, line: 116, type: !327, isLocal: false, isDefinition: true, variable: [6 x i64]* @thID)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 384, align: 64, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 6)
!330 = distinct !DIGlobalVariable(name: "th_data", scope: !0, file: !107, line: 144, type: !331, isLocal: false, isDefinition: true, variable: [1 x %struct.thread_conn]* @th_data)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 448, align: 64, elements: !55)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_conn", file: !107, line: 118, size: 448, align: 64, elements: !333)
!333 = !{!334, !338, !341, !342, !343, !344}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !332, file: !107, line: 120, baseType: !335, size: 240, align: 8)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 240, align: 8, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 30)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ip_src", scope: !332, file: !107, line: 121, baseType: !339, size: 64, align: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_long", file: !80, line: 36, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_long", file: !47, line: 33, baseType: !7)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ip_dst", scope: !332, file: !107, line: 122, baseType: !339, size: 64, align: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !332, file: !107, line: 123, baseType: !129, size: 16, align: 16, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !332, file: !107, line: 124, baseType: !129, size: 16, align: 16, offset: 400)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !332, file: !107, line: 125, baseType: !20, size: 32, align: 32, offset: 416)
!345 = distinct !DIGlobalVariable(name: "th_r_data", scope: !0, file: !107, line: 145, type: !346, isLocal: false, isDefinition: true, variable: [1 x %struct.thread_conn_rst]* @th_r_data)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 448, align: 64, elements: !55)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_conn_rst", file: !107, line: 134, size: 448, align: 64, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !347, file: !107, line: 136, baseType: !335, size: 240, align: 8)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ip_src", scope: !347, file: !107, line: 137, baseType: !339, size: 64, align: 64, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ip_dst", scope: !347, file: !107, line: 138, baseType: !339, size: 64, align: 64, offset: 320)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !347, file: !107, line: 139, baseType: !129, size: 16, align: 16, offset: 384)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !347, file: !107, line: 140, baseType: !129, size: 16, align: 16, offset: 400)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !347, file: !107, line: 141, baseType: !20, size: 32, align: 32, offset: 416)
!355 = distinct !DIGlobalVariable(name: "th_arp_data", scope: !0, file: !107, line: 146, type: !356, isLocal: false, isDefinition: true, variable: [1 x %struct.thread_arp]* @th_arp_data)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 288, align: 32, elements: !55)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_arp", file: !107, line: 128, size: 288, align: 32, elements: !358)
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !357, file: !107, line: 130, baseType: !335, size: 240, align: 8)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "lr", scope: !357, file: !107, line: 131, baseType: !20, size: 32, align: 32, offset: 256)
!361 = distinct !DIGlobalVariable(name: "c_inf", scope: !0, file: !107, line: 161, type: !362, isLocal: false, isDefinition: true, variable: [30 x %struct.connections]* @c_inf)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 13440, align: 64, elements: !336)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "connections", file: !107, line: 148, size: 448, align: 64, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "s_ip", scope: !363, file: !107, line: 150, baseType: !7, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "d_ip", scope: !363, file: !107, line: 151, baseType: !7, size: 64, align: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "s_port", scope: !363, file: !107, line: 152, baseType: !50, size: 16, align: 16, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "d_port", scope: !363, file: !107, line: 153, baseType: !50, size: 16, align: 16, offset: 144)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !363, file: !107, line: 154, baseType: !339, size: 64, align: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !363, file: !107, line: 155, baseType: !339, size: 64, align: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "lin", scope: !363, file: !107, line: 156, baseType: !20, size: 32, align: 32, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pr", scope: !363, file: !107, line: 157, baseType: !20, size: 32, align: 32, offset: 352)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !363, file: !107, line: 158, baseType: !20, size: 32, align: 32, offset: 384)
!374 = distinct !DIGlobalVariable(name: "sf", scope: !0, file: !107, line: 177, type: !375, isLocal: false, isDefinition: true, variable: [30 x %struct.cnn]* @sf)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 105600, align: 64, elements: !336)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cnn", file: !107, line: 164, size: 3520, align: 64, elements: !377)
!377 = !{!378, !382, !383, !384, !385, !386, !387, !388, !389}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !376, file: !107, line: 166, baseType: !379, size: 1600, align: 8)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1600, align: 8, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 200)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sfilter", scope: !376, file: !107, line: 168, baseType: !379, size: 1600, align: 8, offset: 1600)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !376, file: !107, line: 169, baseType: !339, size: 64, align: 64, offset: 3200)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !376, file: !107, line: 170, baseType: !339, size: 64, align: 64, offset: 3264)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ip_src", scope: !376, file: !107, line: 171, baseType: !339, size: 64, align: 64, offset: 3328)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ip_dst", scope: !376, file: !107, line: 172, baseType: !339, size: 64, align: 64, offset: 3392)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "s_port", scope: !376, file: !107, line: 173, baseType: !129, size: 16, align: 16, offset: 3456)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "d_port", scope: !376, file: !107, line: 174, baseType: !129, size: 16, align: 16, offset: 3472)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !376, file: !107, line: 175, baseType: !20, size: 32, align: 32, offset: 3488)
!390 = distinct !DIGlobalVariable(name: "nmax", scope: !0, file: !107, line: 180, type: !20, isLocal: false, isDefinition: true, variable: i32* @nmax)
!391 = !{i32 2, !"Dwarf Version", i32 4}
!392 = !{i32 2, !"Debug Info Version", i32 3}
!393 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!394 = distinct !DISubprogram(name: "newscrollwin", scope: !395, file: !395, line: 24, type: !396, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!395 = !DIFile(filename: "ncurses/n_scroll_win.c", directory: "/home/lichi/Desktop/nast/[task]nast")
!396 = !DISubroutineType(types: !397)
!397 = !{!208, !20, !20, !20, !20, !22, !20}
!398 = !DILocalVariable(name: "lines", arg: 1, scope: !394, file: !395, line: 24, type: !20)
!399 = !DIExpression()
!400 = !DILocation(line: 24, column: 31, scope: !394)
!401 = !DILocalVariable(name: "cols", arg: 2, scope: !394, file: !395, line: 24, type: !20)
!402 = !DILocation(line: 24, column: 42, scope: !394)
!403 = !DILocalVariable(name: "y", arg: 3, scope: !394, file: !395, line: 24, type: !20)
!404 = !DILocation(line: 24, column: 52, scope: !394)
!405 = !DILocalVariable(name: "x", arg: 4, scope: !394, file: !395, line: 24, type: !20)
!406 = !DILocation(line: 24, column: 59, scope: !394)
!407 = !DILocalVariable(name: "title", arg: 5, scope: !394, file: !395, line: 24, type: !22)
!408 = !DILocation(line: 24, column: 68, scope: !394)
!409 = !DILocalVariable(name: "maxlines", arg: 6, scope: !394, file: !395, line: 24, type: !20)
!410 = !DILocation(line: 24, column: 79, scope: !394)
!411 = !DILocalVariable(name: "win", scope: !394, file: !395, line: 26, type: !208)
!412 = !DILocation(line: 26, column: 17, scope: !394)
!413 = !DILocation(line: 28, column: 10, scope: !394)
!414 = !DILocation(line: 28, column: 8, scope: !394)
!415 = !DILocation(line: 30, column: 22, scope: !394)
!416 = !DILocation(line: 30, column: 32, scope: !394)
!417 = !DILocation(line: 30, column: 37, scope: !394)
!418 = !DILocation(line: 30, column: 15, scope: !394)
!419 = !DILocation(line: 30, column: 4, scope: !394)
!420 = !DILocation(line: 30, column: 9, scope: !394)
!421 = !DILocation(line: 30, column: 13, scope: !394)
!422 = !DILocation(line: 31, column: 22, scope: !394)
!423 = !DILocation(line: 31, column: 29, scope: !394)
!424 = !DILocation(line: 31, column: 35, scope: !394)
!425 = !DILocation(line: 31, column: 38, scope: !394)
!426 = !DILocation(line: 31, column: 15, scope: !394)
!427 = !DILocation(line: 31, column: 4, scope: !394)
!428 = !DILocation(line: 31, column: 9, scope: !394)
!429 = !DILocation(line: 31, column: 13, scope: !394)
!430 = !DILocation(line: 32, column: 17, scope: !394)
!431 = !DILocation(line: 32, column: 4, scope: !394)
!432 = !DILocation(line: 32, column: 9, scope: !394)
!433 = !DILocation(line: 32, column: 15, scope: !394)
!434 = !DILocation(line: 33, column: 17, scope: !394)
!435 = !DILocation(line: 33, column: 4, scope: !394)
!436 = !DILocation(line: 33, column: 9, scope: !394)
!437 = !DILocation(line: 33, column: 15, scope: !394)
!438 = !DILocation(line: 34, column: 16, scope: !394)
!439 = !DILocation(line: 34, column: 4, scope: !394)
!440 = !DILocation(line: 34, column: 9, scope: !394)
!441 = !DILocation(line: 34, column: 14, scope: !394)
!442 = !DILocation(line: 35, column: 13, scope: !394)
!443 = !DILocation(line: 35, column: 4, scope: !394)
!444 = !DILocation(line: 35, column: 9, scope: !394)
!445 = !DILocation(line: 35, column: 11, scope: !394)
!446 = !DILocation(line: 36, column: 13, scope: !394)
!447 = !DILocation(line: 36, column: 4, scope: !394)
!448 = !DILocation(line: 36, column: 9, scope: !394)
!449 = !DILocation(line: 36, column: 11, scope: !394)
!450 = !DILocation(line: 37, column: 24, scope: !394)
!451 = !DILocation(line: 37, column: 17, scope: !394)
