; ModuleID = './[inter]stream.o.i'
source_filename = "./[inter]stream.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.pcap = type opaque
%struct.pcap_pkthdr = type { %struct.timeval, i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.pcap_dumper = type opaque
%struct.pcap_stat = type { i32, i32, i32 }
%struct.bpf_program = type { i32, %struct.bpf_insn* }
%struct.bpf_insn = type { i16, i8, i8, i32 }
%struct.libnet_ipv4_hdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %struct.in_addr, %struct.in_addr }
%struct.in_addr = type { i32 }
%struct.libnet_tcp_hdr = type { i16, i16, i32, i32, i8, i8, i16, i16, i16 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@.str = private unnamed_addr constant [32 x i8] c"Running and logging to file...\0A\00", align 1
@.str.1 = private unnamed_addr constant [18 x i8] c"NAST TCP Stream\0A\0A\00", align 1
@logd = common global %struct._IO_FILE* null, align 8
@tm = common global i64 0, align 8
@timed = common global [60 x i8] zeroinitializer, align 16
@.str.2 = private unnamed_addr constant [9 x i8] c"%b %d %T\00", align 1
@descr = common global %struct.pcap* null, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !32, globals: !80)
!1 = !DIFile(filename: "[inter]stream.o.i", directory: "/home/lichi/Desktop/nast/[task]nast")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 40, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!6 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!7 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!8 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!9 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!10 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!11 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!12 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!13 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!14 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!15 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!16 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!17 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!18 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!19 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!20 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!21 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!22 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!23 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!24 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!25 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!26 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!27 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!28 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!29 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!30 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!31 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!32 = !{!33, !34, !40, !65, !78}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !36, line: 33, baseType: !37)
!36 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !38, line: 30, baseType: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!39 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_ipv4_hdr", file: !42, line: 666, size: 160, align: 32, elements: !43)
!42 = !DIFile(filename: "/usr/local/include/libnet/libnet-headers.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!43 = !{!44, !47, !48, !49, !52, !53, !54, !55, !56, !57, !64}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ip_hl", scope: !41, file: !42, line: 669, baseType: !45, size: 4, align: 8, flags: DIFlagBitField, extraData: i64 0)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !46, line: 48, baseType: !39)
!46 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ip_v", scope: !41, file: !42, line: 670, baseType: !45, size: 4, align: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ip_tos", scope: !41, file: !42, line: 676, baseType: !45, size: 8, align: 8, offset: 8)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ip_len", scope: !41, file: !42, line: 689, baseType: !50, size: 16, align: 16, offset: 16)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !46, line: 49, baseType: !51)
!51 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !41, file: !42, line: 690, baseType: !50, size: 16, align: 16, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ip_off", scope: !41, file: !42, line: 691, baseType: !50, size: 16, align: 16, offset: 48)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl", scope: !41, file: !42, line: 704, baseType: !45, size: 8, align: 8, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ip_p", scope: !41, file: !42, line: 705, baseType: !45, size: 8, align: 8, offset: 72)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ip_sum", scope: !41, file: !42, line: 706, baseType: !50, size: 16, align: 16, offset: 80)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ip_src", scope: !41, file: !42, line: 707, baseType: !58, size: 32, align: 32, offset: 96)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !4, line: 31, size: 32, align: 32, elements: !59)
!59 = !{!60}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !58, file: !4, line: 33, baseType: !61, size: 32, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !4, line: 30, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !46, line: 51, baseType: !63)
!63 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ip_dst", scope: !41, file: !42, line: 707, baseType: !58, size: 32, align: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_tcp_hdr", file: !42, line: 1653, size: 160, align: 32, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "th_sport", scope: !66, file: !42, line: 1655, baseType: !50, size: 16, align: 16)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "th_dport", scope: !66, file: !42, line: 1656, baseType: !50, size: 16, align: 16, offset: 16)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "th_seq", scope: !66, file: !42, line: 1657, baseType: !62, size: 32, align: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "th_ack", scope: !66, file: !42, line: 1658, baseType: !62, size: 32, align: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "th_x2", scope: !66, file: !42, line: 1660, baseType: !45, size: 4, align: 8, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "th_off", scope: !66, file: !42, line: 1661, baseType: !45, size: 4, align: 8, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "th_flags", scope: !66, file: !42, line: 1667, baseType: !45, size: 8, align: 8, offset: 104)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "th_win", scope: !66, file: !42, line: 1692, baseType: !50, size: 16, align: 16, offset: 112)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "th_sum", scope: !66, file: !42, line: 1693, baseType: !50, size: 16, align: 16, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "th_urp", scope: !66, file: !42, line: 1694, baseType: !50, size: 16, align: 16, offset: 144)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !{!81, !141, !143, !144, !145, !146, !164, !168, !172, !178, !179, !180, !181, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !212, !213, !216, !220, !221, !222}
!81 = distinct !DIGlobalVariable(name: "logd", scope: !0, file: !82, line: 98, type: !83, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @logd)
!82 = !DIFile(filename: "include/nast.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !85, line: 48, baseType: !86)
!85 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !87, line: 241, size: 1728, align: 64, elements: !88)
!87 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!88 = !{!89, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !110, !111, !112, !113, !116, !117, !119, !123, !126, !128, !129, !130, !131, !132, !136, !137}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !86, file: !87, line: 242, baseType: !90, size: 32, align: 32)
!90 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !86, file: !87, line: 247, baseType: !78, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !86, file: !87, line: 248, baseType: !78, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !86, file: !87, line: 249, baseType: !78, size: 64, align: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !86, file: !87, line: 250, baseType: !78, size: 64, align: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !86, file: !87, line: 251, baseType: !78, size: 64, align: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !86, file: !87, line: 252, baseType: !78, size: 64, align: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !86, file: !87, line: 253, baseType: !78, size: 64, align: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !86, file: !87, line: 254, baseType: !78, size: 64, align: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !86, file: !87, line: 256, baseType: !78, size: 64, align: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !86, file: !87, line: 257, baseType: !78, size: 64, align: 64, offset: 640)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !86, file: !87, line: 258, baseType: !78, size: 64, align: 64, offset: 704)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !86, file: !87, line: 260, baseType: !103, size: 64, align: 64, offset: 768)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !87, line: 156, size: 192, align: 64, elements: !105)
!105 = !{!106, !107, !109}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !104, file: !87, line: 157, baseType: !103, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !104, file: !87, line: 158, baseType: !108, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !104, file: !87, line: 162, baseType: !90, size: 32, align: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !86, file: !87, line: 262, baseType: !108, size: 64, align: 64, offset: 832)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !86, file: !87, line: 264, baseType: !90, size: 32, align: 32, offset: 896)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !86, file: !87, line: 268, baseType: !90, size: 32, align: 32, offset: 928)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !86, file: !87, line: 270, baseType: !114, size: 64, align: 64, offset: 960)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !38, line: 131, baseType: !115)
!115 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !86, file: !87, line: 274, baseType: !51, size: 16, align: 16, offset: 1024)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !86, file: !87, line: 275, baseType: !118, size: 8, align: 8, offset: 1040)
!118 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !86, file: !87, line: 276, baseType: !120, size: 8, align: 8, offset: 1048)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 8, align: 8, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 1)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !86, file: !87, line: 280, baseType: !124, size: 64, align: 64, offset: 1088)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !87, line: 150, baseType: null)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !86, file: !87, line: 289, baseType: !127, size: 64, align: 64, offset: 1152)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !38, line: 132, baseType: !115)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !86, file: !87, line: 297, baseType: !33, size: 64, align: 64, offset: 1216)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !86, file: !87, line: 298, baseType: !33, size: 64, align: 64, offset: 1280)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !86, file: !87, line: 299, baseType: !33, size: 64, align: 64, offset: 1344)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !86, file: !87, line: 300, baseType: !33, size: 64, align: 64, offset: 1408)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !86, file: !87, line: 302, baseType: !133, size: 64, align: 64, offset: 1472)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !134, line: 216, baseType: !135)
!134 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!135 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !86, file: !87, line: 303, baseType: !90, size: 32, align: 32, offset: 1536)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !86, file: !87, line: 305, baseType: !138, size: 160, align: 8, offset: 1568)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 160, align: 8, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 20)
!141 = distinct !DIGlobalVariable(name: "offset", scope: !0, file: !82, line: 99, type: !142, isLocal: false, isDefinition: true, variable: i16* @offset)
!142 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!143 = distinct !DIGlobalVariable(name: "npkt", scope: !0, file: !82, line: 100, type: !90, isLocal: false, isDefinition: true, variable: i32* @npkt)
!144 = distinct !DIGlobalVariable(name: "packet", scope: !0, file: !82, line: 101, type: !34, isLocal: false, isDefinition: true, variable: i8** @packet)
!145 = distinct !DIGlobalVariable(name: "buf", scope: !0, file: !82, line: 102, type: !34, isLocal: false, isDefinition: true, variable: i8** @buf)
!146 = distinct !DIGlobalVariable(name: "hdr", scope: !0, file: !82, line: 103, type: !147, isLocal: false, isDefinition: true, variable: %struct.pcap_pkthdr* @hdr)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_pkthdr", file: !148, line: 199, size: 192, align: 64, elements: !149)
!148 = !DIFile(filename: "/usr/local/include/pcap/pcap.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!149 = !{!150, !158, !163}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !147, file: !148, line: 200, baseType: !151, size: 128, align: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !152, line: 30, size: 128, align: 64, elements: !153)
!152 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!153 = !{!154, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !151, file: !152, line: 32, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !38, line: 139, baseType: !115)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !151, file: !152, line: 33, baseType: !157, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !38, line: 141, baseType: !115)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "caplen", scope: !147, file: !148, line: 201, baseType: !159, size: 32, align: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "bpf_u_int32", file: !160, line: 85, baseType: !161)
!160 = !DIFile(filename: "/usr/local/include/pcap/bpf.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !36, line: 35, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !38, line: 32, baseType: !63)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !147, file: !148, line: 202, baseType: !159, size: 32, align: 32, offset: 160)
!164 = distinct !DIGlobalVariable(name: "descr", scope: !0, file: !82, line: 104, type: !165, isLocal: false, isDefinition: true, variable: %struct.pcap** @descr)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_t", file: !148, line: 118, baseType: !167)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap", file: !148, line: 118, flags: DIFlagFwdDecl)
!168 = distinct !DIGlobalVariable(name: "dumper", scope: !0, file: !82, line: 105, type: !169, isLocal: false, isDefinition: true, variable: %struct.pcap_dumper** @dumper)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_dumper_t", file: !148, line: 119, baseType: !171)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_dumper", file: !148, line: 119, flags: DIFlagFwdDecl)
!172 = distinct !DIGlobalVariable(name: "statistic", scope: !0, file: !82, line: 106, type: !173, isLocal: false, isDefinition: true, variable: %struct.pcap_stat* @statistic)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_stat", file: !148, line: 208, size: 96, align: 32, elements: !174)
!174 = !{!175, !176, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ps_recv", scope: !173, file: !148, line: 209, baseType: !161, size: 32, align: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ps_drop", scope: !173, file: !148, line: 210, baseType: !161, size: 32, align: 32, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ps_ifdrop", scope: !173, file: !148, line: 211, baseType: !161, size: 32, align: 32, offset: 64)
!178 = distinct !DIGlobalVariable(name: "maskp", scope: !0, file: !82, line: 107, type: !159, isLocal: false, isDefinition: true, variable: i32* @maskp)
!179 = distinct !DIGlobalVariable(name: "netp", scope: !0, file: !82, line: 108, type: !159, isLocal: false, isDefinition: true, variable: i32* @netp)
!180 = distinct !DIGlobalVariable(name: "datalink", scope: !0, file: !82, line: 109, type: !90, isLocal: false, isDefinition: true, variable: i32* @datalink)
!181 = distinct !DIGlobalVariable(name: "fp", scope: !0, file: !82, line: 110, type: !182, isLocal: false, isDefinition: true, variable: %struct.bpf_program* @fp)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_program", file: !160, line: 104, size: 128, align: 64, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "bf_len", scope: !182, file: !160, line: 105, baseType: !161, size: 32, align: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "bf_insns", scope: !182, file: !160, line: 106, baseType: !186, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_insn", file: !160, line: 234, size: 64, align: 32, elements: !188)
!188 = !{!189, !192, !193, !194}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !187, file: !160, line: 235, baseType: !190, size: 16, align: 16)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !36, line: 34, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !38, line: 31, baseType: !51)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "jt", scope: !187, file: !160, line: 236, baseType: !35, size: 8, align: 8, offset: 16)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "jf", scope: !187, file: !160, line: 237, baseType: !35, size: 8, align: 8, offset: 24)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !187, file: !160, line: 238, baseType: !159, size: 32, align: 32, offset: 32)
!195 = distinct !DIGlobalVariable(name: "logname", scope: !0, file: !82, line: 111, type: !78, isLocal: false, isDefinition: true, variable: i8** @logname)
!196 = distinct !DIGlobalVariable(name: "tcpdl", scope: !0, file: !82, line: 112, type: !78, isLocal: false, isDefinition: true, variable: i8** @tcpdl)
!197 = distinct !DIGlobalVariable(name: "tr", scope: !0, file: !82, line: 113, type: !190, isLocal: false, isDefinition: true, variable: i16* @tr)
!198 = distinct !DIGlobalVariable(name: "tl", scope: !0, file: !82, line: 113, type: !190, isLocal: false, isDefinition: true, variable: i16* @tl)
!199 = distinct !DIGlobalVariable(name: "graph", scope: !0, file: !82, line: 114, type: !190, isLocal: false, isDefinition: true, variable: i16* @graph)
!200 = distinct !DIGlobalVariable(name: "cont", scope: !0, file: !82, line: 115, type: !190, isLocal: false, isDefinition: true, variable: i16* @cont)
!201 = distinct !DIGlobalVariable(name: "stream_glob", scope: !0, file: !82, line: 117, type: !90, isLocal: false, isDefinition: true, variable: i32* @stream_glob)
!202 = distinct !DIGlobalVariable(name: "bc_glob", scope: !0, file: !82, line: 118, type: !90, isLocal: false, isDefinition: true, variable: i32* @bc_glob)
!203 = distinct !DIGlobalVariable(name: "sniff_glob", scope: !0, file: !82, line: 119, type: !90, isLocal: false, isDefinition: true, variable: i32* @sniff_glob)
!204 = distinct !DIGlobalVariable(name: "rst_glob", scope: !0, file: !82, line: 120, type: !90, isLocal: false, isDefinition: true, variable: i32* @rst_glob)
!205 = distinct !DIGlobalVariable(name: "arp_glob", scope: !0, file: !82, line: 121, type: !90, isLocal: false, isDefinition: true, variable: i32* @arp_glob)
!206 = distinct !DIGlobalVariable(name: "pt", scope: !0, file: !82, line: 122, type: !207, isLocal: false, isDefinition: true, variable: [2 x i64]* @pt)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 128, align: 64, elements: !210)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !209, line: 60, baseType: !135)
!209 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!210 = !{!211}
!211 = !DISubrange(count: 2)
!212 = distinct !DIGlobalVariable(name: "lg", scope: !0, file: !82, line: 123, type: !90, isLocal: false, isDefinition: true, variable: i32* @lg)
!213 = distinct !DIGlobalVariable(name: "tm", scope: !0, file: !82, line: 132, type: !214, isLocal: false, isDefinition: true, variable: i64* @tm)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !215, line: 75, baseType: !155)
!215 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!216 = distinct !DIGlobalVariable(name: "timed", scope: !0, file: !82, line: 133, type: !217, isLocal: false, isDefinition: true, variable: [60 x i8]* @timed)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 480, align: 8, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 60)
!220 = distinct !DIGlobalVariable(name: "demonize", scope: !0, file: !82, line: 136, type: !190, isLocal: false, isDefinition: true, variable: i16* @demonize)
!221 = distinct !DIGlobalVariable(name: "line_s", scope: !0, file: !82, line: 138, type: !90, isLocal: false, isDefinition: true, variable: i32* @line_s)
!222 = distinct !DIGlobalVariable(name: "row_s", scope: !0, file: !82, line: 139, type: !90, isLocal: false, isDefinition: true, variable: i32* @row_s)
!223 = !{i32 2, !"Dwarf Version", i32 4}
!224 = !{i32 2, !"Debug Info Version", i32 3}
!225 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!226 = distinct !DISubprogram(name: "stream", scope: !227, file: !227, line: 24, type: !228, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !232)
