; ModuleID = './[inter]tcp.o.i'
source_filename = "./[inter]tcp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.pcap_pkthdr = type { %struct.timeval, i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.pcap = type opaque
%struct.pcap_dumper = type opaque
%struct.pcap_stat = type { i32, i32, i32 }
%struct.bpf_program = type { i32, %struct.bpf_insn* }
%struct.bpf_insn = type { i16, i8, i8, i32 }
%struct.libnet_ipv4_hdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %struct.in_addr, %struct.in_addr }
%struct.in_addr = type { i32 }
%struct.libnet_tcp_hdr = type { i16, i16, i32, i32, i8, i8, i16, i16, i16 }
%struct.servent = type { i8*, i8**, i32, i8* }

@buf = common global i8* null, align 8
@packet = common global i8* null, align 8
@offset = common global i16 0, align 2
@.str = private unnamed_addr constant [6 x i8] c"princ\00", align 1
@line_s = common global i32 0, align 4
@row_s = common global i32 0, align 4
@lg = common global i32 0, align 4
@.str.1 = private unnamed_addr constant [72 x i8] c"\0A---[ TCP ]-----------------------------------------------------------\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !46)
!1 = !DIFile(filename: "[inter]tcp.o.i", directory: "/home/lichi/Desktop/nast/[task]nast")
!2 = !{}
!3 = !{!4, !31, !44}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_ipv4_hdr", file: !6, line: 666, size: 160, align: 32, elements: !7)
!6 = !DIFile(filename: "/usr/local/include/libnet/libnet-headers.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!7 = !{!8, !12, !13, !14, !17, !18, !19, !20, !21, !22, !30}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "ip_hl", scope: !5, file: !6, line: 669, baseType: !9, size: 4, align: 8, flags: DIFlagBitField, extraData: i64 0)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !10, line: 48, baseType: !11)
!10 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!11 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "ip_v", scope: !5, file: !6, line: 670, baseType: !9, size: 4, align: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "ip_tos", scope: !5, file: !6, line: 676, baseType: !9, size: 8, align: 8, offset: 8)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "ip_len", scope: !5, file: !6, line: 689, baseType: !15, size: 16, align: 16, offset: 16)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !10, line: 49, baseType: !16)
!16 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !5, file: !6, line: 690, baseType: !15, size: 16, align: 16, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ip_off", scope: !5, file: !6, line: 691, baseType: !15, size: 16, align: 16, offset: 48)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl", scope: !5, file: !6, line: 704, baseType: !9, size: 8, align: 8, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ip_p", scope: !5, file: !6, line: 705, baseType: !9, size: 8, align: 8, offset: 72)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ip_sum", scope: !5, file: !6, line: 706, baseType: !15, size: 16, align: 16, offset: 80)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ip_src", scope: !5, file: !6, line: 707, baseType: !23, size: 32, align: 32, offset: 96)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !24, line: 31, size: 32, align: 32, elements: !25)
!24 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!25 = !{!26}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !23, file: !24, line: 33, baseType: !27, size: 32, align: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !24, line: 30, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !10, line: 51, baseType: !29)
!29 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ip_dst", scope: !5, file: !6, line: 707, baseType: !23, size: 32, align: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_tcp_hdr", file: !6, line: 1653, size: 160, align: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "th_sport", scope: !32, file: !6, line: 1655, baseType: !15, size: 16, align: 16)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "th_dport", scope: !32, file: !6, line: 1656, baseType: !15, size: 16, align: 16, offset: 16)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "th_seq", scope: !32, file: !6, line: 1657, baseType: !28, size: 32, align: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "th_ack", scope: !32, file: !6, line: 1658, baseType: !28, size: 32, align: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "th_x2", scope: !32, file: !6, line: 1660, baseType: !9, size: 4, align: 8, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "th_off", scope: !32, file: !6, line: 1661, baseType: !9, size: 4, align: 8, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "th_flags", scope: !32, file: !6, line: 1667, baseType: !9, size: 8, align: 8, offset: 104)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "th_win", scope: !32, file: !6, line: 1692, baseType: !15, size: 16, align: 16, offset: 112)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "th_sum", scope: !32, file: !6, line: 1693, baseType: !15, size: 16, align: 16, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "th_urp", scope: !32, file: !6, line: 1694, baseType: !15, size: 16, align: 16, offset: 144)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!46 = !{!47, !109, !111, !112, !117, !118, !136, !140, !144, !150, !151, !152, !153, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !184, !185, !188, !192, !193, !194}
!47 = distinct !DIGlobalVariable(name: "logd", scope: !0, file: !48, line: 98, type: !49, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @logd)
!48 = !DIFile(filename: "include/nast.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !51, line: 48, baseType: !52)
!51 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 241, size: 1728, align: 64, elements: !54)
!53 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!54 = !{!55, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !76, !77, !78, !79, !83, !84, !86, !90, !93, !95, !97, !98, !99, !100, !104, !105}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !52, file: !53, line: 242, baseType: !56, size: 32, align: 32)
!56 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !52, file: !53, line: 247, baseType: !44, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !52, file: !53, line: 248, baseType: !44, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !52, file: !53, line: 249, baseType: !44, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !52, file: !53, line: 250, baseType: !44, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !52, file: !53, line: 251, baseType: !44, size: 64, align: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !52, file: !53, line: 252, baseType: !44, size: 64, align: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !52, file: !53, line: 253, baseType: !44, size: 64, align: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !52, file: !53, line: 254, baseType: !44, size: 64, align: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !52, file: !53, line: 256, baseType: !44, size: 64, align: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !52, file: !53, line: 257, baseType: !44, size: 64, align: 64, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !52, file: !53, line: 258, baseType: !44, size: 64, align: 64, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !52, file: !53, line: 260, baseType: !69, size: 64, align: 64, offset: 768)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !53, line: 156, size: 192, align: 64, elements: !71)
!71 = !{!72, !73, !75}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !70, file: !53, line: 157, baseType: !69, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !70, file: !53, line: 158, baseType: !74, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !70, file: !53, line: 162, baseType: !56, size: 32, align: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !52, file: !53, line: 262, baseType: !74, size: 64, align: 64, offset: 832)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !52, file: !53, line: 264, baseType: !56, size: 32, align: 32, offset: 896)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !52, file: !53, line: 268, baseType: !56, size: 32, align: 32, offset: 928)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !52, file: !53, line: 270, baseType: !80, size: 64, align: 64, offset: 960)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !81, line: 131, baseType: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!82 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !52, file: !53, line: 274, baseType: !16, size: 16, align: 16, offset: 1024)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !52, file: !53, line: 275, baseType: !85, size: 8, align: 8, offset: 1040)
!85 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !52, file: !53, line: 276, baseType: !87, size: 8, align: 8, offset: 1048)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !52, file: !53, line: 280, baseType: !91, size: 64, align: 64, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !53, line: 150, baseType: null)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !52, file: !53, line: 289, baseType: !94, size: 64, align: 64, offset: 1152)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !81, line: 132, baseType: !82)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !52, file: !53, line: 297, baseType: !96, size: 64, align: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !52, file: !53, line: 298, baseType: !96, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !52, file: !53, line: 299, baseType: !96, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !52, file: !53, line: 300, baseType: !96, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !52, file: !53, line: 302, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 216, baseType: !103)
!102 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !52, file: !53, line: 303, baseType: !56, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !52, file: !53, line: 305, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = distinct !DIGlobalVariable(name: "offset", scope: !0, file: !48, line: 99, type: !110, isLocal: false, isDefinition: true, variable: i16* @offset)
!110 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!111 = distinct !DIGlobalVariable(name: "npkt", scope: !0, file: !48, line: 100, type: !56, isLocal: false, isDefinition: true, variable: i32* @npkt)
!112 = distinct !DIGlobalVariable(name: "packet", scope: !0, file: !48, line: 101, type: !113, isLocal: false, isDefinition: true, variable: i8** @packet)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !115, line: 33, baseType: !116)
!115 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !81, line: 30, baseType: !11)
!117 = distinct !DIGlobalVariable(name: "buf", scope: !0, file: !48, line: 102, type: !113, isLocal: false, isDefinition: true, variable: i8** @buf)
!118 = distinct !DIGlobalVariable(name: "hdr", scope: !0, file: !48, line: 103, type: !119, isLocal: false, isDefinition: true, variable: %struct.pcap_pkthdr* @hdr)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_pkthdr", file: !120, line: 199, size: 192, align: 64, elements: !121)
!120 = !DIFile(filename: "/usr/local/include/pcap/pcap.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!121 = !{!122, !130, !135}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !119, file: !120, line: 200, baseType: !123, size: 128, align: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !124, line: 30, size: 128, align: 64, elements: !125)
!124 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!125 = !{!126, !128}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !123, file: !124, line: 32, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !81, line: 139, baseType: !82)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !123, file: !124, line: 33, baseType: !129, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !81, line: 141, baseType: !82)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "caplen", scope: !119, file: !120, line: 201, baseType: !131, size: 32, align: 32, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "bpf_u_int32", file: !132, line: 85, baseType: !133)
!132 = !DIFile(filename: "/usr/local/include/pcap/bpf.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !115, line: 35, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !81, line: 32, baseType: !29)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !119, file: !120, line: 202, baseType: !131, size: 32, align: 32, offset: 160)
!136 = distinct !DIGlobalVariable(name: "descr", scope: !0, file: !48, line: 104, type: !137, isLocal: false, isDefinition: true, variable: %struct.pcap** @descr)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_t", file: !120, line: 118, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap", file: !120, line: 118, flags: DIFlagFwdDecl)
!140 = distinct !DIGlobalVariable(name: "dumper", scope: !0, file: !48, line: 105, type: !141, isLocal: false, isDefinition: true, variable: %struct.pcap_dumper** @dumper)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_dumper_t", file: !120, line: 119, baseType: !143)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_dumper", file: !120, line: 119, flags: DIFlagFwdDecl)
!144 = distinct !DIGlobalVariable(name: "statistic", scope: !0, file: !48, line: 106, type: !145, isLocal: false, isDefinition: true, variable: %struct.pcap_stat* @statistic)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_stat", file: !120, line: 208, size: 96, align: 32, elements: !146)
!146 = !{!147, !148, !149}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ps_recv", scope: !145, file: !120, line: 209, baseType: !133, size: 32, align: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ps_drop", scope: !145, file: !120, line: 210, baseType: !133, size: 32, align: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ps_ifdrop", scope: !145, file: !120, line: 211, baseType: !133, size: 32, align: 32, offset: 64)
!150 = distinct !DIGlobalVariable(name: "maskp", scope: !0, file: !48, line: 107, type: !131, isLocal: false, isDefinition: true, variable: i32* @maskp)
!151 = distinct !DIGlobalVariable(name: "netp", scope: !0, file: !48, line: 108, type: !131, isLocal: false, isDefinition: true, variable: i32* @netp)
!152 = distinct !DIGlobalVariable(name: "datalink", scope: !0, file: !48, line: 109, type: !56, isLocal: false, isDefinition: true, variable: i32* @datalink)
!153 = distinct !DIGlobalVariable(name: "fp", scope: !0, file: !48, line: 110, type: !154, isLocal: false, isDefinition: true, variable: %struct.bpf_program* @fp)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_program", file: !132, line: 104, size: 128, align: 64, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "bf_len", scope: !154, file: !132, line: 105, baseType: !133, size: 32, align: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bf_insns", scope: !154, file: !132, line: 106, baseType: !158, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_insn", file: !132, line: 234, size: 64, align: 32, elements: !160)
!160 = !{!161, !164, !165, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !159, file: !132, line: 235, baseType: !162, size: 16, align: 16)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !115, line: 34, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !81, line: 31, baseType: !16)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "jt", scope: !159, file: !132, line: 236, baseType: !114, size: 8, align: 8, offset: 16)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "jf", scope: !159, file: !132, line: 237, baseType: !114, size: 8, align: 8, offset: 24)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !159, file: !132, line: 238, baseType: !131, size: 32, align: 32, offset: 32)
!167 = distinct !DIGlobalVariable(name: "logname", scope: !0, file: !48, line: 111, type: !44, isLocal: false, isDefinition: true, variable: i8** @logname)
!168 = distinct !DIGlobalVariable(name: "tcpdl", scope: !0, file: !48, line: 112, type: !44, isLocal: false, isDefinition: true, variable: i8** @tcpdl)
!169 = distinct !DIGlobalVariable(name: "tr", scope: !0, file: !48, line: 113, type: !162, isLocal: false, isDefinition: true, variable: i16* @tr)
!170 = distinct !DIGlobalVariable(name: "tl", scope: !0, file: !48, line: 113, type: !162, isLocal: false, isDefinition: true, variable: i16* @tl)
!171 = distinct !DIGlobalVariable(name: "graph", scope: !0, file: !48, line: 114, type: !162, isLocal: false, isDefinition: true, variable: i16* @graph)
!172 = distinct !DIGlobalVariable(name: "cont", scope: !0, file: !48, line: 115, type: !162, isLocal: false, isDefinition: true, variable: i16* @cont)
!173 = distinct !DIGlobalVariable(name: "stream_glob", scope: !0, file: !48, line: 117, type: !56, isLocal: false, isDefinition: true, variable: i32* @stream_glob)
!174 = distinct !DIGlobalVariable(name: "bc_glob", scope: !0, file: !48, line: 118, type: !56, isLocal: false, isDefinition: true, variable: i32* @bc_glob)
!175 = distinct !DIGlobalVariable(name: "sniff_glob", scope: !0, file: !48, line: 119, type: !56, isLocal: false, isDefinition: true, variable: i32* @sniff_glob)
!176 = distinct !DIGlobalVariable(name: "rst_glob", scope: !0, file: !48, line: 120, type: !56, isLocal: false, isDefinition: true, variable: i32* @rst_glob)
!177 = distinct !DIGlobalVariable(name: "arp_glob", scope: !0, file: !48, line: 121, type: !56, isLocal: false, isDefinition: true, variable: i32* @arp_glob)
!178 = distinct !DIGlobalVariable(name: "pt", scope: !0, file: !48, line: 122, type: !179, isLocal: false, isDefinition: true, variable: [2 x i64]* @pt)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 128, align: 64, elements: !182)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !181, line: 60, baseType: !103)
!181 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!182 = !{!183}
!183 = !DISubrange(count: 2)
!184 = distinct !DIGlobalVariable(name: "lg", scope: !0, file: !48, line: 123, type: !56, isLocal: false, isDefinition: true, variable: i32* @lg)
!185 = distinct !DIGlobalVariable(name: "tm", scope: !0, file: !48, line: 132, type: !186, isLocal: false, isDefinition: true, variable: i64* @tm)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !187, line: 75, baseType: !127)
!187 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!188 = distinct !DIGlobalVariable(name: "timed", scope: !0, file: !48, line: 133, type: !189, isLocal: false, isDefinition: true, variable: [60 x i8]* @timed)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 480, align: 8, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 60)
!192 = distinct !DIGlobalVariable(name: "demonize", scope: !0, file: !48, line: 136, type: !162, isLocal: false, isDefinition: true, variable: i16* @demonize)
!193 = distinct !DIGlobalVariable(name: "line_s", scope: !0, file: !48, line: 138, type: !56, isLocal: false, isDefinition: true, variable: i32* @line_s)
!194 = distinct !DIGlobalVariable(name: "row_s", scope: !0, file: !48, line: 139, type: !56, isLocal: false, isDefinition: true, variable: i32* @row_s)
!195 = !{i32 2, !"Dwarf Version", i32 4}
!196 = !{i32 2, !"Debug Info Version", i32 3}
!197 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!198 = distinct !DISubprogram(name: "handle_TCP", scope: !199, file: !199, line: 23, type: !200, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!199 = !DIFile(filename: "tcp.c", directory: "/home/lichi/Desktop/nast/[task]nast")
!200 = !DISubroutineType(types: !201)
!201 = !{null, !162, !162, !49, !49}
!202 = !DILocalVariable(name: "d", arg: 1, scope: !198, file: !199, line: 23, type: !162)
!203 = !DIExpression()
!204 = !DILocation(line: 23, column: 26, scope: !198)
!205 = !DILocalVariable(name: "x", arg: 2, scope: !198, file: !199, line: 23, type: !162)
!206 = !DILocation(line: 23, column: 37, scope: !198)
!207 = !DILocalVariable(name: "output", arg: 3, scope: !198, file: !199, line: 23, type: !49)
!208 = !DILocation(line: 23, column: 46, scope: !198)
!209 = !DILocalVariable(name: "ldd", arg: 4, scope: !198, file: !199, line: 23, type: !49)
!210 = !DILocation(line: 23, column: 60, scope: !198)
!211 = !DILocalVariable(name: "ip", scope: !198, file: !199, line: 25, type: !4)
!212 = !DILocation(line: 25, column: 28, scope: !198)
!213 = !DILocalVariable(name: "tcp", scope: !198, file: !199, line: 26, type: !31)
!214 = !DILocation(line: 26, column: 27, scope: !198)
!215 = !DILocalVariable(name: "service", scope: !198, file: !199, line: 27, type: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "servent", file: !218, line: 257, size: 256, align: 64, elements: !219)
!218 = !DIFile(filename: "/usr/include/netdb.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!219 = !{!220, !221, !223, !224}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "s_name", scope: !217, file: !218, line: 259, baseType: !44, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "s_aliases", scope: !217, file: !218, line: 260, baseType: !222, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "s_port", scope: !217, file: !218, line: 261, baseType: !56, size: 32, align: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "s_proto", scope: !217, file: !218, line: 262, baseType: !44, size: 64, align: 64, offset: 192)
!225 = !DILocation(line: 27, column: 20, scope: !198)
!226 = !DILocalVariable(name: "flags", scope: !198, file: !199, line: 28, type: !114)
!227 = !DILocation(line: 28, column: 11, scope: !198)
!228 = !DILocalVariable(name: "size_ip", scope: !198, file: !199, line: 29, type: !162)
!229 = !DILocation(line: 29, column: 12, scope: !198)
!230 = !DILocalVariable(name: "size_tcp", scope: !198, file: !199, line: 29, type: !162)
!231 = !DILocation(line: 29, column: 21, scope: !198)
!232 = !DILocalVariable(name: "size_buf", scope: !198, file: !199, line: 29, type: !162)
!233 = !DILocation(line: 29, column: 31, scope: !198)
!234 = !DILocation(line: 32, column: 12, scope: !198)
!235 = !DILocation(line: 33, column: 13, scope: !198)
!236 = !DILocation(line: 34, column: 8, scope: !198)
!237 = !DILocation(line: 36, column: 37, scope: !198)
!238 = !DILocation(line: 36, column: 44, scope: !198)
!239 = !DILocation(line: 36, column: 43, scope: !198)
!240 = !DILocation(line: 36, column: 9, scope: !198)
!241 = !DILocation(line: 36, column: 7, scope: !198)
!242 = !DILocation(line: 37, column: 37, scope: !198)
!243 = !DILocation(line: 37, column: 44, scope: !198)
!244 = !DILocation(line: 37, column: 43, scope: !198)
!245 = !DILocation(line: 37, column: 52, scope: !198)
!246 = !DILocation(line: 37, column: 51, scope: !198)
!247 = !DILocation(line: 37, column: 10, scope: !198)
!248 = !DILocation(line: 37, column: 8, scope: !198)
!249 = !DILocation(line: 39, column: 16, scope: !198)
!250 = !DILocation(line: 39, column: 21, scope: !198)
!251 = !DILocation(line: 39, column: 15, scope: !198)
!252 = !DILocation(line: 39, column: 29, scope: !198)
!253 = !DILocation(line: 39, column: 13, scope: !198)
!254 = !DILocation(line: 41, column: 20, scope: !198)
!255 = !DILocation(line: 41, column: 27, scope: !198)
!256 = !DILocation(line: 41, column: 33, scope: !198)
!257 = !DILocation(line: 41, column: 4, scope: !198)
!258 = !DILocation(line: 42, column: 40, scope: !198)
!259 = !DILocation(line: 42, column: 45, scope: !198)
!260 = !DILocation(line: 42, column: 34, scope: !198)
!261 = !DILocation(line: 42, column: 28, scope: !262)
!262 = !DILexicalBlockFile(scope: !198, file: !199, discriminator: 1)
!263 = !DILocation(line: 42, column: 28, scope: !198)
!264 = !DILocation(line: 42, column: 14, scope: !265)
!265 = !DILexicalBlockFile(scope: !198, file: !199, discriminator: 2)
!266 = !DILocation(line: 42, column: 12, scope: !198)
!267 = !DILocation(line: 43, column: 27, scope: !198)
!268 = !DILocation(line: 43, column: 33, scope: !198)
!269 = !DILocation(line: 43, column: 26, scope: !198)
!270 = !DILocation(line: 43, column: 36, scope: !198)
!271 = !DILocation(line: 43, column: 42, scope: !198)
!272 = !DILocation(line: 43, column: 67, scope: !198)
!273 = !DILocation(line: 43, column: 71, scope: !198)
!274 = !DILocation(line: 43, column: 57, scope: !198)
!275 = !DILocation(line: 43, column: 85, scope: !198)
!276 = !DILocation(line: 43, column: 90, scope: !198)
!277 = !DILocation(line: 43, column: 79, scope: !278)
!278 = !DILexicalBlockFile(scope: !198, file: !199, discriminator: 4)
!279 = !DILocation(line: 43, column: 79, scope: !198)
!280 = !DILocation(line: 43, column: 101, scope: !198)
!281 = !DILocation(line: 43, column: 100, scope: !198)
!282 = !DILocation(line: 43, column: 112, scope: !262)
!283 = !DILocation(line: 43, column: 121, scope: !262)
!284 = !DILocation(line: 43, column: 100, scope: !262)
!285 = !DILocation(line: 43, column: 100, scope: !265)
!286 = !DILocation(line: 43, column: 100, scope: !287)
!287 = !DILexicalBlockFile(scope: !198, file: !199, discriminator: 3)
!288 = !DILocation(line: 43, column: 4, scope: !287)
!289 = !DILocation(line: 44, column: 40, scope: !198)
!290 = !DILocation(line: 44, column: 45, scope: !198)
!291 = !DILocation(line: 44, column: 34, scope: !198)
!292 = !DILocation(line: 44, column: 28, scope: !262)
