; ModuleID = './[inter]ncurses--n_conn.o.i'
source_filename = "./[inter]ncurses--n_conn.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.connections = type { i64, i64, i16, i16, i64, i64, i32, i32, i32 }
%struct.cnn = type { [200 x i8], [200 x i8], i64, i64, i64, i64, i16, i16, i32 }
%struct.scrolling_window = type { %struct._win_st*, %struct._win_st*, i32, i32, i32, i32, i32, i32, i8* }
%struct._win_st = type { i16, i16, i16, i16, i16, i16, i16, i64, i64, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, %struct.ldat*, i16, i16, i32, i32, %struct._win_st*, %struct.pdat, i16 }
%struct.ldat = type opaque
%struct.pdat = type { i16, i16, i16, i16, i16, i16 }
%struct.pcap_pkthdr = type { %struct.timeval, i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.pcap = type opaque
%struct.pcap_dumper = type opaque
%struct.pcap_stat = type { i32, i32, i32 }
%struct.bpf_program = type { i32, %struct.bpf_insn* }
%struct.bpf_insn = type { i16, i8, i8, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !32, globals: !138)
!1 = !DIFile(filename: "[inter]ncurses--n_conn.o.i", directory: "/home/lichi/Desktop/nast/[task]nast")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 40, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!6 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!7 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!8 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!9 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!10 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!11 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!12 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!13 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!14 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!15 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!16 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!17 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!18 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!19 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!20 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!21 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!22 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!23 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!24 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!25 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!26 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!27 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!28 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!29 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!30 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!31 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!32 = !{!33, !34, !40, !101, !125}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !36, line: 33, baseType: !37)
!36 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !38, line: 30, baseType: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!39 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !42, line: 48, baseType: !43)
!42 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !44, line: 241, size: 1728, align: 64, elements: !45)
!44 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!45 = !{!46, !48, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !69, !70, !71, !72, !75, !77, !79, !83, !86, !88, !89, !90, !91, !92, !96, !97}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !43, file: !44, line: 242, baseType: !47, size: 32, align: 32)
!47 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !43, file: !44, line: 247, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !43, file: !44, line: 248, baseType: !49, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !43, file: !44, line: 249, baseType: !49, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !43, file: !44, line: 250, baseType: !49, size: 64, align: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !43, file: !44, line: 251, baseType: !49, size: 64, align: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !43, file: !44, line: 252, baseType: !49, size: 64, align: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !43, file: !44, line: 253, baseType: !49, size: 64, align: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !43, file: !44, line: 254, baseType: !49, size: 64, align: 64, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !43, file: !44, line: 256, baseType: !49, size: 64, align: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !43, file: !44, line: 257, baseType: !49, size: 64, align: 64, offset: 640)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !43, file: !44, line: 258, baseType: !49, size: 64, align: 64, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !43, file: !44, line: 260, baseType: !62, size: 64, align: 64, offset: 768)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !44, line: 156, size: 192, align: 64, elements: !64)
!64 = !{!65, !66, !68}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !63, file: !44, line: 157, baseType: !62, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !63, file: !44, line: 158, baseType: !67, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !63, file: !44, line: 162, baseType: !47, size: 32, align: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !43, file: !44, line: 262, baseType: !67, size: 64, align: 64, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !43, file: !44, line: 264, baseType: !47, size: 32, align: 32, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !43, file: !44, line: 268, baseType: !47, size: 32, align: 32, offset: 928)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !43, file: !44, line: 270, baseType: !73, size: 64, align: 64, offset: 960)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !38, line: 131, baseType: !74)
!74 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !43, file: !44, line: 274, baseType: !76, size: 16, align: 16, offset: 1024)
!76 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !43, file: !44, line: 275, baseType: !78, size: 8, align: 8, offset: 1040)
!78 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !43, file: !44, line: 276, baseType: !80, size: 8, align: 8, offset: 1048)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8, align: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 1)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !43, file: !44, line: 280, baseType: !84, size: 64, align: 64, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !44, line: 150, baseType: null)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !43, file: !44, line: 289, baseType: !87, size: 64, align: 64, offset: 1152)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !38, line: 132, baseType: !74)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !43, file: !44, line: 297, baseType: !33, size: 64, align: 64, offset: 1216)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !43, file: !44, line: 298, baseType: !33, size: 64, align: 64, offset: 1280)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !43, file: !44, line: 299, baseType: !33, size: 64, align: 64, offset: 1344)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !43, file: !44, line: 300, baseType: !33, size: 64, align: 64, offset: 1408)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !43, file: !44, line: 302, baseType: !93, size: 64, align: 64, offset: 1472)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 216, baseType: !95)
!94 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!95 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !43, file: !44, line: 303, baseType: !47, size: 32, align: 32, offset: 1536)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !43, file: !44, line: 305, baseType: !98, size: 160, align: 8, offset: 1568)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 160, align: 8, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 20)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_ipv4_hdr", file: !103, line: 666, size: 160, align: 32, elements: !104)
!103 = !DIFile(filename: "/usr/local/include/libnet/libnet-headers.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!104 = !{!105, !108, !109, !110, !112, !113, !114, !115, !116, !117, !124}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ip_hl", scope: !102, file: !103, line: 669, baseType: !106, size: 4, align: 8, flags: DIFlagBitField, extraData: i64 0)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !107, line: 48, baseType: !39)
!107 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ip_v", scope: !102, file: !103, line: 670, baseType: !106, size: 4, align: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ip_tos", scope: !102, file: !103, line: 676, baseType: !106, size: 8, align: 8, offset: 8)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ip_len", scope: !102, file: !103, line: 689, baseType: !111, size: 16, align: 16, offset: 16)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !107, line: 49, baseType: !76)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !102, file: !103, line: 690, baseType: !111, size: 16, align: 16, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ip_off", scope: !102, file: !103, line: 691, baseType: !111, size: 16, align: 16, offset: 48)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl", scope: !102, file: !103, line: 704, baseType: !106, size: 8, align: 8, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ip_p", scope: !102, file: !103, line: 705, baseType: !106, size: 8, align: 8, offset: 72)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ip_sum", scope: !102, file: !103, line: 706, baseType: !111, size: 16, align: 16, offset: 80)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ip_src", scope: !102, file: !103, line: 707, baseType: !118, size: 32, align: 32, offset: 96)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !4, line: 31, size: 32, align: 32, elements: !119)
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !118, file: !4, line: 33, baseType: !121, size: 32, align: 32)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !4, line: 30, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !107, line: 51, baseType: !123)
!123 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ip_dst", scope: !102, file: !103, line: 707, baseType: !118, size: 32, align: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_tcp_hdr", file: !103, line: 1653, size: 160, align: 32, elements: !127)
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "th_sport", scope: !126, file: !103, line: 1655, baseType: !111, size: 16, align: 16)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "th_dport", scope: !126, file: !103, line: 1656, baseType: !111, size: 16, align: 16, offset: 16)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "th_seq", scope: !126, file: !103, line: 1657, baseType: !122, size: 32, align: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "th_ack", scope: !126, file: !103, line: 1658, baseType: !122, size: 32, align: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "th_x2", scope: !126, file: !103, line: 1660, baseType: !106, size: 4, align: 8, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "th_off", scope: !126, file: !103, line: 1661, baseType: !106, size: 4, align: 8, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "th_flags", scope: !126, file: !103, line: 1667, baseType: !106, size: 8, align: 8, offset: 104)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "th_win", scope: !126, file: !103, line: 1692, baseType: !111, size: 16, align: 16, offset: 112)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "th_sum", scope: !126, file: !103, line: 1693, baseType: !111, size: 16, align: 16, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "th_urp", scope: !126, file: !103, line: 1694, baseType: !111, size: 16, align: 16, offset: 144)
!138 = !{!139, !141, !142, !143, !145, !147, !148, !149, !150, !168, !172, !177, !183, !184, !185, !186, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !217, !218, !221, !225, !226, !227, !228, !274, !275, !276, !290, !291, !292, !293, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !386, !387, !391, !392, !393, !394, !395, !399, !414, !424, !430, !443, !459, !460}
!139 = distinct !DIGlobalVariable(name: "nconn", scope: !0, file: !140, line: 30, type: !47, isLocal: false, isDefinition: true, variable: i32* @nconn)
!140 = !DIFile(filename: "ncurses/n_conn.c", directory: "/home/lichi/Desktop/nast/[task]nast")
!141 = distinct !DIGlobalVariable(name: "lines", scope: !0, file: !140, line: 31, type: !47, isLocal: false, isDefinition: true, variable: i32* @lines)
!142 = distinct !DIGlobalVariable(name: "z", scope: !0, file: !140, line: 33, type: !47, isLocal: false, isDefinition: true, variable: i32* @z)
!143 = distinct !DIGlobalVariable(name: "logd", scope: !0, file: !144, line: 98, type: !40, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @logd)
!144 = !DIFile(filename: "ncurses/../include/nast.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!145 = distinct !DIGlobalVariable(name: "offset", scope: !0, file: !144, line: 99, type: !146, isLocal: false, isDefinition: true, variable: i16* @offset)
!146 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!147 = distinct !DIGlobalVariable(name: "npkt", scope: !0, file: !144, line: 100, type: !47, isLocal: false, isDefinition: true, variable: i32* @npkt)
!148 = distinct !DIGlobalVariable(name: "packet", scope: !0, file: !144, line: 101, type: !34, isLocal: false, isDefinition: true, variable: i8** @packet)
!149 = distinct !DIGlobalVariable(name: "buf", scope: !0, file: !144, line: 102, type: !34, isLocal: false, isDefinition: true, variable: i8** @buf)
!150 = distinct !DIGlobalVariable(name: "hdr", scope: !0, file: !144, line: 103, type: !151, isLocal: false, isDefinition: true, variable: %struct.pcap_pkthdr* @hdr)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_pkthdr", file: !152, line: 199, size: 192, align: 64, elements: !153)
!152 = !DIFile(filename: "/usr/local/include/pcap/pcap.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!153 = !{!154, !162, !167}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !151, file: !152, line: 200, baseType: !155, size: 128, align: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !156, line: 30, size: 128, align: 64, elements: !157)
!156 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!157 = !{!158, !160}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !155, file: !156, line: 32, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !38, line: 139, baseType: !74)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !155, file: !156, line: 33, baseType: !161, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !38, line: 141, baseType: !74)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "caplen", scope: !151, file: !152, line: 201, baseType: !163, size: 32, align: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "bpf_u_int32", file: !164, line: 85, baseType: !165)
!164 = !DIFile(filename: "/usr/local/include/pcap/bpf.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !36, line: 35, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !38, line: 32, baseType: !123)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !151, file: !152, line: 202, baseType: !163, size: 32, align: 32, offset: 160)
!168 = distinct !DIGlobalVariable(name: "descr", scope: !0, file: !144, line: 104, type: !169, isLocal: false, isDefinition: true, variable: %struct.pcap** @descr)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_t", file: !152, line: 118, baseType: !171)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap", file: !152, line: 118, flags: DIFlagFwdDecl)
!172 = distinct !DIGlobalVariable(name: "dumper", scope: !0, file: !173, line: 113, type: !174, isLocal: false, isDefinition: true, variable: %struct.pcap_dumper** @dumper)
!173 = !DIFile(filename: "ncurses/n_nast.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_dumper_t", file: !152, line: 119, baseType: !176)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_dumper", file: !152, line: 119, flags: DIFlagFwdDecl)
!177 = distinct !DIGlobalVariable(name: "statistic", scope: !0, file: !144, line: 106, type: !178, isLocal: false, isDefinition: true, variable: %struct.pcap_stat* @statistic)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_stat", file: !152, line: 208, size: 96, align: 32, elements: !179)
!179 = !{!180, !181, !182}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ps_recv", scope: !178, file: !152, line: 209, baseType: !165, size: 32, align: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ps_drop", scope: !178, file: !152, line: 210, baseType: !165, size: 32, align: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ps_ifdrop", scope: !178, file: !152, line: 211, baseType: !165, size: 32, align: 32, offset: 64)
!183 = distinct !DIGlobalVariable(name: "maskp", scope: !0, file: !144, line: 107, type: !163, isLocal: false, isDefinition: true, variable: i32* @maskp)
!184 = distinct !DIGlobalVariable(name: "netp", scope: !0, file: !144, line: 108, type: !163, isLocal: false, isDefinition: true, variable: i32* @netp)
!185 = distinct !DIGlobalVariable(name: "datalink", scope: !0, file: !144, line: 109, type: !47, isLocal: false, isDefinition: true, variable: i32* @datalink)
!186 = distinct !DIGlobalVariable(name: "fp", scope: !0, file: !144, line: 110, type: !187, isLocal: false, isDefinition: true, variable: %struct.bpf_program* @fp)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_program", file: !164, line: 104, size: 128, align: 64, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "bf_len", scope: !187, file: !164, line: 105, baseType: !165, size: 32, align: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "bf_insns", scope: !187, file: !164, line: 106, baseType: !191, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_insn", file: !164, line: 234, size: 64, align: 32, elements: !193)
!193 = !{!194, !197, !198, !199}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !192, file: !164, line: 235, baseType: !195, size: 16, align: 16)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !36, line: 34, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !38, line: 31, baseType: !76)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "jt", scope: !192, file: !164, line: 236, baseType: !35, size: 8, align: 8, offset: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "jf", scope: !192, file: !164, line: 237, baseType: !35, size: 8, align: 8, offset: 24)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !192, file: !164, line: 238, baseType: !163, size: 32, align: 32, offset: 32)
!200 = distinct !DIGlobalVariable(name: "logname", scope: !0, file: !144, line: 111, type: !49, isLocal: false, isDefinition: true, variable: i8** @logname)
!201 = distinct !DIGlobalVariable(name: "tcpdl", scope: !0, file: !144, line: 112, type: !49, isLocal: false, isDefinition: true, variable: i8** @tcpdl)
!202 = distinct !DIGlobalVariable(name: "tr", scope: !0, file: !144, line: 113, type: !195, isLocal: false, isDefinition: true, variable: i16* @tr)
!203 = distinct !DIGlobalVariable(name: "tl", scope: !0, file: !144, line: 113, type: !195, isLocal: false, isDefinition: true, variable: i16* @tl)
!204 = distinct !DIGlobalVariable(name: "graph", scope: !0, file: !144, line: 114, type: !195, isLocal: false, isDefinition: true, variable: i16* @graph)
!205 = distinct !DIGlobalVariable(name: "cont", scope: !0, file: !144, line: 115, type: !195, isLocal: false, isDefinition: true, variable: i16* @cont)
!206 = distinct !DIGlobalVariable(name: "stream_glob", scope: !0, file: !144, line: 117, type: !47, isLocal: false, isDefinition: true, variable: i32* @stream_glob)
!207 = distinct !DIGlobalVariable(name: "bc_glob", scope: !0, file: !144, line: 118, type: !47, isLocal: false, isDefinition: true, variable: i32* @bc_glob)
!208 = distinct !DIGlobalVariable(name: "sniff_glob", scope: !0, file: !144, line: 119, type: !47, isLocal: false, isDefinition: true, variable: i32* @sniff_glob)
!209 = distinct !DIGlobalVariable(name: "rst_glob", scope: !0, file: !144, line: 120, type: !47, isLocal: false, isDefinition: true, variable: i32* @rst_glob)
!210 = distinct !DIGlobalVariable(name: "arp_glob", scope: !0, file: !144, line: 121, type: !47, isLocal: false, isDefinition: true, variable: i32* @arp_glob)
!211 = distinct !DIGlobalVariable(name: "pt", scope: !0, file: !144, line: 122, type: !212, isLocal: false, isDefinition: true, variable: [2 x i64]* @pt)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 128, align: 64, elements: !215)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !214, line: 60, baseType: !95)
!214 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!215 = !{!216}
!216 = !DISubrange(count: 2)
!217 = distinct !DIGlobalVariable(name: "lg", scope: !0, file: !144, line: 123, type: !47, isLocal: false, isDefinition: true, variable: i32* @lg)
!218 = distinct !DIGlobalVariable(name: "tm", scope: !0, file: !144, line: 132, type: !219, isLocal: false, isDefinition: true, variable: i64* @tm)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !220, line: 75, baseType: !159)
!220 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!221 = distinct !DIGlobalVariable(name: "timed", scope: !0, file: !144, line: 133, type: !222, isLocal: false, isDefinition: true, variable: [60 x i8]* @timed)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 480, align: 8, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 60)
!225 = distinct !DIGlobalVariable(name: "demonize", scope: !0, file: !144, line: 136, type: !195, isLocal: false, isDefinition: true, variable: i16* @demonize)
!226 = distinct !DIGlobalVariable(name: "line_s", scope: !0, file: !144, line: 138, type: !47, isLocal: false, isDefinition: true, variable: i32* @line_s)
!227 = distinct !DIGlobalVariable(name: "row_s", scope: !0, file: !144, line: 139, type: !47, isLocal: false, isDefinition: true, variable: i32* @row_s)
!228 = distinct !DIGlobalVariable(name: "query", scope: !0, file: !173, line: 87, type: !229, isLocal: false, isDefinition: true, variable: %struct._win_st** @query)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW", file: !231, line: 372, baseType: !232)
!231 = !DIFile(filename: "/usr/include/curses.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_win_st", file: !231, line: 421, size: 768, align: 64, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !239, !240, !241, !244, !245, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !259, !260, !261, !262, !263, !264, !273}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_cury", scope: !232, file: !231, line: 423, baseType: !146, size: 16, align: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_curx", scope: !232, file: !231, line: 423, baseType: !146, size: 16, align: 16, offset: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_maxy", scope: !232, file: !231, line: 426, baseType: !146, size: 16, align: 16, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_maxx", scope: !232, file: !231, line: 426, baseType: !146, size: 16, align: 16, offset: 48)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_begy", scope: !232, file: !231, line: 427, baseType: !146, size: 16, align: 16, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_begx", scope: !232, file: !231, line: 427, baseType: !146, size: 16, align: 16, offset: 80)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !232, file: !231, line: 429, baseType: !146, size: 16, align: 16, offset: 96)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_attrs", scope: !232, file: !231, line: 432, baseType: !242, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "attr_t", file: !231, line: 374, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "chtype", file: !231, line: 164, baseType: !95)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_bkgd", scope: !232, file: !231, line: 433, baseType: !243, size: 64, align: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_notimeout", scope: !232, file: !231, line: 436, baseType: !246, size: 8, align: 8, offset: 256)
!246 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_clear", scope: !232, file: !231, line: 437, baseType: !246, size: 8, align: 8, offset: 264)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_leaveok", scope: !232, file: !231, line: 438, baseType: !246, size: 8, align: 8, offset: 272)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_scroll", scope: !232, file: !231, line: 439, baseType: !246, size: 8, align: 8, offset: 280)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_idlok", scope: !232, file: !231, line: 440, baseType: !246, size: 8, align: 8, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_idcok", scope: !232, file: !231, line: 441, baseType: !246, size: 8, align: 8, offset: 296)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_immed", scope: !232, file: !231, line: 442, baseType: !246, size: 8, align: 8, offset: 304)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_sync", scope: !232, file: !231, line: 443, baseType: !246, size: 8, align: 8, offset: 312)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_use_keypad", scope: !232, file: !231, line: 444, baseType: !246, size: 8, align: 8, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_delay", scope: !232, file: !231, line: 445, baseType: !47, size: 32, align: 32, offset: 352)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_line", scope: !232, file: !231, line: 447, baseType: !257, size: 64, align: 64, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldat", file: !231, line: 419, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_regtop", scope: !232, file: !231, line: 450, baseType: !146, size: 16, align: 16, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_regbottom", scope: !232, file: !231, line: 451, baseType: !146, size: 16, align: 16, offset: 464)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_parx", scope: !232, file: !231, line: 454, baseType: !47, size: 32, align: 32, offset: 480)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_pary", scope: !232, file: !231, line: 455, baseType: !47, size: 32, align: 32, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_parent", scope: !232, file: !231, line: 456, baseType: !229, size: 64, align: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !232, file: !231, line: 464, baseType: !265, size: 96, align: 16, offset: 640)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pdat", file: !231, line: 459, size: 96, align: 16, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_y", scope: !265, file: !231, line: 461, baseType: !146, size: 16, align: 16)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_x", scope: !265, file: !231, line: 461, baseType: !146, size: 16, align: 16, offset: 16)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_top", scope: !265, file: !231, line: 462, baseType: !146, size: 16, align: 16, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_left", scope: !265, file: !231, line: 462, baseType: !146, size: 16, align: 16, offset: 48)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_bottom", scope: !265, file: !231, line: 463, baseType: !146, size: 16, align: 16, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_right", scope: !265, file: !231, line: 463, baseType: !146, size: 16, align: 16, offset: 80)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_yoffset", scope: !232, file: !231, line: 466, baseType: !146, size: 16, align: 16, offset: 736)
!274 = distinct !DIGlobalVariable(name: "werror", scope: !0, file: !173, line: 88, type: !229, isLocal: false, isDefinition: true, variable: %struct._win_st** @werror)
!275 = distinct !DIGlobalVariable(name: "help", scope: !0, file: !173, line: 89, type: !229, isLocal: false, isDefinition: true, variable: %struct._win_st** @help)
!276 = distinct !DIGlobalVariable(name: "princ", scope: !0, file: !173, line: 90, type: !277, isLocal: false, isDefinition: true, variable: %struct.scrolling_window** @princ)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "N_SCROLLWIN", file: !173, line: 61, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "scrolling_window", file: !173, line: 49, size: 384, align: 64, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288, !289}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !279, file: !173, line: 51, baseType: !229, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !279, file: !173, line: 52, baseType: !229, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "y_scroll", scope: !279, file: !173, line: 53, baseType: !47, size: 32, align: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "y_max", scope: !279, file: !173, line: 54, baseType: !47, size: 32, align: 32, offset: 160)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !279, file: !173, line: 55, baseType: !47, size: 32, align: 32, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cols", scope: !279, file: !173, line: 56, baseType: !47, size: 32, align: 32, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !279, file: !173, line: 57, baseType: !47, size: 32, align: 32, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !279, file: !173, line: 58, baseType: !47, size: 32, align: 32, offset: 288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !279, file: !173, line: 59, baseType: !49, size: 64, align: 64, offset: 320)
!290 = distinct !DIGlobalVariable(name: "winfo", scope: !0, file: !173, line: 91, type: !277, isLocal: false, isDefinition: true, variable: %struct.scrolling_window** @winfo)
!291 = distinct !DIGlobalVariable(name: "wstream", scope: !0, file: !173, line: 92, type: !277, isLocal: false, isDefinition: true, variable: %struct.scrolling_window** @wstream)
!292 = distinct !DIGlobalVariable(name: "wconn", scope: !0, file: !173, line: 93, type: !277, isLocal: false, isDefinition: true, variable: %struct.scrolling_window** @wconn)
!293 = distinct !DIGlobalVariable(name: "my_nmenu", scope: !0, file: !173, line: 95, type: !294, isLocal: false, isDefinition: true, variable: %struct.tagMENU** @my_nmenu)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "MENU", file: !296, line: 132, baseType: !297)
!296 = !DIFile(filename: "/usr/include/menu.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tagMENU", file: !296, line: 90, size: 1600, align: 64, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !348, !349, !350, !351, !352, !353, !354, !355, !360, !361, !362, !363, !364, !365, !367}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !297, file: !296, line: 92, baseType: !146, size: 16, align: 16)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !297, file: !296, line: 93, baseType: !146, size: 16, align: 16, offset: 16)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !297, file: !296, line: 94, baseType: !146, size: 16, align: 16, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "cols", scope: !297, file: !296, line: 95, baseType: !146, size: 16, align: 16, offset: 48)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "frows", scope: !297, file: !296, line: 96, baseType: !146, size: 16, align: 16, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "fcols", scope: !297, file: !296, line: 97, baseType: !146, size: 16, align: 16, offset: 80)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "arows", scope: !297, file: !296, line: 98, baseType: !146, size: 16, align: 16, offset: 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "namelen", scope: !297, file: !296, line: 99, baseType: !146, size: 16, align: 16, offset: 112)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "desclen", scope: !297, file: !296, line: 100, baseType: !146, size: 16, align: 16, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "marklen", scope: !297, file: !296, line: 101, baseType: !146, size: 16, align: 16, offset: 144)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "itemlen", scope: !297, file: !296, line: 102, baseType: !146, size: 16, align: 16, offset: 160)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "spc_desc", scope: !297, file: !296, line: 103, baseType: !146, size: 16, align: 16, offset: 176)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "spc_cols", scope: !297, file: !296, line: 104, baseType: !146, size: 16, align: 16, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "spc_rows", scope: !297, file: !296, line: 105, baseType: !146, size: 16, align: 16, offset: 208)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !297, file: !296, line: 106, baseType: !49, size: 64, align: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pindex", scope: !297, file: !296, line: 107, baseType: !146, size: 16, align: 16, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !297, file: !296, line: 108, baseType: !229, size: 64, align: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !297, file: !296, line: 109, baseType: !229, size: 64, align: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "userwin", scope: !297, file: !296, line: 110, baseType: !229, size: 64, align: 64, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "usersub", scope: !297, file: !296, line: 111, baseType: !229, size: 64, align: 64, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !297, file: !296, line: 112, baseType: !320, size: 64, align: 64, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "ITEM", file: !296, line: 86, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tagITEM", file: !296, line: 69, size: 768, align: 64, elements: !324)
!324 = !{!325, !333, !334, !336, !337, !339, !340, !341, !342, !343, !345, !346, !347}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !323, file: !296, line: 71, baseType: !326, size: 128, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT", file: !296, line: 67, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !296, line: 63, size: 128, align: 64, elements: !328)
!328 = !{!329, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !327, file: !296, line: 65, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !327, file: !296, line: 66, baseType: !76, size: 16, align: 16, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !323, file: !296, line: 72, baseType: !326, size: 128, align: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "imenu", scope: !323, file: !296, line: 73, baseType: !335, size: 64, align: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "userptr", scope: !323, file: !296, line: 74, baseType: !33, size: 64, align: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !323, file: !296, line: 75, baseType: !338, size: 32, align: 32, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "Item_Options", file: !296, line: 50, baseType: !47)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !323, file: !296, line: 76, baseType: !146, size: 16, align: 16, offset: 416)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !323, file: !296, line: 77, baseType: !146, size: 16, align: 16, offset: 432)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !323, file: !296, line: 78, baseType: !146, size: 16, align: 16, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !323, file: !296, line: 79, baseType: !246, size: 8, align: 8, offset: 464)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !323, file: !296, line: 81, baseType: !344, size: 64, align: 64, offset: 512)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !323, file: !296, line: 82, baseType: !344, size: 64, align: 64, offset: 576)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !323, file: !296, line: 83, baseType: !344, size: 64, align: 64, offset: 640)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !323, file: !296, line: 84, baseType: !344, size: 64, align: 64, offset: 704)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "nitems", scope: !297, file: !296, line: 113, baseType: !146, size: 16, align: 16, offset: 704)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "curitem", scope: !297, file: !296, line: 114, baseType: !321, size: 64, align: 64, offset: 768)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "toprow", scope: !297, file: !296, line: 115, baseType: !146, size: 16, align: 16, offset: 832)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "fore", scope: !297, file: !296, line: 116, baseType: !243, size: 64, align: 64, offset: 896)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !297, file: !296, line: 117, baseType: !243, size: 64, align: 64, offset: 960)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "grey", scope: !297, file: !296, line: 118, baseType: !243, size: 64, align: 64, offset: 1024)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !297, file: !296, line: 119, baseType: !39, size: 8, align: 8, offset: 1088)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "menuinit", scope: !297, file: !296, line: 121, baseType: !356, size: 64, align: 64, offset: 1152)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "Menu_Hook", file: !296, line: 88, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !335}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "menuterm", scope: !297, file: !296, line: 122, baseType: !356, size: 64, align: 64, offset: 1216)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "iteminit", scope: !297, file: !296, line: 123, baseType: !356, size: 64, align: 64, offset: 1280)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "itemterm", scope: !297, file: !296, line: 124, baseType: !356, size: 64, align: 64, offset: 1344)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "userptr", scope: !297, file: !296, line: 126, baseType: !33, size: 64, align: 64, offset: 1408)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !297, file: !296, line: 127, baseType: !49, size: 64, align: 64, offset: 1472)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !297, file: !296, line: 129, baseType: !366, size: 32, align: 32, offset: 1536)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "Menu_Options", file: !296, line: 49, baseType: !47)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !297, file: !296, line: 130, baseType: !76, size: 16, align: 16, offset: 1568)
!368 = distinct !DIGlobalVariable(name: "curr_item", scope: !0, file: !173, line: 96, type: !321, isLocal: false, isDefinition: true, variable: %struct.tagITEM** @curr_item)
!369 = distinct !DIGlobalVariable(name: "my_nmenu_win", scope: !0, file: !173, line: 97, type: !229, isLocal: false, isDefinition: true, variable: %struct._win_st** @my_nmenu_win)
!370 = distinct !DIGlobalVariable(name: "pop_up", scope: !0, file: !173, line: 98, type: !229, isLocal: false, isDefinition: true, variable: %struct._win_st** @pop_up)
!371 = distinct !DIGlobalVariable(name: "mvar", scope: !0, file: !173, line: 100, type: !195, isLocal: false, isDefinition: true, variable: i16* @mvar)
!372 = distinct !DIGlobalVariable(name: "promisc", scope: !0, file: !173, line: 101, type: !195, isLocal: false, isDefinition: true, variable: i16* @promisc)
!373 = distinct !DIGlobalVariable(name: "hex", scope: !0, file: !173, line: 101, type: !195, isLocal: false, isDefinition: true, variable: i16* @hex)
!374 = distinct !DIGlobalVariable(name: "ascii", scope: !0, file: !173, line: 101, type: !195, isLocal: false, isDefinition: true, variable: i16* @ascii)
!375 = distinct !DIGlobalVariable(name: "ld", scope: !0, file: !173, line: 101, type: !195, isLocal: false, isDefinition: true, variable: i16* @ld)
!376 = distinct !DIGlobalVariable(name: "f", scope: !0, file: !173, line: 101, type: !195, isLocal: false, isDefinition: true, variable: i16* @f)
!377 = distinct !DIGlobalVariable(name: "lr", scope: !0, file: !173, line: 101, type: !195, isLocal: false, isDefinition: true, variable: i16* @lr)
!378 = distinct !DIGlobalVariable(name: "l", scope: !0, file: !173, line: 101, type: !195, isLocal: false, isDefinition: true, variable: i16* @l)
!379 = distinct !DIGlobalVariable(name: "flg", scope: !0, file: !173, line: 102, type: !195, isLocal: false, isDefinition: true, variable: i16* @flg)
!380 = distinct !DIGlobalVariable(name: "linm", scope: !0, file: !173, line: 103, type: !47, isLocal: false, isDefinition: true, variable: i32* @linm)
!381 = distinct !DIGlobalVariable(name: "fileds", scope: !0, file: !173, line: 104, type: !47, isLocal: false, isDefinition: true, variable: i32* @fileds)
!382 = distinct !DIGlobalVariable(name: "dev", scope: !0, file: !173, line: 105, type: !383, isLocal: false, isDefinition: true, variable: [10 x i8]* @dev)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 80, align: 8, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 10)
!386 = distinct !DIGlobalVariable(name: "n_filter", scope: !0, file: !173, line: 106, type: !222, isLocal: false, isDefinition: true, variable: [60 x i8]* @n_filter)
!387 = distinct !DIGlobalVariable(name: "ldfile", scope: !0, file: !173, line: 107, type: !388, isLocal: false, isDefinition: true, variable: [50 x i8]* @ldfile)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 400, align: 8, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 50)
!391 = distinct !DIGlobalVariable(name: "tcpdfile", scope: !0, file: !173, line: 108, type: !388, isLocal: false, isDefinition: true, variable: [50 x i8]* @tcpdfile)
!392 = distinct !DIGlobalVariable(name: "reportl", scope: !0, file: !173, line: 109, type: !388, isLocal: false, isDefinition: true, variable: [50 x i8]* @reportl)
!393 = distinct !DIGlobalVariable(name: "logfile", scope: !0, file: !173, line: 110, type: !388, isLocal: false, isDefinition: true, variable: [50 x i8]* @logfile)
!394 = distinct !DIGlobalVariable(name: "str", scope: !0, file: !173, line: 112, type: !169, isLocal: false, isDefinition: true, variable: %struct.pcap** @str)
!395 = distinct !DIGlobalVariable(name: "thID", scope: !0, file: !173, line: 116, type: !396, isLocal: false, isDefinition: true, variable: [6 x i64]* @thID)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 384, align: 64, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 6)
!399 = distinct !DIGlobalVariable(name: "th_data", scope: !0, file: !173, line: 144, type: !400, isLocal: false, isDefinition: true, variable: [1 x %struct.thread_conn]* @th_data)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 448, align: 64, elements: !81)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_conn", file: !173, line: 118, size: 448, align: 64, elements: !402)
!402 = !{!403, !407, !410, !411, !412, !413}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !401, file: !173, line: 120, baseType: !404, size: 240, align: 8)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 240, align: 8, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 30)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ip_src", scope: !401, file: !173, line: 121, baseType: !408, size: 64, align: 64, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_long", file: !36, line: 36, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_long", file: !38, line: 33, baseType: !95)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ip_dst", scope: !401, file: !173, line: 122, baseType: !408, size: 64, align: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !401, file: !173, line: 123, baseType: !195, size: 16, align: 16, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !401, file: !173, line: 124, baseType: !195, size: 16, align: 16, offset: 400)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !401, file: !173, line: 125, baseType: !47, size: 32, align: 32, offset: 416)
!414 = distinct !DIGlobalVariable(name: "th_r_data", scope: !0, file: !173, line: 145, type: !415, isLocal: false, isDefinition: true, variable: [1 x %struct.thread_conn_rst]* @th_r_data)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 448, align: 64, elements: !81)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_conn_rst", file: !173, line: 134, size: 448, align: 64, elements: !417)
!417 = !{!418, !419, !420, !421, !422, !423}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !416, file: !173, line: 136, baseType: !404, size: 240, align: 8)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ip_src", scope: !416, file: !173, line: 137, baseType: !408, size: 64, align: 64, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ip_dst", scope: !416, file: !173, line: 138, baseType: !408, size: 64, align: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !416, file: !173, line: 139, baseType: !195, size: 16, align: 16, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !416, file: !173, line: 140, baseType: !195, size: 16, align: 16, offset: 400)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !416, file: !173, line: 141, baseType: !47, size: 32, align: 32, offset: 416)
!424 = distinct !DIGlobalVariable(name: "th_arp_data", scope: !0, file: !173, line: 146, type: !425, isLocal: false, isDefinition: true, variable: [1 x %struct.thread_arp]* @th_arp_data)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 288, align: 32, elements: !81)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_arp", file: !173, line: 128, size: 288, align: 32, elements: !427)
!427 = !{!428, !429}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !426, file: !173, line: 130, baseType: !404, size: 240, align: 8)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lr", scope: !426, file: !173, line: 131, baseType: !47, size: 32, align: 32, offset: 256)
!430 = distinct !DIGlobalVariable(name: "c_inf", scope: !0, file: !173, line: 161, type: !431, isLocal: false, isDefinition: true, variable: [30 x %struct.connections]* @c_inf)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 13440, align: 64, elements: !405)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "connections", file: !173, line: 148, size: 448, align: 64, elements: !433)
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "s_ip", scope: !432, file: !173, line: 150, baseType: !95, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "d_ip", scope: !432, file: !173, line: 151, baseType: !95, size: 64, align: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "s_port", scope: !432, file: !173, line: 152, baseType: !76, size: 16, align: 16, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "d_port", scope: !432, file: !173, line: 153, baseType: !76, size: 16, align: 16, offset: 144)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !432, file: !173, line: 154, baseType: !408, size: 64, align: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !432, file: !173, line: 155, baseType: !408, size: 64, align: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "lin", scope: !432, file: !173, line: 156, baseType: !47, size: 32, align: 32, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "pr", scope: !432, file: !173, line: 157, baseType: !47, size: 32, align: 32, offset: 352)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !432, file: !173, line: 158, baseType: !47, size: 32, align: 32, offset: 384)
!443 = distinct !DIGlobalVariable(name: "sf", scope: !0, file: !173, line: 177, type: !444, isLocal: false, isDefinition: true, variable: [30 x %struct.cnn]* @sf)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 105600, align: 64, elements: !405)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cnn", file: !173, line: 164, size: 3520, align: 64, elements: !446)
!446 = !{!447, !451, !452, !453, !454, !455, !456, !457, !458}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !445, file: !173, line: 166, baseType: !448, size: 1600, align: 8)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 1600, align: 8, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 200)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sfilter", scope: !445, file: !173, line: 168, baseType: !448, size: 1600, align: 8, offset: 1600)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !445, file: !173, line: 169, baseType: !408, size: 64, align: 64, offset: 3200)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !445, file: !173, line: 170, baseType: !408, size: 64, align: 64, offset: 3264)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ip_src", scope: !445, file: !173, line: 171, baseType: !408, size: 64, align: 64, offset: 3328)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ip_dst", scope: !445, file: !173, line: 172, baseType: !408, size: 64, align: 64, offset: 3392)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "s_port", scope: !445, file: !173, line: 173, baseType: !195, size: 16, align: 16, offset: 3456)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "d_port", scope: !445, file: !173, line: 174, baseType: !195, size: 16, align: 16, offset: 3472)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !445, file: !173, line: 175, baseType: !47, size: 32, align: 32, offset: 3488)
!459 = distinct !DIGlobalVariable(name: "nmax", scope: !0, file: !173, line: 180, type: !47, isLocal: false, isDefinition: true, variable: i32* @nmax)
!460 = distinct !DIGlobalVariable(name: "tmp", scope: !0, file: !140, line: 34, type: !47, isLocal: false, isDefinition: true, variable: i32* @tmp)
!461 = !{i32 2, !"Dwarf Version", i32 4}
!462 = !{i32 2, !"Debug Info Version", i32 3}
!463 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!464 = distinct !DISubprogram(name: "connection", scope: !140, file: !140, line: 36, type: !465, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !467)
!465 = !DISubroutineType(types: !466)
!466 = !{!47, !49, !408, !408, !195, !195}
!467 = !{}
!468 = !DILocalVariable(name: "dev", arg: 1, scope: !464, file: !140, line: 36, type: !49)
!469 = !DIExpression()
!470 = !DILocation(line: 36, column: 22, scope: !464)
!471 = !DILocalVariable(name: "ip_src", arg: 2, scope: !464, file: !140, line: 36, type: !408)
!472 = !DILocation(line: 36, column: 33, scope: !464)
!473 = !DILocalVariable(name: "ip_dst", arg: 3, scope: !464, file: !140, line: 36, type: !408)
!474 = !DILocation(line: 36, column: 47, scope: !464)
!475 = !DILocalVariable(name: "sport", arg: 4, scope: !464, file: !140, line: 36, type: !195)
!476 = !DILocation(line: 36, column: 62, scope: !464)
!477 = !DILocalVariable(name: "dport", arg: 5, scope: !464, file: !140, line: 36, type: !195)
!478 = !DILocation(line: 36, column: 76, scope: !464)
!479 = !DILocalVariable(name: "errbuf", scope: !464, file: !140, line: 38, type: !480)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 2048, align: 8, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 256)
!483 = !DILocation(line: 38, column: 9, scope: !464)
!484 = !DILocalVariable(name: "ip", scope: !464, file: !140, line: 39, type: !101)
!485 = !DILocation(line: 39, column: 28, scope: !464)
!486 = !DILocalVariable(name: "tcp", scope: !464, file: !140, line: 40, type: !125)
!487 = !DILocation(line: 40, column: 27, scope: !464)
!488 = !DILocalVariable(name: "descr", scope: !464, file: !140, line: 41, type: !169)
!489 = !DILocation(line: 41, column: 12, scope: !464)
!490 = !DILocalVariable(name: "dumper", scope: !464, file: !140, line: 42, type: !174)
!491 = !DILocation(line: 42, column: 19, scope: !464)
!492 = !DILocalVariable(name: "k", scope: !464, file: !140, line: 43, type: !47)
!493 = !DILocation(line: 43, column: 8, scope: !464)
!494 = !DILocation(line: 45, column: 10, scope: !464)
!495 = !DILocation(line: 45, column: 9, scope: !464)
!496 = !DILocation(line: 46, column: 9, scope: !464)
!497 = !DILocation(line: 47, column: 10, scope: !464)
!498 = !DILocation(line: 48, column: 10, scope: !464)
!499 = !DILocation(line: 49, column: 5, scope: !464)
!500 = !DILocation(line: 51, column: 10, scope: !464)
!501 = !DILocation(line: 53, column: 29, scope: !502)
!502 = distinct !DILexicalBlock(scope: !464, file: !140, line: 53, column: 7)
!503 = !DILocation(line: 53, column: 43, scope: !502)
!504 = !DILocation(line: 53, column: 14, scope: !502)
!505 = !DILocation(line: 53, column: 13, scope: !502)
!506 = !DILocation(line: 53, column: 52, scope: !502)
!507 = !DILocation(line: 53, column: 7, scope: !464)
!508 = !DILocation(line: 55, column: 35, scope: !509)
!509 = distinct !DILexicalBlock(scope: !502, file: !140, line: 54, column: 6)
!510 = !DILocation(line: 55, column: 2, scope: !509)
!511 = !DILocation(line: 56, column: 6, scope: !509)
!512 = !DILocation(line: 59, column: 33, scope: !513)
!513 = distinct !DILexicalBlock(scope: !464, file: !140, line: 59, column: 8)
!514 = !DILocation(line: 59, column: 39, scope: !513)
!515 = !DILocation(line: 59, column: 18, scope: !513)
!516 = !DILocation(line: 59, column: 16, scope: !513)
!517 = !DILocation(line: 59, column: 46, scope: !513)
