; ModuleID = './[inter]sniff.o.i'
source_filename = "./[inter]sniff.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pcap = type opaque
%struct.pcap_dumper = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.bpf_program = type { i32, %struct.bpf_insn* }
%struct.bpf_insn = type { i16, i8, i8, i32 }
%struct.pcap_pkthdr = type { %struct.timeval, i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.pcap_stat = type { i32, i32, i32 }
%struct.libnet_context = type { i32, i32, %struct.libnet_protocol_block*, %struct.libnet_protocol_block*, i32, i32, i32, i32, i8*, %struct.libnet_stats, i32, [64 x i8], [256 x i8], i32 }
%struct.libnet_protocol_block = type { i8*, i32, i16, i32, i8, i8, i32, %struct.libnet_protocol_block*, %struct.libnet_protocol_block* }
%struct.libnet_stats = type { i64, i64, i64 }
%struct.libnet_ether_addr = type { [6 x i8] }
%struct.in_addr = type { i32 }
%struct.libnet_ipv4_hdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %struct.in_addr, %struct.in_addr }

@npkt = common global i32 0, align 4
@.str = private unnamed_addr constant [5 x i8] c"NULL\00", align 1
@netp = common global i32 0, align 4
@maskp = common global i32 0, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !97)
!1 = !DIFile(filename: "[inter]sniff.o.i", directory: "/home/lichi/Desktop/nast/[task]nast")
!2 = !{}
!3 = !{!4, !5, !11, !72}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !7, line: 33, baseType: !8)
!7 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !9, line: 30, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!10 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !13, line: 48, baseType: !14)
!13 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !15, line: 241, size: 1728, align: 64, elements: !16)
!15 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!16 = !{!17, !19, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !40, !41, !42, !43, !46, !48, !50, !54, !57, !59, !60, !61, !62, !63, !67, !68}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !14, file: !15, line: 242, baseType: !18, size: 32, align: 32)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !14, file: !15, line: 247, baseType: !20, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !14, file: !15, line: 248, baseType: !20, size: 64, align: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !14, file: !15, line: 249, baseType: !20, size: 64, align: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !14, file: !15, line: 250, baseType: !20, size: 64, align: 64, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !14, file: !15, line: 251, baseType: !20, size: 64, align: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !14, file: !15, line: 252, baseType: !20, size: 64, align: 64, offset: 384)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !14, file: !15, line: 253, baseType: !20, size: 64, align: 64, offset: 448)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !14, file: !15, line: 254, baseType: !20, size: 64, align: 64, offset: 512)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !14, file: !15, line: 256, baseType: !20, size: 64, align: 64, offset: 576)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !14, file: !15, line: 257, baseType: !20, size: 64, align: 64, offset: 640)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !14, file: !15, line: 258, baseType: !20, size: 64, align: 64, offset: 704)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !14, file: !15, line: 260, baseType: !33, size: 64, align: 64, offset: 768)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !15, line: 156, size: 192, align: 64, elements: !35)
!35 = !{!36, !37, !39}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !34, file: !15, line: 157, baseType: !33, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !34, file: !15, line: 158, baseType: !38, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !34, file: !15, line: 162, baseType: !18, size: 32, align: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !14, file: !15, line: 262, baseType: !38, size: 64, align: 64, offset: 832)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !14, file: !15, line: 264, baseType: !18, size: 32, align: 32, offset: 896)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !14, file: !15, line: 268, baseType: !18, size: 32, align: 32, offset: 928)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !14, file: !15, line: 270, baseType: !44, size: 64, align: 64, offset: 960)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !9, line: 131, baseType: !45)
!45 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !14, file: !15, line: 274, baseType: !47, size: 16, align: 16, offset: 1024)
!47 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !14, file: !15, line: 275, baseType: !49, size: 8, align: 8, offset: 1040)
!49 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !14, file: !15, line: 276, baseType: !51, size: 8, align: 8, offset: 1048)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, align: 8, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 1)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !14, file: !15, line: 280, baseType: !55, size: 64, align: 64, offset: 1088)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !15, line: 150, baseType: null)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !14, file: !15, line: 289, baseType: !58, size: 64, align: 64, offset: 1152)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !9, line: 132, baseType: !45)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !14, file: !15, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !14, file: !15, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !14, file: !15, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !14, file: !15, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !14, file: !15, line: 302, baseType: !64, size: 64, align: 64, offset: 1472)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !65, line: 216, baseType: !66)
!65 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!66 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !14, file: !15, line: 303, baseType: !18, size: 32, align: 32, offset: 1536)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !14, file: !15, line: 305, baseType: !69, size: 160, align: 8, offset: 1568)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 160, align: 8, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 20)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_ipv4_hdr", file: !74, line: 666, size: 160, align: 32, elements: !75)
!74 = !DIFile(filename: "/usr/local/include/libnet/libnet-headers.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!75 = !{!76, !79, !80, !81, !83, !84, !85, !86, !87, !88, !96}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ip_hl", scope: !73, file: !74, line: 669, baseType: !77, size: 4, align: 8, flags: DIFlagBitField, extraData: i64 0)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !78, line: 48, baseType: !10)
!78 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ip_v", scope: !73, file: !74, line: 670, baseType: !77, size: 4, align: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ip_tos", scope: !73, file: !74, line: 676, baseType: !77, size: 8, align: 8, offset: 8)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ip_len", scope: !73, file: !74, line: 689, baseType: !82, size: 16, align: 16, offset: 16)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !78, line: 49, baseType: !47)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !73, file: !74, line: 690, baseType: !82, size: 16, align: 16, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ip_off", scope: !73, file: !74, line: 691, baseType: !82, size: 16, align: 16, offset: 48)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl", scope: !73, file: !74, line: 704, baseType: !77, size: 8, align: 8, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ip_p", scope: !73, file: !74, line: 705, baseType: !77, size: 8, align: 8, offset: 72)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ip_sum", scope: !73, file: !74, line: 706, baseType: !82, size: 16, align: 16, offset: 80)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ip_src", scope: !73, file: !74, line: 707, baseType: !89, size: 32, align: 32, offset: 96)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !90, line: 31, size: 32, align: 32, elements: !91)
!90 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !89, file: !90, line: 33, baseType: !93, size: 32, align: 32)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !90, line: 30, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !78, line: 51, baseType: !95)
!95 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ip_dst", scope: !73, file: !74, line: 707, baseType: !89, size: 32, align: 32, offset: 128)
!97 = !{!98, !100, !102, !103, !104, !105, !123, !127, !131, !137, !138, !139, !140, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !171, !172, !175, !179, !180, !181}
!98 = distinct !DIGlobalVariable(name: "logd", scope: !0, file: !99, line: 98, type: !11, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @logd)
!99 = !DIFile(filename: "include/nast.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!100 = distinct !DIGlobalVariable(name: "offset", scope: !0, file: !99, line: 99, type: !101, isLocal: false, isDefinition: true, variable: i16* @offset)
!101 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!102 = distinct !DIGlobalVariable(name: "npkt", scope: !0, file: !99, line: 100, type: !18, isLocal: false, isDefinition: true, variable: i32* @npkt)
!103 = distinct !DIGlobalVariable(name: "packet", scope: !0, file: !99, line: 101, type: !5, isLocal: false, isDefinition: true, variable: i8** @packet)
!104 = distinct !DIGlobalVariable(name: "buf", scope: !0, file: !99, line: 102, type: !5, isLocal: false, isDefinition: true, variable: i8** @buf)
!105 = distinct !DIGlobalVariable(name: "hdr", scope: !0, file: !99, line: 103, type: !106, isLocal: false, isDefinition: true, variable: %struct.pcap_pkthdr* @hdr)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_pkthdr", file: !107, line: 199, size: 192, align: 64, elements: !108)
!107 = !DIFile(filename: "/usr/local/include/pcap/pcap.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!108 = !{!109, !117, !122}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !106, file: !107, line: 200, baseType: !110, size: 128, align: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !111, line: 30, size: 128, align: 64, elements: !112)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!112 = !{!113, !115}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !110, file: !111, line: 32, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !9, line: 139, baseType: !45)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !110, file: !111, line: 33, baseType: !116, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !9, line: 141, baseType: !45)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "caplen", scope: !106, file: !107, line: 201, baseType: !118, size: 32, align: 32, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "bpf_u_int32", file: !119, line: 85, baseType: !120)
!119 = !DIFile(filename: "/usr/local/include/pcap/bpf.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !7, line: 35, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !9, line: 32, baseType: !95)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !106, file: !107, line: 202, baseType: !118, size: 32, align: 32, offset: 160)
!123 = distinct !DIGlobalVariable(name: "descr", scope: !0, file: !99, line: 104, type: !124, isLocal: false, isDefinition: true, variable: %struct.pcap** @descr)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_t", file: !107, line: 118, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap", file: !107, line: 118, flags: DIFlagFwdDecl)
!127 = distinct !DIGlobalVariable(name: "dumper", scope: !0, file: !99, line: 105, type: !128, isLocal: false, isDefinition: true, variable: %struct.pcap_dumper** @dumper)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_dumper_t", file: !107, line: 119, baseType: !130)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_dumper", file: !107, line: 119, flags: DIFlagFwdDecl)
!131 = distinct !DIGlobalVariable(name: "statistic", scope: !0, file: !99, line: 106, type: !132, isLocal: false, isDefinition: true, variable: %struct.pcap_stat* @statistic)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_stat", file: !107, line: 208, size: 96, align: 32, elements: !133)
!133 = !{!134, !135, !136}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ps_recv", scope: !132, file: !107, line: 209, baseType: !120, size: 32, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ps_drop", scope: !132, file: !107, line: 210, baseType: !120, size: 32, align: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ps_ifdrop", scope: !132, file: !107, line: 211, baseType: !120, size: 32, align: 32, offset: 64)
!137 = distinct !DIGlobalVariable(name: "maskp", scope: !0, file: !99, line: 107, type: !118, isLocal: false, isDefinition: true, variable: i32* @maskp)
!138 = distinct !DIGlobalVariable(name: "netp", scope: !0, file: !99, line: 108, type: !118, isLocal: false, isDefinition: true, variable: i32* @netp)
!139 = distinct !DIGlobalVariable(name: "datalink", scope: !0, file: !99, line: 109, type: !18, isLocal: false, isDefinition: true, variable: i32* @datalink)
!140 = distinct !DIGlobalVariable(name: "fp", scope: !0, file: !99, line: 110, type: !141, isLocal: false, isDefinition: true, variable: %struct.bpf_program* @fp)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_program", file: !119, line: 104, size: 128, align: 64, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "bf_len", scope: !141, file: !119, line: 105, baseType: !120, size: 32, align: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "bf_insns", scope: !141, file: !119, line: 106, baseType: !145, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_insn", file: !119, line: 234, size: 64, align: 32, elements: !147)
!147 = !{!148, !151, !152, !153}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !146, file: !119, line: 235, baseType: !149, size: 16, align: 16)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !7, line: 34, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !9, line: 31, baseType: !47)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "jt", scope: !146, file: !119, line: 236, baseType: !6, size: 8, align: 8, offset: 16)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "jf", scope: !146, file: !119, line: 237, baseType: !6, size: 8, align: 8, offset: 24)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !146, file: !119, line: 238, baseType: !118, size: 32, align: 32, offset: 32)
!154 = distinct !DIGlobalVariable(name: "logname", scope: !0, file: !99, line: 111, type: !20, isLocal: false, isDefinition: true, variable: i8** @logname)
!155 = distinct !DIGlobalVariable(name: "tcpdl", scope: !0, file: !99, line: 112, type: !20, isLocal: false, isDefinition: true, variable: i8** @tcpdl)
!156 = distinct !DIGlobalVariable(name: "tr", scope: !0, file: !99, line: 113, type: !149, isLocal: false, isDefinition: true, variable: i16* @tr)
!157 = distinct !DIGlobalVariable(name: "tl", scope: !0, file: !99, line: 113, type: !149, isLocal: false, isDefinition: true, variable: i16* @tl)
!158 = distinct !DIGlobalVariable(name: "graph", scope: !0, file: !99, line: 114, type: !149, isLocal: false, isDefinition: true, variable: i16* @graph)
!159 = distinct !DIGlobalVariable(name: "cont", scope: !0, file: !99, line: 115, type: !149, isLocal: false, isDefinition: true, variable: i16* @cont)
!160 = distinct !DIGlobalVariable(name: "stream_glob", scope: !0, file: !99, line: 117, type: !18, isLocal: false, isDefinition: true, variable: i32* @stream_glob)
!161 = distinct !DIGlobalVariable(name: "bc_glob", scope: !0, file: !99, line: 118, type: !18, isLocal: false, isDefinition: true, variable: i32* @bc_glob)
!162 = distinct !DIGlobalVariable(name: "sniff_glob", scope: !0, file: !99, line: 119, type: !18, isLocal: false, isDefinition: true, variable: i32* @sniff_glob)
!163 = distinct !DIGlobalVariable(name: "rst_glob", scope: !0, file: !99, line: 120, type: !18, isLocal: false, isDefinition: true, variable: i32* @rst_glob)
!164 = distinct !DIGlobalVariable(name: "arp_glob", scope: !0, file: !99, line: 121, type: !18, isLocal: false, isDefinition: true, variable: i32* @arp_glob)
!165 = distinct !DIGlobalVariable(name: "pt", scope: !0, file: !99, line: 122, type: !166, isLocal: false, isDefinition: true, variable: [2 x i64]* @pt)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 128, align: 64, elements: !169)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !168, line: 60, baseType: !66)
!168 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!169 = !{!170}
!170 = !DISubrange(count: 2)
!171 = distinct !DIGlobalVariable(name: "lg", scope: !0, file: !99, line: 123, type: !18, isLocal: false, isDefinition: true, variable: i32* @lg)
!172 = distinct !DIGlobalVariable(name: "tm", scope: !0, file: !99, line: 132, type: !173, isLocal: false, isDefinition: true, variable: i64* @tm)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !174, line: 75, baseType: !114)
!174 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!175 = distinct !DIGlobalVariable(name: "timed", scope: !0, file: !99, line: 133, type: !176, isLocal: false, isDefinition: true, variable: [60 x i8]* @timed)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 480, align: 8, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 60)
!179 = distinct !DIGlobalVariable(name: "demonize", scope: !0, file: !99, line: 136, type: !149, isLocal: false, isDefinition: true, variable: i16* @demonize)
!180 = distinct !DIGlobalVariable(name: "line_s", scope: !0, file: !99, line: 138, type: !18, isLocal: false, isDefinition: true, variable: i32* @line_s)
!181 = distinct !DIGlobalVariable(name: "row_s", scope: !0, file: !99, line: 139, type: !18, isLocal: false, isDefinition: true, variable: i32* @row_s)
!182 = !{i32 2, !"Dwarf Version", i32 4}
!183 = !{i32 2, !"Debug Info Version", i32 3}
!184 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!185 = distinct !DISubprogram(name: "run_sniffer", scope: !186, file: !186, line: 27, type: !187, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!186 = !DIFile(filename: "sniff.c", directory: "/home/lichi/Desktop/nast/[task]nast")
!187 = !DISubroutineType(types: !188)
!188 = !{!18, !149, !149, !149, !149, !149, !149, !149, !20, !20, !20}
!189 = !DILocalVariable(name: "promisc", arg: 1, scope: !185, file: !186, line: 27, type: !149)
!190 = !DIExpression()
!191 = !DILocation(line: 27, column: 26, scope: !185)
!192 = !DILocalVariable(name: "data", arg: 2, scope: !185, file: !186, line: 27, type: !149)
!193 = !DILocation(line: 27, column: 43, scope: !185)
!194 = !DILocalVariable(name: "hex", arg: 3, scope: !185, file: !186, line: 27, type: !149)
!195 = !DILocation(line: 27, column: 57, scope: !185)
!196 = !DILocalVariable(name: "f", arg: 4, scope: !185, file: !186, line: 27, type: !149)
!197 = !DILocation(line: 27, column: 70, scope: !185)
!198 = !DILocalVariable(name: "l", arg: 5, scope: !185, file: !186, line: 27, type: !149)
!199 = !DILocation(line: 27, column: 81, scope: !185)
!200 = !DILocalVariable(name: "tcpdlog", arg: 6, scope: !185, file: !186, line: 27, type: !149)
!201 = !DILocation(line: 27, column: 92, scope: !185)
!202 = !DILocalVariable(name: "tcpdread", arg: 7, scope: !185, file: !186, line: 27, type: !149)
!203 = !DILocation(line: 27, column: 109, scope: !185)
!204 = !DILocalVariable(name: "filter", arg: 8, scope: !185, file: !186, line: 27, type: !20)
!205 = !DILocation(line: 27, column: 125, scope: !185)
!206 = !DILocalVariable(name: "dev", arg: 9, scope: !185, file: !186, line: 27, type: !20)
!207 = !DILocation(line: 27, column: 139, scope: !185)
!208 = !DILocalVariable(name: "ldname", arg: 10, scope: !185, file: !186, line: 27, type: !20)
!209 = !DILocation(line: 27, column: 150, scope: !185)
!210 = !DILocalVariable(name: "mask", scope: !185, file: !186, line: 29, type: !20)
!211 = !DILocation(line: 29, column: 10, scope: !185)
!212 = !DILocalVariable(name: "errbuf", scope: !185, file: !186, line: 30, type: !213)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, align: 8, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 256)
!216 = !DILocation(line: 30, column: 9, scope: !185)
!217 = !DILocalVariable(name: "L", scope: !185, file: !186, line: 31, type: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_t", file: !220, line: 235, baseType: !221)
!220 = !DIFile(filename: "/usr/local/include/libnet/libnet-structures.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_context", file: !220, line: 186, size: 3200, align: 64, elements: !222)
!222 = !{!223, !224, !225, !243, !244, !245, !246, !247, !248, !249, !256, !257, !261, !262}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !221, file: !220, line: 192, baseType: !18, size: 32, align: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "injection_type", scope: !221, file: !220, line: 194, baseType: !18, size: 32, align: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blocks", scope: !221, file: !220, line: 206, baseType: !226, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_pblock_t", file: !220, line: 178, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_protocol_block", file: !220, line: 77, size: 384, align: 64, elements: !229)
!229 = !{!230, !232, !233, !234, !235, !236, !237, !240, !242}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !228, file: !220, line: 79, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "b_len", scope: !228, file: !220, line: 80, baseType: !94, size: 32, align: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "h_len", scope: !228, file: !220, line: 81, baseType: !82, size: 16, align: 16, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "copied", scope: !228, file: !220, line: 92, baseType: !94, size: 32, align: 32, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !228, file: !220, line: 94, baseType: !77, size: 8, align: 8, offset: 160)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !228, file: !220, line: 168, baseType: !77, size: 8, align: 8, offset: 168)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ptag", scope: !228, file: !220, line: 170, baseType: !238, size: 32, align: 32, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_ptag_t", file: !220, line: 70, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !7, line: 196, baseType: !18)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !220, line: 175, baseType: !241, size: 64, align: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !228, file: !220, line: 176, baseType: !241, size: 64, align: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pblock_end", scope: !221, file: !220, line: 207, baseType: !226, size: 64, align: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "n_pblocks", scope: !221, file: !220, line: 208, baseType: !94, size: 32, align: 32, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "link_type", scope: !221, file: !220, line: 210, baseType: !18, size: 32, align: 32, offset: 224)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "link_offset", scope: !221, file: !220, line: 224, baseType: !18, size: 32, align: 32, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "aligner", scope: !221, file: !220, line: 225, baseType: !18, size: 32, align: 32, offset: 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !221, file: !220, line: 226, baseType: !20, size: 64, align: 64, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !221, file: !220, line: 228, baseType: !250, size: 192, align: 64, offset: 384)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_stats", file: !220, line: 52, size: 192, align: 64, elements: !251)
!251 = !{!252, !254, !255}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "packets_sent", scope: !250, file: !220, line: 55, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !78, line: 55, baseType: !66)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "packet_errors", scope: !250, file: !220, line: 56, baseType: !253, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !250, file: !220, line: 57, baseType: !253, size: 64, align: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ptag_state", scope: !221, file: !220, line: 229, baseType: !238, size: 32, align: 32, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !221, file: !220, line: 230, baseType: !258, size: 512, align: 8, offset: 608)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 512, align: 8, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "err_buf", scope: !221, file: !220, line: 232, baseType: !213, size: 2048, align: 8, offset: 1120)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !221, file: !220, line: 233, baseType: !94, size: 32, align: 32, offset: 3168)
!263 = !DILocation(line: 31, column: 14, scope: !185)
!264 = !DILocalVariable(name: "ld", scope: !185, file: !186, line: 32, type: !18)
!265 = !DILocation(line: 32, column: 8, scope: !185)
!266 = !DILocalVariable(name: "e", scope: !185, file: !186, line: 33, type: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_ether_addr", file: !74, line: 530, size: 48, align: 8, elements: !269)
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ether_addr_octet", scope: !268, file: !74, line: 532, baseType: !271, size: 48, align: 8)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 48, align: 8, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 6)
!274 = !DILocation(line: 33, column: 30, scope: !185)
!275 = !DILocalVariable(name: "addr", scope: !185, file: !186, line: 34, type: !89)
!276 = !DILocation(line: 34, column: 19, scope: !185)
!277 = !DILocalVariable(name: "ldd", scope: !185, file: !186, line: 36, type: !11)
!278 = !DILocation(line: 36, column: 10, scope: !185)
!279 = !DILocation(line: 38, column: 8, scope: !185)
!280 = !DILocation(line: 39, column: 7, scope: !185)
!281 = !DILocation(line: 40, column: 9, scope: !185)
!282 = !DILocation(line: 41, column: 16, scope: !283)
!283 = distinct !DILexicalBlock(scope: !185, file: !186, line: 41, column: 8)
!284 = !DILocation(line: 41, column: 8, scope: !283)
!285 = !DILocation(line: 41, column: 8, scope: !185)
!286 = !DILocation(line: 42, column: 9, scope: !283)
!287 = !DILocation(line: 42, column: 6, scope: !283)
!288 = !DILocation(line: 45, column: 24, scope: !289)
!289 = distinct !DILexicalBlock(scope: !185, file: !186, line: 45, column: 8)
!290 = !DILocation(line: 45, column: 41, scope: !289)
!291 = !DILocation(line: 45, column: 9, scope: !289)
!292 = !DILocation(line: 45, column: 49, scope: !289)
!293 = !DILocation(line: 45, column: 8, scope: !185)
!294 = !DILocation(line: 47, column: 45, scope: !295)
!295 = distinct !DILexicalBlock(scope: !289, file: !186, line: 46, column: 6)
!296 = !DILocation(line: 47, column: 2, scope: !295)
!297 = !DILocation(line: 48, column: 6, scope: !295)
!298 = !DILocation(line: 50, column: 8, scope: !299)
!299 = distinct !DILexicalBlock(scope: !185, file: !186, line: 50, column: 8)
!300 = !DILocation(line: 50, column: 8, scope: !185)
!301 = !DILocation(line: 52, column: 31, scope: !302)
!302 = distinct !DILexicalBlock(scope: !303, file: !186, line: 52, column: 6)
!303 = distinct !DILexicalBlock(scope: !299, file: !186, line: 51, column: 6)
!304 = !DILocation(line: 52, column: 43, scope: !302)
!305 = !DILocation(line: 52, column: 56, scope: !302)
!306 = !DILocation(line: 52, column: 15, scope: !302)
!307 = !DILocation(line: 52, column: 13, scope: !302)
!308 = !DILocation(line: 52, column: 64, scope: !302)
!309 = !DILocation(line: 52, column: 6, scope: !303)
!310 = !DILocation(line: 54, column: 51, scope: !311)
!311 = distinct !DILexicalBlock(scope: !302, file: !186, line: 53, column: 4)
!312 = !DILocation(line: 54, column: 7, scope: !311)
!313 = !DILocation(line: 55, column: 4, scope: !311)
!314 = !DILocation(line: 57, column: 31, scope: !315)
!315 = distinct !DILexicalBlock(scope: !303, file: !186, line: 57, column: 6)
!316 = !DILocation(line: 57, column: 37, scope: !315)
!317 = !DILocation(line: 57, column: 16, scope: !315)
!318 = !DILocation(line: 57, column: 14, scope: !315)
!319 = !DILocation(line: 57, column: 44, scope: !315)
!320 = !DILocation(line: 57, column: 6, scope: !303)
!321 = !DILocation(line: 59, column: 51, scope: !322)
!322 = distinct !DILexicalBlock(scope: !315, file: !186, line: 58, column: 4)
!323 = !DILocation(line: 59, column: 7, scope: !322)
!324 = !DILocation(line: 60, column: 4, scope: !322)
!325 = !DILocation(line: 61, column: 6, scope: !303)
