; ModuleID = './[inter]prom.o.i'
source_filename = "./[inter]prom.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.pcap = type opaque
%struct.bpf_program = type { i32, %struct.bpf_insn* }
%struct.bpf_insn = type { i16, i8, i8, i32 }
%struct.pcap_pkthdr = type { %struct.timeval, i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.pcap_dumper = type opaque
%struct.pcap_stat = type { i32, i32, i32 }
%struct.fd_set = type { [16 x i64] }
%struct.libnet_context = type { i32, i32, %struct.libnet_protocol_block*, %struct.libnet_protocol_block*, i32, i32, i32, i32, i8*, %struct.libnet_stats, i32, [64 x i8], [256 x i8], i32 }
%struct.libnet_protocol_block = type { i8*, i32, i16, i32, i8, i8, i32, %struct.libnet_protocol_block*, %struct.libnet_protocol_block* }
%struct.libnet_stats = type { i64, i64, i64 }
%struct.libnet_ether_addr = type { [6 x i8] }
%struct.nast_arp_hdr = type { i16, i16, i8, i8, i16, [6 x i8], [4 x i8], [6 x i8], [4 x i8] }
%struct.host = type { [6 x i8], [4 x i8] }

@psearch.enet_dst = private unnamed_addr constant [6 x i8] c"\FF\FF\00\00\00\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !35)
!1 = !DIFile(filename: "[inter]prom.o.i", directory: "/home/lichi/Desktop/nast/[task]nast")
!2 = !{}
!3 = !{!4, !5, !11, !14, !15}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !7, line: 33, baseType: !8)
!7 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !9, line: 30, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!10 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !12, line: 54, baseType: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!13 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nast_arp_hdr", file: !17, line: 27, size: 224, align: 16, elements: !18)
!17 = !DIFile(filename: "include/ARPhdr.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!18 = !{!19, !21, !22, !23, !24, !25, !29, !33, !34}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ar_hrd", scope: !16, file: !17, line: 29, baseType: !20, size: 16, align: 16)
!20 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ar_pro", scope: !16, file: !17, line: 30, baseType: !20, size: 16, align: 16, offset: 16)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ar_hln", scope: !16, file: !17, line: 31, baseType: !10, size: 8, align: 8, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ar_pln", scope: !16, file: !17, line: 32, baseType: !10, size: 8, align: 8, offset: 40)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ar_op", scope: !16, file: !17, line: 33, baseType: !20, size: 16, align: 16, offset: 48)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__ar_sha", scope: !16, file: !17, line: 35, baseType: !26, size: 48, align: 8, offset: 64)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 48, align: 8, elements: !27)
!27 = !{!28}
!28 = !DISubrange(count: 6)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__ar_sip", scope: !16, file: !17, line: 36, baseType: !30, size: 32, align: 8, offset: 112)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32, align: 8, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 4)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__ar_tha", scope: !16, file: !17, line: 37, baseType: !26, size: 48, align: 8, offset: 144)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__ar_tip", scope: !16, file: !17, line: 38, baseType: !30, size: 32, align: 8, offset: 192)
!35 = !{!36, !96, !98, !99, !100, !101, !120, !124, !128, !134, !135, !136, !137, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !168, !169, !172, !176, !177, !178}
!36 = distinct !DIGlobalVariable(name: "logd", scope: !0, file: !37, line: 98, type: !38, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @logd)
!37 = !DIFile(filename: "include/nast.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !40, line: 48, baseType: !41)
!40 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !42, line: 241, size: 1728, align: 64, elements: !43)
!42 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!43 = !{!44, !45, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !66, !67, !68, !69, !71, !72, !74, !78, !81, !83, !84, !85, !86, !87, !91, !92}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !41, file: !42, line: 242, baseType: !14, size: 32, align: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !41, file: !42, line: 247, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !41, file: !42, line: 248, baseType: !46, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !41, file: !42, line: 249, baseType: !46, size: 64, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !41, file: !42, line: 250, baseType: !46, size: 64, align: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !41, file: !42, line: 251, baseType: !46, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !41, file: !42, line: 252, baseType: !46, size: 64, align: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !41, file: !42, line: 253, baseType: !46, size: 64, align: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !41, file: !42, line: 254, baseType: !46, size: 64, align: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !41, file: !42, line: 256, baseType: !46, size: 64, align: 64, offset: 576)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !41, file: !42, line: 257, baseType: !46, size: 64, align: 64, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !41, file: !42, line: 258, baseType: !46, size: 64, align: 64, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !41, file: !42, line: 260, baseType: !59, size: 64, align: 64, offset: 768)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !42, line: 156, size: 192, align: 64, elements: !61)
!61 = !{!62, !63, !65}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !60, file: !42, line: 157, baseType: !59, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !60, file: !42, line: 158, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !60, file: !42, line: 162, baseType: !14, size: 32, align: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !41, file: !42, line: 262, baseType: !64, size: 64, align: 64, offset: 832)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !41, file: !42, line: 264, baseType: !14, size: 32, align: 32, offset: 896)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !41, file: !42, line: 268, baseType: !14, size: 32, align: 32, offset: 928)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !41, file: !42, line: 270, baseType: !70, size: 64, align: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !9, line: 131, baseType: !13)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !41, file: !42, line: 274, baseType: !20, size: 16, align: 16, offset: 1024)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !41, file: !42, line: 275, baseType: !73, size: 8, align: 8, offset: 1040)
!73 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !41, file: !42, line: 276, baseType: !75, size: 8, align: 8, offset: 1048)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8, align: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !41, file: !42, line: 280, baseType: !79, size: 64, align: 64, offset: 1088)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !42, line: 150, baseType: null)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !41, file: !42, line: 289, baseType: !82, size: 64, align: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !9, line: 132, baseType: !13)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !41, file: !42, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !41, file: !42, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !41, file: !42, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !41, file: !42, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !41, file: !42, line: 302, baseType: !88, size: 64, align: 64, offset: 1472)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !89, line: 216, baseType: !90)
!89 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!90 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !41, file: !42, line: 303, baseType: !14, size: 32, align: 32, offset: 1536)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !41, file: !42, line: 305, baseType: !93, size: 160, align: 8, offset: 1568)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 160, align: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 20)
!96 = distinct !DIGlobalVariable(name: "offset", scope: !0, file: !37, line: 99, type: !97, isLocal: false, isDefinition: true, variable: i16* @offset)
!97 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!98 = distinct !DIGlobalVariable(name: "npkt", scope: !0, file: !37, line: 100, type: !14, isLocal: false, isDefinition: true, variable: i32* @npkt)
!99 = distinct !DIGlobalVariable(name: "packet", scope: !0, file: !37, line: 101, type: !5, isLocal: false, isDefinition: true, variable: i8** @packet)
!100 = distinct !DIGlobalVariable(name: "buf", scope: !0, file: !37, line: 102, type: !5, isLocal: false, isDefinition: true, variable: i8** @buf)
!101 = distinct !DIGlobalVariable(name: "hdr", scope: !0, file: !37, line: 103, type: !102, isLocal: false, isDefinition: true, variable: %struct.pcap_pkthdr* @hdr)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_pkthdr", file: !103, line: 199, size: 192, align: 64, elements: !104)
!103 = !DIFile(filename: "/usr/local/include/pcap/pcap.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!104 = !{!105, !113, !119}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !102, file: !103, line: 200, baseType: !106, size: 128, align: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !107, line: 30, size: 128, align: 64, elements: !108)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!108 = !{!109, !111}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !106, file: !107, line: 32, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !9, line: 139, baseType: !13)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !106, file: !107, line: 33, baseType: !112, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !9, line: 141, baseType: !13)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "caplen", scope: !102, file: !103, line: 201, baseType: !114, size: 32, align: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "bpf_u_int32", file: !115, line: 85, baseType: !116)
!115 = !DIFile(filename: "/usr/local/include/pcap/bpf.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !7, line: 35, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !9, line: 32, baseType: !118)
!118 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !102, file: !103, line: 202, baseType: !114, size: 32, align: 32, offset: 160)
!120 = distinct !DIGlobalVariable(name: "descr", scope: !0, file: !37, line: 104, type: !121, isLocal: false, isDefinition: true, variable: %struct.pcap** @descr)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_t", file: !103, line: 118, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap", file: !103, line: 118, flags: DIFlagFwdDecl)
!124 = distinct !DIGlobalVariable(name: "dumper", scope: !0, file: !37, line: 105, type: !125, isLocal: false, isDefinition: true, variable: %struct.pcap_dumper** @dumper)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_dumper_t", file: !103, line: 119, baseType: !127)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_dumper", file: !103, line: 119, flags: DIFlagFwdDecl)
!128 = distinct !DIGlobalVariable(name: "statistic", scope: !0, file: !37, line: 106, type: !129, isLocal: false, isDefinition: true, variable: %struct.pcap_stat* @statistic)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_stat", file: !103, line: 208, size: 96, align: 32, elements: !130)
!130 = !{!131, !132, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ps_recv", scope: !129, file: !103, line: 209, baseType: !116, size: 32, align: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "ps_drop", scope: !129, file: !103, line: 210, baseType: !116, size: 32, align: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ps_ifdrop", scope: !129, file: !103, line: 211, baseType: !116, size: 32, align: 32, offset: 64)
!134 = distinct !DIGlobalVariable(name: "maskp", scope: !0, file: !37, line: 107, type: !114, isLocal: false, isDefinition: true, variable: i32* @maskp)
!135 = distinct !DIGlobalVariable(name: "netp", scope: !0, file: !37, line: 108, type: !114, isLocal: false, isDefinition: true, variable: i32* @netp)
!136 = distinct !DIGlobalVariable(name: "datalink", scope: !0, file: !37, line: 109, type: !14, isLocal: false, isDefinition: true, variable: i32* @datalink)
!137 = distinct !DIGlobalVariable(name: "fp", scope: !0, file: !37, line: 110, type: !138, isLocal: false, isDefinition: true, variable: %struct.bpf_program* @fp)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_program", file: !115, line: 104, size: 128, align: 64, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "bf_len", scope: !138, file: !115, line: 105, baseType: !116, size: 32, align: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "bf_insns", scope: !138, file: !115, line: 106, baseType: !142, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_insn", file: !115, line: 234, size: 64, align: 32, elements: !144)
!144 = !{!145, !148, !149, !150}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !143, file: !115, line: 235, baseType: !146, size: 16, align: 16)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !7, line: 34, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !9, line: 31, baseType: !20)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "jt", scope: !143, file: !115, line: 236, baseType: !6, size: 8, align: 8, offset: 16)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "jf", scope: !143, file: !115, line: 237, baseType: !6, size: 8, align: 8, offset: 24)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !143, file: !115, line: 238, baseType: !114, size: 32, align: 32, offset: 32)
!151 = distinct !DIGlobalVariable(name: "logname", scope: !0, file: !37, line: 111, type: !46, isLocal: false, isDefinition: true, variable: i8** @logname)
!152 = distinct !DIGlobalVariable(name: "tcpdl", scope: !0, file: !37, line: 112, type: !46, isLocal: false, isDefinition: true, variable: i8** @tcpdl)
!153 = distinct !DIGlobalVariable(name: "tr", scope: !0, file: !37, line: 113, type: !146, isLocal: false, isDefinition: true, variable: i16* @tr)
!154 = distinct !DIGlobalVariable(name: "tl", scope: !0, file: !37, line: 113, type: !146, isLocal: false, isDefinition: true, variable: i16* @tl)
!155 = distinct !DIGlobalVariable(name: "graph", scope: !0, file: !37, line: 114, type: !146, isLocal: false, isDefinition: true, variable: i16* @graph)
!156 = distinct !DIGlobalVariable(name: "cont", scope: !0, file: !37, line: 115, type: !146, isLocal: false, isDefinition: true, variable: i16* @cont)
!157 = distinct !DIGlobalVariable(name: "stream_glob", scope: !0, file: !37, line: 117, type: !14, isLocal: false, isDefinition: true, variable: i32* @stream_glob)
!158 = distinct !DIGlobalVariable(name: "bc_glob", scope: !0, file: !37, line: 118, type: !14, isLocal: false, isDefinition: true, variable: i32* @bc_glob)
!159 = distinct !DIGlobalVariable(name: "sniff_glob", scope: !0, file: !37, line: 119, type: !14, isLocal: false, isDefinition: true, variable: i32* @sniff_glob)
!160 = distinct !DIGlobalVariable(name: "rst_glob", scope: !0, file: !37, line: 120, type: !14, isLocal: false, isDefinition: true, variable: i32* @rst_glob)
!161 = distinct !DIGlobalVariable(name: "arp_glob", scope: !0, file: !37, line: 121, type: !14, isLocal: false, isDefinition: true, variable: i32* @arp_glob)
!162 = distinct !DIGlobalVariable(name: "pt", scope: !0, file: !37, line: 122, type: !163, isLocal: false, isDefinition: true, variable: [2 x i64]* @pt)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 128, align: 64, elements: !166)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !165, line: 60, baseType: !90)
!165 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!166 = !{!167}
!167 = !DISubrange(count: 2)
!168 = distinct !DIGlobalVariable(name: "lg", scope: !0, file: !37, line: 123, type: !14, isLocal: false, isDefinition: true, variable: i32* @lg)
!169 = distinct !DIGlobalVariable(name: "tm", scope: !0, file: !37, line: 132, type: !170, isLocal: false, isDefinition: true, variable: i64* @tm)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !171, line: 75, baseType: !110)
!171 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!172 = distinct !DIGlobalVariable(name: "timed", scope: !0, file: !37, line: 133, type: !173, isLocal: false, isDefinition: true, variable: [60 x i8]* @timed)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 480, align: 8, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 60)
!176 = distinct !DIGlobalVariable(name: "demonize", scope: !0, file: !37, line: 136, type: !146, isLocal: false, isDefinition: true, variable: i16* @demonize)
!177 = distinct !DIGlobalVariable(name: "line_s", scope: !0, file: !37, line: 138, type: !14, isLocal: false, isDefinition: true, variable: i32* @line_s)
!178 = distinct !DIGlobalVariable(name: "row_s", scope: !0, file: !37, line: 139, type: !14, isLocal: false, isDefinition: true, variable: i32* @row_s)
!179 = !{i32 2, !"Dwarf Version", i32 4}
!180 = !{i32 2, !"Debug Info Version", i32 3}
!181 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!182 = distinct !DISubprogram(name: "psearch", scope: !183, file: !183, line: 24, type: !184, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!183 = !DIFile(filename: "prom.c", directory: "/home/lichi/Desktop/nast/[task]nast")
!184 = !DISubroutineType(types: !185)
!185 = !{!14, !46, !186, !146}
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_long", file: !7, line: 36, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_long", file: !9, line: 33, baseType: !90)
!188 = !DILocalVariable(name: "dev", arg: 1, scope: !182, file: !183, line: 24, type: !46)
!189 = !DIExpression()
!190 = !DILocation(line: 24, column: 20, scope: !182)
!191 = !DILocalVariable(name: "ip_dst", arg: 2, scope: !182, file: !183, line: 24, type: !186)
!192 = !DILocation(line: 24, column: 32, scope: !182)
!193 = !DILocalVariable(name: "lg", arg: 3, scope: !182, file: !183, line: 24, type: !146)
!194 = !DILocation(line: 24, column: 48, scope: !182)
!195 = !DILocalVariable(name: "enet_dst", scope: !182, file: !183, line: 26, type: !196)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 48, align: 8, elements: !27)
!197 = !DILocation(line: 26, column: 11, scope: !182)
!198 = !DILocalVariable(name: "enet_src", scope: !182, file: !183, line: 30, type: !196)
!199 = !DILocation(line: 30, column: 11, scope: !182)
!200 = !DILocalVariable(name: "ip_src", scope: !182, file: !183, line: 31, type: !186)
!201 = !DILocation(line: 31, column: 11, scope: !182)
!202 = !DILocalVariable(name: "errbuf", scope: !182, file: !183, line: 32, type: !203)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 2048, align: 8, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 256)
!206 = !DILocation(line: 32, column: 9, scope: !182)
!207 = !DILocalVariable(name: "sd", scope: !182, file: !183, line: 33, type: !14)
!208 = !DILocation(line: 33, column: 8, scope: !182)
!209 = !DILocalVariable(name: "ln", scope: !182, file: !183, line: 33, type: !14)
!210 = !DILocation(line: 33, column: 11, scope: !182)
!211 = !DILocalVariable(name: "rfsd", scope: !182, file: !183, line: 34, type: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !12, line: 75, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 64, size: 1024, align: 64, elements: !214)
!214 = !{!215}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__fds_bits", scope: !213, file: !12, line: 72, baseType: !216, size: 1024, align: 64)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1024, align: 64, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 16)
!219 = !DILocation(line: 34, column: 11, scope: !182)
!220 = !DILocalVariable(name: "tv", scope: !182, file: !183, line: 35, type: !106)
!221 = !DILocation(line: 35, column: 19, scope: !182)
!222 = !DILocalVariable(name: "l", scope: !182, file: !183, line: 36, type: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_t", file: !225, line: 235, baseType: !226)
!225 = !DIFile(filename: "/usr/local/include/libnet/libnet-structures.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_context", file: !225, line: 186, size: 3200, align: 64, elements: !227)
!227 = !{!228, !229, !230, !252, !253, !254, !255, !256, !257, !258, !265, !266, !270, !271}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !226, file: !225, line: 192, baseType: !14, size: 32, align: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "injection_type", scope: !226, file: !225, line: 194, baseType: !14, size: 32, align: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blocks", scope: !226, file: !225, line: 206, baseType: !231, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_pblock_t", file: !225, line: 178, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_protocol_block", file: !225, line: 77, size: 384, align: 64, elements: !234)
!234 = !{!235, !239, !241, !243, !244, !245, !246, !249, !251}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !233, file: !225, line: 79, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !238, line: 48, baseType: !10)
!238 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!239 = !DIDerivedType(tag: DW_TAG_member, name: "b_len", scope: !233, file: !225, line: 80, baseType: !240, size: 32, align: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !238, line: 51, baseType: !118)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "h_len", scope: !233, file: !225, line: 81, baseType: !242, size: 16, align: 16, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !238, line: 49, baseType: !20)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "copied", scope: !233, file: !225, line: 92, baseType: !240, size: 32, align: 32, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !233, file: !225, line: 94, baseType: !237, size: 8, align: 8, offset: 160)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !233, file: !225, line: 168, baseType: !237, size: 8, align: 8, offset: 168)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ptag", scope: !233, file: !225, line: 170, baseType: !247, size: 32, align: 32, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_ptag_t", file: !225, line: 70, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !7, line: 196, baseType: !14)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !233, file: !225, line: 175, baseType: !250, size: 64, align: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !233, file: !225, line: 176, baseType: !250, size: 64, align: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pblock_end", scope: !226, file: !225, line: 207, baseType: !231, size: 64, align: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "n_pblocks", scope: !226, file: !225, line: 208, baseType: !240, size: 32, align: 32, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "link_type", scope: !226, file: !225, line: 210, baseType: !14, size: 32, align: 32, offset: 224)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "link_offset", scope: !226, file: !225, line: 224, baseType: !14, size: 32, align: 32, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "aligner", scope: !226, file: !225, line: 225, baseType: !14, size: 32, align: 32, offset: 288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !226, file: !225, line: 226, baseType: !46, size: 64, align: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !226, file: !225, line: 228, baseType: !259, size: 192, align: 64, offset: 384)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_stats", file: !225, line: 52, size: 192, align: 64, elements: !260)
!260 = !{!261, !263, !264}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "packets_sent", scope: !259, file: !225, line: 55, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !238, line: 55, baseType: !90)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "packet_errors", scope: !259, file: !225, line: 56, baseType: !262, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !259, file: !225, line: 57, baseType: !262, size: 64, align: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ptag_state", scope: !226, file: !225, line: 229, baseType: !247, size: 32, align: 32, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !226, file: !225, line: 230, baseType: !267, size: 512, align: 8, offset: 608)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 512, align: 8, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "err_buf", scope: !226, file: !225, line: 232, baseType: !203, size: 2048, align: 8, offset: 1120)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !226, file: !225, line: 233, baseType: !240, size: 32, align: 32, offset: 3168)
!272 = !DILocation(line: 36, column: 14, scope: !182)
!273 = !DILocalVariable(name: "e", scope: !182, file: !183, line: 37, type: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_ether_addr", file: !276, line: 530, size: 48, align: 8, elements: !277)
!276 = !DIFile(filename: "/usr/local/include/libnet/libnet-headers.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!277 = !{!278}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ether_addr_octet", scope: !275, file: !276, line: 532, baseType: !279, size: 48, align: 8)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 48, align: 8, elements: !27)
!280 = !DILocation(line: 37, column: 30, scope: !182)
!281 = !DILocalVariable(name: "arp", scope: !182, file: !183, line: 38, type: !15)
!282 = !DILocation(line: 38, column: 25, scope: !182)
!283 = !DILocalVariable(name: "pkt", scope: !182, file: !183, line: 39, type: !5)
!284 = !DILocation(line: 39, column: 12, scope: !182)
!285 = !DILocalVariable(name: "uphost", scope: !182, file: !183, line: 40, type: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "host", file: !37, line: 125, size: 80, align: 8, elements: !288)
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !287, file: !37, line: 127, baseType: !26, size: 48, align: 8)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !287, file: !37, line: 128, baseType: !30, size: 32, align: 8, offset: 48)
!291 = !DILocation(line: 40, column: 17, scope: !182)
!292 = !DILocalVariable(name: "pcount", scope: !182, file: !183, line: 41, type: !146)
!293 = !DILocation(line: 41, column: 12, scope: !182)
!294 = !DILocalVariable(name: "i", scope: !182, file: !183, line: 41, type: !146)
!295 = !DILocation(line: 41, column: 20, scope: !182)
!296 = !DILocalVariable(name: "k", scope: !182, file: !183, line: 41, type: !146)
!297 = !DILocation(line: 41, column: 23, scope: !182)
!298 = !DILocalVariable(name: "ip", scope: !182, file: !183, line: 42, type: !299)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, align: 8, elements: !217)
!300 = !DILocation(line: 42, column: 11, scope: !182)
!301 = !DILocation(line: 44, column: 10, scope: !182)
!302 = !DILocation(line: 44, column: 6, scope: !182)
!303 = !DILocation(line: 45, column: 7, scope: !182)
!304 = !DILocation(line: 47, column: 8, scope: !305)
!305 = distinct !DILexicalBlock(scope: !182, file: !183, line: 47, column: 8)
!306 = !DILocation(line: 47, column: 8, scope: !182)
!307 = !DILocation(line: 49, column: 2, scope: !308)
!308 = distinct !DILexicalBlock(scope: !305, file: !183, line: 48, column: 6)
!309 = !DILocation(line: 50, column: 19, scope: !308)
!310 = !DILocation(line: 50, column: 2, scope: !308)
!311 = !DILocation(line: 51, column: 9, scope: !308)
!312 = !DILocation(line: 51, column: 2, scope: !308)
!313 = !DILocation(line: 52, column: 19, scope: !308)
!314 = !DILocation(line: 52, column: 2, scope: !308)
!315 = !DILocation(line: 53, column: 19, scope: !308)
!316 = !DILocation(line: 53, column: 2, scope: !308)
!317 = !DILocation(line: 54, column: 6, scope: !308)
!318 = !DILocation(line: 57, column: 8, scope: !319)
!319 = distinct !DILexicalBlock(scope: !182, file: !183, line: 57, column: 8)
!320 = !DILocation(line: 57, column: 8, scope: !182)
!321 = !DILocation(line: 58, column: 6, scope: !319)
!322 = !DILocation(line: 62, column: 8, scope: !323)
!323 = distinct !DILexicalBlock(scope: !182, file: !183, line: 62, column: 8)
!324 = !DILocation(line: 62, column: 8, scope: !182)
!325 = !DILocation(line: 64, column: 2, scope: !326)
!326 = distinct !DILexicalBlock(scope: !323, file: !183, line: 63, column: 6)
!327 = !DILocation(line: 65, column: 10, scope: !326)
!328 = !DILocation(line: 66, column: 6, scope: !326)
!329 = !DILocation(line: 69, column: 22, scope: !182)
!330 = !DILocation(line: 69, column: 4, scope: !182)
!331 = !DILocation(line: 71, column: 38, scope: !332)
!332 = distinct !DILexicalBlock(scope: !182, file: !183, line: 71, column: 8)
!333 = !DILocation(line: 71, column: 43, scope: !332)
!334 = !DILocation(line: 71, column: 13, scope: !332)
!335 = !DILocation(line: 71, column: 11, scope: !332)
!336 = !DILocation(line: 71, column: 51, scope: !332)
!337 = !DILocation(line: 71, column: 8, scope: !182)
!338 = !DILocation(line: 73, column: 43, scope: !339)
!339 = distinct !DILexicalBlock(scope: !332, file: !183, line: 72, column: 6)
!340 = !DILocation(line: 73, column: 9, scope: !339)
!341 = !DILocation(line: 74, column: 6, scope: !339)
!342 = !DILocation(line: 76, column: 31, scope: !343)
!343 = distinct !DILexicalBlock(scope: !182, file: !183, line: 76, column: 8)
!344 = !DILocation(line: 76, column: 13, scope: !343)
!345 = !DILocation(line: 76, column: 11, scope: !343)
!346 = !DILocation(line: 76, column: 34, scope: !343)
!347 = !DILocation(line: 76, column: 8, scope: !182)
!348 = !DILocation(line: 78, column: 67, scope: !349)
!349 = distinct !DILexicalBlock(scope: !343, file: !183, line: 77, column: 6)
!350 = !DILocation(line: 78, column: 51, scope: !349)
!351 = !DILocation(line: 78, column: 2, scope: !352)
!352 = !DILexicalBlockFile(scope: !349, file: !183, discriminator: 1)
!353 = !DILocation(line: 79, column: 6, scope: !349)
!354 = !DILocation(line: 81, column: 4, scope: !182)
!355 = !DILocation(line: 81, column: 22, scope: !182)
