; ModuleID = './[inter]udp.o.i'
source_filename = "./[inter]udp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.pcap_pkthdr = type { %struct.timeval, i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.pcap = type opaque
%struct.pcap_dumper = type opaque
%struct.pcap_stat = type { i32, i32, i32 }
%struct.bpf_program = type { i32, %struct.bpf_insn* }
%struct.bpf_insn = type { i16, i8, i8, i32 }
%struct.libnet_ipv4_hdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %struct.in_addr, %struct.in_addr }
%struct.in_addr = type { i32 }
%struct.libnet_udp_hdr = type { i16, i16, i16, i16 }
%struct.servent = type { i8*, i8**, i32, i8* }

@packet = common global i8* null, align 8
@offset = common global i16 0, align 2
@.str = private unnamed_addr constant [4 x i8] c"udp\00", align 1
@.str.1 = private unnamed_addr constant [6 x i8] c"princ\00", align 1
@line_s = common global i32 0, align 4
@row_s = common global i32 0, align 4
@lg = common global i32 0, align 4
@.str.2 = private unnamed_addr constant [72 x i8] c"\0A---[ UDP ]-----------------------------------------------------------\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !40)
!1 = !DIFile(filename: "[inter]udp.o.i", directory: "/home/lichi/Desktop/nast/[task]nast")
!2 = !{}
!3 = !{!4, !31, !38}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_ipv4_hdr", file: !6, line: 666, size: 160, align: 32, elements: !7)
!6 = !DIFile(filename: "/usr/local/include/libnet/libnet-headers.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!7 = !{!8, !12, !13, !14, !17, !18, !19, !20, !21, !22, !30}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "ip_hl", scope: !5, file: !6, line: 669, baseType: !9, size: 4, align: 8, flags: DIFlagBitField, extraData: i64 0)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !10, line: 48, baseType: !11)
!10 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!11 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "ip_v", scope: !5, file: !6, line: 670, baseType: !9, size: 4, align: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "ip_tos", scope: !5, file: !6, line: 676, baseType: !9, size: 8, align: 8, offset: 8)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "ip_len", scope: !5, file: !6, line: 689, baseType: !15, size: 16, align: 16, offset: 16)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !10, line: 49, baseType: !16)
!16 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !5, file: !6, line: 690, baseType: !15, size: 16, align: 16, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ip_off", scope: !5, file: !6, line: 691, baseType: !15, size: 16, align: 16, offset: 48)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl", scope: !5, file: !6, line: 704, baseType: !9, size: 8, align: 8, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ip_p", scope: !5, file: !6, line: 705, baseType: !9, size: 8, align: 8, offset: 72)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ip_sum", scope: !5, file: !6, line: 706, baseType: !15, size: 16, align: 16, offset: 80)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ip_src", scope: !5, file: !6, line: 707, baseType: !23, size: 32, align: 32, offset: 96)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !24, line: 31, size: 32, align: 32, elements: !25)
!24 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!25 = !{!26}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !23, file: !24, line: 33, baseType: !27, size: 32, align: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !24, line: 30, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !10, line: 51, baseType: !29)
!29 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ip_dst", scope: !5, file: !6, line: 707, baseType: !23, size: 32, align: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_udp_hdr", file: !6, line: 1728, size: 64, align: 16, elements: !33)
!33 = !{!34, !35, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "uh_sport", scope: !32, file: !6, line: 1730, baseType: !15, size: 16, align: 16)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "uh_dport", scope: !32, file: !6, line: 1731, baseType: !15, size: 16, align: 16, offset: 16)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "uh_ulen", scope: !32, file: !6, line: 1732, baseType: !15, size: 16, align: 16, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "uh_sum", scope: !32, file: !6, line: 1733, baseType: !15, size: 16, align: 16, offset: 48)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!40 = !{!41, !103, !105, !106, !111, !112, !130, !134, !138, !144, !145, !146, !147, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !178, !179, !182, !186, !187, !188}
!41 = distinct !DIGlobalVariable(name: "logd", scope: !0, file: !42, line: 98, type: !43, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @logd)
!42 = !DIFile(filename: "include/nast.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !45, line: 48, baseType: !46)
!45 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 241, size: 1728, align: 64, elements: !48)
!47 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!48 = !{!49, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !70, !71, !72, !73, !77, !78, !80, !84, !87, !89, !91, !92, !93, !94, !98, !99}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !46, file: !47, line: 242, baseType: !50, size: 32, align: 32)
!50 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !46, file: !47, line: 247, baseType: !38, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !46, file: !47, line: 248, baseType: !38, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !46, file: !47, line: 249, baseType: !38, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !46, file: !47, line: 250, baseType: !38, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !46, file: !47, line: 251, baseType: !38, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !46, file: !47, line: 252, baseType: !38, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !46, file: !47, line: 253, baseType: !38, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !46, file: !47, line: 254, baseType: !38, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !46, file: !47, line: 256, baseType: !38, size: 64, align: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !46, file: !47, line: 257, baseType: !38, size: 64, align: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !46, file: !47, line: 258, baseType: !38, size: 64, align: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !46, file: !47, line: 260, baseType: !63, size: 64, align: 64, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !47, line: 156, size: 192, align: 64, elements: !65)
!65 = !{!66, !67, !69}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !64, file: !47, line: 157, baseType: !63, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !64, file: !47, line: 158, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !64, file: !47, line: 162, baseType: !50, size: 32, align: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !46, file: !47, line: 262, baseType: !68, size: 64, align: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !46, file: !47, line: 264, baseType: !50, size: 32, align: 32, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !46, file: !47, line: 268, baseType: !50, size: 32, align: 32, offset: 928)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !46, file: !47, line: 270, baseType: !74, size: 64, align: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !75, line: 131, baseType: !76)
!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!76 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !46, file: !47, line: 274, baseType: !16, size: 16, align: 16, offset: 1024)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !46, file: !47, line: 275, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !46, file: !47, line: 276, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !46, file: !47, line: 280, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !47, line: 150, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !46, file: !47, line: 289, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !75, line: 132, baseType: !76)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !46, file: !47, line: 297, baseType: !90, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !46, file: !47, line: 298, baseType: !90, size: 64, align: 64, offset: 1280)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !46, file: !47, line: 299, baseType: !90, size: 64, align: 64, offset: 1344)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !46, file: !47, line: 300, baseType: !90, size: 64, align: 64, offset: 1408)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !46, file: !47, line: 302, baseType: !95, size: 64, align: 64, offset: 1472)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !96, line: 216, baseType: !97)
!96 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!97 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !46, file: !47, line: 303, baseType: !50, size: 32, align: 32, offset: 1536)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !46, file: !47, line: 305, baseType: !100, size: 160, align: 8, offset: 1568)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 160, align: 8, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 20)
!103 = distinct !DIGlobalVariable(name: "offset", scope: !0, file: !42, line: 99, type: !104, isLocal: false, isDefinition: true, variable: i16* @offset)
!104 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!105 = distinct !DIGlobalVariable(name: "npkt", scope: !0, file: !42, line: 100, type: !50, isLocal: false, isDefinition: true, variable: i32* @npkt)
!106 = distinct !DIGlobalVariable(name: "packet", scope: !0, file: !42, line: 101, type: !107, isLocal: false, isDefinition: true, variable: i8** @packet)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !109, line: 33, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !75, line: 30, baseType: !11)
!111 = distinct !DIGlobalVariable(name: "buf", scope: !0, file: !42, line: 102, type: !107, isLocal: false, isDefinition: true, variable: i8** @buf)
!112 = distinct !DIGlobalVariable(name: "hdr", scope: !0, file: !42, line: 103, type: !113, isLocal: false, isDefinition: true, variable: %struct.pcap_pkthdr* @hdr)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_pkthdr", file: !114, line: 199, size: 192, align: 64, elements: !115)
!114 = !DIFile(filename: "/usr/local/include/pcap/pcap.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!115 = !{!116, !124, !129}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !113, file: !114, line: 200, baseType: !117, size: 128, align: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !118, line: 30, size: 128, align: 64, elements: !119)
!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!119 = !{!120, !122}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !117, file: !118, line: 32, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !75, line: 139, baseType: !76)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !117, file: !118, line: 33, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !75, line: 141, baseType: !76)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "caplen", scope: !113, file: !114, line: 201, baseType: !125, size: 32, align: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "bpf_u_int32", file: !126, line: 85, baseType: !127)
!126 = !DIFile(filename: "/usr/local/include/pcap/bpf.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !109, line: 35, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !75, line: 32, baseType: !29)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !113, file: !114, line: 202, baseType: !125, size: 32, align: 32, offset: 160)
!130 = distinct !DIGlobalVariable(name: "descr", scope: !0, file: !42, line: 104, type: !131, isLocal: false, isDefinition: true, variable: %struct.pcap** @descr)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_t", file: !114, line: 118, baseType: !133)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap", file: !114, line: 118, flags: DIFlagFwdDecl)
!134 = distinct !DIGlobalVariable(name: "dumper", scope: !0, file: !42, line: 105, type: !135, isLocal: false, isDefinition: true, variable: %struct.pcap_dumper** @dumper)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_dumper_t", file: !114, line: 119, baseType: !137)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_dumper", file: !114, line: 119, flags: DIFlagFwdDecl)
!138 = distinct !DIGlobalVariable(name: "statistic", scope: !0, file: !42, line: 106, type: !139, isLocal: false, isDefinition: true, variable: %struct.pcap_stat* @statistic)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_stat", file: !114, line: 208, size: 96, align: 32, elements: !140)
!140 = !{!141, !142, !143}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ps_recv", scope: !139, file: !114, line: 209, baseType: !127, size: 32, align: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ps_drop", scope: !139, file: !114, line: 210, baseType: !127, size: 32, align: 32, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ps_ifdrop", scope: !139, file: !114, line: 211, baseType: !127, size: 32, align: 32, offset: 64)
!144 = distinct !DIGlobalVariable(name: "maskp", scope: !0, file: !42, line: 107, type: !125, isLocal: false, isDefinition: true, variable: i32* @maskp)
!145 = distinct !DIGlobalVariable(name: "netp", scope: !0, file: !42, line: 108, type: !125, isLocal: false, isDefinition: true, variable: i32* @netp)
!146 = distinct !DIGlobalVariable(name: "datalink", scope: !0, file: !42, line: 109, type: !50, isLocal: false, isDefinition: true, variable: i32* @datalink)
!147 = distinct !DIGlobalVariable(name: "fp", scope: !0, file: !42, line: 110, type: !148, isLocal: false, isDefinition: true, variable: %struct.bpf_program* @fp)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_program", file: !126, line: 104, size: 128, align: 64, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "bf_len", scope: !148, file: !126, line: 105, baseType: !127, size: 32, align: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "bf_insns", scope: !148, file: !126, line: 106, baseType: !152, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_insn", file: !126, line: 234, size: 64, align: 32, elements: !154)
!154 = !{!155, !158, !159, !160}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !153, file: !126, line: 235, baseType: !156, size: 16, align: 16)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !109, line: 34, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !75, line: 31, baseType: !16)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "jt", scope: !153, file: !126, line: 236, baseType: !108, size: 8, align: 8, offset: 16)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "jf", scope: !153, file: !126, line: 237, baseType: !108, size: 8, align: 8, offset: 24)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !153, file: !126, line: 238, baseType: !125, size: 32, align: 32, offset: 32)
!161 = distinct !DIGlobalVariable(name: "logname", scope: !0, file: !42, line: 111, type: !38, isLocal: false, isDefinition: true, variable: i8** @logname)
!162 = distinct !DIGlobalVariable(name: "tcpdl", scope: !0, file: !42, line: 112, type: !38, isLocal: false, isDefinition: true, variable: i8** @tcpdl)
!163 = distinct !DIGlobalVariable(name: "tr", scope: !0, file: !42, line: 113, type: !156, isLocal: false, isDefinition: true, variable: i16* @tr)
!164 = distinct !DIGlobalVariable(name: "tl", scope: !0, file: !42, line: 113, type: !156, isLocal: false, isDefinition: true, variable: i16* @tl)
!165 = distinct !DIGlobalVariable(name: "graph", scope: !0, file: !42, line: 114, type: !156, isLocal: false, isDefinition: true, variable: i16* @graph)
!166 = distinct !DIGlobalVariable(name: "cont", scope: !0, file: !42, line: 115, type: !156, isLocal: false, isDefinition: true, variable: i16* @cont)
!167 = distinct !DIGlobalVariable(name: "stream_glob", scope: !0, file: !42, line: 117, type: !50, isLocal: false, isDefinition: true, variable: i32* @stream_glob)
!168 = distinct !DIGlobalVariable(name: "bc_glob", scope: !0, file: !42, line: 118, type: !50, isLocal: false, isDefinition: true, variable: i32* @bc_glob)
!169 = distinct !DIGlobalVariable(name: "sniff_glob", scope: !0, file: !42, line: 119, type: !50, isLocal: false, isDefinition: true, variable: i32* @sniff_glob)
!170 = distinct !DIGlobalVariable(name: "rst_glob", scope: !0, file: !42, line: 120, type: !50, isLocal: false, isDefinition: true, variable: i32* @rst_glob)
!171 = distinct !DIGlobalVariable(name: "arp_glob", scope: !0, file: !42, line: 121, type: !50, isLocal: false, isDefinition: true, variable: i32* @arp_glob)
!172 = distinct !DIGlobalVariable(name: "pt", scope: !0, file: !42, line: 122, type: !173, isLocal: false, isDefinition: true, variable: [2 x i64]* @pt)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 128, align: 64, elements: !176)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !175, line: 60, baseType: !97)
!175 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!176 = !{!177}
!177 = !DISubrange(count: 2)
!178 = distinct !DIGlobalVariable(name: "lg", scope: !0, file: !42, line: 123, type: !50, isLocal: false, isDefinition: true, variable: i32* @lg)
!179 = distinct !DIGlobalVariable(name: "tm", scope: !0, file: !42, line: 132, type: !180, isLocal: false, isDefinition: true, variable: i64* @tm)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !181, line: 75, baseType: !121)
!181 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!182 = distinct !DIGlobalVariable(name: "timed", scope: !0, file: !42, line: 133, type: !183, isLocal: false, isDefinition: true, variable: [60 x i8]* @timed)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 480, align: 8, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 60)
!186 = distinct !DIGlobalVariable(name: "demonize", scope: !0, file: !42, line: 136, type: !156, isLocal: false, isDefinition: true, variable: i16* @demonize)
!187 = distinct !DIGlobalVariable(name: "line_s", scope: !0, file: !42, line: 138, type: !50, isLocal: false, isDefinition: true, variable: i32* @line_s)
!188 = distinct !DIGlobalVariable(name: "row_s", scope: !0, file: !42, line: 139, type: !50, isLocal: false, isDefinition: true, variable: i32* @row_s)
!189 = !{i32 2, !"Dwarf Version", i32 4}
!190 = !{i32 2, !"Debug Info Version", i32 3}
!191 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!192 = distinct !DISubprogram(name: "handle_UDP", scope: !193, file: !193, line: 25, type: !194, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!193 = !DIFile(filename: "udp.c", directory: "/home/lichi/Desktop/nast/[task]nast")
!194 = !DISubroutineType(types: !195)
!195 = !{null, !156, !156, !43, !43}
!196 = !DILocalVariable(name: "d", arg: 1, scope: !192, file: !193, line: 25, type: !156)
!197 = !DIExpression()
!198 = !DILocation(line: 25, column: 26, scope: !192)
!199 = !DILocalVariable(name: "x", arg: 2, scope: !192, file: !193, line: 25, type: !156)
!200 = !DILocation(line: 25, column: 37, scope: !192)
!201 = !DILocalVariable(name: "output", arg: 3, scope: !192, file: !193, line: 25, type: !43)
!202 = !DILocation(line: 25, column: 46, scope: !192)
!203 = !DILocalVariable(name: "ldd", arg: 4, scope: !192, file: !193, line: 25, type: !43)
!204 = !DILocation(line: 25, column: 60, scope: !192)
!205 = !DILocalVariable(name: "ip", scope: !192, file: !193, line: 27, type: !4)
!206 = !DILocation(line: 27, column: 28, scope: !192)
!207 = !DILocalVariable(name: "udp", scope: !192, file: !193, line: 28, type: !31)
!208 = !DILocation(line: 28, column: 27, scope: !192)
!209 = !DILocalVariable(name: "service", scope: !192, file: !193, line: 29, type: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "servent", file: !212, line: 257, size: 256, align: 64, elements: !213)
!212 = !DIFile(filename: "/usr/include/netdb.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!213 = !{!214, !215, !217, !218}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "s_name", scope: !211, file: !212, line: 259, baseType: !38, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "s_aliases", scope: !211, file: !212, line: 260, baseType: !216, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "s_port", scope: !211, file: !212, line: 261, baseType: !50, size: 32, align: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "s_proto", scope: !211, file: !212, line: 262, baseType: !38, size: 64, align: 64, offset: 192)
!219 = !DILocation(line: 29, column: 20, scope: !192)
!220 = !DILocalVariable(name: "size_buf", scope: !192, file: !193, line: 30, type: !156)
!221 = !DILocation(line: 30, column: 12, scope: !192)
!222 = !DILocalVariable(name: "size_ip", scope: !192, file: !193, line: 30, type: !156)
!223 = !DILocation(line: 30, column: 22, scope: !192)
!224 = !DILocalVariable(name: "size_udp", scope: !192, file: !193, line: 30, type: !156)
!225 = !DILocation(line: 30, column: 31, scope: !192)
!226 = !DILocation(line: 33, column: 12, scope: !192)
!227 = !DILocation(line: 34, column: 13, scope: !192)
!228 = !DILocation(line: 35, column: 13, scope: !192)
!229 = !DILocation(line: 37, column: 37, scope: !192)
!230 = !DILocation(line: 37, column: 44, scope: !192)
!231 = !DILocation(line: 37, column: 43, scope: !192)
!232 = !DILocation(line: 37, column: 9, scope: !192)
!233 = !DILocation(line: 37, column: 7, scope: !192)
!234 = !DILocation(line: 38, column: 37, scope: !192)
!235 = !DILocation(line: 38, column: 44, scope: !192)
!236 = !DILocation(line: 38, column: 43, scope: !192)
!237 = !DILocation(line: 38, column: 52, scope: !192)
!238 = !DILocation(line: 38, column: 51, scope: !192)
!239 = !DILocation(line: 38, column: 10, scope: !192)
!240 = !DILocation(line: 38, column: 8, scope: !192)
!241 = !DILocation(line: 40, column: 41, scope: !192)
!242 = !DILocation(line: 40, column: 46, scope: !192)
!243 = !DILocation(line: 40, column: 35, scope: !192)
!244 = !DILocation(line: 40, column: 29, scope: !245)
!245 = !DILexicalBlockFile(scope: !192, file: !193, discriminator: 1)
!246 = !DILocation(line: 40, column: 29, scope: !192)
!247 = !DILocation(line: 40, column: 14, scope: !248)
!248 = !DILexicalBlockFile(scope: !192, file: !193, discriminator: 2)
!249 = !DILocation(line: 40, column: 12, scope: !192)
!250 = !DILocation(line: 41, column: 20, scope: !192)
!251 = !DILocation(line: 41, column: 27, scope: !192)
!252 = !DILocation(line: 41, column: 33, scope: !192)
!253 = !DILocation(line: 41, column: 4, scope: !192)
!254 = !DILocation(line: 42, column: 27, scope: !192)
!255 = !DILocation(line: 42, column: 33, scope: !192)
!256 = !DILocation(line: 42, column: 26, scope: !192)
!257 = !DILocation(line: 42, column: 36, scope: !192)
!258 = !DILocation(line: 42, column: 42, scope: !192)
!259 = !DILocation(line: 42, column: 69, scope: !192)
!260 = !DILocation(line: 42, column: 73, scope: !192)
!261 = !DILocation(line: 42, column: 58, scope: !192)
!262 = !DILocation(line: 42, column: 88, scope: !192)
!263 = !DILocation(line: 42, column: 93, scope: !192)
!264 = !DILocation(line: 42, column: 82, scope: !265)
!265 = !DILexicalBlockFile(scope: !192, file: !193, discriminator: 4)
!266 = !DILocation(line: 42, column: 82, scope: !192)
!267 = !DILocation(line: 42, column: 105, scope: !192)
!268 = !DILocation(line: 42, column: 104, scope: !192)
!269 = !DILocation(line: 42, column: 116, scope: !245)
!270 = !DILocation(line: 42, column: 125, scope: !245)
!271 = !DILocation(line: 42, column: 104, scope: !245)
!272 = !DILocation(line: 42, column: 104, scope: !248)
!273 = !DILocation(line: 42, column: 104, scope: !274)
!274 = !DILexicalBlockFile(scope: !192, file: !193, discriminator: 3)
!275 = !DILocation(line: 42, column: 4, scope: !274)
!276 = !DILocation(line: 43, column: 40, scope: !192)
!277 = !DILocation(line: 43, column: 45, scope: !192)
!278 = !DILocation(line: 43, column: 34, scope: !192)
!279 = !DILocation(line: 43, column: 28, scope: !245)
!280 = !DILocation(line: 43, column: 28, scope: !192)
!281 = !DILocation(line: 43, column: 14, scope: !248)
!282 = !DILocation(line: 43, column: 12, scope: !192)
!283 = !DILocation(line: 44, column: 20, scope: !192)
!284 = !DILocation(line: 44, column: 30, scope: !192)
!285 = !DILocation(line: 44, column: 4, scope: !192)
!286 = !DILocation(line: 45, column: 20, scope: !192)
