; ModuleID = './[inter]main.o.i'
source_filename = "./[inter]main.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.pcap_pkthdr = type { %struct.timeval, i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.pcap = type opaque
%struct.pcap_dumper = type opaque
%struct.pcap_stat = type { i32, i32, i32 }
%struct.bpf_program = type { i32, %struct.bpf_insn* }
%struct.bpf_insn = type { i16, i8, i8, i32 }
%struct.libnet_context = type { i32, i32, %struct.libnet_protocol_block*, %struct.libnet_protocol_block*, i32, i32, i32, i32, i8*, %struct.libnet_stats, i32, [64 x i8], [256 x i8], i32 }
%struct.libnet_protocol_block = type { i8*, i32, i16, i32, i8, i8, i32, %struct.libnet_protocol_block*, %struct.libnet_protocol_block* }
%struct.libnet_stats = type { i64, i64, i64 }
%struct.utsname = type { [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8] }
%struct.FLAGSTRUCT = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !5)
!1 = !DIFile(filename: "[inter]main.o.i", directory: "/home/lichi/Desktop/nast/[task]nast")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !23, !37, !96, !98, !99, !104, !105, !124, !128, !132, !138, !139, !140, !141, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !170, !171, !174, !178, !179, !180}
!6 = distinct !DIGlobalVariable(name: "ports", scope: !7, file: !8, line: 42, type: !15, isLocal: true, isDefinition: true, variable: [14 x i16]* @main.ports)
!7 = distinct !DISubprogram(name: "main", scope: !8, file: !8, line: 31, type: !9, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!8 = !DIFile(filename: "main.c", directory: "/home/lichi/Desktop/nast/[task]nast")
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !11, !12}
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 224, align: 16, elements: !21)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !17, line: 34, baseType: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !19, line: 31, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!20 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!21 = !{!22}
!22 = !DISubrange(count: 14)
!23 = distinct !DIGlobalVariable(name: "long_options", scope: !7, file: !8, line: 71, type: !24, isLocal: true, isDefinition: true, variable: [25 x %struct.option]* @main.long_options)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 6400, align: 64, elements: !35)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !26, line: 104, size: 256, align: 64, elements: !27)
!26 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!27 = !{!28, !31, !32, !34}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !25, file: !26, line: 106, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !25, file: !26, line: 109, baseType: !11, size: 32, align: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !25, file: !26, line: 110, baseType: !33, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !25, file: !26, line: 111, baseType: !11, size: 32, align: 32, offset: 192)
!35 = !{!36}
!36 = !DISubrange(count: 25)
!37 = distinct !DIGlobalVariable(name: "logd", scope: !0, file: !38, line: 98, type: !39, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @logd)
!38 = !DIFile(filename: "include/nast.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !41, line: 48, baseType: !42)
!41 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !43, line: 241, size: 1728, align: 64, elements: !44)
!43 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !65, !66, !67, !68, !71, !72, !74, !78, !81, !83, !84, !85, !86, !87, !91, !92}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !42, file: !43, line: 242, baseType: !11, size: 32, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !42, file: !43, line: 247, baseType: !13, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !42, file: !43, line: 248, baseType: !13, size: 64, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !42, file: !43, line: 249, baseType: !13, size: 64, align: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !42, file: !43, line: 250, baseType: !13, size: 64, align: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !42, file: !43, line: 251, baseType: !13, size: 64, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !42, file: !43, line: 252, baseType: !13, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !42, file: !43, line: 253, baseType: !13, size: 64, align: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !42, file: !43, line: 254, baseType: !13, size: 64, align: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !42, file: !43, line: 256, baseType: !13, size: 64, align: 64, offset: 576)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !42, file: !43, line: 257, baseType: !13, size: 64, align: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !42, file: !43, line: 258, baseType: !13, size: 64, align: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !42, file: !43, line: 260, baseType: !58, size: 64, align: 64, offset: 768)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !43, line: 156, size: 192, align: 64, elements: !60)
!60 = !{!61, !62, !64}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !59, file: !43, line: 157, baseType: !58, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !59, file: !43, line: 158, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !59, file: !43, line: 162, baseType: !11, size: 32, align: 32, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !42, file: !43, line: 262, baseType: !63, size: 64, align: 64, offset: 832)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !42, file: !43, line: 264, baseType: !11, size: 32, align: 32, offset: 896)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !42, file: !43, line: 268, baseType: !11, size: 32, align: 32, offset: 928)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !42, file: !43, line: 270, baseType: !69, size: 64, align: 64, offset: 960)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !19, line: 131, baseType: !70)
!70 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !42, file: !43, line: 274, baseType: !20, size: 16, align: 16, offset: 1024)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !42, file: !43, line: 275, baseType: !73, size: 8, align: 8, offset: 1040)
!73 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !42, file: !43, line: 276, baseType: !75, size: 8, align: 8, offset: 1048)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, align: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !42, file: !43, line: 280, baseType: !79, size: 64, align: 64, offset: 1088)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !43, line: 150, baseType: null)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !42, file: !43, line: 289, baseType: !82, size: 64, align: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !19, line: 132, baseType: !70)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !42, file: !43, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !42, file: !43, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !42, file: !43, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !42, file: !43, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !42, file: !43, line: 302, baseType: !88, size: 64, align: 64, offset: 1472)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !89, line: 216, baseType: !90)
!89 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!90 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !42, file: !43, line: 303, baseType: !11, size: 32, align: 32, offset: 1536)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !42, file: !43, line: 305, baseType: !93, size: 160, align: 8, offset: 1568)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, align: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 20)
!96 = distinct !DIGlobalVariable(name: "offset", scope: !0, file: !38, line: 99, type: !97, isLocal: false, isDefinition: true, variable: i16* @offset)
!97 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!98 = distinct !DIGlobalVariable(name: "npkt", scope: !0, file: !38, line: 100, type: !11, isLocal: false, isDefinition: true, variable: i32* @npkt)
!99 = distinct !DIGlobalVariable(name: "packet", scope: !0, file: !38, line: 101, type: !100, isLocal: false, isDefinition: true, variable: i8** @packet)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !17, line: 33, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !19, line: 30, baseType: !103)
!103 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!104 = distinct !DIGlobalVariable(name: "buf", scope: !0, file: !38, line: 102, type: !100, isLocal: false, isDefinition: true, variable: i8** @buf)
!105 = distinct !DIGlobalVariable(name: "hdr", scope: !0, file: !38, line: 103, type: !106, isLocal: false, isDefinition: true, variable: %struct.pcap_pkthdr* @hdr)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_pkthdr", file: !107, line: 199, size: 192, align: 64, elements: !108)
!107 = !DIFile(filename: "/usr/local/include/pcap/pcap.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!108 = !{!109, !117, !123}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !106, file: !107, line: 200, baseType: !110, size: 128, align: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !111, line: 30, size: 128, align: 64, elements: !112)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!112 = !{!113, !115}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !110, file: !111, line: 32, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !19, line: 139, baseType: !70)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !110, file: !111, line: 33, baseType: !116, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !19, line: 141, baseType: !70)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "caplen", scope: !106, file: !107, line: 201, baseType: !118, size: 32, align: 32, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "bpf_u_int32", file: !119, line: 85, baseType: !120)
!119 = !DIFile(filename: "/usr/local/include/pcap/bpf.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !17, line: 35, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !19, line: 32, baseType: !122)
!122 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !106, file: !107, line: 202, baseType: !118, size: 32, align: 32, offset: 160)
!124 = distinct !DIGlobalVariable(name: "descr", scope: !0, file: !38, line: 104, type: !125, isLocal: false, isDefinition: true, variable: %struct.pcap** @descr)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_t", file: !107, line: 118, baseType: !127)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap", file: !107, line: 118, flags: DIFlagFwdDecl)
!128 = distinct !DIGlobalVariable(name: "dumper", scope: !0, file: !38, line: 105, type: !129, isLocal: false, isDefinition: true, variable: %struct.pcap_dumper** @dumper)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_dumper_t", file: !107, line: 119, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_dumper", file: !107, line: 119, flags: DIFlagFwdDecl)
!132 = distinct !DIGlobalVariable(name: "statistic", scope: !0, file: !38, line: 106, type: !133, isLocal: false, isDefinition: true, variable: %struct.pcap_stat* @statistic)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_stat", file: !107, line: 208, size: 96, align: 32, elements: !134)
!134 = !{!135, !136, !137}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ps_recv", scope: !133, file: !107, line: 209, baseType: !120, size: 32, align: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ps_drop", scope: !133, file: !107, line: 210, baseType: !120, size: 32, align: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ps_ifdrop", scope: !133, file: !107, line: 211, baseType: !120, size: 32, align: 32, offset: 64)
!138 = distinct !DIGlobalVariable(name: "maskp", scope: !0, file: !38, line: 107, type: !118, isLocal: false, isDefinition: true, variable: i32* @maskp)
!139 = distinct !DIGlobalVariable(name: "netp", scope: !0, file: !38, line: 108, type: !118, isLocal: false, isDefinition: true, variable: i32* @netp)
!140 = distinct !DIGlobalVariable(name: "datalink", scope: !0, file: !38, line: 109, type: !11, isLocal: false, isDefinition: true, variable: i32* @datalink)
!141 = distinct !DIGlobalVariable(name: "fp", scope: !0, file: !38, line: 110, type: !142, isLocal: false, isDefinition: true, variable: %struct.bpf_program* @fp)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_program", file: !119, line: 104, size: 128, align: 64, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "bf_len", scope: !142, file: !119, line: 105, baseType: !120, size: 32, align: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "bf_insns", scope: !142, file: !119, line: 106, baseType: !146, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_insn", file: !119, line: 234, size: 64, align: 32, elements: !148)
!148 = !{!149, !150, !151, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !147, file: !119, line: 235, baseType: !16, size: 16, align: 16)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "jt", scope: !147, file: !119, line: 236, baseType: !101, size: 8, align: 8, offset: 16)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "jf", scope: !147, file: !119, line: 237, baseType: !101, size: 8, align: 8, offset: 24)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !147, file: !119, line: 238, baseType: !118, size: 32, align: 32, offset: 32)
!153 = distinct !DIGlobalVariable(name: "logname", scope: !0, file: !38, line: 111, type: !13, isLocal: false, isDefinition: true, variable: i8** @logname)
!154 = distinct !DIGlobalVariable(name: "tcpdl", scope: !0, file: !38, line: 112, type: !13, isLocal: false, isDefinition: true, variable: i8** @tcpdl)
!155 = distinct !DIGlobalVariable(name: "tr", scope: !0, file: !38, line: 113, type: !16, isLocal: false, isDefinition: true, variable: i16* @tr)
!156 = distinct !DIGlobalVariable(name: "tl", scope: !0, file: !38, line: 113, type: !16, isLocal: false, isDefinition: true, variable: i16* @tl)
!157 = distinct !DIGlobalVariable(name: "graph", scope: !0, file: !38, line: 114, type: !16, isLocal: false, isDefinition: true, variable: i16* @graph)
!158 = distinct !DIGlobalVariable(name: "cont", scope: !0, file: !38, line: 115, type: !16, isLocal: false, isDefinition: true, variable: i16* @cont)
!159 = distinct !DIGlobalVariable(name: "stream_glob", scope: !0, file: !38, line: 117, type: !11, isLocal: false, isDefinition: true, variable: i32* @stream_glob)
!160 = distinct !DIGlobalVariable(name: "bc_glob", scope: !0, file: !38, line: 118, type: !11, isLocal: false, isDefinition: true, variable: i32* @bc_glob)
!161 = distinct !DIGlobalVariable(name: "sniff_glob", scope: !0, file: !38, line: 119, type: !11, isLocal: false, isDefinition: true, variable: i32* @sniff_glob)
!162 = distinct !DIGlobalVariable(name: "rst_glob", scope: !0, file: !38, line: 120, type: !11, isLocal: false, isDefinition: true, variable: i32* @rst_glob)
!163 = distinct !DIGlobalVariable(name: "arp_glob", scope: !0, file: !38, line: 121, type: !11, isLocal: false, isDefinition: true, variable: i32* @arp_glob)
!164 = distinct !DIGlobalVariable(name: "pt", scope: !0, file: !38, line: 122, type: !165, isLocal: false, isDefinition: true, variable: [2 x i64]* @pt)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 128, align: 64, elements: !168)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !167, line: 60, baseType: !90)
!167 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!168 = !{!169}
!169 = !DISubrange(count: 2)
!170 = distinct !DIGlobalVariable(name: "lg", scope: !0, file: !38, line: 123, type: !11, isLocal: false, isDefinition: true, variable: i32* @lg)
!171 = distinct !DIGlobalVariable(name: "tm", scope: !0, file: !38, line: 132, type: !172, isLocal: false, isDefinition: true, variable: i64* @tm)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !173, line: 75, baseType: !114)
!173 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!174 = distinct !DIGlobalVariable(name: "timed", scope: !0, file: !38, line: 133, type: !175, isLocal: false, isDefinition: true, variable: [60 x i8]* @timed)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 480, align: 8, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 60)
!178 = distinct !DIGlobalVariable(name: "demonize", scope: !0, file: !38, line: 136, type: !16, isLocal: false, isDefinition: true, variable: i16* @demonize)
!179 = distinct !DIGlobalVariable(name: "line_s", scope: !0, file: !38, line: 138, type: !11, isLocal: false, isDefinition: true, variable: i32* @line_s)
!180 = distinct !DIGlobalVariable(name: "row_s", scope: !0, file: !38, line: 139, type: !11, isLocal: false, isDefinition: true, variable: i32* @row_s)
!181 = !{i32 2, !"Dwarf Version", i32 4}
!182 = !{i32 2, !"Debug Info Version", i32 3}
!183 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!184 = !DILocalVariable(name: "argc", arg: 1, scope: !7, file: !8, line: 31, type: !11)
!185 = !DIExpression()
!186 = !DILocation(line: 31, column: 14, scope: !7)
!187 = !DILocalVariable(name: "argv", arg: 2, scope: !7, file: !8, line: 31, type: !12)
!188 = !DILocation(line: 31, column: 26, scope: !7)
!189 = !DILocalVariable(name: "dev", scope: !7, file: !8, line: 33, type: !13)
!190 = !DILocation(line: 33, column: 10, scope: !7)
!191 = !DILocalVariable(name: "app", scope: !7, file: !8, line: 33, type: !13)
!192 = !DILocation(line: 33, column: 16, scope: !7)
!193 = !DILocalVariable(name: "filter", scope: !7, file: !8, line: 34, type: !13)
!194 = !DILocation(line: 34, column: 10, scope: !7)
!195 = !DILocalVariable(name: "buffer", scope: !7, file: !8, line: 34, type: !13)
!196 = !DILocation(line: 34, column: 19, scope: !7)
!197 = !DILocalVariable(name: "ldname", scope: !7, file: !8, line: 34, type: !198)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 400, align: 8, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 50)
!201 = !DILocation(line: 34, column: 27, scope: !7)
!202 = !DILocalVariable(name: "errbuf", scope: !7, file: !8, line: 35, type: !203)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, align: 8, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 256)
!206 = !DILocation(line: 35, column: 9, scope: !7)
!207 = !DILocalVariable(name: "option", scope: !7, file: !8, line: 37, type: !11)
!208 = !DILocation(line: 37, column: 8, scope: !7)
!209 = !DILocalVariable(name: "option_index", scope: !7, file: !8, line: 37, type: !11)
!210 = !DILocation(line: 37, column: 16, scope: !7)
!211 = !DILocalVariable(name: "anip", scope: !7, file: !8, line: 38, type: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_long", file: !17, line: 36, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_long", file: !19, line: 33, baseType: !90)
!214 = !DILocation(line: 38, column: 11, scope: !7)
!215 = !DILocalVariable(name: "L", scope: !7, file: !8, line: 39, type: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_t", file: !218, line: 235, baseType: !219)
!218 = !DIFile(filename: "/usr/local/include/libnet/libnet-structures.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_context", file: !218, line: 186, size: 3200, align: 64, elements: !220)
!220 = !{!221, !222, !223, !245, !246, !247, !248, !249, !250, !251, !258, !259, !263, !264}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !219, file: !218, line: 192, baseType: !11, size: 32, align: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "injection_type", scope: !219, file: !218, line: 194, baseType: !11, size: 32, align: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blocks", scope: !219, file: !218, line: 206, baseType: !224, size: 64, align: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_pblock_t", file: !218, line: 178, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_protocol_block", file: !218, line: 77, size: 384, align: 64, elements: !227)
!227 = !{!228, !232, !234, !236, !237, !238, !239, !242, !244}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !226, file: !218, line: 79, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !231, line: 48, baseType: !103)
!231 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!232 = !DIDerivedType(tag: DW_TAG_member, name: "b_len", scope: !226, file: !218, line: 80, baseType: !233, size: 32, align: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !231, line: 51, baseType: !122)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "h_len", scope: !226, file: !218, line: 81, baseType: !235, size: 16, align: 16, offset: 96)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !231, line: 49, baseType: !20)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "copied", scope: !226, file: !218, line: 92, baseType: !233, size: 32, align: 32, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !226, file: !218, line: 94, baseType: !230, size: 8, align: 8, offset: 160)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !226, file: !218, line: 168, baseType: !230, size: 8, align: 8, offset: 168)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ptag", scope: !226, file: !218, line: 170, baseType: !240, size: 32, align: 32, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_ptag_t", file: !218, line: 70, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !17, line: 196, baseType: !11)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !226, file: !218, line: 175, baseType: !243, size: 64, align: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !226, file: !218, line: 176, baseType: !243, size: 64, align: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pblock_end", scope: !219, file: !218, line: 207, baseType: !224, size: 64, align: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "n_pblocks", scope: !219, file: !218, line: 208, baseType: !233, size: 32, align: 32, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "link_type", scope: !219, file: !218, line: 210, baseType: !11, size: 32, align: 32, offset: 224)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "link_offset", scope: !219, file: !218, line: 224, baseType: !11, size: 32, align: 32, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "aligner", scope: !219, file: !218, line: 225, baseType: !11, size: 32, align: 32, offset: 288)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !219, file: !218, line: 226, baseType: !13, size: 64, align: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !219, file: !218, line: 228, baseType: !252, size: 192, align: 64, offset: 384)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_stats", file: !218, line: 52, size: 192, align: 64, elements: !253)
!253 = !{!254, !256, !257}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "packets_sent", scope: !252, file: !218, line: 55, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !231, line: 55, baseType: !90)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "packet_errors", scope: !252, file: !218, line: 56, baseType: !255, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !252, file: !218, line: 57, baseType: !255, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ptag_state", scope: !219, file: !218, line: 229, baseType: !240, size: 32, align: 32, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !219, file: !218, line: 230, baseType: !260, size: 512, align: 8, offset: 608)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, align: 8, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "err_buf", scope: !219, file: !218, line: 232, baseType: !203, size: 2048, align: 8, offset: 1120)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !219, file: !218, line: 233, baseType: !233, size: 32, align: 32, offset: 3168)
!265 = !DILocation(line: 39, column: 14, scope: !7)
!266 = !DILocalVariable(name: "buf", scope: !7, file: !8, line: 40, type: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !268, line: 48, size: 3120, align: 8, elements: !269)
!268 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/utsname.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!269 = !{!270, !274, !275, !276, !277, !278}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !267, file: !268, line: 51, baseType: !271, size: 520, align: 8)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 520, align: 8, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 65)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !267, file: !268, line: 54, baseType: !271, size: 520, align: 8, offset: 520)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !267, file: !268, line: 57, baseType: !271, size: 520, align: 8, offset: 1040)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !267, file: !268, line: 59, baseType: !271, size: 520, align: 8, offset: 1560)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !267, file: !268, line: 62, baseType: !271, size: 520, align: 8, offset: 2080)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__domainname", scope: !267, file: !268, line: 69, baseType: !271, size: 520, align: 8, offset: 2600)
!279 = !DILocation(line: 40, column: 19, scope: !7)
!280 = !DILocalVariable(name: "flags", scope: !7, file: !8, line: 70, type: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FLAGSTRUCT", scope: !7, file: !8, line: 47, size: 320, align: 16, elements: !282)
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "promisc", scope: !281, file: !8, line: 49, baseType: !16, size: 16, align: 16)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !281, file: !8, line: 50, baseType: !16, size: 16, align: 16, offset: 16)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !281, file: !8, line: 51, baseType: !16, size: 16, align: 16, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "hex", scope: !281, file: !8, line: 52, baseType: !16, size: 16, align: 16, offset: 48)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !281, file: !8, line: 53, baseType: !16, size: 16, align: 16, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ps", scope: !281, file: !8, line: 54, baseType: !16, size: 16, align: 16, offset: 80)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "gw", scope: !281, file: !8, line: 55, baseType: !16, size: 16, align: 16, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !281, file: !8, line: 56, baseType: !16, size: 16, align: 16, offset: 112)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "lk", scope: !281, file: !8, line: 57, baseType: !16, size: 16, align: 16, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pr", scope: !281, file: !8, line: 58, baseType: !16, size: 16, align: 16, offset: 144)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !281, file: !8, line: 59, baseType: !16, size: 16, align: 16, offset: 160)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "mp", scope: !281, file: !8, line: 60, baseType: !16, size: 16, align: 16, offset: 176)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "banner", scope: !281, file: !8, line: 61, baseType: !16, size: 16, align: 16, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "maplan", scope: !281, file: !8, line: 62, baseType: !16, size: 16, align: 16, offset: 208)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "c_arp", scope: !281, file: !8, line: 63, baseType: !16, size: 16, align: 16, offset: 224)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ld", scope: !281, file: !8, line: 64, baseType: !16, size: 16, align: 16, offset: 240)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "bytecount", scope: !281, file: !8, line: 65, baseType: !16, size: 16, align: 16, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ncurses", scope: !281, file: !8, line: 66, baseType: !16, size: 16, align: 16, offset: 272)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tcpdlog", scope: !281, file: !8, line: 67, baseType: !16, size: 16, align: 16, offset: 288)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tcpdread", scope: !281, file: !8, line: 68, baseType: !16, size: 16, align: 16, offset: 304)
!303 = !DILocation(line: 70, column: 4, scope: !7)
!304 = !DILocation(line: 100, column: 4, scope: !7)
!305 = !DILocation(line: 103, column: 8, scope: !306)
!306 = distinct !DILexicalBlock(scope: !7, file: !8, line: 103, column: 8)
!307 = !DILocation(line: 103, column: 17, scope: !306)
!308 = !DILocation(line: 103, column: 20, scope: !309)
!309 = !DILexicalBlockFile(scope: !306, file: !8, discriminator: 1)
!310 = !DILocation(line: 103, column: 8, scope: !309)
!311 = !DILocation(line: 105, column: 16, scope: !312)
!312 = distinct !DILexicalBlock(scope: !306, file: !8, line: 104, column: 6)
!313 = !DILocation(line: 105, column: 9, scope: !312)
!314 = !DILocation(line: 106, column: 9, scope: !312)
!315 = !DILocation(line: 110, column: 25, scope: !7)
!316 = !DILocation(line: 110, column: 10, scope: !7)
!317 = !DILocation(line: 110, column: 8, scope: !7)
!318 = !DILocation(line: 111, column: 8, scope: !319)
!319 = distinct !DILexicalBlock(scope: !7, file: !8, line: 111, column: 8)
!320 = !DILocation(line: 111, column: 11, scope: !319)
!321 = !DILocation(line: 111, column: 8, scope: !7)
!322 = !DILocation(line: 113, column: 10, scope: !323)
!323 = distinct !DILexicalBlock(scope: !319, file: !8, line: 112, column: 6)
!324 = !DILocation(line: 113, column: 73, scope: !323)
!325 = !DILocation(line: 113, column: 2, scope: !323)
!326 = !DILocation(line: 114, column: 2, scope: !323)
!327 = !DILocation(line: 145, column: 39, scope: !328)
!328 = distinct !DILexicalBlock(scope: !7, file: !8, line: 145, column: 8)
!329 = !DILocation(line: 145, column: 44, scope: !328)
!330 = !DILocation(line: 145, column: 13, scope: !328)
!331 = !DILocation(line: 145, column: 11, scope: !328)
!332 = !DILocation(line: 145, column: 52, scope: !328)
!333 = !DILocation(line: 145, column: 8, scope: !7)
!334 = !DILocation(line: 147, column: 9, scope: !335)
!335 = distinct !DILexicalBlock(scope: !328, file: !8, line: 146, column: 6)
!336 = !DILocation(line: 147, column: 62, scope: !335)
!337 = !DILocation(line: 147, column: 2, scope: !335)
!338 = !DILocation(line: 148, column: 9, scope: !335)
!339 = !DILocation(line: 148, column: 2, scope: !335)
!340 = !DILocation(line: 149, column: 2, scope: !335)
!341 = !DILocation(line: 152, column: 31, scope: !7)
!342 = !DILocation(line: 152, column: 26, scope: !7)
!343 = !DILocation(line: 152, column: 19, scope: !7)
!344 = !DILocation(line: 152, column: 11, scope: !7)
!345 = !DILocation(line: 153, column: 17, scope: !7)
!346 = !DILocation(line: 154, column: 9, scope: !7)
!347 = !DILocation(line: 155, column: 15, scope: !7)
!348 = !DILocation(line: 156, column: 4, scope: !7)
!349 = !DILocation(line: 157, column: 10, scope: !7)
!350 = !DILocation(line: 157, column: 18, scope: !7)
!351 = !DILocation(line: 158, column: 38, scope: !7)
!352 = !DILocation(line: 158, column: 30, scope: !7)
!353 = !DILocation(line: 158, column: 21, scope: !7)
!354 = !DILocation(line: 158, column: 12, scope: !7)
!355 = !DILocation(line: 159, column: 11, scope: !7)
!356 = !DILocation(line: 159, column: 4, scope: !7)
!357 = !DILocation(line: 162, column: 9, scope: !7)
!358 = !DILocation(line: 162, column: 7, scope: !7)
!359 = !DILocation(line: 163, column: 27, scope: !7)
!360 = !DILocation(line: 163, column: 4, scope: !361)
!361 = !DILexicalBlockFile(scope: !7, file: !8, discriminator: 1)
!362 = !DILocation(line: 165, column: 4, scope: !7)
!363 = !DILocation(line: 165, column: 31, scope: !361)
!364 = !DILocation(line: 165, column: 37, scope: !361)
!365 = !DILocation(line: 165, column: 19, scope: !361)
!366 = !DILocation(line: 165, column: 18, scope: !361)
!367 = !DILocation(line: 165, column: 109, scope: !361)
!368 = !DILocation(line: 165, column: 4, scope: !361)
!369 = !DILocation(line: 166, column: 13, scope: !7)
!370 = !DILocation(line: 166, column: 6, scope: !7)
!371 = !DILocation(line: 170, column: 10, scope: !372)
