; ModuleID = './[inter]ncurses--n_menu.o.i'
source_filename = "./[inter]ncurses--n_menu.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.libnet_context = type { i32, i32, %struct.libnet_protocol_block*, %struct.libnet_protocol_block*, i32, i32, i32, i32, i8*, %struct.libnet_stats, i32, [64 x i8], [256 x i8], i32 }
%struct.libnet_protocol_block = type { i8*, i32, i16, i32, i8, i8, i32, %struct.libnet_protocol_block*, %struct.libnet_protocol_block* }
%struct.libnet_stats = type { i64, i64, i64 }
%struct.tagMENU = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8*, i16, %struct._win_st*, %struct._win_st*, %struct._win_st*, %struct._win_st*, %struct.tagITEM**, i16, %struct.tagITEM*, i16, i64, i64, i64, i8, void (%struct.tagMENU*)*, void (%struct.tagMENU*)*, void (%struct.tagMENU*)*, void (%struct.tagMENU*)*, i8*, i8*, i32, i16 }
%struct._win_st = type { i16, i16, i16, i16, i16, i16, i16, i64, i64, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, %struct.ldat*, i16, i16, i32, i32, %struct._win_st*, %struct.pdat, i16 }
%struct.ldat = type opaque
%struct.pdat = type { i16, i16, i16, i16, i16, i16 }
%struct.tagITEM = type { %struct.TEXT, %struct.TEXT, %struct.tagMENU*, i8*, i32, i16, i16, i16, i8, %struct.tagITEM*, %struct.tagITEM*, %struct.tagITEM*, %struct.tagITEM* }
%struct.TEXT = type { i8*, i16 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !162)
!1 = !DIFile(filename: "[inter]ncurses--n_menu.o.i", directory: "/home/lichi/Desktop/nast/[task]nast")
!2 = !{}
!3 = !{!4, !58, !112, !57, !129, !148, !157}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "ITEM", file: !7, line: 86, baseType: !8)
!7 = !DIFile(filename: "/usr/include/menu.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tagITEM", file: !7, line: 69, size: 768, align: 64, elements: !9)
!9 = !{!10, !20, !21, !117, !118, !120, !121, !122, !123, !124, !126, !127, !128}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !8, file: !7, line: 71, baseType: !11, size: 128, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT", file: !7, line: 67, baseType: !12)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 63, size: 128, align: 64, elements: !13)
!13 = !{!14, !18}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !12, file: !7, line: 65, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!17 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !12, file: !7, line: 66, baseType: !19, size: 16, align: 16, offset: 64)
!19 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !8, file: !7, line: 72, baseType: !11, size: 128, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "imenu", scope: !8, file: !7, line: 73, baseType: !22, size: 64, align: 64, offset: 256)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tagMENU", file: !7, line: 90, size: 1600, align: 64, elements: !24)
!24 = !{!25, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !42, !43, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !103, !108, !109, !110, !111, !113, !114, !116}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !23, file: !7, line: 92, baseType: !26, size: 16, align: 16)
!26 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !23, file: !7, line: 93, baseType: !26, size: 16, align: 16, offset: 16)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !23, file: !7, line: 94, baseType: !26, size: 16, align: 16, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "cols", scope: !23, file: !7, line: 95, baseType: !26, size: 16, align: 16, offset: 48)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "frows", scope: !23, file: !7, line: 96, baseType: !26, size: 16, align: 16, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fcols", scope: !23, file: !7, line: 97, baseType: !26, size: 16, align: 16, offset: 80)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "arows", scope: !23, file: !7, line: 98, baseType: !26, size: 16, align: 16, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "namelen", scope: !23, file: !7, line: 99, baseType: !26, size: 16, align: 16, offset: 112)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "desclen", scope: !23, file: !7, line: 100, baseType: !26, size: 16, align: 16, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "marklen", scope: !23, file: !7, line: 101, baseType: !26, size: 16, align: 16, offset: 144)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "itemlen", scope: !23, file: !7, line: 102, baseType: !26, size: 16, align: 16, offset: 160)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "spc_desc", scope: !23, file: !7, line: 103, baseType: !26, size: 16, align: 16, offset: 176)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "spc_cols", scope: !23, file: !7, line: 104, baseType: !26, size: 16, align: 16, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "spc_rows", scope: !23, file: !7, line: 105, baseType: !26, size: 16, align: 16, offset: 208)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !23, file: !7, line: 106, baseType: !41, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "pindex", scope: !23, file: !7, line: 107, baseType: !26, size: 16, align: 16, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !23, file: !7, line: 108, baseType: !44, size: 64, align: 64, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW", file: !46, line: 372, baseType: !47)
!46 = !DIFile(filename: "/usr/include/curses.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_win_st", file: !46, line: 421, size: 768, align: 64, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !60, !61, !63, !64, !65, !66, !67, !68, !69, !70, !71, !73, !76, !77, !78, !79, !80, !81, !90}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_cury", scope: !47, file: !46, line: 423, baseType: !26, size: 16, align: 16)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_curx", scope: !47, file: !46, line: 423, baseType: !26, size: 16, align: 16, offset: 16)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_maxy", scope: !47, file: !46, line: 426, baseType: !26, size: 16, align: 16, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_maxx", scope: !47, file: !46, line: 426, baseType: !26, size: 16, align: 16, offset: 48)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_begy", scope: !47, file: !46, line: 427, baseType: !26, size: 16, align: 16, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_begx", scope: !47, file: !46, line: 427, baseType: !26, size: 16, align: 16, offset: 80)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !46, line: 429, baseType: !26, size: 16, align: 16, offset: 96)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_attrs", scope: !47, file: !46, line: 432, baseType: !57, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "attr_t", file: !46, line: 374, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "chtype", file: !46, line: 164, baseType: !59)
!59 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_bkgd", scope: !47, file: !46, line: 433, baseType: !58, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_notimeout", scope: !47, file: !46, line: 436, baseType: !62, size: 8, align: 8, offset: 256)
!62 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_clear", scope: !47, file: !46, line: 437, baseType: !62, size: 8, align: 8, offset: 264)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_leaveok", scope: !47, file: !46, line: 438, baseType: !62, size: 8, align: 8, offset: 272)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_scroll", scope: !47, file: !46, line: 439, baseType: !62, size: 8, align: 8, offset: 280)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_idlok", scope: !47, file: !46, line: 440, baseType: !62, size: 8, align: 8, offset: 288)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_idcok", scope: !47, file: !46, line: 441, baseType: !62, size: 8, align: 8, offset: 296)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_immed", scope: !47, file: !46, line: 442, baseType: !62, size: 8, align: 8, offset: 304)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_sync", scope: !47, file: !46, line: 443, baseType: !62, size: 8, align: 8, offset: 312)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_use_keypad", scope: !47, file: !46, line: 444, baseType: !62, size: 8, align: 8, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_delay", scope: !47, file: !46, line: 445, baseType: !72, size: 32, align: 32, offset: 352)
!72 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_line", scope: !47, file: !46, line: 447, baseType: !74, size: 64, align: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldat", file: !46, line: 419, flags: DIFlagFwdDecl)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_regtop", scope: !47, file: !46, line: 450, baseType: !26, size: 16, align: 16, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_regbottom", scope: !47, file: !46, line: 451, baseType: !26, size: 16, align: 16, offset: 464)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_parx", scope: !47, file: !46, line: 454, baseType: !72, size: 32, align: 32, offset: 480)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_pary", scope: !47, file: !46, line: 455, baseType: !72, size: 32, align: 32, offset: 512)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_parent", scope: !47, file: !46, line: 456, baseType: !44, size: 64, align: 64, offset: 576)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !47, file: !46, line: 464, baseType: !82, size: 96, align: 16, offset: 640)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pdat", file: !46, line: 459, size: 96, align: 16, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !89}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_y", scope: !82, file: !46, line: 461, baseType: !26, size: 16, align: 16)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_x", scope: !82, file: !46, line: 461, baseType: !26, size: 16, align: 16, offset: 16)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_top", scope: !82, file: !46, line: 462, baseType: !26, size: 16, align: 16, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_left", scope: !82, file: !46, line: 462, baseType: !26, size: 16, align: 16, offset: 48)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_bottom", scope: !82, file: !46, line: 463, baseType: !26, size: 16, align: 16, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_right", scope: !82, file: !46, line: 463, baseType: !26, size: 16, align: 16, offset: 80)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_yoffset", scope: !47, file: !46, line: 466, baseType: !26, size: 16, align: 16, offset: 736)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !23, file: !7, line: 109, baseType: !44, size: 64, align: 64, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "userwin", scope: !23, file: !7, line: 110, baseType: !44, size: 64, align: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "usersub", scope: !23, file: !7, line: 111, baseType: !44, size: 64, align: 64, offset: 576)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !23, file: !7, line: 112, baseType: !4, size: 64, align: 64, offset: 640)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "nitems", scope: !23, file: !7, line: 113, baseType: !26, size: 16, align: 16, offset: 704)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "curitem", scope: !23, file: !7, line: 114, baseType: !5, size: 64, align: 64, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "toprow", scope: !23, file: !7, line: 115, baseType: !26, size: 16, align: 16, offset: 832)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "fore", scope: !23, file: !7, line: 116, baseType: !58, size: 64, align: 64, offset: 896)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !23, file: !7, line: 117, baseType: !58, size: 64, align: 64, offset: 960)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "grey", scope: !23, file: !7, line: 118, baseType: !58, size: 64, align: 64, offset: 1024)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !23, file: !7, line: 119, baseType: !102, size: 8, align: 8, offset: 1088)
!102 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "menuinit", scope: !23, file: !7, line: 121, baseType: !104, size: 64, align: 64, offset: 1152)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "Menu_Hook", file: !7, line: 88, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !22}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "menuterm", scope: !23, file: !7, line: 122, baseType: !104, size: 64, align: 64, offset: 1216)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "iteminit", scope: !23, file: !7, line: 123, baseType: !104, size: 64, align: 64, offset: 1280)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "itemterm", scope: !23, file: !7, line: 124, baseType: !104, size: 64, align: 64, offset: 1344)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "userptr", scope: !23, file: !7, line: 126, baseType: !112, size: 64, align: 64, offset: 1408)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !23, file: !7, line: 127, baseType: !41, size: 64, align: 64, offset: 1472)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !23, file: !7, line: 129, baseType: !115, size: 32, align: 32, offset: 1536)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Menu_Options", file: !7, line: 49, baseType: !72)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !23, file: !7, line: 130, baseType: !19, size: 16, align: 16, offset: 1568)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "userptr", scope: !8, file: !7, line: 74, baseType: !112, size: 64, align: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !8, file: !7, line: 75, baseType: !119, size: 32, align: 32, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "Item_Options", file: !7, line: 50, baseType: !72)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !8, file: !7, line: 76, baseType: !26, size: 16, align: 16, offset: 416)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !7, line: 77, baseType: !26, size: 16, align: 16, offset: 432)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !7, line: 78, baseType: !26, size: 16, align: 16, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !8, file: !7, line: 79, baseType: !62, size: 8, align: 8, offset: 464)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !8, file: !7, line: 81, baseType: !125, size: 64, align: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !8, file: !7, line: 82, baseType: !125, size: 64, align: 64, offset: 576)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !8, file: !7, line: 83, baseType: !125, size: 64, align: 64, offset: 640)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !8, file: !7, line: 84, baseType: !125, size: 64, align: 64, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_conn", file: !131, line: 118, size: 448, align: 64, elements: !132)
!131 = !DIFile(filename: "ncurses/n_nast.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!132 = !{!133, !137, !142, !143, !146, !147}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !130, file: !131, line: 120, baseType: !134, size: 240, align: 8)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 240, align: 8, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 30)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ip_src", scope: !130, file: !131, line: 121, baseType: !138, size: 64, align: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_long", file: !139, line: 36, baseType: !140)
!139 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_long", file: !141, line: 33, baseType: !59)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ip_dst", scope: !130, file: !131, line: 122, baseType: !138, size: 64, align: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !130, file: !131, line: 123, baseType: !144, size: 16, align: 16, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !139, line: 34, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !141, line: 31, baseType: !19)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !130, file: !131, line: 124, baseType: !144, size: 16, align: 16, offset: 400)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !130, file: !131, line: 125, baseType: !72, size: 32, align: 32, offset: 416)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_conn_rst", file: !131, line: 134, size: 448, align: 64, elements: !150)
!150 = !{!151, !152, !153, !154, !155, !156}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !149, file: !131, line: 136, baseType: !134, size: 240, align: 8)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ip_src", scope: !149, file: !131, line: 137, baseType: !138, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ip_dst", scope: !149, file: !131, line: 138, baseType: !138, size: 64, align: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !149, file: !131, line: 139, baseType: !144, size: 16, align: 16, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !149, file: !131, line: 140, baseType: !144, size: 16, align: 16, offset: 400)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !149, file: !131, line: 141, baseType: !72, size: 32, align: 32, offset: 416)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_arp", file: !131, line: 128, size: 288, align: 32, elements: !159)
!159 = !{!160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !158, file: !131, line: 130, baseType: !134, size: 240, align: 8)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "lr", scope: !158, file: !131, line: 131, baseType: !72, size: 32, align: 32, offset: 256)
!162 = !{!163, !218, !222, !226, !230, !234, !292, !293, !294, !298, !299, !317, !321, !325, !331, !332, !333, !334, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !363, !364, !367, !371, !372, !373, !374, !375, !376, !377, !391, !392, !393, !394, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !415, !416, !420, !421, !422, !423, !424, !428, !430, !432, !434, !447, !463, !464, !465, !466, !467, !468, !478, !479}
!163 = distinct !DIGlobalVariable(name: "L", scope: !0, file: !164, line: 35, type: !165, isLocal: false, isDefinition: true, variable: %struct.libnet_context** @L)
!164 = !DIFile(filename: "ncurses/n_menu.c", directory: "/home/lichi/Desktop/nast/[task]nast")
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_t", file: !167, line: 235, baseType: !168)
!167 = !DIFile(filename: "/usr/local/include/libnet/libnet-structures.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_context", file: !167, line: 186, size: 3200, align: 64, elements: !169)
!169 = !{!170, !171, !172, !195, !196, !197, !198, !199, !200, !201, !208, !209, !213, !217}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !168, file: !167, line: 192, baseType: !72, size: 32, align: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "injection_type", scope: !168, file: !167, line: 194, baseType: !72, size: 32, align: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blocks", scope: !168, file: !167, line: 206, baseType: !173, size: 64, align: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_pblock_t", file: !167, line: 178, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_protocol_block", file: !167, line: 77, size: 384, align: 64, elements: !176)
!176 = !{!177, !181, !184, !186, !187, !188, !189, !192, !194}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !175, file: !167, line: 79, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !180, line: 48, baseType: !102)
!180 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!181 = !DIDerivedType(tag: DW_TAG_member, name: "b_len", scope: !175, file: !167, line: 80, baseType: !182, size: 32, align: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !180, line: 51, baseType: !183)
!183 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "h_len", scope: !175, file: !167, line: 81, baseType: !185, size: 16, align: 16, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !180, line: 49, baseType: !19)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "copied", scope: !175, file: !167, line: 92, baseType: !182, size: 32, align: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !175, file: !167, line: 94, baseType: !179, size: 8, align: 8, offset: 160)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !175, file: !167, line: 168, baseType: !179, size: 8, align: 8, offset: 168)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ptag", scope: !175, file: !167, line: 170, baseType: !190, size: 32, align: 32, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_ptag_t", file: !167, line: 70, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !139, line: 196, baseType: !72)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !175, file: !167, line: 175, baseType: !193, size: 64, align: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !175, file: !167, line: 176, baseType: !193, size: 64, align: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pblock_end", scope: !168, file: !167, line: 207, baseType: !173, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "n_pblocks", scope: !168, file: !167, line: 208, baseType: !182, size: 32, align: 32, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "link_type", scope: !168, file: !167, line: 210, baseType: !72, size: 32, align: 32, offset: 224)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "link_offset", scope: !168, file: !167, line: 224, baseType: !72, size: 32, align: 32, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "aligner", scope: !168, file: !167, line: 225, baseType: !72, size: 32, align: 32, offset: 288)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !168, file: !167, line: 226, baseType: !41, size: 64, align: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !168, file: !167, line: 228, baseType: !202, size: 192, align: 64, offset: 384)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_stats", file: !167, line: 52, size: 192, align: 64, elements: !203)
!203 = !{!204, !206, !207}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "packets_sent", scope: !202, file: !167, line: 55, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !180, line: 55, baseType: !59)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "packet_errors", scope: !202, file: !167, line: 56, baseType: !205, size: 64, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !202, file: !167, line: 57, baseType: !205, size: 64, align: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ptag_state", scope: !168, file: !167, line: 229, baseType: !190, size: 32, align: 32, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !168, file: !167, line: 230, baseType: !210, size: 512, align: 8, offset: 608)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 512, align: 8, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "err_buf", scope: !168, file: !167, line: 232, baseType: !214, size: 2048, align: 8, offset: 1120)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 2048, align: 8, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !168, file: !167, line: 233, baseType: !182, size: 32, align: 32, offset: 3168)
!218 = distinct !DIGlobalVariable(name: "choices", scope: !0, file: !164, line: 43, type: !219, isLocal: false, isDefinition: true, variable: [4 x i8*]* @choices)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 256, align: 64, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 4)
!222 = distinct !DIGlobalVariable(name: "sniffer", scope: !0, file: !164, line: 51, type: !223, isLocal: false, isDefinition: true, variable: [11 x i8*]* @sniffer)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 704, align: 64, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 11)
!226 = distinct !DIGlobalVariable(name: "analyzer", scope: !0, file: !164, line: 66, type: !227, isLocal: false, isDefinition: true, variable: [12 x i8*]* @analyzer)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 768, align: 64, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 12)
!230 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !164, line: 82, type: !231, isLocal: false, isDefinition: true, variable: [8 x i8*]* @options)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 512, align: 64, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 8)
!234 = distinct !DIGlobalVariable(name: "logd", scope: !0, file: !235, line: 98, type: !236, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @logd)
!235 = !DIFile(filename: "ncurses/../include/nast.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !238, line: 48, baseType: !239)
!238 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !240, line: 241, size: 1728, align: 64, elements: !241)
!240 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !262, !263, !264, !265, !268, !269, !271, !275, !278, !280, !281, !282, !283, !284, !287, !288}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !239, file: !240, line: 242, baseType: !72, size: 32, align: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !239, file: !240, line: 247, baseType: !41, size: 64, align: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !239, file: !240, line: 248, baseType: !41, size: 64, align: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !239, file: !240, line: 249, baseType: !41, size: 64, align: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !239, file: !240, line: 250, baseType: !41, size: 64, align: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !239, file: !240, line: 251, baseType: !41, size: 64, align: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !239, file: !240, line: 252, baseType: !41, size: 64, align: 64, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !239, file: !240, line: 253, baseType: !41, size: 64, align: 64, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !239, file: !240, line: 254, baseType: !41, size: 64, align: 64, offset: 512)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !239, file: !240, line: 256, baseType: !41, size: 64, align: 64, offset: 576)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !239, file: !240, line: 257, baseType: !41, size: 64, align: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !239, file: !240, line: 258, baseType: !41, size: 64, align: 64, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !239, file: !240, line: 260, baseType: !255, size: 64, align: 64, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !240, line: 156, size: 192, align: 64, elements: !257)
!257 = !{!258, !259, !261}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !256, file: !240, line: 157, baseType: !255, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !256, file: !240, line: 158, baseType: !260, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !256, file: !240, line: 162, baseType: !72, size: 32, align: 32, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !239, file: !240, line: 262, baseType: !260, size: 64, align: 64, offset: 832)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !239, file: !240, line: 264, baseType: !72, size: 32, align: 32, offset: 896)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !239, file: !240, line: 268, baseType: !72, size: 32, align: 32, offset: 928)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !239, file: !240, line: 270, baseType: !266, size: 64, align: 64, offset: 960)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !141, line: 131, baseType: !267)
!267 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !239, file: !240, line: 274, baseType: !19, size: 16, align: 16, offset: 1024)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !239, file: !240, line: 275, baseType: !270, size: 8, align: 8, offset: 1040)
!270 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !239, file: !240, line: 276, baseType: !272, size: 8, align: 8, offset: 1048)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, align: 8, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 1)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !239, file: !240, line: 280, baseType: !276, size: 64, align: 64, offset: 1088)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !240, line: 150, baseType: null)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !239, file: !240, line: 289, baseType: !279, size: 64, align: 64, offset: 1152)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !141, line: 132, baseType: !267)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !239, file: !240, line: 297, baseType: !112, size: 64, align: 64, offset: 1216)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !239, file: !240, line: 298, baseType: !112, size: 64, align: 64, offset: 1280)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !239, file: !240, line: 299, baseType: !112, size: 64, align: 64, offset: 1344)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !239, file: !240, line: 300, baseType: !112, size: 64, align: 64, offset: 1408)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !239, file: !240, line: 302, baseType: !285, size: 64, align: 64, offset: 1472)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !286, line: 216, baseType: !59)
!286 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !239, file: !240, line: 303, baseType: !72, size: 32, align: 32, offset: 1536)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !239, file: !240, line: 305, baseType: !289, size: 160, align: 8, offset: 1568)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 160, align: 8, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 20)
!292 = distinct !DIGlobalVariable(name: "offset", scope: !0, file: !235, line: 99, type: !26, isLocal: false, isDefinition: true, variable: i16* @offset)
!293 = distinct !DIGlobalVariable(name: "npkt", scope: !0, file: !235, line: 100, type: !72, isLocal: false, isDefinition: true, variable: i32* @npkt)
!294 = distinct !DIGlobalVariable(name: "packet", scope: !0, file: !235, line: 101, type: !295, isLocal: false, isDefinition: true, variable: i8** @packet)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !139, line: 33, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !141, line: 30, baseType: !102)
!298 = distinct !DIGlobalVariable(name: "buf", scope: !0, file: !235, line: 102, type: !295, isLocal: false, isDefinition: true, variable: i8** @buf)
!299 = distinct !DIGlobalVariable(name: "hdr", scope: !0, file: !235, line: 103, type: !300, isLocal: false, isDefinition: true, variable: %struct.pcap_pkthdr* @hdr)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_pkthdr", file: !301, line: 199, size: 192, align: 64, elements: !302)
!301 = !DIFile(filename: "/usr/local/include/pcap/pcap.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!302 = !{!303, !311, !316}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !300, file: !301, line: 200, baseType: !304, size: 128, align: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !305, line: 30, size: 128, align: 64, elements: !306)
!305 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!306 = !{!307, !309}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !304, file: !305, line: 32, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !141, line: 139, baseType: !267)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !304, file: !305, line: 33, baseType: !310, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !141, line: 141, baseType: !267)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "caplen", scope: !300, file: !301, line: 201, baseType: !312, size: 32, align: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "bpf_u_int32", file: !313, line: 85, baseType: !314)
!313 = !DIFile(filename: "/usr/local/include/pcap/bpf.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !139, line: 35, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !141, line: 32, baseType: !183)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !300, file: !301, line: 202, baseType: !312, size: 32, align: 32, offset: 160)
!317 = distinct !DIGlobalVariable(name: "descr", scope: !0, file: !235, line: 104, type: !318, isLocal: false, isDefinition: true, variable: %struct.pcap** @descr)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_t", file: !301, line: 118, baseType: !320)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap", file: !301, line: 118, flags: DIFlagFwdDecl)
!321 = distinct !DIGlobalVariable(name: "dumper", scope: !0, file: !131, line: 113, type: !322, isLocal: false, isDefinition: true, variable: %struct.pcap_dumper** @dumper)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_dumper_t", file: !301, line: 119, baseType: !324)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_dumper", file: !301, line: 119, flags: DIFlagFwdDecl)
!325 = distinct !DIGlobalVariable(name: "statistic", scope: !0, file: !235, line: 106, type: !326, isLocal: false, isDefinition: true, variable: %struct.pcap_stat* @statistic)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_stat", file: !301, line: 208, size: 96, align: 32, elements: !327)
!327 = !{!328, !329, !330}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ps_recv", scope: !326, file: !301, line: 209, baseType: !314, size: 32, align: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ps_drop", scope: !326, file: !301, line: 210, baseType: !314, size: 32, align: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ps_ifdrop", scope: !326, file: !301, line: 211, baseType: !314, size: 32, align: 32, offset: 64)
!331 = distinct !DIGlobalVariable(name: "maskp", scope: !0, file: !235, line: 107, type: !312, isLocal: false, isDefinition: true, variable: i32* @maskp)
!332 = distinct !DIGlobalVariable(name: "netp", scope: !0, file: !235, line: 108, type: !312, isLocal: false, isDefinition: true, variable: i32* @netp)
!333 = distinct !DIGlobalVariable(name: "datalink", scope: !0, file: !235, line: 109, type: !72, isLocal: false, isDefinition: true, variable: i32* @datalink)
!334 = distinct !DIGlobalVariable(name: "fp", scope: !0, file: !235, line: 110, type: !335, isLocal: false, isDefinition: true, variable: %struct.bpf_program* @fp)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_program", file: !313, line: 104, size: 128, align: 64, elements: !336)
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "bf_len", scope: !335, file: !313, line: 105, baseType: !314, size: 32, align: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "bf_insns", scope: !335, file: !313, line: 106, baseType: !339, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_insn", file: !313, line: 234, size: 64, align: 32, elements: !341)
!341 = !{!342, !343, !344, !345}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !340, file: !313, line: 235, baseType: !144, size: 16, align: 16)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "jt", scope: !340, file: !313, line: 236, baseType: !296, size: 8, align: 8, offset: 16)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "jf", scope: !340, file: !313, line: 237, baseType: !296, size: 8, align: 8, offset: 24)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !340, file: !313, line: 238, baseType: !312, size: 32, align: 32, offset: 32)
!346 = distinct !DIGlobalVariable(name: "logname", scope: !0, file: !235, line: 111, type: !41, isLocal: false, isDefinition: true, variable: i8** @logname)
!347 = distinct !DIGlobalVariable(name: "tcpdl", scope: !0, file: !235, line: 112, type: !41, isLocal: false, isDefinition: true, variable: i8** @tcpdl)
!348 = distinct !DIGlobalVariable(name: "tr", scope: !0, file: !235, line: 113, type: !144, isLocal: false, isDefinition: true, variable: i16* @tr)
!349 = distinct !DIGlobalVariable(name: "tl", scope: !0, file: !235, line: 113, type: !144, isLocal: false, isDefinition: true, variable: i16* @tl)
!350 = distinct !DIGlobalVariable(name: "graph", scope: !0, file: !235, line: 114, type: !144, isLocal: false, isDefinition: true, variable: i16* @graph)
!351 = distinct !DIGlobalVariable(name: "cont", scope: !0, file: !235, line: 115, type: !144, isLocal: false, isDefinition: true, variable: i16* @cont)
!352 = distinct !DIGlobalVariable(name: "stream_glob", scope: !0, file: !235, line: 117, type: !72, isLocal: false, isDefinition: true, variable: i32* @stream_glob)
!353 = distinct !DIGlobalVariable(name: "bc_glob", scope: !0, file: !235, line: 118, type: !72, isLocal: false, isDefinition: true, variable: i32* @bc_glob)
!354 = distinct !DIGlobalVariable(name: "sniff_glob", scope: !0, file: !235, line: 119, type: !72, isLocal: false, isDefinition: true, variable: i32* @sniff_glob)
!355 = distinct !DIGlobalVariable(name: "rst_glob", scope: !0, file: !235, line: 120, type: !72, isLocal: false, isDefinition: true, variable: i32* @rst_glob)
!356 = distinct !DIGlobalVariable(name: "arp_glob", scope: !0, file: !235, line: 121, type: !72, isLocal: false, isDefinition: true, variable: i32* @arp_glob)
!357 = distinct !DIGlobalVariable(name: "pt", scope: !0, file: !235, line: 122, type: !358, isLocal: false, isDefinition: true, variable: [2 x i64]* @pt)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 128, align: 64, elements: !361)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !360, line: 60, baseType: !59)
!360 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!361 = !{!362}
!362 = !DISubrange(count: 2)
!363 = distinct !DIGlobalVariable(name: "lg", scope: !0, file: !235, line: 123, type: !72, isLocal: false, isDefinition: true, variable: i32* @lg)
!364 = distinct !DIGlobalVariable(name: "tm", scope: !0, file: !235, line: 132, type: !365, isLocal: false, isDefinition: true, variable: i64* @tm)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !366, line: 75, baseType: !308)
!366 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!367 = distinct !DIGlobalVariable(name: "timed", scope: !0, file: !235, line: 133, type: !368, isLocal: false, isDefinition: true, variable: [60 x i8]* @timed)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 480, align: 8, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 60)
!371 = distinct !DIGlobalVariable(name: "demonize", scope: !0, file: !235, line: 136, type: !144, isLocal: false, isDefinition: true, variable: i16* @demonize)
!372 = distinct !DIGlobalVariable(name: "line_s", scope: !0, file: !235, line: 138, type: !72, isLocal: false, isDefinition: true, variable: i32* @line_s)
!373 = distinct !DIGlobalVariable(name: "row_s", scope: !0, file: !235, line: 139, type: !72, isLocal: false, isDefinition: true, variable: i32* @row_s)
!374 = distinct !DIGlobalVariable(name: "query", scope: !0, file: !131, line: 87, type: !44, isLocal: false, isDefinition: true, variable: %struct._win_st** @query)
!375 = distinct !DIGlobalVariable(name: "werror", scope: !0, file: !131, line: 88, type: !44, isLocal: false, isDefinition: true, variable: %struct._win_st** @werror)
!376 = distinct !DIGlobalVariable(name: "help", scope: !0, file: !131, line: 89, type: !44, isLocal: false, isDefinition: true, variable: %struct._win_st** @help)
!377 = distinct !DIGlobalVariable(name: "princ", scope: !0, file: !131, line: 90, type: !378, isLocal: false, isDefinition: true, variable: %struct.scrolling_window** @princ)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "N_SCROLLWIN", file: !131, line: 61, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "scrolling_window", file: !131, line: 49, size: 384, align: 64, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !380, file: !131, line: 51, baseType: !44, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !380, file: !131, line: 52, baseType: !44, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "y_scroll", scope: !380, file: !131, line: 53, baseType: !72, size: 32, align: 32, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "y_max", scope: !380, file: !131, line: 54, baseType: !72, size: 32, align: 32, offset: 160)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !380, file: !131, line: 55, baseType: !72, size: 32, align: 32, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "cols", scope: !380, file: !131, line: 56, baseType: !72, size: 32, align: 32, offset: 224)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !380, file: !131, line: 57, baseType: !72, size: 32, align: 32, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !380, file: !131, line: 58, baseType: !72, size: 32, align: 32, offset: 288)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !380, file: !131, line: 59, baseType: !41, size: 64, align: 64, offset: 320)
!391 = distinct !DIGlobalVariable(name: "winfo", scope: !0, file: !131, line: 91, type: !378, isLocal: false, isDefinition: true, variable: %struct.scrolling_window** @winfo)
!392 = distinct !DIGlobalVariable(name: "wstream", scope: !0, file: !131, line: 92, type: !378, isLocal: false, isDefinition: true, variable: %struct.scrolling_window** @wstream)
!393 = distinct !DIGlobalVariable(name: "wconn", scope: !0, file: !131, line: 93, type: !378, isLocal: false, isDefinition: true, variable: %struct.scrolling_window** @wconn)
!394 = distinct !DIGlobalVariable(name: "my_nmenu", scope: !0, file: !131, line: 95, type: !395, isLocal: false, isDefinition: true, variable: %struct.tagMENU** @my_nmenu)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "MENU", file: !7, line: 132, baseType: !23)
!397 = distinct !DIGlobalVariable(name: "curr_item", scope: !0, file: !131, line: 96, type: !5, isLocal: false, isDefinition: true, variable: %struct.tagITEM** @curr_item)
!398 = distinct !DIGlobalVariable(name: "my_nmenu_win", scope: !0, file: !131, line: 97, type: !44, isLocal: false, isDefinition: true, variable: %struct._win_st** @my_nmenu_win)
!399 = distinct !DIGlobalVariable(name: "pop_up", scope: !0, file: !131, line: 98, type: !44, isLocal: false, isDefinition: true, variable: %struct._win_st** @pop_up)
!400 = distinct !DIGlobalVariable(name: "mvar", scope: !0, file: !131, line: 100, type: !144, isLocal: false, isDefinition: true, variable: i16* @mvar)
!401 = distinct !DIGlobalVariable(name: "promisc", scope: !0, file: !131, line: 101, type: !144, isLocal: false, isDefinition: true, variable: i16* @promisc)
!402 = distinct !DIGlobalVariable(name: "hex", scope: !0, file: !131, line: 101, type: !144, isLocal: false, isDefinition: true, variable: i16* @hex)
!403 = distinct !DIGlobalVariable(name: "ascii", scope: !0, file: !131, line: 101, type: !144, isLocal: false, isDefinition: true, variable: i16* @ascii)
!404 = distinct !DIGlobalVariable(name: "ld", scope: !0, file: !131, line: 101, type: !144, isLocal: false, isDefinition: true, variable: i16* @ld)
!405 = distinct !DIGlobalVariable(name: "f", scope: !0, file: !131, line: 101, type: !144, isLocal: false, isDefinition: true, variable: i16* @f)
!406 = distinct !DIGlobalVariable(name: "lr", scope: !0, file: !131, line: 101, type: !144, isLocal: false, isDefinition: true, variable: i16* @lr)
!407 = distinct !DIGlobalVariable(name: "l", scope: !0, file: !131, line: 101, type: !144, isLocal: false, isDefinition: true, variable: i16* @l)
!408 = distinct !DIGlobalVariable(name: "flg", scope: !0, file: !131, line: 102, type: !144, isLocal: false, isDefinition: true, variable: i16* @flg)
!409 = distinct !DIGlobalVariable(name: "linm", scope: !0, file: !131, line: 103, type: !72, isLocal: false, isDefinition: true, variable: i32* @linm)
!410 = distinct !DIGlobalVariable(name: "fileds", scope: !0, file: !131, line: 104, type: !72, isLocal: false, isDefinition: true, variable: i32* @fileds)
!411 = distinct !DIGlobalVariable(name: "dev", scope: !0, file: !131, line: 105, type: !412, isLocal: false, isDefinition: true, variable: [10 x i8]* @dev)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 80, align: 8, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 10)
!415 = distinct !DIGlobalVariable(name: "n_filter", scope: !0, file: !131, line: 106, type: !368, isLocal: false, isDefinition: true, variable: [60 x i8]* @n_filter)
!416 = distinct !DIGlobalVariable(name: "ldfile", scope: !0, file: !131, line: 107, type: !417, isLocal: false, isDefinition: true, variable: [50 x i8]* @ldfile)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 400, align: 8, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 50)
!420 = distinct !DIGlobalVariable(name: "tcpdfile", scope: !0, file: !131, line: 108, type: !417, isLocal: false, isDefinition: true, variable: [50 x i8]* @tcpdfile)
!421 = distinct !DIGlobalVariable(name: "reportl", scope: !0, file: !131, line: 109, type: !417, isLocal: false, isDefinition: true, variable: [50 x i8]* @reportl)
!422 = distinct !DIGlobalVariable(name: "logfile", scope: !0, file: !131, line: 110, type: !417, isLocal: false, isDefinition: true, variable: [50 x i8]* @logfile)
!423 = distinct !DIGlobalVariable(name: "str", scope: !0, file: !131, line: 112, type: !318, isLocal: false, isDefinition: true, variable: %struct.pcap** @str)
!424 = distinct !DIGlobalVariable(name: "thID", scope: !0, file: !131, line: 116, type: !425, isLocal: false, isDefinition: true, variable: [6 x i64]* @thID)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 384, align: 64, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 6)
!428 = distinct !DIGlobalVariable(name: "th_data", scope: !0, file: !131, line: 144, type: !429, isLocal: false, isDefinition: true, variable: [1 x %struct.thread_conn]* @th_data)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 448, align: 64, elements: !273)
!430 = distinct !DIGlobalVariable(name: "th_r_data", scope: !0, file: !131, line: 145, type: !431, isLocal: false, isDefinition: true, variable: [1 x %struct.thread_conn_rst]* @th_r_data)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 448, align: 64, elements: !273)
!432 = distinct !DIGlobalVariable(name: "th_arp_data", scope: !0, file: !131, line: 146, type: !433, isLocal: false, isDefinition: true, variable: [1 x %struct.thread_arp]* @th_arp_data)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 288, align: 32, elements: !273)
!434 = distinct !DIGlobalVariable(name: "c_inf", scope: !0, file: !131, line: 161, type: !435, isLocal: false, isDefinition: true, variable: [30 x %struct.connections]* @c_inf)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 13440, align: 64, elements: !135)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "connections", file: !131, line: 148, size: 448, align: 64, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "s_ip", scope: !436, file: !131, line: 150, baseType: !59, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "d_ip", scope: !436, file: !131, line: 151, baseType: !59, size: 64, align: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "s_port", scope: !436, file: !131, line: 152, baseType: !19, size: 16, align: 16, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "d_port", scope: !436, file: !131, line: 153, baseType: !19, size: 16, align: 16, offset: 144)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !436, file: !131, line: 154, baseType: !138, size: 64, align: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !436, file: !131, line: 155, baseType: !138, size: 64, align: 64, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "lin", scope: !436, file: !131, line: 156, baseType: !72, size: 32, align: 32, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pr", scope: !436, file: !131, line: 157, baseType: !72, size: 32, align: 32, offset: 352)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !436, file: !131, line: 158, baseType: !72, size: 32, align: 32, offset: 384)
!447 = distinct !DIGlobalVariable(name: "sf", scope: !0, file: !131, line: 177, type: !448, isLocal: false, isDefinition: true, variable: [30 x %struct.cnn]* @sf)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 105600, align: 64, elements: !135)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cnn", file: !131, line: 164, size: 3520, align: 64, elements: !450)
!450 = !{!451, !455, !456, !457, !458, !459, !460, !461, !462}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !449, file: !131, line: 166, baseType: !452, size: 1600, align: 8)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 1600, align: 8, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 200)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "sfilter", scope: !449, file: !131, line: 168, baseType: !452, size: 1600, align: 8, offset: 1600)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !449, file: !131, line: 169, baseType: !138, size: 64, align: 64, offset: 3200)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !449, file: !131, line: 170, baseType: !138, size: 64, align: 64, offset: 3264)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ip_src", scope: !449, file: !131, line: 171, baseType: !138, size: 64, align: 64, offset: 3328)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ip_dst", scope: !449, file: !131, line: 172, baseType: !138, size: 64, align: 64, offset: 3392)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "s_port", scope: !449, file: !131, line: 173, baseType: !144, size: 16, align: 16, offset: 3456)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "d_port", scope: !449, file: !131, line: 174, baseType: !144, size: 16, align: 16, offset: 3472)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !449, file: !131, line: 175, baseType: !72, size: 32, align: 32, offset: 3488)
!463 = distinct !DIGlobalVariable(name: "nmax", scope: !0, file: !131, line: 180, type: !72, isLocal: false, isDefinition: true, variable: i32* @nmax)
!464 = distinct !DIGlobalVariable(name: "sport", scope: !0, file: !164, line: 33, type: !72, isLocal: false, isDefinition: true, variable: i32* @sport)
!465 = distinct !DIGlobalVariable(name: "dport", scope: !0, file: !164, line: 33, type: !72, isLocal: false, isDefinition: true, variable: i32* @dport)
!466 = distinct !DIGlobalVariable(name: "ip_src", scope: !0, file: !164, line: 34, type: !138, isLocal: false, isDefinition: true, variable: i64* @ip_src)
!467 = distinct !DIGlobalVariable(name: "ip_dst", scope: !0, file: !164, line: 34, type: !138, isLocal: false, isDefinition: true, variable: i64* @ip_dst)
!468 = distinct !DIGlobalVariable(name: "plist", scope: !0, file: !164, line: 36, type: !469, isLocal: false, isDefinition: true, variable: %struct.libnet_port_list_chain* @plist)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_plist_t", file: !167, line: 40, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_port_list_chain", file: !167, line: 41, size: 128, align: 64, elements: !471)
!471 = !{!472, !473, !474, !475, !476}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !470, file: !167, line: 43, baseType: !185, size: 16, align: 16)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "bport", scope: !470, file: !167, line: 44, baseType: !185, size: 16, align: 16, offset: 16)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "eport", scope: !470, file: !167, line: 45, baseType: !185, size: 16, align: 16, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !470, file: !167, line: 46, baseType: !179, size: 8, align: 8, offset: 48)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !470, file: !167, line: 47, baseType: !477, size: 64, align: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!478 = distinct !DIGlobalVariable(name: "plist_p", scope: !0, file: !164, line: 36, type: !477, isLocal: false, isDefinition: true, variable: %struct.libnet_port_list_chain** @plist_p)
!479 = distinct !DIGlobalVariable(name: "ports", scope: !0, file: !164, line: 38, type: !480, isLocal: true, isDefinition: true, variable: [14 x i16]* @ports)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 224, align: 16, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 14)
!483 = !{i32 2, !"Dwarf Version", i32 4}
!484 = !{i32 2, !"Debug Info Version", i32 3}
!485 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!486 = distinct !DISubprogram(name: "nmenu", scope: !164, file: !164, line: 94, type: !487, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!487 = !DISubroutineType(types: !488)
!488 = !{null}
!489 = !DILocalVariable(name: "my_items", scope: !486, file: !164, line: 96, type: !4)
!490 = !DIExpression()
!491 = !DILocation(line: 96, column: 11, scope: !486)
!492 = !DILocalVariable(name: "ris", scope: !486, file: !164, line: 97, type: !72)
!493 = !DILocation(line: 97, column: 8, scope: !486)
!494 = !DILocalVariable(name: "n_choices", scope: !486, file: !164, line: 98, type: !72)
!495 = !DILocation(line: 98, column: 8, scope: !486)
!496 = !DILocalVariable(name: "i", scope: !486, file: !164, line: 98, type: !72)
!497 = !DILocation(line: 98, column: 19, scope: !486)
!498 = !DILocation(line: 100, column: 8, scope: !486)
!499 = !DILocation(line: 102, column: 14, scope: !486)
!500 = !DILocation(line: 103, column: 31, scope: !486)
!501 = !DILocation(line: 103, column: 24, scope: !486)
!502 = !DILocation(line: 103, column: 15, scope: !486)
!503 = !DILocation(line: 103, column: 13, scope: !486)
!504 = !DILocation(line: 104, column: 10, scope: !505)
!505 = distinct !DILexicalBlock(scope: !486, file: !164, line: 104, column: 4)
!506 = !DILocation(line: 104, column: 8, scope: !505)
!507 = !DILocation(line: 104, column: 15, scope: !508)
!508 = !DILexicalBlockFile(scope: !509, file: !164, discriminator: 1)
!509 = distinct !DILexicalBlock(scope: !505, file: !164, line: 104, column: 4)
!510 = !DILocation(line: 104, column: 19, scope: !508)
!511 = !DILocation(line: 104, column: 17, scope: !508)
!512 = !DILocation(line: 104, column: 4, scope: !508)
!513 = !DILocation(line: 105, column: 37, scope: !509)
!514 = !DILocation(line: 105, column: 29, scope: !509)
!515 = !DILocation(line: 105, column: 49, scope: !509)
!516 = !DILocation(line: 105, column: 41, scope: !509)
!517 = !DILocation(line: 105, column: 20, scope: !509)
!518 = !DILocation(line: 105, column: 15, scope: !509)
!519 = !DILocation(line: 105, column: 6, scope: !509)
!520 = !DILocation(line: 105, column: 18, scope: !509)
!521 = !DILocation(line: 104, column: 30, scope: !522)
!522 = !DILexicalBlockFile(scope: !509, file: !164, discriminator: 2)
!523 = !DILocation(line: 104, column: 4, scope: !522)
!524 = distinct !{!524, !525}
!525 = !DILocation(line: 104, column: 4, scope: !486)
!526 = !DILocation(line: 107, column: 33, scope: !486)
!527 = !DILocation(line: 107, column: 15, scope: !486)
!528 = !DILocation(line: 107, column: 13, scope: !486)
!529 = !DILocation(line: 109, column: 28, scope: !486)
!530 = !DILocation(line: 109, column: 19, scope: !486)
!531 = !DILocation(line: 109, column: 17, scope: !486)
!532 = !DILocation(line: 110, column: 11, scope: !486)
!533 = !DILocation(line: 110, column: 4, scope: !486)
!534 = !DILocation(line: 111, column: 10, scope: !486)
!535 = !DILocation(line: 111, column: 4, scope: !486)
!536 = !DILocation(line: 113, column: 7, scope: !537)
!537 = distinct !DILexicalBlock(scope: !486, file: !164, line: 113, column: 7)
