; ModuleID = './[inter]map.o.i'
source_filename = "./[inter]map.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.host = type { [6 x i8], [4 x i8] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.pcap = type opaque
%struct.bpf_program = type { i32, %struct.bpf_insn* }
%struct.bpf_insn = type { i16, i8, i8, i32 }
%struct.pcap_pkthdr = type { %struct.timeval, i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.pcap_dumper = type opaque
%struct.pcap_stat = type { i32, i32, i32 }
%struct.libnet_context = type { i32, i32, %struct.libnet_protocol_block*, %struct.libnet_protocol_block*, i32, i32, i32, i32, i8*, %struct.libnet_stats, i32, [64 x i8], [256 x i8], i32 }
%struct.libnet_protocol_block = type { i8*, i32, i16, i32, i8, i8, i32, %struct.libnet_protocol_block*, %struct.libnet_protocol_block* }
%struct.libnet_stats = type { i64, i64, i64 }
%struct.libnet_ether_addr = type { [6 x i8] }
%struct.in_addr = type { i32 }
%struct.nast_arp_hdr = type { i16, i16, i8, i8, i16, [6 x i8], [4 x i8], [6 x i8], [4 x i8] }
%struct.libnet_ethernet_hdr = type { [6 x i8], [6 x i8], i16 }
%struct.fd_set = type { [16 x i64] }

@enet_dst = global [6 x i8] c"\FF\FF\FF\FF\FF\FF", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !49)
!1 = !DIFile(filename: "[inter]map.o.i", directory: "/home/lichi/Desktop/nast/[task]nast")
!2 = !{}
!3 = !{!4, !5, !10, !13, !16, !17, !18, !32}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_long", file: !6, line: 36, baseType: !7)
!6 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_long", file: !8, line: 33, baseType: !9)
!8 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!9 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !6, line: 33, baseType: !11)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !8, line: 30, baseType: !12)
!12 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !14, line: 54, baseType: !15)
!14 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!15 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_ethernet_hdr", file: !20, line: 497, size: 112, align: 16, elements: !21)
!20 = !DIFile(filename: "/usr/local/include/libnet/libnet-headers.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!21 = !{!22, !28, !29}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ether_dhost", scope: !19, file: !20, line: 499, baseType: !23, size: 48, align: 8)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 48, align: 8, elements: !26)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !25, line: 48, baseType: !12)
!25 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!26 = !{!27}
!27 = !DISubrange(count: 6)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ether_shost", scope: !19, file: !20, line: 500, baseType: !23, size: 48, align: 8, offset: 48)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ether_type", scope: !19, file: !20, line: 501, baseType: !30, size: 16, align: 16, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !25, line: 49, baseType: !31)
!31 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nast_arp_hdr", file: !34, line: 27, size: 224, align: 16, elements: !35)
!34 = !DIFile(filename: "include/ARPhdr.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!35 = !{!36, !37, !38, !39, !40, !41, !43, !47, !48}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ar_hrd", scope: !33, file: !34, line: 29, baseType: !31, size: 16, align: 16)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ar_pro", scope: !33, file: !34, line: 30, baseType: !31, size: 16, align: 16, offset: 16)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ar_hln", scope: !33, file: !34, line: 31, baseType: !12, size: 8, align: 8, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ar_pln", scope: !33, file: !34, line: 32, baseType: !12, size: 8, align: 8, offset: 40)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ar_op", scope: !33, file: !34, line: 33, baseType: !31, size: 16, align: 16, offset: 48)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__ar_sha", scope: !33, file: !34, line: 35, baseType: !42, size: 48, align: 8, offset: 64)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 48, align: 8, elements: !26)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__ar_sip", scope: !33, file: !34, line: 36, baseType: !44, size: 32, align: 8, offset: 112)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 32, align: 8, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 4)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__ar_tha", scope: !33, file: !34, line: 37, baseType: !42, size: 48, align: 8, offset: 144)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__ar_tip", scope: !33, file: !34, line: 38, baseType: !44, size: 32, align: 8, offset: 192)
!49 = !{!50, !53, !112, !114, !115, !116, !117, !136, !140, !144, !150, !151, !152, !153, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !184, !185, !188, !192, !193, !194, !195, !196, !197, !198, !204, !208}
!50 = distinct !DIGlobalVariable(name: "enet_dst", scope: !0, file: !51, line: 45, type: !52, isLocal: false, isDefinition: true, variable: [6 x i8]* @enet_dst)
!51 = !DIFile(filename: "map.c", directory: "/home/lichi/Desktop/nast/[task]nast")
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 48, align: 8, elements: !26)
!53 = distinct !DIGlobalVariable(name: "logd", scope: !0, file: !54, line: 98, type: !55, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @logd)
!54 = !DIFile(filename: "include/nast.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !57, line: 48, baseType: !58)
!57 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 241, size: 1728, align: 64, elements: !60)
!59 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!60 = !{!61, !62, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !83, !84, !85, !86, !88, !89, !91, !95, !98, !100, !101, !102, !103, !104, !107, !108}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !58, file: !59, line: 242, baseType: !16, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !58, file: !59, line: 247, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !58, file: !59, line: 248, baseType: !63, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !58, file: !59, line: 249, baseType: !63, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !58, file: !59, line: 250, baseType: !63, size: 64, align: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !58, file: !59, line: 251, baseType: !63, size: 64, align: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !58, file: !59, line: 252, baseType: !63, size: 64, align: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !58, file: !59, line: 253, baseType: !63, size: 64, align: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !58, file: !59, line: 254, baseType: !63, size: 64, align: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !58, file: !59, line: 256, baseType: !63, size: 64, align: 64, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !58, file: !59, line: 257, baseType: !63, size: 64, align: 64, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !58, file: !59, line: 258, baseType: !63, size: 64, align: 64, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !58, file: !59, line: 260, baseType: !76, size: 64, align: 64, offset: 768)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !59, line: 156, size: 192, align: 64, elements: !78)
!78 = !{!79, !80, !82}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !77, file: !59, line: 157, baseType: !76, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !77, file: !59, line: 158, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !77, file: !59, line: 162, baseType: !16, size: 32, align: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !58, file: !59, line: 262, baseType: !81, size: 64, align: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !58, file: !59, line: 264, baseType: !16, size: 32, align: 32, offset: 896)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !58, file: !59, line: 268, baseType: !16, size: 32, align: 32, offset: 928)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !58, file: !59, line: 270, baseType: !87, size: 64, align: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !8, line: 131, baseType: !15)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !58, file: !59, line: 274, baseType: !31, size: 16, align: 16, offset: 1024)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !58, file: !59, line: 275, baseType: !90, size: 8, align: 8, offset: 1040)
!90 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !58, file: !59, line: 276, baseType: !92, size: 8, align: 8, offset: 1048)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8, align: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 1)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !58, file: !59, line: 280, baseType: !96, size: 64, align: 64, offset: 1088)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !59, line: 150, baseType: null)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !58, file: !59, line: 289, baseType: !99, size: 64, align: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !8, line: 132, baseType: !15)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !58, file: !59, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !58, file: !59, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !58, file: !59, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !58, file: !59, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !58, file: !59, line: 302, baseType: !105, size: 64, align: 64, offset: 1472)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !106, line: 216, baseType: !9)
!106 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !58, file: !59, line: 303, baseType: !16, size: 32, align: 32, offset: 1536)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !58, file: !59, line: 305, baseType: !109, size: 160, align: 8, offset: 1568)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 160, align: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 20)
!112 = distinct !DIGlobalVariable(name: "offset", scope: !0, file: !54, line: 99, type: !113, isLocal: false, isDefinition: true, variable: i16* @offset)
!113 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!114 = distinct !DIGlobalVariable(name: "npkt", scope: !0, file: !54, line: 100, type: !16, isLocal: false, isDefinition: true, variable: i32* @npkt)
!115 = distinct !DIGlobalVariable(name: "packet", scope: !0, file: !54, line: 101, type: !17, isLocal: false, isDefinition: true, variable: i8** @packet)
!116 = distinct !DIGlobalVariable(name: "buf", scope: !0, file: !54, line: 102, type: !17, isLocal: false, isDefinition: true, variable: i8** @buf)
!117 = distinct !DIGlobalVariable(name: "hdr", scope: !0, file: !54, line: 103, type: !118, isLocal: false, isDefinition: true, variable: %struct.pcap_pkthdr* @hdr)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_pkthdr", file: !119, line: 199, size: 192, align: 64, elements: !120)
!119 = !DIFile(filename: "/usr/local/include/pcap/pcap.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!120 = !{!121, !129, !135}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !118, file: !119, line: 200, baseType: !122, size: 128, align: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !123, line: 30, size: 128, align: 64, elements: !124)
!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!124 = !{!125, !127}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !122, file: !123, line: 32, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !8, line: 139, baseType: !15)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !122, file: !123, line: 33, baseType: !128, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !8, line: 141, baseType: !15)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "caplen", scope: !118, file: !119, line: 201, baseType: !130, size: 32, align: 32, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "bpf_u_int32", file: !131, line: 85, baseType: !132)
!131 = !DIFile(filename: "/usr/local/include/pcap/bpf.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !6, line: 35, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !8, line: 32, baseType: !134)
!134 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !118, file: !119, line: 202, baseType: !130, size: 32, align: 32, offset: 160)
!136 = distinct !DIGlobalVariable(name: "descr", scope: !0, file: !54, line: 104, type: !137, isLocal: false, isDefinition: true, variable: %struct.pcap** @descr)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_t", file: !119, line: 118, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap", file: !119, line: 118, flags: DIFlagFwdDecl)
!140 = distinct !DIGlobalVariable(name: "dumper", scope: !0, file: !54, line: 105, type: !141, isLocal: false, isDefinition: true, variable: %struct.pcap_dumper** @dumper)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_dumper_t", file: !119, line: 119, baseType: !143)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_dumper", file: !119, line: 119, flags: DIFlagFwdDecl)
!144 = distinct !DIGlobalVariable(name: "statistic", scope: !0, file: !54, line: 106, type: !145, isLocal: false, isDefinition: true, variable: %struct.pcap_stat* @statistic)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_stat", file: !119, line: 208, size: 96, align: 32, elements: !146)
!146 = !{!147, !148, !149}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ps_recv", scope: !145, file: !119, line: 209, baseType: !132, size: 32, align: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ps_drop", scope: !145, file: !119, line: 210, baseType: !132, size: 32, align: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ps_ifdrop", scope: !145, file: !119, line: 211, baseType: !132, size: 32, align: 32, offset: 64)
!150 = distinct !DIGlobalVariable(name: "maskp", scope: !0, file: !54, line: 107, type: !130, isLocal: false, isDefinition: true, variable: i32* @maskp)
!151 = distinct !DIGlobalVariable(name: "netp", scope: !0, file: !54, line: 108, type: !130, isLocal: false, isDefinition: true, variable: i32* @netp)
!152 = distinct !DIGlobalVariable(name: "datalink", scope: !0, file: !54, line: 109, type: !16, isLocal: false, isDefinition: true, variable: i32* @datalink)
!153 = distinct !DIGlobalVariable(name: "fp", scope: !0, file: !54, line: 110, type: !154, isLocal: false, isDefinition: true, variable: %struct.bpf_program* @fp)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_program", file: !131, line: 104, size: 128, align: 64, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "bf_len", scope: !154, file: !131, line: 105, baseType: !132, size: 32, align: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bf_insns", scope: !154, file: !131, line: 106, baseType: !158, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_insn", file: !131, line: 234, size: 64, align: 32, elements: !160)
!160 = !{!161, !164, !165, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !159, file: !131, line: 235, baseType: !162, size: 16, align: 16)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !6, line: 34, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !8, line: 31, baseType: !31)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "jt", scope: !159, file: !131, line: 236, baseType: !10, size: 8, align: 8, offset: 16)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "jf", scope: !159, file: !131, line: 237, baseType: !10, size: 8, align: 8, offset: 24)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !159, file: !131, line: 238, baseType: !130, size: 32, align: 32, offset: 32)
!167 = distinct !DIGlobalVariable(name: "logname", scope: !0, file: !54, line: 111, type: !63, isLocal: false, isDefinition: true, variable: i8** @logname)
!168 = distinct !DIGlobalVariable(name: "tcpdl", scope: !0, file: !54, line: 112, type: !63, isLocal: false, isDefinition: true, variable: i8** @tcpdl)
!169 = distinct !DIGlobalVariable(name: "tr", scope: !0, file: !54, line: 113, type: !162, isLocal: false, isDefinition: true, variable: i16* @tr)
!170 = distinct !DIGlobalVariable(name: "tl", scope: !0, file: !54, line: 113, type: !162, isLocal: false, isDefinition: true, variable: i16* @tl)
!171 = distinct !DIGlobalVariable(name: "graph", scope: !0, file: !54, line: 114, type: !162, isLocal: false, isDefinition: true, variable: i16* @graph)
!172 = distinct !DIGlobalVariable(name: "cont", scope: !0, file: !54, line: 115, type: !162, isLocal: false, isDefinition: true, variable: i16* @cont)
!173 = distinct !DIGlobalVariable(name: "stream_glob", scope: !0, file: !54, line: 117, type: !16, isLocal: false, isDefinition: true, variable: i32* @stream_glob)
!174 = distinct !DIGlobalVariable(name: "bc_glob", scope: !0, file: !54, line: 118, type: !16, isLocal: false, isDefinition: true, variable: i32* @bc_glob)
!175 = distinct !DIGlobalVariable(name: "sniff_glob", scope: !0, file: !54, line: 119, type: !16, isLocal: false, isDefinition: true, variable: i32* @sniff_glob)
!176 = distinct !DIGlobalVariable(name: "rst_glob", scope: !0, file: !54, line: 120, type: !16, isLocal: false, isDefinition: true, variable: i32* @rst_glob)
!177 = distinct !DIGlobalVariable(name: "arp_glob", scope: !0, file: !54, line: 121, type: !16, isLocal: false, isDefinition: true, variable: i32* @arp_glob)
!178 = distinct !DIGlobalVariable(name: "pt", scope: !0, file: !54, line: 122, type: !179, isLocal: false, isDefinition: true, variable: [2 x i64]* @pt)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 128, align: 64, elements: !182)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !181, line: 60, baseType: !9)
!181 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!182 = !{!183}
!183 = !DISubrange(count: 2)
!184 = distinct !DIGlobalVariable(name: "lg", scope: !0, file: !54, line: 123, type: !16, isLocal: false, isDefinition: true, variable: i32* @lg)
!185 = distinct !DIGlobalVariable(name: "tm", scope: !0, file: !54, line: 132, type: !186, isLocal: false, isDefinition: true, variable: i64* @tm)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !187, line: 75, baseType: !126)
!187 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!188 = distinct !DIGlobalVariable(name: "timed", scope: !0, file: !54, line: 133, type: !189, isLocal: false, isDefinition: true, variable: [60 x i8]* @timed)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 480, align: 8, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 60)
!192 = distinct !DIGlobalVariable(name: "demonize", scope: !0, file: !54, line: 136, type: !162, isLocal: false, isDefinition: true, variable: i16* @demonize)
!193 = distinct !DIGlobalVariable(name: "line_s", scope: !0, file: !54, line: 138, type: !16, isLocal: false, isDefinition: true, variable: i32* @line_s)
!194 = distinct !DIGlobalVariable(name: "row_s", scope: !0, file: !54, line: 139, type: !16, isLocal: false, isDefinition: true, variable: i32* @row_s)
!195 = distinct !DIGlobalVariable(name: "line", scope: !0, file: !51, line: 43, type: !16, isLocal: false, isDefinition: true, variable: i32* @line)
!196 = distinct !DIGlobalVariable(name: "k", scope: !0, file: !51, line: 50, type: !162, isLocal: false, isDefinition: true, variable: i16* @k)
!197 = distinct !DIGlobalVariable(name: "count", scope: !0, file: !51, line: 50, type: !162, isLocal: false, isDefinition: true, variable: i16* @count)
!198 = distinct !DIGlobalVariable(name: "uphost", scope: !0, file: !51, line: 51, type: !199, isLocal: false, isDefinition: true, variable: %struct.host** @uphost)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "host", file: !54, line: 125, size: 80, align: 8, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !200, file: !54, line: 127, baseType: !42, size: 48, align: 8)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !200, file: !54, line: 128, baseType: !44, size: 32, align: 8, offset: 48)
!204 = distinct !DIGlobalVariable(name: "errbuf", scope: !0, file: !51, line: 52, type: !205, isLocal: false, isDefinition: true, variable: [256 x i8]* @errbuf)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 2048, align: 8, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 256)
!208 = distinct !DIGlobalVariable(name: "ptag", scope: !0, file: !51, line: 53, type: !209, isLocal: false, isDefinition: true, variable: i32* @ptag)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_ptag_t", file: !210, line: 70, baseType: !211)
!210 = !DIFile(filename: "/usr/local/include/libnet/libnet-structures.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !6, line: 196, baseType: !16)
!212 = !{i32 2, !"Dwarf Version", i32 4}
!213 = !{i32 2, !"Debug Info Version", i32 3}
!214 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!215 = distinct !DISubprogram(name: "map_lan", scope: !51, file: !51, line: 55, type: !216, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!216 = !DISubroutineType(types: !217)
!217 = !{!199, !63, !162, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!219 = !DILocalVariable(name: "dev", arg: 1, scope: !215, file: !51, line: 55, type: !63)
!220 = !DIExpression()
!221 = !DILocation(line: 55, column: 29, scope: !215)
!222 = !DILocalVariable(name: "mode", arg: 2, scope: !215, file: !51, line: 55, type: !162)
!223 = !DILocation(line: 55, column: 42, scope: !215)
!224 = !DILocalVariable(name: "n", arg: 3, scope: !215, file: !51, line: 55, type: !218)
!225 = !DILocation(line: 55, column: 58, scope: !215)
!226 = !DILocalVariable(name: "l", scope: !215, file: !51, line: 57, type: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_t", file: !210, line: 235, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_context", file: !210, line: 186, size: 3200, align: 64, elements: !230)
!230 = !{!231, !232, !233, !250, !251, !252, !253, !254, !255, !256, !263, !264, !268, !269}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !229, file: !210, line: 192, baseType: !16, size: 32, align: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "injection_type", scope: !229, file: !210, line: 194, baseType: !16, size: 32, align: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blocks", scope: !229, file: !210, line: 206, baseType: !234, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_pblock_t", file: !210, line: 178, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_protocol_block", file: !210, line: 77, size: 384, align: 64, elements: !237)
!237 = !{!238, !240, !242, !243, !244, !245, !246, !247, !249}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !236, file: !210, line: 79, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "b_len", scope: !236, file: !210, line: 80, baseType: !241, size: 32, align: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !25, line: 51, baseType: !134)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "h_len", scope: !236, file: !210, line: 81, baseType: !30, size: 16, align: 16, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "copied", scope: !236, file: !210, line: 92, baseType: !241, size: 32, align: 32, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !236, file: !210, line: 94, baseType: !24, size: 8, align: 8, offset: 160)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !236, file: !210, line: 168, baseType: !24, size: 8, align: 8, offset: 168)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ptag", scope: !236, file: !210, line: 170, baseType: !209, size: 32, align: 32, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !210, line: 175, baseType: !248, size: 64, align: 64, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !236, file: !210, line: 176, baseType: !248, size: 64, align: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pblock_end", scope: !229, file: !210, line: 207, baseType: !234, size: 64, align: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "n_pblocks", scope: !229, file: !210, line: 208, baseType: !241, size: 32, align: 32, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "link_type", scope: !229, file: !210, line: 210, baseType: !16, size: 32, align: 32, offset: 224)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "link_offset", scope: !229, file: !210, line: 224, baseType: !16, size: 32, align: 32, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "aligner", scope: !229, file: !210, line: 225, baseType: !16, size: 32, align: 32, offset: 288)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !229, file: !210, line: 226, baseType: !63, size: 64, align: 64, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !229, file: !210, line: 228, baseType: !257, size: 192, align: 64, offset: 384)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_stats", file: !210, line: 52, size: 192, align: 64, elements: !258)
!258 = !{!259, !261, !262}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "packets_sent", scope: !257, file: !210, line: 55, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !25, line: 55, baseType: !9)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "packet_errors", scope: !257, file: !210, line: 56, baseType: !260, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !257, file: !210, line: 57, baseType: !260, size: 64, align: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ptag_state", scope: !229, file: !210, line: 229, baseType: !209, size: 32, align: 32, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !229, file: !210, line: 230, baseType: !265, size: 512, align: 8, offset: 608)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 512, align: 8, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "err_buf", scope: !229, file: !210, line: 232, baseType: !205, size: 2048, align: 8, offset: 1120)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !229, file: !210, line: 233, baseType: !241, size: 32, align: 32, offset: 3168)
!270 = !DILocation(line: 57, column: 14, scope: !215)
!271 = !DILocalVariable(name: "e", scope: !215, file: !51, line: 58, type: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_ether_addr", file: !20, line: 530, size: 48, align: 8, elements: !274)
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ether_addr_octet", scope: !273, file: !20, line: 532, baseType: !23, size: 48, align: 8)
!276 = !DILocation(line: 58, column: 30, scope: !215)
!277 = !DILocalVariable(name: "addr", scope: !215, file: !51, line: 59, type: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !279, line: 31, size: 32, align: 32, elements: !280)
!279 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!280 = !{!281}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !278, file: !279, line: 33, baseType: !282, size: 32, align: 32)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !279, line: 30, baseType: !241)
!283 = !DILocation(line: 59, column: 19, scope: !215)
!284 = !DILocalVariable(name: "r", scope: !215, file: !51, line: 60, type: !285)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 24, align: 8, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 3)
!288 = !DILocation(line: 60, column: 9, scope: !215)
!289 = !DILocalVariable(name: "ip_src", scope: !215, file: !51, line: 61, type: !15)
!290 = !DILocation(line: 61, column: 9, scope: !215)
!291 = !DILocalVariable(name: "u", scope: !215, file: !51, line: 62, type: !5)
!292 = !DILocation(line: 62, column: 11, scope: !215)
!293 = !DILocalVariable(name: "i", scope: !215, file: !51, line: 63, type: !132)
!294 = !DILocation(line: 63, column: 10, scope: !215)
!295 = !DILocalVariable(name: "ip_dst", scope: !215, file: !51, line: 64, type: !296)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32, align: 8, elements: !45)
!297 = !DILocation(line: 64, column: 11, scope: !215)
!298 = !DILocalVariable(name: "orig_ip", scope: !215, file: !51, line: 64, type: !296)
!299 = !DILocation(line: 64, column: 22, scope: !215)
!300 = !DILocalVariable(name: "netmask", scope: !215, file: !51, line: 65, type: !296)
!301 = !DILocation(line: 65, column: 11, scope: !215)
!302 = !DILocalVariable(name: "enet_src", scope: !215, file: !51, line: 65, type: !52)
!303 = !DILocation(line: 65, column: 23, scope: !215)
!304 = !DILocalVariable(name: "offset", scope: !215, file: !51, line: 65, type: !296)
!305 = !DILocation(line: 65, column: 36, scope: !215)
!306 = !DILocalVariable(name: "net", scope: !215, file: !51, line: 66, type: !63)
!307 = !DILocation(line: 66, column: 10, scope: !215)
!308 = !DILocalVariable(name: "mask", scope: !215, file: !51, line: 66, type: !63)
!309 = !DILocation(line: 66, column: 16, scope: !215)
!310 = !DILocalVariable(name: "j", scope: !215, file: !51, line: 67, type: !311)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 64, align: 16, elements: !45)
!312 = !DILocation(line: 67, column: 12, scope: !215)
!313 = !DILocation(line: 70, column: 16, scope: !215)
!314 = !DILocation(line: 70, column: 11, scope: !215)
!315 = !DILocation(line: 70, column: 9, scope: !215)
!316 = !DILocation(line: 71, column: 9, scope: !215)
!317 = !DILocation(line: 74, column: 7, scope: !318)
!318 = distinct !DILexicalBlock(scope: !215, file: !51, line: 74, column: 7)
!319 = !DILocation(line: 74, column: 13, scope: !318)
!320 = !DILocation(line: 74, column: 16, scope: !321)
!321 = !DILexicalBlockFile(scope: !318, file: !51, discriminator: 1)
!322 = !DILocation(line: 74, column: 7, scope: !321)
!323 = !DILocation(line: 75, column: 6, scope: !318)
!324 = !DILocation(line: 79, column: 13, scope: !215)
