; ModuleID = './[inter]icmp.o.i'
source_filename = "./[inter]icmp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.pcap_pkthdr = type { %struct.timeval, i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.pcap = type opaque
%struct.pcap_dumper = type opaque
%struct.pcap_stat = type { i32, i32, i32 }
%struct.bpf_program = type { i32, %struct.bpf_insn* }
%struct.bpf_insn = type { i16, i8, i8, i32 }
%struct.libnet_ipv4_hdr = type { i8, i8, i16, i16, i16, i8, i8, i16, %struct.in_addr, %struct.in_addr }
%struct.in_addr = type { i32 }
%struct.libnet_icmpv4_hdr = type { i8, i8, i16, %union.anon, %union.anon.1 }
%union.anon = type { i32 }
%union.anon.1 = type { %struct.anon.3 }
%struct.anon.3 = type { %struct.libnet_ipv4_hdr }

@packet = common global i8* null, align 8
@offset = common global i16 0, align 2
@.str = private unnamed_addr constant [6 x i8] c"princ\00", align 1
@line_s = common global i32 0, align 4
@row_s = common global i32 0, align 4
@lg = common global i32 0, align 4
@.str.1 = private unnamed_addr constant [72 x i8] c"\0A---[ ICMP ]----------------------------------------------------------\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !74)
!1 = !DIFile(filename: "[inter]icmp.o.i", directory: "/home/lichi/Desktop/nast/[task]nast")
!2 = !{}
!3 = !{!4, !31, !72}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_ipv4_hdr", file: !6, line: 666, size: 160, align: 32, elements: !7)
!6 = !DIFile(filename: "/usr/local/include/libnet/libnet-headers.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!7 = !{!8, !12, !13, !14, !17, !18, !19, !20, !21, !22, !30}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "ip_hl", scope: !5, file: !6, line: 669, baseType: !9, size: 4, align: 8, flags: DIFlagBitField, extraData: i64 0)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !10, line: 48, baseType: !11)
!10 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!11 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "ip_v", scope: !5, file: !6, line: 670, baseType: !9, size: 4, align: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "ip_tos", scope: !5, file: !6, line: 676, baseType: !9, size: 8, align: 8, offset: 8)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "ip_len", scope: !5, file: !6, line: 689, baseType: !15, size: 16, align: 16, offset: 16)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !10, line: 49, baseType: !16)
!16 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !5, file: !6, line: 690, baseType: !15, size: 16, align: 16, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ip_off", scope: !5, file: !6, line: 691, baseType: !15, size: 16, align: 16, offset: 48)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl", scope: !5, file: !6, line: 704, baseType: !9, size: 8, align: 8, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ip_p", scope: !5, file: !6, line: 705, baseType: !9, size: 8, align: 8, offset: 72)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ip_sum", scope: !5, file: !6, line: 706, baseType: !15, size: 16, align: 16, offset: 80)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ip_src", scope: !5, file: !6, line: 707, baseType: !23, size: 32, align: 32, offset: 96)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !24, line: 31, size: 32, align: 32, elements: !25)
!24 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!25 = !{!26}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !23, file: !24, line: 33, baseType: !27, size: 32, align: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !24, line: 30, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !10, line: 51, baseType: !29)
!29 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ip_dst", scope: !5, file: !6, line: 707, baseType: !23, size: 32, align: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_icmpv4_hdr", file: !6, line: 969, size: 224, align: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !51}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "icmp_type", scope: !32, file: !6, line: 971, baseType: !9, size: 8, align: 8)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "icmp_code", scope: !32, file: !6, line: 1017, baseType: !9, size: 8, align: 8, offset: 8)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "icmp_sum", scope: !32, file: !6, line: 1088, baseType: !15, size: 16, align: 16, offset: 16)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "hun", scope: !32, file: !6, line: 1114, baseType: !38, size: 32, align: 32, offset: 32)
!38 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !32, file: !6, line: 1090, size: 32, align: 32, elements: !39)
!39 = !{!40, !45, !46}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !38, file: !6, line: 1096, baseType: !41, size: 32, align: 16)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !38, file: !6, line: 1092, size: 32, align: 16, elements: !42)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !41, file: !6, line: 1094, baseType: !15, size: 16, align: 16)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !41, file: !6, line: 1095, baseType: !15, size: 16, align: 16, offset: 16)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "gateway", scope: !38, file: !6, line: 1108, baseType: !28, size: 32, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !38, file: !6, line: 1113, baseType: !47, size: 32, align: 16)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !38, file: !6, line: 1109, size: 32, align: 16, elements: !48)
!48 = !{!49, !50}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !47, file: !6, line: 1111, baseType: !15, size: 16, align: 16)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !47, file: !6, line: 1112, baseType: !15, size: 16, align: 16, offset: 16)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "dun", scope: !32, file: !6, line: 1142, baseType: !52, size: 160, align: 32, offset: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !32, file: !6, line: 1115, size: 160, align: 32, elements: !53)
!53 = !{!54, !60, !64, !65}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !52, file: !6, line: 1122, baseType: !55, size: 96, align: 32)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !52, file: !6, line: 1117, size: 96, align: 32, elements: !56)
!56 = !{!57, !58, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "its_otime", scope: !55, file: !6, line: 1119, baseType: !28, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "its_rtime", scope: !55, file: !6, line: 1120, baseType: !28, size: 32, align: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "its_ttime", scope: !55, file: !6, line: 1121, baseType: !28, size: 32, align: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !52, file: !6, line: 1127, baseType: !61, size: 160, align: 32)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !52, file: !6, line: 1123, size: 160, align: 32, elements: !62)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "idi_ip", scope: !61, file: !6, line: 1125, baseType: !5, size: 160, align: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !52, file: !6, line: 1128, baseType: !28, size: 32, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !52, file: !6, line: 1129, baseType: !66, size: 8, align: 8)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 8, align: 8, elements: !70)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !68, line: 194, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!69 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!70 = !{!71}
!71 = !DISubrange(count: 1)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!74 = !{!75, !134, !136, !137, !141, !142, !160, !164, !168, !174, !175, !176, !177, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !208, !209, !212, !216, !217, !218}
!75 = distinct !DIGlobalVariable(name: "logd", scope: !0, file: !76, line: 98, type: !77, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @logd)
!76 = !DIFile(filename: "include/nast.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !79, line: 48, baseType: !80)
!79 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !81, line: 241, size: 1728, align: 64, elements: !82)
!81 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!82 = !{!83, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !104, !105, !106, !107, !111, !112, !113, !115, !118, !120, !122, !123, !124, !125, !129, !130}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !80, file: !81, line: 242, baseType: !84, size: 32, align: 32)
!84 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !80, file: !81, line: 247, baseType: !72, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !80, file: !81, line: 248, baseType: !72, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !80, file: !81, line: 249, baseType: !72, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !80, file: !81, line: 250, baseType: !72, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !80, file: !81, line: 251, baseType: !72, size: 64, align: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !80, file: !81, line: 252, baseType: !72, size: 64, align: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !80, file: !81, line: 253, baseType: !72, size: 64, align: 64, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !80, file: !81, line: 254, baseType: !72, size: 64, align: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !80, file: !81, line: 256, baseType: !72, size: 64, align: 64, offset: 576)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !80, file: !81, line: 257, baseType: !72, size: 64, align: 64, offset: 640)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !80, file: !81, line: 258, baseType: !72, size: 64, align: 64, offset: 704)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !80, file: !81, line: 260, baseType: !97, size: 64, align: 64, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !81, line: 156, size: 192, align: 64, elements: !99)
!99 = !{!100, !101, !103}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !98, file: !81, line: 157, baseType: !97, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !98, file: !81, line: 158, baseType: !102, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !98, file: !81, line: 162, baseType: !84, size: 32, align: 32, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !80, file: !81, line: 262, baseType: !102, size: 64, align: 64, offset: 832)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !80, file: !81, line: 264, baseType: !84, size: 32, align: 32, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !80, file: !81, line: 268, baseType: !84, size: 32, align: 32, offset: 928)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !80, file: !81, line: 270, baseType: !108, size: 64, align: 64, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !109, line: 131, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!110 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !80, file: !81, line: 274, baseType: !16, size: 16, align: 16, offset: 1024)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !80, file: !81, line: 275, baseType: !69, size: 8, align: 8, offset: 1040)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !80, file: !81, line: 276, baseType: !114, size: 8, align: 8, offset: 1048)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 8, align: 8, elements: !70)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !80, file: !81, line: 280, baseType: !116, size: 64, align: 64, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !81, line: 150, baseType: null)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !80, file: !81, line: 289, baseType: !119, size: 64, align: 64, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !109, line: 132, baseType: !110)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !80, file: !81, line: 297, baseType: !121, size: 64, align: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !80, file: !81, line: 298, baseType: !121, size: 64, align: 64, offset: 1280)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !80, file: !81, line: 299, baseType: !121, size: 64, align: 64, offset: 1344)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !80, file: !81, line: 300, baseType: !121, size: 64, align: 64, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !80, file: !81, line: 302, baseType: !126, size: 64, align: 64, offset: 1472)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !127, line: 216, baseType: !128)
!127 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!128 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !80, file: !81, line: 303, baseType: !84, size: 32, align: 32, offset: 1536)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !80, file: !81, line: 305, baseType: !131, size: 160, align: 8, offset: 1568)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 160, align: 8, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 20)
!134 = distinct !DIGlobalVariable(name: "offset", scope: !0, file: !76, line: 99, type: !135, isLocal: false, isDefinition: true, variable: i16* @offset)
!135 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!136 = distinct !DIGlobalVariable(name: "npkt", scope: !0, file: !76, line: 100, type: !84, isLocal: false, isDefinition: true, variable: i32* @npkt)
!137 = distinct !DIGlobalVariable(name: "packet", scope: !0, file: !76, line: 101, type: !138, isLocal: false, isDefinition: true, variable: i8** @packet)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !68, line: 33, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !109, line: 30, baseType: !11)
!141 = distinct !DIGlobalVariable(name: "buf", scope: !0, file: !76, line: 102, type: !138, isLocal: false, isDefinition: true, variable: i8** @buf)
!142 = distinct !DIGlobalVariable(name: "hdr", scope: !0, file: !76, line: 103, type: !143, isLocal: false, isDefinition: true, variable: %struct.pcap_pkthdr* @hdr)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_pkthdr", file: !144, line: 199, size: 192, align: 64, elements: !145)
!144 = !DIFile(filename: "/usr/local/include/pcap/pcap.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!145 = !{!146, !154, !159}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !143, file: !144, line: 200, baseType: !147, size: 128, align: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !148, line: 30, size: 128, align: 64, elements: !149)
!148 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!149 = !{!150, !152}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !147, file: !148, line: 32, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !109, line: 139, baseType: !110)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !147, file: !148, line: 33, baseType: !153, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !109, line: 141, baseType: !110)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "caplen", scope: !143, file: !144, line: 201, baseType: !155, size: 32, align: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "bpf_u_int32", file: !156, line: 85, baseType: !157)
!156 = !DIFile(filename: "/usr/local/include/pcap/bpf.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !68, line: 35, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !109, line: 32, baseType: !29)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !143, file: !144, line: 202, baseType: !155, size: 32, align: 32, offset: 160)
!160 = distinct !DIGlobalVariable(name: "descr", scope: !0, file: !76, line: 104, type: !161, isLocal: false, isDefinition: true, variable: %struct.pcap** @descr)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_t", file: !144, line: 118, baseType: !163)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap", file: !144, line: 118, flags: DIFlagFwdDecl)
!164 = distinct !DIGlobalVariable(name: "dumper", scope: !0, file: !76, line: 105, type: !165, isLocal: false, isDefinition: true, variable: %struct.pcap_dumper** @dumper)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_dumper_t", file: !144, line: 119, baseType: !167)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_dumper", file: !144, line: 119, flags: DIFlagFwdDecl)
!168 = distinct !DIGlobalVariable(name: "statistic", scope: !0, file: !76, line: 106, type: !169, isLocal: false, isDefinition: true, variable: %struct.pcap_stat* @statistic)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_stat", file: !144, line: 208, size: 96, align: 32, elements: !170)
!170 = !{!171, !172, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ps_recv", scope: !169, file: !144, line: 209, baseType: !157, size: 32, align: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ps_drop", scope: !169, file: !144, line: 210, baseType: !157, size: 32, align: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ps_ifdrop", scope: !169, file: !144, line: 211, baseType: !157, size: 32, align: 32, offset: 64)
!174 = distinct !DIGlobalVariable(name: "maskp", scope: !0, file: !76, line: 107, type: !155, isLocal: false, isDefinition: true, variable: i32* @maskp)
!175 = distinct !DIGlobalVariable(name: "netp", scope: !0, file: !76, line: 108, type: !155, isLocal: false, isDefinition: true, variable: i32* @netp)
!176 = distinct !DIGlobalVariable(name: "datalink", scope: !0, file: !76, line: 109, type: !84, isLocal: false, isDefinition: true, variable: i32* @datalink)
!177 = distinct !DIGlobalVariable(name: "fp", scope: !0, file: !76, line: 110, type: !178, isLocal: false, isDefinition: true, variable: %struct.bpf_program* @fp)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_program", file: !156, line: 104, size: 128, align: 64, elements: !179)
!179 = !{!180, !181}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "bf_len", scope: !178, file: !156, line: 105, baseType: !157, size: 32, align: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "bf_insns", scope: !178, file: !156, line: 106, baseType: !182, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_insn", file: !156, line: 234, size: 64, align: 32, elements: !184)
!184 = !{!185, !188, !189, !190}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !183, file: !156, line: 235, baseType: !186, size: 16, align: 16)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !68, line: 34, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !109, line: 31, baseType: !16)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "jt", scope: !183, file: !156, line: 236, baseType: !139, size: 8, align: 8, offset: 16)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "jf", scope: !183, file: !156, line: 237, baseType: !139, size: 8, align: 8, offset: 24)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !183, file: !156, line: 238, baseType: !155, size: 32, align: 32, offset: 32)
!191 = distinct !DIGlobalVariable(name: "logname", scope: !0, file: !76, line: 111, type: !72, isLocal: false, isDefinition: true, variable: i8** @logname)
!192 = distinct !DIGlobalVariable(name: "tcpdl", scope: !0, file: !76, line: 112, type: !72, isLocal: false, isDefinition: true, variable: i8** @tcpdl)
!193 = distinct !DIGlobalVariable(name: "tr", scope: !0, file: !76, line: 113, type: !186, isLocal: false, isDefinition: true, variable: i16* @tr)
!194 = distinct !DIGlobalVariable(name: "tl", scope: !0, file: !76, line: 113, type: !186, isLocal: false, isDefinition: true, variable: i16* @tl)
!195 = distinct !DIGlobalVariable(name: "graph", scope: !0, file: !76, line: 114, type: !186, isLocal: false, isDefinition: true, variable: i16* @graph)
!196 = distinct !DIGlobalVariable(name: "cont", scope: !0, file: !76, line: 115, type: !186, isLocal: false, isDefinition: true, variable: i16* @cont)
!197 = distinct !DIGlobalVariable(name: "stream_glob", scope: !0, file: !76, line: 117, type: !84, isLocal: false, isDefinition: true, variable: i32* @stream_glob)
!198 = distinct !DIGlobalVariable(name: "bc_glob", scope: !0, file: !76, line: 118, type: !84, isLocal: false, isDefinition: true, variable: i32* @bc_glob)
!199 = distinct !DIGlobalVariable(name: "sniff_glob", scope: !0, file: !76, line: 119, type: !84, isLocal: false, isDefinition: true, variable: i32* @sniff_glob)
!200 = distinct !DIGlobalVariable(name: "rst_glob", scope: !0, file: !76, line: 120, type: !84, isLocal: false, isDefinition: true, variable: i32* @rst_glob)
!201 = distinct !DIGlobalVariable(name: "arp_glob", scope: !0, file: !76, line: 121, type: !84, isLocal: false, isDefinition: true, variable: i32* @arp_glob)
!202 = distinct !DIGlobalVariable(name: "pt", scope: !0, file: !76, line: 122, type: !203, isLocal: false, isDefinition: true, variable: [2 x i64]* @pt)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 128, align: 64, elements: !206)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !205, line: 60, baseType: !128)
!205 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!206 = !{!207}
!207 = !DISubrange(count: 2)
!208 = distinct !DIGlobalVariable(name: "lg", scope: !0, file: !76, line: 123, type: !84, isLocal: false, isDefinition: true, variable: i32* @lg)
!209 = distinct !DIGlobalVariable(name: "tm", scope: !0, file: !76, line: 132, type: !210, isLocal: false, isDefinition: true, variable: i64* @tm)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !211, line: 75, baseType: !151)
!211 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!212 = distinct !DIGlobalVariable(name: "timed", scope: !0, file: !76, line: 133, type: !213, isLocal: false, isDefinition: true, variable: [60 x i8]* @timed)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 480, align: 8, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 60)
!216 = distinct !DIGlobalVariable(name: "demonize", scope: !0, file: !76, line: 136, type: !186, isLocal: false, isDefinition: true, variable: i16* @demonize)
!217 = distinct !DIGlobalVariable(name: "line_s", scope: !0, file: !76, line: 138, type: !84, isLocal: false, isDefinition: true, variable: i32* @line_s)
!218 = distinct !DIGlobalVariable(name: "row_s", scope: !0, file: !76, line: 139, type: !84, isLocal: false, isDefinition: true, variable: i32* @row_s)
!219 = !{i32 2, !"Dwarf Version", i32 4}
!220 = !{i32 2, !"Debug Info Version", i32 3}
!221 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!222 = distinct !DISubprogram(name: "handle_ICMP", scope: !223, file: !223, line: 22, type: !224, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
