; ModuleID = './[inter]data.o.i'
source_filename = "./[inter]data.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.pcap_pkthdr = type { %struct.timeval, i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.pcap = type opaque
%struct.pcap_dumper = type opaque
%struct.pcap_stat = type { i32, i32, i32 }
%struct.bpf_program = type { i32, %struct.bpf_insn* }
%struct.bpf_insn = type { i16, i8, i8, i32 }

@row_s = common global i32 0, align 4
@line_s = common global i32 0, align 4
@.str = private unnamed_addr constant [10 x i8] c" %02x%02x\00", align 1
@graph = common global i16 0, align 2
@.str.1 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"princ\00", align 1
@lg = common global i32 0, align 4
@.str.3 = private unnamed_addr constant [20 x i8] c"0x%04x   %-*s    %s\00", align 1
@.str.4 = private unnamed_addr constant [6 x i8] c" %02x\00", align 1
@stdout = external global %struct._IO_FILE*, align 8
@.str.5 = private unnamed_addr constant [10 x i8] c"NULL DATA\00", align 1
@.str.6 = private unnamed_addr constant [3 x i8] c"%c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !18, globals: !22)
!1 = !DIFile(filename: "[inter]data.o.i", directory: "/home/lichi/Desktop/nast/[task]nast")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "_ISupper", value: 256)
!7 = !DIEnumerator(name: "_ISlower", value: 512)
!8 = !DIEnumerator(name: "_ISalpha", value: 1024)
!9 = !DIEnumerator(name: "_ISdigit", value: 2048)
!10 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!11 = !DIEnumerator(name: "_ISspace", value: 8192)
!12 = !DIEnumerator(name: "_ISprint", value: 16384)
!13 = !DIEnumerator(name: "_ISgraph", value: 32768)
!14 = !DIEnumerator(name: "_ISblank", value: 1)
!15 = !DIEnumerator(name: "_IScntrl", value: 2)
!16 = !DIEnumerator(name: "_ISpunct", value: 4)
!17 = !DIEnumerator(name: "_ISalnum", value: 8)
!18 = !{!19, !20, !21}
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!22 = !{!23, !85, !87, !88, !94, !95, !114, !118, !122, !128, !129, !130, !131, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !162, !163, !166, !170, !171, !172}
!23 = distinct !DIGlobalVariable(name: "logd", scope: !0, file: !24, line: 98, type: !25, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @logd)
!24 = !DIFile(filename: "include/nast.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !27, line: 48, baseType: !28)
!27 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !29, line: 241, size: 1728, align: 64, elements: !30)
!29 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!30 = !{!31, !32, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !53, !54, !55, !56, !60, !61, !63, !67, !70, !72, !73, !74, !75, !76, !80, !81}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !28, file: !29, line: 242, baseType: !19, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !28, file: !29, line: 247, baseType: !33, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !28, file: !29, line: 248, baseType: !33, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !28, file: !29, line: 249, baseType: !33, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !28, file: !29, line: 250, baseType: !33, size: 64, align: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !28, file: !29, line: 251, baseType: !33, size: 64, align: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !28, file: !29, line: 252, baseType: !33, size: 64, align: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !28, file: !29, line: 253, baseType: !33, size: 64, align: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !28, file: !29, line: 254, baseType: !33, size: 64, align: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !28, file: !29, line: 256, baseType: !33, size: 64, align: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !28, file: !29, line: 257, baseType: !33, size: 64, align: 64, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !28, file: !29, line: 258, baseType: !33, size: 64, align: 64, offset: 704)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !28, file: !29, line: 260, baseType: !46, size: 64, align: 64, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !29, line: 156, size: 192, align: 64, elements: !48)
!48 = !{!49, !50, !52}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !47, file: !29, line: 157, baseType: !46, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !47, file: !29, line: 158, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !47, file: !29, line: 162, baseType: !19, size: 32, align: 32, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !28, file: !29, line: 262, baseType: !51, size: 64, align: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !28, file: !29, line: 264, baseType: !19, size: 32, align: 32, offset: 896)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !28, file: !29, line: 268, baseType: !19, size: 32, align: 32, offset: 928)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !28, file: !29, line: 270, baseType: !57, size: 64, align: 64, offset: 960)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !58, line: 131, baseType: !59)
!58 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!59 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !28, file: !29, line: 274, baseType: !20, size: 16, align: 16, offset: 1024)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !28, file: !29, line: 275, baseType: !62, size: 8, align: 8, offset: 1040)
!62 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !28, file: !29, line: 276, baseType: !64, size: 8, align: 8, offset: 1048)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8, align: 8, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 1)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !28, file: !29, line: 280, baseType: !68, size: 64, align: 64, offset: 1088)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !29, line: 150, baseType: null)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !28, file: !29, line: 289, baseType: !71, size: 64, align: 64, offset: 1152)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !58, line: 132, baseType: !59)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !28, file: !29, line: 297, baseType: !21, size: 64, align: 64, offset: 1216)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !28, file: !29, line: 298, baseType: !21, size: 64, align: 64, offset: 1280)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !28, file: !29, line: 299, baseType: !21, size: 64, align: 64, offset: 1344)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !28, file: !29, line: 300, baseType: !21, size: 64, align: 64, offset: 1408)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !28, file: !29, line: 302, baseType: !77, size: 64, align: 64, offset: 1472)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !78, line: 216, baseType: !79)
!78 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!79 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !28, file: !29, line: 303, baseType: !19, size: 32, align: 32, offset: 1536)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !28, file: !29, line: 305, baseType: !82, size: 160, align: 8, offset: 1568)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 160, align: 8, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 20)
!85 = distinct !DIGlobalVariable(name: "offset", scope: !0, file: !24, line: 99, type: !86, isLocal: false, isDefinition: true, variable: i16* @offset)
!86 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!87 = distinct !DIGlobalVariable(name: "npkt", scope: !0, file: !24, line: 100, type: !19, isLocal: false, isDefinition: true, variable: i32* @npkt)
!88 = distinct !DIGlobalVariable(name: "packet", scope: !0, file: !24, line: 101, type: !89, isLocal: false, isDefinition: true, variable: i8** @packet)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !91, line: 33, baseType: !92)
!91 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !58, line: 30, baseType: !93)
!93 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!94 = distinct !DIGlobalVariable(name: "buf", scope: !0, file: !24, line: 102, type: !89, isLocal: false, isDefinition: true, variable: i8** @buf)
!95 = distinct !DIGlobalVariable(name: "hdr", scope: !0, file: !24, line: 103, type: !96, isLocal: false, isDefinition: true, variable: %struct.pcap_pkthdr* @hdr)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_pkthdr", file: !97, line: 199, size: 192, align: 64, elements: !98)
!97 = !DIFile(filename: "/usr/local/include/pcap/pcap.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!98 = !{!99, !107, !113}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !96, file: !97, line: 200, baseType: !100, size: 128, align: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !101, line: 30, size: 128, align: 64, elements: !102)
!101 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!102 = !{!103, !105}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !100, file: !101, line: 32, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !58, line: 139, baseType: !59)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !100, file: !101, line: 33, baseType: !106, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !58, line: 141, baseType: !59)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "caplen", scope: !96, file: !97, line: 201, baseType: !108, size: 32, align: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "bpf_u_int32", file: !109, line: 85, baseType: !110)
!109 = !DIFile(filename: "/usr/local/include/pcap/bpf.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !91, line: 35, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !58, line: 32, baseType: !112)
!112 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !96, file: !97, line: 202, baseType: !108, size: 32, align: 32, offset: 160)
!114 = distinct !DIGlobalVariable(name: "descr", scope: !0, file: !24, line: 104, type: !115, isLocal: false, isDefinition: true, variable: %struct.pcap** @descr)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_t", file: !97, line: 118, baseType: !117)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap", file: !97, line: 118, flags: DIFlagFwdDecl)
!118 = distinct !DIGlobalVariable(name: "dumper", scope: !0, file: !24, line: 105, type: !119, isLocal: false, isDefinition: true, variable: %struct.pcap_dumper** @dumper)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_dumper_t", file: !97, line: 119, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_dumper", file: !97, line: 119, flags: DIFlagFwdDecl)
!122 = distinct !DIGlobalVariable(name: "statistic", scope: !0, file: !24, line: 106, type: !123, isLocal: false, isDefinition: true, variable: %struct.pcap_stat* @statistic)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_stat", file: !97, line: 208, size: 96, align: 32, elements: !124)
!124 = !{!125, !126, !127}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ps_recv", scope: !123, file: !97, line: 209, baseType: !110, size: 32, align: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ps_drop", scope: !123, file: !97, line: 210, baseType: !110, size: 32, align: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ps_ifdrop", scope: !123, file: !97, line: 211, baseType: !110, size: 32, align: 32, offset: 64)
!128 = distinct !DIGlobalVariable(name: "maskp", scope: !0, file: !24, line: 107, type: !108, isLocal: false, isDefinition: true, variable: i32* @maskp)
!129 = distinct !DIGlobalVariable(name: "netp", scope: !0, file: !24, line: 108, type: !108, isLocal: false, isDefinition: true, variable: i32* @netp)
!130 = distinct !DIGlobalVariable(name: "datalink", scope: !0, file: !24, line: 109, type: !19, isLocal: false, isDefinition: true, variable: i32* @datalink)
!131 = distinct !DIGlobalVariable(name: "fp", scope: !0, file: !24, line: 110, type: !132, isLocal: false, isDefinition: true, variable: %struct.bpf_program* @fp)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_program", file: !109, line: 104, size: 128, align: 64, elements: !133)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "bf_len", scope: !132, file: !109, line: 105, baseType: !110, size: 32, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "bf_insns", scope: !132, file: !109, line: 106, baseType: !136, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_insn", file: !109, line: 234, size: 64, align: 32, elements: !138)
!138 = !{!139, !142, !143, !144}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !137, file: !109, line: 235, baseType: !140, size: 16, align: 16)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !91, line: 34, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !58, line: 31, baseType: !20)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "jt", scope: !137, file: !109, line: 236, baseType: !90, size: 8, align: 8, offset: 16)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "jf", scope: !137, file: !109, line: 237, baseType: !90, size: 8, align: 8, offset: 24)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !137, file: !109, line: 238, baseType: !108, size: 32, align: 32, offset: 32)
!145 = distinct !DIGlobalVariable(name: "logname", scope: !0, file: !24, line: 111, type: !33, isLocal: false, isDefinition: true, variable: i8** @logname)
!146 = distinct !DIGlobalVariable(name: "tcpdl", scope: !0, file: !24, line: 112, type: !33, isLocal: false, isDefinition: true, variable: i8** @tcpdl)
!147 = distinct !DIGlobalVariable(name: "tr", scope: !0, file: !24, line: 113, type: !140, isLocal: false, isDefinition: true, variable: i16* @tr)
!148 = distinct !DIGlobalVariable(name: "tl", scope: !0, file: !24, line: 113, type: !140, isLocal: false, isDefinition: true, variable: i16* @tl)
!149 = distinct !DIGlobalVariable(name: "graph", scope: !0, file: !24, line: 114, type: !140, isLocal: false, isDefinition: true, variable: i16* @graph)
!150 = distinct !DIGlobalVariable(name: "cont", scope: !0, file: !24, line: 115, type: !140, isLocal: false, isDefinition: true, variable: i16* @cont)
!151 = distinct !DIGlobalVariable(name: "stream_glob", scope: !0, file: !24, line: 117, type: !19, isLocal: false, isDefinition: true, variable: i32* @stream_glob)
!152 = distinct !DIGlobalVariable(name: "bc_glob", scope: !0, file: !24, line: 118, type: !19, isLocal: false, isDefinition: true, variable: i32* @bc_glob)
!153 = distinct !DIGlobalVariable(name: "sniff_glob", scope: !0, file: !24, line: 119, type: !19, isLocal: false, isDefinition: true, variable: i32* @sniff_glob)
!154 = distinct !DIGlobalVariable(name: "rst_glob", scope: !0, file: !24, line: 120, type: !19, isLocal: false, isDefinition: true, variable: i32* @rst_glob)
!155 = distinct !DIGlobalVariable(name: "arp_glob", scope: !0, file: !24, line: 121, type: !19, isLocal: false, isDefinition: true, variable: i32* @arp_glob)
!156 = distinct !DIGlobalVariable(name: "pt", scope: !0, file: !24, line: 122, type: !157, isLocal: false, isDefinition: true, variable: [2 x i64]* @pt)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 128, align: 64, elements: !160)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !159, line: 60, baseType: !79)
!159 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!160 = !{!161}
!161 = !DISubrange(count: 2)
!162 = distinct !DIGlobalVariable(name: "lg", scope: !0, file: !24, line: 123, type: !19, isLocal: false, isDefinition: true, variable: i32* @lg)
!163 = distinct !DIGlobalVariable(name: "tm", scope: !0, file: !24, line: 132, type: !164, isLocal: false, isDefinition: true, variable: i64* @tm)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !165, line: 75, baseType: !104)
!165 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/nast/[task]nast")
!166 = distinct !DIGlobalVariable(name: "timed", scope: !0, file: !24, line: 133, type: !167, isLocal: false, isDefinition: true, variable: [60 x i8]* @timed)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 480, align: 8, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 60)
!170 = distinct !DIGlobalVariable(name: "demonize", scope: !0, file: !24, line: 136, type: !140, isLocal: false, isDefinition: true, variable: i16* @demonize)
!171 = distinct !DIGlobalVariable(name: "line_s", scope: !0, file: !24, line: 138, type: !19, isLocal: false, isDefinition: true, variable: i32* @line_s)
!172 = distinct !DIGlobalVariable(name: "row_s", scope: !0, file: !24, line: 139, type: !19, isLocal: false, isDefinition: true, variable: i32* @row_s)
!173 = !{i32 2, !"Dwarf Version", i32 4}
!174 = !{i32 2, !"Debug Info Version", i32 3}
!175 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!176 = distinct !DISubprogram(name: "print_ascii_hex", scope: !177, file: !177, line: 27, type: !178, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !180)
