; ModuleID = '/home/lichi/Desktop/genwqe/[task]lib--__libzADC.o/[inter]lib--wrapper.o.i'
source_filename = "/home/lichi/Desktop/genwqe/[task]lib--__libzADC.o/[inter]lib--wrapper.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.zlib_stats = type { i64, [2 x i64], [256 x i64], [256 x i64], i64, [256 x i64], [256 x i64], i64, i64, i64, i64, i64, i64, i64, i64, [2 x i64], [256 x i64], [256 x i64], i64, i64, [256 x i64], [256 x i64], i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64 }
%union.pthread_mutexattr_t = type { i32 }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.internal_state = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15, globals: !74)
!1 = !DIFile(filename: "/home/lichi/Desktop/genwqe/[task]lib--__libzADC.o/[inter]lib--wrapper.o.i", directory: "/home/lichi/Desktop")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "zlib_impl", file: !4, line: 26, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../include/zaddons.h", directory: "/home/lichi/Desktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "ZLIB_SW_IMPL", value: 0)
!7 = !DIEnumerator(name: "ZLIB_HW_IMPL", value: 1)
!8 = !DIEnumerator(name: "ZLIB_MAX_IMPL", value: 2)
!9 = !DIEnumerator(name: "ZLIB_IMPL_MASK", value: 15)
!10 = !DIEnumerator(name: "ZLIB_FLAG_USE_FLAT_BUFFERS", value: 16)
!11 = !DIEnumerator(name: "ZLIB_FLAG_CACHE_HANDLES", value: 32)
!12 = !DIEnumerator(name: "ZLIB_FLAG_OMIT_LAST_DICT", value: 64)
!13 = !DIEnumerator(name: "ZLIB_FLAG_USE_POLLING", value: 128)
!14 = !DIEnumerator(name: "ZLIB_FLAG_DISABLE_CV_FOR_Z_STREAM_END", value: 256)
!15 = !{!16, !17, !20, !73, !62, !61}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_internal_state", file: !22, line: 104, size: 768, align: 64, elements: !23)
!22 = !DIFile(filename: "wrapper.c", directory: "/home/lichi/Desktop")
!23 = !{!24, !28, !29, !30, !32, !34, !35, !36, !37, !38, !41, !42, !70, !71, !72}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "magic0", scope: !21, file: !22, line: 105, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !26, line: 55, baseType: !27)
!26 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop")
!27 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !21, file: !22, line: 106, baseType: !3, size: 32, align: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !21, file: !22, line: 107, baseType: !16, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "allow_switching", scope: !21, file: !22, line: 108, baseType: !31, size: 8, align: 8, offset: 192)
!31 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !21, file: !22, line: 111, baseType: !33, size: 32, align: 32, offset: 224)
!33 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !21, file: !22, line: 112, baseType: !33, size: 32, align: 32, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "windowBits", scope: !21, file: !22, line: 113, baseType: !33, size: 32, align: 32, offset: 288)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "memLevel", scope: !21, file: !22, line: 114, baseType: !33, size: 32, align: 32, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !21, file: !22, line: 115, baseType: !33, size: 32, align: 32, offset: 352)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !21, file: !22, line: 116, baseType: !39, size: 64, align: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "stream_size", scope: !21, file: !22, line: 117, baseType: !33, size: 32, align: 32, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "gzhead", scope: !21, file: !22, line: 118, baseType: !43, size: 64, align: 64, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_headerp", file: !44, line: 131, baseType: !45)
!44 = !DIFile(filename: "/usr/local/include/zlib.h", directory: "/home/lichi/Desktop")
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_header", file: !44, line: 129, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gz_header_s", file: !44, line: 114, size: 640, align: 64, elements: !48)
!48 = !{!49, !50, !53, !54, !55, !60, !63, !64, !65, !66, !67, !68, !69}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !47, file: !44, line: 115, baseType: !33, size: 32, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !47, file: !44, line: 116, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !52, line: 394, baseType: !27)
!52 = !DIFile(filename: "/usr/local/include/zconf.h", directory: "/home/lichi/Desktop")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "xflags", scope: !47, file: !44, line: 117, baseType: !33, size: 32, align: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !47, file: !44, line: 118, baseType: !33, size: 32, align: 32, offset: 160)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !47, file: !44, line: 119, baseType: !56, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !52, line: 400, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !52, line: 391, baseType: !59)
!59 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "extra_len", scope: !47, file: !44, line: 120, baseType: !61, size: 32, align: 32, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !52, line: 393, baseType: !62)
!62 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "extra_max", scope: !47, file: !44, line: 121, baseType: !61, size: 32, align: 32, offset: 288)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !47, file: !44, line: 122, baseType: !56, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !47, file: !44, line: 123, baseType: !61, size: 32, align: 32, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !47, file: !44, line: 124, baseType: !56, size: 64, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "comm_max", scope: !47, file: !44, line: 125, baseType: !61, size: 32, align: 32, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "hcrc", scope: !47, file: !44, line: 126, baseType: !33, size: 32, align: 32, offset: 544)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !47, file: !44, line: 127, baseType: !33, size: 32, align: 32, offset: 576)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "magic1", scope: !21, file: !22, line: 119, baseType: !25, size: 64, align: 64, offset: 576)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "dictionary", scope: !21, file: !22, line: 121, baseType: !56, size: 64, align: 64, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "dictLength", scope: !21, file: !22, line: 122, baseType: !61, size: 32, align: 32, offset: 704)
!73 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!74 = !{!75, !76, !135, !136, !137, !138, !139, !140, !141, !169, !242}
!75 = distinct !DIGlobalVariable(name: "zlib_trace", scope: !0, file: !22, line: 73, type: !33, isLocal: false, isDefinition: true, variable: i32* @zlib_trace)
!76 = distinct !DIGlobalVariable(name: "zlib_log", scope: !0, file: !22, line: 74, type: !77, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @zlib_log)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !79, line: 48, baseType: !80)
!79 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !81, line: 241, size: 1728, align: 64, elements: !82)
!81 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !103, !104, !105, !106, !110, !112, !114, !118, !121, !123, !124, !125, !126, !127, !130, !131}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !80, file: !81, line: 242, baseType: !33, size: 32, align: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !80, file: !81, line: 247, baseType: !18, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !80, file: !81, line: 248, baseType: !18, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !80, file: !81, line: 249, baseType: !18, size: 64, align: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !80, file: !81, line: 250, baseType: !18, size: 64, align: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !80, file: !81, line: 251, baseType: !18, size: 64, align: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !80, file: !81, line: 252, baseType: !18, size: 64, align: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !80, file: !81, line: 253, baseType: !18, size: 64, align: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !80, file: !81, line: 254, baseType: !18, size: 64, align: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !80, file: !81, line: 256, baseType: !18, size: 64, align: 64, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !80, file: !81, line: 257, baseType: !18, size: 64, align: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !80, file: !81, line: 258, baseType: !18, size: 64, align: 64, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !80, file: !81, line: 260, baseType: !96, size: 64, align: 64, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !81, line: 156, size: 192, align: 64, elements: !98)
!98 = !{!99, !100, !102}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !97, file: !81, line: 157, baseType: !96, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !97, file: !81, line: 158, baseType: !101, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !97, file: !81, line: 162, baseType: !33, size: 32, align: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !80, file: !81, line: 262, baseType: !101, size: 64, align: 64, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !80, file: !81, line: 264, baseType: !33, size: 32, align: 32, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !80, file: !81, line: 268, baseType: !33, size: 32, align: 32, offset: 928)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !80, file: !81, line: 270, baseType: !107, size: 64, align: 64, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !108, line: 131, baseType: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop")
!109 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !80, file: !81, line: 274, baseType: !111, size: 16, align: 16, offset: 1024)
!111 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !80, file: !81, line: 275, baseType: !113, size: 8, align: 8, offset: 1040)
!113 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !80, file: !81, line: 276, baseType: !115, size: 8, align: 8, offset: 1048)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 1)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !80, file: !81, line: 280, baseType: !119, size: 64, align: 64, offset: 1088)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !81, line: 150, baseType: null)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !80, file: !81, line: 289, baseType: !122, size: 64, align: 64, offset: 1152)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !108, line: 132, baseType: !109)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !80, file: !81, line: 297, baseType: !16, size: 64, align: 64, offset: 1216)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !80, file: !81, line: 298, baseType: !16, size: 64, align: 64, offset: 1280)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !80, file: !81, line: 299, baseType: !16, size: 64, align: 64, offset: 1344)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !80, file: !81, line: 300, baseType: !16, size: 64, align: 64, offset: 1408)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !80, file: !81, line: 302, baseType: !128, size: 64, align: 64, offset: 1472)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !129, line: 216, baseType: !27)
!129 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop")
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !80, file: !81, line: 303, baseType: !33, size: 32, align: 32, offset: 1536)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !80, file: !81, line: 305, baseType: !132, size: 160, align: 8, offset: 1568)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 160, align: 8, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 20)
!135 = distinct !DIGlobalVariable(name: "zlib_accelerator", scope: !0, file: !22, line: 75, type: !33, isLocal: false, isDefinition: true, variable: i32* @zlib_accelerator)
!136 = distinct !DIGlobalVariable(name: "zlib_card", scope: !0, file: !22, line: 76, type: !33, isLocal: false, isDefinition: true, variable: i32* @zlib_card)
!137 = distinct !DIGlobalVariable(name: "zlib_inflate_impl", scope: !0, file: !22, line: 78, type: !62, isLocal: false, isDefinition: true, variable: i32* @zlib_inflate_impl)
!138 = distinct !DIGlobalVariable(name: "zlib_deflate_impl", scope: !0, file: !22, line: 79, type: !62, isLocal: false, isDefinition: true, variable: i32* @zlib_deflate_impl)
!139 = distinct !DIGlobalVariable(name: "zlib_inflate_flags", scope: !0, file: !22, line: 80, type: !62, isLocal: false, isDefinition: true, variable: i32* @zlib_inflate_flags)
!140 = distinct !DIGlobalVariable(name: "zlib_deflate_flags", scope: !0, file: !22, line: 81, type: !62, isLocal: false, isDefinition: true, variable: i32* @zlib_deflate_flags)
!141 = distinct !DIGlobalVariable(name: "zlib_stats_mutex", scope: !0, file: !22, line: 84, type: !142, isLocal: false, isDefinition: true, variable: %union.pthread_mutex_t* @zlib_stats_mutex)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !143, line: 128, baseType: !144)
!143 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop")
!144 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !143, line: 90, size: 320, align: 64, elements: !145)
!145 = !{!146, !164, !168}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !144, file: !143, line: 125, baseType: !147, size: 320, align: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !143, line: 92, size: 320, align: 64, elements: !148)
!148 = !{!149, !150, !151, !152, !153, !154, !156, !157}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !147, file: !143, line: 94, baseType: !33, size: 32, align: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !147, file: !143, line: 95, baseType: !62, size: 32, align: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !147, file: !143, line: 96, baseType: !33, size: 32, align: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !147, file: !143, line: 98, baseType: !62, size: 32, align: 32, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !147, file: !143, line: 102, baseType: !33, size: 32, align: 32, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !147, file: !143, line: 104, baseType: !155, size: 16, align: 16, offset: 160)
!155 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !147, file: !143, line: 105, baseType: !155, size: 16, align: 16, offset: 176)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !147, file: !143, line: 106, baseType: !158, size: 128, align: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !143, line: 79, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !143, line: 75, size: 128, align: 64, elements: !160)
!160 = !{!161, !163}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !159, file: !143, line: 77, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !159, file: !143, line: 78, baseType: !162, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !144, file: !143, line: 126, baseType: !165, size: 320, align: 8)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 320, align: 8, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 40)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !144, file: !143, line: 127, baseType: !109, size: 64, align: 64)
!169 = distinct !DIGlobalVariable(name: "zlib_stats", scope: !0, file: !22, line: 85, type: !170, isLocal: false, isDefinition: true, variable: %struct.zlib_stats* @zlib_stats)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zlib_stats", file: !171, line: 111, size: 134720, align: 64, elements: !172)
!171 = !DIFile(filename: "wrapper.h", directory: "/home/lichi/Desktop")
!172 = !{!173, !174, !178, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "deflateInit", scope: !170, file: !171, line: 112, baseType: !27, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "deflate", scope: !170, file: !171, line: 113, baseType: !175, size: 128, align: 64, offset: 64)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 128, align: 64, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 2)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "deflate_avail_in", scope: !170, file: !171, line: 114, baseType: !179, size: 16384, align: 64, offset: 192)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 16384, align: 64, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "deflate_avail_out", scope: !170, file: !171, line: 115, baseType: !179, size: 16384, align: 64, offset: 16576)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "deflateReset", scope: !170, file: !171, line: 116, baseType: !27, size: 64, align: 64, offset: 32960)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "deflate_total_in", scope: !170, file: !171, line: 117, baseType: !179, size: 16384, align: 64, offset: 33024)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "deflate_total_out", scope: !170, file: !171, line: 118, baseType: !179, size: 16384, align: 64, offset: 49408)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "deflateSetDictionary", scope: !170, file: !171, line: 119, baseType: !27, size: 64, align: 64, offset: 65792)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "deflateSetHeader", scope: !170, file: !171, line: 120, baseType: !27, size: 64, align: 64, offset: 65856)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "deflateParams", scope: !170, file: !171, line: 121, baseType: !27, size: 64, align: 64, offset: 65920)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "deflateBound", scope: !170, file: !171, line: 122, baseType: !27, size: 64, align: 64, offset: 65984)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "deflatePrime", scope: !170, file: !171, line: 123, baseType: !27, size: 64, align: 64, offset: 66048)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "deflateCopy", scope: !170, file: !171, line: 124, baseType: !27, size: 64, align: 64, offset: 66112)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "deflateEnd", scope: !170, file: !171, line: 125, baseType: !27, size: 64, align: 64, offset: 66176)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "inflateInit", scope: !170, file: !171, line: 127, baseType: !27, size: 64, align: 64, offset: 66240)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "inflate", scope: !170, file: !171, line: 128, baseType: !175, size: 128, align: 64, offset: 66304)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "inflate_avail_in", scope: !170, file: !171, line: 129, baseType: !179, size: 16384, align: 64, offset: 66432)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "inflate_avail_out", scope: !170, file: !171, line: 130, baseType: !179, size: 16384, align: 64, offset: 82816)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "inflateReset", scope: !170, file: !171, line: 131, baseType: !27, size: 64, align: 64, offset: 99200)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "inflateReset2", scope: !170, file: !171, line: 132, baseType: !27, size: 64, align: 64, offset: 99264)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "inflate_total_in", scope: !170, file: !171, line: 133, baseType: !179, size: 16384, align: 64, offset: 99328)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "inflate_total_out", scope: !170, file: !171, line: 134, baseType: !179, size: 16384, align: 64, offset: 115712)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "inflateSetDictionary", scope: !170, file: !171, line: 135, baseType: !27, size: 64, align: 64, offset: 132096)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "inflateGetDictionary", scope: !170, file: !171, line: 136, baseType: !27, size: 64, align: 64, offset: 132160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "inflateGetHeader", scope: !170, file: !171, line: 137, baseType: !27, size: 64, align: 64, offset: 132224)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "inflateSync", scope: !170, file: !171, line: 138, baseType: !27, size: 64, align: 64, offset: 132288)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "inflatePrime", scope: !170, file: !171, line: 139, baseType: !27, size: 64, align: 64, offset: 132352)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "inflateCopy", scope: !170, file: !171, line: 140, baseType: !27, size: 64, align: 64, offset: 132416)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "inflateEnd", scope: !170, file: !171, line: 141, baseType: !27, size: 64, align: 64, offset: 132480)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "adler32", scope: !170, file: !171, line: 143, baseType: !27, size: 64, align: 64, offset: 132544)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "adler32_combine", scope: !170, file: !171, line: 144, baseType: !27, size: 64, align: 64, offset: 132608)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !170, file: !171, line: 145, baseType: !27, size: 64, align: 64, offset: 132672)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "crc32_combine", scope: !170, file: !171, line: 146, baseType: !27, size: 64, align: 64, offset: 132736)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "gzopen64", scope: !170, file: !171, line: 148, baseType: !27, size: 64, align: 64, offset: 132800)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "gzopen", scope: !170, file: !171, line: 149, baseType: !27, size: 64, align: 64, offset: 132864)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "gzdopen", scope: !170, file: !171, line: 150, baseType: !27, size: 64, align: 64, offset: 132928)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "gzbuffer", scope: !170, file: !171, line: 151, baseType: !27, size: 64, align: 64, offset: 132992)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "gztell64", scope: !170, file: !171, line: 152, baseType: !27, size: 64, align: 64, offset: 133056)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "gztell", scope: !170, file: !171, line: 153, baseType: !27, size: 64, align: 64, offset: 133120)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "gzseek64", scope: !170, file: !171, line: 154, baseType: !27, size: 64, align: 64, offset: 133184)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "gzseek", scope: !170, file: !171, line: 155, baseType: !27, size: 64, align: 64, offset: 133248)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "gzwrite", scope: !170, file: !171, line: 156, baseType: !27, size: 64, align: 64, offset: 133312)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "gzread", scope: !170, file: !171, line: 157, baseType: !27, size: 64, align: 64, offset: 133376)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "gzclose", scope: !170, file: !171, line: 158, baseType: !27, size: 64, align: 64, offset: 133440)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "gzoffset64", scope: !170, file: !171, line: 159, baseType: !27, size: 64, align: 64, offset: 133504)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "gzoffset", scope: !170, file: !171, line: 160, baseType: !27, size: 64, align: 64, offset: 133568)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "gzrewind", scope: !170, file: !171, line: 161, baseType: !27, size: 64, align: 64, offset: 133632)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "gzputs", scope: !170, file: !171, line: 162, baseType: !27, size: 64, align: 64, offset: 133696)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "gzgets", scope: !170, file: !171, line: 163, baseType: !27, size: 64, align: 64, offset: 133760)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "gzputc", scope: !170, file: !171, line: 164, baseType: !27, size: 64, align: 64, offset: 133824)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "gzgetc", scope: !170, file: !171, line: 165, baseType: !27, size: 64, align: 64, offset: 133888)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "gzungetc", scope: !170, file: !171, line: 166, baseType: !27, size: 64, align: 64, offset: 133952)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "gzprintf", scope: !170, file: !171, line: 167, baseType: !27, size: 64, align: 64, offset: 134016)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "gzerror", scope: !170, file: !171, line: 168, baseType: !27, size: 64, align: 64, offset: 134080)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "gzeof", scope: !170, file: !171, line: 169, baseType: !27, size: 64, align: 64, offset: 134144)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "gzflush", scope: !170, file: !171, line: 170, baseType: !27, size: 64, align: 64, offset: 134208)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !170, file: !171, line: 172, baseType: !27, size: 64, align: 64, offset: 134272)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "compress2", scope: !170, file: !171, line: 173, baseType: !27, size: 64, align: 64, offset: 134336)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "compressBound", scope: !170, file: !171, line: 174, baseType: !27, size: 64, align: 64, offset: 134400)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "uncompress", scope: !170, file: !171, line: 175, baseType: !27, size: 64, align: 64, offset: 134464)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "adler32_combine64", scope: !170, file: !171, line: 177, baseType: !27, size: 64, align: 64, offset: 134528)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "crc32_combine64", scope: !170, file: !171, line: 178, baseType: !27, size: 64, align: 64, offset: 134592)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "get_crc_table", scope: !170, file: !171, line: 179, baseType: !27, size: 64, align: 64, offset: 134656)
!242 = distinct !DIGlobalVariable(name: "zlib_inflate_threshold", scope: !0, file: !22, line: 83, type: !62, isLocal: true, isDefinition: true, variable: i32* @zlib_inflate_threshold)
!243 = !{i32 2, !"Dwarf Version", i32 4}
!244 = !{i32 2, !"Debug Info Version", i32 3}
!245 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!246 = distinct !DISubprogram(name: "zlib_set_accelerator", scope: !22, file: !22, line: 139, type: !247, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !249)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !39, !33}
!249 = !{}
!250 = !DILocalVariable(name: "accel", arg: 1, scope: !246, file: !22, line: 139, type: !39)
!251 = !DIExpression()
!252 = !DILocation(line: 139, column: 39, scope: !246)
!253 = !DILocalVariable(name: "card_no", arg: 2, scope: !246, file: !22, line: 139, type: !33)
!254 = !DILocation(line: 139, column: 50, scope: !246)
!255 = !DILocation(line: 141, column: 14, scope: !256)
!256 = distinct !DILexicalBlock(scope: !246, file: !22, line: 141, column: 6)
!257 = !DILocation(line: 141, column: 6, scope: !256)
!258 = !DILocation(line: 141, column: 32, scope: !256)
!259 = !DILocation(line: 141, column: 6, scope: !246)
!260 = !DILocation(line: 142, column: 20, scope: !256)
!261 = !DILocation(line: 142, column: 3, scope: !256)
!262 = !DILocation(line: 144, column: 20, scope: !256)
!263 = !DILocation(line: 146, column: 14, scope: !246)
!264 = !DILocation(line: 146, column: 12, scope: !246)
!265 = !DILocation(line: 147, column: 1, scope: !246)
!266 = distinct !DISubprogram(name: "zlib_set_inflate_impl", scope: !22, file: !22, line: 149, type: !267, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !249)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !3}
!269 = !DILocalVariable(name: "impl", arg: 1, scope: !266, file: !22, line: 149, type: !3)
!270 = !DILocation(line: 149, column: 43, scope: !266)
!271 = !DILocation(line: 151, column: 22, scope: !266)
!272 = !DILocation(line: 151, column: 20, scope: !266)
!273 = !DILocation(line: 152, column: 1, scope: !266)
!274 = distinct !DISubprogram(name: "zlib_set_deflate_impl", scope: !22, file: !22, line: 154, type: !267, isLocal: false, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !249)
!275 = !DILocalVariable(name: "impl", arg: 1, scope: !274, file: !22, line: 154, type: !3)
!276 = !DILocation(line: 154, column: 43, scope: !274)
!277 = !DILocation(line: 156, column: 22, scope: !274)
!278 = !DILocation(line: 156, column: 20, scope: !274)
!279 = !DILocation(line: 157, column: 1, scope: !274)
!280 = distinct !DISubprogram(name: "str_to_num", scope: !22, file: !22, line: 165, type: !281, isLocal: false, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !249)
!281 = !DISubroutineType(types: !282)
!282 = !{!25, !18}
!283 = !DILocalVariable(name: "str", arg: 1, scope: !280, file: !22, line: 165, type: !18)
!284 = !DILocation(line: 165, column: 27, scope: !280)
!285 = !DILocalVariable(name: "s", scope: !280, file: !22, line: 167, type: !18)
!286 = !DILocation(line: 167, column: 8, scope: !280)
!287 = !DILocation(line: 167, column: 12, scope: !280)
!288 = !DILocalVariable(name: "num", scope: !280, file: !22, line: 168, type: !25)
!289 = !DILocation(line: 168, column: 11, scope: !280)
!290 = !DILocation(line: 168, column: 26, scope: !280)
!291 = !DILocation(line: 168, column: 17, scope: !280)
!292 = !DILocation(line: 170, column: 7, scope: !293)
!293 = distinct !DILexicalBlock(scope: !280, file: !22, line: 170, column: 6)
!294 = !DILocation(line: 170, column: 6, scope: !293)
!295 = !DILocation(line: 170, column: 9, scope: !293)
!296 = !DILocation(line: 170, column: 6, scope: !280)
!297 = !DILocation(line: 171, column: 10, scope: !293)
!298 = !DILocation(line: 171, column: 3, scope: !293)
!299 = !DILocation(line: 173, column: 13, scope: !300)
!300 = distinct !DILexicalBlock(scope: !280, file: !22, line: 173, column: 6)
!301 = !DILocation(line: 173, column: 6, scope: !300)
!302 = !DILocation(line: 173, column: 23, scope: !300)
!303 = !DILocation(line: 173, column: 6, scope: !280)
!304 = !DILocation(line: 174, column: 7, scope: !300)
!305 = !DILocation(line: 174, column: 3, scope: !300)
!306 = !DILocation(line: 175, column: 18, scope: !307)
!307 = distinct !DILexicalBlock(scope: !300, file: !22, line: 175, column: 11)
!308 = !DILocation(line: 175, column: 11, scope: !307)
!309 = !DILocation(line: 175, column: 28, scope: !307)
!310 = !DILocation(line: 175, column: 11, scope: !300)
!311 = !DILocation(line: 176, column: 7, scope: !307)
!312 = !DILocation(line: 176, column: 3, scope: !307)
!313 = !DILocation(line: 177, column: 18, scope: !314)
!314 = distinct !DILexicalBlock(scope: !307, file: !22, line: 177, column: 11)
!315 = !DILocation(line: 177, column: 11, scope: !314)
!316 = !DILocation(line: 177, column: 28, scope: !314)
!317 = !DILocation(line: 177, column: 11, scope: !307)
!318 = !DILocation(line: 178, column: 7, scope: !314)
!319 = !DILocation(line: 178, column: 3, scope: !314)
!320 = !DILocation(line: 180, column: 7, scope: !321)
!321 = distinct !DILexicalBlock(scope: !314, file: !22, line: 179, column: 7)
!322 = !DILocation(line: 181, column: 4, scope: !321)
!323 = !DILocation(line: 181, column: 8, scope: !321)
!324 = !DILocation(line: 184, column: 9, scope: !280)
!325 = !DILocation(line: 184, column: 2, scope: !280)
!326 = !DILocation(line: 185, column: 1, scope: !280)
!327 = distinct !DISubprogram(name: "ret_to_str", scope: !22, file: !22, line: 190, type: !328, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !249)
!328 = !DISubroutineType(types: !329)
!329 = !{!39, !33}
!330 = !DILocalVariable(name: "ret", arg: 1, scope: !327, file: !22, line: 190, type: !33)
!331 = !DILocation(line: 190, column: 28, scope: !327)
!332 = !DILocation(line: 192, column: 10, scope: !327)
!333 = !DILocation(line: 192, column: 2, scope: !327)
!334 = !DILocation(line: 193, column: 12, scope: !335)
!335 = distinct !DILexicalBlock(scope: !327, file: !22, line: 192, column: 15)
!336 = !DILocation(line: 194, column: 20, scope: !335)
!337 = !DILocation(line: 195, column: 19, scope: !335)
!338 = !DILocation(line: 196, column: 15, scope: !335)
!339 = !DILocation(line: 197, column: 22, scope: !335)
!340 = !DILocation(line: 198, column: 20, scope: !335)
!341 = !DILocation(line: 199, column: 19, scope: !335)
!342 = !DILocation(line: 200, column: 19, scope: !335)
!343 = !DILocation(line: 201, column: 23, scope: !335)
!344 = !DILocation(line: 202, column: 11, scope: !335)
!345 = !DILocation(line: 204, column: 1, scope: !327)
!346 = distinct !DISubprogram(name: "flush_to_str", scope: !22, file: !22, line: 209, type: !328, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !249)
!347 = !DILocalVariable(name: "flush", arg: 1, scope: !346, file: !22, line: 209, type: !33)
!348 = !DILocation(line: 209, column: 30, scope: !346)
!349 = !DILocation(line: 211, column: 10, scope: !346)
!350 = !DILocation(line: 211, column: 2, scope: !346)
!351 = !DILocation(line: 212, column: 18, scope: !352)
!352 = distinct !DILexicalBlock(scope: !346, file: !22, line: 211, column: 17)
!353 = !DILocation(line: 213, column: 23, scope: !352)
!354 = !DILocation(line: 214, column: 20, scope: !352)
!355 = !DILocation(line: 215, column: 20, scope: !352)
!356 = !DILocation(line: 216, column: 16, scope: !352)
!357 = !DILocation(line: 217, column: 15, scope: !352)
!358 = !DILocation(line: 219, column: 15, scope: !352)
!359 = !DILocation(line: 221, column: 11, scope: !352)
!360 = !DILocation(line: 223, column: 1, scope: !346)
!361 = distinct !DISubprogram(name: "_init", scope: !22, file: !22, line: 231, type: !362, isLocal: true, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !249)
!362 = !DISubroutineType(types: !363)
!363 = !{null}
!364 = !DILocalVariable(name: "rc", scope: !361, file: !22, line: 233, type: !33)
!365 = !DILocation(line: 233, column: 6, scope: !361)
!366 = !DILocalVariable(name: "trace", scope: !361, file: !22, line: 234, type: !39)
!367 = !DILocation(line: 234, column: 14, scope: !361)
!368 = !DILocalVariable(name: "inflate_impl", scope: !361, file: !22, line: 234, type: !39)
!369 = !DILocation(line: 234, column: 22, scope: !361)
!370 = !DILocalVariable(name: "deflate_impl", scope: !361, file: !22, line: 234, type: !39)
!371 = !DILocation(line: 234, column: 37, scope: !361)
!372 = !DILocalVariable(name: "method", scope: !361, file: !22, line: 234, type: !39)
!373 = !DILocation(line: 234, column: 52, scope: !361)
!374 = !DILocalVariable(name: "zlib_logfile", scope: !361, file: !22, line: 235, type: !39)
!375 = !DILocation(line: 235, column: 14, scope: !361)
!376 = !DILocalVariable(name: "inflate_threshold", scope: !361, file: !22, line: 236, type: !18)
!377 = !DILocation(line: 236, column: 8, scope: !361)
!378 = !DILocation(line: 238, column: 17, scope: !361)
!379 = !DILocation(line: 238, column: 15, scope: !361)
!380 = !DILocation(line: 239, column: 6, scope: !381)
!381 = distinct !DILexicalBlock(scope: !361, file: !22, line: 239, column: 6)
!382 = !DILocation(line: 239, column: 19, scope: !381)
!383 = !DILocation(line: 239, column: 6, scope: !361)
!384 = !DILocation(line: 240, column: 20, scope: !385)
!385 = distinct !DILexicalBlock(scope: !381, file: !22, line: 239, column: 27)
!386 = !DILocation(line: 240, column: 14, scope: !385)
!387 = !DILocation(line: 240, column: 12, scope: !385)
!388 = !DILocation(line: 241, column: 7, scope: !389)
!389 = distinct !DILexicalBlock(scope: !385, file: !22, line: 241, column: 7)
!390 = !DILocation(line: 241, column: 16, scope: !389)
!391 = !DILocation(line: 241, column: 7, scope: !385)
!392 = !DILocation(line: 242, column: 14, scope: !389)
!393 = !DILocation(line: 242, column: 13, scope: !389)
!394 = !DILocation(line: 242, column: 4, scope: !389)
!395 = !DILocation(line: 243, column: 2, scope: !385)
!396 = !DILocation(line: 243, column: 19, scope: !397)
!397 = !DILexicalBlockFile(scope: !381, file: !22, discriminator: 1)
!398 = !DILocation(line: 243, column: 18, scope: !397)
!399 = !DILocation(line: 245, column: 10, scope: !361)
!400 = !DILocation(line: 245, column: 8, scope: !361)
!401 = !DILocation(line: 246, column: 6, scope: !402)
!402 = distinct !DILexicalBlock(scope: !361, file: !22, line: 246, column: 6)
!403 = !DILocation(line: 246, column: 12, scope: !402)
!404 = !DILocation(line: 246, column: 6, scope: !361)
!405 = !DILocation(line: 247, column: 23, scope: !402)
!406 = !DILocation(line: 247, column: 16, scope: !402)
!407 = !DILocation(line: 247, column: 14, scope: !402)
!408 = !DILocation(line: 247, column: 3, scope: !402)
!409 = !DILocation(line: 249, column: 17, scope: !361)
!410 = !DILocation(line: 249, column: 15, scope: !361)
!411 = !DILocation(line: 250, column: 6, scope: !412)
!412 = distinct !DILexicalBlock(scope: !361, file: !22, line: 250, column: 6)
!413 = !DILocation(line: 250, column: 19, scope: !412)
!414 = !DILocation(line: 250, column: 6, scope: !361)
!415 = !DILocation(line: 251, column: 30, scope: !416)
!416 = distinct !DILexicalBlock(scope: !412, file: !22, line: 250, column: 27)
!417 = !DILocation(line: 251, column: 23, scope: !416)
!418 = !DILocation(line: 251, column: 21, scope: !416)
!419 = !DILocation(line: 252, column: 24, scope: !416)
!420 = !DILocation(line: 252, column: 42, scope: !416)
!421 = !DILocation(line: 252, column: 22, scope: !416)
!422 = !DILocation(line: 253, column: 21, scope: !416)
!423 = !DILocation(line: 254, column: 7, scope: !424)
!424 = distinct !DILexicalBlock(scope: !416, file: !22, line: 254, column: 7)
!425 = !DILocation(line: 254, column: 25, scope: !424)
!426 = !DILocation(line: 254, column: 7, scope: !416)
!427 = !DILocation(line: 255, column: 22, scope: !424)
!428 = !DILocation(line: 255, column: 4, scope: !424)
!429 = !DILocation(line: 256, column: 2, scope: !416)
!430 = !DILocation(line: 258, column: 17, scope: !361)
!431 = !DILocation(line: 258, column: 15, scope: !361)
!432 = !DILocation(line: 259, column: 6, scope: !433)
!433 = distinct !DILexicalBlock(scope: !361, file: !22, line: 259, column: 6)
!434 = !DILocation(line: 259, column: 19, scope: !433)
!435 = !DILocation(line: 259, column: 6, scope: !361)
!436 = !DILocation(line: 260, column: 30, scope: !437)
!437 = distinct !DILexicalBlock(scope: !433, file: !22, line: 259, column: 27)
!438 = !DILocation(line: 260, column: 23, scope: !437)
!439 = !DILocation(line: 260, column: 21, scope: !437)
!440 = !DILocation(line: 261, column: 24, scope: !437)
!441 = !DILocation(line: 261, column: 42, scope: !437)
!442 = !DILocation(line: 261, column: 22, scope: !437)
!443 = !DILocation(line: 262, column: 21, scope: !437)
!444 = !DILocation(line: 263, column: 7, scope: !445)
!445 = distinct !DILexicalBlock(scope: !437, file: !22, line: 263, column: 7)
!446 = !DILocation(line: 263, column: 25, scope: !445)
!447 = !DILocation(line: 263, column: 7, scope: !437)
!448 = !DILocation(line: 264, column: 22, scope: !445)
!449 = !DILocation(line: 264, column: 4, scope: !445)
!450 = !DILocation(line: 265, column: 2, scope: !437)
!451 = !DILocation(line: 267, column: 22, scope: !361)
!452 = !DILocation(line: 267, column: 20, scope: !361)
!453 = !DILocation(line: 268, column: 6, scope: !454)
!454 = distinct !DILexicalBlock(scope: !361, file: !22, line: 268, column: 6)
!455 = !DILocation(line: 268, column: 24, scope: !454)
!456 = !DILocation(line: 268, column: 6, scope: !361)
!457 = !DILocation(line: 269, column: 39, scope: !454)
!458 = !DILocation(line: 269, column: 28, scope: !454)
!459 = !DILocation(line: 269, column: 26, scope: !454)
!460 = !DILocation(line: 269, column: 3, scope: !454)
!461 = !DILocation(line: 277, column: 11, scope: !361)
!462 = !DILocation(line: 277, column: 9, scope: !361)
!463 = !DILocation(line: 278, column: 7, scope: !464)
!464 = distinct !DILexicalBlock(scope: !361, file: !22, line: 278, column: 6)
!465 = !DILocation(line: 278, column: 14, scope: !464)
!466 = !DILocation(line: 278, column: 22, scope: !464)
!467 = !DILocation(line: 278, column: 33, scope: !468)
!468 = !DILexicalBlockFile(scope: !464, file: !22, discriminator: 1)
!469 = !DILocation(line: 278, column: 26, scope: !468)
!470 = !DILocation(line: 278, column: 53, scope: !468)
!471 = !DILocation(line: 278, column: 6, scope: !468)
!472 = !DILocation(line: 279, column: 21, scope: !473)
!473 = distinct !DILexicalBlock(scope: !464, file: !22, line: 278, column: 60)
!474 = !DILocation(line: 280, column: 21, scope: !473)
!475 = !DILocation(line: 281, column: 2, scope: !473)
!476 = !DILocation(line: 283, column: 2, scope: !361)
!477 = distinct !{!477, !476}
!478 = !DILocation(line: 283, column: 12, scope: !479)
!479 = !DILexicalBlockFile(scope: !480, file: !22, discriminator: 1)
!480 = distinct !DILexicalBlock(scope: !481, file: !22, line: 283, column: 11)
!481 = distinct !DILexicalBlock(scope: !361, file: !22, line: 283, column: 5)
!482 = !DILocation(line: 283, column: 23, scope: !479)
!483 = !DILocation(line: 283, column: 11, scope: !479)
!484 = !DILocation(line: 283, column: 39, scope: !485)
!485 = !DILexicalBlockFile(scope: !480, file: !22, discriminator: 2)
!486 = !DILocation(line: 283, column: 187, scope: !485)
!487 = !DILocation(line: 283, column: 199, scope: !485)
!488 = !DILocation(line: 283, column: 218, scope: !485)
!489 = !DILocation(line: 283, column: 237, scope: !485)
!490 = !DILocation(line: 283, column: 31, scope: !485)
!491 = !DILocation(line: 283, column: 262, scope: !492)
!492 = !DILexicalBlockFile(scope: !481, file: !22, discriminator: 3)
!493 = !DILocation(line: 288, column: 7, scope: !494)
!494 = distinct !DILexicalBlock(scope: !361, file: !22, line: 288, column: 6)
!495 = !DILocation(line: 288, column: 18, scope: !494)
!496 = !DILocation(line: 288, column: 6, scope: !361)
!497 = !DILocation(line: 289, column: 8, scope: !498)
!498 = distinct !DILexicalBlock(scope: !494, file: !22, line: 288, column: 26)
!499 = !DILocation(line: 289, column: 6, scope: !498)
!500 = !DILocation(line: 290, column: 7, scope: !501)
!501 = distinct !DILexicalBlock(scope: !498, file: !22, line: 290, column: 7)
!502 = !DILocation(line: 290, column: 10, scope: !501)
!503 = !DILocation(line: 290, column: 7, scope: !498)
!504 = !DILocation(line: 291, column: 4, scope: !501)
!505 = distinct !{!505, !504}
!506 = !DILocation(line: 291, column: 17, scope: !507)
!507 = !DILexicalBlockFile(scope: !508, file: !22, discriminator: 1)
!508 = distinct !DILexicalBlock(scope: !501, file: !22, line: 291, column: 7)
!509 = !DILocation(line: 291, column: 9, scope: !507)
!510 = !DILocation(line: 291, column: 103, scope: !507)
!511 = !DILocation(line: 291, column: 103, scope: !512)
!512 = !DILexicalBlockFile(scope: !508, file: !22, discriminator: 2)
!513 = !DILocation(line: 292, column: 2, scope: !498)
!514 = !DILocation(line: 295, column: 2, scope: !361)
!515 = !DILocation(line: 296, column: 2, scope: !361)
!516 = !DILocation(line: 297, column: 1, scope: !361)
!517 = distinct !DISubprogram(name: "deflateInit2_", scope: !22, file: !22, line: 525, type: !518, isLocal: false, isDefinition: true, scopeLine: 533, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !249)
!518 = !DISubroutineType(types: !519)
!519 = !{!33, !520, !33, !33, !33, !33, !33, !39, !33}
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_streamp", file: !44, line: 108, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !44, line: 106, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !44, line: 86, size: 896, align: 64, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !535, !541, !546, !547, !548, !549}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !523, file: !44, line: 87, baseType: !56, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !523, file: !44, line: 88, baseType: !61, size: 32, align: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !523, file: !44, line: 89, baseType: !51, size: 64, align: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !523, file: !44, line: 91, baseType: !56, size: 64, align: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !523, file: !44, line: 92, baseType: !61, size: 32, align: 32, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !523, file: !44, line: 93, baseType: !51, size: 64, align: 64, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !523, file: !44, line: 95, baseType: !18, size: 64, align: 64, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !523, file: !44, line: 96, baseType: !533, size: 64, align: 64, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !44, line: 84, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !523, file: !44, line: 98, baseType: !536, size: 64, align: 64, offset: 512)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !44, line: 81, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!540, !540, !61, !61}
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !52, line: 409, baseType: !16)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !523, file: !44, line: 99, baseType: !542, size: 64, align: 64, offset: 576)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !44, line: 82, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !540, !540}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !523, file: !44, line: 100, baseType: !540, size: 64, align: 64, offset: 640)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !523, file: !44, line: 102, baseType: !33, size: 32, align: 32, offset: 704)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !523, file: !44, line: 104, baseType: !51, size: 64, align: 64, offset: 768)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !523, file: !44, line: 105, baseType: !51, size: 64, align: 64, offset: 832)
!550 = !DILocalVariable(name: "strm", arg: 1, scope: !517, file: !22, line: 525, type: !520)
!551 = !DILocation(line: 525, column: 29, scope: !517)
!552 = !DILocalVariable(name: "level", arg: 2, scope: !517, file: !22, line: 526, type: !33)
!553 = !DILocation(line: 526, column: 9, scope: !517)
!554 = !DILocalVariable(name: "method", arg: 3, scope: !517, file: !22, line: 527, type: !33)
!555 = !DILocation(line: 527, column: 9, scope: !517)
!556 = !DILocalVariable(name: "windowBits", arg: 4, scope: !517, file: !22, line: 528, type: !33)
!557 = !DILocation(line: 528, column: 9, scope: !517)
!558 = !DILocalVariable(name: "memLevel", arg: 5, scope: !517, file: !22, line: 529, type: !33)
!559 = !DILocation(line: 529, column: 9, scope: !517)
!560 = !DILocalVariable(name: "strategy", arg: 6, scope: !517, file: !22, line: 530, type: !33)
!561 = !DILocation(line: 530, column: 9, scope: !517)
!562 = !DILocalVariable(name: "version", arg: 7, scope: !517, file: !22, line: 531, type: !39)
!563 = !DILocation(line: 531, column: 17, scope: !517)
!564 = !DILocalVariable(name: "stream_size", arg: 8, scope: !517, file: !22, line: 532, type: !33)
!565 = !DILocation(line: 532, column: 9, scope: !517)
!566 = !DILocalVariable(name: "rc", scope: !517, file: !22, line: 534, type: !33)
!567 = !DILocation(line: 534, column: 6, scope: !517)
!568 = !DILocalVariable(name: "w", scope: !517, file: !22, line: 535, type: !20)
!569 = !DILocation(line: 535, column: 26, scope: !517)
!570 = !DILocation(line: 537, column: 6, scope: !571)
!571 = distinct !DILexicalBlock(scope: !517, file: !22, line: 537, column: 6)
!572 = !DILocation(line: 537, column: 11, scope: !571)
!573 = !DILocation(line: 537, column: 6, scope: !517)
!574 = !DILocation(line: 538, column: 3, scope: !571)
!575 = !DILocation(line: 540, column: 2, scope: !517)
!576 = !DILocation(line: 542, column: 6, scope: !517)
!577 = !DILocation(line: 542, column: 4, scope: !517)
!578 = !DILocation(line: 543, column: 6, scope: !579)
!579 = distinct !DILexicalBlock(scope: !517, file: !22, line: 543, column: 6)
!580 = !DILocation(line: 543, column: 8, scope: !579)
!581 = !DILocation(line: 543, column: 6, scope: !517)
!582 = !DILocation(line: 544, column: 3, scope: !579)
!583 = !DILocation(line: 546, column: 2, scope: !517)
!584 = !DILocation(line: 546, column: 5, scope: !517)
!585 = !DILocation(line: 546, column: 12, scope: !517)
!586 = !DILocation(line: 547, column: 2, scope: !517)
!587 = !DILocation(line: 547, column: 5, scope: !517)
!588 = !DILocation(line: 547, column: 12, scope: !517)
!589 = !DILocation(line: 548, column: 13, scope: !517)
!590 = !DILocation(line: 548, column: 2, scope: !517)
!591 = !DILocation(line: 548, column: 5, scope: !517)
!592 = !DILocation(line: 548, column: 11, scope: !517)
!593 = !DILocation(line: 549, column: 14, scope: !517)
!594 = !DILocation(line: 549, column: 2, scope: !517)
!595 = !DILocation(line: 549, column: 5, scope: !517)
!596 = !DILocation(line: 549, column: 12, scope: !517)
!597 = !DILocation(line: 550, column: 18, scope: !517)
!598 = !DILocation(line: 550, column: 2, scope: !517)
!599 = !DILocation(line: 550, column: 5, scope: !517)
!600 = !DILocation(line: 550, column: 16, scope: !517)
!601 = !DILocation(line: 551, column: 16, scope: !517)
!602 = !DILocation(line: 551, column: 2, scope: !517)
!603 = !DILocation(line: 551, column: 5, scope: !517)
!604 = !DILocation(line: 551, column: 14, scope: !517)
!605 = !DILocation(line: 552, column: 16, scope: !517)
!606 = !DILocation(line: 552, column: 2, scope: !517)
!607 = !DILocation(line: 552, column: 5, scope: !517)
!608 = !DILocation(line: 552, column: 14, scope: !517)
!609 = !DILocation(line: 553, column: 15, scope: !517)
!610 = !DILocation(line: 553, column: 2, scope: !517)
!611 = !DILocation(line: 553, column: 5, scope: !517)
!612 = !DILocation(line: 553, column: 13, scope: !517)
