; ModuleID = './hostinfo.o.i'
source_filename = "./hostinfo.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.DynBuf = type { i8*, i64, i64 }
%struct.CPUIDRegs = type { i32, i32, i32, i32 }
%struct.HostinfoCpuIdInfo = type { i32, i32, i8, i8, i8, i8, i32, i32 }
%struct.CPUIDSummary = type { %struct.CPUID0, %struct.CPUID1, %struct.CPUIDRegs, %struct.CPUID80, %struct.CPUID81, %struct.CPUIDRegs, %struct.CPUIDRegs }
%struct.CPUID0 = type { i32, [16 x i8] }
%struct.CPUID1 = type { i32, i32, i32, i32 }
%struct.CPUID80 = type { i32, i32, i32, i32 }
%struct.CPUID81 = type { i32, i32, i32, i32 }

@HostinfoOSNameCacheValid = global i8 0, align 1
@Hostinfo_GetCpuidStr.basic_args = internal constant [3 x i32] [i32 0, i32 1, i32 10], align 4
@Hostinfo_GetCpuidStr.extended_args = internal constant [3 x i32] [i32 -2147483648, i32 -2147483647, i32 -2147483640], align 4
@.str = private unnamed_addr constant [43 x i8] c"HOSTINFO: No CPUID information available.\0A\00", align 1
@.str.1 = private unnamed_addr constant [13 x i8] c"GenuineIntel\00", align 1
@.str.2 = private unnamed_addr constant [13 x i8] c"AuthenticAMD\00", align 1
@HostinfoCachedOSFullName = common global [512 x i8] zeroinitializer, align 16
@HostinfoCachedOSName = common global [128 x i8] zeroinitializer, align 16
@HostInfoGetCpuidStrSection.format = internal constant [23 x i8] c"%08X:%08X%08X%08X%08X-\00", align 16

!5284 = !DIEnumerator(name: "CPUID_INTERNAL_MASK_SME", value: 1)
!5285 = !DIEnumerator(name: "CPUID_INTERNAL_REG_SME", value: 0)
!5286 = !DIEnumerator(name: "CPUID_INTERNAL_EAXIN_SME", value: -2147483617)
!5287 = !DIEnumerator(name: "CPUID_INTERNAL_ECXIN_SME", value: 0)
!5288 = !DIEnumerator(name: "CPUID_INTERNAL_HWV_SME", value: 0)
!5289 = !DIEnumerator(name: "CPUID_SEV_SHIFT", value: 1)
!5290 = !DIEnumerator(name: "CPUID_SEV_MASK", value: 2)
!5291 = !DIEnumerator(name: "CPUID_INTERNAL_SHIFT_SEV", value: 1)
!5292 = !DIEnumerator(name: "CPUID_INTERNAL_MASK_SEV", value: 2)
!5293 = !DIEnumerator(name: "CPUID_INTERNAL_REG_SEV", value: 0)
!5294 = !DIEnumerator(name: "CPUID_INTERNAL_EAXIN_SEV", value: -2147483617)
!5295 = !DIEnumerator(name: "CPUID_INTERNAL_ECXIN_SEV", value: 0)
!5296 = !DIEnumerator(name: "CPUID_INTERNAL_HWV_SEV", value: 0)
!5297 = !DIEnumerator(name: "CPUID_PAGE_FLUSH_MSR_SHIFT", value: 2)
!5298 = !DIEnumerator(name: "CPUID_PAGE_FLUSH_MSR_MASK", value: 4)
!5299 = !DIEnumerator(name: "CPUID_INTERNAL_SHIFT_PAGE_FLUSH_MSR", value: 2)
!5300 = !DIEnumerator(name: "CPUID_INTERNAL_MASK_PAGE_FLUSH_MSR", value: 4)
!5301 = !DIEnumerator(name: "CPUID_INTERNAL_REG_PAGE_FLUSH_MSR", value: 0)
!5302 = !DIEnumerator(name: "CPUID_INTERNAL_EAXIN_PAGE_FLUSH_MSR", value: -2147483617)
!5303 = !DIEnumerator(name: "CPUID_INTERNAL_ECXIN_PAGE_FLUSH_MSR", value: 0)
!5304 = !DIEnumerator(name: "CPUID_INTERNAL_HWV_PAGE_FLUSH_MSR", value: 0)
!5305 = !DIEnumerator(name: "CPUID_SEV_ES_SHIFT", value: 3)
!5306 = !DIEnumerator(name: "CPUID_SEV_ES_MASK", value: 8)
!5307 = !DIEnumerator(name: "CPUID_INTERNAL_SHIFT_SEV_ES", value: 3)
!5308 = !DIEnumerator(name: "CPUID_INTERNAL_MASK_SEV_ES", value: 8)
!5309 = !DIEnumerator(name: "CPUID_INTERNAL_REG_SEV_ES", value: 0)
!5310 = !DIEnumerator(name: "CPUID_INTERNAL_EAXIN_SEV_ES", value: -2147483617)
!5311 = !DIEnumerator(name: "CPUID_INTERNAL_ECXIN_SEV_ES", value: 0)
!5312 = !DIEnumerator(name: "CPUID_INTERNAL_HWV_SEV_ES", value: 0)
!5313 = !DIEnumerator(name: "CPUID_SME_PAGE_TABLE_BIT_NUM_SHIFT", value: 0)
!5314 = !DIEnumerator(name: "CPUID_SME_PAGE_TABLE_BIT_NUM_MASK", value: 31)
!5315 = !DIEnumerator(name: "CPUID_INTERNAL_SHIFT_SME_PAGE_TABLE_BIT_NUM", value: 0)
!5316 = !DIEnumerator(name: "CPUID_INTERNAL_MASK_SME_PAGE_TABLE_BIT_NUM", value: 31)
!5317 = !DIEnumerator(name: "CPUID_INTERNAL_REG_SME_PAGE_TABLE_BIT_NUM", value: 1)
!5318 = !DIEnumerator(name: "CPUID_INTERNAL_EAXIN_SME_PAGE_TABLE_BIT_NUM", value: -2147483617)
!5319 = !DIEnumerator(name: "CPUID_INTERNAL_ECXIN_SME_PAGE_TABLE_BIT_NUM", value: 0)
!5320 = !DIEnumerator(name: "CPUID_INTERNAL_HWV_SME_PAGE_TABLE_BIT_NUM", value: 0)
!5321 = !DIEnumerator(name: "CPUID_SME_PHYS_ADDR_SPACE_REDUCTION_SHIFT", value: 6)
!5322 = !DIEnumerator(name: "CPUID_SME_PHYS_ADDR_SPACE_REDUCTION_MASK", value: 4032)
!5323 = !DIEnumerator(name: "CPUID_INTERNAL_SHIFT_SME_PHYS_ADDR_SPACE_REDUCTION", value: 6)
!5324 = !DIEnumerator(name: "CPUID_INTERNAL_MASK_SME_PHYS_ADDR_SPACE_REDUCTION", value: 4032)
!5325 = !DIEnumerator(name: "CPUID_INTERNAL_REG_SME_PHYS_ADDR_SPACE_REDUCTION", value: 1)
!5326 = !DIEnumerator(name: "CPUID_INTERNAL_EAXIN_SME_PHYS_ADDR_SPACE_REDUCTION", value: -2147483617)
!5327 = !DIEnumerator(name: "CPUID_INTERNAL_ECXIN_SME_PHYS_ADDR_SPACE_REDUCTION", value: 0)
!5328 = !DIEnumerator(name: "CPUID_INTERNAL_HWV_SME_PHYS_ADDR_SPACE_REDUCTION", value: 0)
!5329 = !DIEnumerator(name: "CPUID_NUM_ENCRYPTED_GUESTS_SHIFT", value: 0)
!5330 = !DIEnumerator(name: "CPUID_NUM_ENCRYPTED_GUESTS_MASK", value: -1)
!5331 = !DIEnumerator(name: "CPUID_INTERNAL_SHIFT_NUM_ENCRYPTED_GUESTS", value: 0)
!5332 = !DIEnumerator(name: "CPUID_INTERNAL_MASK_NUM_ENCRYPTED_GUESTS", value: -1)
!5333 = !DIEnumerator(name: "CPUID_INTERNAL_REG_NUM_ENCRYPTED_GUESTS", value: 2)
!5334 = !DIEnumerator(name: "CPUID_INTERNAL_EAXIN_NUM_ENCRYPTED_GUESTS", value: -2147483617)
!5335 = !DIEnumerator(name: "CPUID_INTERNAL_ECXIN_NUM_ENCRYPTED_GUESTS", value: 0)
!5336 = !DIEnumerator(name: "CPUID_INTERNAL_HWV_NUM_ENCRYPTED_GUESTS", value: 0)
!5337 = !DIEnumerator(name: "CPUID_SEV_MIN_ASID_SHIFT", value: 0)
!5338 = !DIEnumerator(name: "CPUID_SEV_MIN_ASID_MASK", value: -1)
!5339 = !DIEnumerator(name: "CPUID_INTERNAL_SHIFT_SEV_MIN_ASID", value: 0)
!5340 = !DIEnumerator(name: "CPUID_INTERNAL_MASK_SEV_MIN_ASID", value: -1)
!5341 = !DIEnumerator(name: "CPUID_INTERNAL_REG_SEV_MIN_ASID", value: 3)
!5342 = !DIEnumerator(name: "CPUID_INTERNAL_EAXIN_SEV_MIN_ASID", value: -2147483617)
!5343 = !DIEnumerator(name: "CPUID_INTERNAL_ECXIN_SEV_MIN_ASID", value: 0)
!5344 = !DIEnumerator(name: "CPUID_INTERNAL_HWV_SEV_MIN_ASID", value: 0)
!5345 = !{!5346, !5348, !5354, !5349}
!5346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5347, size: 64, align: 64)
!5347 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5349, size: 64, align: 64)
!5349 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !5350, line: 173, baseType: !5351)
!5350 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line597")
!5351 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !5352, line: 51, baseType: !5353)
!5352 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line597")
!5353 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!5354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5355, size: 64, align: 64)
!5355 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPUIDRegs", file: !15, line: 70, baseType: !5356)
!5356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CPUIDRegs", file: !15, line: 68, size: 128, align: 32, elements: !5357)
!5357 = !{!5358, !5359, !5360, !5361}
!5358 = !DIDerivedType(tag: DW_TAG_member, name: "eax", scope: !5356, file: !15, line: 69, baseType: !5349, size: 32, align: 32)
!5359 = !DIDerivedType(tag: DW_TAG_member, name: "ebx", scope: !5356, file: !15, line: 69, baseType: !5349, size: 32, align: 32, offset: 32)
!5360 = !DIDerivedType(tag: DW_TAG_member, name: "ecx", scope: !5356, file: !15, line: 69, baseType: !5349, size: 32, align: 32, offset: 64)
!5361 = !DIDerivedType(tag: DW_TAG_member, name: "edx", scope: !5356, file: !15, line: 69, baseType: !5349, size: 32, align: 32, offset: 96)
!5362 = !{!5363, !5367, !5376, !5377, !5381, !5385}
!5363 = distinct !DIGlobalVariable(name: "HostinfoOSNameCacheValid", scope: !0, file: !5364, line: 50, type: !5365, isLocal: false, isDefinition: true, variable: i8* @HostinfoOSNameCacheValid)
!5364 = !DIFile(filename: "hostinfo.c", directory: "/home/lichi/Desktop/open-vm-tools/line597")
!5365 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !5366)
!5366 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !5350, line: 230, baseType: !5347)
!5367 = distinct !DIGlobalVariable(name: "basic_args", scope: !5368, file: !5364, line: 144, type: !5372, isLocal: true, isDefinition: true, variable: [3 x i32]* @Hostinfo_GetCpuidStr.basic_args)
!5368 = distinct !DISubprogram(name: "Hostinfo_GetCpuidStr", scope: !5364, file: !5364, line: 142, type: !5369, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !5371)
!5369 = !DISubroutineType(types: !5370)
!5370 = !{!5346}
!5371 = !{}
!5372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5373, size: 96, align: 32, elements: !5374)
!5373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5349)
!5374 = !{!5375}
!5375 = !DISubrange(count: 3)
!5376 = distinct !DIGlobalVariable(name: "extended_args", scope: !5368, file: !5364, line: 145, type: !5372, isLocal: true, isDefinition: true, variable: [3 x i32]* @Hostinfo_GetCpuidStr.extended_args)
!5377 = distinct !DIGlobalVariable(name: "HostinfoCachedOSName", scope: !0, file: !5364, line: 51, type: !5378, isLocal: false, isDefinition: true, variable: [128 x i8]* @HostinfoCachedOSName)
!5378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5347, size: 1024, align: 8, elements: !5379)
!5379 = !{!5380}
!5380 = !DISubrange(count: 128)
!5381 = distinct !DIGlobalVariable(name: "HostinfoCachedOSFullName", scope: !0, file: !5364, line: 52, type: !5382, isLocal: false, isDefinition: true, variable: [512 x i8]* @HostinfoCachedOSFullName)
!5382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5347, size: 4096, align: 8, elements: !5383)
!5383 = !{!5384}
!5384 = !DISubrange(count: 512)
!5385 = distinct !DIGlobalVariable(name: "format", scope: !5386, file: !5364, line: 88, type: !5402, isLocal: true, isDefinition: true, variable: [23 x i8]* @HostInfoGetCpuidStrSection.format)
!5386 = distinct !DISubprogram(name: "HostInfoGetCpuidStrSection", scope: !5364, file: !5364, line: 84, type: !5387, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !5371)
!5387 = !DISubroutineType(types: !5388)
!5388 = !{null, !5389, !5390, !5394}
!5389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5373, size: 64, align: 64)
!5390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5391)
!5391 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !5392, line: 216, baseType: !5393)
!5392 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line597")
!5393 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!5394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5395, size: 64, align: 64)
!5395 = !DIDerivedType(tag: DW_TAG_typedef, name: "DynBuf", file: !5396, line: 40, baseType: !5397)
!5396 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dynbuf.h", directory: "/home/lichi/Desktop/open-vm-tools/line597")
!5397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynBuf", file: !5396, line: 36, size: 192, align: 64, elements: !5398)
!5398 = !{!5399, !5400, !5401}
!5399 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !5397, file: !5396, line: 37, baseType: !5346, size: 64, align: 64)
!5400 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !5397, file: !5396, line: 38, baseType: !5391, size: 64, align: 64, offset: 64)
!5401 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !5397, file: !5396, line: 39, baseType: !5391, size: 64, align: 64, offset: 128)
!5402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5403, size: 184, align: 8, elements: !5404)
!5403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5347)
!5404 = !{!5405}
!5405 = !DISubrange(count: 23)
!5406 = !{i32 2, !"Dwarf Version", i32 4}
!5407 = !{i32 2, !"Debug Info Version", i32 3}
!5408 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!5409 = !DILocalVariable(name: "buf", scope: !5368, file: !5364, line: 146, type: !5395)
!5410 = !DIExpression()
!5411 = !DILocation(line: 146, column: 11, scope: !5368)
!5412 = !DILocalVariable(name: "result", scope: !5368, file: !5364, line: 147, type: !5346)
!5413 = !DILocation(line: 147, column: 10, scope: !5368)
!5414 = !DILocation(line: 149, column: 4, scope: !5368)
!5415 = !DILocation(line: 151, column: 4, scope: !5368)
!5416 = !DILocation(line: 152, column: 4, scope: !5368)
!5417 = !DILocation(line: 155, column: 4, scope: !5368)
!5418 = !DILocation(line: 156, column: 20, scope: !5368)
!5419 = !DILocation(line: 156, column: 11, scope: !5368)
!5420 = !DILocation(line: 158, column: 11, scope: !5368)
!5421 = !DILocation(line: 158, column: 32, scope: !5368)
!5422 = !DILocation(line: 158, column: 4, scope: !5368)
!5423 = !DILocation(line: 158, column: 37, scope: !5368)
!5424 = !DILocation(line: 160, column: 11, scope: !5368)
!5425 = !DILocation(line: 160, column: 4, scope: !5368)
!5426 = !DILocalVariable(name: "args", arg: 1, scope: !5386, file: !5364, line: 84, type: !5389)
!5427 = !DILocation(line: 84, column: 41, scope: !5386)
!5428 = !DILocalVariable(name: "args_size", arg: 2, scope: !5386, file: !5364, line: 85, type: !5390)
!5429 = !DILocation(line: 85, column: 41, scope: !5386)
!5430 = !DILocalVariable(name: "buf", arg: 3, scope: !5386, file: !5364, line: 86, type: !5394)
!5431 = !DILocation(line: 86, column: 36, scope: !5386)
!5432 = !DILocalVariable(name: "reg", scope: !5386, file: !5364, line: 89, type: !5355)
!5433 = !DILocation(line: 89, column: 14, scope: !5386)
!5434 = !DILocalVariable(name: "max_arg", scope: !5386, file: !5364, line: 90, type: !5349)
!5435 = !DILocation(line: 90, column: 11, scope: !5386)
!5436 = !DILocalVariable(name: "temp", scope: !5386, file: !5364, line: 91, type: !5437)
!5437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5347, size: 512, align: 8, elements: !5438)
!5438 = !{!5439}
!5439 = !DISubrange(count: 64)
!5440 = !DILocation(line: 91, column: 9, scope: !5386)
!5441 = !DILocalVariable(name: "i", scope: !5386, file: !5364, line: 92, type: !5442)
!5442 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5443 = !DILocation(line: 92, column: 8, scope: !5386)
!5444 = !DILocation(line: 94, column: 16, scope: !5386)
!5445 = !DILocation(line: 94, column: 4, scope: !5386)
!5446 = !DILocation(line: 95, column: 18, scope: !5386)
!5447 = !DILocation(line: 95, column: 12, scope: !5386)
!5448 = !DILocation(line: 96, column: 8, scope: !5449)
!5449 = distinct !DILexicalBlock(scope: !5386, file: !5364, line: 96, column: 8)
!5450 = !DILocation(line: 96, column: 18, scope: !5449)
!5451 = !DILocation(line: 96, column: 16, scope: !5449)
!5452 = !DILocation(line: 96, column: 8, scope: !5386)
!5453 = !DILocation(line: 98, column: 15, scope: !5454)
!5454 = distinct !DILexicalBlock(scope: !5449, file: !5364, line: 96, column: 27)
!5455 = !DILocation(line: 97, column: 7, scope: !5454)
!5456 = !DILocation(line: 99, column: 7, scope: !5454)
!5457 = !DILocation(line: 101, column: 18, scope: !5386)
!5458 = !DILocation(line: 101, column: 23, scope: !5386)
!5459 = !DILocation(line: 102, column: 30, scope: !5386)
!5460 = !DILocation(line: 102, column: 57, scope: !5386)
!5461 = !DILocation(line: 102, column: 70, scope: !5386)
!5462 = !DILocation(line: 103, column: 34, scope: !5386)
!5463 = !DILocation(line: 103, column: 43, scope: !5386)
!5464 = !DILocation(line: 103, column: 52, scope: !5386)
!5465 = !DILocation(line: 102, column: 18, scope: !5386)
!5466 = !DILocation(line: 101, column: 4, scope: !5386)
!5467 = !DILocation(line: 105, column: 11, scope: !5468)
!5468 = distinct !DILexicalBlock(scope: !5386, file: !5364, line: 105, column: 4)
!5469 = !DILocation(line: 105, column: 9, scope: !5468)
!5470 = !DILocation(line: 105, column: 16, scope: !5471)
!5471 = !DILexicalBlockFile(scope: !5472, file: !5364, discriminator: 1)
!5472 = distinct !DILexicalBlock(scope: !5468, file: !5364, line: 105, column: 4)
!5473 = !DILocation(line: 105, column: 20, scope: !5471)
!5474 = !DILocation(line: 105, column: 18, scope: !5471)
!5475 = !DILocation(line: 105, column: 30, scope: !5471)
!5476 = !DILocation(line: 105, column: 38, scope: !5477)
!5477 = !DILexicalBlockFile(scope: !5472, file: !5364, discriminator: 2)
!5478 = !DILocation(line: 105, column: 33, scope: !5477)
!5479 = !DILocation(line: 105, column: 44, scope: !5477)
!5480 = !DILocation(line: 105, column: 41, scope: !5477)
!5481 = !DILocation(line: 105, column: 4, scope: !5482)
!5482 = !DILexicalBlockFile(scope: !5468, file: !5364, discriminator: 3)
!5483 = !DILocation(line: 107, column: 24, scope: !5484)
!5484 = distinct !DILexicalBlock(scope: !5472, file: !5364, line: 105, column: 58)
!5485 = !DILocation(line: 107, column: 19, scope: !5484)
!5486 = !DILocation(line: 107, column: 7, scope: !5484)
!5487 = !DILocation(line: 109, column: 21, scope: !5484)
!5488 = !DILocation(line: 109, column: 26, scope: !5484)
!5489 = !DILocation(line: 110, column: 33, scope: !5484)
!5490 = !DILocation(line: 110, column: 65, scope: !5484)
!5491 = !DILocation(line: 110, column: 60, scope: !5484)
!5492 = !DILocation(line: 110, column: 73, scope: !5484)
!5493 = !DILocation(line: 111, column: 37, scope: !5484)
!5494 = !DILocation(line: 111, column: 46, scope: !5484)
!5495 = !DILocation(line: 111, column: 55, scope: !5484)
!5496 = !DILocation(line: 110, column: 21, scope: !5484)
!5497 = !DILocation(line: 109, column: 7, scope: !5484)
!5498 = !DILocation(line: 112, column: 4, scope: !5484)
!5499 = !DILocation(line: 105, column: 54, scope: !5500)
!5500 = !DILexicalBlockFile(scope: !5472, file: !5364, discriminator: 4)
!5501 = !DILocation(line: 105, column: 4, scope: !5500)
!5502 = distinct !{!5502, !5503}
!5503 = !DILocation(line: 105, column: 4, scope: !5386)
!5504 = !DILocation(line: 113, column: 1, scope: !5386)
!5505 = distinct !DISubprogram(name: "DynBuf_Get", scope: !5396, file: !5396, line: 113, type: !5506, isLocal: true, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !5371)
!5506 = !DISubroutineType(types: !5507)
!5507 = !{!5508, !5509}
!5508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5510, size: 64, align: 64)
!5510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5395)
!5511 = !DILocalVariable(name: "b", arg: 1, scope: !5505, file: !5396, line: 113, type: !5509)
!5512 = !DILocation(line: 113, column: 26, scope: !5505)
!5513 = !DILocation(line: 117, column: 11, scope: !5505)
!5514 = !DILocation(line: 117, column: 14, scope: !5505)
!5515 = !DILocation(line: 117, column: 4, scope: !5505)
!5516 = distinct !DISubprogram(name: "DynBuf_GetSize", scope: !5396, file: !5396, line: 174, type: !5517, isLocal: true, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !5371)
!5517 = !DISubroutineType(types: !5518)
!5518 = !{!5391, !5509}
!5519 = !DILocalVariable(name: "b", arg: 1, scope: !5516, file: !5396, line: 174, type: !5509)
!5520 = !DILocation(line: 174, column: 30, scope: !5516)
!5521 = !DILocation(line: 178, column: 11, scope: !5516)
!5522 = !DILocation(line: 178, column: 14, scope: !5516)
!5523 = !DILocation(line: 178, column: 4, scope: !5516)
!5524 = distinct !DISubprogram(name: "Hostinfo_GetCpuid", scope: !5364, file: !5364, line: 185, type: !5525, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !5371)
!5525 = !DISubroutineType(types: !5526)
!5526 = !{!5366, !5527}
!5527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5528, size: 64, align: 64)
!5528 = !DIDerivedType(tag: DW_TAG_typedef, name: "HostinfoCpuIdInfo", file: !5529, line: 176, baseType: !5530)
!5529 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hostinfo.h", directory: "/home/lichi/Desktop/open-vm-tools/line597")
!5530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !5529, line: 165, size: 160, align: 32, elements: !5531)
!5531 = !{!5532, !5534, !5535, !5539, !5540, !5541, !5542, !5543}
!5532 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !5530, file: !5529, line: 166, baseType: !5533, size: 32, align: 32)
!5533 = !DIDerivedType(tag: DW_TAG_typedef, name: "CpuidVendor", file: !4, line: 49, baseType: !3)
!5534 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !5530, file: !5529, line: 168, baseType: !5349, size: 32, align: 32, offset: 32)
!5535 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !5530, file: !5529, line: 169, baseType: !5536, size: 8, align: 8, offset: 64)
!5536 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !5350, line: 177, baseType: !5537)
!5537 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !5352, line: 48, baseType: !5538)
!5538 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!5539 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !5530, file: !5529, line: 170, baseType: !5536, size: 8, align: 8, offset: 72)
!5540 = !DIDerivedType(tag: DW_TAG_member, name: "stepping", scope: !5530, file: !5529, line: 171, baseType: !5536, size: 8, align: 8, offset: 80)
!5541 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !5530, file: !5529, line: 172, baseType: !5536, size: 8, align: 8, offset: 88)
!5542 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !5530, file: !5529, line: 174, baseType: !5349, size: 32, align: 32, offset: 96)
!5543 = !DIDerivedType(tag: DW_TAG_member, name: "extfeatures", scope: !5530, file: !5529, line: 175, baseType: !5349, size: 32, align: 32, offset: 128)
!5544 = !DILocalVariable(name: "info", arg: 1, scope: !5524, file: !5364, line: 185, type: !5527)
!5545 = !DILocation(line: 185, column: 38, scope: !5524)
!5546 = !DILocalVariable(name: "cpuid", scope: !5524, file: !5364, line: 188, type: !5547)
!5547 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPUIDSummary", file: !5548, line: 70, baseType: !5549)
!5548 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/cpuid_info.h", directory: "/home/lichi/Desktop/open-vm-tools/line597")
!5549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CPUIDSummary", file: !5548, line: 63, size: 928, align: 32, elements: !5550)
!5550 = !{!5551, !5560, !5568, !5569, !5577, !5585, !5586}
!5551 = !DIDerivedType(tag: DW_TAG_member, name: "id0", scope: !5549, file: !5548, line: 64, baseType: !5552, size: 160, align: 32)
!5552 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPUID0", file: !5548, line: 40, baseType: !5553)
!5553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CPUID0", file: !5548, line: 37, size: 160, align: 32, elements: !5554)
!5554 = !{!5555, !5556}
!5555 = !DIDerivedType(tag: DW_TAG_member, name: "numEntries", scope: !5553, file: !5548, line: 38, baseType: !5442, size: 32, align: 32)
!5556 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !5553, file: !5548, line: 39, baseType: !5557, size: 128, align: 8, offset: 32)
!5557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5347, size: 128, align: 8, elements: !5558)
!5558 = !{!5559}
!5559 = !DISubrange(count: 16)
!5560 = !DIDerivedType(tag: DW_TAG_member, name: "id1", scope: !5549, file: !5548, line: 65, baseType: !5561, size: 128, align: 32, offset: 160)
!5561 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPUID1", file: !5548, line: 47, baseType: !5562)
!5562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CPUID1", file: !5548, line: 42, size: 128, align: 32, elements: !5563)
!5563 = !{!5564, !5565, !5566, !5567}
!5564 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !5562, file: !5548, line: 43, baseType: !5349, size: 32, align: 32)
!5565 = !DIDerivedType(tag: DW_TAG_member, name: "ebx", scope: !5562, file: !5548, line: 44, baseType: !5349, size: 32, align: 32, offset: 32)
!5566 = !DIDerivedType(tag: DW_TAG_member, name: "ecxFeatures", scope: !5562, file: !5548, line: 45, baseType: !5349, size: 32, align: 32, offset: 64)
!5567 = !DIDerivedType(tag: DW_TAG_member, name: "edxFeatures", scope: !5562, file: !5548, line: 46, baseType: !5349, size: 32, align: 32, offset: 96)
!5568 = !DIDerivedType(tag: DW_TAG_member, name: "ida", scope: !5549, file: !5548, line: 66, baseType: !5355, size: 128, align: 32, offset: 288)
!5569 = !DIDerivedType(tag: DW_TAG_member, name: "id80", scope: !5549, file: !5548, line: 67, baseType: !5570, size: 128, align: 32, offset: 416)
!5570 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPUID80", file: !5548, line: 54, baseType: !5571)
!5571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CPUID80", file: !5548, line: 49, size: 128, align: 32, elements: !5572)
!5572 = !{!5573, !5574, !5575, !5576}
!5573 = !DIDerivedType(tag: DW_TAG_member, name: "numEntries", scope: !5571, file: !5548, line: 50, baseType: !5349, size: 32, align: 32)
!5574 = !DIDerivedType(tag: DW_TAG_member, name: "ebx", scope: !5571, file: !5548, line: 51, baseType: !5349, size: 32, align: 32, offset: 32)
!5575 = !DIDerivedType(tag: DW_TAG_member, name: "ecx", scope: !5571, file: !5548, line: 52, baseType: !5349, size: 32, align: 32, offset: 64)
!5576 = !DIDerivedType(tag: DW_TAG_member, name: "edx", scope: !5571, file: !5548, line: 53, baseType: !5349, size: 32, align: 32, offset: 96)
!5577 = !DIDerivedType(tag: DW_TAG_member, name: "id81", scope: !5549, file: !5548, line: 68, baseType: !5578, size: 128, align: 32, offset: 544)
!5578 = !DIDerivedType(tag: DW_TAG_typedef, name: "CPUID81", file: !5548, line: 61, baseType: !5579)
!5579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CPUID81", file: !5548, line: 56, size: 128, align: 32, elements: !5580)
!5580 = !{!5581, !5582, !5583, !5584}
!5581 = !DIDerivedType(tag: DW_TAG_member, name: "eax", scope: !5579, file: !5548, line: 57, baseType: !5349, size: 32, align: 32)
!5582 = !DIDerivedType(tag: DW_TAG_member, name: "ebx", scope: !5579, file: !5548, line: 58, baseType: !5349, size: 32, align: 32, offset: 32)
!5583 = !DIDerivedType(tag: DW_TAG_member, name: "ecxFeatures", scope: !5579, file: !5548, line: 59, baseType: !5349, size: 32, align: 32, offset: 64)
!5584 = !DIDerivedType(tag: DW_TAG_member, name: "edxFeatures", scope: !5579, file: !5548, line: 60, baseType: !5349, size: 32, align: 32, offset: 96)
!5585 = !DIDerivedType(tag: DW_TAG_member, name: "id88", scope: !5549, file: !5548, line: 69, baseType: !5355, size: 128, align: 32, offset: 672)
!5586 = !DIDerivedType(tag: DW_TAG_member, name: "id8a", scope: !5549, file: !5548, line: 69, baseType: !5355, size: 128, align: 32, offset: 800)
!5587 = !DILocation(line: 188, column: 17, scope: !5524)
!5588 = !DILocalVariable(name: "id0", scope: !5524, file: !5364, line: 189, type: !5355)
!5589 = !DILocation(line: 189, column: 14, scope: !5524)
!5590 = !DILocation(line: 196, column: 4, scope: !5524)
!5591 = !DILocation(line: 202, column: 4, scope: !5524)
!5592 = !DILocation(line: 204, column: 31, scope: !5524)
!5593 = !DILocation(line: 204, column: 10, scope: !5524)
!5594 = !DILocation(line: 204, column: 14, scope: !5524)
!5595 = !DILocation(line: 204, column: 25, scope: !5524)
!5596 = !DILocation(line: 206, column: 14, scope: !5597)
!5597 = distinct !DILexicalBlock(scope: !5524, file: !5364, line: 206, column: 8)
!5598 = !DILocation(line: 206, column: 18, scope: !5597)
!5599 = !DILocation(line: 206, column: 29, scope: !5597)
!5600 = !DILocation(line: 206, column: 8, scope: !5524)
!5601 = !DILocation(line: 207, column: 7, scope: !5602)
!5602 = distinct !DILexicalBlock(scope: !5597, file: !5364, line: 206, column: 35)
!5603 = !DILocation(line: 209, column: 7, scope: !5602)
!5604 = !DILocation(line: 212, column: 41, scope: !5524)
!5605 = !DILocation(line: 212, column: 21, scope: !5524)
!5606 = !DILocation(line: 212, column: 25, scope: !5524)
!5607 = !DILocation(line: 212, column: 15, scope: !5524)
!5608 = !DILocation(line: 212, column: 30, scope: !5524)
!5609 = !DILocation(line: 212, column: 4, scope: !5524)
!5610 = !DILocation(line: 212, column: 35, scope: !5524)
!5611 = !DILocation(line: 213, column: 41, scope: !5524)
!5612 = !DILocation(line: 213, column: 21, scope: !5524)
!5613 = !DILocation(line: 213, column: 25, scope: !5524)
!5614 = !DILocation(line: 213, column: 15, scope: !5524)
!5615 = !DILocation(line: 213, column: 30, scope: !5524)
!5616 = !DILocation(line: 213, column: 4, scope: !5524)
!5617 = !DILocation(line: 213, column: 35, scope: !5524)
!5618 = !DILocation(line: 214, column: 41, scope: !5524)
!5619 = !DILocation(line: 214, column: 21, scope: !5524)
!5620 = !DILocation(line: 214, column: 25, scope: !5524)
!5621 = !DILocation(line: 214, column: 15, scope: !5524)
!5622 = !DILocation(line: 214, column: 30, scope: !5524)
!5623 = !DILocation(line: 214, column: 4, scope: !5524)
!5624 = !DILocation(line: 214, column: 35, scope: !5524)
!5625 = !DILocation(line: 215, column: 21, scope: !5524)
!5626 = !DILocation(line: 215, column: 25, scope: !5524)
!5627 = !DILocation(line: 215, column: 15, scope: !5524)
!5628 = !DILocation(line: 215, column: 30, scope: !5524)
!5629 = !DILocation(line: 215, column: 4, scope: !5524)
!5630 = !DILocation(line: 215, column: 36, scope: !5524)
!5631 = !DILocation(line: 217, column: 38, scope: !5524)
!5632 = !DILocation(line: 217, column: 19, scope: !5524)
!5633 = !DILocation(line: 217, column: 4, scope: !5524)
!5634 = !DILocation(line: 218, column: 40, scope: !5524)
!5635 = !DILocation(line: 218, column: 4, scope: !5524)
!5636 = !DILocation(line: 219, column: 47, scope: !5524)
!5637 = !DILocation(line: 219, column: 28, scope: !5524)
!5638 = !DILocation(line: 219, column: 4, scope: !5524)
!5639 = !DILocation(line: 220, column: 47, scope: !5524)
!5640 = !DILocation(line: 220, column: 28, scope: !5524)
!5641 = !DILocation(line: 220, column: 4, scope: !5524)
!5642 = !DILocation(line: 221, column: 47, scope: !5524)
!5643 = !DILocation(line: 221, column: 4, scope: !5524)
!5644 = !DILocation(line: 227, column: 26, scope: !5645)
!5645 = distinct !DILexicalBlock(scope: !5524, file: !5364, line: 227, column: 8)
!5646 = !DILocation(line: 227, column: 30, scope: !5645)
!5647 = !DILocation(line: 227, column: 20, scope: !5645)
!5648 = !DILocation(line: 227, column: 13, scope: !5645)
!5649 = !DILocation(line: 227, column: 10, scope: !5645)
!5650 = !DILocation(line: 227, column: 8, scope: !5524)
!5651 = !DILocation(line: 228, column: 7, scope: !5652)
!5652 = distinct !DILexicalBlock(scope: !5645, file: !5364, line: 227, column: 53)
