; ModuleID = './vmtoolsd-pluginMgr.o.i'
source_filename = "./vmtoolsd-pluginMgr.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ToolsServiceState = type { i8*, i8*, i64, i32, i32, i32, i8*, i8*, %struct._GPtrArray*, i8*, %struct._GModule*, i8*, %struct.RpcDebugLibData*, %struct.ToolsAppCtx, %struct._GArray*, i32, i32 }
%struct._GPtrArray = type { i8**, i32 }
%struct._GModule = type opaque
%struct.RpcDebugLibData = type { %struct._RpcChannel* (%struct.ToolsAppCtx*, %struct.RpcDebugLibData*)*, i32 (%struct.ToolsAppCtx*, i8*, i8*, %struct.RpcDebugLibData*)*, %struct.RpcDebugPlugin* }
%struct._RpcChannel = type opaque
%struct.RpcDebugPlugin = type { %struct.RpcDebugRecvMapping*, i32 (i8*, i64, i8**, i64*)*, i32 (%struct.RpcDebugMsgMapping*)*, void (%struct.ToolsAppCtx*, %struct.RpcDebugPlugin*)*, %struct.ToolsPluginData* }
%struct.RpcDebugRecvMapping = type { i8*, i32 (i8*, i64, i8**, i64*)*, i8*, i64 }
%struct.RpcDebugMsgMapping = type { i8*, i64, i32 (%struct.RpcInData*, i32)*, i32 }
%struct.RpcInData = type { i8*, i8*, i64, i8*, i64, i32, i8*, i8* }
%struct.ToolsPluginData = type { i8*, %struct._GArray*, i32 (%struct.ToolsAppCtx*, i32, i8*, %struct.ToolsPluginData*)*, i8* }
%struct.ToolsAppCtx = type { i32, i8*, i32, i32, %struct._GMainLoop*, %struct._RpcChannel*, %struct._GKeyFile*, i32, i32, i8**, i8* }
%struct._GMainLoop = type opaque
%struct._GKeyFile = type opaque
%struct._GArray = type { i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !51)
!1 = !DIFile(filename: "vmtoolsd-pluginMgr.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!2 = !{!3, !7, !13, !25, !33, !40, !46}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 232, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/plugin.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!5 = !{!6}
!6 = !DIEnumerator(name: "TOOLS_CORE_API_V1", value: 1)
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 339, size: 32, align: 32, elements: !8)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "TOOLS_APP_GUESTRPC", value: 1)
!10 = !DIEnumerator(name: "TOOLS_APP_SIGNALS", value: 2)
!11 = !DIEnumerator(name: "TOOLS_APP_PROVIDER", value: 3)
!12 = !DIEnumerator(name: "TOOLS_SVC_PROPERTY", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 51, size: 32, align: 32, elements: !15)
!14 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24}
!16 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!17 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!18 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!19 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!20 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!21 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!22 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!23 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!24 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 66, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "/usr/include/glib-2.0/glib/gfileutils.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!27 = !{!28, !29, !30, !31, !32}
!28 = !DIEnumerator(name: "G_FILE_TEST_IS_REGULAR", value: 1)
!29 = !DIEnumerator(name: "G_FILE_TEST_IS_SYMLINK", value: 2)
!30 = !DIEnumerator(name: "G_FILE_TEST_IS_DIR", value: 4)
!31 = !DIEnumerator(name: "G_FILE_TEST_IS_EXECUTABLE", value: 8)
!32 = !DIEnumerator(name: "G_FILE_TEST_EXISTS", value: 16)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 53, size: 32, align: 32, elements: !35)
!34 = !DIFile(filename: "toolsCoreInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!35 = !{!36, !37, !38, !39}
!36 = !DIEnumerator(name: "TOOLS_PROVIDER_IDLE", value: 0)
!37 = !DIEnumerator(name: "TOOLS_PROVIDER_ACTIVE", value: 1)
!38 = !DIEnumerator(name: "TOOLS_PROVIDER_ERROR", value: 2)
!39 = !DIEnumerator(name: "TOOLS_PROVIDER_MAX", value: 3)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 42, size: 32, align: 32, elements: !42)
!41 = !DIFile(filename: "/usr/include/glib-2.0/gmodule.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "G_MODULE_BIND_LAZY", value: 1)
!44 = !DIEnumerator(name: "G_MODULE_BIND_LOCAL", value: 2)
!45 = !DIEnumerator(name: "G_MODULE_BIND_MASK", value: 3)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 155, size: 32, align: 32, elements: !48)
!47 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gsignal.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "G_CONNECT_AFTER", value: 1)
!50 = !DIEnumerator(name: "G_CONNECT_SWAPPED", value: 2)
!51 = !{!52, !53, !161, !167, !168, !169, !177, !182, !183, !109}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppProviderReg", file: !34, line: 66, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppProviderReg", file: !34, line: 63, size: 128, align: 64, elements: !56)
!56 = !{!57, !159}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "prov", scope: !55, file: !34, line: 64, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppProvider", file: !4, line: 434, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppProvider", file: !4, line: 373, size: 448, align: 64, elements: !61)
!61 = !{!62, !68, !70, !74, !129, !151, !155}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !60, file: !4, line: 375, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !66, line: 46, baseType: !67)
!66 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!67 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "regType", scope: !60, file: !4, line: 382, baseType: !69, size: 32, align: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppType", file: !4, line: 360, baseType: !7)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "regSize", scope: !60, file: !4, line: 384, baseType: !71, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !72, line: 216, baseType: !73)
!72 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!73 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !60, file: !4, line: 394, baseType: !75, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !78, !113, !114}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCtx", file: !4, line: 274, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCtx", file: !4, line: 241, size: 576, align: 64, elements: !81)
!81 = !{!82, !84, !85, !89, !90, !95, !100, !105, !106, !107, !111}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !80, file: !4, line: 243, baseType: !83, size: 32, align: 32)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreAPI", file: !4, line: 234, baseType: !3)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !80, file: !4, line: 245, baseType: !63, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "isVMware", scope: !80, file: !4, line: 247, baseType: !86, size: 32, align: 32, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !66, line: 50, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !66, line: 49, baseType: !88)
!88 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "errorCode", scope: !80, file: !4, line: 249, baseType: !88, size: 32, align: 32, offset: 160)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "mainLoop", scope: !80, file: !4, line: 251, baseType: !91, size: 64, align: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !93, line: 56, baseType: !94)
!93 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !93, line: 56, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !80, file: !4, line: 253, baseType: !96, size: 64, align: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !98, line: 48, baseType: !99)
!98 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !98, line: 48, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !80, file: !4, line: 255, baseType: !101, size: 64, align: 64, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !103, line: 48, baseType: !104)
!103 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !103, line: 48, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "blockFD", scope: !80, file: !4, line: 261, baseType: !88, size: 32, align: 32, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "uinputFD", scope: !80, file: !4, line: 263, baseType: !88, size: 32, align: 32, offset: 416)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !80, file: !4, line: 265, baseType: !108, size: 64, align: 64, offset: 448)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "serviceObj", scope: !80, file: !4, line: 273, baseType: !112, size: 64, align: 64, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !66, line: 77, baseType: !52)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !117, line: 42, baseType: !118)
!117 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !117, line: 44, size: 128, align: 64, elements: !119)
!119 = !{!120, !126, !127}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !118, file: !117, line: 46, baseType: !121, size: 32, align: 32)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !122, line: 36, baseType: !123)
!122 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !124, line: 45, baseType: !125)
!124 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!125 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !118, file: !117, line: 47, baseType: !87, size: 32, align: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !118, file: !117, line: 48, baseType: !128, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "registerApp", scope: !60, file: !4, line: 406, baseType: !130, size: 64, align: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!86, !78, !113, !133, !112}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginData", file: !4, line: 501, size: 256, align: 64, elements: !135)
!135 = !{!136, !137, !146, !150}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !134, file: !4, line: 503, baseType: !109, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !134, file: !4, line: 508, baseType: !138, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !140, line: 37, baseType: !141)
!140 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !140, line: 41, size: 128, align: 64, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !141, file: !140, line: 43, baseType: !128, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !141, file: !140, line: 44, baseType: !145, size: 32, align: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !66, line: 55, baseType: !125)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "errorCb", scope: !134, file: !4, line: 539, baseType: !147, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!86, !78, !69, !112, !133}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !134, file: !4, line: 544, baseType: !112, size: 64, align: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !60, file: !4, line: 420, baseType: !152, size: 64, align: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !78, !113}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "dumpState", scope: !60, file: !4, line: 433, baseType: !156, size: 64, align: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !78, !113, !112}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !55, file: !34, line: 65, baseType: !160, size: 32, align: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppProviderState", file: !34, line: 60, baseType: !33)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppReg", file: !4, line: 450, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppReg", file: !4, line: 447, size: 128, align: 64, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !163, file: !4, line: 448, baseType: !69, size: 32, align: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !163, file: !4, line: 449, baseType: !138, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeClass", file: !171, line: 389, baseType: !172)
!171 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gtype.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeClass", file: !171, line: 406, size: 64, align: 64, elements: !173)
!173 = !{!174}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "g_type", scope: !172, file: !171, line: 409, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "GType", file: !171, line: 382, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !124, line: 66, baseType: !73)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeInstance", file: !171, line: 391, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeInstance", file: !171, line: 416, size: 64, align: 64, elements: !180)
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "g_class", scope: !179, file: !171, line: 419, baseType: !169, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "GConnectFlags", file: !47, line: 159, baseType: !46)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsServiceProperty", file: !4, line: 468, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsServiceProperty", file: !4, line: 466, size: 64, align: 64, elements: !186)
!186 = !{!187}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !185, file: !4, line: 467, baseType: !109, size: 64, align: 64)
!188 = !{i32 2, !"Dwarf Version", i32 4}
!189 = !{i32 2, !"Debug Info Version", i32 3}
!190 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!191 = distinct !DISubprogram(name: "ToolsCore_DumpPluginInfo", scope: !192, file: !192, line: 612, type: !193, isLocal: false, isDefinition: true, scopeLine: 613, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !304)
!192 = !DIFile(filename: "pluginMgr.c", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!193 = !DISubroutineType(types: !194)
!194 = !{null, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsServiceState", file: !34, line: 100, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsServiceState", file: !34, line: 69, size: 1472, align: 64, elements: !198)
!198 = !{!199, !200, !201, !207, !208, !209, !210, !211, !212, !219, !220, !224, !225, !300, !301, !302, !303}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !34, line: 70, baseType: !128, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "configFile", scope: !197, file: !34, line: 71, baseType: !128, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "configMtime", scope: !197, file: !34, line: 72, baseType: !202, size: 64, align: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !203, line: 75, baseType: !204)
!203 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !205, line: 139, baseType: !206)
!205 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!206 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "configCheckTask", scope: !197, file: !34, line: 73, baseType: !145, size: 32, align: 32, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mainService", scope: !197, file: !34, line: 74, baseType: !86, size: 32, align: 32, offset: 224)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "capsRegistered", scope: !197, file: !34, line: 75, baseType: !86, size: 32, align: 32, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "commonPath", scope: !197, file: !34, line: 76, baseType: !128, size: 64, align: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pluginPath", scope: !197, file: !34, line: 77, baseType: !128, size: 64, align: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "plugins", scope: !197, file: !34, line: 78, baseType: !213, size: 64, align: 64, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPtrArray", file: !140, line: 39, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GPtrArray", file: !140, line: 53, size: 128, align: 64, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !215, file: !140, line: 55, baseType: !167, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !215, file: !140, line: 56, baseType: !145, size: 32, align: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pidFile", scope: !197, file: !34, line: 82, baseType: !128, size: 64, align: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "debugLib", scope: !197, file: !34, line: 84, baseType: !221, size: 64, align: 64, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "GModule", file: !41, line: 49, baseType: !223)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GModule", file: !41, line: 49, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "debugPlugin", scope: !197, file: !34, line: 85, baseType: !128, size: 64, align: 64, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "debugData", scope: !197, file: !34, line: 86, baseType: !226, size: 64, align: 64, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugLibData", file: !228, line: 150, baseType: !229)
!228 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/rpcdebug.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcDebugLibData", file: !228, line: 142, size: 192, align: 64, elements: !230)
!230 = !{!231, !236, !240}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "newDebugChannel", scope: !229, file: !228, line: 143, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!96, !78, !235}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !229, file: !228, line: 145, baseType: !237, size: 64, align: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!88, !78, !112, !112, !235}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "debugPlugin", scope: !229, file: !228, line: 149, baseType: !241, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugPlugin", file: !228, line: 126, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcDebugPlugin", file: !228, line: 112, size: 320, align: 64, elements: !244)
!244 = !{!245, !261, !262, !291, !297}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "recvFns", scope: !243, file: !228, line: 114, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugRecvMapping", file: !228, line: 69, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcDebugRecvMapping", file: !228, line: 59, size: 256, align: 64, elements: !249)
!249 = !{!250, !251, !259, !260}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !248, file: !228, line: 60, baseType: !128, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "recvFn", scope: !248, file: !228, line: 61, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugRecvFn", file: !228, line: 53, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!86, !256, !71, !257, !258}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "xdrProc", scope: !248, file: !228, line: 66, baseType: !112, size: 64, align: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "xdrSize", scope: !248, file: !228, line: 68, baseType: !71, size: 64, align: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "dfltRecvFn", scope: !243, file: !228, line: 119, baseType: !252, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "sendFn", scope: !243, file: !228, line: 121, baseType: !263, size: 64, align: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugSendFn", file: !228, line: 102, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!86, !267}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugMsgMapping", file: !228, line: 86, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcDebugMsgMapping", file: !228, line: 81, size: 256, align: 64, elements: !270)
!270 = !{!271, !272, !273, !290}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !269, file: !228, line: 82, baseType: !128, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "messageLen", scope: !269, file: !228, line: 83, baseType: !71, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "validateFn", scope: !269, file: !228, line: 84, baseType: !274, size: 64, align: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugValidateFn", file: !228, line: 77, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!86, !278, !86}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcInData", file: !98, line: 77, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcInData", file: !98, line: 51, size: 512, align: 64, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !280, file: !98, line: 53, baseType: !109, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !280, file: !98, line: 58, baseType: !109, size: 64, align: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "argsSize", scope: !280, file: !98, line: 60, baseType: !71, size: 64, align: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !280, file: !98, line: 65, baseType: !256, size: 64, align: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "resultLen", scope: !280, file: !98, line: 67, baseType: !71, size: 64, align: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "freeResult", scope: !280, file: !98, line: 72, baseType: !86, size: 32, align: 32, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "appCtx", scope: !280, file: !98, line: 74, baseType: !52, size: 64, align: 64, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !280, file: !98, line: 76, baseType: !52, size: 64, align: 64, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "freeMsg", scope: !269, file: !228, line: 85, baseType: !86, size: 32, align: 32, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "shutdownFn", scope: !243, file: !228, line: 123, baseType: !292, size: 64, align: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugShutdownFn", file: !228, line: 105, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !78, !296}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "plugin", scope: !243, file: !228, line: 125, baseType: !298, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginData", file: !4, line: 545, baseType: !134)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !197, file: !34, line: 87, baseType: !79, size: 576, align: 64, offset: 768)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "providers", scope: !197, file: !34, line: 88, baseType: !138, size: 64, align: 64, offset: 1344)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "vsockDev", scope: !197, file: !34, line: 97, baseType: !88, size: 32, align: 32, offset: 1408)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "vsockFamily", scope: !197, file: !34, line: 98, baseType: !88, size: 32, align: 32, offset: 1440)
!304 = !{}
!305 = !DILocalVariable(name: "state", arg: 1, scope: !191, file: !192, line: 612, type: !195)
!306 = !DIExpression()
!307 = !DILocation(line: 612, column: 45, scope: !191)
!308 = !DILocation(line: 614, column: 8, scope: !309)
!309 = distinct !DILexicalBlock(scope: !191, file: !192, line: 614, column: 8)
!310 = !DILocation(line: 614, column: 15, scope: !309)
!311 = !DILocation(line: 614, column: 23, scope: !309)
!312 = !DILocation(line: 614, column: 8, scope: !191)
!313 = !DILocation(line: 615, column: 7, scope: !314)
!314 = distinct !DILexicalBlock(scope: !309, file: !192, line: 614, column: 31)
!315 = !DILocation(line: 616, column: 4, scope: !314)
!316 = !DILocation(line: 617, column: 30, scope: !317)
!317 = distinct !DILexicalBlock(scope: !309, file: !192, line: 616, column: 11)
!318 = !DILocation(line: 617, column: 7, scope: !317)
!319 = !DILocation(line: 619, column: 1, scope: !191)
!320 = distinct !DISubprogram(name: "ToolsCoreForEachPlugin", scope: !192, file: !192, line: 319, type: !321, isLocal: true, isDefinition: true, scopeLine: 322, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !304)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !195, !323, !327}
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "PluginDataCallback", file: !192, line: 50, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !195, !298}
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PluginAppRegCallback", file: !192, line: 53, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!86, !195, !298, !69, !53, !112}
!331 = !DILocalVariable(name: "state", arg: 1, scope: !320, file: !192, line: 319, type: !195)
!332 = !DILocation(line: 319, column: 43, scope: !320)
!333 = !DILocalVariable(name: "pluginCb", arg: 2, scope: !320, file: !192, line: 320, type: !323)
!334 = !DILocation(line: 320, column: 43, scope: !320)
!335 = !DILocalVariable(name: "appRegCb", arg: 3, scope: !320, file: !192, line: 321, type: !327)
!336 = !DILocation(line: 321, column: 45, scope: !320)
!337 = !DILocalVariable(name: "i", scope: !320, file: !192, line: 323, type: !145)
!338 = !DILocation(line: 323, column: 10, scope: !320)
!339 = !DILocation(line: 327, column: 11, scope: !340)
!340 = distinct !DILexicalBlock(scope: !320, file: !192, line: 327, column: 4)
!341 = !DILocation(line: 327, column: 9, scope: !340)
!342 = !DILocation(line: 327, column: 16, scope: !343)
!343 = !DILexicalBlockFile(scope: !344, file: !192, discriminator: 1)
!344 = distinct !DILexicalBlock(scope: !340, file: !192, line: 327, column: 4)
!345 = !DILocation(line: 327, column: 20, scope: !343)
!346 = !DILocation(line: 327, column: 27, scope: !343)
!347 = !DILocation(line: 327, column: 36, scope: !343)
!348 = !DILocation(line: 327, column: 18, scope: !343)
!349 = !DILocation(line: 327, column: 4, scope: !343)
!350 = !DILocalVariable(name: "plugin", scope: !351, file: !192, line: 328, type: !352)
!351 = distinct !DILexicalBlock(scope: !344, file: !192, line: 327, column: 46)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPlugin", file: !192, line: 43, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPlugin", file: !192, line: 38, size: 256, align: 64, elements: !355)
!355 = !{!356, !357, !358, !363}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fileName", scope: !354, file: !192, line: 39, baseType: !128, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !354, file: !192, line: 40, baseType: !221, size: 64, align: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "onload", scope: !354, file: !192, line: 41, baseType: !359, size: 64, align: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginOnLoad", file: !4, line: 571, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!298, !78}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !354, file: !192, line: 42, baseType: !298, size: 64, align: 64, offset: 192)
!364 = !DILocation(line: 328, column: 20, scope: !351)
!365 = !DILocation(line: 328, column: 55, scope: !351)
!366 = !DILocation(line: 328, column: 29, scope: !351)
!367 = !DILocation(line: 328, column: 31, scope: !351)
!368 = !DILocation(line: 328, column: 38, scope: !351)
!369 = !DILocation(line: 328, column: 48, scope: !351)
!370 = !DILocalVariable(name: "regs", scope: !351, file: !192, line: 329, type: !138)
!371 = !DILocation(line: 329, column: 15, scope: !351)
!372 = !DILocation(line: 329, column: 23, scope: !351)
!373 = !DILocation(line: 329, column: 31, scope: !351)
!374 = !DILocation(line: 329, column: 36, scope: !351)
!375 = !DILocation(line: 329, column: 22, scope: !351)
!376 = !DILocation(line: 329, column: 46, scope: !377)
!377 = !DILexicalBlockFile(scope: !351, file: !192, discriminator: 1)
!378 = !DILocation(line: 329, column: 54, scope: !377)
!379 = !DILocation(line: 329, column: 60, scope: !377)
!380 = !DILocation(line: 329, column: 22, scope: !377)
!381 = !DILocation(line: 329, column: 22, scope: !382)
!382 = !DILexicalBlockFile(scope: !351, file: !192, discriminator: 2)
!383 = !DILocation(line: 329, column: 22, scope: !384)
!384 = !DILexicalBlockFile(scope: !351, file: !192, discriminator: 3)
!385 = !DILocation(line: 329, column: 15, scope: !384)
!386 = !DILocalVariable(name: "j", scope: !351, file: !192, line: 330, type: !145)
!387 = !DILocation(line: 330, column: 13, scope: !351)
!388 = !DILocation(line: 332, column: 11, scope: !389)
!389 = distinct !DILexicalBlock(scope: !351, file: !192, line: 332, column: 11)
!390 = !DILocation(line: 332, column: 20, scope: !389)
!391 = !DILocation(line: 332, column: 11, scope: !351)
!392 = !DILocation(line: 333, column: 10, scope: !393)
!393 = distinct !DILexicalBlock(scope: !389, file: !192, line: 332, column: 28)
!394 = !DILocation(line: 333, column: 19, scope: !393)
!395 = !DILocation(line: 333, column: 26, scope: !393)
!396 = !DILocation(line: 333, column: 34, scope: !393)
!397 = !DILocation(line: 334, column: 7, scope: !393)
!398 = !DILocation(line: 336, column: 11, scope: !399)
!399 = distinct !DILexicalBlock(scope: !351, file: !192, line: 336, column: 11)
!400 = !DILocation(line: 336, column: 16, scope: !399)
!401 = !DILocation(line: 336, column: 23, scope: !399)
!402 = !DILocation(line: 336, column: 26, scope: !403)
!403 = !DILexicalBlockFile(scope: !399, file: !192, discriminator: 1)
!404 = !DILocation(line: 336, column: 35, scope: !403)
!405 = !DILocation(line: 336, column: 11, scope: !403)
!406 = !DILocation(line: 337, column: 10, scope: !407)
!407 = distinct !DILexicalBlock(scope: !399, file: !192, line: 336, column: 44)
!408 = !DILocation(line: 340, column: 14, scope: !409)
!409 = distinct !DILexicalBlock(scope: !351, file: !192, line: 340, column: 7)
!410 = !DILocation(line: 340, column: 12, scope: !409)
!411 = !DILocation(line: 340, column: 19, scope: !412)
!412 = !DILexicalBlockFile(scope: !413, file: !192, discriminator: 1)
!413 = distinct !DILexicalBlock(scope: !409, file: !192, line: 340, column: 7)
!414 = !DILocation(line: 340, column: 23, scope: !412)
!415 = !DILocation(line: 340, column: 29, scope: !412)
!416 = !DILocation(line: 340, column: 21, scope: !412)
!417 = !DILocation(line: 340, column: 7, scope: !412)
!418 = !DILocalVariable(name: "k", scope: !419, file: !192, line: 341, type: !145)
!419 = distinct !DILexicalBlock(scope: !413, file: !192, line: 340, column: 39)
!420 = !DILocation(line: 341, column: 16, scope: !419)
!421 = !DILocalVariable(name: "pregIdx", scope: !419, file: !192, line: 342, type: !145)
!422 = !DILocation(line: 342, column: 16, scope: !419)
!423 = !DILocalVariable(name: "reg", scope: !419, file: !192, line: 343, type: !161)
!424 = !DILocation(line: 343, column: 23, scope: !419)
!425 = !DILocation(line: 343, column: 72, scope: !419)
!426 = !DILocation(line: 343, column: 31, scope: !419)
!427 = !DILocation(line: 343, column: 57, scope: !419)
!428 = !DILocation(line: 343, column: 64, scope: !419)
!429 = !DILocation(line: 343, column: 32, scope: !419)
!430 = !DILocalVariable(name: "preg", scope: !419, file: !192, line: 344, type: !53)
!431 = !DILocation(line: 344, column: 31, scope: !419)
!432 = !DILocation(line: 347, column: 17, scope: !433)
!433 = distinct !DILexicalBlock(scope: !419, file: !192, line: 347, column: 10)
!434 = !DILocation(line: 347, column: 15, scope: !433)
!435 = !DILocation(line: 347, column: 22, scope: !436)
!436 = !DILexicalBlockFile(scope: !437, file: !192, discriminator: 1)
!437 = distinct !DILexicalBlock(scope: !433, file: !192, line: 347, column: 10)
!438 = !DILocation(line: 347, column: 26, scope: !436)
!439 = !DILocation(line: 347, column: 33, scope: !436)
!440 = !DILocation(line: 347, column: 44, scope: !436)
!441 = !DILocation(line: 347, column: 24, scope: !436)
!442 = !DILocation(line: 347, column: 10, scope: !436)
!443 = !DILocalVariable(name: "tmp", scope: !444, file: !192, line: 348, type: !53)
!444 = distinct !DILexicalBlock(scope: !437, file: !192, line: 347, column: 54)
!445 = !DILocation(line: 348, column: 34, scope: !444)
!446 = !DILocation(line: 348, column: 103, scope: !444)
!447 = !DILocation(line: 348, column: 42, scope: !444)
!448 = !DILocation(line: 348, column: 76, scope: !444)
!449 = !DILocation(line: 348, column: 83, scope: !444)
!450 = !DILocation(line: 348, column: 95, scope: !444)
!451 = !DILocation(line: 348, column: 43, scope: !444)
!452 = !DILocation(line: 351, column: 17, scope: !453)
!453 = distinct !DILexicalBlock(scope: !444, file: !192, line: 351, column: 17)
!454 = !DILocation(line: 351, column: 22, scope: !453)
!455 = !DILocation(line: 351, column: 28, scope: !453)
!456 = !DILocation(line: 351, column: 39, scope: !453)
!457 = !DILocation(line: 351, column: 44, scope: !453)
!458 = !DILocation(line: 351, column: 36, scope: !453)
!459 = !DILocation(line: 351, column: 17, scope: !444)
!460 = !DILocation(line: 352, column: 23, scope: !461)
!461 = distinct !DILexicalBlock(scope: !453, file: !192, line: 351, column: 50)
!462 = !DILocation(line: 352, column: 21, scope: !461)
!463 = !DILocation(line: 353, column: 26, scope: !461)
!464 = !DILocation(line: 353, column: 24, scope: !461)
!465 = !DILocation(line: 354, column: 16, scope: !461)
!466 = !DILocation(line: 356, column: 10, scope: !444)
!467 = !DILocation(line: 347, column: 50, scope: !468)
!468 = !DILexicalBlockFile(scope: !437, file: !192, discriminator: 2)
!469 = !DILocation(line: 347, column: 10, scope: !468)
!470 = distinct !{!470, !471}
!471 = !DILocation(line: 347, column: 10, scope: !419)
!472 = !DILocation(line: 358, column: 14, scope: !473)
!473 = distinct !DILexicalBlock(scope: !419, file: !192, line: 358, column: 14)
!474 = !DILocation(line: 358, column: 19, scope: !473)
!475 = !DILocation(line: 358, column: 14, scope: !419)
!476 = !DILocation(line: 359, column: 120, scope: !477)
!477 = distinct !DILexicalBlock(scope: !473, file: !192, line: 358, column: 27)
!478 = !DILocation(line: 359, column: 125, scope: !477)
!479 = !DILocation(line: 359, column: 131, scope: !477)
!480 = !DILocation(line: 359, column: 139, scope: !477)
!481 = !DILocation(line: 359, column: 145, scope: !477)
!482 = !DILocation(line: 359, column: 13, scope: !477)
!483 = !DILocation(line: 361, column: 17, scope: !484)
!484 = distinct !DILexicalBlock(scope: !477, file: !192, line: 361, column: 17)
!485 = !DILocation(line: 361, column: 25, scope: !484)
!486 = !DILocation(line: 361, column: 31, scope: !484)
!487 = !DILocation(line: 361, column: 39, scope: !484)
!488 = !DILocation(line: 361, column: 46, scope: !484)
!489 = !DILocation(line: 362, column: 18, scope: !484)
!490 = !DILocation(line: 362, column: 26, scope: !484)
!491 = !DILocation(line: 362, column: 32, scope: !484)
!492 = !DILocation(line: 362, column: 41, scope: !484)
!493 = !DILocation(line: 362, column: 48, scope: !484)
!494 = !DILocation(line: 362, column: 53, scope: !484)
!495 = !DILocation(line: 362, column: 58, scope: !484)
!496 = !DILocation(line: 362, column: 69, scope: !484)
!497 = !DILocation(line: 362, column: 77, scope: !484)
!498 = !DILocation(line: 361, column: 17, scope: !499)
!499 = !DILexicalBlockFile(scope: !477, file: !192, discriminator: 1)
!500 = !DILocation(line: 363, column: 16, scope: !501)
!501 = distinct !DILexicalBlock(scope: !484, file: !192, line: 362, column: 84)
!502 = !DILocation(line: 365, column: 13, scope: !477)
!503 = !DILocation(line: 368, column: 17, scope: !504)
!504 = distinct !DILexicalBlock(scope: !419, file: !192, line: 368, column: 10)
!505 = !DILocation(line: 368, column: 15, scope: !504)
!506 = !DILocation(line: 368, column: 22, scope: !507)
!507 = !DILexicalBlockFile(scope: !508, file: !192, discriminator: 1)
!508 = distinct !DILexicalBlock(scope: !504, file: !192, line: 368, column: 10)
!509 = !DILocation(line: 368, column: 26, scope: !507)
!510 = !DILocation(line: 368, column: 31, scope: !507)
!511 = !DILocation(line: 368, column: 37, scope: !507)
!512 = !DILocation(line: 368, column: 24, scope: !507)
!513 = !DILocation(line: 368, column: 10, scope: !507)
!514 = !DILocalVariable(name: "appdata", scope: !515, file: !192, line: 369, type: !112)
!515 = distinct !DILexicalBlock(scope: !508, file: !192, line: 368, column: 47)
!516 = !DILocation(line: 369, column: 22, scope: !515)
!517 = !DILocation(line: 369, column: 49, scope: !515)
!518 = !DILocation(line: 369, column: 55, scope: !515)
!519 = !DILocation(line: 369, column: 61, scope: !515)
!520 = !DILocation(line: 369, column: 71, scope: !515)
!521 = !DILocation(line: 369, column: 69, scope: !515)
!522 = !DILocation(line: 369, column: 33, scope: !515)
!523 = !DILocation(line: 369, column: 38, scope: !515)
!524 = !DILocation(line: 369, column: 44, scope: !515)
!525 = !DILocation(line: 370, column: 18, scope: !526)
!526 = distinct !DILexicalBlock(scope: !515, file: !192, line: 370, column: 17)
!527 = !DILocation(line: 370, column: 27, scope: !526)
!528 = !DILocation(line: 370, column: 34, scope: !526)
!529 = !DILocation(line: 370, column: 42, scope: !526)
!530 = !DILocation(line: 370, column: 48, scope: !526)
!531 = !DILocation(line: 370, column: 53, scope: !526)
!532 = !DILocation(line: 370, column: 59, scope: !526)
!533 = !DILocation(line: 370, column: 65, scope: !526)
!534 = !DILocation(line: 370, column: 17, scope: !515)
!535 = !DILocation(line: 372, column: 20, scope: !536)
!536 = distinct !DILexicalBlock(scope: !526, file: !192, line: 370, column: 75)
!537 = !DILocation(line: 372, column: 26, scope: !536)
!538 = !DILocation(line: 372, column: 18, scope: !536)
!539 = !DILocation(line: 373, column: 16, scope: !536)
!540 = !DILocation(line: 380, column: 83, scope: !515)
!541 = !DILocation(line: 380, column: 22, scope: !515)
!542 = !DILocation(line: 380, column: 56, scope: !515)
!543 = !DILocation(line: 380, column: 63, scope: !515)
!544 = !DILocation(line: 380, column: 75, scope: !515)
!545 = !DILocation(line: 380, column: 23, scope: !515)
!546 = !DILocation(line: 380, column: 18, scope: !515)
!547 = !DILocation(line: 381, column: 10, scope: !515)
!548 = !DILocation(line: 368, column: 43, scope: !549)
!549 = !DILexicalBlockFile(scope: !508, file: !192, discriminator: 2)
!550 = !DILocation(line: 368, column: 10, scope: !549)
!551 = distinct !{!551, !552}
!552 = !DILocation(line: 368, column: 10, scope: !419)
!553 = !DILocation(line: 382, column: 7, scope: !419)
!554 = !DILocation(line: 340, column: 35, scope: !555)
!555 = !DILexicalBlockFile(scope: !413, file: !192, discriminator: 2)
!556 = !DILocation(line: 340, column: 7, scope: !555)
!557 = distinct !{!557, !558}
!558 = !DILocation(line: 340, column: 7, scope: !351)
!559 = !DILocation(line: 383, column: 4, scope: !351)
!560 = !DILocation(line: 327, column: 42, scope: !561)
!561 = !DILexicalBlockFile(scope: !344, file: !192, discriminator: 2)
!562 = !DILocation(line: 327, column: 4, scope: !561)
!563 = distinct !{!563, !564}
!564 = !DILocation(line: 327, column: 4, scope: !320)
!565 = !DILocation(line: 384, column: 1, scope: !320)
!566 = distinct !DISubprogram(name: "ToolsCoreDumpPluginInfo", scope: !192, file: !192, line: 104, type: !325, isLocal: true, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !304)
!567 = !DILocalVariable(name: "state", arg: 1, scope: !566, file: !192, line: 104, type: !195)
!568 = !DILocation(line: 104, column: 44, scope: !566)
!569 = !DILocalVariable(name: "plugin", arg: 2, scope: !566, file: !192, line: 105, type: !298)
!570 = !DILocation(line: 105, column: 42, scope: !566)
!571 = !DILocation(line: 107, column: 42, scope: !566)
!572 = !DILocation(line: 107, column: 50, scope: !566)
!573 = !DILocation(line: 107, column: 4, scope: !566)
!574 = !DILocation(line: 109, column: 8, scope: !575)
!575 = distinct !DILexicalBlock(scope: !566, file: !192, line: 109, column: 8)
!576 = !DILocation(line: 109, column: 16, scope: !575)
!577 = !DILocation(line: 109, column: 21, scope: !575)
!578 = !DILocation(line: 109, column: 8, scope: !566)
!579 = !DILocation(line: 110, column: 7, scope: !580)
!580 = distinct !DILexicalBlock(scope: !575, file: !192, line: 109, column: 29)
!581 = !DILocation(line: 111, column: 4, scope: !580)
!582 = !DILocation(line: 112, column: 1, scope: !566)
!583 = distinct !DISubprogram(name: "ToolsCoreDumpAppInfo", scope: !192, file: !192, line: 73, type: !329, isLocal: true, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !304)
!584 = !DILocalVariable(name: "state", arg: 1, scope: !583, file: !192, line: 73, type: !195)
!585 = !DILocation(line: 73, column: 41, scope: !583)
!586 = !DILocalVariable(name: "plugin", arg: 2, scope: !583, file: !192, line: 74, type: !298)
!587 = !DILocation(line: 74, column: 39, scope: !583)
!588 = !DILocalVariable(name: "type", arg: 3, scope: !583, file: !192, line: 75, type: !69)
!589 = !DILocation(line: 75, column: 35, scope: !583)
!590 = !DILocalVariable(name: "preg", arg: 4, scope: !583, file: !192, line: 76, type: !53)
!591 = !DILocation(line: 76, column: 43, scope: !583)
!592 = !DILocalVariable(name: "reg", arg: 5, scope: !583, file: !192, line: 77, type: !112)
!593 = !DILocation(line: 77, column: 31, scope: !583)
!594 = !DILocation(line: 79, column: 8, scope: !595)
!595 = distinct !DILexicalBlock(scope: !583, file: !192, line: 79, column: 8)
!596 = !DILocation(line: 79, column: 13, scope: !595)
!597 = !DILocation(line: 79, column: 8, scope: !583)
!598 = !DILocation(line: 80, column: 11, scope: !599)
!599 = distinct !DILexicalBlock(scope: !600, file: !192, line: 80, column: 11)
!600 = distinct !DILexicalBlock(scope: !595, file: !192, line: 79, column: 21)
!601 = !DILocation(line: 80, column: 17, scope: !599)
!602 = !DILocation(line: 80, column: 23, scope: !599)
!603 = !DILocation(line: 80, column: 33, scope: !599)
!604 = !DILocation(line: 80, column: 11, scope: !600)
!605 = !DILocation(line: 81, column: 10, scope: !606)
!606 = distinct !DILexicalBlock(scope: !599, file: !192, line: 80, column: 41)
!607 = !DILocation(line: 81, column: 16, scope: !606)
!608 = !DILocation(line: 81, column: 22, scope: !606)
!609 = !DILocation(line: 81, column: 33, scope: !606)
!610 = !DILocation(line: 81, column: 40, scope: !606)
!611 = !DILocation(line: 81, column: 45, scope: !606)
!612 = !DILocation(line: 81, column: 51, scope: !606)
!613 = !DILocation(line: 81, column: 57, scope: !606)
!614 = !DILocation(line: 82, column: 7, scope: !606)
!615 = !DILocation(line: 85, column: 29, scope: !616)
!616 = distinct !DILexicalBlock(scope: !599, file: !192, line: 82, column: 14)
!617 = !DILocation(line: 83, column: 10, scope: !616)
!618 = !DILocation(line: 87, column: 5, scope: !600)
!619 = !DILocation(line: 90, column: 26, scope: !620)
!620 = distinct !DILexicalBlock(scope: !595, file: !192, line: 87, column: 12)
!621 = !DILocation(line: 88, column: 7, scope: !620)
!622 = !DILocation(line: 92, column: 4, scope: !583)
!623 = distinct !DISubprogram(name: "ToolsCore_LoadPlugins", scope: !192, file: !192, line: 633, type: !624, isLocal: false, isDefinition: true, scopeLine: 634, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !304)
!624 = !DISubroutineType(types: !625)
!625 = !{!86, !195}
!626 = !DILocalVariable(name: "state", arg: 1, scope: !623, file: !192, line: 633, type: !195)
!627 = !DILocation(line: 633, column: 42, scope: !623)
!628 = !DILocalVariable(name: "pluginDirExists", scope: !623, file: !192, line: 635, type: !86)
!629 = !DILocation(line: 635, column: 13, scope: !623)
!630 = !DILocalVariable(name: "ret", scope: !623, file: !192, line: 636, type: !86)
!631 = !DILocation(line: 636, column: 13, scope: !623)
!632 = !DILocalVariable(name: "pluginRoot", scope: !623, file: !192, line: 637, type: !128)
!633 = !DILocation(line: 637, column: 11, scope: !623)
!634 = !DILocalVariable(name: "i", scope: !623, file: !192, line: 638, type: !145)
!635 = !DILocation(line: 638, column: 10, scope: !623)
!636 = !DILocalVariable(name: "plugins", scope: !623, file: !192, line: 639, type: !213)
!637 = !DILocation(line: 639, column: 15, scope: !623)
!638 = !DILocalVariable(name: "subdir", scope: !623, file: !192, line: 644, type: !109)
!639 = !DILocation(line: 644, column: 16, scope: !623)
!640 = !DILocation(line: 648, column: 17, scope: !623)
!641 = !DILocation(line: 648, column: 15, scope: !623)
!642 = !DILocation(line: 674, column: 14, scope: !623)
!643 = !DILocation(line: 674, column: 12, scope: !623)
!644 = !DILocation(line: 680, column: 8, scope: !645)
!645 = distinct !DILexicalBlock(scope: !623, file: !192, line: 680, column: 8)
!646 = !DILocation(line: 680, column: 15, scope: !645)
!647 = !DILocation(line: 680, column: 26, scope: !645)
!648 = !DILocation(line: 680, column: 8, scope: !623)
!649 = !DILocation(line: 682, column: 43, scope: !650)
!650 = distinct !DILexicalBlock(scope: !645, file: !192, line: 680, column: 34)
!651 = !DILocation(line: 683, column: 43, scope: !650)
!652 = !DILocation(line: 681, column: 27, scope: !650)
!653 = !DILocation(line: 681, column: 7, scope: !650)
!654 = !DILocation(line: 681, column: 14, scope: !650)
!655 = !DILocation(line: 681, column: 25, scope: !650)
!656 = !DILocation(line: 686, column: 4, scope: !650)
!657 = !DILocation(line: 686, column: 28, scope: !658)
!658 = !DILexicalBlockFile(scope: !659, file: !192, discriminator: 1)
!659 = distinct !DILexicalBlock(scope: !645, file: !192, line: 686, column: 15)
!660 = !DILocation(line: 686, column: 35, scope: !658)
!661 = !DILocation(line: 686, column: 16, scope: !658)
!662 = !DILocation(line: 686, column: 15, scope: !658)
!663 = !DILocation(line: 687, column: 94, scope: !664)
!664 = distinct !DILexicalBlock(scope: !659, file: !192, line: 686, column: 68)
!665 = !DILocation(line: 687, column: 101, scope: !664)
!666 = !DILocation(line: 687, column: 7, scope: !664)
!667 = !DILocation(line: 688, column: 7, scope: !664)
!668 = !DILocation(line: 691, column: 20, scope: !669)
!669 = distinct !DILexicalBlock(scope: !623, file: !192, line: 691, column: 8)
!670 = !DILocation(line: 691, column: 27, scope: !669)
!671 = !DILocation(line: 691, column: 8, scope: !669)
!672 = !DILocation(line: 691, column: 59, scope: !669)
!673 = !DILocation(line: 692, column: 33, scope: !669)
!674 = !DILocation(line: 692, column: 40, scope: !669)
!675 = !DILocation(line: 692, column: 45, scope: !669)
!676 = !DILocation(line: 692, column: 52, scope: !669)
!677 = !DILocation(line: 692, column: 64, scope: !669)
!678 = !DILocation(line: 692, column: 9, scope: !669)
!679 = !DILocation(line: 691, column: 8, scope: !680)
!680 = !DILexicalBlockFile(scope: !623, file: !192, discriminator: 1)
!681 = !DILocation(line: 693, column: 7, scope: !682)
!682 = distinct !DILexicalBlock(scope: !669, file: !192, line: 692, column: 74)
!683 = !DILocation(line: 701, column: 8, scope: !684)
!684 = distinct !DILexicalBlock(scope: !623, file: !192, line: 701, column: 8)
!685 = !DILocation(line: 701, column: 15, scope: !684)
!686 = !DILocation(line: 701, column: 26, scope: !684)
!687 = !DILocation(line: 701, column: 8, scope: !623)
!688 = !DILocation(line: 703, column: 43, scope: !689)
!689 = distinct !DILexicalBlock(scope: !684, file: !192, line: 701, column: 34)
!690 = !DILocation(line: 704, column: 43, scope: !689)
!691 = !DILocation(line: 706, column: 43, scope: !689)
!692 = !DILocation(line: 706, column: 50, scope: !689)
!693 = !DILocation(line: 702, column: 27, scope: !689)
!694 = !DILocation(line: 702, column: 7, scope: !689)
!695 = !DILocation(line: 702, column: 14, scope: !689)
!696 = !DILocation(line: 702, column: 25, scope: !689)
!697 = !DILocation(line: 707, column: 4, scope: !689)
!698 = !DILocation(line: 709, column: 34, scope: !623)
!699 = !DILocation(line: 709, column: 41, scope: !623)
!700 = !DILocation(line: 709, column: 22, scope: !623)
!701 = !DILocation(line: 709, column: 20, scope: !623)
!702 = !DILocation(line: 710, column: 8, scope: !703)
!703 = distinct !DILexicalBlock(scope: !623, file: !192, line: 710, column: 8)
!704 = !DILocation(line: 710, column: 15, scope: !703)
!705 = !DILocation(line: 710, column: 27, scope: !703)
!706 = !DILocation(line: 710, column: 34, scope: !703)
!707 = !DILocation(line: 710, column: 38, scope: !708)
!708 = !DILexicalBlockFile(scope: !703, file: !192, discriminator: 1)
!709 = !DILocation(line: 710, column: 8, scope: !708)
!710 = !DILocation(line: 711, column: 87, scope: !711)
!711 = distinct !DILexicalBlock(scope: !703, file: !192, line: 710, column: 55)
!712 = !DILocation(line: 711, column: 94, scope: !711)
!713 = !DILocation(line: 711, column: 7, scope: !711)
!714 = !DILocation(line: 712, column: 7, scope: !711)
!715 = !DILocation(line: 715, column: 8, scope: !716)
!716 = distinct !DILexicalBlock(scope: !623, file: !192, line: 715, column: 8)
!717 = !DILocation(line: 715, column: 24, scope: !716)
!718 = !DILocation(line: 716, column: 33, scope: !716)
!719 = !DILocation(line: 716, column: 40, scope: !716)
!720 = !DILocation(line: 716, column: 45, scope: !716)
!721 = !DILocation(line: 716, column: 52, scope: !716)
!722 = !DILocation(line: 716, column: 64, scope: !716)
!723 = !DILocation(line: 716, column: 9, scope: !716)
!724 = !DILocation(line: 715, column: 8, scope: !680)
!725 = !DILocation(line: 717, column: 7, scope: !726)
!726 = distinct !DILexicalBlock(scope: !716, file: !192, line: 716, column: 74)
!727 = !DILocation(line: 725, column: 21, scope: !623)
!728 = !DILocation(line: 725, column: 4, scope: !623)
!729 = !DILocation(line: 725, column: 11, scope: !623)
!730 = !DILocation(line: 725, column: 19, scope: !623)
!731 = !DILocation(line: 727, column: 11, scope: !732)
!732 = distinct !DILexicalBlock(scope: !623, file: !192, line: 727, column: 4)
!733 = !DILocation(line: 727, column: 9, scope: !732)
!734 = !DILocation(line: 727, column: 16, scope: !735)
!735 = !DILexicalBlockFile(scope: !736, file: !192, discriminator: 1)
!736 = distinct !DILexicalBlock(scope: !732, file: !192, line: 727, column: 4)
!737 = !DILocation(line: 727, column: 20, scope: !735)
!738 = !DILocation(line: 727, column: 29, scope: !735)
!739 = !DILocation(line: 727, column: 18, scope: !735)
!740 = !DILocation(line: 727, column: 4, scope: !735)
!741 = !DILocalVariable(name: "plugin", scope: !742, file: !192, line: 728, type: !352)
!742 = distinct !DILexicalBlock(scope: !736, file: !192, line: 727, column: 39)
!743 = !DILocation(line: 728, column: 20, scope: !742)
!744 = !DILocation(line: 728, column: 48, scope: !742)
!745 = !DILocation(line: 728, column: 29, scope: !742)
!746 = !DILocation(line: 728, column: 31, scope: !742)
!747 = !DILocation(line: 728, column: 41, scope: !742)
!748 = !DILocation(line: 730, column: 22, scope: !742)
!749 = !DILocation(line: 730, column: 30, scope: !742)
!750 = !DILocation(line: 730, column: 38, scope: !742)
!751 = !DILocation(line: 730, column: 45, scope: !742)
!752 = !DILocation(line: 730, column: 7, scope: !742)
!753 = !DILocation(line: 730, column: 15, scope: !742)
!754 = !DILocation(line: 730, column: 20, scope: !742)
!755 = !DILocation(line: 732, column: 11, scope: !756)
!756 = distinct !DILexicalBlock(scope: !742, file: !192, line: 732, column: 11)
!757 = !DILocation(line: 732, column: 19, scope: !756)
!758 = !DILocation(line: 732, column: 24, scope: !756)
!759 = !DILocation(line: 732, column: 11, scope: !742)
!760 = !DILocation(line: 733, column: 107, scope: !761)
!761 = distinct !DILexicalBlock(scope: !756, file: !192, line: 732, column: 32)
!762 = !DILocation(line: 733, column: 115, scope: !761)
!763 = !DILocation(line: 733, column: 10, scope: !761)
!764 = !DILocation(line: 735, column: 30, scope: !761)
!765 = !DILocation(line: 735, column: 10, scope: !761)
!766 = !DILocation(line: 736, column: 7, scope: !761)
!767 = !DILocation(line: 736, column: 18, scope: !768)
!768 = !DILexicalBlockFile(scope: !769, file: !192, discriminator: 1)
!769 = distinct !DILexicalBlock(scope: !756, file: !192, line: 736, column: 18)
!770 = !DILocation(line: 736, column: 25, scope: !768)
!771 = !DILocation(line: 736, column: 29, scope: !768)
!772 = !DILocation(line: 736, column: 39, scope: !768)
!773 = !DILocation(line: 738, column: 30, scope: !774)
!774 = distinct !DILexicalBlock(scope: !769, file: !192, line: 736, column: 45)
!775 = !DILocation(line: 738, column: 10, scope: !774)
!776 = !DILocation(line: 739, column: 10, scope: !774)
!777 = !DILocation(line: 742, column: 33, scope: !778)
!778 = distinct !DILexicalBlock(scope: !769, file: !192, line: 740, column: 14)
!779 = !DILocation(line: 742, column: 41, scope: !778)
!780 = !DILocation(line: 742, column: 10, scope: !778)
!781 = !DILocation(line: 743, column: 26, scope: !778)
!782 = !DILocation(line: 743, column: 33, scope: !778)
!783 = !DILocation(line: 743, column: 42, scope: !778)
!784 = !DILocation(line: 743, column: 10, scope: !778)
!785 = !DILocation(line: 744, column: 33, scope: !778)
!786 = !DILocation(line: 744, column: 41, scope: !778)
!787 = !DILocation(line: 744, column: 47, scope: !778)
!788 = !DILocation(line: 744, column: 10, scope: !778)
!789 = !DILocation(line: 745, column: 80, scope: !778)
!790 = !DILocation(line: 745, column: 88, scope: !778)
!791 = !DILocation(line: 745, column: 94, scope: !778)
!792 = !DILocation(line: 745, column: 10, scope: !778)
!793 = !DILocation(line: 747, column: 4, scope: !742)
!794 = !DILocation(line: 727, column: 35, scope: !795)
!795 = !DILexicalBlockFile(scope: !736, file: !192, discriminator: 2)
!796 = !DILocation(line: 727, column: 4, scope: !795)
!797 = distinct !{!797, !798}
!798 = !DILocation(line: 727, column: 4, scope: !623)
!799 = !DILocation(line: 754, column: 8, scope: !800)
!800 = distinct !DILexicalBlock(scope: !623, file: !192, line: 754, column: 8)
!801 = !DILocation(line: 754, column: 15, scope: !800)
!802 = !DILocation(line: 754, column: 25, scope: !800)
!803 = !DILocation(line: 754, column: 32, scope: !800)
!804 = !DILocation(line: 754, column: 35, scope: !805)
!805 = !DILexicalBlockFile(scope: !800, file: !192, discriminator: 1)
!806 = !DILocation(line: 754, column: 42, scope: !805)
!807 = !DILocation(line: 754, column: 53, scope: !805)
!808 = !DILocation(line: 754, column: 66, scope: !805)
!809 = !DILocation(line: 754, column: 73, scope: !805)
!810 = !DILocation(line: 754, column: 8, scope: !805)
!811 = !DILocalVariable(name: "data", scope: !812, file: !192, line: 755, type: !298)
!812 = distinct !DILexicalBlock(scope: !800, file: !192, line: 754, column: 82)
!813 = !DILocation(line: 755, column: 24, scope: !812)
!814 = !DILocation(line: 755, column: 31, scope: !812)
!815 = !DILocation(line: 755, column: 38, scope: !812)
!816 = !DILocation(line: 755, column: 49, scope: !812)
!817 = !DILocation(line: 755, column: 62, scope: !812)
!818 = !DILocalVariable(name: "plugin", scope: !812, file: !192, line: 756, type: !352)
!819 = !DILocation(line: 756, column: 20, scope: !812)
!820 = !DILocation(line: 756, column: 29, scope: !812)
!821 = !DILocation(line: 757, column: 7, scope: !812)
!822 = !DILocation(line: 757, column: 15, scope: !812)
!823 = !DILocation(line: 757, column: 24, scope: !812)
!824 = !DILocation(line: 758, column: 7, scope: !812)
!825 = !DILocation(line: 758, column: 15, scope: !812)
!826 = !DILocation(line: 758, column: 22, scope: !812)
!827 = !DILocation(line: 759, column: 22, scope: !812)
!828 = !DILocation(line: 759, column: 7, scope: !812)
!829 = !DILocation(line: 759, column: 15, scope: !812)
!830 = !DILocation(line: 759, column: 20, scope: !812)
!831 = !DILocation(line: 760, column: 30, scope: !812)
!832 = !DILocation(line: 760, column: 36, scope: !812)
!833 = !DILocation(line: 760, column: 7, scope: !812)
!834 = !DILocation(line: 761, column: 23, scope: !812)
!835 = !DILocation(line: 761, column: 30, scope: !812)
!836 = !DILocation(line: 761, column: 39, scope: !812)
!837 = !DILocation(line: 761, column: 7, scope: !812)
!838 = !DILocation(line: 762, column: 4, scope: !812)
!839 = !DILocation(line: 764, column: 8, scope: !623)
!840 = !DILocation(line: 764, column: 4, scope: !623)
!841 = !DILocation(line: 767, column: 8, scope: !842)
!842 = distinct !DILexicalBlock(scope: !623, file: !192, line: 767, column: 8)
!843 = !DILocation(line: 767, column: 16, scope: !842)
!844 = !DILocation(line: 767, column: 8, scope: !623)
!845 = !DILocation(line: 768, column: 24, scope: !846)
!846 = distinct !DILexicalBlock(scope: !842, file: !192, line: 767, column: 24)
!847 = !DILocation(line: 768, column: 7, scope: !846)
!848 = !DILocation(line: 769, column: 4, scope: !846)
!849 = !DILocation(line: 770, column: 11, scope: !623)
!850 = !DILocation(line: 770, column: 4, scope: !623)
!851 = !DILocation(line: 771, column: 11, scope: !623)
!852 = !DILocation(line: 771, column: 4, scope: !623)
!853 = distinct !DISubprogram(name: "ToolsCoreLoadDirectory", scope: !192, file: !192, line: 501, type: !854, isLocal: true, isDefinition: true, scopeLine: 504, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !304)
!854 = !DISubroutineType(types: !855)
!855 = !{!86, !78, !63, !213}
!856 = !DILocalVariable(name: "ctx", arg: 1, scope: !853, file: !192, line: 501, type: !78)
!857 = !DILocation(line: 501, column: 37, scope: !853)
!858 = !DILocalVariable(name: "pluginPath", arg: 2, scope: !853, file: !192, line: 502, type: !63)
!859 = !DILocation(line: 502, column: 37, scope: !853)
!860 = !DILocalVariable(name: "regs", arg: 3, scope: !853, file: !192, line: 503, type: !213)
!861 = !DILocation(line: 503, column: 35, scope: !853)
!862 = !DILocalVariable(name: "ret", scope: !853, file: !192, line: 505, type: !86)
!863 = !DILocation(line: 505, column: 13, scope: !853)
!864 = !DILocalVariable(name: "staticEntry", scope: !853, file: !192, line: 506, type: !63)
!865 = !DILocation(line: 506, column: 17, scope: !853)
!866 = !DILocalVariable(name: "i", scope: !853, file: !192, line: 507, type: !145)
!867 = !DILocation(line: 507, column: 10, scope: !853)
!868 = !DILocalVariable(name: "dir", scope: !853, file: !192, line: 508, type: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "GDir", file: !871, line: 37, baseType: !872)
!871 = !DIFile(filename: "/usr/include/glib-2.0/glib/gdir.h", directory: "/home/lichi/Desktop/open-vm-tools/line1387")
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GDir", file: !871, line: 37, flags: DIFlagFwdDecl)
!873 = !DILocation(line: 508, column: 10, scope: !853)
!874 = !DILocalVariable(name: "err", scope: !853, file: !192, line: 509, type: !115)
!875 = !DILocation(line: 509, column: 12, scope: !853)
!876 = !DILocalVariable(name: "plugins", scope: !853, file: !192, line: 510, type: !213)
!877 = !DILocation(line: 510, column: 15, scope: !853)
!878 = !DILocation(line: 512, column: 21, scope: !853)
!879 = !DILocation(line: 512, column: 10, scope: !853)
!880 = !DILocation(line: 512, column: 8, scope: !853)
!881 = !DILocation(line: 513, column: 8, scope: !882)
!882 = distinct !DILexicalBlock(scope: !853, file: !192, line: 513, column: 8)
!883 = !DILocation(line: 513, column: 12, scope: !882)
!884 = !DILocation(line: 513, column: 8, scope: !853)
!885 = !DILocation(line: 514, column: 74, scope: !886)
!886 = distinct !DILexicalBlock(scope: !882, file: !192, line: 513, column: 20)
!887 = !DILocation(line: 514, column: 79, scope: !886)
!888 = !DILocation(line: 514, column: 7, scope: !886)
!889 = !DILocation(line: 515, column: 7, scope: !886)
!890 = !DILocation(line: 518, column: 14, scope: !853)
!891 = !DILocation(line: 518, column: 12, scope: !853)
!892 = !DILocation(line: 524, column: 4, scope: !853)
!893 = !DILocation(line: 524, column: 42, scope: !894)
!894 = !DILexicalBlockFile(scope: !853, file: !192, discriminator: 1)
!895 = !DILocation(line: 524, column: 26, scope: !894)
!896 = !DILocation(line: 524, column: 24, scope: !894)
!897 = !DILocation(line: 524, column: 48, scope: !894)
!898 = !DILocation(line: 524, column: 4, scope: !894)
!899 = !DILocation(line: 525, column: 28, scope: !900)
!900 = distinct !DILexicalBlock(scope: !901, file: !192, line: 525, column: 11)
!901 = distinct !DILexicalBlock(scope: !853, file: !192, line: 524, column: 56)
!902 = !DILocation(line: 525, column: 11, scope: !900)
!903 = !DILocation(line: 525, column: 11, scope: !901)
!904 = !DILocation(line: 526, column: 26, scope: !905)
!905 = distinct !DILexicalBlock(scope: !900, file: !192, line: 525, column: 52)
!906 = !DILocation(line: 526, column: 44, scope: !905)
!907 = !DILocation(line: 526, column: 35, scope: !905)
!908 = !DILocation(line: 526, column: 10, scope: !909)
!909 = !DILexicalBlockFile(scope: !905, file: !192, discriminator: 1)
!910 = !DILocation(line: 527, column: 7, scope: !905)
!911 = !DILocation(line: 524, column: 4, scope: !912)
!912 = !DILexicalBlockFile(scope: !853, file: !192, discriminator: 2)
!913 = distinct !{!913, !892}
!914 = !DILocation(line: 530, column: 16, scope: !853)
!915 = !DILocation(line: 530, column: 4, scope: !853)
!916 = !DILocation(line: 532, column: 21, scope: !853)
!917 = !DILocation(line: 532, column: 4, scope: !853)
!918 = !DILocation(line: 534, column: 11, scope: !919)
!919 = distinct !DILexicalBlock(scope: !853, file: !192, line: 534, column: 4)
!920 = !DILocation(line: 534, column: 9, scope: !919)
!921 = !DILocation(line: 534, column: 16, scope: !922)
!922 = !DILexicalBlockFile(scope: !923, file: !192, discriminator: 1)
!923 = distinct !DILexicalBlock(scope: !919, file: !192, line: 534, column: 4)
!924 = !DILocation(line: 534, column: 20, scope: !922)
!925 = !DILocation(line: 534, column: 29, scope: !922)
!926 = !DILocation(line: 534, column: 18, scope: !922)
!927 = !DILocation(line: 534, column: 4, scope: !922)
!928 = !DILocalVariable(name: "entry", scope: !929, file: !192, line: 535, type: !128)
!929 = distinct !DILexicalBlock(scope: !923, file: !192, line: 534, column: 39)
!930 = !DILocation(line: 535, column: 14, scope: !929)
!931 = !DILocalVariable(name: "path", scope: !929, file: !192, line: 536, type: !128)
!932 = !DILocation(line: 536, column: 14, scope: !929)
!933 = !DILocalVariable(name: "module", scope: !929, file: !192, line: 537, type: !221)
!934 = !DILocation(line: 537, column: 16, scope: !929)
!935 = !DILocalVariable(name: "plugin", scope: !929, file: !192, line: 538, type: !352)
!936 = !DILocation(line: 538, column: 20, scope: !929)
!937 = !DILocalVariable(name: "onload", scope: !929, file: !192, line: 539, type: !359)
!938 = !DILocation(line: 539, column: 25, scope: !929)
!939 = !DILocation(line: 541, column: 34, scope: !929)
!940 = !DILocation(line: 541, column: 15, scope: !929)
!941 = !DILocation(line: 541, column: 17, scope: !929)
!942 = !DILocation(line: 541, column: 27, scope: !929)
!943 = !DILocation(line: 541, column: 13, scope: !929)
!944 = !DILocation(line: 542, column: 40, scope: !929)
!945 = !DILocation(line: 542, column: 57, scope: !929)
!946 = !DILocation(line: 542, column: 14, scope: !929)
!947 = !DILocation(line: 542, column: 12, scope: !929)
!948 = !DILocation(line: 544, column: 24, scope: !949)
!949 = distinct !DILexicalBlock(scope: !929, file: !192, line: 544, column: 11)
!950 = !DILocation(line: 544, column: 12, scope: !949)
!951 = !DILocation(line: 544, column: 11, scope: !929)
!952 = !DILocation(line: 545, column: 98, scope: !953)
!953 = distinct !DILexicalBlock(scope: !949, file: !192, line: 544, column: 55)
!954 = !DILocation(line: 545, column: 10, scope: !953)
!955 = !DILocation(line: 546, column: 10, scope: !953)
!956 = !DILocation(line: 557, column: 30, scope: !929)
!957 = !DILocation(line: 557, column: 16, scope: !929)
!958 = !DILocation(line: 557, column: 14, scope: !929)
!959 = !DILocation(line: 571, column: 11, scope: !960)
!960 = distinct !DILexicalBlock(scope: !929, file: !192, line: 571, column: 11)
!961 = !DILocation(line: 571, column: 18, scope: !960)
!962 = !DILocation(line: 571, column: 11, scope: !929)
!963 = !DILocation(line: 572, column: 87, scope: !964)
!964 = distinct !DILexicalBlock(scope: !960, file: !192, line: 571, column: 26)
!965 = !DILocation(line: 572, column: 94, scope: !964)
!966 = !DILocation(line: 572, column: 10, scope: !967)
!967 = !DILexicalBlockFile(scope: !964, file: !192, discriminator: 1)
!968 = !DILocation(line: 573, column: 10, scope: !964)
!969 = !DILocation(line: 576, column: 28, scope: !970)
!970 = distinct !DILexicalBlock(scope: !929, file: !192, line: 576, column: 11)
!971 = !DILocation(line: 576, column: 51, scope: !970)
!972 = !DILocation(line: 576, column: 12, scope: !970)
!973 = !DILocation(line: 576, column: 11, scope: !929)
!974 = !DILocation(line: 577, column: 101, scope: !975)
!975 = distinct !DILexicalBlock(scope: !970, file: !192, line: 576, column: 74)
!976 = !DILocation(line: 577, column: 10, scope: !975)
!977 = !DILocation(line: 578, column: 10, scope: !975)
!978 = !DILocation(line: 581, column: 16, scope: !929)
!979 = !DILocation(line: 581, column: 14, scope: !929)
!980 = !DILocation(line: 582, column: 26, scope: !929)
!981 = !DILocation(line: 582, column: 7, scope: !929)
!982 = !DILocation(line: 582, column: 15, scope: !929)
!983 = !DILocation(line: 582, column: 24, scope: !929)
!984 = !DILocation(line: 583, column: 7, scope: !929)
!985 = !DILocation(line: 583, column: 15, scope: !929)
!986 = !DILocation(line: 583, column: 20, scope: !929)
!987 = !DILocation(line: 584, column: 24, scope: !929)
!988 = !DILocation(line: 584, column: 7, scope: !929)
!989 = !DILocation(line: 584, column: 15, scope: !929)
!990 = !DILocation(line: 584, column: 22, scope: !929)
!991 = !DILocation(line: 585, column: 24, scope: !929)
!992 = !DILocation(line: 585, column: 7, scope: !929)
!993 = !DILocation(line: 585, column: 15, scope: !929)
!994 = !DILocation(line: 585, column: 22, scope: !929)
!995 = !DILocation(line: 586, column: 23, scope: !929)
!996 = !DILocation(line: 586, column: 29, scope: !929)
!997 = !DILocation(line: 586, column: 7, scope: !929)
!998 = !DILocation(line: 589, column: 14, scope: !929)
!999 = !DILocation(line: 589, column: 7, scope: !929)
!1000 = !DILocation(line: 590, column: 11, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !929, file: !192, line: 590, column: 11)
!1002 = !DILocation(line: 590, column: 18, scope: !1001)
!1003 = !DILocation(line: 590, column: 25, scope: !1001)
!1004 = !DILocation(line: 590, column: 28, scope: !1005)
!1005 = !DILexicalBlockFile(scope: !1001, file: !192, discriminator: 1)
!1006 = !DILocation(line: 590, column: 35, scope: !1005)
!1007 = !DILocation(line: 590, column: 11, scope: !1005)
!1008 = !DILocation(line: 591, column: 30, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1010, file: !192, line: 591, column: 14)
!1010 = distinct !DILexicalBlock(scope: !1001, file: !192, line: 590, column: 44)
!1011 = !DILocation(line: 591, column: 15, scope: !1009)
!1012 = !DILocation(line: 591, column: 14, scope: !1010)
!1013 = !DILocation(line: 592, column: 90, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1009, file: !192, line: 591, column: 39)
!1015 = !DILocation(line: 592, column: 97, scope: !1014)
!1016 = !DILocation(line: 592, column: 13, scope: !1017)
!1017 = !DILexicalBlockFile(scope: !1014, file: !192, discriminator: 1)
!1018 = !DILocation(line: 593, column: 10, scope: !1014)
!1019 = !DILocation(line: 594, column: 7, scope: !1010)
!1020 = !DILocation(line: 595, column: 4, scope: !929)
!1021 = !DILocation(line: 534, column: 35, scope: !1022)
!1022 = !DILexicalBlockFile(scope: !923, file: !192, discriminator: 2)
!1023 = !DILocation(line: 534, column: 4, scope: !1022)
!1024 = distinct !{!1024, !1025}
!1025 = !DILocation(line: 534, column: 4, scope: !853)
!1026 = !DILocation(line: 597, column: 21, scope: !853)
!1027 = !DILocation(line: 597, column: 4, scope: !853)
!1028 = !DILocation(line: 598, column: 8, scope: !853)
!1029 = !DILocation(line: 598, column: 4, scope: !853)
!1030 = !DILocation(line: 601, column: 11, scope: !853)
!1031 = !DILocation(line: 601, column: 4, scope: !853)
!1032 = distinct !DISubprogram(name: "ToolsCoreFreePlugin", scope: !192, file: !192, line: 183, type: !1033, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !304)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{null, !352}
!1035 = !DILocalVariable(name: "plugin", arg: 1, scope: !1032, file: !192, line: 183, type: !352)
!1036 = !DILocation(line: 183, column: 34, scope: !1032)
!1037 = !DILocation(line: 185, column: 8, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1032, file: !192, line: 185, column: 8)
!1039 = !DILocation(line: 185, column: 16, scope: !1038)
!1040 = !DILocation(line: 185, column: 23, scope: !1038)
!1041 = !DILocation(line: 185, column: 30, scope: !1038)
!1042 = !DILocation(line: 185, column: 49, scope: !1043)
!1043 = !DILexicalBlockFile(scope: !1038, file: !192, discriminator: 1)
!1044 = !DILocation(line: 185, column: 57, scope: !1043)
!1045 = !DILocation(line: 185, column: 34, scope: !1043)
!1046 = !DILocation(line: 185, column: 8, scope: !1043)
!1047 = !DILocation(line: 186, column: 84, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1038, file: !192, line: 185, column: 66)
!1049 = !DILocation(line: 186, column: 92, scope: !1048)
!1050 = !DILocation(line: 186, column: 102, scope: !1048)
!1051 = !DILocation(line: 186, column: 7, scope: !1052)
!1052 = !DILexicalBlockFile(scope: !1048, file: !192, discriminator: 1)
!1053 = !DILocation(line: 189, column: 4, scope: !1048)
!1054 = !DILocation(line: 190, column: 11, scope: !1032)
!1055 = !DILocation(line: 190, column: 19, scope: !1032)
!1056 = !DILocation(line: 190, column: 4, scope: !1032)
!1057 = !DILocation(line: 191, column: 11, scope: !1032)
!1058 = !DILocation(line: 191, column: 4, scope: !1032)
!1059 = !DILocation(line: 192, column: 1, scope: !1032)
!1060 = distinct !DISubprogram(name: "ToolsCore_RegisterPlugins", scope: !192, file: !192, line: 782, type: !193, isLocal: false, isDefinition: true, scopeLine: 783, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !304)
!1061 = !DILocalVariable(name: "state", arg: 1, scope: !1060, file: !192, line: 782, type: !195)
!1062 = !DILocation(line: 782, column: 46, scope: !1060)
!1063 = !DILocalVariable(name: "fakeProv", scope: !1060, file: !192, line: 784, type: !58)
!1064 = !DILocation(line: 784, column: 22, scope: !1060)
!1065 = !DILocalVariable(name: "fakeReg", scope: !1060, file: !192, line: 785, type: !54)
!1066 = !DILocation(line: 785, column: 24, scope: !1060)
!1067 = !DILocation(line: 787, column: 8, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1060, file: !192, line: 787, column: 8)
!1069 = !DILocation(line: 787, column: 15, scope: !1068)
!1070 = !DILocation(line: 787, column: 23, scope: !1068)
!1071 = !DILocation(line: 787, column: 8, scope: !1060)
!1072 = !DILocation(line: 788, column: 7, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1068, file: !192, line: 787, column: 31)
!1074 = !DILocation(line: 795, column: 23, scope: !1060)
!1075 = !DILocation(line: 795, column: 4, scope: !1060)
!1076 = !DILocation(line: 795, column: 11, scope: !1060)
!1077 = !DILocation(line: 795, column: 21, scope: !1060)
!1078 = !DILocation(line: 797, column: 8, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1060, file: !192, line: 797, column: 8)
!1080 = !DILocation(line: 797, column: 15, scope: !1079)
!1081 = !DILocation(line: 797, column: 19, scope: !1079)
!1082 = !DILocation(line: 797, column: 23, scope: !1079)
!1083 = !DILocation(line: 797, column: 8, scope: !1060)
!1084 = !DILocation(line: 798, column: 18, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1079, file: !192, line: 797, column: 31)
!1086 = !DILocation(line: 798, column: 16, scope: !1085)
!1087 = !DILocation(line: 799, column: 7, scope: !1085)
!1088 = !DILocation(line: 799, column: 17, scope: !1085)
!1089 = !DILocation(line: 799, column: 25, scope: !1085)
!1090 = !DILocation(line: 800, column: 7, scope: !1085)
!1091 = !DILocation(line: 800, column: 17, scope: !1085)
!1092 = !DILocation(line: 800, column: 25, scope: !1085)
!1093 = !DILocation(line: 801, column: 7, scope: !1085)
!1094 = !DILocation(line: 801, column: 17, scope: !1085)
!1095 = !DILocation(line: 801, column: 22, scope: !1085)
!1096 = !DILocation(line: 802, column: 7, scope: !1085)
!1097 = !DILocation(line: 802, column: 17, scope: !1085)
!1098 = !DILocation(line: 802, column: 29, scope: !1085)
!1099 = !DILocation(line: 803, column: 7, scope: !1085)
!1100 = !DILocation(line: 803, column: 17, scope: !1085)
!1101 = !DILocation(line: 803, column: 27, scope: !1085)
!1102 = !DILocation(line: 805, column: 22, scope: !1085)
!1103 = !DILocation(line: 805, column: 15, scope: !1085)
!1104 = !DILocation(line: 805, column: 20, scope: !1085)
!1105 = !DILocation(line: 806, column: 15, scope: !1085)
!1106 = !DILocation(line: 806, column: 21, scope: !1085)
!1107 = !DILocation(line: 807, column: 28, scope: !1085)
!1108 = !DILocation(line: 807, column: 35, scope: !1085)
!1109 = !DILocation(line: 807, column: 46, scope: !1085)
!1110 = !DILocation(line: 807, column: 7, scope: !1085)
!1111 = !DILocation(line: 808, column: 4, scope: !1085)
!1112 = !DILocation(line: 810, column: 15, scope: !1060)
!1113 = !DILocation(line: 810, column: 13, scope: !1060)
!1114 = !DILocation(line: 811, column: 4, scope: !1060)
!1115 = !DILocation(line: 811, column: 14, scope: !1060)
!1116 = !DILocation(line: 811, column: 22, scope: !1060)
!1117 = !DILocation(line: 812, column: 4, scope: !1060)
!1118 = !DILocation(line: 812, column: 14, scope: !1060)
!1119 = !DILocation(line: 812, column: 22, scope: !1060)
!1120 = !DILocation(line: 813, column: 4, scope: !1060)
!1121 = !DILocation(line: 813, column: 14, scope: !1060)
!1122 = !DILocation(line: 813, column: 19, scope: !1060)
!1123 = !DILocation(line: 814, column: 4, scope: !1060)
!1124 = !DILocation(line: 814, column: 14, scope: !1060)
!1125 = !DILocation(line: 814, column: 26, scope: !1060)
!1126 = !DILocation(line: 815, column: 4, scope: !1060)
!1127 = !DILocation(line: 815, column: 14, scope: !1060)
!1128 = !DILocation(line: 815, column: 24, scope: !1060)
!1129 = !DILocation(line: 817, column: 19, scope: !1060)
!1130 = !DILocation(line: 817, column: 12, scope: !1060)
!1131 = !DILocation(line: 817, column: 17, scope: !1060)
!1132 = !DILocation(line: 818, column: 12, scope: !1060)
!1133 = !DILocation(line: 818, column: 18, scope: !1060)
!1134 = !DILocation(line: 819, column: 25, scope: !1060)
!1135 = !DILocation(line: 819, column: 32, scope: !1060)
!1136 = !DILocation(line: 819, column: 43, scope: !1060)
!1137 = !DILocation(line: 819, column: 4, scope: !1060)
!1138 = !DILocation(line: 821, column: 15, scope: !1060)
!1139 = !DILocation(line: 821, column: 13, scope: !1060)
!1140 = !DILocation(line: 822, column: 4, scope: !1060)
!1141 = !DILocation(line: 822, column: 14, scope: !1060)
!1142 = !DILocation(line: 822, column: 22, scope: !1060)
!1143 = !DILocation(line: 823, column: 4, scope: !1060)
!1144 = !DILocation(line: 823, column: 14, scope: !1060)
!1145 = !DILocation(line: 823, column: 22, scope: !1060)
!1146 = !DILocation(line: 824, column: 4, scope: !1060)
!1147 = !DILocation(line: 824, column: 14, scope: !1060)
!1148 = !DILocation(line: 824, column: 19, scope: !1060)
!1149 = !DILocation(line: 825, column: 4, scope: !1060)
!1150 = !DILocation(line: 825, column: 14, scope: !1060)
!1151 = !DILocation(line: 825, column: 26, scope: !1060)
!1152 = !DILocation(line: 826, column: 4, scope: !1060)
!1153 = !DILocation(line: 826, column: 14, scope: !1060)
!1154 = !DILocation(line: 826, column: 24, scope: !1060)
!1155 = !DILocation(line: 828, column: 19, scope: !1060)
!1156 = !DILocation(line: 828, column: 12, scope: !1060)
!1157 = !DILocation(line: 828, column: 17, scope: !1060)
!1158 = !DILocation(line: 829, column: 12, scope: !1060)
!1159 = !DILocation(line: 829, column: 18, scope: !1060)
!1160 = !DILocation(line: 830, column: 25, scope: !1060)
!1161 = !DILocation(line: 830, column: 32, scope: !1060)
!1162 = !DILocation(line: 830, column: 43, scope: !1060)
!1163 = !DILocation(line: 830, column: 4, scope: !1060)
!1164 = !DILocation(line: 832, column: 15, scope: !1060)
!1165 = !DILocation(line: 832, column: 13, scope: !1060)
!1166 = !DILocation(line: 833, column: 4, scope: !1060)
!1167 = !DILocation(line: 833, column: 14, scope: !1060)
!1168 = !DILocation(line: 833, column: 22, scope: !1060)
!1169 = !DILocation(line: 834, column: 4, scope: !1060)
!1170 = !DILocation(line: 834, column: 14, scope: !1060)
!1171 = !DILocation(line: 834, column: 22, scope: !1060)
!1172 = !DILocation(line: 835, column: 4, scope: !1060)
!1173 = !DILocation(line: 835, column: 14, scope: !1060)
!1174 = !DILocation(line: 835, column: 19, scope: !1060)
!1175 = !DILocation(line: 836, column: 4, scope: !1060)
!1176 = !DILocation(line: 836, column: 14, scope: !1060)
!1177 = !DILocation(line: 836, column: 26, scope: !1060)
!1178 = !DILocation(line: 837, column: 4, scope: !1060)
!1179 = !DILocation(line: 837, column: 14, scope: !1060)
!1180 = !DILocation(line: 837, column: 24, scope: !1060)
!1181 = !DILocation(line: 839, column: 19, scope: !1060)
!1182 = !DILocation(line: 839, column: 12, scope: !1060)
!1183 = !DILocation(line: 839, column: 17, scope: !1060)
!1184 = !DILocation(line: 840, column: 12, scope: !1060)
!1185 = !DILocation(line: 840, column: 18, scope: !1060)
!1186 = !DILocation(line: 841, column: 25, scope: !1060)
!1187 = !DILocation(line: 841, column: 32, scope: !1060)
!1188 = !DILocation(line: 841, column: 43, scope: !1060)
!1189 = !DILocation(line: 841, column: 4, scope: !1060)
!1190 = !DILocation(line: 848, column: 27, scope: !1060)
!1191 = !DILocation(line: 848, column: 4, scope: !1060)
!1192 = !DILocation(line: 854, column: 27, scope: !1060)
!1193 = !DILocation(line: 854, column: 4, scope: !1060)
!1194 = !DILocation(line: 855, column: 1, scope: !1060)
!1195 = !DILocation(line: 855, column: 1, scope: !1196)
!1196 = !DILexicalBlockFile(scope: !1060, file: !192, discriminator: 1)
!1197 = distinct !DISubprogram(name: "ToolsCoreRegisterRPC", scope: !192, file: !192, line: 421, type: !1198, isLocal: true, isDefinition: true, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !304)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!86, !78, !58, !298, !112}
!1200 = !DILocalVariable(name: "ctx", arg: 1, scope: !1197, file: !192, line: 421, type: !78)
!1201 = !DILocation(line: 421, column: 35, scope: !1197)
!1202 = !DILocalVariable(name: "prov", arg: 2, scope: !1197, file: !192, line: 422, type: !58)
!1203 = !DILocation(line: 422, column: 40, scope: !1197)
!1204 = !DILocalVariable(name: "plugin", arg: 3, scope: !1197, file: !192, line: 423, type: !298)
!1205 = !DILocation(line: 423, column: 39, scope: !1197)
!1206 = !DILocalVariable(name: "reg", arg: 4, scope: !1197, file: !192, line: 424, type: !112)
!1207 = !DILocation(line: 424, column: 31, scope: !1197)
!1208 = !DILocation(line: 426, column: 32, scope: !1197)
!1209 = !DILocation(line: 426, column: 37, scope: !1197)
!1210 = !DILocation(line: 426, column: 42, scope: !1197)
!1211 = !DILocation(line: 426, column: 4, scope: !1197)
!1212 = !DILocation(line: 427, column: 4, scope: !1197)
!1213 = distinct !DISubprogram(name: "ToolsCoreDumpRPC", scope: !192, file: !192, line: 144, type: !1214, isLocal: true, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !304)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{null, !78, !58, !112}
!1216 = !DILocalVariable(name: "ctx", arg: 1, scope: !1213, file: !192, line: 144, type: !78)
!1217 = !DILocation(line: 144, column: 31, scope: !1213)
!1218 = !DILocalVariable(name: "prov", arg: 2, scope: !1213, file: !192, line: 145, type: !58)
!1219 = !DILocation(line: 145, column: 36, scope: !1213)
!1220 = !DILocalVariable(name: "reg", arg: 3, scope: !1213, file: !192, line: 146, type: !112)
!1221 = !DILocation(line: 146, column: 27, scope: !1213)
!1222 = !DILocation(line: 148, column: 8, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1213, file: !192, line: 148, column: 8)
!1224 = !DILocation(line: 148, column: 12, scope: !1223)
!1225 = !DILocation(line: 148, column: 8, scope: !1213)
!1226 = !DILocalVariable(name: "cb", scope: !1227, file: !192, line: 149, type: !1228)
!1227 = distinct !DILexicalBlock(scope: !1223, file: !192, line: 148, column: 20)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannelCallback", file: !98, line: 115, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcChannelCallback", file: !98, line: 94, size: 384, align: 64, elements: !1231)
!1231 = !{!1232, !1233, !1238, !1239, !1240, !1241}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1230, file: !98, line: 96, baseType: !109, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1230, file: !98, line: 98, baseType: !1234, size: 64, align: 64, offset: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcIn_Callback", file: !98, line: 90, baseType: !1235)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!86, !278}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !1230, file: !98, line: 100, baseType: !112, size: 64, align: 64, offset: 128)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "xdrIn", scope: !1230, file: !98, line: 102, baseType: !112, size: 64, align: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "xdrOut", scope: !1230, file: !98, line: 109, baseType: !112, size: 64, align: 64, offset: 256)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "xdrInSize", scope: !1230, file: !98, line: 114, baseType: !71, size: 64, align: 64, offset: 320)
!1242 = !DILocation(line: 149, column: 27, scope: !1227)
!1243 = !DILocation(line: 149, column: 32, scope: !1227)
!1244 = !DILocation(line: 150, column: 51, scope: !1227)
!1245 = !DILocation(line: 150, column: 55, scope: !1227)
!1246 = !DILocation(line: 150, column: 7, scope: !1227)
!1247 = !DILocation(line: 151, column: 4, scope: !1227)
!1248 = !DILocation(line: 152, column: 1, scope: !1213)
!1249 = distinct !DISubprogram(name: "ToolsCoreRegisterSignal", scope: !192, file: !192, line: 443, type: !1198, isLocal: true, isDefinition: true, scopeLine: 447, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !304)
!1250 = !DILocalVariable(name: "ctx", arg: 1, scope: !1249, file: !192, line: 443, type: !78)
!1251 = !DILocation(line: 443, column: 38, scope: !1249)
!1252 = !DILocalVariable(name: "prov", arg: 2, scope: !1249, file: !192, line: 444, type: !58)
!1253 = !DILocation(line: 444, column: 43, scope: !1249)
!1254 = !DILocalVariable(name: "plugin", arg: 3, scope: !1249, file: !192, line: 445, type: !298)
!1255 = !DILocation(line: 445, column: 42, scope: !1249)
!1256 = !DILocalVariable(name: "reg", arg: 4, scope: !1249, file: !192, line: 446, type: !112)
!1257 = !DILocation(line: 446, column: 34, scope: !1249)
!1258 = !DILocalVariable(name: "valid", scope: !1249, file: !192, line: 448, type: !86)
!1259 = !DILocation(line: 448, column: 13, scope: !1249)
!1260 = !DILocalVariable(name: "sigId", scope: !1249, file: !192, line: 449, type: !145)
!1261 = !DILocation(line: 449, column: 10, scope: !1249)
!1262 = !DILocalVariable(name: "sigDetail", scope: !1249, file: !192, line: 450, type: !121)
!1263 = !DILocation(line: 450, column: 11, scope: !1249)
!1264 = !DILocalVariable(name: "sig", scope: !1249, file: !192, line: 451, type: !1265)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginSignalCb", file: !4, line: 484, baseType: !1267)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginSignalCb", file: !4, line: 480, size: 192, align: 64, elements: !1268)
!1268 = !{!1269, !1270, !1271}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "signame", scope: !1267, file: !4, line: 481, baseType: !63, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1267, file: !4, line: 482, baseType: !112, size: 64, align: 64, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !1267, file: !4, line: 483, baseType: !112, size: 64, align: 64, offset: 128)
!1272 = !DILocation(line: 451, column: 25, scope: !1249)
!1273 = !DILocation(line: 451, column: 31, scope: !1249)
!1274 = !DILocation(line: 453, column: 32, scope: !1249)
!1275 = !DILocation(line: 453, column: 37, scope: !1249)
!1276 = !DILocation(line: 454, column: 70, scope: !1249)
!1277 = !DILocation(line: 454, column: 75, scope: !1249)
!1278 = !DILocation(line: 454, column: 52, scope: !1249)
!1279 = !DILocation(line: 454, column: 89, scope: !1249)
!1280 = !DILocation(line: 454, column: 100, scope: !1249)
!1281 = !DILocation(line: 453, column: 12, scope: !1249)
!1282 = !DILocation(line: 453, column: 10, scope: !1249)
!1283 = !DILocation(line: 458, column: 8, scope: !1284)
!1284 = distinct !DILexicalBlock(scope: !1249, file: !192, line: 458, column: 8)
!1285 = !DILocation(line: 458, column: 8, scope: !1249)
!1286 = !DILocation(line: 459, column: 31, scope: !1287)
!1287 = distinct !DILexicalBlock(scope: !1284, file: !192, line: 458, column: 15)
!1288 = !DILocation(line: 459, column: 36, scope: !1287)
!1289 = !DILocation(line: 459, column: 50, scope: !1287)
!1290 = !DILocation(line: 459, column: 55, scope: !1287)
!1291 = !DILocation(line: 459, column: 66, scope: !1287)
!1292 = !DILocation(line: 459, column: 71, scope: !1287)
!1293 = !DILocation(line: 459, column: 65, scope: !1287)
!1294 = !DILocation(line: 459, column: 83, scope: !1287)
!1295 = !DILocation(line: 459, column: 88, scope: !1287)
!1296 = !DILocation(line: 459, column: 7, scope: !1287)
!1297 = !DILocation(line: 463, column: 7, scope: !1287)
!1298 = !DILocation(line: 466, column: 93, scope: !1249)
!1299 = !DILocation(line: 466, column: 101, scope: !1249)
!1300 = !DILocation(line: 466, column: 107, scope: !1249)
!1301 = !DILocation(line: 466, column: 112, scope: !1249)
!1302 = !DILocation(line: 466, column: 4, scope: !1249)
!1303 = !DILocation(line: 468, column: 4, scope: !1249)
!1304 = !DILocation(line: 469, column: 1, scope: !1249)
!1305 = distinct !DISubprogram(name: "ToolsCoreDumpSignal", scope: !192, file: !192, line: 164, type: !1214, isLocal: true, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !304)
!1306 = !DILocalVariable(name: "ctx", arg: 1, scope: !1305, file: !192, line: 164, type: !78)
!1307 = !DILocation(line: 164, column: 34, scope: !1305)
!1308 = !DILocalVariable(name: "prov", arg: 2, scope: !1305, file: !192, line: 165, type: !58)
!1309 = !DILocation(line: 165, column: 39, scope: !1305)
!1310 = !DILocalVariable(name: "reg", arg: 3, scope: !1305, file: !192, line: 166, type: !112)
!1311 = !DILocation(line: 166, column: 30, scope: !1305)
!1312 = !DILocation(line: 168, column: 8, scope: !1313)
!1313 = distinct !DILexicalBlock(scope: !1305, file: !192, line: 168, column: 8)
!1314 = !DILocation(line: 168, column: 12, scope: !1313)
!1315 = !DILocation(line: 168, column: 8, scope: !1305)
!1316 = !DILocalVariable(name: "sig", scope: !1317, file: !192, line: 169, type: !1265)
!1317 = distinct !DILexicalBlock(scope: !1313, file: !192, line: 168, column: 20)
!1318 = !DILocation(line: 169, column: 28, scope: !1317)
!1319 = !DILocation(line: 169, column: 34, scope: !1317)
!1320 = !DILocation(line: 170, column: 54, scope: !1317)
!1321 = !DILocation(line: 170, column: 59, scope: !1317)
!1322 = !DILocation(line: 170, column: 7, scope: !1317)
!1323 = !DILocation(line: 171, column: 4, scope: !1317)
!1324 = !DILocation(line: 172, column: 1, scope: !1305)
!1325 = distinct !DISubprogram(name: "ToolsCoreRegisterProperty", scope: !192, file: !192, line: 399, type: !1198, isLocal: true, isDefinition: true, scopeLine: 403, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !304)
!1326 = !DILocalVariable(name: "ctx", arg: 1, scope: !1325, file: !192, line: 399, type: !78)
!1327 = !DILocation(line: 399, column: 40, scope: !1325)
!1328 = !DILocalVariable(name: "prov", arg: 2, scope: !1325, file: !192, line: 400, type: !58)
!1329 = !DILocation(line: 400, column: 45, scope: !1325)
!1330 = !DILocalVariable(name: "plugin", arg: 3, scope: !1325, file: !192, line: 401, type: !298)
!1331 = !DILocation(line: 401, column: 44, scope: !1325)
!1332 = !DILocalVariable(name: "reg", arg: 4, scope: !1325, file: !192, line: 402, type: !112)
!1333 = !DILocation(line: 402, column: 36, scope: !1325)
!1334 = !DILocation(line: 404, column: 38, scope: !1325)
!1335 = !DILocation(line: 404, column: 43, scope: !1325)
!1336 = !DILocation(line: 404, column: 55, scope: !1325)
!1337 = !DILocation(line: 404, column: 4, scope: !1325)
!1338 = !DILocation(line: 405, column: 4, scope: !1325)
!1339 = distinct !DISubprogram(name: "ToolsCoreDumpProperty", scope: !192, file: !192, line: 124, type: !1214, isLocal: true, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !304)
!1340 = !DILocalVariable(name: "ctx", arg: 1, scope: !1339, file: !192, line: 124, type: !78)
!1341 = !DILocation(line: 124, column: 36, scope: !1339)
!1342 = !DILocalVariable(name: "prov", arg: 2, scope: !1339, file: !192, line: 125, type: !58)
!1343 = !DILocation(line: 125, column: 41, scope: !1339)
!1344 = !DILocalVariable(name: "reg", arg: 3, scope: !1339, file: !192, line: 126, type: !112)
!1345 = !DILocation(line: 126, column: 32, scope: !1339)
!1346 = !DILocation(line: 128, column: 8, scope: !1347)
!1347 = distinct !DILexicalBlock(scope: !1339, file: !192, line: 128, column: 8)
!1348 = !DILocation(line: 128, column: 12, scope: !1347)
!1349 = !DILocation(line: 128, column: 8, scope: !1339)
!1350 = !DILocation(line: 130, column: 51, scope: !1351)
!1351 = distinct !DILexicalBlock(scope: !1347, file: !192, line: 128, column: 20)
!1352 = !DILocation(line: 130, column: 27, scope: !1351)
!1353 = !DILocation(line: 130, column: 57, scope: !1351)
!1354 = !DILocation(line: 129, column: 7, scope: !1351)
!1355 = !DILocation(line: 131, column: 4, scope: !1351)
!1356 = !DILocation(line: 132, column: 1, scope: !1339)
!1357 = distinct !DISubprogram(name: "ToolsCoreRegisterProvider", scope: !192, file: !192, line: 276, type: !329, isLocal: true, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !304)
!1358 = !DILocalVariable(name: "state", arg: 1, scope: !1357, file: !192, line: 276, type: !195)
!1359 = !DILocation(line: 276, column: 46, scope: !1357)
!1360 = !DILocalVariable(name: "plugin", arg: 2, scope: !1357, file: !192, line: 277, type: !298)
!1361 = !DILocation(line: 277, column: 44, scope: !1357)
!1362 = !DILocalVariable(name: "type", arg: 3, scope: !1357, file: !192, line: 278, type: !69)
!1363 = !DILocation(line: 278, column: 40, scope: !1357)
!1364 = !DILocalVariable(name: "preg", arg: 4, scope: !1357, file: !192, line: 279, type: !53)
!1365 = !DILocation(line: 279, column: 48, scope: !1357)
!1366 = !DILocalVariable(name: "reg", arg: 5, scope: !1357, file: !192, line: 280, type: !112)
!1367 = !DILocation(line: 280, column: 36, scope: !1357)
!1368 = !DILocation(line: 282, column: 8, scope: !1369)
