; ModuleID = './libguestlib_la-guestlibV3_xdr.o.i'
source_filename = "./libguestlib_la-guestlibV3_xdr.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.XDR = type { i32, %struct.xdr_ops*, i8*, i8*, i8*, i32 }
%struct.xdr_ops = type { i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*)*, i32 (%struct.XDR*, i32)*, i32* (%struct.XDR*, i32)*, void (%struct.XDR*)*, i32 (%struct.XDR*, i32*)*, i32 (%struct.XDR*, i32*)* }
%struct.GuestLibV3StatUint32 = type { i8, i32 }
%struct.GuestLibV3StatUint64 = type { i8, i64 }
%struct.GuestLibV3String = type { i8, i8* }
%struct.GuestLibV3ByteArray = type { i8, %struct.anon }
%struct.anon = type { i32, i8* }
%struct.GuestLibV3Stat = type { i32, %union.anon }
%union.anon = type { %struct.GuestLibV3ByteArray }

; Function Attrs: nounwind uwtable
define i32 @xdr_GuestLibV3StatUint32(%struct.XDR*, %struct.GuestLibV3StatUint32*) #0 !dbg !68 {
  %3 = alloca i32, align 4
  %4 = alloca %struct.XDR*, align 8
  %5 = alloca %struct.GuestLibV3StatUint32*, align 8
  store %struct.XDR* %0, %struct.XDR** %4, align 8
  call void @llvm.dbg.declare(metadata %struct.XDR** %4, metadata !152, metadata !153), !dbg !154
  store %struct.GuestLibV3StatUint32* %1, %struct.GuestLibV3StatUint32** %5, align 8
  call void @llvm.dbg.declare(metadata %struct.GuestLibV3StatUint32** %5, metadata !155, metadata !153), !dbg !156

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !51)
!1 = !DIFile(filename: "libguestlib_la-guestlibV3_xdr.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1321")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdr_op", file: !4, line: 81, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/rpc/xdr.h", directory: "/home/lichi/Desktop/open-vm-tools/line1321")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "XDR_ENCODE", value: 0)
!7 = !DIEnumerator(name: "XDR_DECODE", value: 1)
!8 = !DIEnumerator(name: "XDR_FREE", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GuestLibV3TypeIds", file: !10, line: 47, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "guestlibV3.h", directory: "/home/lichi/Desktop/open-vm-tools/line1321")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!12 = !DIEnumerator(name: "GUESTLIB_TYPE_RESERVED", value: 0)
!13 = !DIEnumerator(name: "GUESTLIB_CPU_RESERVATION_MHZ", value: 1)
!14 = !DIEnumerator(name: "GUESTLIB_CPU_LIMIT_MHZ", value: 2)
!15 = !DIEnumerator(name: "GUESTLIB_CPU_SHARES", value: 3)
!16 = !DIEnumerator(name: "GUESTLIB_CPU_USED_MS", value: 4)
!17 = !DIEnumerator(name: "GUESTLIB_HOST_MHZ", value: 5)
!18 = !DIEnumerator(name: "GUESTLIB_MEM_RESERVATION_MB", value: 6)
!19 = !DIEnumerator(name: "GUESTLIB_MEM_LIMIT_MB", value: 7)
!20 = !DIEnumerator(name: "GUESTLIB_MEM_SHARES", value: 8)
!21 = !DIEnumerator(name: "GUESTLIB_MEM_MAPPED_MB", value: 9)
!22 = !DIEnumerator(name: "GUESTLIB_MEM_ACTIVE_MB", value: 10)
!23 = !DIEnumerator(name: "GUESTLIB_MEM_OVERHEAD_MB", value: 11)
!24 = !DIEnumerator(name: "GUESTLIB_MEM_BALLOONED_MB", value: 12)
!25 = !DIEnumerator(name: "GUESTLIB_MEM_SWAPPED_MB", value: 13)
!26 = !DIEnumerator(name: "GUESTLIB_MEM_SHARED_MB", value: 14)
!27 = !DIEnumerator(name: "GUESTLIB_MEM_SHARED_SAVED_MB", value: 15)
!28 = !DIEnumerator(name: "GUESTLIB_MEM_USED_MB", value: 16)
!29 = !DIEnumerator(name: "GUESTLIB_ELAPSED_MS", value: 17)
!30 = !DIEnumerator(name: "GUESTLIB_RESOURCE_POOL_PATH", value: 18)
!31 = !DIEnumerator(name: "GUESTLIB_CPU_STOLEN_MS", value: 19)
!32 = !DIEnumerator(name: "GUESTLIB_MEM_TARGET_SIZE_MB", value: 20)
!33 = !DIEnumerator(name: "GUESTLIB_HOST_CPU_NUM_CORES", value: 21)
!34 = !DIEnumerator(name: "GUESTLIB_HOST_CPU_USED_MS", value: 22)
!35 = !DIEnumerator(name: "GUESTLIB_HOST_MEM_SWAPPED_MB", value: 23)
!36 = !DIEnumerator(name: "GUESTLIB_HOST_MEM_SHARED_MB", value: 24)
!37 = !DIEnumerator(name: "GUESTLIB_HOST_MEM_USED_MB", value: 25)
!38 = !DIEnumerator(name: "GUESTLIB_HOST_MEM_PHYS_MB", value: 26)
!39 = !DIEnumerator(name: "GUESTLIB_HOST_MEM_PHYS_FREE_MB", value: 27)
!40 = !DIEnumerator(name: "GUESTLIB_HOST_MEM_KERN_OVHD_MB", value: 28)
!41 = !DIEnumerator(name: "GUESTLIB_HOST_MEM_MAPPED_MB", value: 29)
!42 = !DIEnumerator(name: "GUESTLIB_HOST_MEM_UNMAPPED_MB", value: 30)
!43 = !DIEnumerator(name: "GUESTLIB_MEM_ZIPPED_MB", value: 31)
!44 = !DIEnumerator(name: "GUESTLIB_MEM_ZIPSAVED_MB", value: 32)
!45 = !DIEnumerator(name: "GUESTLIB_MEM_LLSWAPPED_MB", value: 33)
!46 = !DIEnumerator(name: "GUESTLIB_MEM_SWAP_TARGET_MB", value: 34)
!47 = !DIEnumerator(name: "GUESTLIB_MEM_BALLOON_TARGET_MB", value: 35)
!48 = !DIEnumerator(name: "GUESTLIB_MEM_BALLOON_MAX_MB", value: 36)
!49 = !DIEnumerator(name: "GUESTLIB_RESOURCE_POOL_PATH_LONG", value: 37)
!50 = !DIEnumerator(name: "GUESTLIB_MAX_STATISTIC_ID", value: 38)
!51 = !{!52, !55, !61}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !57, line: 35, baseType: !58)
!57 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1321")
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !59, line: 32, baseType: !60)
!59 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1321")
!60 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "enum_t", file: !63, line: 38, baseType: !64)
!63 = !DIFile(filename: "/usr/include/rpc/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1321")
!64 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!65 = !{i32 2, !"Dwarf Version", i32 4}
!66 = !{i32 2, !"Debug Info Version", i32 3}
!67 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!68 = distinct !DISubprogram(name: "xdr_GuestLibV3StatUint32", scope: !69, file: !69, line: 9, type: !70, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !151)
!69 = !DIFile(filename: "guestlibV3_xdr.c", directory: "/home/lichi/Desktop/open-vm-tools/line1321")
!70 = !DISubroutineType(types: !71)
!71 = !{!72, !73, !140}
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool_t", file: !63, line: 37, baseType: !64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDR", file: !4, line: 109, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "XDR", file: !4, line: 110, size: 384, align: 64, elements: !76)
!76 = !{!77, !78, !136, !137, !138, !139}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "x_op", scope: !75, file: !4, line: 112, baseType: !3, size: 32, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "x_ops", scope: !75, file: !4, line: 136, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdr_ops", file: !4, line: 113, size: 640, align: 64, elements: !81)
!81 = !{!82, !88, !94, !100, !106, !112, !116, !122, !126, !130}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "x_getlong", scope: !80, file: !4, line: 115, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!72, !73, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "x_putlong", scope: !80, file: !4, line: 117, baseType: !89, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!72, !73, !92}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "x_getbytes", scope: !80, file: !4, line: 119, baseType: !95, size: 64, align: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!72, !73, !98, !56}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !57, line: 116, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__caddr_t", file: !59, line: 183, baseType: !53)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "x_putbytes", scope: !80, file: !4, line: 121, baseType: !101, size: 64, align: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!72, !73, !104, !56}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "x_getpostn", scope: !80, file: !4, line: 123, baseType: !107, size: 64, align: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!56, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "x_setpostn", scope: !80, file: !4, line: 125, baseType: !113, size: 64, align: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!72, !73, !56}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "x_inline", scope: !80, file: !4, line: 127, baseType: !117, size: 64, align: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!120, !73, !56}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !57, line: 196, baseType: !64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "x_destroy", scope: !80, file: !4, line: 129, baseType: !123, size: 64, align: 64, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !73}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "x_getint32", scope: !80, file: !4, line: 131, baseType: !127, size: 64, align: 64, offset: 512)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!72, !73, !120}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "x_putint32", scope: !80, file: !4, line: 133, baseType: !131, size: 64, align: 64, offset: 576)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!72, !73, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "x_public", scope: !75, file: !4, line: 137, baseType: !98, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "x_private", scope: !75, file: !4, line: 138, baseType: !98, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "x_base", scope: !75, file: !4, line: 139, baseType: !98, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "x_handy", scope: !75, file: !4, line: 140, baseType: !56, size: 32, align: 32, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestLibV3StatUint32", file: !10, line: 21, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestLibV3StatUint32", file: !10, line: 17, size: 64, align: 32, elements: !143)
!143 = !{!144, !147}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !142, file: !10, line: 18, baseType: !145, size: 8, align: 8)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !146, line: 230, baseType: !54)
!146 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1321")
!147 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !142, file: !10, line: 19, baseType: !148, size: 32, align: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !146, line: 173, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !150, line: 51, baseType: !60)
!150 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line1321")
!151 = !{}
!152 = !DILocalVariable(name: "xdrs", arg: 1, scope: !68, file: !69, line: 9, type: !73)
!153 = !DIExpression()
!154 = !DILocation(line: 9, column: 32, scope: !68)
!155 = !DILocalVariable(name: "objp", arg: 2, scope: !68, file: !69, line: 9, type: !140)
!156 = !DILocation(line: 9, column: 60, scope: !68)
!157 = !DILocation(line: 12, column: 18, scope: !158)
!158 = distinct !DILexicalBlock(scope: !68, file: !69, line: 12, column: 7)
!159 = !DILocation(line: 12, column: 25, scope: !158)
!160 = !DILocation(line: 12, column: 31, scope: !158)
!161 = !DILocation(line: 12, column: 8, scope: !158)
!162 = !DILocation(line: 12, column: 7, scope: !68)
!163 = !DILocation(line: 13, column: 4, scope: !158)
!164 = !DILocation(line: 14, column: 20, scope: !165)
!165 = distinct !DILexicalBlock(scope: !68, file: !69, line: 14, column: 7)
!166 = !DILocation(line: 14, column: 27, scope: !165)
!167 = !DILocation(line: 14, column: 33, scope: !165)
!168 = !DILocation(line: 14, column: 8, scope: !165)
!169 = !DILocation(line: 14, column: 7, scope: !68)
!170 = !DILocation(line: 15, column: 4, scope: !165)
!171 = !DILocation(line: 16, column: 2, scope: !68)
!172 = !DILocation(line: 17, column: 1, scope: !68)
!173 = distinct !DISubprogram(name: "xdr_Bool", scope: !174, file: !174, line: 264, type: !175, isLocal: true, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !151)
!174 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmxrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1321")
!175 = !DISubroutineType(types: !176)
!176 = !{!72, !73, !177}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!178 = !DILocalVariable(name: "xdrs", arg: 1, scope: !173, file: !174, line: 264, type: !73)
!179 = !DILocation(line: 264, column: 15, scope: !173)
!180 = !DILocalVariable(name: "ip", arg: 2, scope: !173, file: !174, line: 265, type: !177)
!181 = !DILocation(line: 265, column: 16, scope: !173)
!182 = !DILocation(line: 267, column: 20, scope: !173)
!183 = !DILocation(line: 267, column: 26, scope: !173)
!184 = !DILocation(line: 267, column: 11, scope: !173)
!185 = !DILocation(line: 267, column: 4, scope: !173)
!186 = distinct !DISubprogram(name: "xdr_uint32", scope: !174, file: !174, line: 191, type: !187, isLocal: true, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !151)
!187 = !DISubroutineType(types: !188)
!188 = !{!72, !73, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!190 = !DILocalVariable(name: "xdrs", arg: 1, scope: !186, file: !174, line: 191, type: !73)
!191 = !DILocation(line: 191, column: 17, scope: !186)
!192 = !DILocalVariable(name: "ip", arg: 2, scope: !186, file: !174, line: 192, type: !189)
!193 = !DILocation(line: 192, column: 20, scope: !186)
!194 = !DILocation(line: 194, column: 24, scope: !186)
!195 = !DILocation(line: 194, column: 30, scope: !186)
!196 = !DILocation(line: 194, column: 11, scope: !186)
!197 = !DILocation(line: 194, column: 4, scope: !186)
!198 = distinct !DISubprogram(name: "xdr_GuestLibV3StatUint64", scope: !69, file: !69, line: 20, type: !199, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !151)
!199 = !DISubroutineType(types: !200)
!200 = !{!72, !73, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestLibV3StatUint64", file: !10, line: 27, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestLibV3StatUint64", file: !10, line: 23, size: 128, align: 64, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !203, file: !10, line: 24, baseType: !145, size: 8, align: 8)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !203, file: !10, line: 25, baseType: !207, size: 64, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !146, line: 171, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !150, line: 55, baseType: !209)
!209 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!210 = !DILocalVariable(name: "xdrs", arg: 1, scope: !198, file: !69, line: 20, type: !73)
!211 = !DILocation(line: 20, column: 32, scope: !198)
!212 = !DILocalVariable(name: "objp", arg: 2, scope: !198, file: !69, line: 20, type: !201)
!213 = !DILocation(line: 20, column: 60, scope: !198)
!214 = !DILocation(line: 23, column: 18, scope: !215)
!215 = distinct !DILexicalBlock(scope: !198, file: !69, line: 23, column: 7)
!216 = !DILocation(line: 23, column: 25, scope: !215)
!217 = !DILocation(line: 23, column: 31, scope: !215)
!218 = !DILocation(line: 23, column: 8, scope: !215)
!219 = !DILocation(line: 23, column: 7, scope: !198)
!220 = !DILocation(line: 24, column: 4, scope: !215)
!221 = !DILocation(line: 25, column: 20, scope: !222)
!222 = distinct !DILexicalBlock(scope: !198, file: !69, line: 25, column: 7)
!223 = !DILocation(line: 25, column: 27, scope: !222)
!224 = !DILocation(line: 25, column: 33, scope: !222)
!225 = !DILocation(line: 25, column: 8, scope: !222)
!226 = !DILocation(line: 25, column: 7, scope: !198)
!227 = !DILocation(line: 26, column: 4, scope: !222)
!228 = !DILocation(line: 27, column: 2, scope: !198)
!229 = !DILocation(line: 28, column: 1, scope: !198)
!230 = distinct !DISubprogram(name: "xdr_uint64", scope: !174, file: !174, line: 239, type: !231, isLocal: true, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !151)
!231 = !DISubroutineType(types: !232)
!232 = !{!72, !73, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!234 = !DILocalVariable(name: "xdrs", arg: 1, scope: !230, file: !174, line: 239, type: !73)
!235 = !DILocation(line: 239, column: 17, scope: !230)
!236 = !DILocalVariable(name: "ip", arg: 2, scope: !230, file: !174, line: 240, type: !233)
!237 = !DILocation(line: 240, column: 20, scope: !230)
!238 = !DILocation(line: 242, column: 24, scope: !230)
!239 = !DILocation(line: 242, column: 30, scope: !230)
!240 = !DILocation(line: 242, column: 11, scope: !230)
!241 = !DILocation(line: 242, column: 4, scope: !230)
!242 = distinct !DISubprogram(name: "xdr_GuestLibV3String", scope: !69, file: !69, line: 31, type: !243, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !151)
!243 = !DISubroutineType(types: !244)
!244 = !{!72, !73, !245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestLibV3String", file: !10, line: 34, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestLibV3String", file: !10, line: 30, size: 128, align: 64, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !247, file: !10, line: 31, baseType: !145, size: 8, align: 8)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !247, file: !10, line: 32, baseType: !53, size: 64, align: 64, offset: 64)
!251 = !DILocalVariable(name: "xdrs", arg: 1, scope: !242, file: !69, line: 31, type: !73)
!252 = !DILocation(line: 31, column: 28, scope: !242)
!253 = !DILocalVariable(name: "objp", arg: 2, scope: !242, file: !69, line: 31, type: !245)
!254 = !DILocation(line: 31, column: 52, scope: !242)
!255 = !DILocation(line: 34, column: 18, scope: !256)
!256 = distinct !DILexicalBlock(scope: !242, file: !69, line: 34, column: 7)
!257 = !DILocation(line: 34, column: 25, scope: !256)
!258 = !DILocation(line: 34, column: 31, scope: !256)
!259 = !DILocation(line: 34, column: 8, scope: !256)
!260 = !DILocation(line: 34, column: 7, scope: !242)
!261 = !DILocation(line: 35, column: 4, scope: !256)
!262 = !DILocation(line: 36, column: 20, scope: !263)
!263 = distinct !DILexicalBlock(scope: !242, file: !69, line: 36, column: 7)
!264 = !DILocation(line: 36, column: 27, scope: !263)
!265 = !DILocation(line: 36, column: 33, scope: !263)
!266 = !DILocation(line: 36, column: 8, scope: !263)
!267 = !DILocation(line: 36, column: 7, scope: !242)
!268 = !DILocation(line: 37, column: 4, scope: !263)
!269 = !DILocation(line: 38, column: 2, scope: !242)
!270 = !DILocation(line: 39, column: 1, scope: !242)
!271 = distinct !DISubprogram(name: "xdr_GuestLibV3ByteArray", scope: !69, file: !69, line: 42, type: !272, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !151)
!272 = !DISubroutineType(types: !273)
!273 = !{!72, !73, !274}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestLibV3ByteArray", file: !10, line: 43, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestLibV3ByteArray", file: !10, line: 36, size: 192, align: 64, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !276, file: !10, line: 37, baseType: !145, size: 8, align: 8)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !276, file: !10, line: 41, baseType: !280, size: 128, align: 64, offset: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !276, file: !10, line: 38, size: 128, align: 64, elements: !281)
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "value_len", scope: !280, file: !10, line: 39, baseType: !56, size: 32, align: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "value_val", scope: !280, file: !10, line: 40, baseType: !53, size: 64, align: 64, offset: 64)
!284 = !DILocalVariable(name: "xdrs", arg: 1, scope: !271, file: !69, line: 42, type: !73)
!285 = !DILocation(line: 42, column: 31, scope: !271)
!286 = !DILocalVariable(name: "objp", arg: 2, scope: !271, file: !69, line: 42, type: !274)
!287 = !DILocation(line: 42, column: 58, scope: !271)
!288 = !DILocation(line: 45, column: 18, scope: !289)
!289 = distinct !DILexicalBlock(scope: !271, file: !69, line: 45, column: 7)
!290 = !DILocation(line: 45, column: 25, scope: !289)
!291 = !DILocation(line: 45, column: 31, scope: !289)
!292 = !DILocation(line: 45, column: 8, scope: !289)
!293 = !DILocation(line: 45, column: 7, scope: !271)
!294 = !DILocation(line: 46, column: 4, scope: !289)
!295 = !DILocation(line: 47, column: 19, scope: !296)
!296 = distinct !DILexicalBlock(scope: !271, file: !69, line: 47, column: 7)
!297 = !DILocation(line: 47, column: 35, scope: !296)
!298 = !DILocation(line: 47, column: 41, scope: !296)
!299 = !DILocation(line: 47, column: 47, scope: !296)
!300 = !DILocation(line: 47, column: 69, scope: !296)
!301 = !DILocation(line: 47, column: 75, scope: !296)
!302 = !DILocation(line: 47, column: 81, scope: !296)
!303 = !DILocation(line: 47, column: 8, scope: !296)
!304 = !DILocation(line: 47, column: 7, scope: !271)
!305 = !DILocation(line: 48, column: 4, scope: !296)
!306 = !DILocation(line: 49, column: 2, scope: !271)
!307 = !DILocation(line: 50, column: 1, scope: !271)
!308 = distinct !DISubprogram(name: "xdr_GuestLibV3StatCount", scope: !69, file: !69, line: 53, type: !309, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !151)
!309 = !DISubroutineType(types: !310)
!310 = !{!72, !73, !311}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestLibV3StatCount", file: !10, line: 45, baseType: !148)
!313 = !DILocalVariable(name: "xdrs", arg: 1, scope: !308, file: !69, line: 53, type: !73)
!314 = !DILocation(line: 53, column: 31, scope: !308)
!315 = !DILocalVariable(name: "objp", arg: 2, scope: !308, file: !69, line: 53, type: !311)
!316 = !DILocation(line: 53, column: 58, scope: !308)
!317 = !DILocation(line: 56, column: 20, scope: !318)
!318 = distinct !DILexicalBlock(scope: !308, file: !69, line: 56, column: 7)
!319 = !DILocation(line: 56, column: 26, scope: !318)
!320 = !DILocation(line: 56, column: 8, scope: !318)
!321 = !DILocation(line: 56, column: 7, scope: !308)
!322 = !DILocation(line: 57, column: 4, scope: !318)
!323 = !DILocation(line: 58, column: 2, scope: !308)
!324 = !DILocation(line: 59, column: 1, scope: !308)
!325 = distinct !DISubprogram(name: "xdr_GuestLibV3TypeIds", scope: !69, file: !69, line: 62, type: !326, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !151)
!326 = !DISubroutineType(types: !327)
!327 = !{!72, !73, !328}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestLibV3TypeIds", file: !10, line: 88, baseType: !9)
!330 = !DILocalVariable(name: "xdrs", arg: 1, scope: !325, file: !69, line: 62, type: !73)
!331 = !DILocation(line: 62, column: 29, scope: !325)
!332 = !DILocalVariable(name: "objp", arg: 2, scope: !325, file: !69, line: 62, type: !328)
!333 = !DILocation(line: 62, column: 54, scope: !325)
!334 = !DILocation(line: 65, column: 18, scope: !335)
!335 = distinct !DILexicalBlock(scope: !325, file: !69, line: 65, column: 7)
!336 = !DILocation(line: 65, column: 35, scope: !335)
!337 = !DILocation(line: 65, column: 8, scope: !335)
!338 = !DILocation(line: 65, column: 7, scope: !325)
!339 = !DILocation(line: 66, column: 4, scope: !335)
!340 = !DILocation(line: 67, column: 2, scope: !325)
!341 = !DILocation(line: 68, column: 1, scope: !325)
!342 = distinct !DISubprogram(name: "xdr_GuestLibV3Stat", scope: !69, file: !69, line: 71, type: !343, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !151)
!343 = !DISubroutineType(types: !344)
!344 = !{!72, !73, !345}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestLibV3Stat", file: !10, line: 132, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestLibV3Stat", file: !10, line: 90, size: 256, align: 64, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !347, file: !10, line: 91, baseType: !329, size: 32, align: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "GuestLibV3Stat_u", scope: !347, file: !10, line: 130, baseType: !351, size: 192, align: 64, offset: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !347, file: !10, line: 92, size: 192, align: 64, elements: !352)
!352 = !{!353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "cpuReservationMHz", scope: !351, file: !10, line: 93, baseType: !142, size: 64, align: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "cpuLimitMHz", scope: !351, file: !10, line: 94, baseType: !142, size: 64, align: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "cpuShares", scope: !351, file: !10, line: 95, baseType: !142, size: 64, align: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "cpuUsedMs", scope: !351, file: !10, line: 96, baseType: !203, size: 128, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "hostMHz", scope: !351, file: !10, line: 97, baseType: !142, size: 64, align: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "memReservationMB", scope: !351, file: !10, line: 98, baseType: !142, size: 64, align: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "memLimitMB", scope: !351, file: !10, line: 99, baseType: !142, size: 64, align: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "memShares", scope: !351, file: !10, line: 100, baseType: !142, size: 64, align: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "memMappedMB", scope: !351, file: !10, line: 101, baseType: !142, size: 64, align: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "memActiveMB", scope: !351, file: !10, line: 102, baseType: !142, size: 64, align: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "memOverheadMB", scope: !351, file: !10, line: 103, baseType: !142, size: 64, align: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "memBalloonedMB", scope: !351, file: !10, line: 104, baseType: !142, size: 64, align: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "memSwappedMB", scope: !351, file: !10, line: 105, baseType: !142, size: 64, align: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "memSharedMB", scope: !351, file: !10, line: 106, baseType: !142, size: 64, align: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "memSharedSavedMB", scope: !351, file: !10, line: 107, baseType: !142, size: 64, align: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "memUsedMB", scope: !351, file: !10, line: 108, baseType: !142, size: 64, align: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "elapsedMs", scope: !351, file: !10, line: 109, baseType: !203, size: 128, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "resourcePoolPath", scope: !351, file: !10, line: 110, baseType: !247, size: 128, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "cpuStolenMs", scope: !351, file: !10, line: 111, baseType: !203, size: 128, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "memTargetSizeMB", scope: !351, file: !10, line: 112, baseType: !203, size: 128, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "hostCpuNumCores", scope: !351, file: !10, line: 113, baseType: !142, size: 64, align: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "hostCpuUsedMs", scope: !351, file: !10, line: 114, baseType: !203, size: 128, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "hostMemSwappedMB", scope: !351, file: !10, line: 115, baseType: !203, size: 128, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "hostMemSharedMB", scope: !351, file: !10, line: 116, baseType: !203, size: 128, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "hostMemUsedMB", scope: !351, file: !10, line: 117, baseType: !203, size: 128, align: 64)
