; ModuleID = './fileLockPosix.o.i'
source_filename = "./fileLockPosix.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.MsgList = type { %struct.MsgList*, i8*, i8*, %struct.MsgFmt_Arg*, i32 }
%struct.MsgFmt_Arg = type { i32, i32, %union.anon, %struct.anon, %union.anon.0 }
%union.anon = type { i64 }
%struct.anon = type { i32, i32 }
%union.anon.0 = type { i8* }
%struct.FileLockToken = type opaque
%struct.statfs = type { i64, i64, i64, i64, i64, i64, i64, %struct.__fsid_t, i64, i64, i64, [4 x i64] }
%struct.__fsid_t = type { [2 x i32] }

@.str = private unnamed_addr constant [11 x i8] c"%s/LCK..%s\00", align 1
@.str.1 = private unnamed_addr constant [10 x i8] c"/var/lock\00", align 1
@.str.2 = private unnamed_addr constant [18 x i8] c"%s/LTMP..%s.t%05d\00", align 1
@.str.3 = private unnamed_addr constant [7 x i8] c"%d %s\0A\00", align 1
@.str.4 = private unnamed_addr constant [19 x i8] c"NOT_REACHED %s:%d\0A\00", align 1
@.str.5 = private unnamed_addr constant [16 x i8] c"fileLockPosix.c\00", align 1
@.str.6 = private unnamed_addr constant [40 x i8] c"FILE: Cannot remove lock file %s (%s).\0A\00", align 1

!203 = !DILexicalBlockFile(scope: !117, file: !21, discriminator: 1)
!204 = !DILocation(line: 394, column: 10, scope: !117)
!205 = !DILocation(line: 394, column: 8, scope: !117)
!206 = !DILocation(line: 395, column: 17, scope: !117)
!207 = !DILocation(line: 395, column: 16, scope: !117)
!208 = !DILocation(line: 395, column: 14, scope: !117)
!209 = !DILocation(line: 397, column: 10, scope: !117)
!210 = !DILocation(line: 397, column: 4, scope: !117)
!211 = !DILocation(line: 399, column: 8, scope: !212)
!212 = distinct !DILexicalBlock(scope: !117, file: !21, line: 399, column: 8)
!213 = !DILocation(line: 399, column: 22, scope: !212)
!214 = !DILocation(line: 399, column: 15, scope: !212)
!215 = !DILocation(line: 399, column: 12, scope: !212)
!216 = !DILocation(line: 399, column: 8, scope: !117)
!217 = !DILocation(line: 401, column: 15, scope: !218)
!218 = distinct !DILexicalBlock(scope: !212, file: !21, line: 399, column: 33)
!219 = !DILocation(line: 401, column: 46, scope: !218)
!220 = !DILocation(line: 401, column: 29, scope: !218)
!221 = !DILocation(line: 400, column: 7, scope: !218)
!222 = !DILocation(line: 402, column: 14, scope: !218)
!223 = !DILocation(line: 403, column: 7, scope: !218)
!224 = !DILocation(line: 406, column: 10, scope: !117)
!225 = !DILocation(line: 406, column: 8, scope: !117)
!226 = !DILocation(line: 408, column: 8, scope: !227)
!227 = distinct !DILexicalBlock(scope: !117, file: !21, line: 408, column: 8)
!228 = !DILocation(line: 408, column: 19, scope: !227)
!229 = !DILocation(line: 408, column: 28, scope: !230)
!230 = !DILexicalBlockFile(scope: !227, file: !21, discriminator: 1)
!231 = !DILocation(line: 408, column: 42, scope: !230)
!232 = !DILocation(line: 408, column: 23, scope: !230)
!233 = !DILocation(line: 408, column: 56, scope: !230)
!234 = !DILocation(line: 408, column: 8, scope: !230)
!235 = !DILocation(line: 409, column: 18, scope: !236)
!236 = distinct !DILexicalBlock(scope: !227, file: !21, line: 408, column: 62)
!237 = !DILocation(line: 409, column: 17, scope: !236)
!238 = !DILocation(line: 409, column: 22, scope: !236)
!239 = !DILocation(line: 409, column: 16, scope: !236)
!240 = !DILocation(line: 409, column: 14, scope: !236)
!241 = !DILocation(line: 410, column: 4, scope: !236)
!242 = !DILocation(line: 412, column: 20, scope: !117)
!243 = !DILocation(line: 412, column: 4, scope: !117)
!244 = !DILocation(line: 415, column: 8, scope: !245)
!245 = distinct !DILexicalBlock(scope: !117, file: !21, line: 415, column: 8)
!246 = !DILocation(line: 415, column: 8, scope: !117)
!247 = !DILocation(line: 416, column: 13, scope: !248)
!248 = distinct !DILexicalBlock(scope: !245, file: !21, line: 415, column: 20)
!249 = !DILocation(line: 416, column: 11, scope: !248)
!250 = !DILocation(line: 417, column: 20, scope: !248)
!251 = !DILocation(line: 417, column: 13, scope: !248)
!252 = !DILocation(line: 417, column: 11, scope: !248)
!253 = !DILocation(line: 418, column: 23, scope: !248)
!254 = !DILocation(line: 418, column: 7, scope: !248)
!255 = !DILocation(line: 420, column: 11, scope: !256)
!256 = distinct !DILexicalBlock(scope: !248, file: !21, line: 420, column: 11)
!257 = !DILocation(line: 420, column: 15, scope: !256)
!258 = !DILocation(line: 420, column: 11, scope: !248)
!259 = !DILocation(line: 422, column: 18, scope: !260)
!260 = distinct !DILexicalBlock(scope: !256, file: !21, line: 420, column: 20)
!261 = !DILocation(line: 422, column: 50, scope: !260)
!262 = !DILocation(line: 422, column: 49, scope: !260)
!263 = !DILocation(line: 422, column: 32, scope: !264)
!264 = !DILexicalBlockFile(scope: !260, file: !21, discriminator: 1)
!265 = !DILocation(line: 421, column: 10, scope: !260)
!266 = !DILocation(line: 423, column: 7, scope: !260)
!267 = !DILocation(line: 425, column: 4, scope: !248)
!268 = !DILocation(line: 427, column: 11, scope: !117)
!269 = !DILocation(line: 427, column: 4, scope: !117)
!270 = !DILocation(line: 428, column: 1, scope: !117)
!271 = distinct !DISubprogram(name: "GetLockFileValues", scope: !21, file: !21, line: 234, type: !272, isLocal: true, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!272 = !DISubroutineType(types: !273)
!273 = !{!24, !25, !274, !40}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!275 = !DILocalVariable(name: "lockFileName", arg: 1, scope: !271, file: !21, line: 234, type: !25)
!276 = !DILocation(line: 234, column: 31, scope: !271)
!277 = !DILocalVariable(name: "pid", arg: 2, scope: !271, file: !21, line: 235, type: !274)
!278 = !DILocation(line: 235, column: 24, scope: !271)
!279 = !DILocalVariable(name: "hostID", arg: 3, scope: !271, file: !21, line: 236, type: !40)
!280 = !DILocation(line: 236, column: 25, scope: !271)
!281 = !DILocalVariable(name: "p", scope: !271, file: !21, line: 238, type: !40)
!282 = !DILocation(line: 238, column: 10, scope: !271)
!283 = !DILocalVariable(name: "saveErrno", scope: !271, file: !21, line: 239, type: !24)
!284 = !DILocation(line: 239, column: 8, scope: !271)
!285 = !DILocalVariable(name: "lockFile", scope: !271, file: !21, line: 240, type: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !288, line: 48, baseType: !289)
!288 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line219")
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !290, line: 241, size: 1728, align: 64, elements: !291)
!290 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line219")
!291 = !{!292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !312, !313, !314, !315, !318, !320, !322, !326, !329, !331, !332, !333, !334, !335, !339, !340}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !289, file: !290, line: 242, baseType: !24, size: 32, align: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !289, file: !290, line: 247, baseType: !40, size: 64, align: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !289, file: !290, line: 248, baseType: !40, size: 64, align: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !289, file: !290, line: 249, baseType: !40, size: 64, align: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !289, file: !290, line: 250, baseType: !40, size: 64, align: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !289, file: !290, line: 251, baseType: !40, size: 64, align: 64, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !289, file: !290, line: 252, baseType: !40, size: 64, align: 64, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !289, file: !290, line: 253, baseType: !40, size: 64, align: 64, offset: 448)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !289, file: !290, line: 254, baseType: !40, size: 64, align: 64, offset: 512)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !289, file: !290, line: 256, baseType: !40, size: 64, align: 64, offset: 576)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !289, file: !290, line: 257, baseType: !40, size: 64, align: 64, offset: 640)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !289, file: !290, line: 258, baseType: !40, size: 64, align: 64, offset: 704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !289, file: !290, line: 260, baseType: !305, size: 64, align: 64, offset: 768)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !290, line: 156, size: 192, align: 64, elements: !307)
!307 = !{!308, !309, !311}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !306, file: !290, line: 157, baseType: !305, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !306, file: !290, line: 158, baseType: !310, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !306, file: !290, line: 162, baseType: !24, size: 32, align: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !289, file: !290, line: 262, baseType: !310, size: 64, align: 64, offset: 832)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !289, file: !290, line: 264, baseType: !24, size: 32, align: 32, offset: 896)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !289, file: !290, line: 268, baseType: !24, size: 32, align: 32, offset: 928)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !289, file: !290, line: 270, baseType: !316, size: 64, align: 64, offset: 960)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !144, line: 131, baseType: !317)
!317 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !289, file: !290, line: 274, baseType: !319, size: 16, align: 16, offset: 1024)
!319 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !289, file: !290, line: 275, baseType: !321, size: 8, align: 8, offset: 1040)
!321 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !289, file: !290, line: 276, baseType: !323, size: 8, align: 8, offset: 1048)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, align: 8, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 1)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !289, file: !290, line: 280, baseType: !327, size: 64, align: 64, offset: 1088)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !290, line: 150, baseType: null)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !289, file: !290, line: 289, baseType: !330, size: 64, align: 64, offset: 1152)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !144, line: 132, baseType: !317)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !289, file: !290, line: 297, baseType: !10, size: 64, align: 64, offset: 1216)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !289, file: !290, line: 298, baseType: !10, size: 64, align: 64, offset: 1280)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !289, file: !290, line: 299, baseType: !10, size: 64, align: 64, offset: 1344)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !289, file: !290, line: 300, baseType: !10, size: 64, align: 64, offset: 1408)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !289, file: !290, line: 302, baseType: !336, size: 64, align: 64, offset: 1472)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !337, line: 216, baseType: !338)
!337 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line219")
!338 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !289, file: !290, line: 303, baseType: !24, size: 32, align: 32, offset: 1536)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !289, file: !290, line: 305, baseType: !341, size: 160, align: 8, offset: 1568)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, align: 8, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 20)
!344 = !DILocation(line: 240, column: 10, scope: !271)
!345 = !DILocalVariable(name: "line", scope: !271, file: !21, line: 241, type: !35)
!346 = !DILocation(line: 241, column: 9, scope: !271)
!347 = !DILocalVariable(name: "deleteLockFile", scope: !271, file: !21, line: 242, type: !135)
!348 = !DILocation(line: 242, column: 9, scope: !271)
!349 = !DILocalVariable(name: "uid", scope: !271, file: !21, line: 243, type: !141)
!350 = !DILocation(line: 243, column: 10, scope: !271)
!351 = !DILocalVariable(name: "status", scope: !271, file: !21, line: 244, type: !24)
!352 = !DILocation(line: 244, column: 8, scope: !271)
!353 = !DILocation(line: 250, column: 10, scope: !271)
!354 = !DILocation(line: 250, column: 8, scope: !271)
!355 = !DILocation(line: 251, column: 27, scope: !271)
!356 = !DILocation(line: 251, column: 15, scope: !271)
!357 = !DILocation(line: 251, column: 13, scope: !271)
!358 = !DILocation(line: 252, column: 17, scope: !271)
!359 = !DILocation(line: 252, column: 16, scope: !271)
!360 = !DILocation(line: 252, column: 14, scope: !271)
!361 = !DILocation(line: 253, column: 20, scope: !271)
!362 = !DILocation(line: 253, column: 4, scope: !271)
!363 = !DILocation(line: 255, column: 8, scope: !364)
!364 = distinct !DILexicalBlock(scope: !271, file: !21, line: 255, column: 8)
!365 = !DILocation(line: 255, column: 17, scope: !364)
!366 = !DILocation(line: 255, column: 8, scope: !271)
!367 = !DILocation(line: 257, column: 15, scope: !368)
!368 = distinct !DILexicalBlock(scope: !364, file: !21, line: 255, column: 25)
!369 = !DILocation(line: 257, column: 46, scope: !368)
!370 = !DILocation(line: 257, column: 29, scope: !368)
!371 = !DILocation(line: 256, column: 7, scope: !368)
!372 = !DILocation(line: 259, column: 15, scope: !368)
!373 = !DILocation(line: 259, column: 25, scope: !368)
!374 = !DILocation(line: 259, column: 14, scope: !368)
!375 = !DILocation(line: 259, column: 7, scope: !368)
!376 = !DILocation(line: 262, column: 14, scope: !271)
!377 = !DILocation(line: 262, column: 33, scope: !271)
!378 = !DILocation(line: 262, column: 8, scope: !271)
!379 = !DILocation(line: 262, column: 6, scope: !271)
!380 = !DILocation(line: 263, column: 17, scope: !271)
!381 = !DILocation(line: 263, column: 16, scope: !271)
!382 = !DILocation(line: 263, column: 14, scope: !271)
!383 = !DILocation(line: 265, column: 11, scope: !271)
!384 = !DILocation(line: 265, column: 4, scope: !271)
!385 = !DILocation(line: 267, column: 8, scope: !386)
!386 = distinct !DILexicalBlock(scope: !271, file: !21, line: 267, column: 8)
!387 = !DILocation(line: 267, column: 10, scope: !386)
!388 = !DILocation(line: 267, column: 8, scope: !271)
!389 = !DILocation(line: 269, column: 15, scope: !390)
!390 = distinct !DILexicalBlock(scope: !386, file: !21, line: 267, column: 18)
!391 = !DILocation(line: 269, column: 46, scope: !390)
!392 = !DILocation(line: 269, column: 29, scope: !390)
!393 = !DILocation(line: 268, column: 7, scope: !390)
!394 = !DILocation(line: 271, column: 22, scope: !390)
!395 = !DILocation(line: 272, column: 4, scope: !390)
!396 = !DILocation(line: 273, column: 22, scope: !397)
!397 = distinct !DILexicalBlock(scope: !386, file: !21, line: 272, column: 11)
!398 = !DILocation(line: 273, column: 40, scope: !397)
!399 = !DILocation(line: 273, column: 45, scope: !397)
!400 = !DILocation(line: 273, column: 15, scope: !397)
!401 = !DILocation(line: 273, column: 7, scope: !397)
!402 = !DILocation(line: 276, column: 25, scope: !403)
!403 = distinct !DILexicalBlock(scope: !397, file: !21, line: 273, column: 54)
!404 = !DILocation(line: 277, column: 10, scope: !403)
!405 = !DILocation(line: 277, column: 10, scope: !406)
!406 = !DILexicalBlockFile(scope: !403, file: !21, discriminator: 1)
!407 = !DILocation(line: 281, column: 61, scope: !403)
!408 = !DILocation(line: 281, column: 10, scope: !403)
!409 = !DILocation(line: 282, column: 25, scope: !403)
!410 = !DILocation(line: 283, column: 7, scope: !403)
!411 = !DILocation(line: 286, column: 11, scope: !271)
!412 = !DILocation(line: 287, column: 8, scope: !413)
!413 = distinct !DILexicalBlock(scope: !271, file: !21, line: 287, column: 8)
!414 = !DILocation(line: 287, column: 8, scope: !271)
!415 = !DILocation(line: 288, column: 14, scope: !416)
!416 = distinct !DILexicalBlock(scope: !413, file: !21, line: 287, column: 24)
!417 = !DILocation(line: 289, column: 32, scope: !418)
!418 = distinct !DILexicalBlock(scope: !416, file: !21, line: 289, column: 11)
!419 = !DILocation(line: 289, column: 12, scope: !418)
!420 = !DILocation(line: 289, column: 11, scope: !416)
!421 = !DILocation(line: 290, column: 17, scope: !422)
!422 = distinct !DILexicalBlock(scope: !418, file: !21, line: 289, column: 47)
!423 = !DILocation(line: 291, column: 7, scope: !422)
!424 = !DILocation(line: 292, column: 4, scope: !416)
!425 = !DILocation(line: 294, column: 11, scope: !271)
!426 = !DILocation(line: 294, column: 4, scope: !271)
!427 = !DILocation(line: 295, column: 1, scope: !271)
!428 = distinct !DISubprogram(name: "FileLockIsValidProcess", scope: !21, file: !21, line: 316, type: !429, isLocal: true, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!429 = !DISubroutineType(types: !430)
!430 = !{!135, !24}
!431 = !DILocalVariable(name: "pid", arg: 1, scope: !428, file: !21, line: 316, type: !24)
!432 = !DILocation(line: 316, column: 28, scope: !428)
!433 = !DILocalVariable(name: "value", scope: !428, file: !21, line: 318, type: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "HostinfoProcessQuery", file: !4, line: 46, baseType: !3)
!435 = !DILocation(line: 318, column: 25, scope: !428)
!436 = !DILocation(line: 318, column: 64, scope: !428)
!437 = !DILocation(line: 318, column: 33, scope: !428)
!438 = !DILocation(line: 320, column: 8, scope: !439)
!439 = distinct !DILexicalBlock(scope: !428, file: !21, line: 320, column: 8)
!440 = !DILocation(line: 320, column: 14, scope: !439)
!441 = !DILocation(line: 320, column: 8, scope: !428)
!442 = !DILocation(line: 321, column: 7, scope: !443)
!443 = distinct !DILexicalBlock(scope: !439, file: !21, line: 320, column: 49)
!444 = !DILocation(line: 324, column: 12, scope: !428)
!445 = !DILocation(line: 324, column: 18, scope: !428)
!446 = !DILocation(line: 324, column: 11, scope: !428)
!447 = !DILocation(line: 324, column: 4, scope: !428)
!448 = !DILocation(line: 325, column: 1, scope: !428)
!449 = distinct !DISubprogram(name: "RemoveStaleLockFile", scope: !21, file: !21, line: 189, type: !450, isLocal: true, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!450 = !DISubroutineType(types: !451)
!451 = !{!135, !25}
!452 = !DILocalVariable(name: "lockFileName", arg: 1, scope: !449, file: !21, line: 189, type: !25)
!453 = !DILocation(line: 189, column: 33, scope: !449)
!454 = !DILocalVariable(name: "uid", scope: !449, file: !21, line: 191, type: !141)
!455 = !DILocation(line: 191, column: 10, scope: !449)
!456 = !DILocalVariable(name: "ret", scope: !449, file: !21, line: 192, type: !24)
!457 = !DILocation(line: 192, column: 8, scope: !449)
!458 = !DILocalVariable(name: "saveErrno", scope: !449, file: !21, line: 193, type: !24)
!459 = !DILocation(line: 193, column: 8, scope: !449)
!460 = !DILocation(line: 199, column: 47, scope: !449)
!461 = !DILocation(line: 198, column: 4, scope: !449)
!462 = !DILocation(line: 201, column: 10, scope: !449)
!463 = !DILocation(line: 201, column: 8, scope: !449)
!464 = !DILocation(line: 202, column: 17, scope: !449)
!465 = !DILocation(line: 202, column: 10, scope: !449)
!466 = !DILocation(line: 202, column: 8, scope: !449)
!467 = !DILocation(line: 203, column: 17, scope: !449)
!468 = !DILocation(line: 203, column: 16, scope: !449)
!469 = !DILocation(line: 203, column: 14, scope: !449)
!470 = !DILocation(line: 204, column: 20, scope: !449)
!471 = !DILocation(line: 204, column: 4, scope: !449)
!472 = !DILocation(line: 206, column: 8, scope: !473)
!473 = distinct !DILexicalBlock(scope: !449, file: !21, line: 206, column: 8)
!474 = !DILocation(line: 206, column: 12, scope: !473)
!475 = !DILocation(line: 206, column: 8, scope: !449)
!476 = !DILocation(line: 208, column: 15, scope: !477)
!477 = distinct !DILexicalBlock(scope: !473, file: !21, line: 206, column: 17)
!478 = !DILocation(line: 208, column: 46, scope: !477)
!479 = !DILocation(line: 208, column: 29, scope: !477)
!480 = !DILocation(line: 207, column: 7, scope: !477)
!481 = !DILocation(line: 210, column: 7, scope: !477)
!482 = !DILocation(line: 213, column: 4, scope: !449)
!483 = !DILocation(line: 214, column: 1, scope: !449)
!484 = distinct !DISubprogram(name: "Posix_Free", scope: !485, file: !485, line: 129, type: !486, isLocal: true, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!485 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/posix.h", directory: "/home/lichi/Desktop/open-vm-tools/line219")
!486 = !DISubroutineType(types: !487)
!487 = !{null, !10}
!488 = !DILocalVariable(name: "p", arg: 1, scope: !484, file: !485, line: 129, type: !10)
!489 = !DILocation(line: 129, column: 18, scope: !484)
!490 = !DILocalVariable(name: "err", scope: !484, file: !485, line: 131, type: !24)
!491 = !DILocation(line: 131, column: 8, scope: !484)
!492 = !DILocation(line: 131, column: 15, scope: !484)
!493 = !DILocation(line: 131, column: 14, scope: !484)
!494 = !DILocation(line: 132, column: 9, scope: !484)
!495 = !DILocation(line: 132, column: 4, scope: !484)
!496 = !DILocation(line: 133, column: 11, scope: !484)
!497 = !DILocation(line: 133, column: 5, scope: !484)
!498 = !DILocation(line: 133, column: 9, scope: !484)
!499 = !DILocation(line: 134, column: 1, scope: !484)
!500 = distinct !DISubprogram(name: "FileLock_UnlockDevice", scope: !21, file: !21, line: 544, type: !450, isLocal: false, isDefinition: true, scopeLine: 545, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!501 = !DILocalVariable(name: "deviceName", arg: 1, scope: !500, file: !21, line: 544, type: !25)
!502 = !DILocation(line: 544, column: 35, scope: !500)
!503 = !DILocalVariable(name: "uid", scope: !500, file: !21, line: 546, type: !141)
!504 = !DILocation(line: 546, column: 10, scope: !500)
!505 = !DILocalVariable(name: "ret", scope: !500, file: !21, line: 547, type: !24)
!506 = !DILocation(line: 547, column: 8, scope: !500)
!507 = !DILocalVariable(name: "saveErrno", scope: !500, file: !21, line: 548, type: !24)
!508 = !DILocation(line: 548, column: 8, scope: !500)
!509 = !DILocalVariable(name: "path", scope: !500, file: !21, line: 549, type: !40)
!510 = !DILocation(line: 549, column: 10, scope: !500)
!511 = !DILocation(line: 553, column: 60, scope: !500)
!512 = !DILocation(line: 553, column: 11, scope: !500)
!513 = !DILocation(line: 553, column: 9, scope: !500)
!514 = !DILocation(line: 557, column: 10, scope: !500)
!515 = !DILocation(line: 557, column: 8, scope: !500)
!516 = !DILocation(line: 558, column: 17, scope: !500)
!517 = !DILocation(line: 558, column: 10, scope: !500)
!518 = !DILocation(line: 558, column: 8, scope: !500)
!519 = !DILocation(line: 559, column: 17, scope: !500)
!520 = !DILocation(line: 559, column: 16, scope: !500)
!521 = !DILocation(line: 559, column: 14, scope: !500)
!522 = !DILocation(line: 560, column: 20, scope: !500)
!523 = !DILocation(line: 560, column: 4, scope: !500)
!524 = !DILocation(line: 562, column: 8, scope: !525)
!525 = distinct !DILexicalBlock(scope: !500, file: !21, line: 562, column: 8)
!526 = !DILocation(line: 562, column: 12, scope: !525)
!527 = !DILocation(line: 562, column: 8, scope: !500)
!528 = !DILocation(line: 564, column: 11, scope: !529)
!529 = distinct !DILexicalBlock(scope: !525, file: !21, line: 562, column: 17)
!530 = !DILocation(line: 564, column: 34, scope: !529)
!531 = !DILocation(line: 564, column: 17, scope: !529)
!532 = !DILocation(line: 563, column: 7, scope: !529)
!533 = !DILocation(line: 565, column: 18, scope: !529)
!534 = !DILocation(line: 565, column: 7, scope: !529)
!535 = !DILocation(line: 567, column: 7, scope: !529)
!536 = !DILocation(line: 570, column: 15, scope: !500)
!537 = !DILocation(line: 570, column: 4, scope: !500)
!538 = !DILocation(line: 572, column: 4, scope: !500)
!539 = !DILocation(line: 573, column: 1, scope: !500)
!540 = distinct !DISubprogram(name: "FileLockAppendMessage", scope: !21, file: !21, line: 593, type: !541, isLocal: false, isDefinition: true, scopeLine: 595, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !543, !24}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "MsgList", file: !546, line: 48, baseType: !547)
!546 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/msgList.h", directory: "/home/lichi/Desktop/open-vm-tools/line219")
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MsgList", file: !546, line: 49, size: 320, align: 64, elements: !548)
!548 = !{!549, !550, !551, !552, !603}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !547, file: !546, line: 50, baseType: !544, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !547, file: !546, line: 51, baseType: !40, size: 64, align: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !547, file: !546, line: 52, baseType: !40, size: 64, align: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !547, file: !546, line: 53, baseType: !553, size: 64, align: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "MsgFmt_Arg", file: !555, line: 128, baseType: !556)
!555 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/msgfmt.h", directory: "/home/lichi/Desktop/open-vm-tools/line219")
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MsgFmt_Arg", file: !555, line: 102, size: 256, align: 64, elements: !557)
!557 = !{!558, !561, !562, !592, !597}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !556, file: !555, line: 103, baseType: !559, size: 32, align: 32)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32", file: !136, line: 174, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !142, line: 196, baseType: !24)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !556, file: !555, line: 104, baseType: !559, size: 32, align: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !556, file: !555, line: 118, baseType: !563, size: 64, align: 64, offset: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !556, file: !555, line: 105, size: 64, align: 64, elements: !564)
!564 = !{!565, !566, !569, !573, !576, !578, !579, !583, !588, !590, !591}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "signed32", scope: !563, file: !555, line: 106, baseType: !559, size: 32, align: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "signed64", scope: !563, file: !555, line: 107, baseType: !567, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !136, line: 172, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !142, line: 197, baseType: !317)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned32", scope: !563, file: !555, line: 108, baseType: !570, size: 32, align: 32)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !136, line: 173, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !572, line: 51, baseType: !16)
!572 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line219")
!573 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned64", scope: !563, file: !555, line: 109, baseType: !574, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !136, line: 171, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !572, line: 55, baseType: !338)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "float64", scope: !563, file: !555, line: 110, baseType: !577, size: 64, align: 64)
!577 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "string8char", scope: !563, file: !555, line: 111, baseType: !40, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "string8", scope: !563, file: !555, line: 112, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8", file: !136, line: 178, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !142, line: 194, baseType: !321)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "string16", scope: !563, file: !555, line: 113, baseType: !584, size: 64, align: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16", file: !136, line: 176, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !142, line: 195, baseType: !587)
!587 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "string32", scope: !563, file: !555, line: 114, baseType: !589, size: 64, align: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !563, file: !555, line: 115, baseType: !559, size: 32, align: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !563, file: !555, line: 117, baseType: !10, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !556, file: !555, line: 122, baseType: !593, size: 64, align: 32, offset: 128)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !556, file: !555, line: 119, size: 64, align: 32, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "platform", scope: !593, file: !555, line: 120, baseType: !559, size: 32, align: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !593, file: !555, line: 121, baseType: !559, size: 32, align: 32, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !556, file: !555, line: 127, baseType: !598, size: 64, align: 64, offset: 192)
!598 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !556, file: !555, line: 123, size: 64, align: 64, elements: !599)
!599 = !{!600, !601, !602}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !598, file: !555, line: 124, baseType: !559, size: 32, align: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "localString", scope: !598, file: !555, line: 125, baseType: !40, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !598, file: !555, line: 126, baseType: !574, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "numArgs", scope: !547, file: !546, line: 54, baseType: !24, size: 32, align: 32, offset: 256)
!604 = !DILocalVariable(name: "msgs", arg: 1, scope: !540, file: !21, line: 593, type: !543)
!605 = !DILocation(line: 593, column: 33, scope: !540)
!606 = !DILocalVariable(name: "err", arg: 2, scope: !540, file: !21, line: 594, type: !24)
!607 = !DILocation(line: 594, column: 27, scope: !540)
!608 = !DILocation(line: 598, column: 8, scope: !540)
!609 = !DILocation(line: 598, column: 30, scope: !540)
!610 = !DILocation(line: 598, column: 13, scope: !540)
!611 = !DILocation(line: 597, column: 4, scope: !540)
!612 = !DILocation(line: 604, column: 1, scope: !540)
!613 = distinct !DISubprogram(name: "FileLockGetExecutionID", scope: !21, file: !21, line: 930, type: !614, isLocal: false, isDefinition: true, scopeLine: 931, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!614 = !DISubroutineType(types: !615)
!615 = !{!40}
!616 = !DILocalVariable(name: "descriptor", scope: !613, file: !21, line: 932, type: !40)
!617 = !DILocation(line: 932, column: 10, scope: !613)
!618 = !DILocation(line: 932, column: 49, scope: !613)
!619 = !DILocation(line: 932, column: 23, scope: !620)
!620 = !DILexicalBlockFile(scope: !613, file: !21, discriminator: 1)
!621 = !DILocation(line: 936, column: 11, scope: !613)
!622 = !DILocation(line: 936, column: 4, scope: !613)
!623 = distinct !DISubprogram(name: "FileLockProcessDescriptor", scope: !21, file: !21, line: 692, type: !624, isLocal: true, isDefinition: true, scopeLine: 693, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!624 = !DISubroutineType(types: !625)
!625 = !{!40, !626}
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !142, line: 98, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !144, line: 133, baseType: !24)
!628 = !DILocalVariable(name: "pid", arg: 1, scope: !623, file: !21, line: 692, type: !626)
!629 = !DILocation(line: 692, column: 33, scope: !623)
!630 = !DILocalVariable(name: "path", scope: !623, file: !21, line: 694, type: !631)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 512, align: 8, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 64)
!634 = !DILocation(line: 694, column: 9, scope: !623)
!635 = !DILocalVariable(name: "buffer", scope: !623, file: !21, line: 695, type: !636)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8192, align: 8, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 1024)
!639 = !DILocation(line: 695, column: 9, scope: !623)
!640 = !DILocalVariable(name: "descriptor", scope: !623, file: !21, line: 696, type: !40)
!641 = !DILocation(line: 696, column: 10, scope: !623)
!642 = !DILocation(line: 698, column: 32, scope: !643)
!643 = distinct !DILexicalBlock(scope: !623, file: !21, line: 698, column: 8)
!644 = !DILocation(line: 698, column: 9, scope: !643)
!645 = !DILocation(line: 698, column: 8, scope: !623)
!646 = !DILocation(line: 699, column: 7, scope: !647)
!647 = distinct !DILexicalBlock(scope: !643, file: !21, line: 698, column: 38)
!648 = !DILocation(line: 702, column: 16, scope: !623)
!649 = !DILocation(line: 702, column: 52, scope: !623)
!650 = !DILocation(line: 702, column: 4, scope: !623)
!651 = !DILocation(line: 704, column: 26, scope: !652)
!652 = distinct !DILexicalBlock(scope: !623, file: !21, line: 704, column: 8)
!653 = !DILocation(line: 704, column: 32, scope: !652)
!654 = !DILocation(line: 704, column: 8, scope: !652)
!655 = !DILocation(line: 704, column: 55, scope: !652)
!656 = !DILocation(line: 704, column: 8, scope: !623)
!657 = !DILocalVariable(name: "p", scope: !658, file: !21, line: 705, type: !40)
!658 = distinct !DILexicalBlock(scope: !652, file: !21, line: 704, column: 61)
!659 = !DILocation(line: 705, column: 13, scope: !658)
!660 = !DILocalVariable(name: "q", scope: !658, file: !21, line: 706, type: !40)
!661 = !DILocation(line: 706, column: 13, scope: !658)
!662 = !DILocalVariable(name: "rest", scope: !658, file: !21, line: 707, type: !40)
!663 = !DILocation(line: 707, column: 13, scope: !658)
!664 = !DILocalVariable(name: "argc", scope: !658, file: !21, line: 708, type: !570)
!665 = !DILocation(line: 708, column: 14, scope: !658)
!666 = !DILocalVariable(name: "argv", scope: !658, file: !21, line: 709, type: !667)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1408, align: 64, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 22)
!670 = !DILocation(line: 709, column: 13, scope: !658)
!671 = !DILocalVariable(name: "savePtr", scope: !658, file: !21, line: 710, type: !40)
!672 = !DILocation(line: 710, column: 13, scope: !658)
!673 = !DILocation(line: 723, column: 18, scope: !658)
!674 = !DILocation(line: 723, column: 11, scope: !658)
!675 = !DILocation(line: 723, column: 9, scope: !658)
!676 = !DILocation(line: 725, column: 12, scope: !677)
!677 = distinct !DILexicalBlock(scope: !658, file: !21, line: 725, column: 11)
!678 = !DILocation(line: 725, column: 14, scope: !677)
!679 = !DILocation(line: 725, column: 22, scope: !677)
!680 = !DILocation(line: 725, column: 26, scope: !681)
!681 = !DILexicalBlockFile(scope: !677, file: !21, discriminator: 1)
!682 = !DILocation(line: 725, column: 31, scope: !681)
!683 = !DILocation(line: 725, column: 28, scope: !681)
!684 = !DILocation(line: 725, column: 39, scope: !681)
!685 = !DILocation(line: 725, column: 45, scope: !686)
!686 = !DILexicalBlockFile(scope: !677, file: !21, discriminator: 2)
!687 = !DILocation(line: 725, column: 47, scope: !686)
!688 = !DILocation(line: 725, column: 43, scope: !686)
!689 = !DILocation(line: 725, column: 52, scope: !686)
!690 = !DILocation(line: 725, column: 11, scope: !686)
!691 = !DILocation(line: 726, column: 10, scope: !692)
!692 = distinct !DILexicalBlock(scope: !677, file: !21, line: 725, column: 61)
!693 = !DILocation(line: 729, column: 9, scope: !658)
!694 = !DILocation(line: 729, column: 11, scope: !658)
!695 = !DILocation(line: 729, column: 16, scope: !658)
!696 = !DILocation(line: 731, column: 19, scope: !658)
!697 = !DILocation(line: 731, column: 21, scope: !658)
!698 = !DILocation(line: 731, column: 11, scope: !658)
!699 = !DILocation(line: 731, column: 9, scope: !658)
!700 = !DILocation(line: 732, column: 11, scope: !701)
!701 = distinct !DILexicalBlock(scope: !658, file: !21, line: 732, column: 11)
!702 = !DILocation(line: 732, column: 13, scope: !701)
!703 = !DILocation(line: 732, column: 11, scope: !658)
!704 = !DILocation(line: 733, column: 10, scope: !705)
!705 = distinct !DILexicalBlock(scope: !701, file: !21, line: 732, column: 21)
!706 = !DILocation(line: 736, column: 14, scope: !658)
!707 = !DILocation(line: 736, column: 16, scope: !658)
!708 = !DILocation(line: 736, column: 12, scope: !658)
!709 = !DILocation(line: 737, column: 12, scope: !710)
!710 = distinct !DILexicalBlock(scope: !658, file: !21, line: 737, column: 11)
!711 = !DILocation(line: 737, column: 11, scope: !710)
!712 = !DILocation(line: 737, column: 17, scope: !710)
!713 = !DILocation(line: 737, column: 11, scope: !658)
!714 = !DILocation(line: 738, column: 10, scope: !715)
!715 = distinct !DILexicalBlock(scope: !710, file: !21, line: 737, column: 25)
!716 = !DILocation(line: 741, column: 12, scope: !658)
!717 = !DILocation(line: 741, column: 15, scope: !658)
!718 = !DILocation(line: 743, column: 26, scope: !658)
!719 = !DILocation(line: 743, column: 17, scope: !658)
!720 = !DILocation(line: 743, column: 7, scope: !658)
!721 = !DILocation(line: 743, column: 15, scope: !658)
!722 = !DILocation(line: 744, column: 17, scope: !658)
!723 = !DILocation(line: 744, column: 7, scope: !658)
!724 = !DILocation(line: 744, column: 15, scope: !658)
!725 = !DILocation(line: 747, column: 11, scope: !658)
!726 = !DILocation(line: 747, column: 9, scope: !658)
!727 = !DILocation(line: 749, column: 7, scope: !658)
!728 = !DILocation(line: 749, column: 26, scope: !729)
!729 = !DILexicalBlockFile(scope: !658, file: !21, discriminator: 1)
!730 = !DILocation(line: 749, column: 19, scope: !729)
!731 = !DILocation(line: 749, column: 17, scope: !729)
!732 = !DILocation(line: 749, column: 35, scope: !729)
!733 = !DILocation(line: 749, column: 7, scope: !729)
!734 = !DILocation(line: 750, column: 11, scope: !735)
!735 = distinct !DILexicalBlock(scope: !658, file: !21, line: 749, column: 43)
!736 = !DILocation(line: 750, column: 13, scope: !735)
!737 = !DILocation(line: 749, column: 7, scope: !738)
!738 = !DILexicalBlockFile(scope: !658, file: !21, discriminator: 2)
!739 = distinct !{!739, !727}
!740 = !DILocation(line: 753, column: 18, scope: !741)
!741 = distinct !DILexicalBlock(scope: !658, file: !21, line: 753, column: 11)
!742 = !DILocation(line: 753, column: 11, scope: !741)
!743 = !DILocation(line: 753, column: 21, scope: !741)
!744 = !DILocation(line: 753, column: 11, scope: !658)
!745 = !DILocation(line: 754, column: 10, scope: !746)
!746 = distinct !DILexicalBlock(scope: !741, file: !21, line: 753, column: 27)
!747 = !DILocation(line: 754, column: 20, scope: !746)
!748 = !DILocation(line: 755, column: 10, scope: !746)
!749 = !DILocation(line: 755, column: 16, scope: !746)
!750 = !DILocation(line: 756, column: 7, scope: !746)
!751 = !DILocation(line: 758, column: 17, scope: !752)
!752 = distinct !DILexicalBlock(scope: !658, file: !21, line: 758, column: 7)
!753 = !DILocation(line: 758, column: 12, scope: !752)
!754 = !DILocation(line: 758, column: 22, scope: !755)
!755 = !DILexicalBlockFile(scope: !756, file: !21, discriminator: 1)
!756 = distinct !DILexicalBlock(scope: !752, file: !21, line: 758, column: 7)
!757 = !DILocation(line: 758, column: 27, scope: !755)
!758 = !DILocation(line: 758, column: 7, scope: !755)
!759 = !DILocation(line: 759, column: 33, scope: !760)
!760 = distinct !DILexicalBlock(scope: !756, file: !21, line: 758, column: 41)
!761 = !DILocation(line: 759, column: 38, scope: !760)
!762 = !DILocation(line: 759, column: 32, scope: !760)
!763 = !DILocation(line: 759, column: 46, scope: !764)
!764 = !DILexicalBlockFile(scope: !760, file: !21, discriminator: 1)
!765 = !DILocation(line: 759, column: 32, scope: !764)
!766 = !DILocation(line: 759, column: 32, scope: !767)
!767 = !DILexicalBlockFile(scope: !760, file: !21, discriminator: 2)
!768 = !DILocation(line: 759, column: 32, scope: !769)
!769 = !DILexicalBlockFile(scope: !760, file: !21, discriminator: 3)
!770 = !DILocation(line: 759, column: 23, scope: !769)
!771 = !DILocation(line: 759, column: 15, scope: !769)
!772 = !DILocation(line: 759, column: 10, scope: !769)
!773 = !DILocation(line: 759, column: 21, scope: !769)
!774 = !DILocation(line: 761, column: 19, scope: !775)
!775 = distinct !DILexicalBlock(scope: !760, file: !21, line: 761, column: 14)
!776 = !DILocation(line: 761, column: 14, scope: !775)
!777 = !DILocation(line: 761, column: 25, scope: !775)
!778 = !DILocation(line: 761, column: 14, scope: !760)
!779 = !DILocation(line: 762, column: 13, scope: !780)
!780 = distinct !DILexicalBlock(scope: !775, file: !21, line: 761, column: 33)
!781 = !DILocation(line: 764, column: 7, scope: !760)
!782 = !DILocation(line: 758, column: 37, scope: !783)
!783 = !DILexicalBlockFile(scope: !756, file: !21, discriminator: 2)
!784 = !DILocation(line: 758, column: 7, scope: !783)
!785 = distinct !{!785, !786}
!786 = !DILocation(line: 758, column: 7, scope: !658)
!787 = !DILocation(line: 766, column: 11, scope: !788)
!788 = distinct !DILexicalBlock(scope: !658, file: !21, line: 766, column: 11)
!789 = !DILocation(line: 766, column: 16, scope: !788)
!790 = !DILocation(line: 766, column: 11, scope: !658)
!791 = !DILocation(line: 767, column: 56, scope: !792)
!792 = distinct !DILexicalBlock(scope: !788, file: !21, line: 766, column: 23)
!793 = !DILocation(line: 767, column: 65, scope: !792)
!794 = !DILocation(line: 768, column: 40, scope: !792)
!795 = !DILocation(line: 767, column: 23, scope: !792)
!796 = !DILocation(line: 767, column: 21, scope: !792)
!797 = !DILocation(line: 769, column: 7, scope: !792)
!798 = !DILocation(line: 770, column: 4, scope: !658)
!799 = !DILocation(line: 704, column: 58, scope: !800)
!800 = !DILexicalBlockFile(scope: !652, file: !21, discriminator: 1)
!801 = !DILocation(line: 774, column: 8, scope: !802)
!802 = distinct !DILexicalBlock(scope: !623, file: !21, line: 774, column: 8)
!803 = !DILocation(line: 774, column: 19, scope: !802)
!804 = !DILocation(line: 774, column: 8, scope: !623)
!805 = !DILocation(line: 780, column: 50, scope: !806)
!806 = distinct !DILexicalBlock(scope: !802, file: !21, line: 774, column: 27)
!807 = !DILocation(line: 780, column: 20, scope: !806)
!808 = !DILocation(line: 780, column: 18, scope: !806)
!809 = !DILocation(line: 781, column: 4, scope: !806)
!810 = !DILocation(line: 783, column: 11, scope: !623)
!811 = !DILocation(line: 783, column: 4, scope: !623)
!812 = !DILocation(line: 784, column: 1, scope: !623)
!813 = distinct !DISubprogram(name: "FileLockValidExecutionID", scope: !21, file: !21, line: 997, type: !450, isLocal: false, isDefinition: true, scopeLine: 998, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!814 = !DILocalVariable(name: "executionID", arg: 1, scope: !813, file: !21, line: 997, type: !25)
!815 = !DILocation(line: 997, column: 38, scope: !813)
!816 = !DILocalVariable(name: "filePID", scope: !813, file: !21, line: 999, type: !626)
!817 = !DILocation(line: 999, column: 10, scope: !813)
!818 = !DILocalVariable(name: "procPID", scope: !813, file: !21, line: 1000, type: !626)
!819 = !DILocation(line: 1000, column: 10, scope: !813)
!820 = !DILocalVariable(name: "gotFileData", scope: !813, file: !21, line: 1001, type: !135)
!821 = !DILocation(line: 1001, column: 9, scope: !813)
!822 = !DILocalVariable(name: "gotProcData", scope: !813, file: !21, line: 1002, type: !135)
!823 = !DILocation(line: 1002, column: 9, scope: !813)
!824 = !DILocalVariable(name: "procDescriptor", scope: !813, file: !21, line: 1003, type: !40)
!825 = !DILocation(line: 1003, column: 10, scope: !813)
!826 = !DILocalVariable(name: "fileCreationTime", scope: !813, file: !21, line: 1004, type: !574)
!827 = !DILocation(line: 1004, column: 11, scope: !813)
!828 = !DILocalVariable(name: "procCreationTime", scope: !813, file: !21, line: 1005, type: !574)
!829 = !DILocation(line: 1005, column: 11, scope: !813)
!830 = !DILocation(line: 1007, column: 49, scope: !813)
!831 = !DILocation(line: 1007, column: 18, scope: !813)
!832 = !DILocation(line: 1007, column: 16, scope: !813)
!833 = !DILocation(line: 1010, column: 9, scope: !834)
!834 = distinct !DILexicalBlock(scope: !813, file: !21, line: 1010, column: 8)
!835 = !DILocation(line: 1010, column: 8, scope: !813)
!836 = !DILocation(line: 1012, column: 29, scope: !837)
!837 = distinct !DILexicalBlock(scope: !834, file: !21, line: 1010, column: 22)
!838 = !DILocation(line: 1011, column: 7, scope: !837)
!839 = !DILocation(line: 1014, column: 7, scope: !837)
!840 = !DILocation(line: 1017, column: 47, scope: !813)
!841 = !DILocation(line: 1017, column: 21, scope: !813)
!842 = !DILocation(line: 1017, column: 19, scope: !813)
!843 = !DILocation(line: 1019, column: 8, scope: !844)
!844 = distinct !DILexicalBlock(scope: !813, file: !21, line: 1019, column: 8)
!845 = !DILocation(line: 1019, column: 23, scope: !844)
!846 = !DILocation(line: 1019, column: 8, scope: !813)
!847 = !DILocation(line: 1020, column: 7, scope: !848)
!848 = distinct !DILexicalBlock(scope: !844, file: !21, line: 1019, column: 31)
!849 = !DILocation(line: 1023, column: 49, scope: !813)
!850 = !DILocation(line: 1023, column: 18, scope: !813)
!851 = !DILocation(line: 1023, column: 16, scope: !813)
!852 = !DILocation(line: 1029, column: 15, scope: !813)
!853 = !DILocation(line: 1029, column: 4, scope: !813)
!854 = !DILocation(line: 1031, column: 9, scope: !855)
!855 = distinct !DILexicalBlock(scope: !813, file: !21, line: 1031, column: 8)
!856 = !DILocation(line: 1031, column: 26, scope: !855)
!857 = !DILocation(line: 1031, column: 32, scope: !855)
!858 = !DILocation(line: 1032, column: 9, scope: !855)
!859 = !DILocation(line: 1032, column: 26, scope: !855)
!860 = !DILocation(line: 1032, column: 32, scope: !855)
!861 = !DILocation(line: 1033, column: 9, scope: !855)
!862 = !DILocation(line: 1033, column: 29, scope: !855)
!863 = !DILocation(line: 1033, column: 26, scope: !855)
!864 = !DILocation(line: 1031, column: 8, scope: !865)
!865 = !DILexicalBlockFile(scope: !813, file: !21, discriminator: 1)
!866 = !DILocation(line: 1034, column: 7, scope: !867)
!867 = distinct !DILexicalBlock(scope: !855, file: !21, line: 1033, column: 48)
!868 = !DILocation(line: 1036, column: 7, scope: !869)
!869 = distinct !DILexicalBlock(scope: !855, file: !21, line: 1035, column: 11)
!870 = !DILocation(line: 1038, column: 1, scope: !813)
!871 = distinct !DISubprogram(name: "FileLockParseProcessDescriptor", scope: !21, file: !21, line: 959, type: !872, isLocal: true, isDefinition: true, scopeLine: 962, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!872 = !DISubroutineType(types: !873)
!873 = !{!135, !25, !874, !875}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!876 = !DILocalVariable(name: "procDescriptor", arg: 1, scope: !871, file: !21, line: 959, type: !25)
!877 = !DILocation(line: 959, column: 44, scope: !871)
!878 = !DILocalVariable(name: "pid", arg: 2, scope: !871, file: !21, line: 960, type: !874)
!879 = !DILocation(line: 960, column: 39, scope: !871)
!880 = !DILocalVariable(name: "procCreationTime", arg: 3, scope: !871, file: !21, line: 961, type: !875)
!881 = !DILocation(line: 961, column: 40, scope: !871)
!882 = !DILocation(line: 967, column: 15, scope: !883)
!883 = distinct !DILexicalBlock(scope: !871, file: !21, line: 967, column: 8)
!884 = !DILocation(line: 967, column: 45, scope: !883)
!885 = !DILocation(line: 967, column: 50, scope: !883)
!886 = !DILocation(line: 967, column: 8, scope: !883)
!887 = !DILocation(line: 967, column: 68, scope: !883)
!888 = !DILocation(line: 967, column: 8, scope: !871)
!889 = !DILocation(line: 968, column: 18, scope: !890)
!890 = distinct !DILexicalBlock(scope: !891, file: !21, line: 968, column: 11)
!891 = distinct !DILexicalBlock(scope: !883, file: !21, line: 967, column: 74)
!892 = !DILocation(line: 968, column: 40, scope: !890)
!893 = !DILocation(line: 968, column: 11, scope: !890)
!894 = !DILocation(line: 968, column: 45, scope: !890)
!895 = !DILocation(line: 968, column: 11, scope: !891)
!896 = !DILocation(line: 969, column: 11, scope: !897)
!897 = distinct !DILexicalBlock(scope: !890, file: !21, line: 968, column: 51)
!898 = !DILocation(line: 969, column: 28, scope: !897)
!899 = !DILocation(line: 970, column: 7, scope: !897)
!900 = !DILocation(line: 971, column: 10, scope: !901)
!901 = distinct !DILexicalBlock(scope: !890, file: !21, line: 970, column: 14)
!902 = !DILocation(line: 973, column: 4, scope: !891)
!903 = !DILocation(line: 975, column: 12, scope: !871)
!904 = !DILocation(line: 975, column: 11, scope: !871)
!905 = !DILocation(line: 975, column: 16, scope: !871)
!906 = !DILocation(line: 975, column: 4, scope: !871)
!907 = !DILocation(line: 976, column: 1, scope: !871)
!908 = distinct !DISubprogram(name: "FileLock_Lock", scope: !21, file: !21, line: 1129, type: !909, isLocal: false, isDefinition: true, scopeLine: 1134, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!909 = !DISubroutineType(types: !910)
!910 = !{!11, !25, !911, !912, !274, !543}
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !570)
!913 = !DILocalVariable(name: "filePath", arg: 1, scope: !908, file: !21, line: 1129, type: !25)
!914 = !DILocation(line: 1129, column: 27, scope: !908)
!915 = !DILocalVariable(name: "readOnly", arg: 2, scope: !908, file: !21, line: 1130, type: !911)
!916 = !DILocation(line: 1130, column: 26, scope: !908)
!917 = !DILocalVariable(name: "maxWaitTimeMsec", arg: 3, scope: !908, file: !21, line: 1131, type: !912)
!918 = !DILocation(line: 1131, column: 28, scope: !908)
!919 = !DILocalVariable(name: "err", arg: 4, scope: !908, file: !21, line: 1132, type: !274)
!920 = !DILocation(line: 1132, column: 20, scope: !908)
!921 = !DILocalVariable(name: "msgs", arg: 5, scope: !908, file: !21, line: 1133, type: !543)
!922 = !DILocation(line: 1133, column: 25, scope: !908)
!923 = !DILocalVariable(name: "res", scope: !908, file: !21, line: 1135, type: !24)
!924 = !DILocation(line: 1135, column: 8, scope: !908)
!925 = !DILocalVariable(name: "normalizedPath", scope: !908, file: !21, line: 1136, type: !40)
!926 = !DILocation(line: 1136, column: 10, scope: !908)
!927 = !DILocalVariable(name: "tokenPtr", scope: !908, file: !21, line: 1137, type: !11)
!928 = !DILocation(line: 1137, column: 19, scope: !908)
!929 = !DILocation(line: 1142, column: 43, scope: !908)
!930 = !DILocation(line: 1142, column: 21, scope: !908)
!931 = !DILocation(line: 1142, column: 19, scope: !908)
!932 = !DILocation(line: 1144, column: 8, scope: !933)
!933 = distinct !DILexicalBlock(scope: !908, file: !21, line: 1144, column: 8)
!934 = !DILocation(line: 1144, column: 23, scope: !933)
!935 = !DILocation(line: 1144, column: 8, scope: !908)
!936 = !DILocation(line: 1145, column: 11, scope: !937)
!937 = distinct !DILexicalBlock(scope: !933, file: !21, line: 1144, column: 31)
!938 = !DILocation(line: 1147, column: 16, scope: !937)
!939 = !DILocation(line: 1148, column: 4, scope: !937)
!940 = !DILocation(line: 1149, column: 36, scope: !941)
!941 = distinct !DILexicalBlock(scope: !933, file: !21, line: 1148, column: 11)
!942 = !DILocation(line: 1149, column: 53, scope: !941)
!943 = !DILocation(line: 1149, column: 52, scope: !941)
!944 = !DILocation(line: 1149, column: 63, scope: !941)
!945 = !DILocation(line: 1149, column: 18, scope: !941)
!946 = !DILocation(line: 1149, column: 16, scope: !941)
!947 = !DILocation(line: 1152, column: 18, scope: !941)
!948 = !DILocation(line: 1152, column: 7, scope: !941)
!949 = !DILocation(line: 1155, column: 8, scope: !950)
!950 = distinct !DILexicalBlock(scope: !908, file: !21, line: 1155, column: 8)
!951 = !DILocation(line: 1155, column: 12, scope: !950)
!952 = !DILocation(line: 1155, column: 8, scope: !908)
!953 = !DILocation(line: 1156, column: 14, scope: !954)
!954 = distinct !DILexicalBlock(scope: !950, file: !21, line: 1155, column: 20)
!955 = !DILocation(line: 1156, column: 8, scope: !954)
!956 = !DILocation(line: 1156, column: 12, scope: !954)
!957 = !DILocation(line: 1157, column: 4, scope: !954)
!958 = !DILocation(line: 1159, column: 8, scope: !959)
!959 = distinct !DILexicalBlock(scope: !908, file: !21, line: 1159, column: 8)
!960 = !DILocation(line: 1159, column: 17, scope: !959)
!961 = !DILocation(line: 1159, column: 8, scope: !908)
!962 = !DILocalVariable(name: "errnoValue", scope: !963, file: !21, line: 1160, type: !24)
!963 = distinct !DILexicalBlock(scope: !959, file: !21, line: 1159, column: 25)
!964 = !DILocation(line: 1160, column: 11, scope: !963)
!965 = !DILocation(line: 1162, column: 11, scope: !966)
!966 = distinct !DILexicalBlock(scope: !963, file: !21, line: 1162, column: 11)
!967 = !DILocation(line: 1162, column: 15, scope: !966)
!968 = !DILocation(line: 1162, column: 11, scope: !963)
!969 = !DILocation(line: 1163, column: 21, scope: !970)
!970 = distinct !DILexicalBlock(scope: !966, file: !21, line: 1162, column: 21)
!971 = !DILocation(line: 1165, column: 7, scope: !970)
!972 = !DILocation(line: 1166, column: 23, scope: !973)
!973 = distinct !DILexicalBlock(scope: !966, file: !21, line: 1165, column: 14)
!974 = !DILocation(line: 1166, column: 21, scope: !973)
!975 = !DILocation(line: 1169, column: 29, scope: !963)
!976 = !DILocation(line: 1169, column: 35, scope: !963)
!977 = !DILocation(line: 1169, column: 7, scope: !963)
!978 = !DILocation(line: 1170, column: 4, scope: !963)
!979 = !DILocation(line: 1172, column: 11, scope: !908)
!980 = !DILocation(line: 1172, column: 4, scope: !908)
!981 = distinct !DISubprogram(name: "FileLockNormalizePath", scope: !21, file: !21, line: 1060, type: !982, isLocal: true, isDefinition: true, scopeLine: 1061, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!982 = !DISubroutineType(types: !983)
!983 = !{!40, !25}
!984 = !DILocalVariable(name: "filePath", arg: 1, scope: !981, file: !21, line: 1060, type: !25)
!985 = !DILocation(line: 1060, column: 35, scope: !981)
!986 = !DILocalVariable(name: "result", scope: !981, file: !21, line: 1062, type: !40)
!987 = !DILocation(line: 1062, column: 10, scope: !981)
!988 = !DILocalVariable(name: "dirName", scope: !981, file: !21, line: 1064, type: !40)
!989 = !DILocation(line: 1064, column: 10, scope: !981)
!990 = !DILocalVariable(name: "fileName", scope: !981, file: !21, line: 1065, type: !40)
!991 = !DILocation(line: 1065, column: 10, scope: !981)
!992 = !DILocation(line: 1074, column: 21, scope: !981)
!993 = !DILocation(line: 1074, column: 4, scope: !981)
!994 = !DILocation(line: 1080, column: 9, scope: !995)
!995 = distinct !DILexicalBlock(scope: !981, file: !21, line: 1080, column: 8)
!996 = !DILocation(line: 1080, column: 8, scope: !995)
!997 = !DILocation(line: 1080, column: 17, scope: !995)
!998 = !DILocation(line: 1080, column: 8, scope: !981)
!999 = !DILocation(line: 1081, column: 27, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !21, line: 1081, column: 11)
!1001 = distinct !DILexicalBlock(scope: !995, file: !21, line: 1080, column: 26)
!1002 = !DILocation(line: 1081, column: 11, scope: !1000)
!1003 = !DILocation(line: 1081, column: 11, scope: !1001)
!1004 = !DILocation(line: 1082, column: 37, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1000, file: !21, line: 1081, column: 38)
!1006 = !DILocation(line: 1082, column: 19, scope: !1005)
!1007 = !DILocation(line: 1082, column: 17, scope: !1005)
!1008 = !DILocation(line: 1083, column: 7, scope: !1005)
!1009 = !DILocation(line: 1084, column: 42, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1000, file: !21, line: 1083, column: 14)
!1011 = !DILocation(line: 1084, column: 19, scope: !1010)
!1012 = !DILocation(line: 1084, column: 17, scope: !1010)
!1013 = !DILocation(line: 1086, column: 4, scope: !1001)
!1014 = !DILocalVariable(name: "fullPath", scope: !1015, file: !21, line: 1087, type: !40)
!1015 = distinct !DILexicalBlock(scope: !995, file: !21, line: 1086, column: 11)
!1016 = !DILocation(line: 1087, column: 13, scope: !1015)
!1017 = !DILocation(line: 1087, column: 38, scope: !1015)
!1018 = !DILocation(line: 1087, column: 24, scope: !1015)
!1019 = !DILocation(line: 1089, column: 17, scope: !1015)
!1020 = !DILocation(line: 1089, column: 26, scope: !1015)
!1021 = !DILocation(line: 1089, column: 16, scope: !1015)
!1022 = !DILocation(line: 1089, column: 16, scope: !1023)
!1023 = !DILexicalBlockFile(scope: !1015, file: !21, discriminator: 1)
!1024 = !DILocation(line: 1089, column: 56, scope: !1025)
!1025 = !DILexicalBlockFile(scope: !1015, file: !21, discriminator: 2)
!1026 = !DILocation(line: 1090, column: 57, scope: !1015)
!1027 = !DILocation(line: 1089, column: 43, scope: !1025)
!1028 = !DILocation(line: 1089, column: 16, scope: !1025)
!1029 = !DILocation(line: 1089, column: 16, scope: !1030)
!1030 = !DILexicalBlockFile(scope: !1015, file: !21, discriminator: 3)
!1031 = !DILocation(line: 1089, column: 14, scope: !1030)
!1032 = !DILocation(line: 1092, column: 18, scope: !1015)
!1033 = !DILocation(line: 1092, column: 7, scope: !1015)
!1034 = !DILocation(line: 1095, column: 15, scope: !981)
!1035 = !DILocation(line: 1095, column: 4, scope: !981)
!1036 = !DILocation(line: 1096, column: 15, scope: !981)
!1037 = !DILocation(line: 1096, column: 4, scope: !981)
!1038 = !DILocation(line: 1098, column: 11, scope: !981)
!1039 = !DILocation(line: 1098, column: 4, scope: !981)
!1040 = distinct !DISubprogram(name: "FileLock_IsLocked", scope: !21, file: !21, line: 1191, type: !1041, isLocal: false, isDefinition: true, scopeLine: 1194, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!135, !25, !274, !543}
!1043 = !DILocalVariable(name: "filePath", arg: 1, scope: !1040, file: !21, line: 1191, type: !25)
!1044 = !DILocation(line: 1191, column: 31, scope: !1040)
!1045 = !DILocalVariable(name: "err", arg: 2, scope: !1040, file: !21, line: 1192, type: !274)
!1046 = !DILocation(line: 1192, column: 24, scope: !1040)
!1047 = !DILocalVariable(name: "msgs", arg: 3, scope: !1040, file: !21, line: 1193, type: !543)
!1048 = !DILocation(line: 1193, column: 29, scope: !1040)
!1049 = !DILocalVariable(name: "res", scope: !1040, file: !21, line: 1195, type: !24)
!1050 = !DILocation(line: 1195, column: 8, scope: !1040)
!1051 = !DILocalVariable(name: "isLocked", scope: !1040, file: !21, line: 1196, type: !135)
!1052 = !DILocation(line: 1196, column: 9, scope: !1040)
!1053 = !DILocalVariable(name: "normalizedPath", scope: !1040, file: !21, line: 1197, type: !40)
!1054 = !DILocation(line: 1197, column: 10, scope: !1040)
!1055 = !DILocation(line: 1201, column: 43, scope: !1040)
!1056 = !DILocation(line: 1201, column: 21, scope: !1040)
!1057 = !DILocation(line: 1201, column: 19, scope: !1040)
!1058 = !DILocation(line: 1203, column: 8, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1040, file: !21, line: 1203, column: 8)
!1060 = !DILocation(line: 1203, column: 23, scope: !1059)
!1061 = !DILocation(line: 1203, column: 8, scope: !1040)
!1062 = !DILocation(line: 1204, column: 11, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1059, file: !21, line: 1203, column: 31)
!1064 = !DILocation(line: 1206, column: 16, scope: !1063)
!1065 = !DILocation(line: 1207, column: 4, scope: !1063)
!1066 = !DILocation(line: 1208, column: 35, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1059, file: !21, line: 1207, column: 11)
!1068 = !DILocation(line: 1208, column: 18, scope: !1067)
!1069 = !DILocation(line: 1208, column: 16, scope: !1067)
!1070 = !DILocation(line: 1210, column: 18, scope: !1067)
!1071 = !DILocation(line: 1210, column: 7, scope: !1067)
!1072 = !DILocation(line: 1213, column: 8, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1040, file: !21, line: 1213, column: 8)
!1074 = !DILocation(line: 1213, column: 12, scope: !1073)
!1075 = !DILocation(line: 1213, column: 8, scope: !1040)
!1076 = !DILocation(line: 1214, column: 14, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1073, file: !21, line: 1213, column: 20)
!1078 = !DILocation(line: 1214, column: 8, scope: !1077)
!1079 = !DILocation(line: 1214, column: 12, scope: !1077)
!1080 = !DILocation(line: 1215, column: 4, scope: !1077)
!1081 = !DILocation(line: 1217, column: 8, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1040, file: !21, line: 1217, column: 8)
!1083 = !DILocation(line: 1217, column: 12, scope: !1082)
!1084 = !DILocation(line: 1217, column: 8, scope: !1040)
!1085 = !DILocation(line: 1218, column: 29, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1082, file: !21, line: 1217, column: 18)
!1087 = !DILocation(line: 1218, column: 35, scope: !1086)
!1088 = !DILocation(line: 1218, column: 7, scope: !1086)
!1089 = !DILocation(line: 1219, column: 4, scope: !1086)
!1090 = !DILocation(line: 1221, column: 11, scope: !1040)
!1091 = !DILocation(line: 1221, column: 4, scope: !1040)
!1092 = distinct !DISubprogram(name: "FileLock_Unlock", scope: !21, file: !21, line: 1243, type: !1093, isLocal: false, isDefinition: true, scopeLine: 1246, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!135, !1095, !274, !543}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!1097 = !DILocalVariable(name: "lockToken", arg: 1, scope: !1092, file: !21, line: 1243, type: !1095)
!1098 = !DILocation(line: 1243, column: 38, scope: !1092)
!1099 = !DILocalVariable(name: "err", arg: 2, scope: !1092, file: !21, line: 1244, type: !274)
!1100 = !DILocation(line: 1244, column: 22, scope: !1092)
!1101 = !DILocalVariable(name: "msgs", arg: 3, scope: !1092, file: !21, line: 1245, type: !543)
!1102 = !DILocation(line: 1245, column: 27, scope: !1092)
!1103 = !DILocalVariable(name: "res", scope: !1092, file: !21, line: 1247, type: !24)
!1104 = !DILocation(line: 1247, column: 8, scope: !1092)
!1105 = !DILocation(line: 1251, column: 48, scope: !1092)
!1106 = !DILocation(line: 1251, column: 10, scope: !1092)
!1107 = !DILocation(line: 1251, column: 8, scope: !1092)
!1108 = !DILocation(line: 1253, column: 8, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1092, file: !21, line: 1253, column: 8)
!1110 = !DILocation(line: 1253, column: 12, scope: !1109)
!1111 = !DILocation(line: 1253, column: 8, scope: !1092)
!1112 = !DILocation(line: 1254, column: 14, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1109, file: !21, line: 1253, column: 20)
!1114 = !DILocation(line: 1254, column: 8, scope: !1113)
!1115 = !DILocation(line: 1254, column: 12, scope: !1113)
!1116 = !DILocation(line: 1255, column: 4, scope: !1113)
!1117 = !DILocation(line: 1257, column: 8, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1092, file: !21, line: 1257, column: 8)
!1119 = !DILocation(line: 1257, column: 12, scope: !1118)
!1120 = !DILocation(line: 1257, column: 8, scope: !1092)
!1121 = !DILocation(line: 1258, column: 29, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1118, file: !21, line: 1257, column: 18)
!1123 = !DILocation(line: 1258, column: 35, scope: !1122)
!1124 = !DILocation(line: 1258, column: 7, scope: !1122)
!1125 = !DILocation(line: 1259, column: 4, scope: !1122)
!1126 = !DILocation(line: 1261, column: 12, scope: !1092)
!1127 = !DILocation(line: 1261, column: 16, scope: !1092)
!1128 = !DILocation(line: 1261, column: 11, scope: !1092)
!1129 = !DILocation(line: 1261, column: 4, scope: !1092)
!1130 = distinct !DISubprogram(name: "IsLinkingAvailable", scope: !21, file: !21, line: 98, type: !450, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!1131 = !DILocalVariable(name: "fileName", arg: 1, scope: !1130, file: !21, line: 98, type: !25)
!1132 = !DILocation(line: 98, column: 32, scope: !1130)
!1133 = !DILocalVariable(name: "buf", scope: !1130, file: !21, line: 100, type: !1134)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statfs", file: !1135, line: 24, size: 960, align: 64, elements: !1136)
!1135 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/statfs.h", directory: "/home/lichi/Desktop/open-vm-tools/line219")
!1136 = !{!1137, !1139, !1140, !1142, !1143, !1144, !1146, !1147, !1155, !1156, !1157, !1158}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "f_type", scope: !1134, file: !1135, line: 26, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsword_t", file: !144, line: 170, baseType: !317)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "f_bsize", scope: !1134, file: !1135, line: 27, baseType: !1138, size: 64, align: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "f_blocks", scope: !1134, file: !1135, line: 35, baseType: !1141, size: 64, align: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsblkcnt64_t", file: !144, line: 163, baseType: !338)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "f_bfree", scope: !1134, file: !1135, line: 36, baseType: !1141, size: 64, align: 64, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "f_bavail", scope: !1134, file: !1135, line: 37, baseType: !1141, size: 64, align: 64, offset: 256)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "f_files", scope: !1134, file: !1135, line: 38, baseType: !1145, size: 64, align: 64, offset: 320)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsfilcnt64_t", file: !144, line: 167, baseType: !338)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "f_ffree", scope: !1134, file: !1135, line: 39, baseType: !1145, size: 64, align: 64, offset: 384)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "f_fsid", scope: !1134, file: !1135, line: 41, baseType: !1148, size: 64, align: 32, offset: 448)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsid_t", file: !144, line: 134, baseType: !1149)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 134, size: 64, align: 32, elements: !1150)
!1150 = !{!1151}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !1149, file: !144, line: 134, baseType: !1152, size: 64, align: 32)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 64, align: 32, elements: !1153)
!1153 = !{!1154}
!1154 = !DISubrange(count: 2)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "f_namelen", scope: !1134, file: !1135, line: 42, baseType: !1138, size: 64, align: 64, offset: 512)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "f_frsize", scope: !1134, file: !1135, line: 43, baseType: !1138, size: 64, align: 64, offset: 576)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags", scope: !1134, file: !1135, line: 44, baseType: !1138, size: 64, align: 64, offset: 640)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "f_spare", scope: !1134, file: !1135, line: 45, baseType: !1159, size: 256, align: 64, offset: 704)
!1159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1138, size: 256, align: 64, elements: !1160)
!1160 = !{!1161}
!1161 = !DISubrange(count: 4)
!1162 = !DILocation(line: 100, column: 18, scope: !1130)
!1163 = !DILocalVariable(name: "status", scope: !1130, file: !21, line: 101, type: !24)
!1164 = !DILocation(line: 101, column: 8, scope: !1130)
!1165 = !DILocation(line: 110, column: 8, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1130, file: !21, line: 110, column: 8)
!1167 = !DILocation(line: 110, column: 8, scope: !1130)
!1168 = !DILocation(line: 111, column: 7, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1166, file: !21, line: 110, column: 28)
!1170 = !DILocation(line: 114, column: 20, scope: !1130)
!1171 = !DILocation(line: 114, column: 13, scope: !1130)
!1172 = !DILocation(line: 114, column: 11, scope: !1130)
!1173 = !DILocation(line: 116, column: 8, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1130, file: !21, line: 116, column: 8)
!1175 = !DILocation(line: 116, column: 15, scope: !1174)
!1176 = !DILocation(line: 116, column: 8, scope: !1130)
!1177 = !DILocation(line: 117, column: 50, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1174, file: !21, line: 116, column: 22)
!1179 = !DILocation(line: 118, column: 29, scope: !1178)
!1180 = !DILocation(line: 118, column: 28, scope: !1178)
!1181 = !DILocation(line: 118, column: 11, scope: !1182)
!1182 = !DILexicalBlockFile(scope: !1178, file: !21, discriminator: 1)
!1183 = !DILocation(line: 117, column: 7, scope: !1178)
!1184 = !DILocation(line: 120, column: 7, scope: !1178)
!1185 = !DILocation(line: 137, column: 16, scope: !1130)
!1186 = !DILocation(line: 137, column: 4, scope: !1130)
!1187 = !DILocation(line: 154, column: 9, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1130, file: !21, line: 137, column: 24)
!1189 = !DILocation(line: 157, column: 9, scope: !1188)
!1190 = !DILocation(line: 165, column: 31, scope: !1130)
!1191 = !DILocation(line: 165, column: 12, scope: !1130)
!1192 = !DILocation(line: 164, column: 4, scope: !1130)
!1193 = !DILocation(line: 168, column: 4, scope: !1130)
!1194 = !DILocation(line: 169, column: 1, scope: !1130)
!1195 = distinct !DISubprogram(name: "FileReadSlashProc", scope: !21, file: !21, line: 626, type: !1196, isLocal: true, isDefinition: true, scopeLine: 629, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!24, !25, !40, !336}
!1198 = !DILocalVariable(name: "procPath", arg: 1, scope: !1195, file: !21, line: 626, type: !25)
!1199 = !DILocation(line: 626, column: 31, scope: !1195)
!1200 = !DILocalVariable(name: "buffer", arg: 2, scope: !1195, file: !21, line: 627, type: !40)
!1201 = !DILocation(line: 627, column: 25, scope: !1195)
!1202 = !DILocalVariable(name: "bufferSize", arg: 3, scope: !1195, file: !21, line: 628, type: !336)
!1203 = !DILocation(line: 628, column: 26, scope: !1195)
!1204 = !DILocalVariable(name: "fd", scope: !1195, file: !21, line: 630, type: !24)
!1205 = !DILocation(line: 630, column: 8, scope: !1195)
!1206 = !DILocalVariable(name: "err", scope: !1195, file: !21, line: 631, type: !24)
!1207 = !DILocation(line: 631, column: 8, scope: !1195)
!1208 = !DILocalVariable(name: "p", scope: !1195, file: !21, line: 632, type: !40)
!1209 = !DILocation(line: 632, column: 10, scope: !1195)
!1210 = !DILocalVariable(name: "len", scope: !1195, file: !21, line: 633, type: !336)
!1211 = !DILocation(line: 633, column: 11, scope: !1195)
!1212 = !DILocation(line: 639, column: 20, scope: !1195)
!1213 = !DILocation(line: 639, column: 9, scope: !1195)
!1214 = !DILocation(line: 639, column: 7, scope: !1195)
!1215 = !DILocation(line: 641, column: 8, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1195, file: !21, line: 641, column: 8)
!1217 = !DILocation(line: 641, column: 11, scope: !1216)
