; ModuleID = './filePosix.o.i'
source_filename = "./filePosix.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.FileData = type { i64, i64, i64, i64, i32, i32, i32, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.statfs = type { i64, i64, i64, i64, i64, i64, i64, %struct.__fsid_t, i64, i64, i64, [4 x i64] }
%struct.__fsid_t = type { [2 x i32] }
%struct.timeval = type { i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.mntent = type { i8*, i8*, i8*, i8*, i32, i32 }
%struct.FileIODescriptor = type { i32, i32, i8*, %struct.FileLockToken* }
%struct.FileLockToken = type opaque
%struct.__dirstream = type opaque
%struct.HashTable = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.DynBuf = type { i8*, i64, i64 }
%struct.WalkDirContextImpl = type { i32, i32, i8** }

@.str = private unnamed_addr constant [33 x i8] c"FILE: %s: statfs(%s) failed: %s\0A\00", align 1
@__func__.File_IsRemote = private unnamed_addr constant [14 x i8] c"File_IsRemote\00", align 1

!463 = distinct !DILexicalBlock(scope: !457, file: !371, line: 214, column: 11)
!464 = !DILocation(line: 214, column: 20, scope: !463)
!465 = !DILocation(line: 214, column: 11, scope: !457)
!466 = !DILocation(line: 216, column: 17, scope: !467)
!467 = distinct !DILexicalBlock(scope: !463, file: !371, line: 214, column: 28)
!468 = !DILocation(line: 216, column: 16, scope: !467)
!469 = !DILocation(line: 216, column: 14, scope: !467)
!470 = !DILocation(line: 218, column: 14, scope: !471)
!471 = distinct !DILexicalBlock(scope: !467, file: !371, line: 218, column: 14)
!472 = !DILocation(line: 218, column: 18, scope: !471)
!473 = !DILocation(line: 218, column: 14, scope: !467)
!474 = !DILocation(line: 219, column: 13, scope: !475)
!475 = distinct !DILexicalBlock(scope: !471, file: !371, line: 218, column: 28)
!476 = !DILocation(line: 221, column: 7, scope: !467)
!477 = !DILocation(line: 222, column: 30, scope: !478)
!478 = distinct !DILexicalBlock(scope: !463, file: !371, line: 221, column: 14)
!479 = !DILocation(line: 222, column: 17, scope: !478)
!480 = !DILocation(line: 222, column: 40, scope: !478)
!481 = !DILocation(line: 222, column: 16, scope: !478)
!482 = !DILocation(line: 222, column: 50, scope: !483)
!483 = !DILexicalBlockFile(scope: !478, file: !371, discriminator: 1)
!484 = !DILocation(line: 222, column: 49, scope: !483)
!485 = !DILocation(line: 222, column: 16, scope: !483)
!486 = !DILocation(line: 222, column: 16, scope: !487)
!487 = !DILexicalBlockFile(scope: !478, file: !371, discriminator: 2)
!488 = !DILocation(line: 222, column: 16, scope: !489)
!489 = !DILexicalBlockFile(scope: !478, file: !371, discriminator: 3)
!490 = !DILocation(line: 222, column: 14, scope: !489)
!491 = !DILocation(line: 224, column: 21, scope: !478)
!492 = !DILocation(line: 224, column: 10, scope: !478)
!493 = !DILocation(line: 227, column: 14, scope: !494)
!494 = distinct !DILexicalBlock(scope: !478, file: !371, line: 227, column: 14)
!495 = !DILocation(line: 227, column: 18, scope: !494)
!496 = !DILocation(line: 227, column: 14, scope: !478)
!497 = !DILocation(line: 228, column: 13, scope: !498)
!498 = distinct !DILexicalBlock(scope: !494, file: !371, line: 227, column: 28)
!499 = !DILocation(line: 231, column: 4, scope: !457)
!500 = !DILocation(line: 233, column: 24, scope: !432)
!501 = !DILocation(line: 233, column: 11, scope: !432)
!502 = !DILocation(line: 233, column: 34, scope: !432)
!503 = !DILocation(line: 233, column: 10, scope: !432)
!504 = !DILocation(line: 233, column: 44, scope: !505)
!505 = !DILexicalBlockFile(scope: !432, file: !371, discriminator: 1)
!506 = !DILocation(line: 233, column: 43, scope: !505)
!507 = !DILocation(line: 233, column: 10, scope: !505)
!508 = !DILocation(line: 233, column: 10, scope: !509)
!509 = !DILexicalBlockFile(scope: !432, file: !371, discriminator: 2)
!510 = !DILocation(line: 233, column: 10, scope: !511)
!511 = !DILexicalBlockFile(scope: !432, file: !371, discriminator: 3)
!512 = !DILocation(line: 233, column: 8, scope: !511)
!513 = !DILocation(line: 233, column: 4, scope: !511)
!514 = !DILocation(line: 237, column: 11, scope: !432)
!515 = !DILocation(line: 237, column: 4, scope: !432)
!516 = !DILocation(line: 238, column: 1, scope: !432)
!517 = distinct !DISubprogram(name: "Posix_Free", scope: !518, file: !518, line: 129, type: !519, isLocal: true, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!518 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/posix.h", directory: "/home/lichi/Desktop/open-vm-tools/line196")
!519 = !DISubroutineType(types: !520)
!520 = !{null, !360}
!521 = !DILocalVariable(name: "p", arg: 1, scope: !517, file: !518, line: 129, type: !360)
!522 = !DILocation(line: 129, column: 18, scope: !517)
!523 = !DILocalVariable(name: "err", scope: !517, file: !518, line: 131, type: !374)
!524 = !DILocation(line: 131, column: 8, scope: !517)
!525 = !DILocation(line: 131, column: 15, scope: !517)
!526 = !DILocation(line: 131, column: 14, scope: !517)
!527 = !DILocation(line: 132, column: 9, scope: !517)
!528 = !DILocation(line: 132, column: 4, scope: !517)
!529 = !DILocation(line: 133, column: 11, scope: !517)
!530 = !DILocation(line: 133, column: 5, scope: !517)
!531 = !DILocation(line: 133, column: 9, scope: !517)
!532 = !DILocation(line: 134, column: 1, scope: !517)
!533 = distinct !DISubprogram(name: "File_UnlinkDelayed", scope: !371, file: !371, line: 258, type: !372, isLocal: false, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!534 = !DILocalVariable(name: "pathName", arg: 1, scope: !533, file: !371, line: 258, type: !375)
!535 = !DILocation(line: 258, column: 32, scope: !533)
!536 = !DILocation(line: 260, column: 25, scope: !533)
!537 = !DILocation(line: 260, column: 12, scope: !533)
!538 = !DILocation(line: 260, column: 38, scope: !533)
!539 = !DILocation(line: 260, column: 11, scope: !533)
!540 = !DILocation(line: 260, column: 4, scope: !533)
!541 = distinct !DISubprogram(name: "FileAttributes", scope: !371, file: !371, line: 282, type: !542, isLocal: false, isDefinition: true, scopeLine: 284, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!542 = !DISubroutineType(types: !543)
!543 = !{!374, !375, !544}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "FileData", file: !546, line: 108, baseType: !547)
!546 = !DIFile(filename: "fileInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line196")
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !546, line: 99, size: 384, align: 64, elements: !548)
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "fileAccessTime", scope: !547, file: !546, line: 100, baseType: !361, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "fileCreationTime", scope: !547, file: !546, line: 101, baseType: !361, size: 64, align: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "fileModificationTime", scope: !547, file: !546, line: 102, baseType: !361, size: 64, align: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fileSize", scope: !547, file: !546, line: 103, baseType: !361, size: 64, align: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "fileType", scope: !547, file: !546, line: 104, baseType: !374, size: 32, align: 32, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "fileMode", scope: !547, file: !546, line: 105, baseType: !374, size: 32, align: 32, offset: 288)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "fileOwner", scope: !547, file: !546, line: 106, baseType: !374, size: 32, align: 32, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fileGroup", scope: !547, file: !546, line: 107, baseType: !374, size: 32, align: 32, offset: 352)
!557 = !DILocalVariable(name: "pathName", arg: 1, scope: !541, file: !371, line: 282, type: !375)
!558 = !DILocation(line: 282, column: 28, scope: !541)
!559 = !DILocalVariable(name: "fileData", arg: 2, scope: !541, file: !371, line: 283, type: !544)
!560 = !DILocation(line: 283, column: 26, scope: !541)
!561 = !DILocalVariable(name: "err", scope: !541, file: !371, line: 285, type: !374)
!562 = !DILocation(line: 285, column: 8, scope: !541)
!563 = !DILocalVariable(name: "statbuf", scope: !541, file: !371, line: 286, type: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !565, line: 46, size: 1152, align: 64, elements: !566)
!565 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/open-vm-tools/line196")
!566 = !{!567, !570, !572, !574, !576, !578, !580, !581, !582, !585, !587, !589, !597, !598, !599}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !564, file: !565, line: 48, baseType: !568, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !569, line: 124, baseType: !365)
!569 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line196")
!570 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !564, file: !565, line: 53, baseType: !571, size: 64, align: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !569, line: 127, baseType: !365)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !564, file: !565, line: 61, baseType: !573, size: 64, align: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !569, line: 130, baseType: !365)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !564, file: !565, line: 62, baseType: !575, size: 32, align: 32, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !569, line: 129, baseType: !421)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !564, file: !565, line: 64, baseType: !577, size: 32, align: 32, offset: 224)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !569, line: 125, baseType: !421)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !564, file: !565, line: 65, baseType: !579, size: 32, align: 32, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !569, line: 126, baseType: !421)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !564, file: !565, line: 67, baseType: !374, size: 32, align: 32, offset: 288)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !564, file: !565, line: 69, baseType: !568, size: 64, align: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !564, file: !565, line: 74, baseType: !583, size: 64, align: 64, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !569, line: 131, baseType: !584)
!584 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !564, file: !565, line: 78, baseType: !586, size: 64, align: 64, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !569, line: 153, baseType: !584)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !564, file: !565, line: 80, baseType: !588, size: 64, align: 64, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !569, line: 158, baseType: !584)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !564, file: !565, line: 91, baseType: !590, size: 128, align: 64, offset: 576)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !591, line: 120, size: 128, align: 64, elements: !592)
!591 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line196")
!592 = !{!593, !595}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !590, file: !591, line: 122, baseType: !594, size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !569, line: 139, baseType: !584)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !590, file: !591, line: 123, baseType: !596, size: 64, align: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !569, line: 175, baseType: !584)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !564, file: !565, line: 92, baseType: !590, size: 128, align: 64, offset: 704)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !564, file: !565, line: 93, baseType: !590, size: 128, align: 64, offset: 832)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !564, file: !565, line: 106, baseType: !600, size: 192, align: 64, offset: 960)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 192, align: 64, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 3)
!603 = !DILocation(line: 286, column: 16, scope: !541)
!604 = !DILocation(line: 288, column: 19, scope: !605)
!605 = distinct !DILexicalBlock(scope: !541, file: !371, line: 288, column: 8)
!606 = !DILocation(line: 288, column: 8, scope: !605)
!607 = !DILocation(line: 288, column: 39, scope: !605)
!608 = !DILocation(line: 288, column: 8, scope: !541)
!609 = !DILocation(line: 289, column: 14, scope: !610)
!610 = distinct !DILexicalBlock(scope: !605, file: !371, line: 288, column: 46)
!611 = !DILocation(line: 289, column: 13, scope: !610)
!612 = !DILocation(line: 289, column: 11, scope: !610)
!613 = !DILocation(line: 290, column: 4, scope: !610)
!614 = !DILocation(line: 291, column: 11, scope: !615)
!615 = distinct !DILexicalBlock(scope: !616, file: !371, line: 291, column: 11)
!616 = distinct !DILexicalBlock(scope: !605, file: !371, line: 290, column: 11)
!617 = !DILocation(line: 291, column: 20, scope: !615)
!618 = !DILocation(line: 291, column: 11, scope: !616)
!619 = !DILocation(line: 292, column: 46, scope: !620)
!620 = distinct !DILexicalBlock(scope: !615, file: !371, line: 291, column: 28)
!621 = !DILocation(line: 292, column: 54, scope: !620)
!622 = !DILocation(line: 292, column: 10, scope: !620)
!623 = !DILocation(line: 292, column: 20, scope: !620)
!624 = !DILocation(line: 292, column: 37, scope: !620)
!625 = !DILocation(line: 293, column: 50, scope: !620)
!626 = !DILocation(line: 293, column: 58, scope: !620)
!627 = !DILocation(line: 293, column: 10, scope: !620)
!628 = !DILocation(line: 293, column: 20, scope: !620)
!629 = !DILocation(line: 293, column: 41, scope: !620)
!630 = !DILocation(line: 294, column: 44, scope: !620)
!631 = !DILocation(line: 294, column: 52, scope: !620)
!632 = !DILocation(line: 294, column: 10, scope: !620)
!633 = !DILocation(line: 294, column: 20, scope: !620)
!634 = !DILocation(line: 294, column: 35, scope: !620)
!635 = !DILocation(line: 295, column: 39, scope: !620)
!636 = !DILocation(line: 295, column: 10, scope: !620)
!637 = !DILocation(line: 295, column: 20, scope: !620)
!638 = !DILocation(line: 295, column: 29, scope: !620)
!639 = !DILocation(line: 297, column: 26, scope: !620)
!640 = !DILocation(line: 297, column: 34, scope: !620)
!641 = !DILocation(line: 297, column: 10, scope: !620)
!642 = !DILocation(line: 299, column: 13, scope: !643)
!643 = distinct !DILexicalBlock(scope: !620, file: !371, line: 297, column: 43)
!644 = !DILocation(line: 299, column: 23, scope: !643)
!645 = !DILocation(line: 299, column: 32, scope: !643)
!646 = !DILocation(line: 300, column: 13, scope: !643)
!647 = !DILocation(line: 303, column: 13, scope: !643)
!648 = !DILocation(line: 303, column: 23, scope: !643)
!649 = !DILocation(line: 303, column: 32, scope: !643)
!650 = !DILocation(line: 304, column: 13, scope: !643)
!651 = !DILocation(line: 307, column: 13, scope: !643)
!652 = !DILocation(line: 307, column: 23, scope: !643)
!653 = !DILocation(line: 307, column: 32, scope: !643)
!654 = !DILocation(line: 308, column: 13, scope: !643)
!655 = !DILocation(line: 311, column: 13, scope: !643)
!656 = !DILocation(line: 311, column: 23, scope: !643)
!657 = !DILocation(line: 311, column: 32, scope: !643)
!658 = !DILocation(line: 312, column: 13, scope: !643)
!659 = !DILocation(line: 315, column: 13, scope: !643)
!660 = !DILocation(line: 315, column: 23, scope: !643)
!661 = !DILocation(line: 315, column: 32, scope: !643)
!662 = !DILocation(line: 316, column: 13, scope: !643)
!663 = !DILocation(line: 319, column: 13, scope: !643)
!664 = !DILocation(line: 319, column: 23, scope: !643)
!665 = !DILocation(line: 319, column: 32, scope: !643)
!666 = !DILocation(line: 320, column: 13, scope: !643)
!667 = !DILocation(line: 323, column: 39, scope: !620)
!668 = !DILocation(line: 323, column: 10, scope: !620)
!669 = !DILocation(line: 323, column: 20, scope: !620)
!670 = !DILocation(line: 323, column: 29, scope: !620)
!671 = !DILocation(line: 324, column: 40, scope: !620)
!672 = !DILocation(line: 324, column: 10, scope: !620)
!673 = !DILocation(line: 324, column: 20, scope: !620)
!674 = !DILocation(line: 324, column: 30, scope: !620)
!675 = !DILocation(line: 325, column: 40, scope: !620)
!676 = !DILocation(line: 325, column: 10, scope: !620)
!677 = !DILocation(line: 325, column: 20, scope: !620)
!678 = !DILocation(line: 325, column: 30, scope: !620)
!679 = !DILocation(line: 326, column: 7, scope: !620)
!680 = !DILocation(line: 328, column: 11, scope: !616)
!681 = !DILocation(line: 331, column: 11, scope: !541)
!682 = !DILocation(line: 331, column: 4, scope: !541)
!683 = distinct !DISubprogram(name: "File_IsRemote", scope: !371, file: !371, line: 369, type: !684, isLocal: false, isDefinition: true, scopeLine: 370, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!684 = !DISubroutineType(types: !685)
!685 = !{!436, !375}
!686 = !DILocalVariable(name: "pathName", arg: 1, scope: !683, file: !371, line: 369, type: !375)
!687 = !DILocation(line: 369, column: 27, scope: !683)
!688 = !DILocation(line: 371, column: 8, scope: !689)
!689 = distinct !DILexicalBlock(scope: !683, file: !371, line: 371, column: 8)
!690 = !DILocation(line: 371, column: 8, scope: !683)
!691 = !DILocation(line: 377, column: 7, scope: !692)
!692 = distinct !DILexicalBlock(scope: !689, file: !371, line: 371, column: 28)
!693 = !DILocalVariable(name: "sfbuf", scope: !694, file: !371, line: 379, type: !695)
!694 = distinct !DILexicalBlock(scope: !689, file: !371, line: 378, column: 11)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statfs", file: !696, line: 24, size: 960, align: 64, elements: !697)
!696 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/statfs.h", directory: "/home/lichi/Desktop/open-vm-tools/line196")
!697 = !{!698, !700, !701, !703, !704, !705, !707, !708, !716, !717, !718, !719}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "f_type", scope: !695, file: !696, line: 26, baseType: !699, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsword_t", file: !569, line: 170, baseType: !584)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "f_bsize", scope: !695, file: !696, line: 27, baseType: !699, size: 64, align: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "f_blocks", scope: !695, file: !696, line: 35, baseType: !702, size: 64, align: 64, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsblkcnt64_t", file: !569, line: 163, baseType: !365)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "f_bfree", scope: !695, file: !696, line: 36, baseType: !702, size: 64, align: 64, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "f_bavail", scope: !695, file: !696, line: 37, baseType: !702, size: 64, align: 64, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "f_files", scope: !695, file: !696, line: 38, baseType: !706, size: 64, align: 64, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsfilcnt64_t", file: !569, line: 167, baseType: !365)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "f_ffree", scope: !695, file: !696, line: 39, baseType: !706, size: 64, align: 64, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "f_fsid", scope: !695, file: !696, line: 41, baseType: !709, size: 64, align: 32, offset: 448)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsid_t", file: !569, line: 134, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !569, line: 134, size: 64, align: 32, elements: !711)
!711 = !{!712}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !710, file: !569, line: 134, baseType: !713, size: 64, align: 32)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 64, align: 32, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 2)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "f_namelen", scope: !695, file: !696, line: 42, baseType: !699, size: 64, align: 64, offset: 512)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "f_frsize", scope: !695, file: !696, line: 43, baseType: !699, size: 64, align: 64, offset: 576)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags", scope: !695, file: !696, line: 44, baseType: !699, size: 64, align: 64, offset: 640)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "f_spare", scope: !695, file: !696, line: 45, baseType: !720, size: 256, align: 64, offset: 704)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 256, align: 64, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 4)
!723 = !DILocation(line: 379, column: 21, scope: !694)
!724 = !DILocation(line: 381, column: 24, scope: !725)
!725 = distinct !DILexicalBlock(scope: !694, file: !371, line: 381, column: 11)
!726 = !DILocation(line: 381, column: 11, scope: !725)
!727 = !DILocation(line: 381, column: 42, scope: !725)
!728 = !DILocation(line: 381, column: 11, scope: !694)
!729 = !DILocation(line: 382, column: 63, scope: !730)
!730 = distinct !DILexicalBlock(scope: !725, file: !371, line: 381, column: 49)
!731 = !DILocation(line: 383, column: 32, scope: !730)
!732 = !DILocation(line: 383, column: 31, scope: !730)
!733 = !DILocation(line: 383, column: 14, scope: !734)
!734 = !DILexicalBlockFile(scope: !730, file: !371, discriminator: 1)
!735 = !DILocation(line: 382, column: 10, scope: !730)
!736 = !DILocation(line: 385, column: 10, scope: !730)
!737 = !DILocation(line: 390, column: 27, scope: !738)
!738 = distinct !DILexicalBlock(scope: !694, file: !371, line: 390, column: 11)
!739 = !DILocation(line: 390, column: 18, scope: !738)
!740 = !DILocation(line: 390, column: 11, scope: !694)
!741 = !DILocation(line: 391, column: 10, scope: !742)
!742 = distinct !DILexicalBlock(scope: !738, file: !371, line: 390, column: 35)
!743 = !DILocation(line: 394, column: 27, scope: !744)
!744 = distinct !DILexicalBlock(scope: !694, file: !371, line: 394, column: 11)
!745 = !DILocation(line: 394, column: 18, scope: !744)
!746 = !DILocation(line: 394, column: 11, scope: !694)
!747 = !DILocation(line: 395, column: 10, scope: !748)
!748 = distinct !DILexicalBlock(scope: !744, file: !371, line: 394, column: 35)
!749 = !DILocation(line: 398, column: 31, scope: !750)
!750 = distinct !DILexicalBlock(scope: !694, file: !371, line: 398, column: 11)
!751 = !DILocation(line: 398, column: 22, scope: !750)
!752 = !DILocation(line: 398, column: 11, scope: !694)
!753 = !DILocation(line: 399, column: 10, scope: !754)
!754 = distinct !DILexicalBlock(scope: !750, file: !371, line: 398, column: 39)
!755 = !DILocation(line: 402, column: 7, scope: !694)
!756 = !DILocation(line: 405, column: 1, scope: !683)
!757 = distinct !DISubprogram(name: "File_IsSymLink", scope: !371, file: !371, line: 426, type: !684, isLocal: false, isDefinition: true, scopeLine: 427, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!758 = !DILocalVariable(name: "pathName", arg: 1, scope: !757, file: !371, line: 426, type: !375)
!759 = !DILocation(line: 426, column: 28, scope: !757)
!760 = !DILocalVariable(name: "statbuf", scope: !757, file: !371, line: 428, type: !564)
!761 = !DILocation(line: 428, column: 16, scope: !757)
!762 = !DILocation(line: 430, column: 24, scope: !757)
!763 = !DILocation(line: 430, column: 12, scope: !757)
!764 = !DILocation(line: 430, column: 44, scope: !757)
!765 = !DILocation(line: 430, column: 50, scope: !757)
!766 = !DILocation(line: 431, column: 19, scope: !757)
!767 = !DILocation(line: 431, column: 14, scope: !757)
!768 = !DILocation(line: 431, column: 25, scope: !757)
!769 = !DILocation(line: 430, column: 50, scope: !770)
!770 = !DILexicalBlockFile(scope: !757, file: !371, discriminator: 1)
!771 = !DILocation(line: 430, column: 11, scope: !770)
!772 = !DILocation(line: 430, column: 4, scope: !770)
!773 = distinct !DISubprogram(name: "File_Cwd", scope: !371, file: !371, line: 453, type: !774, isLocal: false, isDefinition: true, scopeLine: 454, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!774 = !DISubroutineType(types: !775)
!775 = !{!458, !375}
!776 = !DILocalVariable(name: "drive", arg: 1, scope: !773, file: !371, line: 453, type: !375)
!777 = !DILocation(line: 453, column: 22, scope: !773)
!778 = !DILocalVariable(name: "size", scope: !773, file: !371, line: 455, type: !779)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !780, line: 216, baseType: !365)
!780 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line196")
!781 = !DILocation(line: 455, column: 11, scope: !773)
!782 = !DILocalVariable(name: "buffer", scope: !773, file: !371, line: 456, type: !458)
!783 = !DILocation(line: 456, column: 10, scope: !773)
!784 = !DILocalVariable(name: "path", scope: !773, file: !371, line: 457, type: !458)
!785 = !DILocation(line: 457, column: 10, scope: !773)
!786 = !DILocation(line: 459, column: 9, scope: !787)
!787 = distinct !DILexicalBlock(scope: !773, file: !371, line: 459, column: 8)
!788 = !DILocation(line: 459, column: 15, scope: !787)
!789 = !DILocation(line: 459, column: 23, scope: !787)
!790 = !DILocation(line: 459, column: 43, scope: !791)
!791 = !DILexicalBlockFile(scope: !787, file: !371, discriminator: 1)
!792 = !DILocation(line: 459, column: 27, scope: !791)
!793 = !DILocation(line: 459, column: 8, scope: !791)
!794 = !DILocation(line: 461, column: 15, scope: !795)
!795 = distinct !DILexicalBlock(scope: !787, file: !371, line: 459, column: 51)
!796 = !DILocation(line: 460, column: 7, scope: !795)
!797 = !DILocation(line: 462, column: 4, scope: !795)
!798 = !DILocation(line: 464, column: 9, scope: !773)
!799 = !DILocation(line: 465, column: 30, scope: !773)
!800 = !DILocation(line: 465, column: 13, scope: !773)
!801 = !DILocation(line: 465, column: 11, scope: !773)
!802 = !DILocation(line: 467, column: 4, scope: !773)
!803 = !DILocation(line: 468, column: 18, scope: !804)
!804 = distinct !DILexicalBlock(scope: !805, file: !371, line: 468, column: 11)
!805 = distinct !DILexicalBlock(scope: !773, file: !371, line: 467, column: 14)
!806 = !DILocation(line: 468, column: 26, scope: !804)
!807 = !DILocation(line: 468, column: 11, scope: !804)
!808 = !DILocation(line: 468, column: 32, scope: !804)
!809 = !DILocation(line: 468, column: 11, scope: !805)
!810 = !DILocation(line: 469, column: 10, scope: !811)
!811 = distinct !DILexicalBlock(scope: !804, file: !371, line: 468, column: 40)
!812 = !DILocation(line: 472, column: 18, scope: !805)
!813 = !DILocation(line: 472, column: 7, scope: !805)
!814 = !DILocation(line: 473, column: 14, scope: !805)
!815 = !DILocation(line: 475, column: 12, scope: !816)
!816 = distinct !DILexicalBlock(scope: !805, file: !371, line: 475, column: 10)
!817 = !DILocation(line: 475, column: 11, scope: !816)
!818 = !DILocation(line: 475, column: 16, scope: !816)
!819 = !DILocation(line: 475, column: 10, scope: !805)
!820 = !DILocation(line: 476, column: 10, scope: !821)
!821 = distinct !DILexicalBlock(scope: !816, file: !371, line: 475, column: 27)
!822 = !DILocation(line: 479, column: 12, scope: !805)
!823 = !DILocation(line: 480, column: 33, scope: !805)
!824 = !DILocation(line: 480, column: 16, scope: !805)
!825 = !DILocation(line: 480, column: 14, scope: !805)
!826 = !DILocation(line: 467, column: 4, scope: !827)
!827 = !DILexicalBlockFile(scope: !773, file: !371, discriminator: 1)
!828 = distinct !{!828, !802}
!829 = !DILocation(line: 483, column: 8, scope: !830)
!830 = distinct !DILexicalBlock(scope: !773, file: !371, line: 483, column: 8)
!831 = !DILocation(line: 483, column: 15, scope: !830)
!832 = !DILocation(line: 483, column: 8, scope: !773)
!833 = !DILocation(line: 487, column: 19, scope: !834)
!834 = distinct !DILexicalBlock(scope: !830, file: !371, line: 483, column: 23)
!835 = !DILocation(line: 484, column: 7, scope: !834)
!836 = !DILocation(line: 490, column: 16, scope: !834)
!837 = !DILocation(line: 489, column: 7, scope: !834)
!838 = !DILocation(line: 492, column: 7, scope: !834)
!839 = !DILocation(line: 495, column: 25, scope: !773)
!840 = !DILocation(line: 495, column: 11, scope: !773)
!841 = !DILocation(line: 495, column: 9, scope: !773)
!842 = !DILocation(line: 497, column: 15, scope: !773)
!843 = !DILocation(line: 497, column: 4, scope: !773)
!844 = !DILocation(line: 499, column: 11, scope: !773)
!845 = !DILocation(line: 499, column: 4, scope: !773)
!846 = !DILocation(line: 500, column: 1, scope: !773)
!847 = distinct !DISubprogram(name: "Unicode_IsEmpty", scope: !848, file: !848, line: 272, type: !684, isLocal: true, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!848 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/unicodeBase.h", directory: "/home/lichi/Desktop/open-vm-tools/line196")
!849 = !DILocalVariable(name: "str", arg: 1, scope: !847, file: !848, line: 272, type: !375)
!850 = !DILocation(line: 272, column: 29, scope: !847)
!851 = !DILocation(line: 275, column: 11, scope: !847)
!852 = !DILocation(line: 275, column: 18, scope: !847)
!853 = !DILocation(line: 275, column: 4, scope: !847)
!854 = distinct !DISubprogram(name: "Unicode_Alloc", scope: !848, file: !848, line: 111, type: !855, isLocal: true, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!855 = !DISubroutineType(types: !856)
!856 = !{!458, !857, !859}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64, align: 64)
!858 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringEncoding", file: !4, line: 445, baseType: !3)
!860 = !DILocalVariable(name: "buffer", arg: 1, scope: !854, file: !848, line: 111, type: !857)
!861 = !DILocation(line: 111, column: 27, scope: !854)
!862 = !DILocalVariable(name: "encoding", arg: 2, scope: !854, file: !848, line: 112, type: !859)
!863 = !DILocation(line: 112, column: 30, scope: !854)
!864 = !DILocation(line: 114, column: 35, scope: !854)
!865 = !DILocation(line: 114, column: 47, scope: !854)
!866 = !DILocation(line: 114, column: 11, scope: !854)
!867 = !DILocation(line: 114, column: 4, scope: !854)
!868 = distinct !DISubprogram(name: "File_StripFwdSlashes", scope: !371, file: !371, line: 520, type: !774, isLocal: false, isDefinition: true, scopeLine: 521, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!869 = !DILocalVariable(name: "pathName", arg: 1, scope: !868, file: !371, line: 520, type: !375)
!870 = !DILocation(line: 520, column: 34, scope: !868)
!871 = !DILocalVariable(name: "ptr", scope: !868, file: !371, line: 522, type: !458)
!872 = !DILocation(line: 522, column: 10, scope: !868)
!873 = !DILocalVariable(name: "path", scope: !868, file: !371, line: 523, type: !458)
!874 = !DILocation(line: 523, column: 10, scope: !868)
!875 = !DILocalVariable(name: "cptr", scope: !868, file: !371, line: 524, type: !458)
!876 = !DILocation(line: 524, column: 10, scope: !868)
!877 = !DILocalVariable(name: "prev", scope: !868, file: !371, line: 525, type: !458)
!878 = !DILocation(line: 525, column: 10, scope: !868)
!879 = !DILocalVariable(name: "result", scope: !868, file: !371, line: 526, type: !458)
!880 = !DILocation(line: 526, column: 10, scope: !868)
!881 = !DILocation(line: 530, column: 33, scope: !868)
!882 = !DILocation(line: 530, column: 11, scope: !868)
!883 = !DILocation(line: 530, column: 9, scope: !868)
!884 = !DILocation(line: 533, column: 10, scope: !868)
!885 = !DILocation(line: 533, column: 8, scope: !868)
!886 = !DILocation(line: 534, column: 11, scope: !868)
!887 = !DILocation(line: 534, column: 9, scope: !868)
!888 = !DILocation(line: 535, column: 9, scope: !868)
!889 = !DILocation(line: 542, column: 4, scope: !868)
!890 = !DILocation(line: 542, column: 12, scope: !891)
!891 = !DILexicalBlockFile(scope: !868, file: !371, discriminator: 1)
!892 = !DILocation(line: 542, column: 11, scope: !891)
!893 = !DILocation(line: 542, column: 16, scope: !891)
!894 = !DILocation(line: 542, column: 4, scope: !891)
!895 = !DILocation(line: 543, column: 12, scope: !896)
!896 = distinct !DILexicalBlock(scope: !897, file: !371, line: 543, column: 11)
!897 = distinct !DILexicalBlock(scope: !868, file: !371, line: 542, column: 25)
!898 = !DILocation(line: 543, column: 11, scope: !896)
!899 = !DILocation(line: 543, column: 16, scope: !896)
!900 = !DILocation(line: 543, column: 11, scope: !897)
!901 = !DILocation(line: 544, column: 14, scope: !902)
!902 = distinct !DILexicalBlock(scope: !903, file: !371, line: 544, column: 14)
!903 = distinct !DILexicalBlock(scope: !896, file: !371, line: 543, column: 24)
!904 = !DILocation(line: 544, column: 22, scope: !902)
!905 = !DILocation(line: 544, column: 26, scope: !902)
!906 = !DILocation(line: 544, column: 19, scope: !902)
!907 = !DILocation(line: 544, column: 14, scope: !903)
!908 = !DILocation(line: 545, column: 24, scope: !909)
!909 = distinct !DILexicalBlock(scope: !902, file: !371, line: 544, column: 31)
!910 = !DILocation(line: 545, column: 23, scope: !909)
!911 = !DILocation(line: 545, column: 18, scope: !909)
!912 = !DILocation(line: 545, column: 21, scope: !909)
!913 = !DILocation(line: 546, column: 10, scope: !909)
!914 = !DILocation(line: 547, column: 17, scope: !903)
!915 = !DILocation(line: 547, column: 15, scope: !903)
!916 = !DILocation(line: 548, column: 7, scope: !903)
!917 = !DILocation(line: 549, column: 21, scope: !918)
!918 = distinct !DILexicalBlock(scope: !896, file: !371, line: 548, column: 14)
!919 = !DILocation(line: 549, column: 20, scope: !918)
!920 = !DILocation(line: 549, column: 15, scope: !918)
!921 = !DILocation(line: 549, column: 18, scope: !918)
!922 = !DILocation(line: 551, column: 10, scope: !897)
!923 = !DILocation(line: 542, column: 4, scope: !924)
!924 = !DILexicalBlockFile(scope: !868, file: !371, discriminator: 2)
!925 = distinct !{!925, !889}
!926 = !DILocation(line: 554, column: 5, scope: !868)
!927 = !DILocation(line: 554, column: 10, scope: !868)
!928 = !DILocation(line: 556, column: 35, scope: !868)
!929 = !DILocation(line: 556, column: 13, scope: !868)
!930 = !DILocation(line: 556, column: 11, scope: !868)
!931 = !DILocation(line: 558, column: 15, scope: !868)
!932 = !DILocation(line: 558, column: 4, scope: !868)
!933 = !DILocation(line: 560, column: 11, scope: !868)
!934 = !DILocation(line: 560, column: 4, scope: !868)
!935 = distinct !DISubprogram(name: "Unicode_AllocWithUTF8", scope: !848, file: !848, line: 139, type: !774, isLocal: true, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!936 = !DILocalVariable(name: "utf8String", arg: 1, scope: !935, file: !848, line: 139, type: !375)
!937 = !DILocation(line: 139, column: 35, scope: !935)
!938 = !DILocation(line: 141, column: 35, scope: !935)
!939 = !DILocation(line: 141, column: 11, scope: !935)
!940 = !DILocation(line: 141, column: 4, scope: !935)
!941 = distinct !DISubprogram(name: "File_FullPath", scope: !371, file: !371, line: 594, type: !774, isLocal: false, isDefinition: true, scopeLine: 595, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!942 = !DILocalVariable(name: "pathName", arg: 1, scope: !941, file: !371, line: 594, type: !375)
!943 = !DILocation(line: 594, column: 27, scope: !941)
!944 = !DILocalVariable(name: "cwd", scope: !941, file: !371, line: 596, type: !458)
!945 = !DILocation(line: 596, column: 10, scope: !941)
!946 = !DILocalVariable(name: "ret", scope: !941, file: !371, line: 597, type: !458)
!947 = !DILocation(line: 597, column: 10, scope: !941)
!948 = !DILocation(line: 599, column: 9, scope: !949)
!949 = distinct !DILexicalBlock(scope: !941, file: !371, line: 599, column: 8)
!950 = !DILocation(line: 599, column: 18, scope: !949)
!951 = !DILocation(line: 599, column: 26, scope: !949)
!952 = !DILocation(line: 599, column: 45, scope: !953)
!953 = !DILexicalBlockFile(scope: !949, file: !371, discriminator: 1)
!954 = !DILocation(line: 599, column: 29, scope: !953)
!955 = !DILocation(line: 599, column: 8, scope: !953)
!956 = !DILocation(line: 600, column: 11, scope: !957)
!957 = distinct !DILexicalBlock(scope: !949, file: !371, line: 599, column: 56)
!958 = !DILocation(line: 601, column: 4, scope: !957)
!959 = !DILocation(line: 602, column: 13, scope: !960)
!960 = distinct !DILexicalBlock(scope: !949, file: !371, line: 601, column: 11)
!961 = !DILocation(line: 602, column: 11, scope: !960)
!962 = !DILocation(line: 603, column: 11, scope: !963)
!963 = distinct !DILexicalBlock(scope: !960, file: !371, line: 603, column: 11)
!964 = !DILocation(line: 603, column: 15, scope: !963)
!965 = !DILocation(line: 603, column: 11, scope: !960)
!966 = !DILocation(line: 604, column: 10, scope: !967)
!967 = distinct !DILexicalBlock(scope: !963, file: !371, line: 603, column: 23)
!968 = !DILocation(line: 608, column: 9, scope: !969)
!969 = distinct !DILexicalBlock(scope: !941, file: !371, line: 608, column: 8)
!970 = !DILocation(line: 608, column: 18, scope: !969)
!971 = !DILocation(line: 608, column: 26, scope: !969)
!972 = !DILocation(line: 608, column: 45, scope: !973)
!973 = !DILexicalBlockFile(scope: !969, file: !371, discriminator: 1)
!974 = !DILocation(line: 608, column: 29, scope: !973)
!975 = !DILocation(line: 608, column: 8, scope: !973)
!976 = !DILocation(line: 609, column: 31, scope: !977)
!977 = distinct !DILexicalBlock(scope: !969, file: !371, line: 608, column: 56)
!978 = !DILocation(line: 609, column: 13, scope: !977)
!979 = !DILocation(line: 609, column: 11, scope: !977)
!980 = !DILocation(line: 610, column: 4, scope: !977)
!981 = !DILocalVariable(name: "path", scope: !982, file: !371, line: 611, type: !458)
!982 = distinct !DILexicalBlock(scope: !969, file: !371, line: 610, column: 11)
!983 = !DILocation(line: 611, column: 13, scope: !982)
!984 = !DILocation(line: 613, column: 27, scope: !985)
!985 = distinct !DILexicalBlock(scope: !982, file: !371, line: 613, column: 11)
!986 = !DILocation(line: 613, column: 11, scope: !985)
!987 = !DILocation(line: 613, column: 11, scope: !982)
!988 = !DILocation(line: 614, column: 35, scope: !989)
!989 = distinct !DILexicalBlock(scope: !985, file: !371, line: 613, column: 38)
!990 = !DILocation(line: 614, column: 17, scope: !989)
!991 = !DILocation(line: 614, column: 15, scope: !989)
!992 = !DILocation(line: 615, column: 7, scope: !989)
!993 = !DILocation(line: 616, column: 30, scope: !994)
!994 = distinct !DILexicalBlock(scope: !985, file: !371, line: 615, column: 14)
!995 = !DILocation(line: 616, column: 40, scope: !994)
!996 = !DILocation(line: 616, column: 17, scope: !994)
!997 = !DILocation(line: 616, column: 15, scope: !994)
!998 = !DILocation(line: 619, column: 28, scope: !982)
!999 = !DILocation(line: 619, column: 13, scope: !982)
!1000 = !DILocation(line: 619, column: 11, scope: !982)
!1001 = !DILocation(line: 620, column: 11, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !982, file: !371, line: 620, column: 11)
!1003 = !DILocation(line: 620, column: 15, scope: !1002)
!1004 = !DILocation(line: 620, column: 11, scope: !982)
!1005 = !DILocalVariable(name: "dir", scope: !1006, file: !371, line: 621, type: !458)
!1006 = distinct !DILexicalBlock(scope: !1002, file: !371, line: 620, column: 23)
!1007 = !DILocation(line: 621, column: 16, scope: !1006)
!1008 = !DILocalVariable(name: "file", scope: !1006, file: !371, line: 622, type: !458)
!1009 = !DILocation(line: 622, column: 16, scope: !1006)
!1010 = !DILocalVariable(name: "ancestorPath", scope: !1006, file: !371, line: 626, type: !458)
!1011 = !DILocation(line: 626, column: 16, scope: !1006)
!1012 = !DILocalVariable(name: "ancestorRealPath", scope: !1006, file: !371, line: 627, type: !458)
!1013 = !DILocation(line: 627, column: 16, scope: !1006)
!1014 = !DILocation(line: 630, column: 27, scope: !1006)
!1015 = !DILocation(line: 630, column: 10, scope: !1006)
!1016 = !DILocation(line: 640, column: 58, scope: !1006)
!1017 = !DILocation(line: 640, column: 25, scope: !1006)
!1018 = !DILocation(line: 640, column: 23, scope: !1006)
!1019 = !DILocation(line: 641, column: 44, scope: !1006)
!1020 = !DILocation(line: 641, column: 29, scope: !1006)
!1021 = !DILocation(line: 641, column: 27, scope: !1006)
!1022 = !DILocation(line: 647, column: 14, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1006, file: !371, line: 647, column: 14)
!1024 = !DILocation(line: 647, column: 31, scope: !1023)
!1025 = !DILocation(line: 647, column: 14, scope: !1006)
!1026 = !DILocation(line: 648, column: 40, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1023, file: !371, line: 647, column: 39)
!1028 = !DILocation(line: 648, column: 19, scope: !1027)
!1029 = !DILocation(line: 648, column: 17, scope: !1027)
!1030 = !DILocation(line: 649, column: 10, scope: !1027)
!1031 = !DILocation(line: 650, column: 33, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1023, file: !371, line: 649, column: 17)
!1033 = !DILocation(line: 650, column: 51, scope: !1032)
!1034 = !DILocation(line: 650, column: 65, scope: !1032)
!1035 = !DILocation(line: 650, column: 58, scope: !1032)
!1036 = !DILocation(line: 650, column: 56, scope: !1032)
!1037 = !DILocation(line: 650, column: 19, scope: !1038)
!1038 = !DILexicalBlockFile(scope: !1032, file: !371, discriminator: 1)
!1039 = !DILocation(line: 650, column: 17, scope: !1032)
!1040 = !DILocation(line: 651, column: 24, scope: !1032)
!1041 = !DILocation(line: 651, column: 13, scope: !1032)
!1042 = !DILocation(line: 654, column: 21, scope: !1006)
!1043 = !DILocation(line: 654, column: 10, scope: !1006)
!1044 = !DILocation(line: 656, column: 21, scope: !1006)
!1045 = !DILocation(line: 656, column: 10, scope: !1006)
!1046 = !DILocation(line: 657, column: 21, scope: !1006)
!1047 = !DILocation(line: 657, column: 10, scope: !1006)
!1048 = !DILocation(line: 658, column: 7, scope: !1006)
!1049 = !DILocation(line: 660, column: 18, scope: !982)
!1050 = !DILocation(line: 660, column: 7, scope: !982)
!1051 = !DILocation(line: 663, column: 15, scope: !941)
!1052 = !DILocation(line: 663, column: 4, scope: !941)
!1053 = !DILocation(line: 665, column: 11, scope: !941)
!1054 = !DILocation(line: 665, column: 4, scope: !941)
!1055 = !DILocation(line: 666, column: 1, scope: !941)
!1056 = distinct !DISubprogram(name: "File_IsFullPath", scope: !371, file: !371, line: 686, type: !684, isLocal: false, isDefinition: true, scopeLine: 687, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!1057 = !DILocalVariable(name: "pathName", arg: 1, scope: !1056, file: !371, line: 686, type: !375)
!1058 = !DILocation(line: 686, column: 29, scope: !1056)
!1059 = !DILocation(line: 689, column: 11, scope: !1056)
!1060 = !DILocation(line: 689, column: 20, scope: !1056)
!1061 = !DILocation(line: 689, column: 27, scope: !1056)
!1062 = !DILocation(line: 689, column: 30, scope: !1063)
!1063 = !DILexicalBlockFile(scope: !1056, file: !371, discriminator: 1)
!1064 = !DILocation(line: 689, column: 42, scope: !1063)
!1065 = !DILocation(line: 689, column: 27, scope: !1066)
!1066 = !DILexicalBlockFile(scope: !1056, file: !371, discriminator: 2)
!1067 = !DILocation(line: 689, column: 11, scope: !1066)
!1068 = !DILocation(line: 689, column: 4, scope: !1066)
!1069 = distinct !DISubprogram(name: "FilePosixNearestExistingAncestor", scope: !371, file: !371, line: 2043, type: !774, isLocal: true, isDefinition: true, scopeLine: 2044, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!1070 = !DILocalVariable(name: "path", arg: 1, scope: !1069, file: !371, line: 2043, type: !375)
!1071 = !DILocation(line: 2043, column: 46, scope: !1069)
!1072 = !DILocalVariable(name: "resultSize", scope: !1069, file: !371, line: 2045, type: !779)
!1073 = !DILocation(line: 2045, column: 11, scope: !1069)
!1074 = !DILocalVariable(name: "result", scope: !1069, file: !371, line: 2046, type: !458)
!1075 = !DILocation(line: 2046, column: 10, scope: !1069)
!1076 = !DILocalVariable(name: "statbuf", scope: !1069, file: !371, line: 2047, type: !564)
!1077 = !DILocation(line: 2047, column: 16, scope: !1069)
!1078 = !DILocation(line: 2049, column: 27, scope: !1069)
!1079 = !DILocation(line: 2049, column: 20, scope: !1069)
!1080 = !DILocation(line: 2049, column: 34, scope: !1069)
!1081 = !DILocation(line: 2049, column: 18, scope: !1069)
!1082 = !DILocation(line: 2049, column: 51, scope: !1083)
!1083 = !DILexicalBlockFile(scope: !1069, file: !371, discriminator: 1)
!1084 = !DILocation(line: 2049, column: 44, scope: !1083)
!1085 = !DILocation(line: 2049, column: 18, scope: !1083)
!1086 = !DILocation(line: 2049, column: 18, scope: !1087)
!1087 = !DILexicalBlockFile(scope: !1069, file: !371, discriminator: 2)
!1088 = !DILocation(line: 2049, column: 18, scope: !1089)
!1089 = !DILexicalBlockFile(scope: !1069, file: !371, discriminator: 3)
!1090 = !DILocation(line: 2049, column: 65, scope: !1089)
!1091 = !DILocation(line: 2049, column: 15, scope: !1089)
!1092 = !DILocation(line: 2050, column: 30, scope: !1069)
!1093 = !DILocation(line: 2050, column: 13, scope: !1069)
!1094 = !DILocation(line: 2050, column: 11, scope: !1069)
!1095 = !DILocation(line: 2051, column: 15, scope: !1069)
!1096 = !DILocation(line: 2051, column: 23, scope: !1069)
!1097 = !DILocation(line: 2051, column: 29, scope: !1069)
!1098 = !DILocation(line: 2051, column: 4, scope: !1069)
!1099 = !DILocation(line: 2053, column: 4, scope: !1069)
!1100 = !DILocalVariable(name: "ptr", scope: !1101, file: !371, line: 2054, type: !458)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !371, line: 2053, column: 13)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !371, line: 2053, column: 4)
!1103 = distinct !DILexicalBlock(scope: !1069, file: !371, line: 2053, column: 4)
!1104 = !DILocation(line: 2054, column: 13, scope: !1101)
!1105 = !DILocation(line: 2056, column: 12, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1101, file: !371, line: 2056, column: 11)
!1107 = !DILocation(line: 2056, column: 11, scope: !1106)
!1108 = !DILocation(line: 2056, column: 19, scope: !1106)
!1109 = !DILocation(line: 2056, column: 11, scope: !1101)
!1110 = !DILocation(line: 2057, column: 21, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1106, file: !371, line: 2056, column: 28)
!1112 = !DILocation(line: 2057, column: 30, scope: !1111)
!1113 = !DILocation(line: 2057, column: 29, scope: !1111)
!1114 = !DILocation(line: 2057, column: 35, scope: !1111)
!1115 = !DILocation(line: 2057, column: 55, scope: !1111)
!1116 = !DILocation(line: 2057, column: 10, scope: !1111)
!1117 = !DILocation(line: 2058, column: 10, scope: !1111)
!1118 = !DILocation(line: 2061, column: 22, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1101, file: !371, line: 2061, column: 11)
!1120 = !DILocation(line: 2061, column: 11, scope: !1119)
!1121 = !DILocation(line: 2061, column: 40, scope: !1119)
!1122 = !DILocation(line: 2061, column: 11, scope: !1101)
!1123 = !DILocation(line: 2062, column: 10, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1119, file: !371, line: 2061, column: 46)
!1125 = !DILocation(line: 2065, column: 21, scope: !1101)
!1126 = !DILocation(line: 2065, column: 13, scope: !1101)
!1127 = !DILocation(line: 2065, column: 11, scope: !1101)
!1128 = !DILocation(line: 2066, column: 11, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1101, file: !371, line: 2066, column: 11)
!1130 = !DILocation(line: 2066, column: 15, scope: !1129)
!1131 = !DILocation(line: 2066, column: 11, scope: !1101)
!1132 = !DILocation(line: 2067, column: 16, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1129, file: !371, line: 2066, column: 23)
!1134 = !DILocation(line: 2067, column: 14, scope: !1133)
!1135 = !DILocation(line: 2068, column: 7, scope: !1133)
!1136 = !DILocation(line: 2069, column: 8, scope: !1101)
!1137 = !DILocation(line: 2069, column: 12, scope: !1101)
!1138 = !DILocation(line: 2053, column: 4, scope: !1139)
!1139 = !DILexicalBlockFile(scope: !1102, file: !371, discriminator: 1)
!1140 = distinct !{!1140, !1099}
!1141 = !DILocation(line: 2072, column: 11, scope: !1069)
!1142 = !DILocation(line: 2072, column: 4, scope: !1069)
!1143 = distinct !DISubprogram(name: "File_GetTimes", scope: !371, file: !371, line: 712, type: !1144, isLocal: false, isDefinition: true, scopeLine: 717, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!436, !375, !1146, !1146, !1146, !1146}
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmTimeType", file: !362, line: 354, baseType: !1148)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !362, line: 172, baseType: !1149)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1150, line: 197, baseType: !584)
!1150 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line196")
!1151 = !DILocalVariable(name: "pathName", arg: 1, scope: !1143, file: !371, line: 712, type: !375)
!1152 = !DILocation(line: 712, column: 27, scope: !1143)
!1153 = !DILocalVariable(name: "createTime", arg: 2, scope: !1143, file: !371, line: 713, type: !1146)
!1154 = !DILocation(line: 713, column: 27, scope: !1143)
!1155 = !DILocalVariable(name: "accessTime", arg: 3, scope: !1143, file: !371, line: 714, type: !1146)
!1156 = !DILocation(line: 714, column: 27, scope: !1143)
!1157 = !DILocalVariable(name: "writeTime", arg: 4, scope: !1143, file: !371, line: 715, type: !1146)
!1158 = !DILocation(line: 715, column: 27, scope: !1143)
!1159 = !DILocalVariable(name: "attrChangeTime", arg: 5, scope: !1143, file: !371, line: 716, type: !1146)
!1160 = !DILocation(line: 716, column: 27, scope: !1143)
!1161 = !DILocalVariable(name: "statBuf", scope: !1143, file: !371, line: 718, type: !564)
!1162 = !DILocation(line: 718, column: 16, scope: !1143)
!1163 = !DILocation(line: 722, column: 5, scope: !1143)
!1164 = !DILocation(line: 722, column: 16, scope: !1143)
!1165 = !DILocation(line: 723, column: 5, scope: !1143)
!1166 = !DILocation(line: 723, column: 16, scope: !1143)
!1167 = !DILocation(line: 724, column: 5, scope: !1143)
!1168 = !DILocation(line: 724, column: 15, scope: !1143)
!1169 = !DILocation(line: 725, column: 5, scope: !1143)
!1170 = !DILocation(line: 725, column: 20, scope: !1143)
!1171 = !DILocation(line: 727, column: 20, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1143, file: !371, line: 727, column: 8)
!1173 = !DILocation(line: 727, column: 8, scope: !1172)
!1174 = !DILocation(line: 727, column: 40, scope: !1172)
!1175 = !DILocation(line: 727, column: 8, scope: !1143)
!1176 = !DILocation(line: 729, column: 11, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1172, file: !371, line: 727, column: 47)
!1178 = !DILocation(line: 729, column: 39, scope: !1177)
!1179 = !DILocation(line: 729, column: 38, scope: !1177)
!1180 = !DILocation(line: 729, column: 21, scope: !1181)
!1181 = !DILexicalBlockFile(scope: !1177, file: !371, discriminator: 1)
!1182 = !DILocation(line: 728, column: 7, scope: !1177)
!1183 = !DILocation(line: 731, column: 7, scope: !1177)
!1184 = !DILocation(line: 802, column: 52, scope: !1143)
!1185 = !DILocation(line: 802, column: 18, scope: !1143)
!1186 = !DILocation(line: 802, column: 5, scope: !1143)
!1187 = !DILocation(line: 802, column: 16, scope: !1143)
!1188 = !DILocation(line: 803, column: 51, scope: !1143)
!1189 = !DILocation(line: 803, column: 17, scope: !1143)
!1190 = !DILocation(line: 803, column: 5, scope: !1143)
!1191 = !DILocation(line: 803, column: 15, scope: !1143)
!1192 = !DILocation(line: 804, column: 56, scope: !1143)
!1193 = !DILocation(line: 804, column: 22, scope: !1143)
!1194 = !DILocation(line: 804, column: 5, scope: !1143)
!1195 = !DILocation(line: 804, column: 20, scope: !1143)
!1196 = !DILocation(line: 829, column: 4, scope: !1143)
!1197 = !DILocation(line: 830, column: 1, scope: !1143)
!1198 = distinct !DISubprogram(name: "File_SetTimes", scope: !371, file: !371, line: 852, type: !1199, isLocal: false, isDefinition: true, scopeLine: 857, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!436, !375, !1147, !1147, !1147, !1147}
!1201 = !DILocalVariable(name: "pathName", arg: 1, scope: !1198, file: !371, line: 852, type: !375)
!1202 = !DILocation(line: 852, column: 27, scope: !1198)
!1203 = !DILocalVariable(name: "createTime", arg: 2, scope: !1198, file: !371, line: 853, type: !1147)
!1204 = !DILocation(line: 853, column: 26, scope: !1198)
!1205 = !DILocalVariable(name: "accessTime", arg: 3, scope: !1198, file: !371, line: 854, type: !1147)
!1206 = !DILocation(line: 854, column: 26, scope: !1198)
!1207 = !DILocalVariable(name: "writeTime", arg: 4, scope: !1198, file: !371, line: 855, type: !1147)
!1208 = !DILocation(line: 855, column: 26, scope: !1198)
!1209 = !DILocalVariable(name: "attrChangeTime", arg: 5, scope: !1198, file: !371, line: 856, type: !1147)
!1210 = !DILocation(line: 856, column: 26, scope: !1198)
!1211 = !DILocalVariable(name: "times", scope: !1198, file: !371, line: 858, type: !1212)
!1212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1213, size: 256, align: 64, elements: !714)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !1214, line: 30, size: 128, align: 64, elements: !1215)
!1214 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line196")
!1215 = !{!1216, !1217}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1213, file: !1214, line: 32, baseType: !594, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1213, file: !1214, line: 33, baseType: !1218, size: 64, align: 64, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !569, line: 141, baseType: !584)
!1219 = !DILocation(line: 858, column: 19, scope: !1198)
!1220 = !DILocalVariable(name: "aTime", scope: !1198, file: !371, line: 859, type: !1221)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1222 = !DILocation(line: 859, column: 20, scope: !1198)
!1223 = !DILocalVariable(name: "wTime", scope: !1198, file: !371, line: 859, type: !1221)
!1224 = !DILocation(line: 859, column: 28, scope: !1198)
!1225 = !DILocalVariable(name: "statBuf", scope: !1198, file: !371, line: 860, type: !564)
!1226 = !DILocation(line: 860, column: 16, scope: !1198)
!1227 = !DILocalVariable(name: "path", scope: !1198, file: !371, line: 861, type: !458)
!1228 = !DILocation(line: 861, column: 10, scope: !1198)
!1229 = !DILocalVariable(name: "err", scope: !1198, file: !371, line: 862, type: !374)
!1230 = !DILocation(line: 862, column: 8, scope: !1198)
!1231 = !DILocation(line: 864, column: 8, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1198, file: !371, line: 864, column: 8)
!1233 = !DILocation(line: 864, column: 17, scope: !1232)
!1234 = !DILocation(line: 864, column: 8, scope: !1198)
!1235 = !DILocation(line: 865, column: 7, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1232, file: !371, line: 864, column: 25)
!1237 = !DILocation(line: 868, column: 33, scope: !1198)
!1238 = !DILocation(line: 868, column: 11, scope: !1198)
!1239 = !DILocation(line: 868, column: 9, scope: !1198)
!1240 = !DILocation(line: 869, column: 8, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1198, file: !371, line: 869, column: 8)
!1242 = !DILocation(line: 869, column: 13, scope: !1241)
!1243 = !DILocation(line: 869, column: 8, scope: !1198)
!1244 = !DILocation(line: 871, column: 25, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1241, file: !371, line: 869, column: 21)
!1246 = !DILocation(line: 870, column: 7, scope: !1245)
!1247 = !DILocation(line: 873, column: 7, scope: !1245)
!1248 = !DILocation(line: 876, column: 17, scope: !1198)
!1249 = !DILocation(line: 876, column: 11, scope: !1198)
!1250 = !DILocation(line: 876, column: 33, scope: !1198)
!1251 = !DILocation(line: 876, column: 10, scope: !1198)
!1252 = !DILocation(line: 876, column: 43, scope: !1253)
!1253 = !DILexicalBlockFile(scope: !1198, file: !371, discriminator: 1)
!1254 = !DILocation(line: 876, column: 42, scope: !1253)
!1255 = !DILocation(line: 876, column: 10, scope: !1253)
!1256 = !DILocation(line: 876, column: 10, scope: !1257)
!1257 = !DILexicalBlockFile(scope: !1198, file: !371, discriminator: 2)
!1258 = !DILocation(line: 876, column: 10, scope: !1259)
!1259 = !DILexicalBlockFile(scope: !1198, file: !371, discriminator: 3)
!1260 = !DILocation(line: 876, column: 8, scope: !1259)
!1261 = !DILocation(line: 878, column: 8, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1198, file: !371, line: 878, column: 8)
!1263 = !DILocation(line: 878, column: 12, scope: !1262)
!1264 = !DILocation(line: 878, column: 8, scope: !1198)
!1265 = !DILocation(line: 880, column: 11, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1262, file: !371, line: 878, column: 18)
!1267 = !DILocation(line: 880, column: 38, scope: !1266)
!1268 = !DILocation(line: 880, column: 21, scope: !1266)
!1269 = !DILocation(line: 879, column: 7, scope: !1266)
!1270 = !DILocation(line: 881, column: 18, scope: !1266)
!1271 = !DILocation(line: 881, column: 7, scope: !1266)
!1272 = !DILocation(line: 883, column: 7, scope: !1266)
!1273 = !DILocation(line: 886, column: 13, scope: !1198)
!1274 = !DILocation(line: 886, column: 10, scope: !1198)
!1275 = !DILocation(line: 887, column: 13, scope: !1198)
!1276 = !DILocation(line: 887, column: 10, scope: !1198)
!1277 = !DILocation(line: 894, column: 27, scope: !1198)
!1278 = !DILocation(line: 894, column: 35, scope: !1198)
!1279 = !DILocation(line: 894, column: 4, scope: !1198)
!1280 = !DILocation(line: 894, column: 11, scope: !1198)
!1281 = !DILocation(line: 894, column: 18, scope: !1198)
!1282 = !DILocation(line: 895, column: 4, scope: !1198)
!1283 = !DILocation(line: 895, column: 11, scope: !1198)
!1284 = !DILocation(line: 895, column: 19, scope: !1198)
!1285 = !DILocation(line: 896, column: 27, scope: !1198)
!1286 = !DILocation(line: 896, column: 35, scope: !1198)
!1287 = !DILocation(line: 896, column: 4, scope: !1198)
!1288 = !DILocation(line: 896, column: 11, scope: !1198)
!1289 = !DILocation(line: 896, column: 18, scope: !1198)
!1290 = !DILocation(line: 897, column: 4, scope: !1198)
!1291 = !DILocation(line: 897, column: 11, scope: !1198)
!1292 = !DILocation(line: 897, column: 19, scope: !1198)
!1293 = !DILocation(line: 899, column: 8, scope: !1294)
!1294 = distinct !DILexicalBlock(scope: !1198, file: !371, line: 899, column: 8)
!1295 = !DILocation(line: 899, column: 19, scope: !1294)
!1296 = !DILocation(line: 899, column: 8, scope: !1198)
!1297 = !DILocalVariable(name: "ts", scope: !1298, file: !371, line: 900, type: !590)
!1298 = distinct !DILexicalBlock(scope: !1294, file: !371, line: 899, column: 24)
!1299 = !DILocation(line: 900, column: 23, scope: !1298)
!1300 = !DILocation(line: 902, column: 38, scope: !1298)
!1301 = !DILocation(line: 902, column: 7, scope: !1298)
!1302 = !DILocation(line: 903, column: 26, scope: !1298)
!1303 = !DILocation(line: 903, column: 7, scope: !1298)
!1304 = !DILocation(line: 903, column: 14, scope: !1298)
!1305 = !DILocation(line: 903, column: 21, scope: !1298)
!1306 = !DILocation(line: 904, column: 27, scope: !1298)
!1307 = !DILocation(line: 904, column: 35, scope: !1298)
!1308 = !DILocation(line: 904, column: 7, scope: !1298)
!1309 = !DILocation(line: 904, column: 14, scope: !1298)
!1310 = !DILocation(line: 904, column: 22, scope: !1298)
!1311 = !DILocation(line: 905, column: 4, scope: !1298)
!1312 = !DILocation(line: 907, column: 8, scope: !1313)
!1313 = distinct !DILexicalBlock(scope: !1198, file: !371, line: 907, column: 8)
!1314 = !DILocation(line: 907, column: 18, scope: !1313)
!1315 = !DILocation(line: 907, column: 8, scope: !1198)
!1316 = !DILocalVariable(name: "ts", scope: !1317, file: !371, line: 908, type: !590)
!1317 = distinct !DILexicalBlock(scope: !1313, file: !371, line: 907, column: 23)
!1318 = !DILocation(line: 908, column: 23, scope: !1317)
!1319 = !DILocation(line: 910, column: 38, scope: !1317)
!1320 = !DILocation(line: 910, column: 7, scope: !1317)
!1321 = !DILocation(line: 911, column: 26, scope: !1317)
!1322 = !DILocation(line: 911, column: 7, scope: !1317)
!1323 = !DILocation(line: 911, column: 14, scope: !1317)
!1324 = !DILocation(line: 911, column: 21, scope: !1317)
!1325 = !DILocation(line: 912, column: 27, scope: !1317)
!1326 = !DILocation(line: 912, column: 35, scope: !1317)
!1327 = !DILocation(line: 912, column: 7, scope: !1317)
!1328 = !DILocation(line: 912, column: 14, scope: !1317)
!1329 = !DILocation(line: 912, column: 22, scope: !1317)
!1330 = !DILocation(line: 913, column: 4, scope: !1317)
!1331 = !DILocation(line: 915, column: 18, scope: !1198)
!1332 = !DILocation(line: 915, column: 24, scope: !1198)
!1333 = !DILocation(line: 915, column: 11, scope: !1198)
!1334 = !DILocation(line: 915, column: 31, scope: !1198)
!1335 = !DILocation(line: 915, column: 10, scope: !1198)
!1336 = !DILocation(line: 915, column: 41, scope: !1253)
!1337 = !DILocation(line: 915, column: 40, scope: !1253)
!1338 = !DILocation(line: 915, column: 10, scope: !1253)
!1339 = !DILocation(line: 915, column: 10, scope: !1257)
!1340 = !DILocation(line: 915, column: 10, scope: !1259)
!1341 = !DILocation(line: 915, column: 8, scope: !1259)
!1342 = !DILocation(line: 917, column: 15, scope: !1198)
!1343 = !DILocation(line: 917, column: 4, scope: !1198)
!1344 = !DILocation(line: 919, column: 8, scope: !1345)
!1345 = distinct !DILexicalBlock(scope: !1198, file: !371, line: 919, column: 8)
!1346 = !DILocation(line: 919, column: 12, scope: !1345)
!1347 = !DILocation(line: 919, column: 8, scope: !1198)
!1348 = !DILocation(line: 921, column: 11, scope: !1349)
!1349 = distinct !DILexicalBlock(scope: !1345, file: !371, line: 919, column: 18)
!1350 = !DILocation(line: 921, column: 38, scope: !1349)
!1351 = !DILocation(line: 921, column: 21, scope: !1349)
!1352 = !DILocation(line: 920, column: 7, scope: !1349)
!1353 = !DILocation(line: 923, column: 7, scope: !1349)
!1354 = !DILocation(line: 926, column: 4, scope: !1198)
!1355 = !DILocation(line: 927, column: 1, scope: !1198)
!1356 = distinct !DISubprogram(name: "File_SetFilePermissions", scope: !371, file: !371, line: 947, type: !1357, isLocal: false, isDefinition: true, scopeLine: 949, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!436, !375, !374}
!1359 = !DILocalVariable(name: "pathName", arg: 1, scope: !1356, file: !371, line: 947, type: !375)
!1360 = !DILocation(line: 947, column: 37, scope: !1356)
!1361 = !DILocalVariable(name: "perms", arg: 2, scope: !1356, file: !371, line: 948, type: !374)
!1362 = !DILocation(line: 948, column: 29, scope: !1356)
!1363 = !DILocation(line: 952, column: 20, scope: !1364)
!1364 = distinct !DILexicalBlock(scope: !1356, file: !371, line: 952, column: 8)
!1365 = !DILocation(line: 952, column: 30, scope: !1364)
!1366 = !DILocation(line: 952, column: 8, scope: !1364)
!1367 = !DILocation(line: 952, column: 37, scope: !1364)
!1368 = !DILocation(line: 952, column: 8, scope: !1356)
!1369 = !DILocation(line: 955, column: 25, scope: !1370)
!1370 = distinct !DILexicalBlock(scope: !1364, file: !371, line: 952, column: 44)
!1371 = !DILocation(line: 955, column: 53, scope: !1370)
!1372 = !DILocation(line: 955, column: 52, scope: !1370)
!1373 = !DILocation(line: 955, column: 35, scope: !1374)
!1374 = !DILexicalBlockFile(scope: !1370, file: !371, discriminator: 1)
!1375 = !DILocation(line: 954, column: 7, scope: !1370)
!1376 = !DILocation(line: 957, column: 7, scope: !1370)
!1377 = !DILocation(line: 960, column: 4, scope: !1356)
!1378 = !DILocation(line: 961, column: 1, scope: !1356)
!1379 = distinct !DISubprogram(name: "File_GetParent", scope: !371, file: !371, line: 1042, type: !1380, isLocal: false, isDefinition: true, scopeLine: 1043, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!1380 = !DISubroutineType(types: !1381)
!1381 = !{!436, !1382}
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!1383 = !DILocalVariable(name: "canPath", arg: 1, scope: !1379, file: !371, line: 1042, type: !1382)
!1384 = !DILocation(line: 1042, column: 23, scope: !1379)
!1385 = !DILocation(line: 1044, column: 30, scope: !1379)
!1386 = !DILocation(line: 1044, column: 11, scope: !1379)
!1387 = !DILocation(line: 1044, column: 4, scope: !1379)
!1388 = distinct !DISubprogram(name: "FilePosixGetParent", scope: !371, file: !371, line: 992, type: !1380, isLocal: true, isDefinition: true, scopeLine: 993, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!1389 = !DILocalVariable(name: "canPath", arg: 1, scope: !1388, file: !371, line: 992, type: !1382)
!1390 = !DILocation(line: 992, column: 27, scope: !1388)
!1391 = !DILocalVariable(name: "pathName", scope: !1388, file: !371, line: 994, type: !458)
!1392 = !DILocation(line: 994, column: 10, scope: !1388)
!1393 = !DILocalVariable(name: "baseName", scope: !1388, file: !371, line: 995, type: !458)
!1394 = !DILocation(line: 995, column: 10, scope: !1388)
!1395 = !DILocation(line: 1000, column: 25, scope: !1396)
!1396 = distinct !DILexicalBlock(scope: !1388, file: !371, line: 1000, column: 8)
!1397 = !DILocation(line: 1000, column: 24, scope: !1396)
!1398 = !DILocation(line: 1000, column: 8, scope: !1396)
!1399 = !DILocation(line: 1000, column: 39, scope: !1396)
!1400 = !DILocation(line: 1000, column: 8, scope: !1388)
!1401 = !DILocation(line: 1001, column: 7, scope: !1402)
!1402 = distinct !DILexicalBlock(scope: !1396, file: !371, line: 1000, column: 45)
!1403 = !DILocation(line: 1004, column: 22, scope: !1388)
!1404 = !DILocation(line: 1004, column: 21, scope: !1388)
!1405 = !DILocation(line: 1004, column: 4, scope: !1388)
!1406 = !DILocation(line: 1006, column: 16, scope: !1388)
!1407 = !DILocation(line: 1006, column: 15, scope: !1388)
!1408 = !DILocation(line: 1006, column: 4, scope: !1388)
!1409 = !DILocation(line: 1008, column: 24, scope: !1410)
!1410 = distinct !DILexicalBlock(scope: !1388, file: !371, line: 1008, column: 8)
!1411 = !DILocation(line: 1008, column: 8, scope: !1410)
!1412 = !DILocation(line: 1008, column: 8, scope: !1388)
!1413 = !DILocation(line: 1010, column: 18, scope: !1414)
!1414 = distinct !DILexicalBlock(scope: !1410, file: !371, line: 1008, column: 35)
!1415 = !DILocation(line: 1010, column: 7, scope: !1414)
!1416 = !DILocation(line: 1011, column: 18, scope: !1414)
!1417 = !DILocation(line: 1011, column: 8, scope: !1414)
!1418 = !DILocation(line: 1011, column: 16, scope: !1414)
!1419 = !DILocation(line: 1012, column: 4, scope: !1414)
!1420 = !DILocation(line: 1013, column: 27, scope: !1421)
!1421 = distinct !DILexicalBlock(scope: !1422, file: !371, line: 1013, column: 11)
!1422 = distinct !DILexicalBlock(scope: !1410, file: !371, line: 1012, column: 11)
!1423 = !DILocation(line: 1013, column: 11, scope: !1421)
!1424 = !DILocation(line: 1013, column: 11, scope: !1422)
!1425 = !DILocation(line: 1014, column: 27, scope: !1426)
!1426 = distinct !DILexicalBlock(scope: !1421, file: !371, line: 1013, column: 38)
!1427 = !DILocation(line: 1014, column: 37, scope: !1426)
!1428 = !DILocation(line: 1014, column: 10, scope: !1426)
!1429 = !DILocation(line: 1015, column: 21, scope: !1426)
!1430 = !DILocation(line: 1015, column: 10, scope: !1426)
!1431 = !DILocation(line: 1016, column: 7, scope: !1426)
!1432 = !DILocation(line: 1017, column: 21, scope: !1433)
!1433 = distinct !DILexicalBlock(scope: !1421, file: !371, line: 1016, column: 14)
!1434 = !DILocation(line: 1017, column: 11, scope: !1433)
!1435 = !DILocation(line: 1017, column: 19, scope: !1433)
!1436 = !DILocation(line: 1021, column: 15, scope: !1388)
!1437 = !DILocation(line: 1021, column: 4, scope: !1388)
!1438 = !DILocation(line: 1023, column: 4, scope: !1388)
!1439 = !DILocation(line: 1024, column: 1, scope: !1388)
!1440 = distinct !DISubprogram(name: "File_GetFreeSpace", scope: !371, file: !371, line: 1116, type: !1441, isLocal: false, isDefinition: true, scopeLine: 1118, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{!361, !375, !436}
!1443 = !DILocalVariable(name: "pathName", arg: 1, scope: !1440, file: !371, line: 1116, type: !375)
!1444 = !DILocation(line: 1116, column: 31, scope: !1440)
!1445 = !DILocalVariable(name: "doNotAscend", arg: 2, scope: !1440, file: !371, line: 1117, type: !436)
!1446 = !DILocation(line: 1117, column: 24, scope: !1440)
!1447 = !DILocalVariable(name: "ret", scope: !1440, file: !371, line: 1119, type: !361)
!1448 = !DILocation(line: 1119, column: 11, scope: !1440)
!1449 = !DILocalVariable(name: "fullPath", scope: !1440, file: !371, line: 1120, type: !458)
!1450 = !DILocation(line: 1120, column: 10, scope: !1440)
!1451 = !DILocalVariable(name: "statfsbuf", scope: !1440, file: !371, line: 1121, type: !695)
!1452 = !DILocation(line: 1121, column: 18, scope: !1440)
!1453 = !DILocation(line: 1123, column: 29, scope: !1440)
!1454 = !DILocation(line: 1123, column: 15, scope: !1440)
!1455 = !DILocation(line: 1123, column: 13, scope: !1440)
!1456 = !DILocation(line: 1124, column: 8, scope: !1457)
!1457 = distinct !DILexicalBlock(scope: !1440, file: !371, line: 1124, column: 8)
!1458 = !DILocation(line: 1124, column: 17, scope: !1457)
!1459 = !DILocation(line: 1124, column: 8, scope: !1440)
!1460 = !DILocation(line: 1125, column: 7, scope: !1461)
!1461 = distinct !DILexicalBlock(scope: !1457, file: !371, line: 1124, column: 25)
!1462 = !DILocation(line: 1128, column: 21, scope: !1463)
!1463 = distinct !DILexicalBlock(scope: !1440, file: !371, line: 1128, column: 8)
!1464 = !DILocation(line: 1128, column: 31, scope: !1463)
!1465 = !DILocation(line: 1128, column: 8, scope: !1463)
!1466 = !DILocation(line: 1128, column: 8, scope: !1440)
!1467 = !DILocation(line: 1129, column: 32, scope: !1468)
!1468 = distinct !DILexicalBlock(scope: !1463, file: !371, line: 1128, column: 57)
!1469 = !DILocation(line: 1129, column: 53, scope: !1468)
!1470 = !DILocation(line: 1129, column: 41, scope: !1468)
!1471 = !DILocation(line: 1129, column: 11, scope: !1468)
!1472 = !DILocation(line: 1130, column: 4, scope: !1468)
!1473 = !DILocation(line: 1131, column: 53, scope: !1474)
!1474 = distinct !DILexicalBlock(scope: !1463, file: !371, line: 1130, column: 11)
!1475 = !DILocation(line: 1131, column: 7, scope: !1474)
!1476 = !DILocation(line: 1132, column: 11, scope: !1474)
!1477 = !DILocation(line: 1135, column: 15, scope: !1440)
!1478 = !DILocation(line: 1135, column: 4, scope: !1440)
!1479 = !DILocation(line: 1137, column: 11, scope: !1440)
!1480 = !DILocation(line: 1137, column: 4, scope: !1440)
!1481 = !DILocation(line: 1138, column: 1, scope: !1440)
!1482 = distinct !DISubprogram(name: "FileGetStats", scope: !371, file: !371, line: 1068, type: !1483, isLocal: true, isDefinition: true, scopeLine: 1071, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!1483 = !DISubroutineType(types: !1484)
!1484 = !{!436, !375, !436, !1485}
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, align: 64)
!1486 = !DILocalVariable(name: "pathName", arg: 1, scope: !1482, file: !371, line: 1068, type: !375)
!1487 = !DILocation(line: 1068, column: 26, scope: !1482)
!1488 = !DILocalVariable(name: "doNotAscend", arg: 2, scope: !1482, file: !371, line: 1069, type: !436)
!1489 = !DILocation(line: 1069, column: 19, scope: !1482)
!1490 = !DILocalVariable(name: "pstatfsbuf", arg: 3, scope: !1482, file: !371, line: 1070, type: !1485)
!1491 = !DILocation(line: 1070, column: 29, scope: !1482)
!1492 = !DILocalVariable(name: "retval", scope: !1482, file: !371, line: 1072, type: !436)
!1493 = !DILocation(line: 1072, column: 9, scope: !1482)
!1494 = !DILocalVariable(name: "dupPath", scope: !1482, file: !371, line: 1073, type: !458)
!1495 = !DILocation(line: 1073, column: 10, scope: !1482)
!1496 = !DILocation(line: 1075, column: 4, scope: !1482)
!1497 = !DILocation(line: 1075, column: 24, scope: !1498)
!1498 = !DILexicalBlockFile(scope: !1482, file: !371, discriminator: 1)
!1499 = !DILocation(line: 1075, column: 34, scope: !1500)
!1500 = !DILexicalBlockFile(scope: !1482, file: !371, discriminator: 2)
!1501 = !DILocation(line: 1075, column: 24, scope: !1500)
!1502 = !DILocation(line: 1075, column: 44, scope: !1503)
!1503 = !DILexicalBlockFile(scope: !1482, file: !371, discriminator: 3)
!1504 = !DILocation(line: 1075, column: 24, scope: !1503)
!1505 = !DILocation(line: 1075, column: 24, scope: !1506)
!1506 = !DILexicalBlockFile(scope: !1482, file: !371, discriminator: 4)
!1507 = !DILocation(line: 1076, column: 30, scope: !1482)
!1508 = !DILocation(line: 1075, column: 11, scope: !1506)
!1509 = !DILocation(line: 1076, column: 42, scope: !1482)
!1510 = !DILocation(line: 1075, column: 4, scope: !1506)
!1511 = !DILocation(line: 1077, column: 12, scope: !1512)
!1512 = distinct !DILexicalBlock(scope: !1513, file: !371, line: 1077, column: 10)
!1513 = distinct !DILexicalBlock(scope: !1482, file: !371, line: 1076, column: 49)
!1514 = !DILocation(line: 1077, column: 11, scope: !1512)
!1515 = !DILocation(line: 1077, column: 16, scope: !1512)
!1516 = !DILocation(line: 1077, column: 26, scope: !1512)
!1517 = !DILocation(line: 1077, column: 29, scope: !1518)
!1518 = !DILexicalBlockFile(scope: !1512, file: !371, discriminator: 1)
!1519 = !DILocation(line: 1077, column: 10, scope: !1518)
!1520 = !DILocation(line: 1078, column: 17, scope: !1521)
!1521 = distinct !DILexicalBlock(scope: !1512, file: !371, line: 1077, column: 42)
!1522 = !DILocation(line: 1079, column: 10, scope: !1521)
!1523 = !DILocation(line: 1082, column: 11, scope: !1524)
!1524 = distinct !DILexicalBlock(scope: !1513, file: !371, line: 1082, column: 11)
!1525 = !DILocation(line: 1082, column: 19, scope: !1524)
!1526 = !DILocation(line: 1082, column: 11, scope: !1513)
!1527 = !DILocation(line: 1084, column: 38, scope: !1528)
!1528 = distinct !DILexicalBlock(scope: !1524, file: !371, line: 1082, column: 27)
!1529 = !DILocation(line: 1084, column: 20, scope: !1528)
!1530 = !DILocation(line: 1084, column: 18, scope: !1528)
!1531 = !DILocation(line: 1085, column: 7, scope: !1528)
!1532 = !DILocation(line: 1087, column: 7, scope: !1513)
!1533 = !DILocation(line: 1075, column: 4, scope: !1534)
!1534 = !DILexicalBlockFile(scope: !1482, file: !371, discriminator: 5)
!1535 = distinct !{!1535, !1496}
!1536 = !DILocation(line: 1090, column: 15, scope: !1482)
!1537 = !DILocation(line: 1090, column: 4, scope: !1482)
!1538 = !DILocation(line: 1092, column: 11, scope: !1482)
!1539 = !DILocation(line: 1092, column: 4, scope: !1482)
!1540 = distinct !DISubprogram(name: "File_SupportsZeroedThick", scope: !371, file: !371, line: 1519, type: !684, isLocal: false, isDefinition: true, scopeLine: 1520, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!1541 = !DILocalVariable(name: "pathName", arg: 1, scope: !1540, file: !371, line: 1519, type: !375)
!1542 = !DILocation(line: 1519, column: 38, scope: !1540)
!1543 = !DILocation(line: 1521, column: 22, scope: !1540)
!1544 = !DILocation(line: 1521, column: 11, scope: !1540)
!1545 = !DILocation(line: 1521, column: 4, scope: !1540)
!1546 = distinct !DISubprogram(name: "FileIsVMFS", scope: !371, file: !371, line: 1474, type: !684, isLocal: true, isDefinition: true, scopeLine: 1475, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!1547 = !DILocalVariable(name: "pathName", arg: 1, scope: !1546, file: !371, line: 1474, type: !375)
!1548 = !DILocation(line: 1474, column: 24, scope: !1546)
!1549 = !DILocalVariable(name: "result", scope: !1546, file: !371, line: 1476, type: !436)
!1550 = !DILocation(line: 1476, column: 9, scope: !1546)
!1551 = !DILocation(line: 1495, column: 11, scope: !1546)
!1552 = !DILocation(line: 1495, column: 4, scope: !1546)
!1553 = distinct !DISubprogram(name: "File_SupportsMultiWriter", scope: !371, file: !371, line: 1545, type: !684, isLocal: false, isDefinition: true, scopeLine: 1546, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!1554 = !DILocalVariable(name: "pathName", arg: 1, scope: !1553, file: !371, line: 1545, type: !375)
!1555 = !DILocation(line: 1545, column: 38, scope: !1553)
!1556 = !DILocation(line: 1547, column: 22, scope: !1553)
!1557 = !DILocation(line: 1547, column: 11, scope: !1553)
!1558 = !DILocation(line: 1547, column: 4, scope: !1553)
!1559 = distinct !DISubprogram(name: "File_SupportsOptimisticLock", scope: !371, file: !371, line: 1569, type: !684, isLocal: false, isDefinition: true, scopeLine: 1570, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!1560 = !DILocalVariable(name: "pathName", arg: 1, scope: !1559, file: !371, line: 1569, type: !375)
!1561 = !DILocation(line: 1569, column: 41, scope: !1559)
!1562 = !DILocation(line: 1596, column: 4, scope: !1559)
!1563 = distinct !DISubprogram(name: "File_GetCapacity", scope: !371, file: !371, line: 1619, type: !1564, isLocal: false, isDefinition: true, scopeLine: 1620, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!1564 = !DISubroutineType(types: !1565)
!1565 = !{!361, !375}
!1566 = !DILocalVariable(name: "pathName", arg: 1, scope: !1563, file: !371, line: 1619, type: !375)
!1567 = !DILocation(line: 1619, column: 30, scope: !1563)
!1568 = !DILocalVariable(name: "ret", scope: !1563, file: !371, line: 1621, type: !361)
!1569 = !DILocation(line: 1621, column: 11, scope: !1563)
!1570 = !DILocalVariable(name: "fullPath", scope: !1563, file: !371, line: 1622, type: !458)
!1571 = !DILocation(line: 1622, column: 10, scope: !1563)
!1572 = !DILocalVariable(name: "statfsbuf", scope: !1563, file: !371, line: 1623, type: !695)
!1573 = !DILocation(line: 1623, column: 18, scope: !1563)
!1574 = !DILocation(line: 1625, column: 29, scope: !1563)
!1575 = !DILocation(line: 1625, column: 15, scope: !1563)
!1576 = !DILocation(line: 1625, column: 13, scope: !1563)
!1577 = !DILocation(line: 1626, column: 8, scope: !1578)
!1578 = distinct !DILexicalBlock(scope: !1563, file: !371, line: 1626, column: 8)
!1579 = !DILocation(line: 1626, column: 17, scope: !1578)
!1580 = !DILocation(line: 1626, column: 8, scope: !1563)
!1581 = !DILocation(line: 1627, column: 7, scope: !1582)
!1582 = distinct !DILexicalBlock(scope: !1578, file: !371, line: 1626, column: 25)
!1583 = !DILocation(line: 1630, column: 21, scope: !1584)
!1584 = distinct !DILexicalBlock(scope: !1563, file: !371, line: 1630, column: 8)
!1585 = !DILocation(line: 1630, column: 8, scope: !1584)
!1586 = !DILocation(line: 1630, column: 8, scope: !1563)
!1587 = !DILocation(line: 1631, column: 32, scope: !1588)
!1588 = distinct !DILexicalBlock(scope: !1584, file: !371, line: 1630, column: 47)
!1589 = !DILocation(line: 1631, column: 53, scope: !1588)
!1590 = !DILocation(line: 1631, column: 41, scope: !1588)
!1591 = !DILocation(line: 1631, column: 11, scope: !1588)
!1592 = !DILocation(line: 1632, column: 4, scope: !1588)
!1593 = !DILocation(line: 1633, column: 7, scope: !1594)
!1594 = distinct !DILexicalBlock(scope: !1584, file: !371, line: 1632, column: 11)
!1595 = !DILocation(line: 1634, column: 11, scope: !1594)
!1596 = !DILocation(line: 1637, column: 15, scope: !1563)
!1597 = !DILocation(line: 1637, column: 4, scope: !1563)
!1598 = !DILocation(line: 1639, column: 11, scope: !1563)
!1599 = !DILocation(line: 1639, column: 4, scope: !1563)
!1600 = !DILocation(line: 1640, column: 1, scope: !1563)
!1601 = distinct !DISubprogram(name: "File_GetUniqueFileSystemID", scope: !371, file: !371, line: 1670, type: !774, isLocal: false, isDefinition: true, scopeLine: 1671, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!1602 = !DILocalVariable(name: "path", arg: 1, scope: !1601, file: !371, line: 1670, type: !375)
!1603 = !DILocation(line: 1670, column: 40, scope: !1601)
!1604 = !DILocation(line: 1742, column: 35, scope: !1601)
!1605 = !DILocation(line: 1742, column: 11, scope: !1601)
!1606 = !DILocation(line: 1742, column: 4, scope: !1601)
!1607 = distinct !DISubprogram(name: "FilePosixGetBlockDevice", scope: !371, file: !371, line: 1890, type: !774, isLocal: false, isDefinition: true, scopeLine: 1891, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!1608 = !DILocalVariable(name: "path", arg: 1, scope: !1607, file: !371, line: 1890, type: !375)
!1609 = !DILocation(line: 1890, column: 37, scope: !1607)
!1610 = !DILocalVariable(name: "existPath", scope: !1607, file: !371, line: 1892, type: !458)
!1611 = !DILocation(line: 1892, column: 10, scope: !1607)
!1612 = !DILocalVariable(name: "failed", scope: !1607, file: !371, line: 1893, type: !436)
!1613 = !DILocation(line: 1893, column: 9, scope: !1607)
!1614 = !DILocalVariable(name: "canPath", scope: !1607, file: !371, line: 1897, type: !1615)
!1615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 32768, align: 8, elements: !1616)
!1616 = !{!1617}
!1617 = !DISubrange(count: 4096)
!1618 = !DILocation(line: 1897, column: 9, scope: !1607)
!1619 = !DILocalVariable(name: "canPath2", scope: !1607, file: !371, line: 1898, type: !1615)
!1620 = !DILocation(line: 1898, column: 9, scope: !1607)
!1621 = !DILocalVariable(name: "retries", scope: !1607, file: !371, line: 1899, type: !421)
!1622 = !DILocation(line: 1899, column: 17, scope: !1607)
!1623 = !DILocalVariable(name: "realPath", scope: !1607, file: !371, line: 1900, type: !458)
!1624 = !DILocation(line: 1900, column: 10, scope: !1607)
!1625 = !DILocation(line: 1903, column: 49, scope: !1607)
!1626 = !DILocation(line: 1903, column: 16, scope: !1607)
!1627 = !DILocation(line: 1903, column: 14, scope: !1607)
!1628 = !DILocation(line: 1914, column: 30, scope: !1607)
!1629 = !DILocation(line: 1914, column: 15, scope: !1607)
!1630 = !DILocation(line: 1914, column: 13, scope: !1607)
!1631 = !DILocation(line: 1915, column: 15, scope: !1607)
!1632 = !DILocation(line: 1915, column: 4, scope: !1607)
!1633 = !DILocation(line: 1917, column: 8, scope: !1634)
!1634 = distinct !DILexicalBlock(scope: !1607, file: !371, line: 1917, column: 8)
!1635 = !DILocation(line: 1917, column: 17, scope: !1634)
!1636 = !DILocation(line: 1917, column: 8, scope: !1607)
!1637 = !DILocation(line: 1918, column: 7, scope: !1638)
!1638 = distinct !DILexicalBlock(scope: !1634, file: !371, line: 1917, column: 25)
!1639 = !DILocation(line: 1920, column: 15, scope: !1607)
!1640 = !DILocation(line: 1920, column: 24, scope: !1607)
!1641 = !DILocation(line: 1920, column: 4, scope: !1607)
!1642 = !DILocation(line: 1921, column: 15, scope: !1607)
!1643 = !DILocation(line: 1921, column: 4, scope: !1607)
!1644 = !DILocation(line: 1924, column: 15, scope: !1607)
!1645 = !DILocation(line: 1924, column: 25, scope: !1607)
!1646 = !DILocation(line: 1924, column: 4, scope: !1607)
!1647 = !DILocation(line: 1927, column: 4, scope: !1607)
!1648 = !DILocalVariable(name: "x", scope: !1649, file: !371, line: 1928, type: !458)
!1649 = distinct !DILexicalBlock(scope: !1650, file: !371, line: 1927, column: 13)
!1650 = distinct !DILexicalBlock(scope: !1651, file: !371, line: 1927, column: 4)
!1651 = distinct !DILexicalBlock(scope: !1607, file: !371, line: 1927, column: 4)
!1652 = !DILocation(line: 1928, column: 13, scope: !1649)
!1653 = !DILocalVariable(name: "bind", scope: !1649, file: !371, line: 1929, type: !436)
!1654 = !DILocation(line: 1929, column: 12, scope: !1649)
!1655 = !DILocalVariable(name: "ptr", scope: !1649, file: !371, line: 1930, type: !458)
!1656 = !DILocation(line: 1930, column: 13, scope: !1649)
!1657 = !DILocation(line: 1932, column: 39, scope: !1649)
!1658 = !DILocation(line: 1932, column: 13, scope: !1649)
!1659 = !DILocation(line: 1932, column: 11, scope: !1649)
!1660 = !DILocation(line: 1933, column: 11, scope: !1661)
!1661 = distinct !DILexicalBlock(scope: !1649, file: !371, line: 1933, column: 11)
!1662 = !DILocation(line: 1933, column: 11, scope: !1649)
!1663 = !DILocation(line: 1935, column: 14, scope: !1664)
!1664 = distinct !DILexicalBlock(scope: !1665, file: !371, line: 1935, column: 14)
!1665 = distinct !DILexicalBlock(scope: !1661, file: !371, line: 1933, column: 16)
!1666 = !DILocation(line: 1935, column: 14, scope: !1665)
!1667 = !DILocalVariable(name: "rbind", scope: !1668, file: !371, line: 1960, type: !436)
!1668 = distinct !DILexicalBlock(scope: !1664, file: !371, line: 1935, column: 20)
!1669 = !DILocation(line: 1960, column: 18, scope: !1668)
!1670 = !DILocation(line: 1962, column: 17, scope: !1671)
!1671 = distinct !DILexicalBlock(scope: !1668, file: !371, line: 1962, column: 17)
!1672 = !DILocation(line: 1962, column: 17, scope: !1668)
!1673 = !DILocalVariable(name: "canPathLen", scope: !1674, file: !371, line: 1969, type: !779)
!1674 = distinct !DILexicalBlock(scope: !1671, file: !371, line: 1962, column: 24)
!1675 = !DILocation(line: 1969, column: 23, scope: !1674)
!1676 = !DILocation(line: 1969, column: 43, scope: !1674)
!1677 = !DILocation(line: 1969, column: 36, scope: !1674)
!1678 = !DILocalVariable(name: "diff", scope: !1674, file: !371, line: 1970, type: !375)
!1679 = !DILocation(line: 1970, column: 28, scope: !1674)
!1680 = !DILocation(line: 1970, column: 35, scope: !1674)
!1681 = !DILocation(line: 1970, column: 47, scope: !1674)
!1682 = !DILocation(line: 1970, column: 58, scope: !1674)
!1683 = !DILocation(line: 1970, column: 64, scope: !1684)
!1684 = !DILexicalBlockFile(scope: !1674, file: !371, discriminator: 1)
!1685 = !DILocation(line: 1970, column: 47, scope: !1684)
!1686 = !DILocation(line: 1970, column: 47, scope: !1687)
!1687 = !DILexicalBlockFile(scope: !1674, file: !371, discriminator: 2)
!1688 = !DILocation(line: 1970, column: 47, scope: !1689)
!1689 = !DILexicalBlockFile(scope: !1674, file: !371, discriminator: 3)
!1690 = !DILocation(line: 1970, column: 44, scope: !1689)
!1691 = !DILocation(line: 1970, column: 28, scope: !1689)
!1692 = !DILocation(line: 1972, column: 21, scope: !1693)
!1693 = distinct !DILexicalBlock(scope: !1674, file: !371, line: 1972, column: 20)
!1694 = !DILocation(line: 1972, column: 20, scope: !1693)
!1695 = !DILocation(line: 1972, column: 26, scope: !1693)
!1696 = !DILocation(line: 1972, column: 20, scope: !1674)
!1697 = !DILocation(line: 1973, column: 31, scope: !1698)
!1698 = distinct !DILexicalBlock(scope: !1693, file: !371, line: 1972, column: 35)
!1699 = !DILocation(line: 1974, column: 38, scope: !1698)
!1700 = !DILocation(line: 1974, column: 31, scope: !1698)
!1701 = !DILocation(line: 1974, column: 43, scope: !1698)
!1702 = !DILocation(line: 1974, column: 49, scope: !1703)
!1703 = !DILexicalBlockFile(scope: !1698, file: !371, discriminator: 1)
!1704 = !DILocation(line: 1974, column: 31, scope: !1703)
!1705 = !DILocation(line: 1974, column: 31, scope: !1706)
!1706 = !DILexicalBlockFile(scope: !1698, file: !371, discriminator: 2)
!1707 = !DILocation(line: 1974, column: 31, scope: !1708)
!1708 = !DILexicalBlockFile(scope: !1698, file: !371, discriminator: 3)
!1709 = !DILocation(line: 1974, column: 59, scope: !1708)
!1710 = !DILocation(line: 1973, column: 19, scope: !1703)
!1711 = !DILocation(line: 1975, column: 16, scope: !1698)
!1712 = !DILocation(line: 1976, column: 30, scope: !1713)
!1713 = distinct !DILexicalBlock(scope: !1693, file: !371, line: 1975, column: 23)
!1714 = !DILocation(line: 1976, column: 39, scope: !1713)
!1715 = !DILocation(line: 1976, column: 19, scope: !1713)
!1716 = !DILocation(line: 1978, column: 13, scope: !1674)
!1717 = !DILocation(line: 1979, column: 27, scope: !1718)
!1718 = distinct !DILexicalBlock(scope: !1671, file: !371, line: 1978, column: 20)
!1719 = !DILocation(line: 1979, column: 36, scope: !1718)
!1720 = !DILocation(line: 1979, column: 16, scope: !1718)
!1721 = !DILocation(line: 1982, column: 24, scope: !1668)
!1722 = !DILocation(line: 1982, column: 13, scope: !1668)
!1723 = !DILocation(line: 1990, column: 20, scope: !1668)
!1724 = !DILocation(line: 1991, column: 17, scope: !1725)
!1725 = distinct !DILexicalBlock(scope: !1668, file: !371, line: 1991, column: 17)
!1726 = !DILocation(line: 1991, column: 25, scope: !1725)
!1727 = !DILocation(line: 1991, column: 17, scope: !1668)
!1728 = !DILocation(line: 1992, column: 16, scope: !1729)
!1729 = distinct !DILexicalBlock(scope: !1725, file: !371, line: 1991, column: 31)
!1730 = !DILocation(line: 1994, column: 16, scope: !1729)
!1731 = !DILocation(line: 1997, column: 13, scope: !1668)
!1732 = !DILocation(line: 2000, column: 17, scope: !1665)
!1733 = !DILocation(line: 2000, column: 10, scope: !1665)
!1734 = !DILocation(line: 2004, column: 27, scope: !1649)
!1735 = !DILocation(line: 2004, column: 11, scope: !1649)
!1736 = !DILocation(line: 2004, column: 9, scope: !1649)
!1737 = !DILocation(line: 2005, column: 16, scope: !1649)
!1738 = !DILocation(line: 2005, column: 14, scope: !1649)
!1739 = !DILocation(line: 2006, column: 18, scope: !1649)
!1740 = !DILocation(line: 2006, column: 27, scope: !1649)
!1741 = !DILocation(line: 2006, column: 7, scope: !1649)
!1742 = !DILocation(line: 2007, column: 18, scope: !1649)
!1743 = !DILocation(line: 2007, column: 7, scope: !1649)
!1744 = !DILocation(line: 2014, column: 11, scope: !1745)
!1745 = distinct !DILexicalBlock(scope: !1649, file: !371, line: 2014, column: 11)
!1746 = !DILocation(line: 2014, column: 11, scope: !1649)
!1747 = !DILocation(line: 2015, column: 10, scope: !1748)
!1748 = distinct !DILexicalBlock(scope: !1745, file: !371, line: 2014, column: 19)
!1749 = !DILocation(line: 1927, column: 4, scope: !1750)
!1750 = !DILexicalBlockFile(scope: !1650, file: !371, discriminator: 1)
!1751 = distinct !{!1751, !1647}
!1752 = !DILocation(line: 2019, column: 1, scope: !1607)
!1753 = distinct !DISubprogram(name: "FilePosixLookupMountPoint", scope: !371, file: !371, line: 1768, type: !1754, isLocal: true, isDefinition: true, scopeLine: 1770, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !378)
!1754 = !DISubroutineType(types: !1755)
!1755 = !{!458, !375, !1756}
!1756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!1757 = !DILocalVariable(name: "canPath", arg: 1, scope: !1753, file: !371, line: 1768, type: !375)
!1758 = !DILocation(line: 1768, column: 39, scope: !1753)
!1759 = !DILocalVariable(name: "bind", arg: 2, scope: !1753, file: !371, line: 1769, type: !1756)
!1760 = !DILocation(line: 1769, column: 33, scope: !1753)
!1761 = !DILocalVariable(name: "f", scope: !1753, file: !371, line: 1776, type: !1762)
!1762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1763, size: 64, align: 64)
!1763 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1764, line: 48, baseType: !1765)
!1764 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line196")
!1765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1766, line: 241, size: 1728, align: 64, elements: !1767)
!1766 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line196")
!1767 = !{!1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1788, !1789, !1790, !1791, !1792, !1794, !1796, !1800, !1803, !1805, !1806, !1807, !1808, !1809, !1810, !1811}
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1765, file: !1766, line: 242, baseType: !374, size: 32, align: 32)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1765, file: !1766, line: 247, baseType: !458, size: 64, align: 64, offset: 64)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1765, file: !1766, line: 248, baseType: !458, size: 64, align: 64, offset: 128)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1765, file: !1766, line: 249, baseType: !458, size: 64, align: 64, offset: 192)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1765, file: !1766, line: 250, baseType: !458, size: 64, align: 64, offset: 256)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1765, file: !1766, line: 251, baseType: !458, size: 64, align: 64, offset: 320)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1765, file: !1766, line: 252, baseType: !458, size: 64, align: 64, offset: 384)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1765, file: !1766, line: 253, baseType: !458, size: 64, align: 64, offset: 448)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1765, file: !1766, line: 254, baseType: !458, size: 64, align: 64, offset: 512)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1765, file: !1766, line: 256, baseType: !458, size: 64, align: 64, offset: 576)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1765, file: !1766, line: 257, baseType: !458, size: 64, align: 64, offset: 640)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1765, file: !1766, line: 258, baseType: !458, size: 64, align: 64, offset: 704)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1765, file: !1766, line: 260, baseType: !1781, size: 64, align: 64, offset: 768)
!1781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1782, size: 64, align: 64)
!1782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1766, line: 156, size: 192, align: 64, elements: !1783)
!1783 = !{!1784, !1785, !1787}
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1782, file: !1766, line: 157, baseType: !1781, size: 64, align: 64)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1782, file: !1766, line: 158, baseType: !1786, size: 64, align: 64, offset: 64)
!1786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1765, size: 64, align: 64)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1782, file: !1766, line: 162, baseType: !374, size: 32, align: 32, offset: 128)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1765, file: !1766, line: 262, baseType: !1786, size: 64, align: 64, offset: 832)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1765, file: !1766, line: 264, baseType: !374, size: 32, align: 32, offset: 896)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1765, file: !1766, line: 268, baseType: !374, size: 32, align: 32, offset: 928)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1765, file: !1766, line: 270, baseType: !583, size: 64, align: 64, offset: 960)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1765, file: !1766, line: 274, baseType: !1793, size: 16, align: 16, offset: 1024)
!1793 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1765, file: !1766, line: 275, baseType: !1795, size: 8, align: 8, offset: 1040)
!1795 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1765, file: !1766, line: 276, baseType: !1797, size: 8, align: 8, offset: 1048)
!1797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 8, align: 8, elements: !1798)
!1798 = !{!1799}
!1799 = !DISubrange(count: 1)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1765, file: !1766, line: 280, baseType: !1801, size: 64, align: 64, offset: 1088)
!1801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1802, size: 64, align: 64)
!1802 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1766, line: 150, baseType: null)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1765, file: !1766, line: 289, baseType: !1804, size: 64, align: 64, offset: 1152)
!1804 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !569, line: 132, baseType: !584)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1765, file: !1766, line: 297, baseType: !360, size: 64, align: 64, offset: 1216)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1765, file: !1766, line: 298, baseType: !360, size: 64, align: 64, offset: 1280)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1765, file: !1766, line: 299, baseType: !360, size: 64, align: 64, offset: 1344)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1765, file: !1766, line: 300, baseType: !360, size: 64, align: 64, offset: 1408)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1765, file: !1766, line: 302, baseType: !779, size: 64, align: 64, offset: 1472)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1765, file: !1766, line: 303, baseType: !374, size: 32, align: 32, offset: 1536)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1765, file: !1766, line: 305, baseType: !1812, size: 160, align: 8, offset: 1568)
!1812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 160, align: 8, elements: !1813)
!1813 = !{!1814}
!1814 = !DISubrange(count: 20)
!1815 = !DILocation(line: 1776, column: 10, scope: !1753)
!1816 = !DILocalVariable(name: "mnt", scope: !1753, file: !371, line: 1777, type: !1817)
!1817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mntent", file: !1818, line: 53, size: 320, align: 64, elements: !1819)
!1818 = !DIFile(filename: "/usr/include/mntent.h", directory: "/home/lichi/Desktop/open-vm-tools/line196")
!1819 = !{!1820, !1821, !1822, !1823, !1824, !1825}
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_fsname", scope: !1817, file: !1818, line: 55, baseType: !458, size: 64, align: 64)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_dir", scope: !1817, file: !1818, line: 56, baseType: !458, size: 64, align: 64, offset: 64)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_type", scope: !1817, file: !1818, line: 57, baseType: !458, size: 64, align: 64, offset: 128)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_opts", scope: !1817, file: !1818, line: 58, baseType: !458, size: 64, align: 64, offset: 192)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_freq", scope: !1817, file: !1818, line: 59, baseType: !374, size: 32, align: 32, offset: 256)
