; ModuleID = './[inter]src--divertcmd.o.i'
source_filename = "./[inter]src--divertcmd.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.cmdinfo = type { i8*, i8, i32, i32*, i8**, void (%struct.cmdinfo*, i8*)*, i32, i8*, i32 (i8**)* }
%struct.varbuf = type { i64, i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.file = type { i8*, i32, %struct.stat }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.fsys_diversion = type { %struct.fsys_namenode*, %struct.fsys_namenode*, %struct.pkgset*, %struct.fsys_diversion* }
%struct.fsys_namenode = type { %struct.fsys_namenode*, i8*, %struct.pkg_list*, %struct.fsys_diversion*, %struct.file_stat*, %struct.trigfileint*, i32, i8*, i8*, %struct.file_ondisk_id* }
%struct.pkg_list = type opaque
%struct.file_stat = type { i32, i32, i32, i8*, i8* }
%struct.trigfileint = type opaque
%struct.file_ondisk_id = type { i64, i64 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.1, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !172, globals: !174)
!1 = !DIFile(filename: "[inter]src--divertcmd.o.i", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!2 = !{!3, !14, !70, !83, !91, !95, !105, !115, !126, !135, !146, !152, !156, !162, !168}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "modstatdb_rw", file: !4, line: 263, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../lib/dpkg/dpkg-db.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13}
!6 = !DIEnumerator(name: "msdbrw_readonly", value: 0)
!7 = !DIEnumerator(name: "msdbrw_needsuperuserlockonly", value: 1)
!8 = !DIEnumerator(name: "msdbrw_writeifposs", value: 2)
!9 = !DIEnumerator(name: "msdbrw_write", value: 3)
!10 = !DIEnumerator(name: "msdbrw_needsuperuser", value: 4)
!11 = !DIEnumerator(name: "msdbrw_available_readonly", value: 256)
!12 = !DIEnumerator(name: "msdbrw_available_write", value: 512)
!13 = !DIEnumerator(name: "msdbrw_available_mask", value: 65280)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !16, file: !15, line: 137, size: 32, align: 32, elements: !66)
!15 = !DIFile(filename: "divertcmd.c", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !15, line: 135, size: 1280, align: 64, elements: !17)
!17 = !{!18, !22, !23}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !16, file: !15, line: 136, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!21 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "stat_state", scope: !16, file: !15, line: 141, baseType: !14, size: 32, align: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !16, file: !15, line: 142, baseType: !24, size: 1152, align: 64, offset: 128)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !25, line: 46, size: 1152, align: 64, elements: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!26 = !{!27, !31, !33, !35, !38, !40, !42, !44, !45, !48, !50, !52, !60, !61, !62}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !24, file: !25, line: 48, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !29, line: 124, baseType: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!30 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !24, file: !25, line: 53, baseType: !32, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !29, line: 127, baseType: !30)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !24, file: !25, line: 61, baseType: !34, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !29, line: 130, baseType: !30)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !24, file: !25, line: 62, baseType: !36, size: 32, align: 32, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !29, line: 129, baseType: !37)
!37 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !24, file: !25, line: 64, baseType: !39, size: 32, align: 32, offset: 224)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !29, line: 125, baseType: !37)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !24, file: !25, line: 65, baseType: !41, size: 32, align: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !29, line: 126, baseType: !37)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !24, file: !25, line: 67, baseType: !43, size: 32, align: 32, offset: 288)
!43 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !24, file: !25, line: 69, baseType: !28, size: 64, align: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !24, file: !25, line: 74, baseType: !46, size: 64, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !29, line: 131, baseType: !47)
!47 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !24, file: !25, line: 78, baseType: !49, size: 64, align: 64, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !29, line: 153, baseType: !47)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !24, file: !25, line: 80, baseType: !51, size: 64, align: 64, offset: 512)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !29, line: 158, baseType: !47)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !24, file: !25, line: 91, baseType: !53, size: 128, align: 64, offset: 576)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !54, line: 120, size: 128, align: 64, elements: !55)
!54 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!55 = !{!56, !58}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !53, file: !54, line: 122, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !29, line: 139, baseType: !47)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !53, file: !54, line: 123, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !29, line: 175, baseType: !47)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !24, file: !25, line: 92, baseType: !53, size: 128, align: 64, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !24, file: !25, line: 93, baseType: !53, size: 128, align: 64, offset: 832)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !24, file: !25, line: 106, baseType: !63, size: 192, align: 64, offset: 960)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 192, align: 64, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 3)
!66 = !{!67, !68, !69}
!67 = !DIEnumerator(name: "FILE_STAT_INVALID", value: 0)
!68 = !DIEnumerator(name: "FILE_STAT_VALID", value: 1)
!69 = !DIEnumerator(name: "FILE_STAT_NOFILE", value: 2)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fsys_namenode_flags", file: !71, line: 61, size: 32, align: 32, elements: !72)
!71 = !DIFile(filename: "../lib/dpkg/fsys.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81, !82}
!73 = !DIEnumerator(name: "FNNF_NEW_CONFF", value: 1)
!74 = !DIEnumerator(name: "FNNF_NEW_INARCHIVE", value: 2)
!75 = !DIEnumerator(name: "FNNF_OLD_CONFF", value: 4)
!76 = !DIEnumerator(name: "FNNF_OBS_CONFF", value: 8)
!77 = !DIEnumerator(name: "FNNF_ELIDE_OTHER_LISTS", value: 16)
!78 = !DIEnumerator(name: "FNNF_NO_ATOMIC_OVERWRITE", value: 32)
!79 = !DIEnumerator(name: "FNNF_PLACED_ON_DISK", value: 64)
!80 = !DIEnumerator(name: "FNNF_DEFERRED_FSYNC", value: 128)
!81 = !DIEnumerator(name: "FNNF_DEFERRED_RENAME", value: 256)
!82 = !DIEnumerator(name: "FNNF_FILTERED", value: 512)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgwant", file: !4, line: 153, size: 32, align: 32, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !90}
!85 = !DIEnumerator(name: "PKG_WANT_UNKNOWN", value: 0)
!86 = !DIEnumerator(name: "PKG_WANT_INSTALL", value: 1)
!87 = !DIEnumerator(name: "PKG_WANT_HOLD", value: 2)
!88 = !DIEnumerator(name: "PKG_WANT_DEINSTALL", value: 3)
!89 = !DIEnumerator(name: "PKG_WANT_PURGE", value: 4)
!90 = !DIEnumerator(name: "PKG_WANT_SENTINEL", value: 5)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgeflag", file: !4, line: 163, size: 32, align: 32, elements: !92)
!92 = !{!93, !94}
!93 = !DIEnumerator(name: "PKG_EFLAG_OK", value: 0)
!94 = !DIEnumerator(name: "PKG_EFLAG_REINSTREQ", value: 1)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgstatus", file: !4, line: 168, size: 32, align: 32, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104}
!97 = !DIEnumerator(name: "PKG_STAT_NOTINSTALLED", value: 0)
!98 = !DIEnumerator(name: "PKG_STAT_CONFIGFILES", value: 1)
!99 = !DIEnumerator(name: "PKG_STAT_HALFINSTALLED", value: 2)
!100 = !DIEnumerator(name: "PKG_STAT_UNPACKED", value: 3)
!101 = !DIEnumerator(name: "PKG_STAT_HALFCONFIGURED", value: 4)
!102 = !DIEnumerator(name: "PKG_STAT_TRIGGERSAWAITED", value: 5)
!103 = !DIEnumerator(name: "PKG_STAT_TRIGGERSPENDING", value: 6)
!104 = !DIEnumerator(name: "PKG_STAT_INSTALLED", value: 7)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgpriority", file: !4, line: 179, size: 32, align: 32, elements: !106)
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114}
!107 = !DIEnumerator(name: "PKG_PRIO_REQUIRED", value: 0)
!108 = !DIEnumerator(name: "PKG_PRIO_IMPORTANT", value: 1)
!109 = !DIEnumerator(name: "PKG_PRIO_STANDARD", value: 2)
!110 = !DIEnumerator(name: "PKG_PRIO_OPTIONAL", value: 3)
!111 = !DIEnumerator(name: "PKG_PRIO_EXTRA", value: 4)
!112 = !DIEnumerator(name: "PKG_PRIO_OTHER", value: 5)
!113 = !DIEnumerator(name: "PKG_PRIO_UNKNOWN", value: 6)
!114 = !DIEnumerator(name: "PKG_PRIO_UNSET", value: -1)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_arch_type", file: !116, line: 37, size: 32, align: 32, elements: !117)
!116 = !DIFile(filename: "../lib/dpkg/arch.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125}
!118 = !DIEnumerator(name: "DPKG_ARCH_NONE", value: 0)
!119 = !DIEnumerator(name: "DPKG_ARCH_EMPTY", value: 1)
!120 = !DIEnumerator(name: "DPKG_ARCH_ILLEGAL", value: 2)
!121 = !DIEnumerator(name: "DPKG_ARCH_WILDCARD", value: 3)
!122 = !DIEnumerator(name: "DPKG_ARCH_ALL", value: 4)
!123 = !DIEnumerator(name: "DPKG_ARCH_NATIVE", value: 5)
!124 = !DIEnumerator(name: "DPKG_ARCH_FOREIGN", value: 6)
!125 = !DIEnumerator(name: "DPKG_ARCH_UNKNOWN", value: 7)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_relation", file: !127, line: 61, size: 32, align: 32, elements: !128)
!127 = !DIFile(filename: "../lib/dpkg/version.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!128 = !{!129, !130, !131, !132, !133, !134}
!129 = !DIEnumerator(name: "DPKG_RELATION_NONE", value: 0)
!130 = !DIEnumerator(name: "DPKG_RELATION_EQ", value: 1)
!131 = !DIEnumerator(name: "DPKG_RELATION_LT", value: 2)
!132 = !DIEnumerator(name: "DPKG_RELATION_LE", value: 3)
!133 = !DIEnumerator(name: "DPKG_RELATION_GT", value: 4)
!134 = !DIEnumerator(name: "DPKG_RELATION_GE", value: 5)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "deptype", file: !4, line: 44, size: 32, align: 32, elements: !136)
!136 = !{!137, !138, !139, !140, !141, !142, !143, !144, !145}
!137 = !DIEnumerator(name: "dep_suggests", value: 0)
!138 = !DIEnumerator(name: "dep_recommends", value: 1)
!139 = !DIEnumerator(name: "dep_depends", value: 2)
!140 = !DIEnumerator(name: "dep_predepends", value: 3)
!141 = !DIEnumerator(name: "dep_breaks", value: 4)
!142 = !DIEnumerator(name: "dep_conflicts", value: 5)
!143 = !DIEnumerator(name: "dep_provides", value: 6)
!144 = !DIEnumerator(name: "dep_replaces", value: 7)
!145 = !DIEnumerator(name: "dep_enhances", value: 8)
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgmultiarch", file: !4, line: 95, size: 32, align: 32, elements: !147)
!147 = !{!148, !149, !150, !151}
!148 = !DIEnumerator(name: "PKG_MULTIARCH_NO", value: 0)
!149 = !DIEnumerator(name: "PKG_MULTIARCH_SAME", value: 1)
!150 = !DIEnumerator(name: "PKG_MULTIARCH_ALLOWED", value: 2)
!151 = !DIEnumerator(name: "PKG_MULTIARCH_FOREIGN", value: 3)
!152 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "atomic_file_flags", file: !153, line: 36, size: 32, align: 32, elements: !154)
!153 = !DIFile(filename: "../lib/dpkg/atomic-file.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!154 = !{!155}
!155 = !DIEnumerator(name: "ATOMIC_FILE_BACKUP", value: 1)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_msg_type", file: !157, line: 36, size: 32, align: 32, elements: !158)
!157 = !DIFile(filename: "../lib/dpkg/error.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!158 = !{!159, !160, !161}
!159 = !DIEnumerator(name: "DPKG_MSG_NONE", value: 0)
!160 = !DIEnumerator(name: "DPKG_MSG_WARN", value: 1)
!161 = !DIEnumerator(name: "DPKG_MSG_ERROR", value: 2)
!162 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !163, line: 41, size: 32, align: 32, elements: !164)
!163 = !DIFile(filename: "../lib/dpkg/ehandle.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!164 = !{!165, !166, !167}
!165 = !DIEnumerator(name: "ehflag_normaltidy", value: 1)
!166 = !DIEnumerator(name: "ehflag_bombout", value: 2)
!167 = !DIEnumerator(name: "ehflag_recursiveerror", value: 4)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fsys_hash_find_flags", file: !71, line: 54, size: 32, align: 32, elements: !169)
!169 = !{!170, !171}
!170 = !DIEnumerator(name: "FHFF_NOCOPY", value: 1)
!171 = !DIEnumerator(name: "FHFF_NONE", value: 2)
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!174 = !{!175, !176, !177, !206, !207, !208, !400, !404, !405, !406, !407, !411, !412}
!175 = distinct !DIGlobalVariable(name: "admindir", scope: !0, file: !15, line: 54, type: !19, isLocal: true, isDefinition: true, variable: i8** @admindir)
!176 = distinct !DIGlobalVariable(name: "instdir", scope: !0, file: !15, line: 55, type: !19, isLocal: false, isDefinition: true, variable: i8** @instdir)
!177 = distinct !DIGlobalVariable(name: "cmdinfos", scope: !0, file: !15, line: 807, type: !178, isLocal: true, isDefinition: true, variable: [18 x %struct.cmdinfo]* @cmdinfos)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 9216, align: 64, elements: !204)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmdinfo", file: !181, line: 38, size: 512, align: 64, elements: !182)
!181 = !DIFile(filename: "../lib/dpkg/options.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!182 = !{!183, !184, !185, !186, !188, !190, !195, !196, !197}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "olong", scope: !180, file: !181, line: 39, baseType: !19, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "oshort", scope: !180, file: !181, line: 40, baseType: !21, size: 8, align: 8, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "takesvalue", scope: !180, file: !181, line: 48, baseType: !43, size: 32, align: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "iassignto", scope: !180, file: !181, line: 49, baseType: !187, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sassignto", scope: !180, file: !181, line: 50, baseType: !189, size: 64, align: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !180, file: !181, line: 51, baseType: !191, size: 64, align: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !194, !19}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "arg_int", scope: !180, file: !181, line: 53, baseType: !43, size: 32, align: 32, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "arg_ptr", scope: !180, file: !181, line: 54, baseType: !173, size: 64, align: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !180, file: !181, line: 56, baseType: !198, size: 64, align: 64, offset: 448)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "action_func", file: !181, line: 36, baseType: !200)
!200 = !DISubroutineType(types: !201)
!201 = !{!43, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!204 = !{!205}
!205 = !DISubrange(count: 18)
!206 = distinct !DIGlobalVariable(name: "opt_divertto", scope: !0, file: !15, line: 59, type: !19, isLocal: true, isDefinition: true, variable: i8** @opt_divertto)
!207 = distinct !DIGlobalVariable(name: "opt_pkgname", scope: !0, file: !15, line: 58, type: !19, isLocal: true, isDefinition: true, variable: i8** @opt_pkgname)
!208 = distinct !DIGlobalVariable(name: "str", scope: !209, file: !15, line: 354, type: !392, isLocal: true, isDefinition: true, variable: %struct.varbuf* @diversion_describe.str)
!209 = distinct !DISubprogram(name: "diversion_describe", scope: !15, file: !15, line: 352, type: !210, isLocal: true, isDefinition: true, scopeLine: 353, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!210 = !DISubroutineType(types: !211)
!211 = !{!19, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_diversion", file: !71, line: 151, size: 256, align: 64, elements: !214)
!214 = !{!215, !254, !255, !390}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "useinstead", scope: !213, file: !71, line: 152, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode", file: !71, line: 90, size: 640, align: 64, elements: !218)
!218 = !{!219, !220, !221, !224, !225, !240, !243, !244, !245, !246}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !217, file: !71, line: 91, baseType: !216, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !217, file: !71, line: 92, baseType: !19, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "packages", scope: !217, file: !71, line: 93, baseType: !222, size: 64, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_list", file: !71, line: 93, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "divert", scope: !217, file: !71, line: 94, baseType: !212, size: 64, align: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "statoverride", scope: !217, file: !71, line: 101, baseType: !226, size: 64, align: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !228, line: 40, size: 256, align: 64, elements: !229)
!228 = !DIFile(filename: "../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!229 = !{!230, !233, !235, !237, !239}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !227, file: !228, line: 41, baseType: !231, size: 32, align: 32)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !232, line: 80, baseType: !39)
!232 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!233 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !227, file: !228, line: 42, baseType: !234, size: 32, align: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !232, line: 65, baseType: !41)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !227, file: !228, line: 43, baseType: !236, size: 32, align: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !232, line: 70, baseType: !36)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !227, file: !228, line: 47, baseType: !238, size: 64, align: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !227, file: !228, line: 48, baseType: !238, size: 64, align: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "trig_interested", scope: !217, file: !71, line: 103, baseType: !241, size: 64, align: 64, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "trigfileint", file: !71, line: 103, flags: DIFlagFwdDecl)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !217, file: !71, line: 111, baseType: !70, size: 32, align: 32, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "oldhash", scope: !217, file: !71, line: 114, baseType: !19, size: 64, align: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "newhash", scope: !217, file: !71, line: 117, baseType: !19, size: 64, align: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "file_ondisk_id", scope: !217, file: !71, line: 119, baseType: !247, size: 64, align: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_ondisk_id", file: !71, line: 85, size: 128, align: 64, elements: !249)
!249 = !{!250, !252}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "id_dev", scope: !248, file: !71, line: 86, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !232, line: 60, baseType: !28)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "id_ino", scope: !248, file: !71, line: 87, baseType: !253, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !232, line: 48, baseType: !32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "camefrom", scope: !213, file: !71, line: 153, baseType: !216, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pkgset", scope: !213, file: !71, line: 154, baseType: !256, size: 64, align: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !258)
!258 = !{!259, !260, !261, !384, !389}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !257, file: !4, line: 243, baseType: !256, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !257, file: !4, line: 244, baseType: !19, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !257, file: !4, line: 245, baseType: !262, size: 3072, align: 64, offset: 128)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !263)
!263 = !{!264, !265, !267, !268, !269, !270, !271, !272, !273, !279, !338, !339, !342, !351, !367, !368, !374, !380, !382, !383}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !262, file: !4, line: 196, baseType: !256, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !262, file: !4, line: 197, baseType: !266, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !262, file: !4, line: 199, baseType: !83, size: 32, align: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !262, file: !4, line: 201, baseType: !91, size: 32, align: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !262, file: !4, line: 202, baseType: !95, size: 32, align: 32, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !262, file: !4, line: 203, baseType: !105, size: 32, align: 32, offset: 224)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !262, file: !4, line: 204, baseType: !19, size: 64, align: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !262, file: !4, line: 205, baseType: !19, size: 64, align: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !262, file: !4, line: 206, baseType: !274, size: 192, align: 64, offset: 384)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !127, line: 42, size: 192, align: 64, elements: !275)
!275 = !{!276, !277, !278}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !274, file: !127, line: 44, baseType: !37, size: 32, align: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !274, file: !127, line: 46, baseType: !19, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !274, file: !127, line: 48, baseType: !19, size: 64, align: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !262, file: !4, line: 207, baseType: !280, size: 960, align: 64, offset: 576)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !281)
!281 = !{!282, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !331}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !280, file: !4, line: 108, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !285)
!285 = !{!286, !287, !288, !311}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !284, file: !4, line: 57, baseType: !266, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !284, file: !4, line: 58, baseType: !283, size: 64, align: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !284, file: !4, line: 59, baseType: !289, size: 64, align: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !291)
!291 = !{!292, !293, !294, !295, !296, !297, !306, !307, !308, !310}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !290, file: !4, line: 64, baseType: !283, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !290, file: !4, line: 65, baseType: !256, size: 64, align: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !290, file: !4, line: 66, baseType: !289, size: 64, align: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !290, file: !4, line: 66, baseType: !289, size: 64, align: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !290, file: !4, line: 66, baseType: !289, size: 64, align: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !290, file: !4, line: 67, baseType: !298, size: 64, align: 64, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !116, line: 48, size: 192, align: 64, elements: !301)
!301 = !{!302, !304, !305}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !300, file: !116, line: 49, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !116, line: 50, baseType: !19, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !300, file: !116, line: 51, baseType: !115, size: 32, align: 32, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !290, file: !4, line: 68, baseType: !274, size: 192, align: 64, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !290, file: !4, line: 69, baseType: !126, size: 32, align: 32, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !290, file: !4, line: 70, baseType: !309, size: 8, align: 8, offset: 608)
!309 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !290, file: !4, line: 71, baseType: !309, size: 8, align: 8, offset: 616)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !284, file: !4, line: 60, baseType: !135, size: 32, align: 32, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !280, file: !4, line: 110, baseType: !309, size: 8, align: 8, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !280, file: !4, line: 111, baseType: !146, size: 32, align: 32, offset: 96)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !280, file: !4, line: 112, baseType: !298, size: 64, align: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !280, file: !4, line: 115, baseType: !19, size: 64, align: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !280, file: !4, line: 116, baseType: !19, size: 64, align: 64, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !280, file: !4, line: 117, baseType: !19, size: 64, align: 64, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !280, file: !4, line: 118, baseType: !19, size: 64, align: 64, offset: 384)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !280, file: !4, line: 119, baseType: !19, size: 64, align: 64, offset: 448)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !280, file: !4, line: 120, baseType: !19, size: 64, align: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !280, file: !4, line: 121, baseType: !19, size: 64, align: 64, offset: 576)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !280, file: !4, line: 122, baseType: !274, size: 192, align: 64, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !280, file: !4, line: 123, baseType: !324, size: 64, align: 64, offset: 832)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !326)
!326 = !{!327, !328, !329, !330}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !325, file: !4, line: 81, baseType: !324, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !325, file: !4, line: 82, baseType: !19, size: 64, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !325, file: !4, line: 83, baseType: !19, size: 64, align: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !325, file: !4, line: 84, baseType: !309, size: 8, align: 8, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !280, file: !4, line: 124, baseType: !332, size: 64, align: 64, offset: 896)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !334)
!334 = !{!335, !336, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !4, line: 75, baseType: !332, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !333, file: !4, line: 76, baseType: !19, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !333, file: !4, line: 77, baseType: !19, size: 64, align: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !262, file: !4, line: 208, baseType: !280, size: 960, align: 64, offset: 1536)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !262, file: !4, line: 209, baseType: !340, size: 64, align: 64, offset: 2496)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !4, line: 151, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !262, file: !4, line: 211, baseType: !343, size: 64, align: 64, offset: 2560)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !345)
!345 = !{!346, !347, !348, !349, !350}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !344, file: !4, line: 88, baseType: !343, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !344, file: !4, line: 89, baseType: !19, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !344, file: !4, line: 90, baseType: !19, size: 64, align: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !344, file: !4, line: 91, baseType: !19, size: 64, align: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !344, file: !4, line: 92, baseType: !19, size: 64, align: 64, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !262, file: !4, line: 216, baseType: !352, size: 128, align: 64, offset: 2624)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !262, file: !4, line: 213, size: 128, align: 64, elements: !353)
!353 = !{!354, !366}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !352, file: !4, line: 215, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !357)
!357 = !{!358, !359, !360, !361}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !356, file: !4, line: 143, baseType: !266, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !356, file: !4, line: 143, baseType: !266, size: 64, align: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !356, file: !4, line: 144, baseType: !355, size: 64, align: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !356, file: !4, line: 147, baseType: !362, size: 128, align: 64, offset: 192)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !356, file: !4, line: 145, size: 128, align: 64, elements: !363)
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !362, file: !4, line: 146, baseType: !355, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !362, file: !4, line: 146, baseType: !355, size: 64, align: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !352, file: !4, line: 215, baseType: !355, size: 64, align: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !262, file: !4, line: 219, baseType: !355, size: 64, align: 64, offset: 2752)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !262, file: !4, line: 220, baseType: !369, size: 64, align: 64, offset: 2816)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !370, file: !4, line: 135, baseType: !369, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !370, file: !4, line: 136, baseType: !19, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !262, file: !4, line: 231, baseType: !375, size: 64, align: 64, offset: 2880)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !71, line: 122, size: 128, align: 64, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !376, file: !71, line: 123, baseType: !375, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "namenode", scope: !376, file: !71, line: 124, baseType: !216, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !262, file: !4, line: 232, baseType: !381, size: 64, align: 64, offset: 2944)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !232, line: 86, baseType: !46)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !262, file: !4, line: 233, baseType: !309, size: 8, align: 8, offset: 3008)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !262, file: !4, line: 236, baseType: !309, size: 8, align: 8, offset: 3016)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !257, file: !4, line: 249, baseType: !385, size: 128, align: 64, offset: 3200)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !257, file: !4, line: 246, size: 128, align: 64, elements: !386)
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !385, file: !4, line: 247, baseType: !289, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !385, file: !4, line: 248, baseType: !289, size: 64, align: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !257, file: !4, line: 250, baseType: !43, size: 32, align: 32, offset: 3328)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !71, line: 157, baseType: !212, size: 64, align: 64, offset: 192)
!391 = !{}
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !393, line: 55, size: 192, align: 64, elements: !394)
!393 = !DIFile(filename: "../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!394 = !{!395, !398, !399}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !392, file: !393, line: 56, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !397, line: 216, baseType: !30)
!397 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!398 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !392, file: !393, line: 56, baseType: !396, size: 64, align: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !392, file: !393, line: 57, baseType: !238, size: 64, align: 64, offset: 128)
!400 = distinct !DIGlobalVariable(name: "str", scope: !401, file: !15, line: 334, type: !392, isLocal: true, isDefinition: true, variable: %struct.varbuf* @diversion_current.str)
!401 = distinct !DISubprogram(name: "diversion_current", scope: !15, file: !15, line: 332, type: !402, isLocal: true, isDefinition: true, scopeLine: 333, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!402 = !DISubroutineType(types: !403)
!403 = !{!19, !19}
!404 = distinct !DIGlobalVariable(name: "opt_verbose", scope: !0, file: !15, line: 61, type: !43, isLocal: true, isDefinition: true, variable: i32* @opt_verbose)
!405 = distinct !DIGlobalVariable(name: "opt_rename", scope: !0, file: !15, line: 63, type: !43, isLocal: true, isDefinition: true, variable: i32* @opt_rename)
!406 = distinct !DIGlobalVariable(name: "opt_test", scope: !0, file: !15, line: 62, type: !43, isLocal: true, isDefinition: true, variable: i32* @opt_test)
!407 = distinct !DIGlobalVariable(name: "printforhelp", scope: !0, file: !15, line: 51, type: !408, isLocal: true, isDefinition: true, variable: [43 x i8]* @printforhelp)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 344, align: 8, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 43)
!411 = distinct !DIGlobalVariable(name: "opt_pkgname_match_any", scope: !0, file: !15, line: 57, type: !309, isLocal: true, isDefinition: true, variable: i8* @opt_pkgname_match_any)
!412 = distinct !DIGlobalVariable(name: "cmdinfo_add", scope: !0, file: !15, line: 804, type: !179, isLocal: true, isDefinition: true, variable: %struct.cmdinfo* @cmdinfo_add)
!413 = !{i32 2, !"Dwarf Version", i32 4}
!414 = !{i32 2, !"Debug Info Version", i32 3}
!415 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!416 = distinct !DISubprogram(name: "main", scope: !15, file: !15, line: 830, type: !417, isLocal: false, isDefinition: true, scopeLine: 831, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!417 = !DISubroutineType(types: !418)
!418 = !{!43, !43, !202}
!419 = !DILocalVariable(name: "argc", arg: 1, scope: !416, file: !15, line: 830, type: !43)
!420 = !DIExpression()
!421 = !DILocation(line: 830, column: 10, scope: !416)
!422 = !DILocalVariable(name: "argv", arg: 2, scope: !416, file: !15, line: 830, type: !202)
!423 = !DILocation(line: 830, column: 36, scope: !416)
!424 = !DILocalVariable(name: "env_pkgname", scope: !416, file: !15, line: 832, type: !19)
!425 = !DILocation(line: 832, column: 14, scope: !416)
!426 = !DILocalVariable(name: "ret", scope: !416, file: !15, line: 833, type: !43)
!427 = !DILocation(line: 833, column: 6, scope: !416)
!428 = !DILocation(line: 835, column: 2, scope: !416)
!429 = !DILocation(line: 836, column: 2, scope: !416)
!430 = !DILocation(line: 837, column: 2, scope: !416)
!431 = !DILocation(line: 839, column: 29, scope: !416)
!432 = !DILocation(line: 839, column: 13, scope: !416)
!433 = !DILocation(line: 839, column: 11, scope: !416)
!434 = !DILocation(line: 840, column: 30, scope: !416)
!435 = !DILocation(line: 840, column: 12, scope: !416)
!436 = !DILocation(line: 840, column: 10, scope: !416)
!437 = !DILocation(line: 842, column: 16, scope: !416)
!438 = !DILocation(line: 842, column: 14, scope: !416)
!439 = !DILocation(line: 843, column: 6, scope: !440)
!440 = distinct !DILexicalBlock(scope: !416, file: !15, line: 843, column: 6)
!441 = !DILocation(line: 843, column: 28, scope: !440)
!442 = !DILocation(line: 843, column: 31, scope: !443)
!443 = !DILexicalBlockFile(scope: !440, file: !15, discriminator: 1)
!444 = !DILocation(line: 843, column: 6, scope: !443)
!445 = !DILocation(line: 844, column: 20, scope: !440)
!446 = !DILocation(line: 844, column: 3, scope: !440)
!447 = !DILocation(line: 846, column: 7, scope: !448)
!448 = distinct !DILexicalBlock(scope: !416, file: !15, line: 846, column: 6)
!449 = !DILocation(line: 846, column: 6, scope: !416)
!450 = !DILocation(line: 847, column: 3, scope: !448)
!451 = !DILocation(line: 849, column: 2, scope: !416)
!452 = !DILocation(line: 850, column: 2, scope: !416)
!453 = !DILocation(line: 851, column: 2, scope: !416)
!454 = !DILocation(line: 853, column: 8, scope: !416)
!455 = !DILocation(line: 853, column: 19, scope: !416)
!456 = !DILocation(line: 853, column: 26, scope: !416)
!457 = !DILocation(line: 853, column: 6, scope: !416)
!458 = !DILocation(line: 855, column: 2, scope: !416)
!459 = !DILocation(line: 857, column: 2, scope: !416)
!460 = !DILocation(line: 859, column: 9, scope: !416)
!461 = !DILocation(line: 859, column: 2, scope: !416)
!462 = distinct !DISubprogram(name: "set_package", scope: !15, file: !15, line: 769, type: !192, isLocal: true, isDefinition: true, scopeLine: 770, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!463 = !DILocalVariable(name: "cip", arg: 1, scope: !462, file: !15, line: 769, type: !194)
!464 = !DILocation(line: 769, column: 35, scope: !462)
!465 = !DILocalVariable(name: "value", arg: 2, scope: !462, file: !15, line: 769, type: !19)
!466 = !DILocation(line: 769, column: 52, scope: !462)
!467 = !DILocation(line: 771, column: 24, scope: !462)
!468 = !DILocation(line: 774, column: 16, scope: !462)
!469 = !DILocation(line: 774, column: 14, scope: !462)
!470 = !DILocation(line: 776, column: 6, scope: !471)
!471 = distinct !DILexicalBlock(scope: !462, file: !15, line: 776, column: 6)
!472 = !DILocation(line: 776, column: 18, scope: !471)
!473 = !DILocation(line: 776, column: 28, scope: !474)
!474 = !DILexicalBlockFile(scope: !471, file: !15, discriminator: 1)
!475 = !DILocation(line: 776, column: 21, scope: !474)
!476 = !DILocation(line: 776, column: 47, scope: !474)
!477 = !DILocation(line: 776, column: 6, scope: !474)
!478 = !DILocation(line: 777, column: 12, scope: !471)
!479 = !DILocation(line: 777, column: 3, scope: !474)
!480 = !DILocation(line: 777, column: 3, scope: !471)
!481 = !DILocation(line: 778, column: 1, scope: !462)
!482 = distinct !DISubprogram(name: "diversion_add", scope: !15, file: !15, line: 462, type: !200, isLocal: true, isDefinition: true, scopeLine: 463, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!483 = !DILocalVariable(name: "argv", arg: 1, scope: !482, file: !15, line: 462, type: !202)
!484 = !DILocation(line: 462, column: 34, scope: !482)
!485 = !DILocalVariable(name: "filename", scope: !482, file: !15, line: 464, type: !19)
!486 = !DILocation(line: 464, column: 14, scope: !482)
!487 = !DILocation(line: 464, column: 25, scope: !482)
!488 = !DILocalVariable(name: "file_from", scope: !482, file: !15, line: 465, type: !16)
!489 = !DILocation(line: 465, column: 14, scope: !482)
!490 = !DILocalVariable(name: "file_to", scope: !482, file: !15, line: 465, type: !16)
!491 = !DILocation(line: 465, column: 25, scope: !482)
!492 = !DILocalVariable(name: "contest", scope: !482, file: !15, line: 466, type: !212)
!493 = !DILocation(line: 466, column: 25, scope: !482)
!494 = !DILocalVariable(name: "altname", scope: !482, file: !15, line: 466, type: !212)
!495 = !DILocation(line: 466, column: 35, scope: !482)
!496 = !DILocalVariable(name: "fnn_from", scope: !482, file: !15, line: 467, type: !216)
!497 = !DILocation(line: 467, column: 24, scope: !482)
!498 = !DILocalVariable(name: "fnn_to", scope: !482, file: !15, line: 467, type: !216)
!499 = !DILocation(line: 467, column: 35, scope: !482)
!500 = !DILocalVariable(name: "pkgset", scope: !482, file: !15, line: 468, type: !256)
!501 = !DILocation(line: 468, column: 17, scope: !482)
!502 = !DILocation(line: 470, column: 24, scope: !482)
!503 = !DILocation(line: 471, column: 2, scope: !482)
!504 = !DILocation(line: 474, column: 7, scope: !505)
!505 = distinct !DILexicalBlock(scope: !482, file: !15, line: 474, column: 6)
!506 = !DILocation(line: 474, column: 16, scope: !505)
!507 = !DILocation(line: 474, column: 19, scope: !508)
!508 = !DILexicalBlockFile(scope: !505, file: !15, discriminator: 1)
!509 = !DILocation(line: 474, column: 6, scope: !508)
!510 = !DILocation(line: 475, column: 12, scope: !505)
!511 = !DILocation(line: 475, column: 53, scope: !505)
!512 = !DILocation(line: 475, column: 64, scope: !505)
!513 = !DILocation(line: 475, column: 3, scope: !508)
!514 = !DILocation(line: 475, column: 3, scope: !505)
!515 = !DILocation(line: 477, column: 27, scope: !482)
!516 = !DILocation(line: 477, column: 2, scope: !482)
!517 = !DILocation(line: 479, column: 24, scope: !482)
!518 = !DILocation(line: 479, column: 2, scope: !482)
!519 = !DILocation(line: 480, column: 2, scope: !482)
!520 = !DILocation(line: 482, column: 16, scope: !521)
!521 = distinct !DILexicalBlock(scope: !482, file: !15, line: 482, column: 6)
!522 = !DILocation(line: 482, column: 27, scope: !521)
!523 = !DILocation(line: 482, column: 46, scope: !521)
!524 = !DILocation(line: 483, column: 15, scope: !521)
!525 = !DILocation(line: 483, column: 20, scope: !521)
!526 = !DILocation(line: 483, column: 8, scope: !521)
!527 = !DILocation(line: 483, column: 19, scope: !521)
!528 = !DILocation(line: 482, column: 6, scope: !529)
!529 = !DILexicalBlockFile(scope: !482, file: !15, discriminator: 1)
!530 = !DILocation(line: 484, column: 12, scope: !521)
!531 = !DILocation(line: 484, column: 3, scope: !532)
!532 = !DILexicalBlockFile(scope: !521, file: !15, discriminator: 1)
!533 = !DILocation(line: 484, column: 3, scope: !521)
!534 = !DILocation(line: 486, column: 33, scope: !482)
!535 = !DILocation(line: 486, column: 13, scope: !482)
!536 = !DILocation(line: 486, column: 11, scope: !482)
!537 = !DILocation(line: 489, column: 6, scope: !538)
!538 = distinct !DILexicalBlock(scope: !482, file: !15, line: 489, column: 6)
!539 = !DILocation(line: 489, column: 19, scope: !538)
!540 = !DILocation(line: 489, column: 6, scope: !482)
!541 = !DILocation(line: 490, column: 40, scope: !538)
!542 = !DILocation(line: 490, column: 18, scope: !538)
!543 = !DILocation(line: 490, column: 16, scope: !538)
!544 = !DILocation(line: 490, column: 3, scope: !538)
!545 = !DILocation(line: 492, column: 13, scope: !546)
!546 = distinct !DILexicalBlock(scope: !482, file: !15, line: 492, column: 6)
!547 = !DILocation(line: 492, column: 23, scope: !546)
!548 = !DILocation(line: 492, column: 6, scope: !546)
!549 = !DILocation(line: 492, column: 37, scope: !546)
!550 = !DILocation(line: 492, column: 6, scope: !482)
!551 = !DILocation(line: 493, column: 12, scope: !546)
!552 = !DILocation(line: 493, column: 58, scope: !546)
!553 = !DILocation(line: 493, column: 3, scope: !554)
!554 = !DILexicalBlockFile(scope: !546, file: !15, discriminator: 1)
!555 = !DILocation(line: 493, column: 3, scope: !546)
!556 = !DILocation(line: 495, column: 22, scope: !482)
!557 = !DILocation(line: 495, column: 2, scope: !482)
!558 = !DILocation(line: 497, column: 31, scope: !482)
!559 = !DILocation(line: 497, column: 11, scope: !482)
!560 = !DILocation(line: 497, column: 9, scope: !482)
!561 = !DILocation(line: 500, column: 6, scope: !562)
!562 = distinct !DILexicalBlock(scope: !482, file: !15, line: 500, column: 6)
!563 = !DILocation(line: 500, column: 18, scope: !562)
!564 = !DILocation(line: 500, column: 6, scope: !482)
!565 = !DILocation(line: 501, column: 10, scope: !562)
!566 = !DILocation(line: 501, column: 3, scope: !562)
!567 = !DILocation(line: 503, column: 30, scope: !562)
!568 = !DILocation(line: 503, column: 12, scope: !562)
!569 = !DILocation(line: 503, column: 10, scope: !562)
!570 = !DILocation(line: 506, column: 6, scope: !571)
!571 = distinct !DILexicalBlock(scope: !482, file: !15, line: 506, column: 6)
!572 = !DILocation(line: 506, column: 16, scope: !571)
!573 = !DILocation(line: 506, column: 23, scope: !571)
!574 = !DILocation(line: 506, column: 26, scope: !575)
!575 = !DILexicalBlockFile(scope: !571, file: !15, discriminator: 1)
!576 = !DILocation(line: 506, column: 34, scope: !575)
!577 = !DILocation(line: 506, column: 6, scope: !575)
!578 = !DILocation(line: 507, column: 7, scope: !579)
!579 = distinct !DILexicalBlock(scope: !580, file: !15, line: 507, column: 7)
!580 = distinct !DILexicalBlock(scope: !571, file: !15, line: 506, column: 42)
!581 = !DILocation(line: 507, column: 15, scope: !579)
!582 = !DILocation(line: 507, column: 22, scope: !579)
!583 = !DILocation(line: 507, column: 25, scope: !584)
!584 = !DILexicalBlockFile(scope: !579, file: !15, discriminator: 1)
!585 = !DILocation(line: 507, column: 33, scope: !584)
!586 = !DILocation(line: 507, column: 41, scope: !584)
!587 = !DILocation(line: 507, column: 50, scope: !584)
!588 = !DILocation(line: 508, column: 14, scope: !579)
!589 = !DILocation(line: 508, column: 22, scope: !579)
!590 = !DILocation(line: 508, column: 30, scope: !579)
!591 = !DILocation(line: 508, column: 40, scope: !579)
!592 = !DILocation(line: 508, column: 46, scope: !579)
!593 = !DILocation(line: 508, column: 7, scope: !579)
!594 = !DILocation(line: 508, column: 56, scope: !579)
!595 = !DILocation(line: 508, column: 61, scope: !579)
!596 = !DILocation(line: 509, column: 7, scope: !579)
!597 = !DILocation(line: 509, column: 17, scope: !579)
!598 = !DILocation(line: 509, column: 24, scope: !579)
!599 = !DILocation(line: 509, column: 27, scope: !584)
!600 = !DILocation(line: 509, column: 37, scope: !584)
!601 = !DILocation(line: 509, column: 45, scope: !584)
!602 = !DILocation(line: 509, column: 56, scope: !584)
!603 = !DILocation(line: 510, column: 14, scope: !579)
!604 = !DILocation(line: 510, column: 24, scope: !579)
!605 = !DILocation(line: 510, column: 32, scope: !579)
!606 = !DILocation(line: 510, column: 44, scope: !579)
!607 = !DILocation(line: 510, column: 50, scope: !579)
!608 = !DILocation(line: 510, column: 7, scope: !579)
!609 = !DILocation(line: 510, column: 64, scope: !579)
!610 = !DILocation(line: 510, column: 69, scope: !579)
!611 = !DILocation(line: 511, column: 7, scope: !579)
!612 = !DILocation(line: 511, column: 17, scope: !579)
!613 = !DILocation(line: 511, column: 25, scope: !579)
!614 = !DILocation(line: 511, column: 35, scope: !579)
!615 = !DILocation(line: 511, column: 32, scope: !579)
!616 = !DILocation(line: 507, column: 7, scope: !617)
!617 = !DILexicalBlockFile(scope: !580, file: !15, discriminator: 2)
!618 = !DILocation(line: 512, column: 8, scope: !619)
!619 = distinct !DILexicalBlock(scope: !620, file: !15, line: 512, column: 8)
!620 = distinct !DILexicalBlock(scope: !579, file: !15, line: 511, column: 43)
!621 = !DILocation(line: 512, column: 20, scope: !619)
!622 = !DILocation(line: 512, column: 8, scope: !620)
!623 = !DILocation(line: 513, column: 12, scope: !619)
!624 = !DILocation(line: 514, column: 31, scope: !619)
!625 = !DILocation(line: 514, column: 41, scope: !619)
!626 = !DILocation(line: 514, column: 12, scope: !619)
!627 = !DILocation(line: 513, column: 5, scope: !628)
!628 = !DILexicalBlockFile(scope: !619, file: !15, discriminator: 1)
!629 = !DILocation(line: 513, column: 5, scope: !619)
!630 = !DILocation(line: 515, column: 4, scope: !620)
!631 = !DILocation(line: 518, column: 10, scope: !580)
!632 = !DILocation(line: 519, column: 28, scope: !580)
!633 = !DILocation(line: 519, column: 10, scope: !580)
!634 = !DILocation(line: 520, column: 10, scope: !580)
!635 = !DILocation(line: 520, column: 20, scope: !580)
!636 = !DILocation(line: 521, column: 29, scope: !580)
!637 = !DILocation(line: 521, column: 39, scope: !580)
!638 = !DILocation(line: 521, column: 10, scope: !580)
!639 = !DILocation(line: 520, column: 10, scope: !640)
!640 = !DILexicalBlockFile(scope: !580, file: !15, discriminator: 1)
!641 = !DILocation(line: 522, column: 29, scope: !580)
!642 = !DILocation(line: 522, column: 37, scope: !580)
!643 = !DILocation(line: 522, column: 10, scope: !580)
!644 = !DILocation(line: 520, column: 10, scope: !617)
!645 = !DILocation(line: 520, column: 10, scope: !646)
!646 = !DILexicalBlockFile(scope: !580, file: !15, discriminator: 3)
!647 = !DILocation(line: 518, column: 3, scope: !640)
!648 = !DILocation(line: 526, column: 12, scope: !482)
!649 = !DILocation(line: 526, column: 10, scope: !482)
!650 = !DILocation(line: 527, column: 12, scope: !482)
!651 = !DILocation(line: 527, column: 10, scope: !482)
!652 = !DILocation(line: 529, column: 22, scope: !482)
!653 = !DILocation(line: 529, column: 2, scope: !482)
!654 = !DILocation(line: 529, column: 11, scope: !482)
!655 = !DILocation(line: 529, column: 20, scope: !482)
!656 = !DILocation(line: 530, column: 30, scope: !482)
!657 = !DILocation(line: 530, column: 2, scope: !482)
!658 = !DILocation(line: 530, column: 11, scope: !482)
!659 = !DILocation(line: 530, column: 21, scope: !482)
!660 = !DILocation(line: 530, column: 28, scope: !482)
!661 = !DILocation(line: 531, column: 2, scope: !482)
!662 = !DILocation(line: 531, column: 11, scope: !482)
!663 = !DILocation(line: 531, column: 22, scope: !482)
!664 = !DILocation(line: 532, column: 20, scope: !482)
!665 = !DILocation(line: 532, column: 2, scope: !482)
!666 = !DILocation(line: 532, column: 11, scope: !482)
!667 = !DILocation(line: 532, column: 18, scope: !482)
!668 = !DILocation(line: 534, column: 24, scope: !482)
!669 = !DILocation(line: 534, column: 2, scope: !482)
!670 = !DILocation(line: 534, column: 11, scope: !482)
!671 = !DILocation(line: 534, column: 22, scope: !482)
!672 = !DILocation(line: 535, column: 32, scope: !482)
!673 = !DILocation(line: 535, column: 2, scope: !482)
!674 = !DILocation(line: 535, column: 11, scope: !482)
!675 = !DILocation(line: 535, column: 23, scope: !482)
!676 = !DILocation(line: 535, column: 30, scope: !482)
!677 = !DILocation(line: 536, column: 2, scope: !482)
!678 = !DILocation(line: 536, column: 11, scope: !482)
!679 = !DILocation(line: 536, column: 20, scope: !482)
!680 = !DILocation(line: 537, column: 20, scope: !482)
!681 = !DILocation(line: 537, column: 2, scope: !482)
!682 = !DILocation(line: 537, column: 11, scope: !482)
!683 = !DILocation(line: 537, column: 18, scope: !482)
!684 = !DILocation(line: 540, column: 6, scope: !685)
!685 = distinct !DILexicalBlock(scope: !482, file: !15, line: 540, column: 6)
!686 = !DILocation(line: 540, column: 18, scope: !685)
!687 = !DILocation(line: 540, column: 6, scope: !482)
!688 = !DILocation(line: 541, column: 10, scope: !685)
!689 = !DILocation(line: 541, column: 55, scope: !685)
!690 = !DILocation(line: 541, column: 36, scope: !691)
!691 = !DILexicalBlockFile(scope: !685, file: !15, discriminator: 1)
!692 = !DILocation(line: 541, column: 3, scope: !693)
!693 = !DILexicalBlockFile(scope: !685, file: !15, discriminator: 2)
!694 = !DILocation(line: 541, column: 3, scope: !685)
!695 = !DILocation(line: 542, column: 6, scope: !696)
!696 = distinct !DILexicalBlock(scope: !482, file: !15, line: 542, column: 6)
!697 = !DILocation(line: 542, column: 6, scope: !482)
!698 = !DILocation(line: 543, column: 16, scope: !696)
!699 = !DILocation(line: 543, column: 14, scope: !696)
!700 = !DILocation(line: 543, column: 3, scope: !696)
!701 = !DILocation(line: 545, column: 6, scope: !702)
!702 = distinct !DILexicalBlock(scope: !482, file: !15, line: 545, column: 6)
!703 = !DILocation(line: 545, column: 17, scope: !702)
!704 = !DILocation(line: 545, column: 47, scope: !705)
!705 = !DILexicalBlockFile(scope: !702, file: !15, discriminator: 1)
!706 = !DILocation(line: 545, column: 55, scope: !705)
!707 = !DILocation(line: 545, column: 20, scope: !705)
!708 = !DILocation(line: 545, column: 6, scope: !705)
!709 = !DILocation(line: 546, column: 7, scope: !710)
!710 = distinct !DILexicalBlock(scope: !711, file: !15, line: 546, column: 7)
!711 = distinct !DILexicalBlock(scope: !702, file: !15, line: 545, column: 66)
!712 = !DILocation(line: 546, column: 19, scope: !710)
!713 = !DILocation(line: 546, column: 7, scope: !711)
!714 = !DILocation(line: 547, column: 11, scope: !710)
!715 = !DILocation(line: 549, column: 11, scope: !710)
!716 = !DILocation(line: 549, column: 21, scope: !710)
!717 = !DILocation(line: 549, column: 29, scope: !710)
!718 = !DILocation(line: 547, column: 4, scope: !719)
!719 = !DILexicalBlockFile(scope: !710, file: !15, discriminator: 1)
!720 = !DILocation(line: 547, column: 4, scope: !710)
!721 = !DILocation(line: 550, column: 14, scope: !711)
!722 = !DILocation(line: 551, column: 2, scope: !711)
!723 = !DILocation(line: 552, column: 6, scope: !724)
!724 = distinct !DILexicalBlock(scope: !482, file: !15, line: 552, column: 6)
!725 = !DILocation(line: 552, column: 17, scope: !724)
!726 = !DILocation(line: 552, column: 43, scope: !727)
!727 = !DILexicalBlockFile(scope: !724, file: !15, discriminator: 1)
!728 = !DILocation(line: 552, column: 20, scope: !727)
!729 = !DILocation(line: 552, column: 6, scope: !727)
!730 = !DILocation(line: 553, column: 11, scope: !724)
!731 = !DILocation(line: 554, column: 54, scope: !724)
!732 = !DILocation(line: 553, column: 3, scope: !727)
!733 = !DILocation(line: 553, column: 3, scope: !724)
!734 = !DILocation(line: 555, column: 7, scope: !735)
!735 = distinct !DILexicalBlock(scope: !482, file: !15, line: 555, column: 6)
!736 = !DILocation(line: 555, column: 6, scope: !482)
!737 = !DILocation(line: 556, column: 3, scope: !738)
!738 = distinct !DILexicalBlock(scope: !735, file: !15, line: 555, column: 17)
!739 = !DILocation(line: 557, column: 7, scope: !740)
!740 = distinct !DILexicalBlock(scope: !738, file: !15, line: 557, column: 7)
!741 = !DILocation(line: 557, column: 7, scope: !738)
!742 = !DILocation(line: 558, column: 4, scope: !740)
!743 = !DILocation(line: 559, column: 2, scope: !738)
!744 = !DILocation(line: 561, column: 2, scope: !482)
!745 = !DILocation(line: 562, column: 1, scope: !482)
!746 = distinct !DISubprogram(name: "diversion_remove", scope: !15, file: !15, line: 597, type: !200, isLocal: true, isDefinition: true, scopeLine: 598, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!747 = !DILocalVariable(name: "argv", arg: 1, scope: !746, file: !15, line: 597, type: !202)
!748 = !DILocation(line: 597, column: 37, scope: !746)
!749 = !DILocalVariable(name: "filename", scope: !746, file: !15, line: 599, type: !19)
!750 = !DILocation(line: 599, column: 14, scope: !746)
!751 = !DILocation(line: 599, column: 25, scope: !746)
!752 = !DILocalVariable(name: "namenode", scope: !746, file: !15, line: 600, type: !216)
!753 = !DILocation(line: 600, column: 24, scope: !746)
!754 = !DILocalVariable(name: "contest", scope: !746, file: !15, line: 601, type: !212)
!755 = !DILocation(line: 601, column: 25, scope: !746)
!756 = !DILocalVariable(name: "altname", scope: !746, file: !15, line: 601, type: !212)
!757 = !DILocation(line: 601, column: 35, scope: !746)
!758 = !DILocalVariable(name: "file_from", scope: !746, file: !15, line: 602, type: !16)
!759 = !DILocation(line: 602, column: 14, scope: !746)
!760 = !DILocalVariable(name: "file_to", scope: !746, file: !15, line: 602, type: !16)
!761 = !DILocation(line: 602, column: 25, scope: !746)
!762 = !DILocalVariable(name: "pkgset", scope: !746, file: !15, line: 603, type: !256)
!763 = !DILocation(line: 603, column: 17, scope: !746)
!764 = !DILocation(line: 605, column: 2, scope: !746)
!765 = !DILocation(line: 607, column: 7, scope: !766)
!766 = distinct !DILexicalBlock(scope: !746, file: !15, line: 607, column: 6)
!767 = !DILocation(line: 607, column: 16, scope: !766)
!768 = !DILocation(line: 607, column: 19, scope: !769)
!769 = !DILexicalBlockFile(scope: !766, file: !15, discriminator: 1)
!770 = !DILocation(line: 607, column: 6, scope: !769)
!771 = !DILocation(line: 608, column: 12, scope: !766)
!772 = !DILocation(line: 608, column: 53, scope: !766)
!773 = !DILocation(line: 608, column: 64, scope: !766)
!774 = !DILocation(line: 608, column: 3, scope: !769)
!775 = !DILocation(line: 608, column: 3, scope: !766)
!776 = !DILocation(line: 610, column: 27, scope: !746)
!777 = !DILocation(line: 610, column: 2, scope: !746)
!778 = !DILocation(line: 612, column: 33, scope: !746)
!779 = !DILocation(line: 612, column: 13, scope: !746)
!780 = !DILocation(line: 612, column: 11, scope: !746)
!781 = !DILocation(line: 614, column: 6, scope: !782)
!782 = distinct !DILexicalBlock(scope: !746, file: !15, line: 614, column: 6)
!783 = !DILocation(line: 614, column: 15, scope: !782)
!784 = !DILocation(line: 614, column: 22, scope: !782)
!785 = !DILocation(line: 614, column: 25, scope: !786)
!786 = !DILexicalBlockFile(scope: !782, file: !15, discriminator: 1)
!787 = !DILocation(line: 614, column: 35, scope: !786)
!788 = !DILocation(line: 614, column: 42, scope: !786)
!789 = !DILocation(line: 614, column: 50, scope: !786)
!790 = !DILocation(line: 615, column: 6, scope: !782)
!791 = !DILocation(line: 615, column: 16, scope: !782)
!792 = !DILocation(line: 615, column: 24, scope: !782)
!793 = !DILocation(line: 615, column: 35, scope: !782)
!794 = !DILocation(line: 614, column: 6, scope: !795)
!795 = !DILexicalBlockFile(scope: !746, file: !15, discriminator: 2)
!796 = !DILocation(line: 616, column: 7, scope: !797)
!797 = distinct !DILexicalBlock(scope: !798, file: !15, line: 616, column: 7)
!798 = distinct !DILexicalBlock(scope: !782, file: !15, line: 615, column: 43)
!799 = !DILocation(line: 616, column: 19, scope: !797)
!800 = !DILocation(line: 616, column: 7, scope: !798)
!801 = !DILocation(line: 617, column: 11, scope: !797)
!802 = !DILocation(line: 618, column: 29, scope: !797)
!803 = !DILocation(line: 618, column: 11, scope: !797)
!804 = !DILocation(line: 617, column: 4, scope: !805)
!805 = !DILexicalBlockFile(scope: !797, file: !15, discriminator: 1)
!806 = !DILocation(line: 617, column: 4, scope: !797)
!807 = !DILocation(line: 619, column: 3, scope: !798)
!808 = !DILocation(line: 622, column: 6, scope: !809)
!809 = distinct !DILexicalBlock(scope: !746, file: !15, line: 622, column: 6)
!810 = !DILocation(line: 622, column: 18, scope: !809)
!811 = !DILocation(line: 622, column: 6, scope: !746)
!812 = !DILocation(line: 623, column: 10, scope: !809)
!813 = !DILocation(line: 623, column: 3, scope: !809)
!814 = !DILocation(line: 625, column: 30, scope: !809)
!815 = !DILocation(line: 625, column: 12, scope: !809)
!816 = !DILocation(line: 625, column: 10, scope: !809)
!817 = !DILocation(line: 627, column: 12, scope: !746)
!818 = !DILocation(line: 627, column: 22, scope: !746)
!819 = !DILocation(line: 627, column: 10, scope: !746)
!820 = !DILocation(line: 628, column: 12, scope: !746)
!821 = !DILocation(line: 628, column: 21, scope: !746)
!822 = !DILocation(line: 628, column: 33, scope: !746)
!823 = !DILocation(line: 628, column: 10, scope: !746)
!824 = !DILocation(line: 630, column: 6, scope: !825)
!825 = distinct !DILexicalBlock(scope: !746, file: !15, line: 630, column: 6)
!826 = !DILocation(line: 630, column: 19, scope: !825)
!827 = !DILocation(line: 630, column: 26, scope: !825)
!828 = !DILocation(line: 631, column: 13, scope: !825)
!829 = !DILocation(line: 631, column: 27, scope: !825)
!830 = !DILocation(line: 631, column: 36, scope: !825)
!831 = !DILocation(line: 631, column: 48, scope: !825)
!832 = !DILocation(line: 631, column: 6, scope: !825)
!833 = !DILocation(line: 631, column: 54, scope: !825)
!834 = !DILocation(line: 630, column: 6, scope: !835)
!835 = !DILexicalBlockFile(scope: !746, file: !15, discriminator: 1)
!836 = !DILocation(line: 632, column: 10, scope: !825)
!837 = !DILocation(line: 635, column: 28, scope: !825)
!838 = !DILocation(line: 635, column: 10, scope: !825)
!839 = !DILocation(line: 636, column: 29, scope: !825)
!840 = !DILocation(line: 636, column: 10, scope: !825)
!841 = !DILocation(line: 632, column: 3, scope: !842)
!842 = !DILexicalBlockFile(scope: !825, file: !15, discriminator: 1)
!843 = !DILocation(line: 632, column: 3, scope: !825)
!844 = !DILocation(line: 638, column: 7, scope: !845)
!845 = distinct !DILexicalBlock(scope: !746, file: !15, line: 638, column: 6)
!846 = !DILocation(line: 638, column: 29, scope: !845)
!847 = !DILocation(line: 638, column: 32, scope: !848)
!848 = !DILexicalBlockFile(scope: !845, file: !15, discriminator: 1)
!849 = !DILocation(line: 638, column: 42, scope: !848)
!850 = !DILocation(line: 638, column: 51, scope: !848)
!851 = !DILocation(line: 638, column: 39, scope: !848)
!852 = !DILocation(line: 638, column: 6, scope: !848)
!853 = !DILocation(line: 639, column: 10, scope: !845)
!854 = !DILocation(line: 642, column: 28, scope: !845)
!855 = !DILocation(line: 642, column: 10, scope: !845)
!856 = !DILocation(line: 643, column: 29, scope: !845)
!857 = !DILocation(line: 643, column: 10, scope: !845)
!858 = !DILocation(line: 639, column: 3, scope: !848)
!859 = !DILocation(line: 639, column: 3, scope: !845)
!860 = !DILocation(line: 647, column: 26, scope: !861)
!861 = distinct !DILexicalBlock(scope: !746, file: !15, line: 647, column: 6)
!862 = !DILocation(line: 647, column: 34, scope: !861)
!863 = !DILocation(line: 647, column: 6, scope: !861)
!864 = !DILocation(line: 647, column: 6, scope: !746)
!865 = !DILocation(line: 648, column: 7, scope: !866)
!866 = distinct !DILexicalBlock(scope: !867, file: !15, line: 648, column: 7)
!867 = distinct !DILexicalBlock(scope: !861, file: !15, line: 647, column: 45)
!868 = !DILocation(line: 648, column: 19, scope: !866)
!869 = !DILocation(line: 648, column: 7, scope: !867)
!870 = !DILocation(line: 649, column: 11, scope: !866)
!871 = !DILocation(line: 650, column: 30, scope: !866)
!872 = !DILocation(line: 650, column: 11, scope: !866)
!873 = !DILocation(line: 649, column: 4, scope: !874)
!874 = !DILexicalBlockFile(scope: !866, file: !15, discriminator: 1)
!875 = !DILocation(line: 649, column: 4, scope: !866)
!876 = !DILocation(line: 651, column: 3, scope: !867)
!877 = !DILocation(line: 654, column: 6, scope: !878)
!878 = distinct !DILexicalBlock(scope: !746, file: !15, line: 654, column: 6)
!879 = !DILocation(line: 654, column: 18, scope: !878)
!880 = !DILocation(line: 654, column: 6, scope: !746)
!881 = !DILocation(line: 655, column: 10, scope: !878)
!882 = !DILocation(line: 655, column: 57, scope: !878)
!883 = !DILocation(line: 655, column: 38, scope: !884)
!884 = !DILexicalBlockFile(scope: !878, file: !15, discriminator: 1)
!885 = !DILocation(line: 655, column: 3, scope: !886)
!886 = !DILexicalBlockFile(scope: !878, file: !15, discriminator: 2)
!887 = !DILocation(line: 655, column: 3, scope: !878)
!888 = !DILocation(line: 657, column: 24, scope: !746)
!889 = !DILocation(line: 657, column: 33, scope: !746)
!890 = !DILocation(line: 657, column: 43, scope: !746)
!891 = !DILocation(line: 657, column: 2, scope: !746)
!892 = !DILocation(line: 658, column: 22, scope: !746)
!893 = !DILocation(line: 658, column: 31, scope: !746)
!894 = !DILocation(line: 658, column: 43, scope: !746)
!895 = !DILocation(line: 658, column: 2, scope: !746)
!896 = !DILocation(line: 661, column: 2, scope: !746)
!897 = !DILocation(line: 661, column: 11, scope: !746)
!898 = !DILocation(line: 661, column: 23, scope: !746)
!899 = !DILocation(line: 661, column: 30, scope: !746)
!900 = !DILocation(line: 662, column: 2, scope: !746)
!901 = !DILocation(line: 662, column: 11, scope: !746)
!902 = !DILocation(line: 662, column: 21, scope: !746)
!903 = !DILocation(line: 662, column: 28, scope: !746)
!904 = !DILocation(line: 664, column: 6, scope: !905)
!905 = distinct !DILexicalBlock(scope: !746, file: !15, line: 664, column: 6)
!906 = !DILocation(line: 664, column: 6, scope: !746)
!907 = !DILocation(line: 665, column: 16, scope: !905)
!908 = !DILocation(line: 665, column: 14, scope: !905)
!909 = !DILocation(line: 665, column: 3, scope: !905)
!910 = !DILocation(line: 666, column: 6, scope: !911)
!911 = distinct !DILexicalBlock(scope: !746, file: !15, line: 666, column: 6)
!912 = !DILocation(line: 666, column: 17, scope: !911)
!913 = !DILocation(line: 666, column: 21, scope: !914)
!914 = !DILexicalBlockFile(scope: !911, file: !15, discriminator: 1)
!915 = !DILocation(line: 666, column: 6, scope: !914)
!916 = !DILocation(line: 667, column: 3, scope: !911)
!917 = !DILocation(line: 669, column: 7, scope: !918)
!918 = distinct !DILexicalBlock(scope: !746, file: !15, line: 669, column: 6)
!919 = !DILocation(line: 669, column: 6, scope: !746)
!920 = !DILocation(line: 670, column: 3, scope: !918)
!921 = !DILocation(line: 672, column: 2, scope: !746)
!922 = !DILocation(line: 673, column: 1, scope: !746)
!923 = distinct !DISubprogram(name: "diversion_list", scope: !15, file: !15, line: 676, type: !200, isLocal: true, isDefinition: true, scopeLine: 677, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!924 = !DILocalVariable(name: "argv", arg: 1, scope: !923, file: !15, line: 676, type: !202)
!925 = !DILocation(line: 676, column: 35, scope: !923)
!926 = !DILocalVariable(name: "iter", scope: !923, file: !15, line: 678, type: !927)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_hash_iter", file: !71, line: 177, flags: DIFlagFwdDecl)
!929 = !DILocation(line: 678, column: 25, scope: !923)
!930 = !DILocalVariable(name: "namenode", scope: !923, file: !15, line: 679, type: !216)
!931 = !DILocation(line: 679, column: 24, scope: !923)
!932 = !DILocalVariable(name: "glob_list", scope: !923, file: !15, line: 680, type: !933)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "glob_node", file: !935, line: 34, size: 128, align: 64, elements: !936)
!935 = !DIFile(filename: "../lib/dpkg/glob.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-divert")
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !934, file: !935, line: 35, baseType: !933, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !934, file: !935, line: 36, baseType: !238, size: 64, align: 64, offset: 64)
!939 = !DILocation(line: 680, column: 20, scope: !923)
!940 = !DILocalVariable(name: "pattern", scope: !923, file: !15, line: 681, type: !19)
!941 = !DILocation(line: 681, column: 14, scope: !923)
!942 = !DILocation(line: 683, column: 2, scope: !923)
!943 = !DILocation(line: 683, column: 25, scope: !944)
!944 = !DILexicalBlockFile(scope: !923, file: !15, discriminator: 1)
!945 = !DILocation(line: 683, column: 20, scope: !944)
!946 = !DILocation(line: 683, column: 18, scope: !944)
!947 = !DILocation(line: 683, column: 2, scope: !944)
!948 = !DILocation(line: 684, column: 42, scope: !923)
!949 = !DILocation(line: 684, column: 33, scope: !923)
!950 = !DILocation(line: 684, column: 3, scope: !944)
!951 = !DILocation(line: 683, column: 2, scope: !952)
!952 = !DILexicalBlockFile(scope: !923, file: !15, discriminator: 2)
!953 = distinct !{!953, !942}
!954 = !DILocation(line: 686, column: 6, scope: !955)
!955 = distinct !DILexicalBlock(scope: !923, file: !15, line: 686, column: 6)
!956 = !DILocation(line: 686, column: 16, scope: !955)
!957 = !DILocation(line: 686, column: 6, scope: !923)
!958 = !DILocation(line: 687, column: 33, scope: !955)
!959 = !DILocation(line: 687, column: 3, scope: !960)
!960 = !DILexicalBlockFile(scope: !955, file: !15, discriminator: 1)
!961 = !DILocation(line: 687, column: 3, scope: !955)
!962 = !DILocation(line: 689, column: 9, scope: !923)
!963 = !DILocation(line: 689, column: 7, scope: !923)
!964 = !DILocation(line: 690, column: 2, scope: !923)
!965 = !DILocation(line: 690, column: 41, scope: !944)
!966 = !DILocation(line: 690, column: 21, scope: !944)
!967 = !DILocation(line: 690, column: 19, scope: !944)
!968 = !DILocation(line: 690, column: 2, scope: !944)
!969 = !DILocalVariable(name: "g", scope: !970, file: !15, line: 691, type: !933)
!970 = distinct !DILexicalBlock(scope: !923, file: !15, line: 690, column: 49)
!971 = !DILocation(line: 691, column: 21, scope: !970)
!972 = !DILocalVariable(name: "contest", scope: !970, file: !15, line: 692, type: !212)
!973 = !DILocation(line: 692, column: 26, scope: !970)
!974 = !DILocation(line: 692, column: 36, scope: !970)
!975 = !DILocation(line: 692, column: 46, scope: !970)
!976 = !DILocalVariable(name: "altname", scope: !970, file: !15, line: 693, type: !212)
!977 = !DILocation(line: 693, column: 26, scope: !970)
!978 = !DILocalVariable(name: "pkgname", scope: !970, file: !15, line: 694, type: !19)
!979 = !DILocation(line: 694, column: 15, scope: !970)
!980 = !DILocation(line: 696, column: 7, scope: !981)
!981 = distinct !DILexicalBlock(scope: !970, file: !15, line: 696, column: 7)
!982 = !DILocation(line: 696, column: 15, scope: !981)
!983 = !DILocation(line: 696, column: 22, scope: !981)
!984 = !DILocation(line: 696, column: 25, scope: !985)
!985 = !DILexicalBlockFile(scope: !981, file: !15, discriminator: 1)
!986 = !DILocation(line: 696, column: 34, scope: !985)
!987 = !DILocation(line: 696, column: 45, scope: !985)
!988 = !DILocation(line: 696, column: 7, scope: !985)
!989 = !DILocation(line: 697, column: 4, scope: !981)
!990 = distinct !{!990, !964}
!991 = !DILocation(line: 699, column: 13, scope: !970)
!992 = !DILocation(line: 699, column: 22, scope: !970)
!993 = !DILocation(line: 699, column: 34, scope: !970)
!994 = !DILocation(line: 699, column: 11, scope: !970)
!995 = !DILocation(line: 701, column: 32, scope: !970)
!996 = !DILocation(line: 701, column: 13, scope: !970)
!997 = !DILocation(line: 701, column: 11, scope: !970)
!998 = !DILocation(line: 703, column: 12, scope: !999)
!999 = distinct !DILexicalBlock(scope: !970, file: !15, line: 703, column: 3)
!1000 = !DILocation(line: 703, column: 10, scope: !999)
!1001 = !DILocation(line: 703, column: 8, scope: !999)
!1002 = !DILocation(line: 703, column: 23, scope: !1003)
!1003 = !DILexicalBlockFile(scope: !1004, file: !15, discriminator: 1)
!1004 = distinct !DILexicalBlock(scope: !999, file: !15, line: 703, column: 3)
!1005 = !DILocation(line: 703, column: 3, scope: !1003)
!1006 = !DILocation(line: 704, column: 16, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !15, line: 704, column: 8)
!1008 = distinct !DILexicalBlock(scope: !1004, file: !15, line: 703, column: 39)
!1009 = !DILocation(line: 704, column: 19, scope: !1007)
!1010 = !DILocation(line: 704, column: 28, scope: !1007)
!1011 = !DILocation(line: 704, column: 8, scope: !1007)
!1012 = !DILocation(line: 704, column: 40, scope: !1007)
!1013 = !DILocation(line: 704, column: 45, scope: !1007)
!1014 = !DILocation(line: 705, column: 16, scope: !1007)
!1015 = !DILocation(line: 705, column: 19, scope: !1007)
!1016 = !DILocation(line: 705, column: 28, scope: !1007)
!1017 = !DILocation(line: 705, column: 37, scope: !1007)
!1018 = !DILocation(line: 705, column: 49, scope: !1007)
!1019 = !DILocation(line: 705, column: 8, scope: !1007)
!1020 = !DILocation(line: 705, column: 58, scope: !1007)
!1021 = !DILocation(line: 705, column: 63, scope: !1007)
!1022 = !DILocation(line: 706, column: 16, scope: !1007)
!1023 = !DILocation(line: 706, column: 19, scope: !1007)
!1024 = !DILocation(line: 706, column: 28, scope: !1007)
!1025 = !DILocation(line: 706, column: 37, scope: !1007)
!1026 = !DILocation(line: 706, column: 47, scope: !1007)
!1027 = !DILocation(line: 706, column: 8, scope: !1007)
!1028 = !DILocation(line: 706, column: 56, scope: !1007)
!1029 = !DILocation(line: 704, column: 8, scope: !1030)
!1030 = !DILexicalBlockFile(scope: !1008, file: !15, discriminator: 1)
!1031 = !DILocation(line: 707, column: 39, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1007, file: !15, line: 706, column: 62)
!1033 = !DILocation(line: 707, column: 20, scope: !1032)
!1034 = !DILocation(line: 707, column: 5, scope: !1035)
!1035 = !DILexicalBlockFile(scope: !1032, file: !15, discriminator: 1)
!1036 = !DILocation(line: 708, column: 5, scope: !1032)
!1037 = !DILocation(line: 710, column: 3, scope: !1008)
!1038 = !DILocation(line: 703, column: 30, scope: !1039)
!1039 = !DILexicalBlockFile(scope: !1004, file: !15, discriminator: 2)
!1040 = !DILocation(line: 703, column: 33, scope: !1039)
!1041 = !DILocation(line: 703, column: 28, scope: !1039)
!1042 = !DILocation(line: 703, column: 3, scope: !1039)
!1043 = distinct !{!1043, !1044}
!1044 = !DILocation(line: 703, column: 3, scope: !970)
!1045 = !DILocation(line: 690, column: 2, scope: !952)
!1046 = !DILocation(line: 712, column: 22, scope: !923)
!1047 = !DILocation(line: 712, column: 2, scope: !923)
!1048 = !DILocation(line: 714, column: 17, scope: !923)
!1049 = !DILocation(line: 714, column: 2, scope: !923)
!1050 = !DILocation(line: 716, column: 2, scope: !923)
!1051 = distinct !DISubprogram(name: "diversion_listpackage", scope: !15, file: !15, line: 742, type: !200, isLocal: true, isDefinition: true, scopeLine: 743, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!1052 = !DILocalVariable(name: "argv", arg: 1, scope: !1051, file: !15, line: 742, type: !202)
!1053 = !DILocation(line: 742, column: 42, scope: !1051)
!1054 = !DILocalVariable(name: "filename", scope: !1051, file: !15, line: 744, type: !19)
!1055 = !DILocation(line: 744, column: 14, scope: !1051)
!1056 = !DILocation(line: 744, column: 25, scope: !1051)
!1057 = !DILocalVariable(name: "namenode", scope: !1051, file: !15, line: 745, type: !216)
!1058 = !DILocation(line: 745, column: 24, scope: !1051)
!1059 = !DILocation(line: 747, column: 7, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1051, file: !15, line: 747, column: 6)
!1061 = !DILocation(line: 747, column: 16, scope: !1060)
!1062 = !DILocation(line: 747, column: 19, scope: !1063)
!1063 = !DILexicalBlockFile(scope: !1060, file: !15, discriminator: 1)
!1064 = !DILocation(line: 747, column: 6, scope: !1063)
!1065 = !DILocation(line: 748, column: 12, scope: !1060)
!1066 = !DILocation(line: 748, column: 53, scope: !1060)
!1067 = !DILocation(line: 748, column: 64, scope: !1060)
!1068 = !DILocation(line: 748, column: 3, scope: !1063)
!1069 = !DILocation(line: 748, column: 3, scope: !1060)
!1070 = !DILocation(line: 750, column: 27, scope: !1051)
!1071 = !DILocation(line: 750, column: 2, scope: !1051)
!1072 = !DILocation(line: 752, column: 33, scope: !1051)
!1073 = !DILocation(line: 752, column: 13, scope: !1051)
!1074 = !DILocation(line: 752, column: 11, scope: !1051)
!1075 = !DILocation(line: 755, column: 6, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1051, file: !15, line: 755, column: 6)
!1077 = !DILocation(line: 755, column: 15, scope: !1076)
!1078 = !DILocation(line: 755, column: 22, scope: !1076)
!1079 = !DILocation(line: 755, column: 25, scope: !1080)
!1080 = !DILexicalBlockFile(scope: !1076, file: !15, discriminator: 1)
!1081 = !DILocation(line: 755, column: 35, scope: !1080)
!1082 = !DILocation(line: 755, column: 42, scope: !1080)
!1083 = !DILocation(line: 755, column: 6, scope: !1080)
!1084 = !DILocation(line: 756, column: 3, scope: !1076)
!1085 = !DILocation(line: 758, column: 6, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1051, file: !15, line: 758, column: 6)
!1087 = !DILocation(line: 758, column: 16, scope: !1086)
!1088 = !DILocation(line: 758, column: 24, scope: !1086)
!1089 = !DILocation(line: 758, column: 31, scope: !1086)
!1090 = !DILocation(line: 758, column: 6, scope: !1051)
!1091 = !DILocation(line: 761, column: 3, scope: !1086)
!1092 = !DILocation(line: 763, column: 18, scope: !1086)
!1093 = !DILocation(line: 763, column: 28, scope: !1086)
!1094 = !DILocation(line: 763, column: 36, scope: !1086)
!1095 = !DILocation(line: 763, column: 44, scope: !1086)
!1096 = !DILocation(line: 763, column: 3, scope: !1086)
!1097 = !DILocation(line: 765, column: 2, scope: !1051)
!1098 = !DILocation(line: 766, column: 1, scope: !1051)
!1099 = distinct !DISubprogram(name: "diversion_truename", scope: !15, file: !15, line: 720, type: !200, isLocal: true, isDefinition: true, scopeLine: 721, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!1100 = !DILocalVariable(name: "argv", arg: 1, scope: !1099, file: !15, line: 720, type: !202)
!1101 = !DILocation(line: 720, column: 39, scope: !1099)
!1102 = !DILocalVariable(name: "filename", scope: !1099, file: !15, line: 722, type: !19)
!1103 = !DILocation(line: 722, column: 14, scope: !1099)
!1104 = !DILocation(line: 722, column: 25, scope: !1099)
!1105 = !DILocalVariable(name: "namenode", scope: !1099, file: !15, line: 723, type: !216)
!1106 = !DILocation(line: 723, column: 24, scope: !1099)
!1107 = !DILocation(line: 725, column: 7, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1099, file: !15, line: 725, column: 6)
!1109 = !DILocation(line: 725, column: 16, scope: !1108)
!1110 = !DILocation(line: 725, column: 19, scope: !1111)
!1111 = !DILexicalBlockFile(scope: !1108, file: !15, discriminator: 1)
!1112 = !DILocation(line: 725, column: 6, scope: !1111)
!1113 = !DILocation(line: 726, column: 12, scope: !1108)
!1114 = !DILocation(line: 726, column: 53, scope: !1108)
!1115 = !DILocation(line: 726, column: 64, scope: !1108)
!1116 = !DILocation(line: 726, column: 3, scope: !1111)
!1117 = !DILocation(line: 726, column: 3, scope: !1108)
!1118 = !DILocation(line: 728, column: 27, scope: !1099)
!1119 = !DILocation(line: 728, column: 2, scope: !1099)
!1120 = !DILocation(line: 730, column: 33, scope: !1099)
!1121 = !DILocation(line: 730, column: 13, scope: !1099)
!1122 = !DILocation(line: 730, column: 11, scope: !1099)
!1123 = !DILocation(line: 733, column: 6, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1099, file: !15, line: 733, column: 6)
!1125 = !DILocation(line: 733, column: 15, scope: !1124)
!1126 = !DILocation(line: 733, column: 18, scope: !1127)
!1127 = !DILexicalBlockFile(scope: !1124, file: !15, discriminator: 1)
!1128 = !DILocation(line: 733, column: 28, scope: !1127)
!1129 = !DILocation(line: 733, column: 35, scope: !1127)
!1130 = !DILocation(line: 733, column: 38, scope: !1131)
!1131 = !DILexicalBlockFile(scope: !1124, file: !15, discriminator: 2)
!1132 = !DILocation(line: 733, column: 48, scope: !1131)
!1133 = !DILocation(line: 733, column: 56, scope: !1131)
!1134 = !DILocation(line: 733, column: 6, scope: !1131)
!1135 = !DILocation(line: 734, column: 18, scope: !1124)
!1136 = !DILocation(line: 734, column: 28, scope: !1124)
!1137 = !DILocation(line: 734, column: 36, scope: !1124)
!1138 = !DILocation(line: 734, column: 48, scope: !1124)
!1139 = !DILocation(line: 734, column: 3, scope: !1124)
!1140 = !DILocation(line: 736, column: 18, scope: !1124)
!1141 = !DILocation(line: 736, column: 3, scope: !1124)
!1142 = !DILocation(line: 738, column: 2, scope: !1099)
!1143 = distinct !DISubprogram(name: "set_instdir", scope: !15, file: !15, line: 792, type: !192, isLocal: true, isDefinition: true, scopeLine: 793, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!1144 = !DILocalVariable(name: "cip", arg: 1, scope: !1143, file: !15, line: 792, type: !194)
!1145 = !DILocation(line: 792, column: 35, scope: !1143)
!1146 = !DILocalVariable(name: "value", arg: 2, scope: !1143, file: !15, line: 792, type: !19)
!1147 = !DILocation(line: 792, column: 52, scope: !1143)
!1148 = !DILocation(line: 794, column: 30, scope: !1143)
!1149 = !DILocation(line: 794, column: 12, scope: !1143)
!1150 = !DILocation(line: 794, column: 10, scope: !1143)
!1151 = !DILocation(line: 795, column: 1, scope: !1143)
!1152 = distinct !DISubprogram(name: "set_root", scope: !15, file: !15, line: 798, type: !192, isLocal: true, isDefinition: true, scopeLine: 799, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!1153 = !DILocalVariable(name: "cip", arg: 1, scope: !1152, file: !15, line: 798, type: !194)
!1154 = !DILocation(line: 798, column: 32, scope: !1152)
!1155 = !DILocalVariable(name: "value", arg: 2, scope: !1152, file: !15, line: 798, type: !19)
!1156 = !DILocation(line: 798, column: 49, scope: !1152)
!1157 = !DILocation(line: 800, column: 30, scope: !1152)
!1158 = !DILocation(line: 800, column: 12, scope: !1152)
!1159 = !DILocation(line: 800, column: 10, scope: !1152)
!1160 = !DILocation(line: 801, column: 13, scope: !1152)
!1161 = !DILocation(line: 801, column: 11, scope: !1152)
!1162 = !DILocation(line: 802, column: 1, scope: !1152)
!1163 = distinct !DISubprogram(name: "set_divertto", scope: !15, file: !15, line: 781, type: !192, isLocal: true, isDefinition: true, scopeLine: 782, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!1164 = !DILocalVariable(name: "cip", arg: 1, scope: !1163, file: !15, line: 781, type: !194)
!1165 = !DILocation(line: 781, column: 36, scope: !1163)
!1166 = !DILocalVariable(name: "value", arg: 2, scope: !1163, file: !15, line: 781, type: !19)
!1167 = !DILocation(line: 781, column: 53, scope: !1163)
!1168 = !DILocation(line: 783, column: 17, scope: !1163)
!1169 = !DILocation(line: 783, column: 15, scope: !1163)
!1170 = !DILocation(line: 785, column: 6, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1163, file: !15, line: 785, column: 6)
!1172 = !DILocation(line: 785, column: 22, scope: !1171)
!1173 = !DILocation(line: 785, column: 6, scope: !1163)
!1174 = !DILocation(line: 786, column: 12, scope: !1171)
!1175 = !DILocation(line: 786, column: 56, scope: !1171)
!1176 = !DILocation(line: 786, column: 3, scope: !1177)
!1177 = !DILexicalBlockFile(scope: !1171, file: !15, discriminator: 1)
!1178 = !DILocation(line: 786, column: 3, scope: !1171)
!1179 = !DILocation(line: 787, column: 13, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1163, file: !15, line: 787, column: 6)
!1181 = !DILocation(line: 787, column: 6, scope: !1180)
!1182 = !DILocation(line: 787, column: 33, scope: !1180)
!1183 = !DILocation(line: 787, column: 6, scope: !1163)
!1184 = !DILocation(line: 788, column: 12, scope: !1180)
!1185 = !DILocation(line: 788, column: 3, scope: !1186)
!1186 = !DILexicalBlockFile(scope: !1180, file: !15, discriminator: 1)
!1187 = !DILocation(line: 788, column: 3, scope: !1180)
!1188 = !DILocation(line: 789, column: 1, scope: !1163)
!1189 = distinct !DISubprogram(name: "usage", scope: !15, file: !15, line: 82, type: !192, isLocal: true, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!1190 = !DILocalVariable(name: "cip", arg: 1, scope: !1189, file: !15, line: 82, type: !194)
!1191 = !DILocation(line: 82, column: 29, scope: !1189)
!1192 = !DILocalVariable(name: "value", arg: 2, scope: !1189, file: !15, line: 82, type: !19)
!1193 = !DILocation(line: 82, column: 46, scope: !1189)
!1194 = !DILocation(line: 84, column: 9, scope: !1189)
!1195 = !DILocation(line: 86, column: 8, scope: !1189)
!1196 = !DILocation(line: 84, column: 2, scope: !1197)
!1197 = !DILexicalBlockFile(scope: !1189, file: !15, discriminator: 1)
!1198 = !DILocation(line: 88, column: 9, scope: !1189)
!1199 = !DILocation(line: 88, column: 2, scope: !1197)
!1200 = !DILocation(line: 97, column: 9, scope: !1189)
!1201 = !DILocation(line: 97, column: 2, scope: !1197)
!1202 = !DILocation(line: 114, column: 9, scope: !1189)
!1203 = !DILocation(line: 114, column: 2, scope: !1197)
!1204 = !DILocation(line: 119, column: 10, scope: !1189)
!1205 = !DILocation(line: 119, column: 18, scope: !1189)
!1206 = !DILocation(line: 119, column: 2, scope: !1197)
!1207 = !DILocation(line: 121, column: 2, scope: !1189)
!1208 = !DILocation(line: 122, column: 1, scope: !1189)
!1209 = distinct !DISubprogram(name: "printversion", scope: !15, file: !15, line: 67, type: !192, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!1210 = !DILocalVariable(name: "cip", arg: 1, scope: !1209, file: !15, line: 67, type: !194)
!1211 = !DILocation(line: 67, column: 36, scope: !1209)
!1212 = !DILocalVariable(name: "value", arg: 2, scope: !1209, file: !15, line: 67, type: !19)
!1213 = !DILocation(line: 67, column: 53, scope: !1209)
!1214 = !DILocation(line: 69, column: 9, scope: !1209)
!1215 = !DILocation(line: 69, column: 45, scope: !1216)
!1216 = !DILexicalBlockFile(scope: !1209, file: !15, discriminator: 1)
!1217 = !DILocation(line: 69, column: 2, scope: !1218)
!1218 = !DILexicalBlockFile(scope: !1209, file: !15, discriminator: 2)
!1219 = !DILocation(line: 72, column: 9, scope: !1209)
!1220 = !DILocation(line: 72, column: 2, scope: !1216)
!1221 = !DILocation(line: 76, column: 10, scope: !1209)
!1222 = !DILocation(line: 76, column: 18, scope: !1209)
!1223 = !DILocation(line: 76, column: 2, scope: !1216)
!1224 = !DILocation(line: 78, column: 2, scope: !1209)
!1225 = !DILocation(line: 79, column: 1, scope: !1209)
!1226 = distinct !DISubprogram(name: "opt_rename_setup", scope: !15, file: !15, line: 125, type: !1227, isLocal: true, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{null}
!1229 = !DILocation(line: 127, column: 6, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1226, file: !15, line: 127, column: 6)
!1231 = !DILocation(line: 127, column: 17, scope: !1230)
!1232 = !DILocation(line: 127, column: 6, scope: !1226)
!1233 = !DILocation(line: 128, column: 3, scope: !1230)
!1234 = !DILocation(line: 130, column: 13, scope: !1226)
!1235 = !DILocation(line: 131, column: 10, scope: !1226)
!1236 = !DILocation(line: 131, column: 2, scope: !1237)
!1237 = !DILexicalBlockFile(scope: !1226, file: !15, discriminator: 1)
!1238 = !DILocation(line: 133, column: 1, scope: !1226)
!1239 = !DILocation(line: 133, column: 1, scope: !1237)
!1240 = distinct !DISubprogram(name: "diversion_check_filename", scope: !15, file: !15, line: 290, type: !1241, isLocal: true, isDefinition: true, scopeLine: 291, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{null, !19}
!1243 = !DILocalVariable(name: "filename", arg: 1, scope: !1240, file: !15, line: 290, type: !19)
!1244 = !DILocation(line: 290, column: 38, scope: !1240)
!1245 = !DILocation(line: 292, column: 6, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1240, file: !15, line: 292, column: 6)
!1247 = !DILocation(line: 292, column: 18, scope: !1246)
!1248 = !DILocation(line: 292, column: 6, scope: !1240)
!1249 = !DILocation(line: 293, column: 12, scope: !1246)
!1250 = !DILocation(line: 293, column: 56, scope: !1246)
!1251 = !DILocation(line: 293, column: 3, scope: !1252)
!1252 = !DILexicalBlockFile(scope: !1246, file: !15, discriminator: 1)
!1253 = !DILocation(line: 293, column: 3, scope: !1246)
!1254 = !DILocation(line: 294, column: 13, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1240, file: !15, line: 294, column: 6)
!1256 = !DILocation(line: 294, column: 6, scope: !1255)
!1257 = !DILocation(line: 294, column: 29, scope: !1255)
!1258 = !DILocation(line: 294, column: 6, scope: !1240)
!1259 = !DILocation(line: 295, column: 12, scope: !1255)
!1260 = !DILocation(line: 295, column: 3, scope: !1261)
!1261 = !DILexicalBlockFile(scope: !1255, file: !15, discriminator: 1)
!1262 = !DILocation(line: 295, column: 3, scope: !1255)
!1263 = !DILocation(line: 296, column: 1, scope: !1240)
!1264 = distinct !DISubprogram(name: "file_init", scope: !15, file: !15, line: 146, type: !1265, isLocal: true, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{null, !1267, !19}
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!1268 = !DILocalVariable(name: "f", arg: 1, scope: !1264, file: !15, line: 146, type: !1267)
!1269 = !DILocation(line: 146, column: 24, scope: !1264)
!1270 = !DILocalVariable(name: "filename", arg: 2, scope: !1264, file: !15, line: 146, type: !19)
!1271 = !DILocation(line: 146, column: 39, scope: !1264)
!1272 = !DILocalVariable(name: "usefilename", scope: !1264, file: !15, line: 148, type: !392)
!1273 = !DILocation(line: 148, column: 16, scope: !1264)
!1274 = !DILocation(line: 150, column: 31, scope: !1264)
!1275 = !DILocation(line: 150, column: 47, scope: !1264)
!1276 = !DILocation(line: 150, column: 40, scope: !1264)
!1277 = !DILocation(line: 150, column: 2, scope: !1278)
!1278 = !DILexicalBlockFile(scope: !1264, file: !15, discriminator: 1)
!1279 = !DILocation(line: 151, column: 31, scope: !1264)
!1280 = !DILocation(line: 151, column: 48, scope: !1264)
!1281 = !DILocation(line: 151, column: 41, scope: !1264)
!1282 = !DILocation(line: 151, column: 2, scope: !1278)
!1283 = !DILocation(line: 152, column: 2, scope: !1264)
!1284 = !DILocation(line: 154, column: 12, scope: !1264)
!1285 = !DILocation(line: 154, column: 2, scope: !1264)
!1286 = !DILocation(line: 154, column: 5, scope: !1264)
!1287 = !DILocation(line: 154, column: 10, scope: !1264)
!1288 = !DILocation(line: 155, column: 2, scope: !1264)
!1289 = !DILocation(line: 155, column: 5, scope: !1264)
!1290 = !DILocation(line: 155, column: 16, scope: !1264)
!1291 = !DILocation(line: 156, column: 1, scope: !1264)
!1292 = distinct !DISubprogram(name: "file_stat", scope: !15, file: !15, line: 159, type: !1293, isLocal: true, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !391)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{null, !1267}
!1295 = !DILocalVariable(name: "f", arg: 1, scope: !1292, file: !15, line: 159, type: !1267)
!1296 = !DILocation(line: 159, column: 24, scope: !1292)
!1297 = !DILocalVariable(name: "ret", scope: !1292, file: !15, line: 161, type: !43)
!1298 = !DILocation(line: 161, column: 6, scope: !1292)
!1299 = !DILocation(line: 163, column: 6, scope: !1300)
!1300 = distinct !DILexicalBlock(scope: !1292, file: !15, line: 163, column: 6)
!1301 = !DILocation(line: 163, column: 9, scope: !1300)
!1302 = !DILocation(line: 163, column: 20, scope: !1300)
!1303 = !DILocation(line: 163, column: 6, scope: !1292)
!1304 = !DILocation(line: 164, column: 3, scope: !1300)
!1305 = !DILocation(line: 166, column: 14, scope: !1292)
!1306 = !DILocation(line: 166, column: 17, scope: !1292)
!1307 = !DILocation(line: 166, column: 24, scope: !1292)
!1308 = !DILocation(line: 166, column: 27, scope: !1292)
!1309 = !DILocation(line: 166, column: 8, scope: !1292)
!1310 = !DILocation(line: 166, column: 6, scope: !1292)
!1311 = !DILocation(line: 167, column: 6, scope: !1312)
!1312 = distinct !DILexicalBlock(scope: !1292, file: !15, line: 167, column: 6)
!1313 = !DILocation(line: 167, column: 10, scope: !1312)
!1314 = !DILocation(line: 167, column: 14, scope: !1315)
