; ModuleID = './libvix_la-vixPlugin.o.i'
source_filename = "./libvix_la-vixPlugin.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ToolsPluginData = type { i8*, %struct._GArray*, i32 (%struct.ToolsAppCtx*, i32, i8*, %struct.ToolsPluginData*)*, i8* }
%struct._GArray = type { i8*, i32 }
%struct.ToolsAppCtx = type { i32, i8*, i32, i32, %struct._GMainLoop*, %struct._RpcChannel*, %struct._GKeyFile*, i32, i32, i8**, i8* }
%struct._GMainLoop = type opaque
%struct._RpcChannel = type opaque
%struct._GKeyFile = type opaque
%struct.RpcChannelCallback = type { i8*, i32 (%struct.RpcInData*)*, i8*, i8*, i8*, i64 }
%struct.RpcInData = type { i8*, i8*, i64, i8*, i64, i32, i8*, i8* }
%struct.ToolsPluginSignalCb = type { i8*, i8*, i8* }
%struct.ToolsAppReg = type { i32, %struct._GArray* }

@vm_version = constant [20 x i8] c"version=10.3.0.5330\00", section ".modinfo", align 16
@ToolsOnLoad.regData = internal global %struct.ToolsPluginData { i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str, i32 0, i32 0), %struct._GArray* null, i32 (%struct.ToolsAppCtx*, i32, i8*, %struct.ToolsPluginData*)* null, i8* null }, align 8
@.str = private unnamed_addr constant [4 x i8] c"vix\00", align 1
@.str.1 = private unnamed_addr constant [18 x i8] c"Vix_1_Run_Program\00", align 1
@.str.2 = private unnamed_addr constant [26 x i8] c"Vix_1_Get_ToolsProperties\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !13)
!1 = !DIFile(filename: "libvix_la-vixPlugin.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1544")
!2 = !{!3, !7}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 232, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/plugin.h", directory: "/home/lichi/Desktop/open-vm-tools/line1544")
!5 = !{!6}
!6 = !DIEnumerator(name: "TOOLS_CORE_API_V1", value: 1)
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 339, size: 32, align: 32, elements: !8)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "TOOLS_APP_GUESTRPC", value: 1)
!10 = !DIEnumerator(name: "TOOLS_APP_SIGNALS", value: 2)
!11 = !DIEnumerator(name: "TOOLS_APP_PROVIDER", value: 3)
!12 = !DIEnumerator(name: "TOOLS_SVC_PROPERTY", value: 4)
!13 = !{!14, !21}
!14 = distinct !DIGlobalVariable(name: "vm_version", scope: !0, file: !15, line: 40, type: !16, isLocal: false, isDefinition: true, variable: [20 x i8]* @vm_version)
!15 = !DIFile(filename: "vixPlugin.c", directory: "/home/lichi/Desktop/open-vm-tools/line1544")
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 160, align: 8, elements: !19)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!19 = !{!20}
!20 = !DISubrange(count: 20)
!21 = distinct !DIGlobalVariable(name: "regData", scope: !22, file: !15, line: 89, type: !26, isLocal: true, isDefinition: true, variable: %struct.ToolsPluginData* @ToolsOnLoad.regData)
!22 = distinct !DISubprogram(name: "ToolsOnLoad", scope: !15, file: !15, line: 87, type: !23, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !87)
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !51}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginData", file: !4, line: 545, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginData", file: !4, line: 501, size: 256, align: 64, elements: !28)
!28 = !{!29, !31, !44, !86}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !27, file: !4, line: 503, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !27, file: !4, line: 508, baseType: !32, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !34, line: 37, baseType: !35)
!34 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line1544")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !34, line: 41, size: 128, align: 64, elements: !36)
!36 = !{!37, !41}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !35, file: !34, line: 43, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !40, line: 46, baseType: !18)
!40 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1544")
!41 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !35, file: !34, line: 44, baseType: !42, size: 32, align: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !40, line: 55, baseType: !43)
!43 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "errorCb", scope: !27, file: !4, line: 539, baseType: !45, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!48, !51, !84, !82, !85}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !40, line: 50, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !40, line: 49, baseType: !50)
!50 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCtx", file: !4, line: 274, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCtx", file: !4, line: 241, size: 576, align: 64, elements: !54)
!54 = !{!55, !57, !60, !61, !62, !67, !72, !77, !78, !79, !81}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !53, file: !4, line: 243, baseType: !56, size: 32, align: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreAPI", file: !4, line: 234, baseType: !3)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !53, file: !4, line: 245, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "isVMware", scope: !53, file: !4, line: 247, baseType: !48, size: 32, align: 32, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "errorCode", scope: !53, file: !4, line: 249, baseType: !50, size: 32, align: 32, offset: 160)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "mainLoop", scope: !53, file: !4, line: 251, baseType: !63, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !65, line: 56, baseType: !66)
!65 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1544")
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !65, line: 56, flags: DIFlagFwdDecl)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !53, file: !4, line: 253, baseType: !68, size: 64, align: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !70, line: 48, baseType: !71)
!70 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1544")
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !70, line: 48, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !53, file: !4, line: 255, baseType: !73, size: 64, align: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !75, line: 48, baseType: !76)
!75 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1544")
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !75, line: 48, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "blockFD", scope: !53, file: !4, line: 261, baseType: !50, size: 32, align: 32, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "uinputFD", scope: !53, file: !4, line: 263, baseType: !50, size: 32, align: 32, offset: 416)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !53, file: !4, line: 265, baseType: !80, size: 64, align: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "serviceObj", scope: !53, file: !4, line: 273, baseType: !82, size: 64, align: 64, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !40, line: 77, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppType", file: !4, line: 360, baseType: !7)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !27, file: !4, line: 544, baseType: !82, size: 64, align: 64, offset: 192)
!87 = !{}
!88 = !{i32 2, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!91 = !DILocalVariable(name: "ctx", arg: 1, scope: !22, file: !15, line: 87, type: !51)
!92 = !DIExpression()
!93 = !DILocation(line: 87, column: 26, scope: !22)
!94 = !DILocalVariable(name: "rpcs", scope: !22, file: !15, line: 95, type: !95)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 1920, align: 64, elements: !125)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannelCallback", file: !70, line: 115, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcChannelCallback", file: !70, line: 94, size: 384, align: 64, elements: !98)
!98 = !{!99, !100, !121, !122, !123, !124}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !97, file: !70, line: 96, baseType: !30, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !97, file: !70, line: 98, baseType: !101, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcIn_Callback", file: !70, line: 90, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!48, !105}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcInData", file: !70, line: 77, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcInData", file: !70, line: 51, size: 512, align: 64, elements: !108)
!108 = !{!109, !110, !111, !115, !117, !118, !119, !120}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !107, file: !70, line: 53, baseType: !30, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !107, file: !70, line: 58, baseType: !30, size: 64, align: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "argsSize", scope: !107, file: !70, line: 60, baseType: !112, size: 64, align: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !113, line: 216, baseType: !114)
!113 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1544")
!114 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !107, file: !70, line: 65, baseType: !116, size: 64, align: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "resultLen", scope: !107, file: !70, line: 67, baseType: !112, size: 64, align: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "freeResult", scope: !107, file: !70, line: 72, baseType: !48, size: 32, align: 32, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "appCtx", scope: !107, file: !70, line: 74, baseType: !83, size: 64, align: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !107, file: !70, line: 76, baseType: !83, size: 64, align: 64, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !97, file: !70, line: 100, baseType: !82, size: 64, align: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "xdrIn", scope: !97, file: !70, line: 102, baseType: !82, size: 64, align: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "xdrOut", scope: !97, file: !70, line: 109, baseType: !82, size: 64, align: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "xdrInSize", scope: !97, file: !70, line: 114, baseType: !112, size: 64, align: 64, offset: 320)
!125 = !{!126}
!126 = !DISubrange(count: 5)
!127 = !DILocation(line: 95, column: 23, scope: !22)
!128 = !DILocalVariable(name: "sigs", scope: !22, file: !15, line: 107, type: !129)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 192, align: 64, elements: !136)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginSignalCb", file: !4, line: 484, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginSignalCb", file: !4, line: 480, size: 192, align: 64, elements: !132)
!132 = !{!133, !134, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "signame", scope: !131, file: !4, line: 481, baseType: !58, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !131, file: !4, line: 482, baseType: !82, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !131, file: !4, line: 483, baseType: !82, size: 64, align: 64, offset: 128)
!136 = !{!137}
!137 = !DISubrange(count: 1)
!138 = !DILocation(line: 107, column: 24, scope: !22)
!139 = !DILocalVariable(name: "regs", scope: !22, file: !15, line: 110, type: !140)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 256, align: 64, elements: !146)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppReg", file: !4, line: 450, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppReg", file: !4, line: 447, size: 128, align: 64, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !142, file: !4, line: 448, baseType: !84, size: 32, align: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !142, file: !4, line: 449, baseType: !32, size: 64, align: 64, offset: 64)
!146 = !{!147}
!147 = !DISubrange(count: 2)
!148 = !DILocation(line: 110, column: 16, scope: !22)
!149 = !DILocation(line: 110, column: 25, scope: !22)
!150 = !DILocation(line: 111, column: 7, scope: !22)
!151 = !DILocation(line: 111, column: 47, scope: !22)
!152 = !DILocation(line: 111, column: 29, scope: !22)
!153 = !DILocation(line: 112, column: 7, scope: !22)
!154 = !DILocation(line: 112, column: 46, scope: !22)
!155 = !DILocation(line: 112, column: 28, scope: !22)
!156 = !DILocation(line: 119, column: 34, scope: !22)
!157 = !DILocation(line: 119, column: 4, scope: !22)
!158 = !DILocation(line: 120, column: 37, scope: !22)
!159 = !DILocation(line: 120, column: 19, scope: !22)
!160 = !DILocation(line: 120, column: 17, scope: !22)
!161 = !DILocation(line: 122, column: 17, scope: !162)
!162 = distinct !DILexicalBlock(scope: !22, file: !15, line: 122, column: 8)
!163 = !DILocation(line: 122, column: 23, scope: !162)
!164 = !DILocation(line: 122, column: 9, scope: !162)
!165 = !DILocation(line: 122, column: 38, scope: !162)
!166 = !DILocation(line: 122, column: 44, scope: !162)
!167 = !DILocation(line: 122, column: 47, scope: !168)
!168 = !DILexicalBlockFile(scope: !162, file: !15, discriminator: 1)
!169 = !DILocation(line: 122, column: 8, scope: !168)
!170 = !DILocalVariable(name: "i", scope: !171, file: !15, line: 123, type: !112)
!171 = distinct !DILexicalBlock(scope: !162, file: !15, line: 122, column: 66)
!172 = !DILocation(line: 123, column: 14, scope: !171)
!173 = !DILocalVariable(name: "reg", scope: !171, file: !15, line: 124, type: !112)
!174 = !DILocation(line: 124, column: 14, scope: !171)
!175 = !DILocation(line: 126, column: 16, scope: !176)
!176 = distinct !DILexicalBlock(scope: !171, file: !15, line: 126, column: 7)
!177 = !DILocation(line: 126, column: 12, scope: !176)
!178 = !DILocation(line: 126, column: 21, scope: !179)
!179 = !DILexicalBlockFile(scope: !180, file: !15, discriminator: 1)
!180 = distinct !DILexicalBlock(scope: !176, file: !15, line: 126, column: 7)
!181 = !DILocation(line: 126, column: 25, scope: !179)
!182 = !DILocation(line: 126, column: 7, scope: !179)
!183 = !DILocation(line: 127, column: 19, scope: !184)
!184 = distinct !DILexicalBlock(scope: !185, file: !15, line: 127, column: 14)
!185 = distinct !DILexicalBlock(scope: !180, file: !15, line: 126, column: 68)
!186 = !DILocation(line: 127, column: 14, scope: !184)
!187 = !DILocation(line: 127, column: 24, scope: !184)
!188 = !DILocation(line: 127, column: 29, scope: !184)
!189 = !DILocation(line: 127, column: 14, scope: !185)
!190 = !DILocalVariable(name: "sysSigs", scope: !191, file: !15, line: 132, type: !129)
!191 = distinct !DILexicalBlock(scope: !184, file: !15, line: 127, column: 51)
!192 = !DILocation(line: 132, column: 33, scope: !191)
!193 = !DILocation(line: 136, column: 20, scope: !194)
!194 = distinct !DILexicalBlock(scope: !191, file: !15, line: 136, column: 13)
!195 = !DILocation(line: 136, column: 18, scope: !194)
!196 = !DILocation(line: 136, column: 25, scope: !197)
!197 = !DILexicalBlockFile(scope: !198, file: !15, discriminator: 1)
!198 = distinct !DILexicalBlock(scope: !194, file: !15, line: 136, column: 13)
!199 = !DILocation(line: 136, column: 27, scope: !197)
!200 = !DILocation(line: 136, column: 13, scope: !197)
!201 = !DILocation(line: 137, column: 42, scope: !202)
!202 = distinct !DILexicalBlock(scope: !198, file: !15, line: 136, column: 74)
!203 = !DILocation(line: 137, column: 37, scope: !202)
!204 = !DILocation(line: 137, column: 47, scope: !202)
!205 = !DILocation(line: 137, column: 63, scope: !202)
!206 = !DILocation(line: 137, column: 55, scope: !202)
!207 = !DILocation(line: 137, column: 53, scope: !202)
!208 = !DILocation(line: 137, column: 16, scope: !202)
!209 = !DILocation(line: 138, column: 13, scope: !202)
!210 = !DILocation(line: 136, column: 70, scope: !211)
