; ModuleID = './libRpcIn_la-rpcin.o.i'
source_filename = "./libRpcIn_la-rpcin.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.RpcIn = type { %struct._GSource*, %struct._GMainContext*, i32 (%struct.RpcInData*)*, i8*, %struct._ConnInfo*, %struct._GSource*, %struct.Message_Channel*, i32, i32, void (i8*, i8*)*, i8*, i8, i8*, i64, i8, i8 }
%struct._ConnInfo = type { %struct.AsyncSocket*, i32, i8*, i32, i8, i8, i8, i32, i64, %struct.RpcIn* }
%struct.AsyncSocket = type opaque
%struct._GSource = type { i8*, %struct._GSourceCallbackFuncs*, %struct._GSourceFuncs*, i32, %struct._GMainContext*, i32, i32, i32, %struct._GSList*, %struct._GSource*, %struct._GSource*, i8*, %struct._GSourcePrivate* }
%struct._GSourceCallbackFuncs = type { void (i8*)*, void (i8*)*, void (i8*, %struct._GSource*, i32 (i8*)**, i8**)* }
%struct._GSourceFuncs = type { i32 (%struct._GSource*, i32*)*, i32 (%struct._GSource*)*, i32 (%struct._GSource*, i32 (i8*)*, i8*)*, void (%struct._GSource*)*, i32 (i8*)*, void ()* }
%struct._GSList = type { i8*, %struct._GSList* }
%struct._GSourcePrivate = type opaque
%struct.Message_Channel = type { i16, i8*, i64, i8, i32, i32 }
%struct._GMainContext = type opaque
%struct.RpcInData = type { i8*, i8*, i64, i8*, i64, i32, i8*, i8* }
%struct.AsyncSocketPollParams = type { i32, %struct.MXUserRecLock*, %struct.PollClassSet, %struct.IVmdbPoll* }
%struct.MXUserRecLock = type opaque
%struct.PollClassSet = type { i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !50, globals: !235)
!1 = !DIFile(filename: "libRpcIn_la-rpcin.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line844")
!2 = !{!3, !18, !23, !27, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 47, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dataMap.h", directory: "/home/lichi/Desktop/open-vm-tools/line844")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "DMERR_SUCCESS", value: 0)
!7 = !DIEnumerator(name: "DMERR_NOT_FOUND", value: 1)
!8 = !DIEnumerator(name: "DMERR_ALREADY_EXIST", value: 2)
!9 = !DIEnumerator(name: "DMERR_DUPLICATED_FIELD_IDS", value: 3)
!10 = !DIEnumerator(name: "DMERR_INSUFFICIENT_MEM", value: 4)
!11 = !DIEnumerator(name: "DMERR_TYPE_MISMATCH", value: 5)
!12 = !DIEnumerator(name: "DMERR_INVALID_ARGS", value: 6)
!13 = !DIEnumerator(name: "DMERR_UNKNOWN_TYPE", value: 7)
!14 = !DIEnumerator(name: "DMERR_TRUNCATED_DATA", value: 8)
!15 = !DIEnumerator(name: "DMERR_BUFFER_TOO_SMALL", value: 9)
!16 = !DIEnumerator(name: "DMERR_INTEGER_OVERFLOW", value: 10)
!17 = !DIEnumerator(name: "DMERR_BAD_DATA", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 122, size: 32, align: 32, elements: !20)
!19 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/guestrpc/tclodefs.h", directory: "/home/lichi/Desktop/open-vm-tools/line844")
!20 = !{!21, !22}
!21 = !DIEnumerator(name: "GUESTRPCPKT_TYPE_DATA", value: 1)
!22 = !DIEnumerator(name: "GUESTRPCPKT_TYPE_PING", value: 2)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 127, size: 32, align: 32, elements: !24)
!24 = !{!25, !26}
!25 = !DIEnumerator(name: "GUESTRPCPKT_FIELD_TYPE", value: 1)
!26 = !DIEnumerator(name: "GUESTRPCPKT_FIELD_PAYLOAD", value: 2)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AsyncSocketState", file: !28, line: 184, size: 32, align: 32, elements: !29)
!28 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/asyncsocket.h", directory: "/home/lichi/Desktop/open-vm-tools/line844")
!29 = !{!30, !31, !32, !33, !34}
!30 = !DIEnumerator(name: "AsyncSocketListening", value: 0)
!31 = !DIEnumerator(name: "AsyncSocketConnecting", value: 1)
!32 = !DIEnumerator(name: "AsyncSocketConnected", value: 2)
!33 = !DIEnumerator(name: "AsyncSocketCBCancelled", value: 3)
!34 = !DIEnumerator(name: "AsyncSocketClosed", value: 4)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 46, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/open-vm-tools/line844")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!38 = !DIEnumerator(name: "_ISupper", value: 256)
!39 = !DIEnumerator(name: "_ISlower", value: 512)
!40 = !DIEnumerator(name: "_ISalpha", value: 1024)
!41 = !DIEnumerator(name: "_ISdigit", value: 2048)
!42 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!43 = !DIEnumerator(name: "_ISspace", value: 8192)
!44 = !DIEnumerator(name: "_ISprint", value: 16384)
!45 = !DIEnumerator(name: "_ISgraph", value: 32768)
!46 = !DIEnumerator(name: "_ISblank", value: 1)
!47 = !DIEnumerator(name: "_IScntrl", value: 2)
!48 = !DIEnumerator(name: "_ISpunct", value: 4)
!49 = !DIEnumerator(name: "_ISalnum", value: 8)
!50 = !{!51, !52, !54, !231, !70, !232, !234, !68, !209}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConnInfo", file: !56, line: 128, baseType: !57)
!56 = !DIFile(filename: "rpcin.c", directory: "/home/lichi/Desktop/open-vm-tools/line844")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ConnInfo", file: !56, line: 113, size: 448, align: 64, elements: !58)
!58 = !{!59, !63, !69, !72, !73, !75, !76, !77, !78, !83}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "asock", scope: !57, file: !56, line: 114, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocket", file: !28, line: 155, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "AsyncSocket", file: !28, line: 155, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "packetLen", scope: !57, file: !56, line: 116, baseType: !64, size: 32, align: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32", file: !65, line: 174, baseType: !66)
!65 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line844")
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !67, line: 196, baseType: !68)
!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line844")
!68 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "recvBuf", scope: !57, file: !56, line: 117, baseType: !70, size: 64, align: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "recvBufLen", scope: !57, file: !56, line: 118, baseType: !68, size: 32, align: 32, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !57, file: !56, line: 120, baseType: !74, size: 8, align: 8, offset: 224)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !65, line: 230, baseType: !71)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "shutDown", scope: !57, file: !56, line: 121, baseType: !74, size: 8, align: 8, offset: 232)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "recvStopped", scope: !57, file: !56, line: 122, baseType: !74, size: 8, align: 8, offset: 240)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "sendQueueLen", scope: !57, file: !56, line: 123, baseType: !68, size: 32, align: 32, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !57, file: !56, line: 125, baseType: !79, size: 64, align: 64, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmTimeType", file: !65, line: 354, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !65, line: 172, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !67, line: 197, baseType: !82)
!82 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !57, file: !56, line: 127, baseType: !84, size: 64, align: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcIn", file: !56, line: 135, size: 896, align: 64, elements: !86)
!86 = !{!87, !172, !173, !196, !197, !198, !199, !217, !218, !219, !225, !226, !227, !228, !229, !230}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "nextEvent", scope: !85, file: !56, line: 137, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !90, line: 64, baseType: !91)
!90 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line844")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !90, line: 171, size: 768, align: 64, elements: !92)
!92 = !{!93, !96, !118, !147, !150, !154, !155, !156, !157, !165, !166, !167, !168}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !91, file: !90, line: 174, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !95, line: 77, baseType: !51)
!95 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line844")
!96 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !91, file: !90, line: 175, baseType: !97, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !90, line: 77, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !90, line: 196, size: 192, align: 64, elements: !100)
!100 = !{!101, !105, !106}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !99, file: !90, line: 198, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !94}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !99, file: !90, line: 199, baseType: !102, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !99, file: !90, line: 200, baseType: !107, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !94, !88, !110, !117}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !90, line: 155, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !94}
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !95, line: 50, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !95, line: 49, baseType: !68)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !91, file: !90, line: 177, baseType: !119, size: 64, align: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !90, line: 130, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !90, line: 214, size: 384, align: 64, elements: !123)
!123 = !{!124, !129, !133, !137, !141, !142}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !122, file: !90, line: 216, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!115, !88, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !122, file: !90, line: 218, baseType: !130, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!115, !88}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !122, file: !90, line: 219, baseType: !134, size: 64, align: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!115, !88, !111, !94}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !122, file: !90, line: 222, baseType: !138, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !88}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !122, file: !90, line: 226, baseType: !111, size: 64, align: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !122, file: !90, line: 227, baseType: !143, size: 64, align: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !90, line: 212, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !91, file: !90, line: 178, baseType: !148, size: 32, align: 32, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !95, line: 55, baseType: !149)
!149 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !91, file: !90, line: 180, baseType: !151, size: 64, align: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !90, line: 48, baseType: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !90, line: 48, flags: DIFlagFwdDecl)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !91, file: !90, line: 182, baseType: !116, size: 32, align: 32, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !91, file: !90, line: 183, baseType: !148, size: 32, align: 32, offset: 352)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !91, file: !90, line: 184, baseType: !148, size: 32, align: 32, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !91, file: !90, line: 186, baseType: !158, size: 64, align: 64, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !160, line: 37, baseType: !161)
!160 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line844")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !160, line: 39, size: 128, align: 64, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !161, file: !160, line: 41, baseType: !94, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !161, file: !160, line: 42, baseType: !158, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !91, file: !90, line: 188, baseType: !88, size: 64, align: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !91, file: !90, line: 189, baseType: !88, size: 64, align: 64, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !91, file: !90, line: 191, baseType: !70, size: 64, align: 64, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !91, file: !90, line: 193, baseType: !169, size: 64, align: 64, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !90, line: 65, baseType: !171)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !90, line: 65, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mainCtx", scope: !85, file: !56, line: 138, baseType: !151, size: 64, align: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !85, file: !56, line: 139, baseType: !174, size: 64, align: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcIn_Callback", file: !175, line: 90, baseType: !176)
!175 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line844")
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!115, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcInData", file: !175, line: 77, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcInData", file: !175, line: 51, size: 512, align: 64, elements: !182)
!182 = !{!183, !186, !187, !191, !192, !193, !194, !195}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !175, line: 53, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !181, file: !175, line: 58, baseType: !184, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "argsSize", scope: !181, file: !175, line: 60, baseType: !188, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !189, line: 216, baseType: !190)
!189 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line844")
!190 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !181, file: !175, line: 65, baseType: !70, size: 64, align: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "resultLen", scope: !181, file: !175, line: 67, baseType: !188, size: 64, align: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "freeResult", scope: !181, file: !175, line: 72, baseType: !115, size: 32, align: 32, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "appCtx", scope: !181, file: !175, line: 74, baseType: !51, size: 64, align: 64, offset: 384)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !181, file: !175, line: 76, baseType: !51, size: 64, align: 64, offset: 448)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !85, file: !56, line: 140, baseType: !94, size: 64, align: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "conn", scope: !85, file: !56, line: 147, baseType: !54, size: 64, align: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "heartbeatSrc", scope: !85, file: !56, line: 148, baseType: !88, size: 64, align: 64, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !85, file: !56, line: 151, baseType: !200, size: 64, align: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "Message_Channel", file: !202, line: 65, baseType: !203)
!202 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/message.h", directory: "/home/lichi/Desktop/open-vm-tools/line844")
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Message_Channel", file: !202, line: 51, size: 320, align: 64, elements: !204)
!204 = !{!205, !210, !211, !212, !213, !216}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !203, file: !202, line: 53, baseType: !206, size: 16, align: 16)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !65, line: 175, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !208, line: 49, baseType: !209)
!208 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line844")
!209 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !203, file: !202, line: 57, baseType: !52, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "inAlloc", scope: !203, file: !202, line: 59, baseType: !188, size: 64, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "inPreallocated", scope: !203, file: !202, line: 60, baseType: !74, size: 8, align: 8, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "cookieHigh", scope: !203, file: !202, line: 63, baseType: !214, size: 32, align: 32, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !65, line: 173, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !208, line: 51, baseType: !149)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "cookieLow", scope: !203, file: !202, line: 64, baseType: !214, size: 32, align: 32, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !85, file: !56, line: 152, baseType: !149, size: 32, align: 32, offset: 448)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "maxDelay", scope: !85, file: !56, line: 153, baseType: !149, size: 32, align: 32, offset: 480)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "errorFunc", scope: !85, file: !56, line: 154, baseType: !220, size: 64, align: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcIn_ErrorFunc", file: !222, line: 34, baseType: !223)
!222 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/rpcin.h", directory: "/home/lichi/Desktop/open-vm-tools/line844")
!223 = !DISubroutineType(types: !224)
!224 = !{null, !51, !184}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "errorData", scope: !85, file: !56, line: 155, baseType: !51, size: 64, align: 64, offset: 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mustSend", scope: !85, file: !56, line: 162, baseType: !74, size: 8, align: 8, offset: 640)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "last_result", scope: !85, file: !56, line: 165, baseType: !70, size: 64, align: 64, offset: 704)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "last_resultLen", scope: !85, file: !56, line: 168, baseType: !188, size: 64, align: 64, offset: 768)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "inLoop", scope: !85, file: !56, line: 179, baseType: !74, size: 8, align: 8, offset: 832)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "shouldStop", scope: !85, file: !56, line: 180, baseType: !74, size: 8, align: 8, offset: 840)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcIn", file: !222, line: 36, baseType: !85)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!235 = !{!236, !241, !242, !248, !255}
!236 = distinct !DIGlobalVariable(name: "first", scope: !237, file: !56, line: 1692, type: !74, isLocal: true, isDefinition: true, variable: i8* @RpcInOpenChannel.first)
!237 = distinct !DISubprogram(name: "RpcInOpenChannel", scope: !56, file: !56, line: 1688, type: !238, isLocal: true, isDefinition: true, scopeLine: 1690, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !240)
!238 = !DISubroutineType(types: !239)
!239 = !{!74, !232, !74}
!240 = !{}
!241 = distinct !DIGlobalVariable(name: "initOk", scope: !237, file: !56, line: 1693, type: !74, isLocal: true, isDefinition: true, variable: i8* @RpcInOpenChannel.initOk)
!242 = distinct !DIGlobalVariable(name: "lastPrintMilli", scope: !243, file: !56, line: 1580, type: !246, isLocal: true, isDefinition: true, variable: i64* @RpcInLoop.lastPrintMilli)
!243 = distinct !DISubprogram(name: "RpcInLoop", scope: !56, file: !56, line: 1516, type: !244, isLocal: true, isDefinition: true, scopeLine: 1517, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !240)
!244 = !DISubroutineType(types: !245)
!245 = !{!115, !51}
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !65, line: 171, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !208, line: 55, baseType: !190)
!248 = distinct !DIGlobalVariable(name: "truncationTag", scope: !249, file: !56, line: 1434, type: !252, isLocal: true, isDefinition: true, variable: [4 x i8]* @ByteDump.truncationTag)
!249 = distinct !DISubprogram(name: "ByteDump", scope: !56, file: !56, line: 1430, type: !250, isLocal: true, isDefinition: true, scopeLine: 1432, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !240)
!250 = !DISubroutineType(types: !251)
!251 = !{!70, !184, !188}
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 32, align: 8, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 4)
!255 = distinct !DIGlobalVariable(name: "dumpBuffer", scope: !249, file: !56, line: 1435, type: !256, isLocal: true, isDefinition: true, variable: [132 x i8]* @ByteDump.dumpBuffer)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 1056, align: 8, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 132)
!259 = !{i32 2, !"Dwarf Version", i32 4}
!260 = !{i32 2, !"Debug Info Version", i32 3}
!261 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!262 = distinct !DISubprogram(name: "RpcIn_Construct", scope: !56, file: !56, line: 417, type: !263, isLocal: false, isDefinition: true, scopeLine: 420, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !240)
!263 = !DISubroutineType(types: !264)
!264 = !{!232, !151, !174, !94}
!265 = !DILocalVariable(name: "mainCtx", arg: 1, scope: !262, file: !56, line: 417, type: !151)
!266 = !DIExpression()
!267 = !DILocation(line: 417, column: 31, scope: !262)
!268 = !DILocalVariable(name: "dispatch", arg: 2, scope: !262, file: !56, line: 418, type: !174)
!269 = !DILocation(line: 418, column: 32, scope: !262)
!270 = !DILocalVariable(name: "clientData", arg: 3, scope: !262, file: !56, line: 419, type: !94)
!271 = !DILocation(line: 419, column: 26, scope: !262)
!272 = !DILocalVariable(name: "result", scope: !262, file: !56, line: 421, type: !232)
!273 = !DILocation(line: 421, column: 11, scope: !262)
!274 = !DILocation(line: 424, column: 4, scope: !262)
!275 = !DILocation(line: 430, column: 13, scope: !262)
!276 = !DILocation(line: 430, column: 11, scope: !262)
!277 = !DILocation(line: 431, column: 8, scope: !278)
!278 = distinct !DILexicalBlock(scope: !262, file: !56, line: 431, column: 8)
!279 = !DILocation(line: 431, column: 15, scope: !278)
!280 = !DILocation(line: 431, column: 8, scope: !262)
!281 = !DILocation(line: 432, column: 25, scope: !282)
!282 = distinct !DILexicalBlock(scope: !278, file: !56, line: 431, column: 23)
!283 = !DILocation(line: 432, column: 7, scope: !282)
!284 = !DILocation(line: 432, column: 15, scope: !282)
!285 = !DILocation(line: 432, column: 23, scope: !282)
!286 = !DILocation(line: 433, column: 28, scope: !282)
!287 = !DILocation(line: 433, column: 7, scope: !282)
!288 = !DILocation(line: 433, column: 15, scope: !282)
!289 = !DILocation(line: 433, column: 26, scope: !282)
!290 = !DILocation(line: 434, column: 26, scope: !282)
!291 = !DILocation(line: 434, column: 7, scope: !282)
!292 = !DILocation(line: 434, column: 15, scope: !282)
!293 = !DILocation(line: 434, column: 24, scope: !282)
!294 = !DILocation(line: 435, column: 4, scope: !282)
!295 = !DILocation(line: 436, column: 11, scope: !262)
!296 = !DILocation(line: 436, column: 4, scope: !262)
!297 = distinct !DISubprogram(name: "RpcIn_Destruct", scope: !56, file: !56, line: 460, type: !298, isLocal: false, isDefinition: true, scopeLine: 461, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !240)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !232}
!300 = !DILocalVariable(name: "in", arg: 1, scope: !297, file: !56, line: 460, type: !232)
!301 = !DILocation(line: 460, column: 23, scope: !297)
!302 = !DILocation(line: 484, column: 9, scope: !297)
!303 = !DILocation(line: 484, column: 4, scope: !297)
!304 = !DILocation(line: 485, column: 1, scope: !297)
!305 = distinct !DISubprogram(name: "RpcIn_stop", scope: !56, file: !56, line: 1270, type: !298, isLocal: false, isDefinition: true, scopeLine: 1271, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !240)
!306 = !DILocalVariable(name: "in", arg: 1, scope: !305, file: !56, line: 1270, type: !232)
!307 = !DILocation(line: 1270, column: 19, scope: !305)
!308 = !DILocation(line: 1272, column: 8, scope: !309)
!309 = distinct !DILexicalBlock(scope: !305, file: !56, line: 1272, column: 8)
!310 = !DILocation(line: 1272, column: 12, scope: !309)
!311 = !DILocation(line: 1272, column: 8, scope: !305)
!312 = !DILocation(line: 1273, column: 7, scope: !313)
!313 = distinct !DILexicalBlock(scope: !309, file: !56, line: 1272, column: 20)
!314 = !DILocation(line: 1273, column: 11, scope: !313)
!315 = !DILocation(line: 1273, column: 22, scope: !313)
!316 = !DILocation(line: 1274, column: 4, scope: !313)
!317 = !DILocation(line: 1275, column: 17, scope: !318)
!318 = distinct !DILexicalBlock(scope: !309, file: !56, line: 1274, column: 11)
!319 = !DILocation(line: 1275, column: 7, scope: !318)
!320 = !DILocation(line: 1277, column: 1, scope: !305)
!321 = distinct !DISubprogram(name: "RpcInStop", scope: !56, file: !56, line: 1202, type: !298, isLocal: true, isDefinition: true, scopeLine: 1203, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !240)
!322 = !DILocalVariable(name: "in", arg: 1, scope: !321, file: !56, line: 1202, type: !232)
!323 = !DILocation(line: 1202, column: 18, scope: !321)
!324 = !DILocation(line: 1205, column: 8, scope: !325)
!325 = distinct !DILexicalBlock(scope: !321, file: !56, line: 1205, column: 8)
!326 = !DILocation(line: 1205, column: 12, scope: !325)
!327 = !DILocation(line: 1205, column: 8, scope: !321)
!328 = !DILocation(line: 1208, column: 12, scope: !329)
!329 = distinct !DILexicalBlock(scope: !330, file: !56, line: 1208, column: 11)
!330 = distinct !DILexicalBlock(scope: !325, file: !56, line: 1205, column: 23)
!331 = !DILocation(line: 1208, column: 16, scope: !329)
!332 = !DILocation(line: 1208, column: 11, scope: !330)
!333 = !DILocation(line: 1209, column: 27, scope: !334)
!334 = distinct !DILexicalBlock(scope: !329, file: !56, line: 1208, column: 24)
!335 = !DILocation(line: 1209, column: 31, scope: !334)
!336 = !DILocation(line: 1209, column: 10, scope: !334)
!337 = !DILocation(line: 1210, column: 7, scope: !334)
!338 = !DILocation(line: 1212, column: 22, scope: !330)
!339 = !DILocation(line: 1212, column: 26, scope: !330)
!340 = !DILocation(line: 1212, column: 7, scope: !330)
!341 = !DILocation(line: 1216, column: 7, scope: !330)
!342 = !DILocation(line: 1216, column: 11, scope: !330)
!343 = !DILocation(line: 1216, column: 21, scope: !330)
!344 = !DILocation(line: 1217, column: 4, scope: !330)
!345 = !DILocation(line: 1219, column: 8, scope: !346)
!346 = distinct !DILexicalBlock(scope: !321, file: !56, line: 1219, column: 8)
!347 = !DILocation(line: 1219, column: 12, scope: !346)
!348 = !DILocation(line: 1219, column: 8, scope: !321)
!349 = !DILocation(line: 1221, column: 11, scope: !350)
!350 = distinct !DILexicalBlock(scope: !351, file: !56, line: 1221, column: 11)
!351 = distinct !DILexicalBlock(scope: !346, file: !56, line: 1219, column: 21)
!352 = !DILocation(line: 1221, column: 15, scope: !350)
!353 = !DILocation(line: 1221, column: 11, scope: !351)
!354 = !DILocation(line: 1223, column: 20, scope: !355)
!355 = distinct !DILexicalBlock(scope: !350, file: !56, line: 1221, column: 25)
!356 = !DILocation(line: 1223, column: 10, scope: !355)
!357 = !DILocation(line: 1225, column: 7, scope: !355)
!358 = !DILocation(line: 1228, column: 25, scope: !359)
!359 = distinct !DILexicalBlock(scope: !351, file: !56, line: 1228, column: 11)
!360 = !DILocation(line: 1228, column: 29, scope: !359)
!361 = !DILocation(line: 1228, column: 11, scope: !359)
!362 = !DILocation(line: 1228, column: 38, scope: !359)
!363 = !DILocation(line: 1228, column: 11, scope: !351)
!364 = !DILocation(line: 1229, column: 10, scope: !365)
!365 = distinct !DILexicalBlock(scope: !359, file: !56, line: 1228, column: 44)
!366 = !DILocation(line: 1230, column: 7, scope: !365)
!367 = !DILocation(line: 1232, column: 7, scope: !351)
!368 = !DILocation(line: 1232, column: 11, scope: !351)
!369 = !DILocation(line: 1232, column: 19, scope: !351)
!370 = !DILocation(line: 1233, column: 4, scope: !351)
!371 = !DILocation(line: 1236, column: 8, scope: !372)
!372 = distinct !DILexicalBlock(scope: !321, file: !56, line: 1236, column: 8)
!373 = !DILocation(line: 1236, column: 12, scope: !372)
!374 = !DILocation(line: 1236, column: 17, scope: !372)
!375 = !DILocation(line: 1236, column: 8, scope: !321)
!376 = !DILocation(line: 1237, column: 11, scope: !377)
!377 = distinct !DILexicalBlock(scope: !378, file: !56, line: 1237, column: 11)
!378 = distinct !DILexicalBlock(scope: !372, file: !56, line: 1236, column: 25)
!379 = !DILocation(line: 1237, column: 15, scope: !377)
!380 = !DILocation(line: 1237, column: 11, scope: !378)
!381 = !DILocation(line: 1239, column: 20, scope: !382)
!382 = distinct !DILexicalBlock(scope: !377, file: !56, line: 1237, column: 25)
!383 = !DILocation(line: 1239, column: 10, scope: !382)
!384 = !DILocation(line: 1240, column: 7, scope: !382)
!385 = !DILocation(line: 1241, column: 22, scope: !378)
!386 = !DILocation(line: 1241, column: 26, scope: !378)
!387 = !DILocation(line: 1241, column: 7, scope: !378)
!388 = !DILocation(line: 1242, column: 4, scope: !378)
!389 = !DILocation(line: 1244, column: 8, scope: !390)
!390 = distinct !DILexicalBlock(scope: !321, file: !56, line: 1244, column: 8)
!391 = !DILocation(line: 1244, column: 12, scope: !390)
!392 = !DILocation(line: 1244, column: 25, scope: !390)
!393 = !DILocation(line: 1244, column: 8, scope: !321)
!394 = !DILocation(line: 1245, column: 24, scope: !395)
!395 = distinct !DILexicalBlock(scope: !390, file: !56, line: 1244, column: 33)
!396 = !DILocation(line: 1245, column: 28, scope: !395)
!397 = !DILocation(line: 1245, column: 7, scope: !395)
!398 = !DILocation(line: 1246, column: 22, scope: !395)
!399 = !DILocation(line: 1246, column: 26, scope: !395)
!400 = !DILocation(line: 1246, column: 7, scope: !395)
!401 = !DILocation(line: 1247, column: 7, scope: !395)
!402 = !DILocation(line: 1247, column: 11, scope: !395)
!403 = !DILocation(line: 1247, column: 24, scope: !395)
!404 = !DILocation(line: 1248, column: 4, scope: !395)
!405 = !DILocation(line: 1250, column: 1, scope: !321)
!406 = distinct !DISubprogram(name: "RpcIn_start", scope: !56, file: !56, line: 1795, type: !407, isLocal: false, isDefinition: true, scopeLine: 1808, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !240)
!407 = !DISubroutineType(types: !408)
!408 = !{!74, !232, !149, !220, !51}
!409 = !DILocalVariable(name: "in", arg: 1, scope: !406, file: !56, line: 1795, type: !232)
!410 = !DILocation(line: 1795, column: 20, scope: !406)
!411 = !DILocalVariable(name: "delay", arg: 2, scope: !406, file: !56, line: 1796, type: !149)
!412 = !DILocation(line: 1796, column: 26, scope: !406)
!413 = !DILocalVariable(name: "errorFunc", arg: 3, scope: !406, file: !56, line: 1797, type: !220)
!414 = !DILocation(line: 1797, column: 30, scope: !406)
!415 = !DILocalVariable(name: "errorData", arg: 4, scope: !406, file: !56, line: 1798, type: !51)
!416 = !DILocation(line: 1798, column: 19, scope: !406)
!417 = !DILocation(line: 1811, column: 4, scope: !406)
!418 = !DILocation(line: 1811, column: 8, scope: !406)
!419 = !DILocation(line: 1811, column: 14, scope: !406)
!420 = !DILocation(line: 1812, column: 19, scope: !406)
!421 = !DILocation(line: 1812, column: 4, scope: !406)
!422 = !DILocation(line: 1812, column: 8, scope: !406)
!423 = !DILocation(line: 1812, column: 17, scope: !406)
!424 = !DILocation(line: 1813, column: 20, scope: !406)
!425 = !DILocation(line: 1813, column: 4, scope: !406)
!426 = !DILocation(line: 1813, column: 8, scope: !406)
!427 = !DILocation(line: 1813, column: 18, scope: !406)
!428 = !DILocation(line: 1814, column: 20, scope: !406)
!429 = !DILocation(line: 1814, column: 4, scope: !406)
!430 = !DILocation(line: 1814, column: 8, scope: !406)
!431 = !DILocation(line: 1814, column: 18, scope: !406)
!432 = !DILocation(line: 1831, column: 28, scope: !406)
!433 = !DILocation(line: 1831, column: 11, scope: !406)
!434 = !DILocation(line: 1831, column: 4, scope: !406)
!435 = !DILocalVariable(name: "in", arg: 1, scope: !237, file: !56, line: 1688, type: !232)
!436 = !DILocation(line: 1688, column: 25, scope: !237)
!437 = !DILocalVariable(name: "useBackdoorOnly", arg: 2, scope: !237, file: !56, line: 1689, type: !74)
!438 = !DILocation(line: 1689, column: 23, scope: !237)
!439 = !DILocalVariable(name: "asock", scope: !237, file: !56, line: 1694, type: !60)
!440 = !DILocation(line: 1694, column: 17, scope: !237)
!441 = !DILocalVariable(name: "res", scope: !237, file: !56, line: 1695, type: !68)
!442 = !DILocation(line: 1695, column: 8, scope: !237)
!443 = !DILocation(line: 1699, column: 4, scope: !237)
!444 = !DILocation(line: 1700, column: 11, scope: !445)
!445 = distinct !DILexicalBlock(scope: !446, file: !56, line: 1700, column: 11)
!446 = distinct !DILexicalBlock(scope: !237, file: !56, line: 1699, column: 14)
!447 = !DILocation(line: 1700, column: 11, scope: !446)
!448 = !DILocation(line: 1701, column: 10, scope: !449)
!449 = distinct !DILexicalBlock(scope: !445, file: !56, line: 1700, column: 28)
!450 = !DILocation(line: 1704, column: 11, scope: !451)
!451 = distinct !DILexicalBlock(scope: !446, file: !56, line: 1704, column: 11)
!452 = !DILocation(line: 1704, column: 11, scope: !446)
!453 = !DILocation(line: 1705, column: 16, scope: !454)
!454 = distinct !DILexicalBlock(scope: !451, file: !56, line: 1704, column: 18)
!455 = !DILocation(line: 1706, column: 16, scope: !454)
!456 = !DILocation(line: 1706, column: 14, scope: !454)
!457 = !DILocation(line: 1707, column: 20, scope: !454)
!458 = !DILocation(line: 1707, column: 24, scope: !454)
!459 = !DILocation(line: 1707, column: 19, scope: !454)
!460 = !DILocation(line: 1707, column: 17, scope: !454)
!461 = !DILocation(line: 1708, column: 15, scope: !462)
!462 = distinct !DILexicalBlock(scope: !454, file: !56, line: 1708, column: 14)
!463 = !DILocation(line: 1708, column: 14, scope: !454)
!464 = !DILocation(line: 1710, column: 42, scope: !465)
!465 = distinct !DILexicalBlock(scope: !462, file: !56, line: 1708, column: 23)
!466 = !DILocation(line: 1710, column: 19, scope: !465)
!467 = !DILocation(line: 1709, column: 13, scope: !465)
!468 = !DILocation(line: 1711, column: 13, scope: !465)
!469 = !DILocation(line: 1713, column: 7, scope: !454)
!470 = !DILocation(line: 1715, column: 12, scope: !471)
!471 = distinct !DILexicalBlock(scope: !446, file: !56, line: 1715, column: 11)
!472 = !DILocation(line: 1715, column: 11, scope: !446)
!473 = !DILocation(line: 1716, column: 10, scope: !474)
!474 = distinct !DILexicalBlock(scope: !471, file: !56, line: 1715, column: 20)
!475 = !DILocation(line: 1719, column: 18, scope: !446)
!476 = !DILocation(line: 1719, column: 7, scope: !446)
!477 = !DILocation(line: 1719, column: 11, scope: !446)
!478 = !DILocation(line: 1719, column: 16, scope: !446)
!479 = !DILocation(line: 1720, column: 11, scope: !480)
!480 = distinct !DILexicalBlock(scope: !446, file: !56, line: 1720, column: 11)
!481 = !DILocation(line: 1720, column: 15, scope: !480)
!482 = !DILocation(line: 1720, column: 20, scope: !480)
!483 = !DILocation(line: 1720, column: 11, scope: !446)
!484 = !DILocation(line: 1721, column: 10, scope: !485)
!485 = distinct !DILexicalBlock(scope: !480, file: !56, line: 1720, column: 28)
!486 = !DILocation(line: 1722, column: 10, scope: !485)
!487 = !DILocation(line: 1724, column: 22, scope: !446)
!488 = !DILocation(line: 1724, column: 7, scope: !446)
!489 = !DILocation(line: 1724, column: 11, scope: !446)
!490 = !DILocation(line: 1724, column: 17, scope: !446)
!491 = !DILocation(line: 1724, column: 20, scope: !446)
!492 = !DILocation(line: 1728, column: 39, scope: !446)
!493 = !DILocation(line: 1728, column: 43, scope: !446)
!494 = !DILocation(line: 1725, column: 15, scope: !446)
!495 = !DILocation(line: 1725, column: 13, scope: !446)
!496 = !DILocation(line: 1729, column: 11, scope: !497)
!497 = distinct !DILexicalBlock(scope: !446, file: !56, line: 1729, column: 11)
!498 = !DILocation(line: 1729, column: 17, scope: !497)
!499 = !DILocation(line: 1729, column: 11, scope: !446)
!500 = !DILocation(line: 1731, column: 39, scope: !501)
!501 = distinct !DILexicalBlock(scope: !497, file: !56, line: 1729, column: 25)
!502 = !DILocation(line: 1731, column: 16, scope: !501)
!503 = !DILocation(line: 1730, column: 10, scope: !501)
!504 = !DILocation(line: 1732, column: 7, scope: !501)
!505 = !DILocation(line: 1733, column: 39, scope: !506)
!506 = distinct !DILexicalBlock(scope: !497, file: !56, line: 1732, column: 14)
!507 = !DILocation(line: 1733, column: 69, scope: !506)
!508 = !DILocation(line: 1733, column: 73, scope: !506)
!509 = !DILocation(line: 1733, column: 16, scope: !506)
!510 = !DILocation(line: 1733, column: 14, scope: !506)
!511 = !DILocation(line: 1734, column: 14, scope: !512)
!512 = distinct !DILexicalBlock(scope: !506, file: !56, line: 1734, column: 14)
!513 = !DILocation(line: 1734, column: 18, scope: !512)
!514 = !DILocation(line: 1734, column: 14, scope: !506)
!515 = !DILocation(line: 1736, column: 37, scope: !516)
!516 = distinct !DILexicalBlock(scope: !512, file: !56, line: 1734, column: 24)
!517 = !DILocation(line: 1736, column: 19, scope: !516)
!518 = !DILocation(line: 1735, column: 13, scope: !516)
!519 = !DILocation(line: 1737, column: 31, scope: !516)
!520 = !DILocation(line: 1737, column: 13, scope: !516)
!521 = !DILocation(line: 1738, column: 10, scope: !516)
!522 = !DILocation(line: 1740, column: 37, scope: !523)
!523 = distinct !DILexicalBlock(scope: !512, file: !56, line: 1738, column: 17)
!524 = !DILocation(line: 1740, column: 19, scope: !523)
!525 = !DILocation(line: 1739, column: 13, scope: !523)
!526 = !DILocation(line: 1741, column: 31, scope: !523)
!527 = !DILocation(line: 1741, column: 13, scope: !523)
!528 = !DILocation(line: 1741, column: 17, scope: !523)
!529 = !DILocation(line: 1741, column: 23, scope: !523)
!530 = !DILocation(line: 1741, column: 29, scope: !523)
!531 = !DILocation(line: 1742, column: 13, scope: !523)
!532 = !DILocation(line: 1745, column: 7, scope: !446)
!533 = !DILocation(line: 1748, column: 8, scope: !534)
!534 = distinct !DILexicalBlock(scope: !237, file: !56, line: 1748, column: 8)
!535 = !DILocation(line: 1748, column: 12, scope: !534)
!536 = !DILocation(line: 1748, column: 17, scope: !534)
!537 = !DILocation(line: 1748, column: 8, scope: !237)
!538 = !DILocation(line: 1749, column: 12, scope: !539)
!539 = distinct !DILexicalBlock(scope: !534, file: !56, line: 1748, column: 25)
!540 = !DILocation(line: 1749, column: 16, scope: !539)
!541 = !DILocation(line: 1749, column: 7, scope: !539)
!542 = !DILocation(line: 1750, column: 7, scope: !539)
!543 = !DILocation(line: 1750, column: 11, scope: !539)
!544 = !DILocation(line: 1750, column: 16, scope: !539)
!545 = !DILocation(line: 1751, column: 4, scope: !539)
!546 = !DILocation(line: 1756, column: 18, scope: !237)
!547 = !DILocation(line: 1756, column: 4, scope: !237)
!548 = !DILocation(line: 1756, column: 8, scope: !237)
!549 = !DILocation(line: 1756, column: 16, scope: !237)
!550 = !DILocation(line: 1757, column: 8, scope: !551)
!551 = distinct !DILexicalBlock(scope: !237, file: !56, line: 1757, column: 8)
!552 = !DILocation(line: 1757, column: 12, scope: !551)
!553 = !DILocation(line: 1757, column: 20, scope: !551)
!554 = !DILocation(line: 1757, column: 8, scope: !237)
!555 = !DILocation(line: 1758, column: 7, scope: !556)
!556 = distinct !DILexicalBlock(scope: !551, file: !56, line: 1757, column: 28)
!557 = !DILocation(line: 1759, column: 1, scope: !556)
!558 = !DILocation(line: 1760, column: 7, scope: !556)
!559 = !DILocation(line: 1763, column: 32, scope: !560)
!560 = distinct !DILexicalBlock(scope: !237, file: !56, line: 1763, column: 8)
!561 = !DILocation(line: 1763, column: 9, scope: !560)
!562 = !DILocation(line: 1763, column: 8, scope: !237)
!563 = !DILocation(line: 1764, column: 7, scope: !564)
!564 = distinct !DILexicalBlock(scope: !560, file: !56, line: 1763, column: 37)
!565 = !DILocation(line: 1765, column: 1, scope: !564)
!566 = !DILocation(line: 1766, column: 7, scope: !564)
!567 = !DILocation(line: 1769, column: 4, scope: !237)
!568 = !DILocation(line: 1769, column: 8, scope: !237)
!569 = !DILocation(line: 1769, column: 17, scope: !237)
!570 = !DILocation(line: 1770, column: 4, scope: !237)
!571 = !DILocation(line: 1773, column: 14, scope: !237)
!572 = !DILocation(line: 1773, column: 4, scope: !237)
!573 = !DILocation(line: 1774, column: 4, scope: !237)
!574 = !DILocation(line: 1775, column: 1, scope: !237)
!575 = distinct !DISubprogram(name: "RpcInSend", scope: !56, file: !56, line: 1146, type: !576, isLocal: true, isDefinition: true, scopeLine: 1148, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !240)
!576 = !DISubroutineType(types: !577)
!577 = !{!74, !232, !68}
!578 = !DILocalVariable(name: "in", arg: 1, scope: !575, file: !56, line: 1146, type: !232)
!579 = !DILocation(line: 1146, column: 18, scope: !575)
!580 = !DILocalVariable(name: "flags", arg: 2, scope: !575, file: !56, line: 1147, type: !68)
!581 = !DILocation(line: 1147, column: 15, scope: !575)
!582 = !DILocalVariable(name: "status", scope: !575, file: !56, line: 1149, type: !74)
!583 = !DILocation(line: 1149, column: 9, scope: !575)
!584 = !DILocalVariable(name: "useBackdoor", scope: !575, file: !56, line: 1150, type: !74)
!585 = !DILocation(line: 1150, column: 9, scope: !575)
!586 = !DILocation(line: 1156, column: 8, scope: !587)
!587 = distinct !DILexicalBlock(scope: !575, file: !56, line: 1156, column: 8)
!588 = !DILocation(line: 1156, column: 12, scope: !587)
!589 = !DILocation(line: 1156, column: 17, scope: !587)
!590 = !DILocation(line: 1156, column: 8, scope: !575)
!591 = !DILocation(line: 1157, column: 19, scope: !592)
!592 = distinct !DILexicalBlock(scope: !587, file: !56, line: 1156, column: 25)
!593 = !DILocation(line: 1158, column: 30, scope: !592)
!594 = !DILocation(line: 1158, column: 34, scope: !592)
!595 = !DILocation(line: 1158, column: 40, scope: !592)
!596 = !DILocation(line: 1158, column: 44, scope: !592)
!597 = !DILocation(line: 1158, column: 57, scope: !592)
!598 = !DILocation(line: 1158, column: 61, scope: !592)
!599 = !DILocation(line: 1159, column: 30, scope: !592)
!600 = !DILocation(line: 1158, column: 16, scope: !592)
!601 = !DILocation(line: 1158, column: 14, scope: !592)
!602 = !DILocation(line: 1160, column: 4, scope: !592)
!603 = !DILocation(line: 1163, column: 8, scope: !604)
!604 = distinct !DILexicalBlock(scope: !575, file: !56, line: 1163, column: 8)
!605 = !DILocation(line: 1163, column: 8, scope: !575)
!606 = !DILocation(line: 1165, column: 11, scope: !607)
!607 = distinct !DILexicalBlock(scope: !608, file: !56, line: 1165, column: 11)
!608 = distinct !DILexicalBlock(scope: !604, file: !56, line: 1163, column: 21)
!609 = !DILocation(line: 1165, column: 15, scope: !607)
!610 = !DILocation(line: 1165, column: 11, scope: !608)
!611 = !DILocation(line: 1166, column: 50, scope: !612)
!612 = distinct !DILexicalBlock(scope: !607, file: !56, line: 1165, column: 31)
!613 = !DILocation(line: 1166, column: 54, scope: !612)
!614 = !DILocation(line: 1166, column: 10, scope: !612)
!615 = !DILocation(line: 1167, column: 7, scope: !612)
!616 = !DILocation(line: 1168, column: 29, scope: !608)
!617 = !DILocation(line: 1168, column: 33, scope: !608)
!618 = !DILocation(line: 1168, column: 59, scope: !608)
!619 = !DILocation(line: 1168, column: 63, scope: !608)
!620 = !DILocation(line: 1169, column: 29, scope: !608)
!621 = !DILocation(line: 1169, column: 33, scope: !608)
!622 = !DILocation(line: 1168, column: 16, scope: !608)
!623 = !DILocation(line: 1168, column: 14, scope: !608)
!624 = !DILocation(line: 1170, column: 4, scope: !608)
!625 = !DILocation(line: 1172, column: 8, scope: !626)
!626 = distinct !DILexicalBlock(scope: !575, file: !56, line: 1172, column: 8)
!627 = !DILocation(line: 1172, column: 15, scope: !626)
!628 = !DILocation(line: 1172, column: 8, scope: !575)
!629 = !DILocation(line: 1173, column: 7, scope: !630)
!630 = distinct !DILexicalBlock(scope: !626, file: !56, line: 1172, column: 21)
!631 = !DILocation(line: 1174, column: 4, scope: !630)
!632 = !DILocation(line: 1176, column: 9, scope: !575)
!633 = !DILocation(line: 1176, column: 13, scope: !575)
!634 = !DILocation(line: 1176, column: 4, scope: !575)
!635 = !DILocation(line: 1177, column: 4, scope: !575)
!636 = !DILocation(line: 1177, column: 8, scope: !575)
!637 = !DILocation(line: 1177, column: 20, scope: !575)
!638 = !DILocation(line: 1178, column: 4, scope: !575)
!639 = !DILocation(line: 1178, column: 8, scope: !575)
!640 = !DILocation(line: 1178, column: 23, scope: !575)
!641 = !DILocation(line: 1179, column: 4, scope: !575)
!642 = !DILocation(line: 1179, column: 8, scope: !575)
!643 = !DILocation(line: 1179, column: 17, scope: !575)
!644 = !DILocation(line: 1181, column: 11, scope: !575)
!645 = !DILocation(line: 1181, column: 4, scope: !575)
!646 = distinct !DISubprogram(name: "RpcInCloseConn", scope: !56, file: !56, line: 538, type: !647, isLocal: true, isDefinition: true, scopeLine: 539, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !240)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !54}
!649 = !DILocalVariable(name: "conn", arg: 1, scope: !646, file: !56, line: 538, type: !54)
!650 = !DILocation(line: 538, column: 26, scope: !646)
!651 = !DILocalVariable(name: "fd", scope: !646, file: !56, line: 540, type: !68)
!652 = !DILocation(line: 540, column: 8, scope: !646)
!653 = !DILocation(line: 540, column: 31, scope: !646)
!654 = !DILocation(line: 540, column: 37, scope: !646)
!655 = !DILocation(line: 540, column: 13, scope: !646)
!656 = !DILocation(line: 542, column: 8, scope: !657)
!657 = distinct !DILexicalBlock(scope: !646, file: !56, line: 542, column: 8)
!658 = !DILocation(line: 542, column: 14, scope: !657)
!659 = !DILocation(line: 542, column: 17, scope: !657)
!660 = !DILocation(line: 542, column: 8, scope: !646)
!661 = !DILocation(line: 543, column: 7, scope: !662)
!662 = distinct !DILexicalBlock(scope: !657, file: !56, line: 542, column: 25)
!663 = !DILocation(line: 543, column: 13, scope: !662)
!664 = !DILocation(line: 543, column: 17, scope: !662)
!665 = !DILocation(line: 543, column: 22, scope: !662)
!666 = !DILocation(line: 544, column: 7, scope: !662)
!667 = !DILocation(line: 544, column: 13, scope: !662)
!668 = !DILocation(line: 544, column: 16, scope: !662)
!669 = !DILocation(line: 545, column: 4, scope: !662)
!670 = !DILocation(line: 547, column: 8, scope: !671)
!671 = distinct !DILexicalBlock(scope: !646, file: !56, line: 547, column: 8)
!672 = !DILocation(line: 547, column: 14, scope: !671)
!673 = !DILocation(line: 547, column: 27, scope: !671)
!674 = !DILocation(line: 547, column: 8, scope: !646)
!675 = !DILocation(line: 548, column: 62, scope: !676)
!676 = distinct !DILexicalBlock(scope: !671, file: !56, line: 547, column: 32)
!677 = !DILocation(line: 548, column: 7, scope: !676)
!678 = !DILocation(line: 549, column: 7, scope: !676)
!679 = !DILocation(line: 549, column: 13, scope: !676)
!680 = !DILocation(line: 549, column: 22, scope: !676)
!681 = !DILocation(line: 550, column: 25, scope: !676)
!682 = !DILocation(line: 550, column: 7, scope: !676)
!683 = !DILocation(line: 551, column: 4, scope: !676)
!684 = !DILocation(line: 552, column: 55, scope: !685)
!685 = distinct !DILexicalBlock(scope: !671, file: !56, line: 551, column: 11)
!686 = !DILocation(line: 552, column: 7, scope: !685)
!687 = !DILocation(line: 553, column: 25, scope: !685)
!688 = !DILocation(line: 553, column: 31, scope: !685)
!689 = !DILocation(line: 553, column: 7, scope: !685)
!690 = !DILocation(line: 554, column: 12, scope: !685)
!691 = !DILocation(line: 554, column: 18, scope: !685)
!692 = !DILocation(line: 554, column: 7, scope: !685)
!693 = !DILocation(line: 555, column: 12, scope: !685)
!694 = !DILocation(line: 555, column: 7, scope: !685)
!695 = !DILocation(line: 557, column: 1, scope: !646)
!696 = distinct !DISubprogram(name: "RpcInConnSend", scope: !56, file: !56, line: 695, type: !697, isLocal: true, isDefinition: true, scopeLine: 699, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !240)
!697 = !DISubroutineType(types: !698)
!698 = !{!74, !54, !184, !68, !68}
!699 = !DILocalVariable(name: "conn", arg: 1, scope: !696, file: !56, line: 695, type: !54)
!700 = !DILocation(line: 695, column: 25, scope: !696)
!701 = !DILocalVariable(name: "buf", arg: 2, scope: !696, file: !56, line: 696, type: !184)
!702 = !DILocation(line: 696, column: 27, scope: !696)
!703 = !DILocalVariable(name: "len", arg: 3, scope: !696, file: !56, line: 697, type: !68)
!704 = !DILocation(line: 697, column: 19, scope: !696)
!705 = !DILocalVariable(name: "flags", arg: 4, scope: !696, file: !56, line: 698, type: !68)
!706 = !DILocation(line: 698, column: 19, scope: !696)
!707 = !DILocalVariable(name: "res", scope: !696, file: !56, line: 700, type: !68)
!708 = !DILocation(line: 700, column: 8, scope: !696)
!709 = !DILocalVariable(name: "packetLen", scope: !696, file: !56, line: 701, type: !64)
!710 = !DILocation(line: 701, column: 10, scope: !696)
!711 = !DILocalVariable(name: "packetBuf", scope: !696, file: !56, line: 702, type: !70)
!712 = !DILocation(line: 702, column: 10, scope: !696)
!713 = !DILocalVariable(name: "fd", scope: !696, file: !56, line: 703, type: !68)
!714 = !DILocation(line: 703, column: 8, scope: !696)
!715 = !DILocation(line: 703, column: 31, scope: !696)
!716 = !DILocation(line: 703, column: 37, scope: !696)
!717 = !DILocation(line: 703, column: 13, scope: !696)
!718 = !DILocation(line: 706, column: 28, scope: !696)
!719 = !DILocation(line: 706, column: 34, scope: !696)
!720 = !DILocation(line: 706, column: 10, scope: !696)
!721 = !DILocation(line: 706, column: 42, scope: !696)
!722 = !DILocation(line: 705, column: 4, scope: !696)
!723 = !DILocation(line: 708, column: 27, scope: !724)
!724 = distinct !DILexicalBlock(scope: !696, file: !56, line: 708, column: 8)
!725 = !DILocation(line: 708, column: 31, scope: !724)
!726 = !DILocation(line: 708, column: 36, scope: !724)
!727 = !DILocation(line: 708, column: 41, scope: !724)
!728 = !DILocation(line: 708, column: 9, scope: !724)
!729 = !DILocation(line: 708, column: 8, scope: !696)
!730 = !DILocation(line: 709, column: 7, scope: !731)
!731 = distinct !DILexicalBlock(scope: !724, file: !56, line: 708, column: 73)
!732 = !DILocation(line: 712, column: 27, scope: !696)
!733 = !DILocation(line: 712, column: 33, scope: !696)
!734 = !DILocation(line: 712, column: 40, scope: !696)
!735 = !DILocation(line: 712, column: 51, scope: !696)
!736 = !DILocation(line: 713, column: 48, scope: !696)
!737 = !DILocation(line: 712, column: 10, scope: !696)
!738 = !DILocation(line: 712, column: 8, scope: !696)
!739 = !DILocation(line: 714, column: 8, scope: !740)
!740 = distinct !DILexicalBlock(scope: !696, file: !56, line: 714, column: 8)
!741 = !DILocation(line: 714, column: 12, scope: !740)
!742 = !DILocation(line: 714, column: 8, scope: !696)
!743 = !DILocation(line: 716, column: 31, scope: !744)
!744 = distinct !DILexicalBlock(scope: !740, file: !56, line: 714, column: 18)
!745 = !DILocation(line: 716, column: 37, scope: !744)
!746 = !DILocation(line: 716, column: 13, scope: !744)
!747 = !DILocation(line: 716, column: 68, scope: !744)
!748 = !DILocation(line: 716, column: 45, scope: !749)
!749 = !DILexicalBlockFile(scope: !744, file: !56, discriminator: 1)
!750 = !DILocation(line: 715, column: 7, scope: !744)
!751 = !DILocation(line: 717, column: 12, scope: !744)
!752 = !DILocation(line: 717, column: 7, scope: !744)
!753 = !DILocation(line: 718, column: 7, scope: !744)
!754 = !DILocation(line: 720, column: 29, scope: !755)
!755 = distinct !DILexicalBlock(scope: !740, file: !56, line: 719, column: 11)
!756 = !DILocation(line: 720, column: 7, scope: !755)
!757 = !DILocation(line: 720, column: 13, scope: !755)
!758 = !DILocation(line: 720, column: 26, scope: !755)
!759 = !DILocation(line: 721, column: 7, scope: !755)
!760 = !DILocation(line: 723, column: 1, scope: !696)
!761 = distinct !DISubprogram(name: "RpcInPackSendData", scope: !56, file: !56, line: 619, type: !762, isLocal: true, isDefinition: true, scopeLine: 625, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !240)
!762 = !DISubroutineType(types: !763)
!763 = !{!74, !68, !184, !68, !68, !764, !231}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!765 = !DILocalVariable(name: "fd", arg: 1, scope: !761, file: !56, line: 619, type: !68)
!766 = !DILocation(line: 619, column: 23, scope: !761)
!767 = !DILocalVariable(name: "buf", arg: 2, scope: !761, file: !56, line: 620, type: !184)
!768 = !DILocation(line: 620, column: 31, scope: !761)
!769 = !DILocalVariable(name: "len", arg: 3, scope: !761, file: !56, line: 621, type: !68)
!770 = !DILocation(line: 621, column: 23, scope: !761)
!771 = !DILocalVariable(name: "flags", arg: 4, scope: !761, file: !56, line: 622, type: !68)
!772 = !DILocation(line: 622, column: 23, scope: !761)
!773 = !DILocalVariable(name: "serBuf", arg: 5, scope: !761, file: !56, line: 623, type: !764)
!774 = !DILocation(line: 623, column: 26, scope: !761)
!775 = !DILocalVariable(name: "serBufLen", arg: 6, scope: !761, file: !56, line: 624, type: !231)
!776 = !DILocation(line: 624, column: 26, scope: !761)
!777 = !DILocalVariable(name: "map", scope: !761, file: !56, line: 626, type: !778)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataMap", file: !4, line: 77, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 74, size: 128, align: 64, elements: !780)
!780 = !{!781, !786}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !779, file: !4, line: 75, baseType: !782, size: 64, align: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashMap", file: !784, line: 45, baseType: !785)
!784 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hashMap.h", directory: "/home/lichi/Desktop/open-vm-tools/line844")
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", file: !784, line: 45, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !779, file: !4, line: 76, baseType: !246, size: 64, align: 64, offset: 64)
!787 = !DILocation(line: 626, column: 12, scope: !761)
!788 = !DILocalVariable(name: "res", scope: !761, file: !56, line: 627, type: !789)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorCode", file: !4, line: 60, baseType: !3)
!790 = !DILocation(line: 627, column: 14, scope: !761)
!791 = !DILocalVariable(name: "newBuf", scope: !761, file: !56, line: 628, type: !70)
!792 = !DILocation(line: 628, column: 10, scope: !761)
!793 = !DILocalVariable(name: "mapCreated", scope: !761, file: !56, line: 629, type: !115)
!794 = !DILocation(line: 629, column: 13, scope: !761)
!795 = !DILocalVariable(name: "pktType", scope: !761, file: !56, line: 630, type: !80)
!796 = !DILocation(line: 630, column: 10, scope: !761)
!797 = !DILocation(line: 630, column: 21, scope: !761)
!798 = !DILocation(line: 630, column: 27, scope: !761)
!799 = !DILocation(line: 630, column: 20, scope: !761)
!800 = !DILocation(line: 633, column: 10, scope: !761)
!801 = !DILocation(line: 633, column: 8, scope: !761)
!802 = !DILocation(line: 634, column: 8, scope: !803)
!803 = distinct !DILexicalBlock(scope: !761, file: !56, line: 634, column: 8)
!804 = !DILocation(line: 634, column: 12, scope: !803)
!805 = !DILocation(line: 634, column: 8, scope: !761)
!806 = !DILocation(line: 635, column: 7, scope: !807)
!807 = distinct !DILexicalBlock(scope: !803, file: !56, line: 634, column: 30)
!808 = !DILocation(line: 638, column: 15, scope: !761)
!809 = !DILocation(line: 640, column: 27, scope: !761)
!810 = !DILocation(line: 639, column: 10, scope: !761)
!811 = !DILocation(line: 639, column: 8, scope: !761)
!812 = !DILocation(line: 641, column: 8, scope: !813)
!813 = distinct !DILexicalBlock(scope: !761, file: !56, line: 641, column: 8)
!814 = !DILocation(line: 641, column: 12, scope: !813)
!815 = !DILocation(line: 641, column: 8, scope: !761)
!816 = !DILocation(line: 642, column: 7, scope: !817)
!817 = distinct !DILexicalBlock(scope: !813, file: !56, line: 641, column: 30)
!818 = !DILocation(line: 645, column: 8, scope: !819)
!819 = distinct !DILexicalBlock(scope: !761, file: !56, line: 645, column: 8)
!820 = !DILocation(line: 645, column: 12, scope: !819)
!821 = !DILocation(line: 645, column: 19, scope: !819)
!822 = !DILocation(line: 645, column: 22, scope: !823)
!823 = !DILexicalBlockFile(scope: !819, file: !56, discriminator: 1)
!824 = !DILocation(line: 645, column: 26, scope: !823)
!825 = !DILocation(line: 645, column: 8, scope: !823)
!826 = !DILocation(line: 646, column: 23, scope: !827)
!827 = distinct !DILexicalBlock(scope: !819, file: !56, line: 645, column: 31)
!828 = !DILocation(line: 646, column: 16, scope: !827)
!829 = !DILocation(line: 646, column: 14, scope: !827)
!830 = !DILocation(line: 647, column: 11, scope: !831)
!831 = distinct !DILexicalBlock(scope: !827, file: !56, line: 647, column: 11)
!832 = !DILocation(line: 647, column: 18, scope: !831)
!833 = !DILocation(line: 647, column: 11, scope: !827)
!834 = !DILocation(line: 648, column: 68, scope: !835)
!835 = distinct !DILexicalBlock(scope: !831, file: !56, line: 647, column: 26)
!836 = !DILocation(line: 648, column: 10, scope: !835)
!837 = !DILocation(line: 649, column: 10, scope: !835)
!838 = !DILocation(line: 651, column: 14, scope: !827)
!839 = !DILocation(line: 651, column: 22, scope: !827)
!840 = !DILocation(line: 651, column: 27, scope: !827)
!841 = !DILocation(line: 651, column: 7, scope: !827)
!842 = !DILocation(line: 652, column: 64, scope: !827)
!843 = !DILocation(line: 653, column: 31, scope: !827)
!844 = !DILocation(line: 652, column: 13, scope: !827)
!845 = !DILocation(line: 652, column: 11, scope: !827)
!846 = !DILocation(line: 654, column: 11, scope: !847)
!847 = distinct !DILexicalBlock(scope: !827, file: !56, line: 654, column: 11)
!848 = !DILocation(line: 654, column: 15, scope: !847)
!849 = !DILocation(line: 654, column: 11, scope: !827)
