; ModuleID = './[inter]lib--dpkg--triglib.o.i'
source_filename = "./[inter]lib--dpkg--triglib.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.anon.3 = type { %struct.trigfileint*, %struct.trigfileint* }
%struct.trigfileint = type { %struct.pkginfo*, %struct.pkgbin*, %struct.fsys_namenode*, i32, %struct.trigfileint*, %struct.anon.1 }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.2, i32 }
%struct.anon.2 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }
%struct.pkgbin = type { %struct.dependency*, i8, i32, %struct.dpkg_arch*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.dpkg_version, %struct.conffile*, %struct.arbitraryfield* }
%struct.conffile = type { %struct.conffile*, i8*, i8*, i8 }

!90 = !DIEnumerator(name: "FNNF_FILTERED", value: 512)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_name_arch_when", file: !4, line: 396, size: 32, align: 32, elements: !92)
!92 = !{!93, !94, !95, !96}
!93 = !DIEnumerator(name: "pnaw_never", value: 0)
!94 = !DIEnumerator(name: "pnaw_nonambig", value: 1)
!95 = !DIEnumerator(name: "pnaw_foreign", value: 2)
!96 = !DIEnumerator(name: "pnaw_always", value: 3)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "modstatdb_rw", file: !4, line: 263, size: 32, align: 32, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106}
!99 = !DIEnumerator(name: "msdbrw_readonly", value: 0)
!100 = !DIEnumerator(name: "msdbrw_needsuperuserlockonly", value: 1)
!101 = !DIEnumerator(name: "msdbrw_writeifposs", value: 2)
!102 = !DIEnumerator(name: "msdbrw_write", value: 3)
!103 = !DIEnumerator(name: "msdbrw_needsuperuser", value: 4)
!104 = !DIEnumerator(name: "msdbrw_available_readonly", value: 256)
!105 = !DIEnumerator(name: "msdbrw_available_write", value: 512)
!106 = !DIEnumerator(name: "msdbrw_available_mask", value: 65280)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_msg_type", file: !108, line: 36, size: 32, align: 32, elements: !109)
!108 = !DIFile(filename: "../../lib/dpkg/error.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!109 = !{!110, !111, !112}
!110 = !DIEnumerator(name: "DPKG_MSG_NONE", value: 0)
!111 = !DIEnumerator(name: "DPKG_MSG_WARN", value: 1)
!112 = !DIEnumerator(name: "DPKG_MSG_ERROR", value: 2)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !114, line: 41, size: 32, align: 32, elements: !115)
!114 = !DIFile(filename: "../../lib/dpkg/ehandle.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!115 = !{!116, !117, !118}
!116 = !DIEnumerator(name: "ehflag_normaltidy", value: 1)
!117 = !DIEnumerator(name: "ehflag_bombout", value: 2)
!118 = !DIEnumerator(name: "ehflag_recursiveerror", value: 4)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "trigdef_update_status", file: !120, line: 45, size: 32, align: 32, elements: !121)
!120 = !DIFile(filename: "../../lib/dpkg/trigdeferred.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!121 = !{!122, !123, !124, !125, !126}
!122 = !DIEnumerator(name: "TDUS_ERROR_NO_DIR", value: -1)
!123 = !DIEnumerator(name: "TDUS_ERROR_EMPTY_DEFERRED", value: -2)
!124 = !DIEnumerator(name: "TDUS_ERROR_NO_DEFERRED", value: -3)
!125 = !DIEnumerator(name: "TDUS_NO_DEFERRED", value: 1)
!126 = !DIEnumerator(name: "TDUS_OK", value: 2)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "trigdef_update_flags", file: !120, line: 36, size: 32, align: 32, elements: !128)
!128 = !{!129, !130, !131, !132, !133}
!129 = !DIEnumerator(name: "TDUF_NO_LOCK_OK", value: 1)
!130 = !DIEnumerator(name: "TDUF_WRITE", value: 2)
!131 = !DIEnumerator(name: "TDUF_NO_LOCK", value: 3)
!132 = !DIEnumerator(name: "TDUF_WRITE_IF_EMPTY", value: 8)
!133 = !DIEnumerator(name: "TDUF_WRITE_IF_ENOENT", value: 16)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "atomic_file_flags", file: !135, line: 36, size: 32, align: 32, elements: !136)
!135 = !DIFile(filename: "../../lib/dpkg/atomic-file.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!136 = !{!137}
!137 = !DIEnumerator(name: "ATOMIC_FILE_BACKUP", value: 1)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_ctype_bit", file: !139, line: 32, size: 32, align: 32, elements: !140)
!139 = !DIFile(filename: "../../lib/dpkg/c-ctype.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!140 = !{!141, !142, !143, !144, !145, !146, !147, !148}
!141 = !DIEnumerator(name: "C_CTYPE_BLANK", value: 1)
!142 = !DIEnumerator(name: "C_CTYPE_WHITE", value: 2)
!143 = !DIEnumerator(name: "C_CTYPE_SPACE", value: 4)
!144 = !DIEnumerator(name: "C_CTYPE_UPPER", value: 8)
!145 = !DIEnumerator(name: "C_CTYPE_LOWER", value: 16)
!146 = !DIEnumerator(name: "C_CTYPE_DIGIT", value: 32)
!147 = !DIEnumerator(name: "C_CTYPE_ALPHA", value: 24)
!148 = !DIEnumerator(name: "C_CTYPE_ALNUM", value: 56)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fsys_hash_find_flags", file: !79, line: 54, size: 32, align: 32, elements: !150)
!150 = !{!151, !152}
!151 = !DIEnumerator(name: "FHFF_NOCOPY", value: 1)
!152 = !DIEnumerator(name: "FHFF_NONE", value: 2)
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!155 = !{!156, !160, !161, !382, !387, !388, !389, !390, !391, !392, !401, !455, !456, !457, !467}
!156 = distinct !DIGlobalVariable(name: "triggersdir", scope: !0, file: !157, line: 46, type: !158, isLocal: true, isDefinition: true, variable: i8** @triggersdir)
!157 = !DIFile(filename: "triglib.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!160 = distinct !DIGlobalVariable(name: "triggersfilefile", scope: !0, file: !157, line: 46, type: !158, isLocal: true, isDefinition: true, variable: i8** @triggersfilefile)
!161 = distinct !DIGlobalVariable(name: "dtki", scope: !0, file: !157, line: 161, type: !162, isLocal: true, isDefinition: true, variable: %struct.trigkindinfo** @dtki)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigkindinfo", file: !157, line: 148, size: 256, align: 64, elements: !165)
!165 = !{!166, !170, !377, !378}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "activate_start", scope: !164, file: !157, line: 150, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{null}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "activate_awaiter", scope: !164, file: !157, line: 153, baseType: !171, size: 64, align: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !176)
!176 = !{!177, !228, !229, !230, !231, !232, !233, !234, !235, !236, !266, !267, !270, !279, !295, !296, !302, !371, !375, !376}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !175, file: !4, line: 196, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !180)
!180 = !{!181, !182, !185, !186, !226}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !4, line: 243, baseType: !178, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !179, file: !4, line: 244, baseType: !183, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !179, file: !4, line: 245, baseType: !175, size: 3072, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !179, file: !4, line: 249, baseType: !187, size: 128, align: 64, offset: 3200)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !179, file: !4, line: 246, size: 128, align: 64, elements: !188)
!188 = !{!189, !225}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !187, file: !4, line: 247, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !192)
!192 = !{!193, !201, !202, !203, !204, !205, !214, !221, !222, !224}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !191, file: !4, line: 64, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !196)
!196 = !{!197, !198, !199, !200}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !195, file: !4, line: 57, baseType: !174, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !195, file: !4, line: 58, baseType: !194, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !195, file: !4, line: 59, baseType: !190, size: 64, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !4, line: 60, baseType: !3, size: 32, align: 32, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !191, file: !4, line: 65, baseType: !178, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !4, line: 66, baseType: !190, size: 64, align: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !191, file: !4, line: 66, baseType: !190, size: 64, align: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !191, file: !4, line: 66, baseType: !190, size: 64, align: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !191, file: !4, line: 67, baseType: !206, size: 64, align: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !16, line: 48, size: 192, align: 64, elements: !209)
!209 = !{!210, !212, !213}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !16, line: 49, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !208, file: !16, line: 50, baseType: !183, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !208, file: !16, line: 51, baseType: !15, size: 32, align: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !191, file: !4, line: 68, baseType: !215, size: 192, align: 64, offset: 384)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !27, line: 42, size: 192, align: 64, elements: !216)
!216 = !{!217, !219, !220}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !215, file: !27, line: 44, baseType: !218, size: 32, align: 32)
!218 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !215, file: !27, line: 46, baseType: !183, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !215, file: !27, line: 48, baseType: !183, size: 64, align: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !191, file: !4, line: 69, baseType: !26, size: 32, align: 32, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !191, file: !4, line: 70, baseType: !223, size: 8, align: 8, offset: 608)
!223 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !191, file: !4, line: 71, baseType: !223, size: 8, align: 8, offset: 616)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !187, file: !4, line: 248, baseType: !190, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !179, file: !4, line: 250, baseType: !227, size: 32, align: 32, offset: 3328)
!227 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !175, file: !4, line: 197, baseType: !174, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !175, file: !4, line: 199, baseType: !35, size: 32, align: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !175, file: !4, line: 201, baseType: !43, size: 32, align: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !175, file: !4, line: 202, baseType: !47, size: 32, align: 32, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !175, file: !4, line: 203, baseType: !57, size: 32, align: 32, offset: 224)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !175, file: !4, line: 204, baseType: !183, size: 64, align: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !175, file: !4, line: 205, baseType: !183, size: 64, align: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !175, file: !4, line: 206, baseType: !215, size: 192, align: 64, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !175, file: !4, line: 207, baseType: !237, size: 960, align: 64, offset: 576)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !259}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !237, file: !4, line: 108, baseType: !194, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !237, file: !4, line: 110, baseType: !223, size: 8, align: 8, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !237, file: !4, line: 111, baseType: !67, size: 32, align: 32, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !237, file: !4, line: 112, baseType: !206, size: 64, align: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !237, file: !4, line: 115, baseType: !183, size: 64, align: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !237, file: !4, line: 116, baseType: !183, size: 64, align: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !237, file: !4, line: 117, baseType: !183, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !237, file: !4, line: 118, baseType: !183, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !237, file: !4, line: 119, baseType: !183, size: 64, align: 64, offset: 448)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !237, file: !4, line: 120, baseType: !183, size: 64, align: 64, offset: 512)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !237, file: !4, line: 121, baseType: !183, size: 64, align: 64, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !237, file: !4, line: 122, baseType: !215, size: 192, align: 64, offset: 640)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !237, file: !4, line: 123, baseType: !252, size: 64, align: 64, offset: 832)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !254)
!254 = !{!255, !256, !257, !258}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !253, file: !4, line: 81, baseType: !252, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !253, file: !4, line: 82, baseType: !183, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !253, file: !4, line: 83, baseType: !183, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !253, file: !4, line: 84, baseType: !223, size: 8, align: 8, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !237, file: !4, line: 124, baseType: !260, size: 64, align: 64, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !262)
!262 = !{!263, !264, !265}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !261, file: !4, line: 75, baseType: !260, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !261, file: !4, line: 76, baseType: !183, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !261, file: !4, line: 77, baseType: !183, size: 64, align: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !175, file: !4, line: 208, baseType: !237, size: 960, align: 64, offset: 1536)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !175, file: !4, line: 209, baseType: !268, size: 64, align: 64, offset: 2496)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !4, line: 151, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !175, file: !4, line: 211, baseType: !271, size: 64, align: 64, offset: 2560)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !273)
!273 = !{!274, !275, !276, !277, !278}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !4, line: 88, baseType: !271, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !272, file: !4, line: 89, baseType: !183, size: 64, align: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !272, file: !4, line: 90, baseType: !183, size: 64, align: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !272, file: !4, line: 91, baseType: !183, size: 64, align: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !272, file: !4, line: 92, baseType: !183, size: 64, align: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !175, file: !4, line: 216, baseType: !280, size: 128, align: 64, offset: 2624)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !175, file: !4, line: 213, size: 128, align: 64, elements: !281)
!281 = !{!282, !294}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !280, file: !4, line: 215, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !285)
!285 = !{!286, !287, !288, !289}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !284, file: !4, line: 143, baseType: !174, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !284, file: !4, line: 143, baseType: !174, size: 64, align: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !284, file: !4, line: 144, baseType: !283, size: 64, align: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !284, file: !4, line: 147, baseType: !290, size: 128, align: 64, offset: 192)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !284, file: !4, line: 145, size: 128, align: 64, elements: !291)
!291 = !{!292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !290, file: !4, line: 146, baseType: !283, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !290, file: !4, line: 146, baseType: !283, size: 64, align: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !280, file: !4, line: 215, baseType: !283, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !175, file: !4, line: 219, baseType: !283, size: 64, align: 64, offset: 2752)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !175, file: !4, line: 220, baseType: !297, size: 64, align: 64, offset: 2816)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !299)
!299 = !{!300, !301}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !4, line: 135, baseType: !297, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !4, line: 136, baseType: !183, size: 64, align: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !175, file: !4, line: 231, baseType: !303, size: 64, align: 64, offset: 2880)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !79, line: 122, size: 128, align: 64, elements: !305)
!305 = !{!306, !307}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !304, file: !79, line: 123, baseType: !303, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "namenode", scope: !304, file: !79, line: 124, baseType: !308, size: 64, align: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode", file: !79, line: 90, size: 640, align: 64, elements: !310)
!310 = !{!311, !312, !313, !316, !324, !342, !357, !358, !359, !360}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !309, file: !79, line: 91, baseType: !308, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !309, file: !79, line: 92, baseType: !183, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "packages", scope: !309, file: !79, line: 93, baseType: !314, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_list", file: !79, line: 93, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "divert", scope: !309, file: !79, line: 94, baseType: !317, size: 64, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_diversion", file: !79, line: 151, size: 256, align: 64, elements: !319)
!319 = !{!320, !321, !322, !323}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "useinstead", scope: !318, file: !79, line: 152, baseType: !308, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "camefrom", scope: !318, file: !79, line: 153, baseType: !308, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pkgset", scope: !318, file: !79, line: 154, baseType: !178, size: 64, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !79, line: 157, baseType: !317, size: 64, align: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "statoverride", scope: !309, file: !79, line: 101, baseType: !325, size: 64, align: 64, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !327, line: 40, size: 256, align: 64, elements: !328)
!327 = !DIFile(filename: "../../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!328 = !{!329, !334, !337, !340, !341}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !326, file: !327, line: 41, baseType: !330, size: 32, align: 32)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !331, line: 80, baseType: !332)
!331 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !333, line: 125, baseType: !218)
!333 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!334 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !326, file: !327, line: 42, baseType: !335, size: 32, align: 32, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !331, line: 65, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !333, line: 126, baseType: !218)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !326, file: !327, line: 43, baseType: !338, size: 32, align: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !331, line: 70, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !333, line: 129, baseType: !218)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !326, file: !327, line: 47, baseType: !158, size: 64, align: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !326, file: !327, line: 48, baseType: !158, size: 64, align: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "trig_interested", scope: !309, file: !79, line: 103, baseType: !343, size: 64, align: 64, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigfileint", file: !74, line: 54, size: 448, align: 64, elements: !345)
!345 = !{!346, !347, !349, !350, !351, !352}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !344, file: !74, line: 55, baseType: !174, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pkgbin", scope: !344, file: !74, line: 56, baseType: !348, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "fnn", scope: !344, file: !74, line: 57, baseType: !308, size: 64, align: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !344, file: !74, line: 58, baseType: !73, size: 32, align: 32, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "samefile_next", scope: !344, file: !74, line: 59, baseType: !343, size: 64, align: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "inoverall", scope: !344, file: !74, line: 62, baseType: !353, size: 128, align: 64, offset: 320)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !344, file: !74, line: 60, size: 128, align: 64, elements: !354)
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !353, file: !74, line: 61, baseType: !343, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !353, file: !74, line: 61, baseType: !343, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !309, file: !79, line: 111, baseType: !78, size: 32, align: 32, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "oldhash", scope: !309, file: !79, line: 114, baseType: !183, size: 64, align: 64, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "newhash", scope: !309, file: !79, line: 117, baseType: !183, size: 64, align: 64, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "file_ondisk_id", scope: !309, file: !79, line: 119, baseType: !361, size: 64, align: 64, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_ondisk_id", file: !79, line: 85, size: 128, align: 64, elements: !363)
!363 = !{!364, !368}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "id_dev", scope: !362, file: !79, line: 86, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !331, line: 60, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !333, line: 124, baseType: !367)
!367 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "id_ino", scope: !362, file: !79, line: 87, baseType: !369, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !331, line: 48, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !333, line: 127, baseType: !367)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !175, file: !4, line: 232, baseType: !372, size: 64, align: 64, offset: 2944)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !331, line: 86, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !333, line: 131, baseType: !374)
!374 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !175, file: !4, line: 233, baseType: !223, size: 8, align: 8, offset: 3008)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !175, file: !4, line: 236, baseType: !223, size: 8, align: 8, offset: 3016)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "activate_done", scope: !164, file: !157, line: 154, baseType: !167, size: 64, align: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "interest_change", scope: !164, file: !157, line: 155, baseType: !379, size: 64, align: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !183, !174, !348, !227, !73}
!382 = distinct !DIGlobalVariable(name: "filetriggers", scope: !0, file: !157, line: 379, type: !383, isLocal: true, isDefinition: true, variable: %struct.anon.3* @filetriggers)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 377, size: 128, align: 64, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !383, file: !157, line: 378, baseType: !343, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !383, file: !157, line: 378, baseType: !343, size: 64, align: 64, offset: 64)
!387 = distinct !DIGlobalVariable(name: "filetriggers_edited", scope: !0, file: !157, line: 387, type: !227, isLocal: true, isDefinition: true, variable: i32* @filetriggers_edited)
!388 = distinct !DIGlobalVariable(name: "tki_file", scope: !0, file: !157, line: 618, type: !163, isLocal: true, isDefinition: true, variable: %struct.trigkindinfo* @tki_file)
!389 = distinct !DIGlobalVariable(name: "trig_activating_name", scope: !0, file: !157, line: 164, type: !158, isLocal: true, isDefinition: true, variable: i8** @trig_activating_name)
!390 = distinct !DIGlobalVariable(name: "trk_file_trig", scope: !0, file: !157, line: 599, type: !183, isLocal: true, isDefinition: true, variable: i8** @trk_file_trig)
!391 = distinct !DIGlobalVariable(name: "tki_explicit", scope: !0, file: !157, line: 368, type: !163, isLocal: true, isDefinition: true, variable: %struct.trigkindinfo* @tki_explicit)
!392 = distinct !DIGlobalVariable(name: "trk_explicit_fn", scope: !0, file: !157, line: 241, type: !393, isLocal: true, isDefinition: true, variable: %struct.varbuf* @trk_explicit_fn)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !394, line: 55, size: 192, align: 64, elements: !395)
!394 = !DIFile(filename: "../../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!395 = !{!396, !399, !400}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !393, file: !394, line: 56, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !398, line: 216, baseType: !367)
!398 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!399 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !393, file: !394, line: 56, baseType: !397, size: 64, align: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !393, file: !394, line: 57, baseType: !158, size: 64, align: 64, offset: 128)
!401 = distinct !DIGlobalVariable(name: "trk_explicit_f", scope: !0, file: !157, line: 240, type: !402, isLocal: true, isDefinition: true, variable: %struct._IO_FILE** @trk_explicit_f)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !404, line: 48, baseType: !405)
!404 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !406, line: 241, size: 1728, align: 64, elements: !407)
!406 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !428, !429, !430, !431, !432, !434, !436, !440, !443, !445, !446, !447, !448, !449, !450, !451}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !405, file: !406, line: 242, baseType: !227, size: 32, align: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !405, file: !406, line: 247, baseType: !158, size: 64, align: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !405, file: !406, line: 248, baseType: !158, size: 64, align: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !405, file: !406, line: 249, baseType: !158, size: 64, align: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !405, file: !406, line: 250, baseType: !158, size: 64, align: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !405, file: !406, line: 251, baseType: !158, size: 64, align: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !405, file: !406, line: 252, baseType: !158, size: 64, align: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !405, file: !406, line: 253, baseType: !158, size: 64, align: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !405, file: !406, line: 254, baseType: !158, size: 64, align: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !405, file: !406, line: 256, baseType: !158, size: 64, align: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !405, file: !406, line: 257, baseType: !158, size: 64, align: 64, offset: 640)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !405, file: !406, line: 258, baseType: !158, size: 64, align: 64, offset: 704)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !405, file: !406, line: 260, baseType: !421, size: 64, align: 64, offset: 768)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !406, line: 156, size: 192, align: 64, elements: !423)
!423 = !{!424, !425, !427}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !422, file: !406, line: 157, baseType: !421, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !422, file: !406, line: 158, baseType: !426, size: 64, align: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !422, file: !406, line: 162, baseType: !227, size: 32, align: 32, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !405, file: !406, line: 262, baseType: !426, size: 64, align: 64, offset: 832)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !405, file: !406, line: 264, baseType: !227, size: 32, align: 32, offset: 896)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !405, file: !406, line: 268, baseType: !227, size: 32, align: 32, offset: 928)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !405, file: !406, line: 270, baseType: !373, size: 64, align: 64, offset: 960)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !405, file: !406, line: 274, baseType: !433, size: 16, align: 16, offset: 1024)
!433 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !405, file: !406, line: 275, baseType: !435, size: 8, align: 8, offset: 1040)
!435 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !405, file: !406, line: 276, baseType: !437, size: 8, align: 8, offset: 1048)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 8, align: 8, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 1)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !405, file: !406, line: 280, baseType: !441, size: 64, align: 64, offset: 1088)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !406, line: 150, baseType: null)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !405, file: !406, line: 289, baseType: !444, size: 64, align: 64, offset: 1152)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !333, line: 132, baseType: !374)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !405, file: !406, line: 297, baseType: !154, size: 64, align: 64, offset: 1216)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !405, file: !406, line: 298, baseType: !154, size: 64, align: 64, offset: 1280)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !405, file: !406, line: 299, baseType: !154, size: 64, align: 64, offset: 1344)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !405, file: !406, line: 300, baseType: !154, size: 64, align: 64, offset: 1408)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !405, file: !406, line: 302, baseType: !397, size: 64, align: 64, offset: 1472)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !405, file: !406, line: 303, baseType: !227, size: 32, align: 32, offset: 1536)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !405, file: !406, line: 305, baseType: !452, size: 160, align: 8, offset: 1568)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 160, align: 8, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 20)
!455 = distinct !DIGlobalVariable(name: "trk_explicit_trig", scope: !0, file: !157, line: 242, type: !158, isLocal: true, isDefinition: true, variable: i8** @trk_explicit_trig)
!456 = distinct !DIGlobalVariable(name: "tki_unknown", scope: !0, file: !157, line: 231, type: !163, isLocal: true, isDefinition: true, variable: %struct.trigkindinfo* @tki_unknown)
!457 = distinct !DIGlobalVariable(name: "tdm_incorp", scope: !0, file: !157, line: 759, type: !458, isLocal: true, isDefinition: true, variable: %struct.trigdefmeths* @tdm_incorp)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigdefmeths", file: !120, line: 53, size: 192, align: 64, elements: !460)
!460 = !{!461, !465, !466}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "trig_begin", scope: !459, file: !120, line: 54, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !183}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !459, file: !120, line: 55, baseType: !462, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "trig_end", scope: !459, file: !120, line: 56, baseType: !167, size: 64, align: 64, offset: 128)
!467 = distinct !DIGlobalVariable(name: "trigh", scope: !0, file: !157, line: 826, type: !468, isLocal: true, isDefinition: true, variable: %struct.trig_hooks* @trigh)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trig_hooks", file: !74, line: 70, size: 320, align: 64, elements: !469)
!469 = !{!470, !471, !475, !479, !484}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "enqueue_deferred", scope: !468, file: !74, line: 71, baseType: !171, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "transitional_activate", scope: !468, file: !74, line: 72, baseType: !472, size: 64, align: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !97}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "namenode_find", scope: !468, file: !74, line: 74, baseType: !476, size: 64, align: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!308, !183, !223}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "namenode_interested", scope: !468, file: !74, line: 75, baseType: !480, size: 64, align: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!483, !308}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "namenode_name", scope: !468, file: !74, line: 78, baseType: !485, size: 64, align: 64, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!183, !308}
!488 = !{i32 2, !"Dwarf Version", i32 4}
!489 = !{i32 2, !"Debug Info Version", i32 3}
!490 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!491 = distinct !DISubprogram(name: "trig_clear_awaiters", scope: !157, file: !157, line: 101, type: !172, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !492)
!492 = !{}
!493 = !DILocalVariable(name: "notpend", arg: 1, scope: !491, file: !157, line: 101, type: !174)
!494 = !DIExpression()
!495 = !DILocation(line: 101, column: 37, scope: !491)
!496 = !DILocalVariable(name: "ta", scope: !491, file: !157, line: 103, type: !283)
!497 = !DILocation(line: 103, column: 17, scope: !491)
!498 = !DILocalVariable(name: "aw", scope: !491, file: !157, line: 104, type: !174)
!499 = !DILocation(line: 104, column: 18, scope: !491)
!500 = !DILocation(line: 106, column: 6, scope: !501)
!501 = distinct !DILexicalBlock(scope: !491, file: !157, line: 106, column: 6)
!502 = !DILocation(line: 106, column: 15, scope: !501)
!503 = !DILocation(line: 106, column: 6, scope: !491)
!504 = !DILocation(line: 107, column: 59, scope: !501)
!505 = !DILocation(line: 107, column: 50, scope: !501)
!506 = !DILocation(line: 107, column: 3, scope: !507)
!507 = !DILexicalBlockFile(scope: !501, file: !157, discriminator: 1)
!508 = !DILocation(line: 107, column: 3, scope: !501)
!509 = !DILocation(line: 110, column: 7, scope: !491)
!510 = !DILocation(line: 110, column: 16, scope: !491)
!511 = !DILocation(line: 110, column: 5, scope: !491)
!512 = !DILocation(line: 111, column: 2, scope: !491)
!513 = !DILocation(line: 111, column: 11, scope: !491)
!514 = !DILocation(line: 111, column: 28, scope: !491)
!515 = !DILocation(line: 112, column: 2, scope: !491)
!516 = !DILocation(line: 112, column: 9, scope: !517)
!517 = !DILexicalBlockFile(scope: !518, file: !157, discriminator: 1)
!518 = distinct !DILexicalBlock(scope: !519, file: !157, line: 112, column: 2)
!519 = distinct !DILexicalBlock(scope: !491, file: !157, line: 112, column: 2)
!520 = !DILocation(line: 112, column: 2, scope: !517)
!521 = !DILocation(line: 113, column: 8, scope: !522)
!522 = distinct !DILexicalBlock(scope: !518, file: !157, line: 112, column: 37)
!523 = !DILocation(line: 113, column: 12, scope: !522)
!524 = !DILocation(line: 113, column: 6, scope: !522)
!525 = !DILocation(line: 114, column: 8, scope: !526)
!526 = distinct !DILexicalBlock(scope: !522, file: !157, line: 114, column: 7)
!527 = !DILocation(line: 114, column: 7, scope: !522)
!528 = !DILocation(line: 115, column: 4, scope: !526)
!529 = !DILocation(line: 116, column: 3, scope: !522)
!530 = distinct !{!530, !529}
!531 = !DILocation(line: 116, column: 13, scope: !532)
!532 = !DILexicalBlockFile(scope: !533, file: !157, discriminator: 1)
!533 = distinct !DILexicalBlock(scope: !534, file: !157, line: 116, column: 12)
!534 = distinct !DILexicalBlock(scope: !522, file: !157, line: 116, column: 6)
!535 = !DILocation(line: 116, column: 18, scope: !532)
!536 = !DILocation(line: 116, column: 25, scope: !532)
!537 = !DILocation(line: 116, column: 12, scope: !532)
!538 = !DILocation(line: 116, column: 65, scope: !539)
!539 = !DILexicalBlockFile(scope: !533, file: !157, discriminator: 2)
!540 = !DILocation(line: 116, column: 70, scope: !539)
!541 = !DILocation(line: 116, column: 77, scope: !539)
!542 = !DILocation(line: 116, column: 32, scope: !539)
!543 = !DILocation(line: 116, column: 37, scope: !539)
!544 = !DILocation(line: 116, column: 44, scope: !539)
!545 = !DILocation(line: 116, column: 50, scope: !539)
!546 = !DILocation(line: 116, column: 57, scope: !539)
!547 = !DILocation(line: 116, column: 62, scope: !539)
!548 = !DILocation(line: 116, column: 31, scope: !539)
!549 = !DILocation(line: 116, column: 109, scope: !550)
!550 = !DILexicalBlockFile(scope: !533, file: !157, discriminator: 3)
!551 = !DILocation(line: 116, column: 114, scope: !550)
!552 = !DILocation(line: 116, column: 121, scope: !550)
!553 = !DILocation(line: 116, column: 89, scope: !550)
!554 = !DILocation(line: 116, column: 93, scope: !550)
!555 = !DILocation(line: 116, column: 101, scope: !550)
!556 = !DILocation(line: 116, column: 106, scope: !550)
!557 = !DILocation(line: 116, column: 132, scope: !558)
!558 = !DILexicalBlockFile(scope: !559, file: !157, discriminator: 4)
!559 = distinct !DILexicalBlock(scope: !534, file: !157, line: 116, column: 131)
!560 = !DILocation(line: 116, column: 137, scope: !558)
!561 = !DILocation(line: 116, column: 144, scope: !558)
!562 = !DILocation(line: 116, column: 131, scope: !558)
!563 = !DILocation(line: 116, column: 184, scope: !564)
!564 = !DILexicalBlockFile(scope: !559, file: !157, discriminator: 5)
!565 = !DILocation(line: 116, column: 189, scope: !564)
!566 = !DILocation(line: 116, column: 196, scope: !564)
!567 = !DILocation(line: 116, column: 151, scope: !564)
!568 = !DILocation(line: 116, column: 156, scope: !564)
!569 = !DILocation(line: 116, column: 163, scope: !564)
!570 = !DILocation(line: 116, column: 169, scope: !564)
!571 = !DILocation(line: 116, column: 176, scope: !564)
!572 = !DILocation(line: 116, column: 181, scope: !564)
!573 = !DILocation(line: 116, column: 150, scope: !564)
!574 = !DILocation(line: 116, column: 228, scope: !575)
!575 = !DILexicalBlockFile(scope: !559, file: !157, discriminator: 6)
!576 = !DILocation(line: 116, column: 233, scope: !575)
!577 = !DILocation(line: 116, column: 240, scope: !575)
!578 = !DILocation(line: 116, column: 208, scope: !575)
!579 = !DILocation(line: 116, column: 212, scope: !575)
!580 = !DILocation(line: 116, column: 220, scope: !575)
!581 = !DILocation(line: 116, column: 225, scope: !575)
!582 = !DILocation(line: 116, column: 246, scope: !583)
!583 = !DILexicalBlockFile(scope: !534, file: !157, discriminator: 7)
!584 = !DILocation(line: 117, column: 8, scope: !585)
!585 = distinct !DILexicalBlock(scope: !522, file: !157, line: 117, column: 7)
!586 = !DILocation(line: 117, column: 12, scope: !585)
!587 = !DILocation(line: 117, column: 19, scope: !585)
!588 = !DILocation(line: 117, column: 24, scope: !585)
!589 = !DILocation(line: 117, column: 27, scope: !590)
!590 = !DILexicalBlockFile(scope: !585, file: !157, discriminator: 1)
!591 = !DILocation(line: 117, column: 31, scope: !590)
!592 = !DILocation(line: 117, column: 38, scope: !590)
!593 = !DILocation(line: 117, column: 7, scope: !590)
!594 = !DILocation(line: 118, column: 8, scope: !595)
!595 = distinct !DILexicalBlock(scope: !596, file: !157, line: 118, column: 8)
!596 = distinct !DILexicalBlock(scope: !585, file: !157, line: 117, column: 67)
!597 = !DILocation(line: 118, column: 12, scope: !595)
!598 = !DILocation(line: 118, column: 8, scope: !596)
!599 = !DILocation(line: 119, column: 20, scope: !595)
!600 = !DILocation(line: 119, column: 5, scope: !595)
!601 = !DILocation(line: 121, column: 20, scope: !595)
!602 = !DILocation(line: 121, column: 5, scope: !595)
!603 = !DILocation(line: 122, column: 19, scope: !596)
!604 = !DILocation(line: 122, column: 4, scope: !596)
!605 = !DILocation(line: 123, column: 3, scope: !596)
!606 = !DILocation(line: 124, column: 2, scope: !522)
!607 = !DILocation(line: 112, column: 18, scope: !608)
!608 = !DILexicalBlockFile(scope: !518, file: !157, discriminator: 2)
!609 = !DILocation(line: 112, column: 22, scope: !608)
!610 = !DILocation(line: 112, column: 16, scope: !608)
!611 = !DILocation(line: 112, column: 2, scope: !608)
!612 = distinct !{!612, !515}
!613 = !DILocation(line: 125, column: 1, scope: !491)
!614 = distinct !DISubprogram(name: "trig_fixup_awaiters", scope: !157, file: !157, line: 137, type: !473, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !492)
!615 = !DILocalVariable(name: "cstatus", arg: 1, scope: !614, file: !157, line: 137, type: !97)
!616 = !DILocation(line: 137, column: 39, scope: !614)
!617 = !DILocation(line: 139, column: 6, scope: !618)
!618 = distinct !DILexicalBlock(scope: !614, file: !157, line: 139, column: 6)
!619 = !DILocation(line: 139, column: 14, scope: !618)
!620 = !DILocation(line: 139, column: 6, scope: !614)
!621 = !DILocation(line: 140, column: 3, scope: !618)
!622 = !DILocation(line: 142, column: 2, scope: !614)
!623 = !DILocation(line: 143, column: 2, scope: !614)
!624 = !DILocation(line: 144, column: 1, scope: !614)
!625 = !DILocation(line: 144, column: 1, scope: !626)
!626 = !DILexicalBlockFile(scope: !614, file: !157, discriminator: 1)
!627 = distinct !DISubprogram(name: "trig_file_interests_save", scope: !157, file: !157, line: 476, type: !168, isLocal: false, isDefinition: true, scopeLine: 477, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !492)
!628 = !DILocation(line: 478, column: 6, scope: !629)
!629 = distinct !DILexicalBlock(scope: !627, file: !157, line: 478, column: 6)
!630 = !DILocation(line: 478, column: 26, scope: !629)
!631 = !DILocation(line: 478, column: 6, scope: !627)
!632 = !DILocation(line: 479, column: 3, scope: !629)
!633 = !DILocation(line: 481, column: 20, scope: !634)
!634 = distinct !DILexicalBlock(scope: !627, file: !157, line: 481, column: 6)
!635 = !DILocation(line: 481, column: 7, scope: !634)
!636 = !DILocation(line: 481, column: 6, scope: !627)
!637 = !DILocation(line: 482, column: 3, scope: !634)
!638 = !DILocation(line: 484, column: 3, scope: !634)
!639 = !DILocation(line: 486, column: 16, scope: !627)
!640 = !DILocation(line: 486, column: 2, scope: !627)
!641 = !DILocation(line: 488, column: 22, scope: !627)
!642 = !DILocation(line: 489, column: 1, scope: !627)
!643 = !DILocation(line: 489, column: 1, scope: !644)
!644 = !DILexicalBlockFile(scope: !627, file: !157, discriminator: 1)
!645 = distinct !DISubprogram(name: "trig_file_interests_remove", scope: !157, file: !157, line: 449, type: !168, isLocal: true, isDefinition: true, scopeLine: 450, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !492)
!646 = !DILocation(line: 451, column: 13, scope: !647)
!647 = distinct !DILexicalBlock(scope: !645, file: !157, line: 451, column: 6)
!648 = !DILocation(line: 451, column: 6, scope: !647)
!649 = !DILocation(line: 451, column: 31, scope: !647)
!650 = !DILocation(line: 451, column: 35, scope: !651)
!651 = !DILexicalBlockFile(scope: !647, file: !157, discriminator: 1)
!652 = !DILocation(line: 451, column: 34, scope: !651)
!653 = !DILocation(line: 451, column: 39, scope: !651)
!654 = !DILocation(line: 451, column: 6, scope: !651)
!655 = !DILocation(line: 452, column: 10, scope: !647)
!656 = !DILocation(line: 452, column: 39, scope: !647)
!657 = !DILocation(line: 452, column: 3, scope: !651)
!658 = !DILocation(line: 452, column: 3, scope: !647)
!659 = !DILocation(line: 453, column: 1, scope: !645)
!660 = distinct !DISubprogram(name: "trig_file_interests_update", scope: !157, file: !157, line: 456, type: !168, isLocal: true, isDefinition: true, scopeLine: 457, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !492)
!661 = !DILocalVariable(name: "tfi", scope: !660, file: !157, line: 458, type: !343)
!662 = !DILocation(line: 458, column: 22, scope: !660)
!663 = !DILocalVariable(name: "file", scope: !660, file: !157, line: 459, type: !664)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64, align: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atomic_file", file: !135, line: 40, size: 256, align: 64, elements: !666)
!666 = !{!667, !668, !669, !670}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !665, file: !135, line: 41, baseType: !134, size: 32, align: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !665, file: !135, line: 42, baseType: !158, size: 64, align: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "name_new", scope: !665, file: !135, line: 43, baseType: !158, size: 64, align: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !665, file: !135, line: 44, baseType: !402, size: 64, align: 64, offset: 192)
!671 = !DILocation(line: 459, column: 22, scope: !660)
!672 = !DILocation(line: 461, column: 25, scope: !660)
!673 = !DILocation(line: 461, column: 9, scope: !660)
!674 = !DILocation(line: 461, column: 7, scope: !660)
!675 = !DILocation(line: 462, column: 19, scope: !660)
!676 = !DILocation(line: 462, column: 2, scope: !660)
!677 = !DILocation(line: 464, column: 26, scope: !678)
!678 = distinct !DILexicalBlock(scope: !660, file: !157, line: 464, column: 2)
!679 = !DILocation(line: 464, column: 11, scope: !678)
!680 = !DILocation(line: 464, column: 7, scope: !678)
!681 = !DILocation(line: 464, column: 32, scope: !682)
!682 = !DILexicalBlockFile(scope: !683, file: !157, discriminator: 1)
!683 = distinct !DILexicalBlock(scope: !678, file: !157, line: 464, column: 2)
!684 = !DILocation(line: 464, column: 2, scope: !682)
!685 = !DILocation(line: 465, column: 11, scope: !683)
!686 = !DILocation(line: 465, column: 17, scope: !683)
!687 = !DILocation(line: 465, column: 40, scope: !683)
!688 = !DILocation(line: 465, column: 54, scope: !683)
!689 = !DILocation(line: 465, column: 59, scope: !683)
!690 = !DILocation(line: 465, column: 34, scope: !683)
!691 = !DILocation(line: 466, column: 23, scope: !683)
!692 = !DILocation(line: 466, column: 28, scope: !683)
!693 = !DILocation(line: 466, column: 33, scope: !683)
!694 = !DILocation(line: 466, column: 38, scope: !683)
!695 = !DILocation(line: 466, column: 11, scope: !683)
!696 = !DILocation(line: 467, column: 12, scope: !683)
!697 = !DILocation(line: 467, column: 17, scope: !683)
!698 = !DILocation(line: 467, column: 25, scope: !683)
!699 = !DILocation(line: 467, column: 11, scope: !683)
!700 = !DILocation(line: 465, column: 3, scope: !682)
!701 = !DILocation(line: 465, column: 3, scope: !683)
!702 = !DILocation(line: 464, column: 43, scope: !703)
!703 = !DILexicalBlockFile(scope: !683, file: !157, discriminator: 2)
!704 = !DILocation(line: 464, column: 48, scope: !703)
!705 = !DILocation(line: 464, column: 58, scope: !703)
!706 = !DILocation(line: 464, column: 41, scope: !703)
!707 = !DILocation(line: 464, column: 2, scope: !703)
!708 = distinct !{!708, !709}
!709 = !DILocation(line: 464, column: 2, scope: !660)
!710 = !DILocation(line: 469, column: 19, scope: !660)
!711 = !DILocation(line: 469, column: 2, scope: !660)
!712 = !DILocation(line: 470, column: 20, scope: !660)
!713 = !DILocation(line: 470, column: 2, scope: !660)
!714 = !DILocation(line: 471, column: 21, scope: !660)
!715 = !DILocation(line: 471, column: 2, scope: !660)
!716 = !DILocation(line: 472, column: 19, scope: !660)
!717 = !DILocation(line: 472, column: 2, scope: !660)
!718 = !DILocation(line: 473, column: 1, scope: !660)
!719 = distinct !DISubprogram(name: "trig_file_interests_ensure", scope: !157, file: !157, line: 492, type: !168, isLocal: false, isDefinition: true, scopeLine: 493, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !492)
!720 = !DILocalVariable(name: "f", scope: !719, file: !157, line: 494, type: !402)
!721 = !DILocation(line: 494, column: 8, scope: !719)
!722 = !DILocalVariable(name: "linebuf", scope: !719, file: !157, line: 495, type: !723)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 8192, align: 8, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 1024)
!726 = !DILocation(line: 495, column: 7, scope: !719)
!727 = !DILocalVariable(name: "space", scope: !719, file: !157, line: 495, type: !158)
!728 = !DILocation(line: 495, column: 23, scope: !719)
!729 = !DILocalVariable(name: "pkg", scope: !719, file: !157, line: 496, type: !174)
!730 = !DILocation(line: 496, column: 18, scope: !719)
!731 = !DILocalVariable(name: "pkgbin", scope: !719, file: !157, line: 497, type: !348)
!732 = !DILocation(line: 497, column: 17, scope: !719)
!733 = !DILocation(line: 499, column: 6, scope: !734)
!734 = distinct !DILexicalBlock(scope: !719, file: !157, line: 499, column: 6)
!735 = !DILocation(line: 499, column: 26, scope: !734)
!736 = !DILocation(line: 499, column: 6, scope: !719)
!737 = !DILocation(line: 500, column: 3, scope: !734)
!738 = !DILocation(line: 502, column: 12, scope: !719)
!739 = !DILocation(line: 502, column: 6, scope: !719)
!740 = !DILocation(line: 502, column: 4, scope: !719)
!741 = !DILocation(line: 503, column: 7, scope: !742)
!742 = distinct !DILexicalBlock(scope: !719, file: !157, line: 503, column: 6)
!743 = !DILocation(line: 503, column: 6, scope: !719)
!744 = !DILocation(line: 504, column: 8, scope: !745)
!745 = distinct !DILexicalBlock(scope: !746, file: !157, line: 504, column: 6)
!746 = distinct !DILexicalBlock(scope: !742, file: !157, line: 503, column: 10)
!747 = !DILocation(line: 504, column: 7, scope: !745)
!748 = !DILocation(line: 504, column: 12, scope: !745)
!749 = !DILocation(line: 504, column: 6, scope: !746)
!750 = !DILocation(line: 505, column: 4, scope: !745)
!751 = !DILocation(line: 506, column: 10, scope: !746)
!752 = !DILocation(line: 507, column: 11, scope: !746)
!753 = !DILocation(line: 506, column: 3, scope: !754)
!754 = !DILexicalBlockFile(scope: !746, file: !157, discriminator: 1)
!755 = !DILocation(line: 506, column: 3, scope: !746)
!756 = !DILocation(line: 510, column: 38, scope: !719)
!757 = !DILocation(line: 510, column: 2, scope: !719)
!758 = !DILocation(line: 511, column: 2, scope: !719)
!759 = !DILocation(line: 511, column: 23, scope: !760)
!760 = !DILexicalBlockFile(scope: !719, file: !157, discriminator: 1)
!761 = !DILocation(line: 511, column: 49, scope: !760)
!762 = !DILocation(line: 511, column: 52, scope: !760)
!763 = !DILocation(line: 511, column: 9, scope: !760)
!764 = !DILocation(line: 511, column: 70, scope: !760)
!765 = !DILocation(line: 511, column: 2, scope: !760)
!766 = !DILocalVariable(name: "err", scope: !767, file: !157, line: 512, type: !768)
!767 = distinct !DILexicalBlock(scope: !719, file: !157, line: 511, column: 76)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_error", file: !108, line: 42, size: 128, align: 64, elements: !769)
!769 = !{!770, !771, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !768, file: !108, line: 43, baseType: !107, size: 32, align: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "syserrno", scope: !768, file: !108, line: 45, baseType: !227, size: 32, align: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !768, file: !108, line: 46, baseType: !158, size: 64, align: 64, offset: 64)
!773 = !DILocation(line: 512, column: 21, scope: !767)
!774 = !DILocalVariable(name: "slash", scope: !767, file: !157, line: 513, type: !158)
!775 = !DILocation(line: 513, column: 9, scope: !767)
!776 = !DILocalVariable(name: "trig_opts", scope: !767, file: !157, line: 514, type: !73)
!777 = !DILocation(line: 514, column: 21, scope: !767)
!778 = !DILocation(line: 515, column: 18, scope: !767)
!779 = !DILocation(line: 515, column: 11, scope: !767)
!780 = !DILocation(line: 515, column: 9, scope: !767)
!781 = !DILocation(line: 516, column: 8, scope: !782)
!782 = distinct !DILexicalBlock(scope: !767, file: !157, line: 516, column: 7)
!783 = !DILocation(line: 516, column: 14, scope: !782)
!784 = !DILocation(line: 516, column: 17, scope: !785)
!785 = !DILexicalBlockFile(scope: !782, file: !157, discriminator: 1)
!786 = !DILocation(line: 516, column: 28, scope: !785)
!787 = !DILocation(line: 516, column: 7, scope: !785)
!788 = !DILocation(line: 517, column: 10, scope: !782)
!789 = !DILocation(line: 518, column: 11, scope: !782)
!790 = !DILocation(line: 517, column: 4, scope: !785)
!791 = !DILocation(line: 517, column: 4, scope: !782)
!792 = !DILocation(line: 519, column: 9, scope: !767)
!793 = !DILocation(line: 519, column: 12, scope: !767)
!794 = !DILocation(line: 521, column: 18, scope: !767)
!795 = !DILocation(line: 521, column: 11, scope: !767)
!796 = !DILocation(line: 521, column: 9, scope: !767)
!797 = !DILocation(line: 522, column: 7, scope: !798)
!798 = distinct !DILexicalBlock(scope: !767, file: !157, line: 522, column: 7)
!799 = !DILocation(line: 522, column: 13, scope: !798)
!800 = !DILocation(line: 522, column: 35, scope: !801)
!801 = !DILexicalBlockFile(scope: !798, file: !157, discriminator: 1)
!802 = !DILocation(line: 522, column: 16, scope: !801)
!803 = !DILocation(line: 522, column: 42, scope: !801)
!804 = !DILocation(line: 522, column: 7, scope: !801)
!805 = !DILocation(line: 523, column: 14, scope: !806)
!806 = distinct !DILexicalBlock(scope: !798, file: !157, line: 522, column: 48)
!807 = !DILocation(line: 524, column: 5, scope: !806)
!808 = !DILocation(line: 524, column: 11, scope: !806)
!809 = !DILocation(line: 525, column: 3, scope: !806)
!810 = !DILocation(line: 526, column: 7, scope: !811)
!811 = distinct !DILexicalBlock(scope: !767, file: !157, line: 526, column: 7)
!812 = !DILocation(line: 526, column: 13, scope: !811)
!813 = !DILocation(line: 526, column: 33, scope: !814)
!814 = !DILexicalBlockFile(scope: !811, file: !157, discriminator: 1)
!815 = !DILocation(line: 526, column: 16, scope: !814)
!816 = !DILocation(line: 526, column: 40, scope: !814)
!817 = !DILocation(line: 526, column: 7, scope: !814)
!818 = !DILocation(line: 527, column: 14, scope: !819)
!819 = distinct !DILexicalBlock(scope: !811, file: !157, line: 526, column: 46)
!820 = !DILocation(line: 528, column: 5, scope: !819)
!821 = !DILocation(line: 528, column: 11, scope: !819)
!822 = !DILocation(line: 529, column: 3, scope: !819)
!823 = !DILocation(line: 531, column: 28, scope: !767)
!824 = !DILocation(line: 531, column: 9, scope: !767)
!825 = !DILocation(line: 531, column: 7, scope: !767)
!826 = !DILocation(line: 532, column: 7, scope: !827)
!827 = distinct !DILexicalBlock(scope: !767, file: !157, line: 532, column: 7)
!828 = !DILocation(line: 532, column: 11, scope: !827)
!829 = !DILocation(line: 532, column: 7, scope: !767)
!830 = !DILocation(line: 533, column: 10, scope: !827)
!831 = !DILocation(line: 535, column: 34, scope: !827)
!832 = !DILocation(line: 535, column: 41, scope: !827)
!833 = !DILocation(line: 535, column: 54, scope: !827)
!834 = !DILocation(line: 533, column: 4, scope: !835)
!835 = !DILexicalBlockFile(scope: !827, file: !157, discriminator: 1)
!836 = !DILocation(line: 533, column: 4, scope: !827)
!837 = !DILocation(line: 536, column: 13, scope: !767)
!838 = !DILocation(line: 536, column: 18, scope: !767)
