; ModuleID = './[inter]lib--dpkg--subproc.o.i'
source_filename = "./[inter]lib--dpkg--subproc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.__sigset_t = type { [16 x i64] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%union.anon.8 = type { i32 }
%union.anon.9 = type { i32 }
%union.anon.10 = type { i32 }
%union.anon.11 = type { i32 }
%union.anon.12 = type { i32 }

@onerr_abort = external global i32, align 4
@signo_ignores = internal global [2 x i32] [i32 3, i32 2], align 4
@sa_save = internal global [2 x %struct.sigaction] zeroinitializer, align 16
@.str = private unnamed_addr constant [5 x i8] c"dpkg\00", align 1
@.str.1 = private unnamed_addr constant [12 x i8] c"fork failed\00", align 1
@.str.2 = private unnamed_addr constant [49 x i8] c"unable to ignore signal %s before running %.250s\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.3 = private unnamed_addr constant [33 x i8] c"error un-catching signal %s: %s\0A\00", align 1
@.str.4 = private unnamed_addr constant [21 x i8] c"%s (subprocess): %s\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !18, globals: !26)
!1 = !DIFile(filename: "[inter]lib--dpkg--subproc.o.i", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 41, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../lib/dpkg/ehandle.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "ehflag_normaltidy", value: 1)
!7 = !DIEnumerator(name: "ehflag_bombout", value: 2)
!8 = !DIEnumerator(name: "ehflag_recursiveerror", value: 4)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "subproc_flags", file: !10, line: 36, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "../../lib/dpkg/subproc.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!11 = !{!12, !13, !14, !15, !16, !17}
!12 = !DIEnumerator(name: "SUBPROC_NORMAL", value: 0)
!13 = !DIEnumerator(name: "SUBPROC_WARN", value: 1)
!14 = !DIEnumerator(name: "SUBPROC_NOPIPE", value: 2)
!15 = !DIEnumerator(name: "SUBPROC_NOCHECK", value: 4)
!16 = !DIEnumerator(name: "SUBPROC_RETERROR", value: 8)
!17 = !DIEnumerator(name: "SUBPROC_RETSIGNO", value: 8)
!18 = !{!19, !25}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !20, line: 85, baseType: !21)
!20 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DISubroutineType(types: !23)
!23 = !{null, !24}
!24 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!25 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!26 = !{!27, !133}
!27 = distinct !DIGlobalVariable(name: "sa_save", scope: !0, file: !28, line: 40, type: !29, isLocal: true, isDefinition: true, variable: [2 x %struct.sigaction]* @sa_save)
!28 = !DIFile(filename: "subproc.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 2432, align: 64, elements: !131)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !31, line: 24, size: 1216, align: 64, elements: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!32 = !{!33, !116, !126, !127}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !30, file: !31, line: 35, baseType: !34, size: 64, align: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !30, file: !31, line: 28, size: 64, align: 64, elements: !35)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !34, file: !31, line: 31, baseType: !19, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !34, file: !31, line: 33, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !24, !41, !76}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !43, line: 133, baseType: !44)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/siginfo.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 62, size: 1024, align: 64, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !44, file: !43, line: 64, baseType: !24, size: 32, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !44, file: !43, line: 65, baseType: !24, size: 32, align: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !44, file: !43, line: 67, baseType: !24, size: 32, align: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !44, file: !43, line: 132, baseType: !50, size: 896, align: 64, offset: 128)
!50 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !44, file: !43, line: 69, size: 896, align: 64, elements: !51)
!51 = !{!52, !56, !65, !77, !83, !94, !105, !110}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !50, file: !43, line: 71, baseType: !53, size: 896, align: 32)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 896, align: 32, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 28)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !50, file: !43, line: 78, baseType: !57, size: 64, align: 32)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !43, line: 74, size: 64, align: 32, elements: !58)
!58 = !{!59, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !57, file: !43, line: 76, baseType: !60, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !61, line: 133, baseType: !24)
!61 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!62 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !57, file: !43, line: 77, baseType: !63, size: 32, align: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !61, line: 125, baseType: !64)
!64 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !50, file: !43, line: 86, baseType: !66, size: 128, align: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !43, line: 81, size: 128, align: 64, elements: !67)
!67 = !{!68, !69, !70}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !66, file: !43, line: 83, baseType: !24, size: 32, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !66, file: !43, line: 84, baseType: !24, size: 32, align: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !66, file: !43, line: 85, baseType: !71, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !43, line: 36, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !43, line: 32, size: 64, align: 64, elements: !73)
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !72, file: !43, line: 34, baseType: !24, size: 32, align: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !72, file: !43, line: 35, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !50, file: !43, line: 94, baseType: !78, size: 128, align: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !43, line: 89, size: 128, align: 64, elements: !79)
!79 = !{!80, !81, !82}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !78, file: !43, line: 91, baseType: !60, size: 32, align: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !78, file: !43, line: 92, baseType: !63, size: 32, align: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !78, file: !43, line: 93, baseType: !71, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !50, file: !43, line: 104, baseType: !84, size: 256, align: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !43, line: 97, size: 256, align: 64, elements: !85)
!85 = !{!86, !87, !88, !89, !93}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !84, file: !43, line: 99, baseType: !60, size: 32, align: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !84, file: !43, line: 100, baseType: !63, size: 32, align: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !84, file: !43, line: 101, baseType: !24, size: 32, align: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !84, file: !43, line: 102, baseType: !90, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !43, line: 58, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !61, line: 135, baseType: !92)
!92 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !84, file: !43, line: 103, baseType: !90, size: 64, align: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !50, file: !43, line: 116, baseType: !95, size: 256, align: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !43, line: 107, size: 256, align: 64, elements: !96)
!96 = !{!97, !98, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !95, file: !43, line: 109, baseType: !76, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !95, file: !43, line: 110, baseType: !99, size: 16, align: 16, offset: 64)
!99 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_bnd", scope: !95, file: !43, line: 115, baseType: !101, size: 128, align: 64, offset: 128)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !95, file: !43, line: 111, size: 128, align: 64, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !101, file: !43, line: 113, baseType: !76, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !101, file: !43, line: 114, baseType: !76, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !50, file: !43, line: 123, baseType: !106, size: 128, align: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !43, line: 119, size: 128, align: 64, elements: !107)
!107 = !{!108, !109}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !106, file: !43, line: 121, baseType: !92, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !106, file: !43, line: 122, baseType: !24, size: 32, align: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !50, file: !43, line: 131, baseType: !111, size: 128, align: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !50, file: !43, line: 126, size: 128, align: 64, elements: !112)
!112 = !{!113, !114, !115}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !111, file: !43, line: 128, baseType: !76, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !111, file: !43, line: 129, baseType: !24, size: 32, align: 32, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !111, file: !43, line: 130, baseType: !64, size: 32, align: 32, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !30, file: !31, line: 43, baseType: !117, size: 1024, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !118, line: 30, baseType: !119)
!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 27, size: 1024, align: 64, elements: !120)
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !119, file: !118, line: 29, baseType: !122, size: 1024, align: 64)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 1024, align: 64, elements: !124)
!123 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!124 = !{!125}
!125 = !DISubrange(count: 16)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !30, file: !31, line: 46, baseType: !24, size: 32, align: 32, offset: 1088)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !30, file: !31, line: 49, baseType: !128, size: 64, align: 64, offset: 1152)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{null}
!131 = !{!132}
!132 = !DISubrange(count: 2)
!133 = distinct !DIGlobalVariable(name: "signo_ignores", scope: !0, file: !28, line: 39, type: !134, isLocal: true, isDefinition: true, variable: [2 x i32]* @signo_ignores)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 64, align: 32, elements: !131)
!135 = !{i32 2, !"Dwarf Version", i32 4}
!136 = !{i32 2, !"Debug Info Version", i32 3}
!137 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!138 = distinct !DISubprogram(name: "subproc_signals_ignore", scope: !28, file: !28, line: 62, type: !139, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !144)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!144 = !{}
!145 = !DILocalVariable(name: "name", arg: 1, scope: !138, file: !28, line: 62, type: !141)
!146 = !DIExpression()
!147 = !DILocation(line: 62, column: 36, scope: !138)
!148 = !DILocalVariable(name: "sa", scope: !138, file: !28, line: 64, type: !30)
!149 = !DILocation(line: 64, column: 19, scope: !138)
!150 = !DILocalVariable(name: "i", scope: !138, file: !28, line: 65, type: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !152, line: 216, baseType: !123)
!152 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!153 = !DILocation(line: 65, column: 9, scope: !138)
!154 = !DILocation(line: 67, column: 13, scope: !138)
!155 = !DILocation(line: 68, column: 2, scope: !138)
!156 = !DILocation(line: 69, column: 18, scope: !138)
!157 = !DILocation(line: 69, column: 2, scope: !138)
!158 = !DILocation(line: 70, column: 4, scope: !138)
!159 = !DILocation(line: 70, column: 24, scope: !138)
!160 = !DILocation(line: 70, column: 15, scope: !138)
!161 = !DILocation(line: 71, column: 5, scope: !138)
!162 = !DILocation(line: 71, column: 14, scope: !138)
!163 = !DILocation(line: 73, column: 9, scope: !164)
!164 = distinct !DILexicalBlock(scope: !138, file: !28, line: 73, column: 2)
!165 = !DILocation(line: 73, column: 7, scope: !164)
!166 = !DILocation(line: 73, column: 14, scope: !167)
!167 = !DILexicalBlockFile(scope: !168, file: !28, discriminator: 1)
!168 = distinct !DILexicalBlock(scope: !164, file: !28, line: 73, column: 2)
!169 = !DILocation(line: 73, column: 16, scope: !167)
!170 = !DILocation(line: 73, column: 2, scope: !167)
!171 = !DILocation(line: 74, column: 36, scope: !168)
!172 = !DILocation(line: 74, column: 22, scope: !168)
!173 = !DILocation(line: 74, column: 54, scope: !168)
!174 = !DILocation(line: 74, column: 46, scope: !168)
!175 = !DILocation(line: 74, column: 58, scope: !168)
!176 = !DILocation(line: 74, column: 3, scope: !168)
!177 = !DILocation(line: 73, column: 73, scope: !178)
!178 = !DILexicalBlockFile(scope: !168, file: !28, discriminator: 2)
!179 = !DILocation(line: 73, column: 2, scope: !178)
!180 = distinct !{!180, !181}
!181 = !DILocation(line: 73, column: 2, scope: !138)
!182 = !DILocation(line: 76, column: 2, scope: !138)
!183 = !DILocation(line: 77, column: 13, scope: !138)
!184 = !DILocation(line: 78, column: 1, scope: !138)
!185 = distinct !DISubprogram(name: "subproc_set_signal", scope: !28, file: !28, line: 53, type: !186, isLocal: true, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !144)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !24, !188, !188, !141}
