; ModuleID = './[inter]lib--dpkg--tarfn.o.i'
source_filename = "./[inter]lib--dpkg--tarfn.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.tar_entry = type { i32, i32, i8*, i8*, i64, i64, i64, %struct.file_stat }
%struct.file_stat = type { i32, i32, i32, i8*, i8* }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.tar_archive = type { %struct.dpkg_error, i32, %struct.tar_operations*, i8* }
%struct.dpkg_error = type { i32, i32, i8* }
%struct.tar_operations = type { i32 (%struct.tar_archive*, i8*, i32)*, i32 (%struct.tar_archive*, %struct.tar_entry*)*, i32 (%struct.tar_archive*, %struct.tar_entry*)*, i32 (%struct.tar_archive*, %struct.tar_entry*)*, i32 (%struct.tar_archive*, %struct.tar_entry*)*, i32 (%struct.tar_archive*, %struct.tar_entry*)* }
%struct.tar_symlink_entry = type { %struct.tar_symlink_entry*, %struct.tar_entry }
%struct.tar_header = type { [100 x i8], [8 x i8], [8 x i8], [8 x i8], [12 x i8], [12 x i8], [8 x i8], i8, [100 x i8], [8 x i8], [32 x i8], [32 x i8], [8 x i8], [8 x i8], [155 x i8] }

@.str = private unnamed_addr constant [5 x i8] c"dpkg\00", align 1
@.str.1 = private unnamed_addr constant [41 x i8] c"invalid tar header with empty name field\00", align 1
@.str.2 = private unnamed_addr constant [37 x i8] c"unsupported GNU tar header type '%c'\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !38)
!1 = !DIFile(filename: "[inter]lib--dpkg--tarfn.o.i", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!2 = !{!3, !11, !32}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tar_format", file: !4, line: 40, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../lib/dpkg/tarfn.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "TAR_FORMAT_UNKNOWN", value: 0)
!7 = !DIEnumerator(name: "TAR_FORMAT_OLD", value: 1)
!8 = !DIEnumerator(name: "TAR_FORMAT_GNU", value: 2)
!9 = !DIEnumerator(name: "TAR_FORMAT_USTAR", value: 3)
!10 = !DIEnumerator(name: "TAR_FORMAT_PAX", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tar_filetype", file: !4, line: 48, size: 32, align: 32, elements: !12)
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!13 = !DIEnumerator(name: "TAR_FILETYPE_FILE0", value: 0)
!14 = !DIEnumerator(name: "TAR_FILETYPE_FILE", value: 48)
!15 = !DIEnumerator(name: "TAR_FILETYPE_HARDLINK", value: 49)
!16 = !DIEnumerator(name: "TAR_FILETYPE_SYMLINK", value: 50)
!17 = !DIEnumerator(name: "TAR_FILETYPE_CHARDEV", value: 51)
!18 = !DIEnumerator(name: "TAR_FILETYPE_BLOCKDEV", value: 52)
!19 = !DIEnumerator(name: "TAR_FILETYPE_DIR", value: 53)
!20 = !DIEnumerator(name: "TAR_FILETYPE_FIFO", value: 54)
!21 = !DIEnumerator(name: "TAR_FILETYPE_CONTIG", value: 55)
!22 = !DIEnumerator(name: "TAR_FILETYPE_GNU_LONGLINK", value: 75)
!23 = !DIEnumerator(name: "TAR_FILETYPE_GNU_LONGNAME", value: 76)
!24 = !DIEnumerator(name: "TAR_FILETYPE_GNU_VOLUME", value: 86)
!25 = !DIEnumerator(name: "TAR_FILETYPE_GNU_MULTIVOL", value: 77)
!26 = !DIEnumerator(name: "TAR_FILETYPE_GNU_DUMPDIR", value: 68)
!27 = !DIEnumerator(name: "TAR_FILETYPE_GNU_SPARSE", value: 83)
!28 = !DIEnumerator(name: "TAR_FILETYPE_PAX_GLOBAL", value: 103)
!29 = !DIEnumerator(name: "TAR_FILETYPE_PAX_EXTENDED", value: 120)
!30 = !DIEnumerator(name: "TAR_FILETYPE_SOLARIS_EXTENDED", value: 88)
!31 = !DIEnumerator(name: "TAR_FILETYPE_SOLARIS_ACL", value: 65)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_msg_type", file: !33, line: 36, size: 32, align: 32, elements: !34)
!33 = !DIFile(filename: "../../lib/dpkg/error.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!34 = !{!35, !36, !37}
!35 = !DIEnumerator(name: "DPKG_MSG_NONE", value: 0)
!36 = !DIEnumerator(name: "DPKG_MSG_WARN", value: 1)
!37 = !DIEnumerator(name: "DPKG_MSG_ERROR", value: 2)
!38 = !{!39, !74, !77, !11, !80, !85, !88, !90, !93, !95, !96, !98}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tar_header", file: !41, line: 64, size: 4000, align: 8, elements: !42)
!41 = !DIFile(filename: "tarfn.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!42 = !{!43, !48, !52, !53, !54, !58, !59, !60, !61, !62, !63, !67, !68, !69, !70}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !41, line: 65, baseType: !44, size: 800, align: 8)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 800, align: 8, elements: !46)
!45 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!46 = !{!47}
!47 = !DISubrange(count: 100)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !40, file: !41, line: 66, baseType: !49, size: 64, align: 8, offset: 800)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 64, align: 8, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 8)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !40, file: !41, line: 67, baseType: !49, size: 64, align: 8, offset: 864)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !40, file: !41, line: 68, baseType: !49, size: 64, align: 8, offset: 928)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !40, file: !41, line: 69, baseType: !55, size: 96, align: 8, offset: 992)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 96, align: 8, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 12)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !40, file: !41, line: 70, baseType: !55, size: 96, align: 8, offset: 1088)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !40, file: !41, line: 71, baseType: !49, size: 64, align: 8, offset: 1184)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "linkflag", scope: !40, file: !41, line: 72, baseType: !45, size: 8, align: 8, offset: 1248)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "linkname", scope: !40, file: !41, line: 73, baseType: !44, size: 800, align: 8, offset: 1256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !40, file: !41, line: 76, baseType: !49, size: 64, align: 8, offset: 2056)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !40, file: !41, line: 77, baseType: !64, size: 256, align: 8, offset: 2120)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 256, align: 8, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !40, file: !41, line: 78, baseType: !64, size: 256, align: 8, offset: 2376)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "devmajor", scope: !40, file: !41, line: 79, baseType: !49, size: 64, align: 8, offset: 2632)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "devminor", scope: !40, file: !41, line: 80, baseType: !49, size: 64, align: 8, offset: 2696)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !40, file: !41, line: 83, baseType: !71, size: 1240, align: 8, offset: 2760)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 1240, align: 8, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 155)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !78, line: 135, baseType: !79)
!78 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!79 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !81, line: 73, baseType: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !83, line: 131, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!84 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !86, line: 75, baseType: !87)
!86 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !83, line: 139, baseType: !84)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !81, line: 43, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !83, line: 124, baseType: !79)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !81, line: 81, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !83, line: 125, baseType: !92)
!92 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !81, line: 48, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !83, line: 126, baseType: !92)
!95 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !81, line: 62, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !83, line: 129, baseType: !92)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!99 = !{i32 2, !"Dwarf Version", i32 4}
!100 = !{i32 2, !"Debug Info Version", i32 3}
!101 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!102 = distinct !DISubprogram(name: "tar_atoul", scope: !41, file: !41, line: 184, type: !103, isLocal: false, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !109)
!103 = !DISubroutineType(types: !104)
!104 = !{!77, !105, !107, !77}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 216, baseType: !79)
!108 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!109 = !{}
!110 = !DILocalVariable(name: "s", arg: 1, scope: !102, file: !41, line: 184, type: !105)
!111 = !DIExpression()
!112 = !DILocation(line: 184, column: 23, scope: !102)
!113 = !DILocalVariable(name: "size", arg: 2, scope: !102, file: !41, line: 184, type: !107)
!114 = !DILocation(line: 184, column: 33, scope: !102)
!115 = !DILocalVariable(name: "max", arg: 3, scope: !102, file: !41, line: 184, type: !77)
!116 = !DILocation(line: 184, column: 49, scope: !102)
!117 = !DILocalVariable(name: "n", scope: !102, file: !41, line: 186, type: !77)
!118 = !DILocation(line: 186, column: 12, scope: !102)
!119 = !DILocation(line: 186, column: 25, scope: !102)
!120 = !DILocation(line: 186, column: 28, scope: !102)
!121 = !DILocation(line: 186, column: 16, scope: !102)
!122 = !DILocation(line: 188, column: 6, scope: !123)
!123 = distinct !DILexicalBlock(scope: !102, file: !41, line: 188, column: 6)
!124 = !DILocation(line: 188, column: 10, scope: !123)
!125 = !DILocation(line: 188, column: 8, scope: !123)
!126 = !DILocation(line: 188, column: 6, scope: !102)
!127 = !DILocation(line: 189, column: 10, scope: !123)
!128 = !DILocation(line: 189, column: 3, scope: !123)
!129 = !DILocation(line: 191, column: 9, scope: !102)
!130 = !DILocation(line: 191, column: 2, scope: !102)
!131 = !DILocation(line: 192, column: 1, scope: !102)
!132 = distinct !DISubprogram(name: "tar_atol", scope: !41, file: !41, line: 171, type: !133, isLocal: true, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !109)
!133 = !DISubroutineType(types: !134)
!134 = !{!77, !105, !107, !135, !77}
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !78, line: 134, baseType: !84)
!136 = !DILocalVariable(name: "s", arg: 1, scope: !132, file: !41, line: 171, type: !105)
!137 = !DILocation(line: 171, column: 22, scope: !132)
!138 = !DILocalVariable(name: "size", arg: 2, scope: !132, file: !41, line: 171, type: !107)
!139 = !DILocation(line: 171, column: 32, scope: !132)
!140 = !DILocalVariable(name: "min", arg: 3, scope: !132, file: !41, line: 171, type: !135)
!141 = !DILocation(line: 171, column: 47, scope: !132)
!142 = !DILocalVariable(name: "max", arg: 4, scope: !132, file: !41, line: 171, type: !77)
!143 = !DILocation(line: 171, column: 62, scope: !132)
!144 = !DILocalVariable(name: "a", scope: !132, file: !41, line: 173, type: !74)
!145 = !DILocation(line: 173, column: 23, scope: !132)
!146 = !DILocation(line: 173, column: 50, scope: !132)
!147 = !DILocation(line: 177, column: 7, scope: !148)
!148 = distinct !DILexicalBlock(scope: !132, file: !41, line: 177, column: 6)
!149 = !DILocation(line: 177, column: 6, scope: !148)
!150 = !DILocation(line: 177, column: 9, scope: !148)
!151 = !DILocation(line: 177, column: 17, scope: !148)
!152 = !DILocation(line: 177, column: 21, scope: !153)
!153 = !DILexicalBlockFile(scope: !148, file: !41, discriminator: 1)
!154 = !DILocation(line: 177, column: 20, scope: !153)
!155 = !DILocation(line: 177, column: 23, scope: !153)
!156 = !DILocation(line: 177, column: 6, scope: !153)
!157 = !DILocation(line: 178, column: 22, scope: !148)
!158 = !DILocation(line: 178, column: 25, scope: !148)
!159 = !DILocation(line: 178, column: 31, scope: !148)
!160 = !DILocation(line: 178, column: 36, scope: !148)
!161 = !DILocation(line: 178, column: 10, scope: !148)
!162 = !DILocation(line: 178, column: 3, scope: !148)
!163 = !DILocation(line: 180, column: 20, scope: !148)
!164 = !DILocation(line: 180, column: 23, scope: !148)
!165 = !DILocation(line: 180, column: 10, scope: !148)
!166 = !DILocation(line: 180, column: 3, scope: !148)
!167 = !DILocation(line: 181, column: 1, scope: !132)
!168 = distinct !DISubprogram(name: "tar_ret_errno", scope: !41, file: !41, line: 87, type: !169, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !109)
!169 = !DISubroutineType(types: !170)
!170 = !{!77, !95, !77}
!171 = !DILocalVariable(name: "err", arg: 1, scope: !168, file: !41, line: 87, type: !95)
!172 = !DILocation(line: 87, column: 19, scope: !168)
!173 = !DILocalVariable(name: "ret", arg: 2, scope: !168, file: !41, line: 87, type: !77)
!174 = !DILocation(line: 87, column: 34, scope: !168)
!175 = !DILocation(line: 89, column: 9, scope: !168)
!176 = !DILocation(line: 89, column: 3, scope: !168)
!177 = !DILocation(line: 89, column: 7, scope: !168)
!178 = !DILocation(line: 90, column: 9, scope: !168)
!179 = !DILocation(line: 90, column: 2, scope: !168)
!180 = distinct !DISubprogram(name: "tar_atosl", scope: !41, file: !41, line: 195, type: !181, isLocal: false, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !109)
!181 = !DISubroutineType(types: !182)
!182 = !{!135, !105, !107, !135, !135}
!183 = !DILocalVariable(name: "s", arg: 1, scope: !180, file: !41, line: 195, type: !105)
!184 = !DILocation(line: 195, column: 23, scope: !180)
!185 = !DILocalVariable(name: "size", arg: 2, scope: !180, file: !41, line: 195, type: !107)
!186 = !DILocation(line: 195, column: 33, scope: !180)
!187 = !DILocalVariable(name: "min", arg: 3, scope: !180, file: !41, line: 195, type: !135)
!188 = !DILocation(line: 195, column: 48, scope: !180)
!189 = !DILocalVariable(name: "max", arg: 4, scope: !180, file: !41, line: 195, type: !135)
!190 = !DILocation(line: 195, column: 62, scope: !180)
!191 = !DILocalVariable(name: "n", scope: !180, file: !41, line: 197, type: !135)
!192 = !DILocation(line: 197, column: 11, scope: !180)
!193 = !DILocation(line: 197, column: 24, scope: !180)
!194 = !DILocation(line: 197, column: 27, scope: !180)
!195 = !DILocation(line: 197, column: 15, scope: !180)
!196 = !DILocation(line: 199, column: 6, scope: !197)
!197 = distinct !DILexicalBlock(scope: !180, file: !41, line: 199, column: 6)
!198 = !DILocation(line: 199, column: 10, scope: !197)
!199 = !DILocation(line: 199, column: 8, scope: !197)
!200 = !DILocation(line: 199, column: 6, scope: !180)
!201 = !DILocation(line: 200, column: 10, scope: !197)
!202 = !DILocation(line: 200, column: 3, scope: !197)
!203 = !DILocation(line: 201, column: 6, scope: !204)
!204 = distinct !DILexicalBlock(scope: !180, file: !41, line: 201, column: 6)
!205 = !DILocation(line: 201, column: 10, scope: !204)
!206 = !DILocation(line: 201, column: 8, scope: !204)
!207 = !DILocation(line: 201, column: 6, scope: !180)
!208 = !DILocation(line: 202, column: 10, scope: !204)
!209 = !DILocation(line: 202, column: 3, scope: !204)
!210 = !DILocation(line: 204, column: 9, scope: !180)
!211 = !DILocation(line: 204, column: 2, scope: !180)
!212 = !DILocation(line: 205, column: 1, scope: !180)
!213 = distinct !DISubprogram(name: "tar_entry_update_from_system", scope: !41, file: !41, line: 426, type: !214, isLocal: false, isDefinition: true, scopeLine: 427, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !109)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !216}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tar_entry", file: !4, line: 71, size: 640, align: 64, elements: !218)
!218 = !{!219, !220, !221, !223, !224, !225, !226, !227}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !217, file: !4, line: 73, baseType: !3, size: 32, align: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !217, file: !4, line: 75, baseType: !11, size: 32, align: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !217, file: !4, line: 77, baseType: !222, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "linkname", scope: !217, file: !4, line: 79, baseType: !222, size: 64, align: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !217, file: !4, line: 81, baseType: !80, size: 64, align: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !217, file: !4, line: 83, baseType: !85, size: 64, align: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !217, file: !4, line: 85, baseType: !88, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !217, file: !4, line: 87, baseType: !228, size: 256, align: 64, offset: 384)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !229, line: 40, size: 256, align: 64, elements: !230)
!229 = !DIFile(filename: "../../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!230 = !{!231, !232, !233, !234, !235}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !228, file: !229, line: 41, baseType: !90, size: 32, align: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !228, file: !229, line: 42, baseType: !93, size: 32, align: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !228, file: !229, line: 43, baseType: !96, size: 32, align: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !228, file: !229, line: 47, baseType: !222, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !228, file: !229, line: 48, baseType: !222, size: 64, align: 64, offset: 192)
!236 = !DILocalVariable(name: "te", arg: 1, scope: !213, file: !41, line: 426, type: !216)
!237 = !DILocation(line: 426, column: 48, scope: !213)
!238 = !DILocalVariable(name: "passwd", scope: !213, file: !41, line: 428, type: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !241, line: 49, size: 384, align: 64, elements: !242)
!241 = !DIFile(filename: "/usr/include/pwd.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!242 = !{!243, !244, !245, !246, !247, !248, !249}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !240, file: !241, line: 51, baseType: !222, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !240, file: !241, line: 52, baseType: !222, size: 64, align: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !240, file: !241, line: 53, baseType: !91, size: 32, align: 32, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !240, file: !241, line: 54, baseType: !94, size: 32, align: 32, offset: 160)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !240, file: !241, line: 55, baseType: !222, size: 64, align: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !240, file: !241, line: 56, baseType: !222, size: 64, align: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !240, file: !241, line: 57, baseType: !222, size: 64, align: 64, offset: 320)
!250 = !DILocation(line: 428, column: 17, scope: !213)
!251 = !DILocalVariable(name: "group", scope: !213, file: !41, line: 429, type: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !254, line: 42, size: 256, align: 64, elements: !255)
!254 = !DIFile(filename: "/usr/include/grp.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!255 = !{!256, !257, !258, !259}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !253, file: !254, line: 44, baseType: !222, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !253, file: !254, line: 45, baseType: !222, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !253, file: !254, line: 46, baseType: !94, size: 32, align: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !253, file: !254, line: 47, baseType: !260, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!261 = !DILocation(line: 429, column: 16, scope: !213)
!262 = !DILocation(line: 431, column: 6, scope: !263)
!263 = distinct !DILexicalBlock(scope: !213, file: !41, line: 431, column: 6)
!264 = !DILocation(line: 431, column: 10, scope: !263)
!265 = !DILocation(line: 431, column: 15, scope: !263)
!266 = !DILocation(line: 431, column: 6, scope: !213)
!267 = !DILocation(line: 432, column: 21, scope: !268)
!268 = distinct !DILexicalBlock(scope: !263, file: !41, line: 431, column: 22)
!269 = !DILocation(line: 432, column: 25, scope: !268)
!270 = !DILocation(line: 432, column: 30, scope: !268)
!271 = !DILocation(line: 432, column: 12, scope: !268)
!272 = !DILocation(line: 432, column: 10, scope: !268)
!273 = !DILocation(line: 433, column: 7, scope: !274)
!274 = distinct !DILexicalBlock(scope: !268, file: !41, line: 433, column: 7)
!275 = !DILocation(line: 433, column: 7, scope: !268)
!276 = !DILocation(line: 434, column: 19, scope: !274)
!277 = !DILocation(line: 434, column: 27, scope: !274)
!278 = !DILocation(line: 434, column: 4, scope: !274)
!279 = !DILocation(line: 434, column: 8, scope: !274)
!280 = !DILocation(line: 434, column: 13, scope: !274)
!281 = !DILocation(line: 434, column: 17, scope: !274)
!282 = !DILocation(line: 435, column: 2, scope: !268)
!283 = !DILocation(line: 436, column: 6, scope: !284)
!284 = distinct !DILexicalBlock(scope: !213, file: !41, line: 436, column: 6)
!285 = !DILocation(line: 436, column: 10, scope: !284)
!286 = !DILocation(line: 436, column: 15, scope: !284)
!287 = !DILocation(line: 436, column: 6, scope: !213)
!288 = !DILocation(line: 437, column: 20, scope: !289)
!289 = distinct !DILexicalBlock(scope: !284, file: !41, line: 436, column: 22)
!290 = !DILocation(line: 437, column: 24, scope: !289)
!291 = !DILocation(line: 437, column: 29, scope: !289)
!292 = !DILocation(line: 437, column: 11, scope: !289)
!293 = !DILocation(line: 437, column: 9, scope: !289)
!294 = !DILocation(line: 438, column: 7, scope: !295)
!295 = distinct !DILexicalBlock(scope: !289, file: !41, line: 438, column: 7)
!296 = !DILocation(line: 438, column: 7, scope: !289)
!297 = !DILocation(line: 439, column: 19, scope: !295)
!298 = !DILocation(line: 439, column: 26, scope: !295)
!299 = !DILocation(line: 439, column: 4, scope: !295)
!300 = !DILocation(line: 439, column: 8, scope: !295)
!301 = !DILocation(line: 439, column: 13, scope: !295)
!302 = !DILocation(line: 439, column: 17, scope: !295)
!303 = !DILocation(line: 440, column: 2, scope: !289)
!304 = !DILocation(line: 441, column: 1, scope: !213)
!305 = distinct !DISubprogram(name: "tar_extractor", scope: !41, file: !41, line: 444, type: !306, isLocal: false, isDefinition: true, scopeLine: 445, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !109)
!306 = !DISubroutineType(types: !307)
!307 = !{!95, !308}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tar_archive", file: !4, line: 105, size: 320, align: 64, elements: !310)
!310 = !{!311, !317, !318, !337}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !309, file: !4, line: 107, baseType: !312, size: 128, align: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_error", file: !33, line: 42, size: 128, align: 64, elements: !313)
!313 = !{!314, !315, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !312, file: !33, line: 43, baseType: !32, size: 32, align: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "syserrno", scope: !312, file: !33, line: 45, baseType: !95, size: 32, align: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !312, file: !33, line: 46, baseType: !222, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !309, file: !4, line: 110, baseType: !3, size: 32, align: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !309, file: !4, line: 113, baseType: !319, size: 64, align: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tar_operations", file: !4, line: 95, size: 384, align: 64, elements: !322)
!322 = !{!323, !328, !333, !334, !335, !336}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !321, file: !4, line: 96, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "tar_read_func", file: !4, line: 92, baseType: !326)
!326 = !DISubroutineType(types: !327)
!327 = !{!95, !308, !222, !95}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "extract_file", scope: !321, file: !4, line: 98, baseType: !329, size: 64, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "tar_make_func", file: !4, line: 93, baseType: !331)
!331 = !DISubroutineType(types: !332)
!332 = !{!95, !308, !216}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !321, file: !4, line: 99, baseType: !329, size: 64, align: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !321, file: !4, line: 100, baseType: !329, size: 64, align: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !321, file: !4, line: 101, baseType: !329, size: 64, align: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !321, file: !4, line: 102, baseType: !329, size: 64, align: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !309, file: !4, line: 114, baseType: !338, size: 64, align: 64, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!339 = !DILocalVariable(name: "tar", arg: 1, scope: !305, file: !41, line: 444, type: !308)
!340 = !DILocation(line: 444, column: 35, scope: !305)
!341 = !DILocalVariable(name: "status", scope: !305, file: !41, line: 446, type: !95)
!342 = !DILocation(line: 446, column: 6, scope: !305)
!343 = !DILocalVariable(name: "buffer", scope: !305, file: !41, line: 447, type: !344)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 4096, align: 8, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 512)
!347 = !DILocation(line: 447, column: 7, scope: !305)
!348 = !DILocalVariable(name: "h", scope: !305, file: !41, line: 448, type: !217)
!349 = !DILocation(line: 448, column: 19, scope: !305)
!350 = !DILocalVariable(name: "next_long_name", scope: !305, file: !41, line: 450, type: !222)
!351 = !DILocation(line: 450, column: 8, scope: !305)
!352 = !DILocalVariable(name: "next_long_link", scope: !305, file: !41, line: 450, type: !222)
!353 = !DILocation(line: 450, column: 25, scope: !305)
!354 = !DILocalVariable(name: "symlink_head", scope: !305, file: !41, line: 451, type: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tar_symlink_entry", file: !41, line: 415, size: 704, align: 64, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !356, file: !41, line: 416, baseType: !355, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !356, file: !41, line: 417, baseType: !217, size: 640, align: 64, offset: 64)
!360 = !DILocation(line: 451, column: 28, scope: !305)
!361 = !DILocalVariable(name: "symlink_tail", scope: !305, file: !41, line: 451, type: !355)
!362 = !DILocation(line: 451, column: 43, scope: !305)
!363 = !DILocalVariable(name: "symlink_node", scope: !305, file: !41, line: 451, type: !355)
!364 = !DILocation(line: 451, column: 58, scope: !305)
!365 = !DILocation(line: 453, column: 17, scope: !305)
!366 = !DILocation(line: 454, column: 17, scope: !305)
!367 = !DILocation(line: 455, column: 30, scope: !305)
!368 = !DILocation(line: 455, column: 15, scope: !305)
!369 = !DILocation(line: 457, column: 4, scope: !305)
!370 = !DILocation(line: 457, column: 9, scope: !305)
!371 = !DILocation(line: 458, column: 4, scope: !305)
!372 = !DILocation(line: 458, column: 13, scope: !305)
!373 = !DILocation(line: 459, column: 4, scope: !305)
!374 = !DILocation(line: 459, column: 9, scope: !305)
!375 = !DILocation(line: 459, column: 15, scope: !305)
!376 = !DILocation(line: 460, column: 4, scope: !305)
!377 = !DILocation(line: 460, column: 9, scope: !305)
!378 = !DILocation(line: 460, column: 15, scope: !305)
!379 = !DILocation(line: 462, column: 2, scope: !305)
!380 = !DILocation(line: 462, column: 19, scope: !381)
!381 = !DILexicalBlockFile(scope: !305, file: !41, discriminator: 1)
!382 = !DILocation(line: 462, column: 24, scope: !381)
!383 = !DILocation(line: 462, column: 29, scope: !381)
!384 = !DILocation(line: 462, column: 34, scope: !381)
!385 = !DILocation(line: 462, column: 39, scope: !381)
!386 = !DILocation(line: 462, column: 17, scope: !381)
!387 = !DILocation(line: 462, column: 53, scope: !381)
!388 = !DILocation(line: 462, column: 2, scope: !381)
!389 = !DILocalVariable(name: "name_len", scope: !390, file: !41, line: 463, type: !95)
!390 = distinct !DILexicalBlock(scope: !305, file: !41, line: 462, column: 61)
!391 = !DILocation(line: 463, column: 7, scope: !390)
!392 = !DILocation(line: 465, column: 46, scope: !393)
!393 = distinct !DILexicalBlock(scope: !390, file: !41, line: 465, column: 7)
!394 = !DILocation(line: 465, column: 25, scope: !393)
!395 = !DILocation(line: 465, column: 59, scope: !393)
!396 = !DILocation(line: 465, column: 64, scope: !393)
!397 = !DILocation(line: 465, column: 7, scope: !393)
!398 = !DILocation(line: 465, column: 69, scope: !393)
!399 = !DILocation(line: 465, column: 7, scope: !390)
!400 = !DILocation(line: 466, column: 10, scope: !401)
!401 = distinct !DILexicalBlock(scope: !402, file: !41, line: 466, column: 8)
!402 = distinct !DILexicalBlock(scope: !393, file: !41, line: 465, column: 74)
!403 = !DILocation(line: 466, column: 8, scope: !401)
!404 = !DILocation(line: 466, column: 18, scope: !401)
!405 = !DILocation(line: 466, column: 8, scope: !402)
!406 = !DILocation(line: 468, column: 12, scope: !407)
!407 = distinct !DILexicalBlock(scope: !401, file: !41, line: 466, column: 27)
!408 = !DILocation(line: 469, column: 4, scope: !407)
!409 = !DILocation(line: 470, column: 12, scope: !410)
!410 = distinct !DILexicalBlock(scope: !401, file: !41, line: 469, column: 11)
!411 = !DILocation(line: 472, column: 4, scope: !402)
!412 = !DILocation(line: 473, column: 4, scope: !402)
!413 = !DILocation(line: 475, column: 9, scope: !414)
!414 = distinct !DILexicalBlock(scope: !390, file: !41, line: 475, column: 7)
!415 = !DILocation(line: 475, column: 14, scope: !414)
!416 = !DILocation(line: 475, column: 43, scope: !414)
!417 = !DILocation(line: 476, column: 9, scope: !414)
!418 = !DILocation(line: 476, column: 14, scope: !414)
!419 = !DILocation(line: 475, column: 7, scope: !420)
!420 = !DILexicalBlockFile(scope: !390, file: !41, discriminator: 1)
!421 = !DILocation(line: 477, column: 8, scope: !422)
!422 = distinct !DILexicalBlock(scope: !423, file: !41, line: 477, column: 8)
!423 = distinct !DILexicalBlock(scope: !414, file: !41, line: 476, column: 44)
