; ModuleID = './[inter]lib--dpkg--atomic-file.o.i'
source_filename = "./[inter]lib--dpkg--atomic-file.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.atomic_file = type { i32, i8*, i8*, %struct._IO_FILE* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [5 x i8] c"%s%s\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"-new\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"dpkg\00", align 1
@.str.4 = private unnamed_addr constant [35 x i8] c"unable to create new file '%.250s'\00", align 1
@.str.5 = private unnamed_addr constant [34 x i8] c"unable to write new file '%.250s'\00", align 1
@.str.6 = private unnamed_addr constant [34 x i8] c"unable to flush new file '%.250s'\00", align 1
@.str.7 = private unnamed_addr constant [33 x i8] c"unable to sync new file '%.250s'\00", align 1
@.str.8 = private unnamed_addr constant [34 x i8] c"unable to close new file '%.250s'\00", align 1
@.str.9 = private unnamed_addr constant [23 x i8] c"cannot remove '%.250s'\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13)
!1 = !DIFile(filename: "[inter]lib--dpkg--atomic-file.o.i", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!2 = !{!3, !7}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "atomic_file_flags", file: !4, line: 36, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../lib/dpkg/atomic-file.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!5 = !{!6}
!6 = !DIEnumerator(name: "ATOMIC_FILE_BACKUP", value: 1)
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 41, size: 32, align: 32, elements: !9)
!8 = !DIFile(filename: "../../lib/dpkg/ehandle.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!9 = !{!10, !11, !12}
!10 = !DIEnumerator(name: "ehflag_normaltidy", value: 1)
!11 = !DIEnumerator(name: "ehflag_bombout", value: 2)
!12 = !DIEnumerator(name: "ehflag_recursiveerror", value: 4)
!13 = !{!14}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!15 = !{i32 2, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!18 = distinct !DISubprogram(name: "atomic_file_new", scope: !19, file: !19, line: 39, type: !20, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !93)
!19 = !DIFile(filename: "atomic-file.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !91, !3}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atomic_file", file: !4, line: 40, size: 256, align: 64, elements: !24)
!24 = !{!25, !26, !29, !30}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !23, file: !4, line: 41, baseType: !3, size: 32, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !23, file: !4, line: 42, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "name_new", scope: !23, file: !4, line: 43, baseType: !27, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !23, file: !4, line: 44, baseType: !31, size: 64, align: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !33, line: 48, baseType: !34)
!33 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !35, line: 241, size: 1728, align: 64, elements: !36)
!35 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!36 = !{!37, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !58, !59, !60, !61, !65, !67, !69, !73, !76, !78, !79, !80, !81, !82, !86, !87}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !34, file: !35, line: 242, baseType: !38, size: 32, align: 32)
!38 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !34, file: !35, line: 247, baseType: !27, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !34, file: !35, line: 248, baseType: !27, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !34, file: !35, line: 249, baseType: !27, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !34, file: !35, line: 250, baseType: !27, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !34, file: !35, line: 251, baseType: !27, size: 64, align: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !34, file: !35, line: 252, baseType: !27, size: 64, align: 64, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !34, file: !35, line: 253, baseType: !27, size: 64, align: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !34, file: !35, line: 254, baseType: !27, size: 64, align: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !34, file: !35, line: 256, baseType: !27, size: 64, align: 64, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !34, file: !35, line: 257, baseType: !27, size: 64, align: 64, offset: 640)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !34, file: !35, line: 258, baseType: !27, size: 64, align: 64, offset: 704)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !34, file: !35, line: 260, baseType: !51, size: 64, align: 64, offset: 768)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !35, line: 156, size: 192, align: 64, elements: !53)
!53 = !{!54, !55, !57}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !52, file: !35, line: 157, baseType: !51, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !52, file: !35, line: 158, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !52, file: !35, line: 162, baseType: !38, size: 32, align: 32, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !34, file: !35, line: 262, baseType: !56, size: 64, align: 64, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !34, file: !35, line: 264, baseType: !38, size: 32, align: 32, offset: 896)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !34, file: !35, line: 268, baseType: !38, size: 32, align: 32, offset: 928)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !34, file: !35, line: 270, baseType: !62, size: 64, align: 64, offset: 960)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !63, line: 131, baseType: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!64 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !34, file: !35, line: 274, baseType: !66, size: 16, align: 16, offset: 1024)
!66 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !34, file: !35, line: 275, baseType: !68, size: 8, align: 8, offset: 1040)
!68 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !34, file: !35, line: 276, baseType: !70, size: 8, align: 8, offset: 1048)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8, align: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !34, file: !35, line: 280, baseType: !74, size: 64, align: 64, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !35, line: 150, baseType: null)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !34, file: !35, line: 289, baseType: !77, size: 64, align: 64, offset: 1152)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !63, line: 132, baseType: !64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !34, file: !35, line: 297, baseType: !14, size: 64, align: 64, offset: 1216)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !34, file: !35, line: 298, baseType: !14, size: 64, align: 64, offset: 1280)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !34, file: !35, line: 299, baseType: !14, size: 64, align: 64, offset: 1344)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !34, file: !35, line: 300, baseType: !14, size: 64, align: 64, offset: 1408)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !34, file: !35, line: 302, baseType: !83, size: 64, align: 64, offset: 1472)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !84, line: 216, baseType: !85)
!84 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!85 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !34, file: !35, line: 303, baseType: !38, size: 32, align: 32, offset: 1536)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !34, file: !35, line: 305, baseType: !88, size: 160, align: 8, offset: 1568)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 160, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 20)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!93 = !{}
!94 = !DILocalVariable(name: "filename", arg: 1, scope: !18, file: !19, line: 39, type: !91)
!95 = !DIExpression()
!96 = !DILocation(line: 39, column: 29, scope: !18)
!97 = !DILocalVariable(name: "flags", arg: 2, scope: !18, file: !19, line: 39, type: !3)
!98 = !DILocation(line: 39, column: 62, scope: !18)
!99 = !DILocalVariable(name: "file", scope: !18, file: !19, line: 41, type: !22)
!100 = !DILocation(line: 41, column: 22, scope: !18)
!101 = !DILocation(line: 43, column: 9, scope: !18)
!102 = !DILocation(line: 43, column: 7, scope: !18)
!103 = !DILocation(line: 44, column: 16, scope: !18)
!104 = !DILocation(line: 44, column: 2, scope: !18)
!105 = !DILocation(line: 44, column: 8, scope: !18)
!106 = !DILocation(line: 44, column: 14, scope: !18)
!107 = !DILocation(line: 45, column: 2, scope: !18)
!108 = !DILocation(line: 45, column: 8, scope: !18)
!109 = !DILocation(line: 45, column: 11, scope: !18)
!110 = !DILocation(line: 46, column: 24, scope: !18)
!111 = !DILocation(line: 46, column: 15, scope: !18)
!112 = !DILocation(line: 46, column: 2, scope: !18)
!113 = !DILocation(line: 46, column: 8, scope: !18)
!114 = !DILocation(line: 46, column: 13, scope: !18)
!115 = !DILocation(line: 47, column: 35, scope: !18)
!116 = !DILocation(line: 47, column: 19, scope: !18)
!117 = !DILocation(line: 47, column: 2, scope: !18)
!118 = !DILocation(line: 47, column: 8, scope: !18)
!119 = !DILocation(line: 47, column: 17, scope: !18)
!120 = !DILocation(line: 49, column: 9, scope: !18)
!121 = !DILocation(line: 49, column: 2, scope: !18)
!122 = distinct !DISubprogram(name: "atomic_file_open", scope: !19, file: !19, line: 53, type: !123, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !93)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !22}
!125 = !DILocalVariable(name: "file", arg: 1, scope: !122, file: !19, line: 53, type: !22)
!126 = !DILocation(line: 53, column: 38, scope: !122)
!127 = !DILocation(line: 55, column: 19, scope: !122)
!128 = !DILocation(line: 55, column: 25, scope: !122)
!129 = !DILocation(line: 55, column: 13, scope: !122)
!130 = !DILocation(line: 55, column: 2, scope: !122)
!131 = !DILocation(line: 55, column: 8, scope: !122)
!132 = !DILocation(line: 55, column: 11, scope: !122)
!133 = !DILocation(line: 56, column: 6, scope: !134)
!134 = distinct !DILexicalBlock(scope: !122, file: !19, line: 56, column: 6)
!135 = !DILocation(line: 56, column: 12, scope: !134)
!136 = !DILocation(line: 56, column: 15, scope: !134)
!137 = !DILocation(line: 56, column: 6, scope: !122)
!138 = !DILocation(line: 57, column: 10, scope: !134)
!139 = !DILocation(line: 58, column: 11, scope: !134)
!140 = !DILocation(line: 58, column: 17, scope: !134)
!141 = !DILocation(line: 57, column: 3, scope: !142)
!142 = !DILexicalBlockFile(scope: !134, file: !19, discriminator: 1)
!143 = !DILocation(line: 57, column: 3, scope: !134)
!144 = !DILocation(line: 59, column: 16, scope: !122)
!145 = !DILocation(line: 59, column: 22, scope: !122)
!146 = !DILocation(line: 59, column: 9, scope: !122)
!147 = !DILocation(line: 59, column: 2, scope: !148)
!148 = !DILexicalBlockFile(scope: !122, file: !19, discriminator: 1)
!149 = !DILocation(line: 61, column: 54, scope: !122)
!150 = !DILocation(line: 61, column: 60, scope: !122)
!151 = !DILocation(line: 61, column: 2, scope: !122)
!152 = !DILocation(line: 62, column: 1, scope: !122)
