; ModuleID = './[inter]lib--dpkg--fields.o.i'
source_filename = "./[inter]lib--dpkg--fields.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.namevalue = type { i8*, i32, i32 }
%struct.varbuf = type { i64, i64, i8* }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.2, i32 }
%struct.anon.2 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }
%struct.pkgbin = type { %struct.dependency*, i8, i32, %struct.dpkg_arch*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.dpkg_version, %struct.conffile*, %struct.arbitraryfield* }
%struct.conffile = type { %struct.conffile*, i8*, i8*, i8 }
%struct.arbitraryfield = type { %struct.arbitraryfield*, i8*, i8* }
%struct.perpackagestate = type opaque

!92 = !DIFile(filename: "../../lib/dpkg/parsedump.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!93 = !{!94, !95, !96, !97}
!94 = !DIEnumerator(name: "pdb_file_update", value: 0)
!95 = !DIEnumerator(name: "pdb_file_status", value: 1)
!96 = !DIEnumerator(name: "pdb_file_control", value: 2)
!97 = !DIEnumerator(name: "pdb_file_available", value: 3)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "parsedbflags", file: !4, line: 328, size: 32, align: 32, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!100 = !DIEnumerator(name: "pdb_single_stanza", value: 1)
!101 = !DIEnumerator(name: "pdb_recordavailable", value: 2)
!102 = !DIEnumerator(name: "pdb_rejectstatus", value: 4)
!103 = !DIEnumerator(name: "pdb_weakclassification", value: 8)
!104 = !DIEnumerator(name: "pdb_ignore_archives", value: 16)
!105 = !DIEnumerator(name: "pdb_ignoreolder", value: 32)
!106 = !DIEnumerator(name: "pdb_lax_version_parser", value: 64)
!107 = !DIEnumerator(name: "pdb_lax_stanza_parser", value: 512)
!108 = !DIEnumerator(name: "pdb_lax_parser", value: 576)
!109 = !DIEnumerator(name: "pdb_close_fd", value: 128)
!110 = !DIEnumerator(name: "pdb_dash_is_stdin", value: 256)
!111 = !DIEnumerator(name: "pdb_parse_status", value: 584)
!112 = !DIEnumerator(name: "pdb_parse_update", value: 585)
!113 = !DIEnumerator(name: "pdb_parse_available", value: 582)
!114 = !DIEnumerator(name: "pdb_parse_binary", value: 7)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_msg_type", file: !116, line: 36, size: 32, align: 32, elements: !117)
!116 = !DIFile(filename: "../../lib/dpkg/error.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!117 = !{!118, !119, !120}
!118 = !DIEnumerator(name: "DPKG_MSG_NONE", value: 0)
!119 = !DIEnumerator(name: "DPKG_MSG_WARN", value: 1)
!120 = !DIEnumerator(name: "DPKG_MSG_ERROR", value: 2)
!121 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fwriteflags", file: !92, line: 112, size: 32, align: 32, elements: !122)
!122 = !{!123}
!123 = !DIEnumerator(name: "fw_printheader", value: 1)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "parse_nv_flags", file: !125, line: 46, size: 32, align: 32, elements: !126)
!125 = !DIFile(filename: "fields.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!126 = !{!127, !128, !129}
!127 = !DIEnumerator(name: "PARSE_NV_LAST", value: 0)
!128 = !DIEnumerator(name: "PARSE_NV_NEXT", value: 1)
!129 = !DIEnumerator(name: "PARSE_NV_FALLBACK", value: 2)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_ctype_bit", file: !131, line: 32, size: 32, align: 32, elements: !132)
!131 = !DIFile(filename: "../../lib/dpkg/c-ctype.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140}
!133 = !DIEnumerator(name: "C_CTYPE_BLANK", value: 1)
!134 = !DIEnumerator(name: "C_CTYPE_WHITE", value: 2)
!135 = !DIEnumerator(name: "C_CTYPE_SPACE", value: 4)
!136 = !DIEnumerator(name: "C_CTYPE_UPPER", value: 8)
!137 = !DIEnumerator(name: "C_CTYPE_LOWER", value: 16)
!138 = !DIEnumerator(name: "C_CTYPE_DIGIT", value: 32)
!139 = !DIEnumerator(name: "C_CTYPE_ALPHA", value: 24)
!140 = !DIEnumerator(name: "C_CTYPE_ALNUM", value: 56)
!141 = !{!142, !143, !147, !150, !152, !154, !155}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !148, line: 122, baseType: !149)
!148 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!149 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!156 = !{!157, !411, !413, !414, !415}
!157 = distinct !DIGlobalVariable(name: "obsolete_str", scope: !158, file: !125, line: 348, type: !408, isLocal: true, isDefinition: true, variable: [9 x i8]* @f_conffiles.obsolete_str)
!158 = distinct !DISubprogram(name: "f_conffiles", scope: !125, file: !125, line: 344, type: !159, isLocal: false, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !407)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !161, !331, !360, !144, !379}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !163)
!163 = !{!164, !211, !212, !213, !214, !215, !216, !217, !218, !219, !249, !250, !253, !262, !278, !279, !285, !353, !358, !359}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !162, file: !4, line: 196, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !167)
!167 = !{!168, !169, !170, !171, !210}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !166, file: !4, line: 243, baseType: !165, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !166, file: !4, line: 244, baseType: !144, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !166, file: !4, line: 245, baseType: !162, size: 3072, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !166, file: !4, line: 249, baseType: !172, size: 128, align: 64, offset: 3200)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !166, file: !4, line: 246, size: 128, align: 64, elements: !173)
!173 = !{!174, !209}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !172, file: !4, line: 247, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !177)
!177 = !{!178, !186, !187, !188, !189, !190, !199, !206, !207, !208}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !176, file: !4, line: 64, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !181)
!181 = !{!182, !183, !184, !185}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !180, file: !4, line: 57, baseType: !161, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !180, file: !4, line: 58, baseType: !179, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !180, file: !4, line: 59, baseType: !175, size: 64, align: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !180, file: !4, line: 60, baseType: !3, size: 32, align: 32, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !176, file: !4, line: 65, baseType: !165, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !176, file: !4, line: 66, baseType: !175, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !176, file: !4, line: 66, baseType: !175, size: 64, align: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !176, file: !4, line: 66, baseType: !175, size: 64, align: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !176, file: !4, line: 67, baseType: !191, size: 64, align: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !16, line: 48, size: 192, align: 64, elements: !194)
!194 = !{!195, !197, !198}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !193, file: !16, line: 49, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !193, file: !16, line: 50, baseType: !144, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !193, file: !16, line: 51, baseType: !15, size: 32, align: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !176, file: !4, line: 68, baseType: !200, size: 192, align: 64, offset: 384)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !27, line: 42, size: 192, align: 64, elements: !201)
!201 = !{!202, !204, !205}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !200, file: !27, line: 44, baseType: !203, size: 32, align: 32)
!203 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !200, file: !27, line: 46, baseType: !144, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !200, file: !27, line: 48, baseType: !144, size: 64, align: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !176, file: !4, line: 69, baseType: !26, size: 32, align: 32, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !176, file: !4, line: 70, baseType: !153, size: 8, align: 8, offset: 608)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !176, file: !4, line: 71, baseType: !153, size: 8, align: 8, offset: 616)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !172, file: !4, line: 248, baseType: !175, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !166, file: !4, line: 250, baseType: !155, size: 32, align: 32, offset: 3328)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !162, file: !4, line: 197, baseType: !161, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !162, file: !4, line: 199, baseType: !35, size: 32, align: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !162, file: !4, line: 201, baseType: !43, size: 32, align: 32, offset: 160)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !162, file: !4, line: 202, baseType: !47, size: 32, align: 32, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !162, file: !4, line: 203, baseType: !57, size: 32, align: 32, offset: 224)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !162, file: !4, line: 204, baseType: !144, size: 64, align: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !162, file: !4, line: 205, baseType: !144, size: 64, align: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !162, file: !4, line: 206, baseType: !200, size: 192, align: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !162, file: !4, line: 207, baseType: !220, size: 960, align: 64, offset: 576)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !242}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !220, file: !4, line: 108, baseType: !179, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !220, file: !4, line: 110, baseType: !153, size: 8, align: 8, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !220, file: !4, line: 111, baseType: !67, size: 32, align: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !220, file: !4, line: 112, baseType: !191, size: 64, align: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !220, file: !4, line: 115, baseType: !144, size: 64, align: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !220, file: !4, line: 116, baseType: !144, size: 64, align: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !220, file: !4, line: 117, baseType: !144, size: 64, align: 64, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !220, file: !4, line: 118, baseType: !144, size: 64, align: 64, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !220, file: !4, line: 119, baseType: !144, size: 64, align: 64, offset: 448)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !220, file: !4, line: 120, baseType: !144, size: 64, align: 64, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !220, file: !4, line: 121, baseType: !144, size: 64, align: 64, offset: 576)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !220, file: !4, line: 122, baseType: !200, size: 192, align: 64, offset: 640)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !220, file: !4, line: 123, baseType: !235, size: 64, align: 64, offset: 832)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !237)
!237 = !{!238, !239, !240, !241}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !4, line: 81, baseType: !235, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !4, line: 82, baseType: !144, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !236, file: !4, line: 83, baseType: !144, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !236, file: !4, line: 84, baseType: !153, size: 8, align: 8, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !220, file: !4, line: 124, baseType: !243, size: 64, align: 64, offset: 896)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !245)
!245 = !{!246, !247, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !4, line: 75, baseType: !243, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !244, file: !4, line: 76, baseType: !144, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !244, file: !4, line: 77, baseType: !144, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !162, file: !4, line: 208, baseType: !220, size: 960, align: 64, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !162, file: !4, line: 209, baseType: !251, size: 64, align: 64, offset: 2496)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !4, line: 151, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !162, file: !4, line: 211, baseType: !254, size: 64, align: 64, offset: 2560)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !256)
!256 = !{!257, !258, !259, !260, !261}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !255, file: !4, line: 88, baseType: !254, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !255, file: !4, line: 89, baseType: !144, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !255, file: !4, line: 90, baseType: !144, size: 64, align: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !255, file: !4, line: 91, baseType: !144, size: 64, align: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !255, file: !4, line: 92, baseType: !144, size: 64, align: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !162, file: !4, line: 216, baseType: !263, size: 128, align: 64, offset: 2624)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !162, file: !4, line: 213, size: 128, align: 64, elements: !264)
!264 = !{!265, !277}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !263, file: !4, line: 215, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !268)
!268 = !{!269, !270, !271, !272}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !267, file: !4, line: 143, baseType: !161, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !267, file: !4, line: 143, baseType: !161, size: 64, align: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !267, file: !4, line: 144, baseType: !266, size: 64, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !267, file: !4, line: 147, baseType: !273, size: 128, align: 64, offset: 192)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !267, file: !4, line: 145, size: 128, align: 64, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !273, file: !4, line: 146, baseType: !266, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !273, file: !4, line: 146, baseType: !266, size: 64, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !263, file: !4, line: 215, baseType: !266, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !162, file: !4, line: 219, baseType: !266, size: 64, align: 64, offset: 2752)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !162, file: !4, line: 220, baseType: !280, size: 64, align: 64, offset: 2816)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !281, file: !4, line: 135, baseType: !280, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !281, file: !4, line: 136, baseType: !144, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !162, file: !4, line: 231, baseType: !286, size: 64, align: 64, offset: 2880)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !79, line: 122, size: 128, align: 64, elements: !288)
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !79, line: 123, baseType: !286, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "namenode", scope: !287, file: !79, line: 124, baseType: !291, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode", file: !79, line: 90, size: 640, align: 64, elements: !293)
!293 = !{!294, !295, !296, !299, !307, !325, !340, !341, !342, !343}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !292, file: !79, line: 91, baseType: !291, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !292, file: !79, line: 92, baseType: !144, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "packages", scope: !292, file: !79, line: 93, baseType: !297, size: 64, align: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_list", file: !79, line: 93, flags: DIFlagFwdDecl)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "divert", scope: !292, file: !79, line: 94, baseType: !300, size: 64, align: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_diversion", file: !79, line: 151, size: 256, align: 64, elements: !302)
!302 = !{!303, !304, !305, !306}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "useinstead", scope: !301, file: !79, line: 152, baseType: !291, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "camefrom", scope: !301, file: !79, line: 153, baseType: !291, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pkgset", scope: !301, file: !79, line: 154, baseType: !165, size: 64, align: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !301, file: !79, line: 157, baseType: !300, size: 64, align: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "statoverride", scope: !292, file: !79, line: 101, baseType: !308, size: 64, align: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !310, line: 40, size: 256, align: 64, elements: !311)
!310 = !DIFile(filename: "../../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!311 = !{!312, !317, !320, !323, !324}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !309, file: !310, line: 41, baseType: !313, size: 32, align: 32)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !314, line: 80, baseType: !315)
!314 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !316, line: 125, baseType: !203)
!316 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!317 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !309, file: !310, line: 42, baseType: !318, size: 32, align: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !314, line: 65, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !316, line: 126, baseType: !203)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !309, file: !310, line: 43, baseType: !321, size: 32, align: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !314, line: 70, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !316, line: 129, baseType: !203)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !309, file: !310, line: 47, baseType: !151, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !309, file: !310, line: 48, baseType: !151, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "trig_interested", scope: !292, file: !79, line: 103, baseType: !326, size: 64, align: 64, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigfileint", file: !74, line: 54, size: 448, align: 64, elements: !328)
!328 = !{!329, !330, !332, !333, !334, !335}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !327, file: !74, line: 55, baseType: !161, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pkgbin", scope: !327, file: !74, line: 56, baseType: !331, size: 64, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "fnn", scope: !327, file: !74, line: 57, baseType: !291, size: 64, align: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !327, file: !74, line: 58, baseType: !73, size: 32, align: 32, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "samefile_next", scope: !327, file: !74, line: 59, baseType: !326, size: 64, align: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "inoverall", scope: !327, file: !74, line: 62, baseType: !336, size: 128, align: 64, offset: 320)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !327, file: !74, line: 60, size: 128, align: 64, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !336, file: !74, line: 61, baseType: !326, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !336, file: !74, line: 61, baseType: !326, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !292, file: !79, line: 111, baseType: !78, size: 32, align: 32, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "oldhash", scope: !292, file: !79, line: 114, baseType: !144, size: 64, align: 64, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "newhash", scope: !292, file: !79, line: 117, baseType: !144, size: 64, align: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "file_ondisk_id", scope: !292, file: !79, line: 119, baseType: !344, size: 64, align: 64, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_ondisk_id", file: !79, line: 85, size: 128, align: 64, elements: !346)
!346 = !{!347, !350}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "id_dev", scope: !345, file: !79, line: 86, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !314, line: 60, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !316, line: 124, baseType: !149)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "id_ino", scope: !345, file: !79, line: 87, baseType: !351, size: 64, align: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !314, line: 48, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !316, line: 127, baseType: !149)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !162, file: !4, line: 232, baseType: !354, size: 64, align: 64, offset: 2944)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !355, line: 90, baseType: !356)
!355 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !316, line: 131, baseType: !357)
!357 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !162, file: !4, line: 233, baseType: !153, size: 8, align: 8, offset: 3008)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !162, file: !4, line: 236, baseType: !153, size: 8, align: 8, offset: 3016)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parsedb_state", file: !92, line: 48, size: 640, align: 64, elements: !362)
!362 = !{!363, !364, !365, !371, !372, !373, !374, !375, !376, !377, !378}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !361, file: !92, line: 49, baseType: !91, size: 32, align: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !361, file: !92, line: 50, baseType: !98, size: 32, align: 32, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !361, file: !92, line: 51, baseType: !366, size: 128, align: 64, offset: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_error", file: !116, line: 42, size: 128, align: 64, elements: !367)
!367 = !{!368, !369, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !366, file: !116, line: 43, baseType: !115, size: 32, align: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "syserrno", scope: !366, file: !116, line: 45, baseType: !155, size: 32, align: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !366, file: !116, line: 46, baseType: !151, size: 64, align: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !361, file: !92, line: 52, baseType: !161, size: 64, align: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pkgbin", scope: !361, file: !92, line: 53, baseType: !331, size: 64, align: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !361, file: !92, line: 54, baseType: !151, size: 64, align: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dataptr", scope: !361, file: !92, line: 55, baseType: !151, size: 64, align: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "endptr", scope: !361, file: !92, line: 56, baseType: !151, size: 64, align: 64, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !361, file: !92, line: 57, baseType: !144, size: 64, align: 64, offset: 512)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !361, file: !92, line: 58, baseType: !155, size: 32, align: 32, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "lno", scope: !361, file: !92, line: 59, baseType: !155, size: 32, align: 32, offset: 608)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fieldinfo", file: !92, line: 133, size: 320, align: 64, elements: !382)
!382 = !{!383, !384, !387, !390, !406}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !381, file: !92, line: 134, baseType: !144, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "namelen", scope: !381, file: !92, line: 135, baseType: !385, size: 64, align: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !386, line: 216, baseType: !149)
!386 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rcall", scope: !381, file: !92, line: 136, baseType: !388, size: 64, align: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "freadfunction", file: !92, line: 97, baseType: !159)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "wcall", scope: !381, file: !92, line: 137, baseType: !391, size: 64, align: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "fwritefunction", file: !92, line: 117, baseType: !393)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !395, !402, !404, !121, !379}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !397, line: 55, size: 192, align: 64, elements: !398)
!397 = !DIFile(filename: "../../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!398 = !{!399, !400, !401}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !396, file: !397, line: 56, baseType: !385, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !396, file: !397, line: 56, baseType: !385, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !396, file: !397, line: 57, baseType: !151, size: 64, align: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !381, file: !92, line: 138, baseType: !385, size: 64, align: 64, offset: 256)
!407 = !{}
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 72, align: 8, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 9)
!411 = distinct !DIGlobalVariable(name: "depname", scope: !412, file: !125, line: 406, type: !396, isLocal: true, isDefinition: true, variable: %struct.varbuf* @f_dependency.depname)
!412 = distinct !DISubprogram(name: "f_dependency", scope: !125, file: !125, line: 398, type: !159, isLocal: false, isDefinition: true, scopeLine: 401, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !407)
!413 = distinct !DIGlobalVariable(name: "version", scope: !412, file: !125, line: 406, type: !396, isLocal: true, isDefinition: true, variable: %struct.varbuf* @f_dependency.version)
!414 = distinct !DIGlobalVariable(name: "arch", scope: !412, file: !125, line: 470, type: !396, isLocal: true, isDefinition: true, variable: %struct.varbuf* @f_dependency.arch)
!415 = distinct !DIGlobalVariable(name: "word", scope: !416, file: !125, line: 627, type: !396, isLocal: true, isDefinition: true, variable: %struct.varbuf* @scan_word.word)
!416 = distinct !DISubprogram(name: "scan_word", scope: !125, file: !125, line: 625, type: !417, isLocal: true, isDefinition: true, scopeLine: 626, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !407)
!417 = !DISubroutineType(types: !418)
!418 = !{!144, !143}
!419 = !{i32 2, !"Dwarf Version", i32 4}
!420 = !{i32 2, !"Debug Info Version", i32 3}
!421 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!422 = distinct !DISubprogram(name: "f_name", scope: !125, file: !125, line: 100, type: !159, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !407)
!423 = !DILocalVariable(name: "pkg", arg: 1, scope: !422, file: !125, line: 100, type: !161)
!424 = !DIExpression()
!425 = !DILocation(line: 100, column: 24, scope: !422)
!426 = !DILocalVariable(name: "pkgbin", arg: 2, scope: !422, file: !125, line: 100, type: !331)
!427 = !DILocation(line: 100, column: 44, scope: !422)
!428 = !DILocalVariable(name: "ps", arg: 3, scope: !422, file: !125, line: 101, type: !360)
!429 = !DILocation(line: 101, column: 30, scope: !422)
!430 = !DILocalVariable(name: "value", arg: 4, scope: !422, file: !125, line: 102, type: !144)
!431 = !DILocation(line: 102, column: 20, scope: !422)
!432 = !DILocalVariable(name: "fip", arg: 5, scope: !422, file: !125, line: 102, type: !379)
!433 = !DILocation(line: 102, column: 51, scope: !422)
!434 = !DILocalVariable(name: "e", scope: !422, file: !125, line: 104, type: !144)
!435 = !DILocation(line: 104, column: 15, scope: !422)
!436 = !DILocation(line: 106, column: 27, scope: !422)
!437 = !DILocation(line: 106, column: 7, scope: !422)
!438 = !DILocation(line: 106, column: 5, scope: !422)
!439 = !DILocation(line: 107, column: 7, scope: !440)
!440 = distinct !DILexicalBlock(scope: !422, file: !125, line: 107, column: 7)
!441 = !DILocation(line: 107, column: 9, scope: !440)
!442 = !DILocation(line: 107, column: 7, scope: !422)
!443 = !DILocation(line: 108, column: 17, scope: !440)
!444 = !DILocation(line: 108, column: 20, scope: !440)
!445 = !DILocation(line: 108, column: 65, scope: !440)
!446 = !DILocation(line: 108, column: 70, scope: !440)
!447 = !DILocation(line: 108, column: 76, scope: !440)
!448 = !DILocation(line: 108, column: 5, scope: !449)
!449 = !DILexicalBlockFile(scope: !440, file: !125, discriminator: 1)
!450 = !DILocation(line: 108, column: 5, scope: !440)
!451 = !DILocation(line: 110, column: 38, scope: !422)
!452 = !DILocation(line: 110, column: 20, scope: !422)
!453 = !DILocation(line: 110, column: 46, scope: !422)
!454 = !DILocation(line: 110, column: 3, scope: !422)
!455 = !DILocation(line: 110, column: 8, scope: !422)
!456 = !DILocation(line: 110, column: 13, scope: !422)
!457 = !DILocation(line: 110, column: 18, scope: !422)
!458 = !DILocation(line: 111, column: 1, scope: !422)
!459 = distinct !DISubprogram(name: "f_archives", scope: !125, file: !125, line: 114, type: !159, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !407)
!460 = !DILocalVariable(name: "pkg", arg: 1, scope: !459, file: !125, line: 114, type: !161)
!461 = !DILocation(line: 114, column: 28, scope: !459)
!462 = !DILocalVariable(name: "pkgbin", arg: 2, scope: !459, file: !125, line: 114, type: !331)
!463 = !DILocation(line: 114, column: 48, scope: !459)
!464 = !DILocalVariable(name: "ps", arg: 3, scope: !459, file: !125, line: 115, type: !360)
!465 = !DILocation(line: 115, column: 34, scope: !459)
!466 = !DILocalVariable(name: "value", arg: 4, scope: !459, file: !125, line: 116, type: !144)
!467 = !DILocation(line: 116, column: 24, scope: !459)
!468 = !DILocalVariable(name: "fip", arg: 5, scope: !459, file: !125, line: 116, type: !379)
!469 = !DILocation(line: 116, column: 55, scope: !459)
!470 = !DILocalVariable(name: "fdp", scope: !459, file: !125, line: 118, type: !254)
!471 = !DILocation(line: 118, column: 26, scope: !459)
!472 = !DILocalVariable(name: "fdpp", scope: !459, file: !125, line: 118, type: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!474 = !DILocation(line: 118, column: 33, scope: !459)
!475 = !DILocalVariable(name: "cpos", scope: !459, file: !125, line: 119, type: !151)
!476 = !DILocation(line: 119, column: 9, scope: !459)
!477 = !DILocalVariable(name: "space", scope: !459, file: !125, line: 119, type: !151)
!478 = !DILocation(line: 119, column: 16, scope: !459)
!479 = !DILocalVariable(name: "allowextend", scope: !459, file: !125, line: 120, type: !155)
!480 = !DILocation(line: 120, column: 7, scope: !459)
!481 = !DILocation(line: 122, column: 9, scope: !482)
!482 = distinct !DILexicalBlock(scope: !459, file: !125, line: 122, column: 7)
!483 = !DILocation(line: 122, column: 8, scope: !482)
!484 = !DILocation(line: 122, column: 7, scope: !459)
!485 = !DILocation(line: 123, column: 17, scope: !482)
!486 = !DILocation(line: 123, column: 20, scope: !482)
!487 = !DILocation(line: 123, column: 59, scope: !482)
!488 = !DILocation(line: 123, column: 64, scope: !482)
!489 = !DILocation(line: 123, column: 5, scope: !490)
!490 = !DILexicalBlockFile(scope: !482, file: !125, discriminator: 1)
!491 = !DILocation(line: 123, column: 5, scope: !482)
!492 = !DILocation(line: 124, column: 9, scope: !493)
!493 = distinct !DILexicalBlock(scope: !459, file: !125, line: 124, column: 7)
!494 = !DILocation(line: 124, column: 13, scope: !493)
!495 = !DILocation(line: 124, column: 19, scope: !493)
!496 = !DILocation(line: 124, column: 7, scope: !459)
!497 = !DILocation(line: 125, column: 17, scope: !493)
!498 = !DILocation(line: 126, column: 16, scope: !493)
!499 = !DILocation(line: 127, column: 16, scope: !493)
!500 = !DILocation(line: 127, column: 21, scope: !493)
!501 = !DILocation(line: 125, column: 5, scope: !493)
!502 = !DILocation(line: 128, column: 18, scope: !459)
!503 = !DILocation(line: 128, column: 23, scope: !459)
!504 = !DILocation(line: 128, column: 17, scope: !459)
!505 = !DILocation(line: 128, column: 15, scope: !459)
!506 = !DILocation(line: 129, column: 11, scope: !459)
!507 = !DILocation(line: 129, column: 16, scope: !459)
!508 = !DILocation(line: 129, column: 8, scope: !459)
!509 = !DILocation(line: 130, column: 19, scope: !459)
!510 = !DILocation(line: 130, column: 9, scope: !459)
!511 = !DILocation(line: 130, column: 7, scope: !459)
!512 = !DILocation(line: 131, column: 3, scope: !459)
!513 = !DILocation(line: 131, column: 11, scope: !514)
!514 = !DILexicalBlockFile(scope: !459, file: !125, discriminator: 1)
!515 = !DILocation(line: 131, column: 10, scope: !514)
!516 = !DILocation(line: 131, column: 3, scope: !514)
!517 = !DILocation(line: 132, column: 13, scope: !518)
!518 = distinct !DILexicalBlock(scope: !459, file: !125, line: 131, column: 17)
!519 = !DILocation(line: 132, column: 11, scope: !518)
!520 = !DILocation(line: 133, column: 5, scope: !518)
!521 = !DILocation(line: 133, column: 13, scope: !522)
!522 = !DILexicalBlockFile(scope: !518, file: !125, discriminator: 1)
!523 = !DILocation(line: 133, column: 12, scope: !522)
!524 = !DILocation(line: 133, column: 19, scope: !522)
!525 = !DILocation(line: 133, column: 34, scope: !526)
!526 = !DILexicalBlockFile(scope: !518, file: !125, discriminator: 2)
!527 = !DILocation(line: 133, column: 33, scope: !526)
!528 = !DILocation(line: 133, column: 23, scope: !526)
!529 = !DILocation(line: 133, column: 22, scope: !526)
!530 = !DILocation(line: 133, column: 5, scope: !531)
!531 = !DILexicalBlockFile(scope: !518, file: !125, discriminator: 3)
!532 = !DILocation(line: 134, column: 12, scope: !518)
!533 = !DILocation(line: 133, column: 5, scope: !534)
!534 = !DILexicalBlockFile(scope: !518, file: !125, discriminator: 4)
!535 = distinct !{!535, !520}
!536 = !DILocation(line: 135, column: 10, scope: !537)
!537 = distinct !DILexicalBlock(scope: !518, file: !125, line: 135, column: 9)
!538 = !DILocation(line: 135, column: 9, scope: !537)
!539 = !DILocation(line: 135, column: 9, scope: !518)
!540 = !DILocation(line: 136, column: 13, scope: !537)
!541 = !DILocation(line: 136, column: 16, scope: !537)
!542 = !DILocation(line: 136, column: 7, scope: !537)
!543 = !DILocation(line: 137, column: 11, scope: !518)
!544 = !DILocation(line: 137, column: 10, scope: !518)
!545 = !DILocation(line: 137, column: 8, scope: !518)
!546 = !DILocation(line: 138, column: 10, scope: !547)
!547 = distinct !DILexicalBlock(scope: !518, file: !125, line: 138, column: 9)
!548 = !DILocation(line: 138, column: 9, scope: !518)
!549 = !DILocation(line: 139, column: 12, scope: !550)
!550 = distinct !DILexicalBlock(scope: !551, file: !125, line: 139, column: 11)
!551 = distinct !DILexicalBlock(scope: !547, file: !125, line: 138, column: 15)
!552 = !DILocation(line: 139, column: 11, scope: !551)
!553 = !DILocation(line: 140, column: 21, scope: !550)
!554 = !DILocation(line: 141, column: 20, scope: !550)
!555 = !DILocation(line: 142, column: 47, scope: !550)
!556 = !DILocation(line: 142, column: 52, scope: !550)
!557 = !DILocation(line: 140, column: 9, scope: !550)
!558 = !DILocation(line: 143, column: 13, scope: !551)
!559 = !DILocation(line: 143, column: 11, scope: !551)
!560 = !DILocation(line: 144, column: 7, scope: !551)
!561 = !DILocation(line: 144, column: 12, scope: !551)
!562 = !DILocation(line: 144, column: 16, scope: !551)
!563 = !DILocation(line: 145, column: 45, scope: !551)
!564 = !DILocation(line: 145, column: 50, scope: !551)
!565 = !DILocation(line: 145, column: 56, scope: !551)
!566 = !DILocation(line: 145, column: 34, scope: !551)
!567 = !DILocation(line: 145, column: 39, scope: !551)
!568 = !DILocation(line: 145, column: 43, scope: !551)
!569 = !DILocation(line: 145, column: 18, scope: !551)
!570 = !DILocation(line: 145, column: 23, scope: !551)
!571 = !DILocation(line: 145, column: 32, scope: !551)
!572 = !DILocation(line: 145, column: 7, scope: !551)
!573 = !DILocation(line: 145, column: 12, scope: !551)
!574 = !DILocation(line: 145, column: 16, scope: !551)
!575 = !DILocation(line: 146, column: 14, scope: !551)
!576 = !DILocation(line: 146, column: 8, scope: !551)
!577 = !DILocation(line: 146, column: 12, scope: !551)
!578 = !DILocation(line: 147, column: 5, scope: !551)
!579 = !DILocation(line: 148, column: 62, scope: !518)
!580 = !DILocation(line: 148, column: 36, scope: !518)
!581 = !DILocation(line: 148, column: 24, scope: !518)
!582 = !DILocation(line: 148, column: 44, scope: !518)
!583 = !DILocation(line: 148, column: 49, scope: !518)
!584 = !DILocation(line: 148, column: 41, scope: !518)
!585 = !DILocation(line: 148, column: 7, scope: !518)
!586 = !DILocation(line: 148, column: 60, scope: !518)
!587 = !DILocation(line: 149, column: 12, scope: !518)
!588 = !DILocation(line: 149, column: 17, scope: !518)
!589 = !DILocation(line: 149, column: 9, scope: !518)
!590 = !DILocation(line: 150, column: 5, scope: !518)
!591 = !DILocation(line: 150, column: 13, scope: !522)
!592 = !DILocation(line: 150, column: 12, scope: !522)
!593 = !DILocation(line: 150, column: 19, scope: !522)
!594 = !DILocation(line: 150, column: 33, scope: !526)
!595 = !DILocation(line: 150, column: 32, scope: !526)
!596 = !DILocation(line: 150, column: 22, scope: !526)
!597 = !DILocation(line: 150, column: 5, scope: !531)
!598 = !DILocation(line: 151, column: 12, scope: !518)
!599 = !DILocation(line: 150, column: 5, scope: !534)
!600 = distinct !{!600, !590}
!601 = !DILocation(line: 152, column: 11, scope: !518)
!602 = !DILocation(line: 152, column: 9, scope: !518)
!603 = !DILocation(line: 131, column: 3, scope: !604)
!604 = !DILexicalBlockFile(scope: !459, file: !125, discriminator: 2)
!605 = distinct !{!605, !512}
!606 = !DILocation(line: 154, column: 8, scope: !607)
!607 = distinct !DILexicalBlock(scope: !459, file: !125, line: 154, column: 7)
!608 = !DILocation(line: 154, column: 7, scope: !607)
!609 = !DILocation(line: 154, column: 7, scope: !459)
!610 = !DILocation(line: 155, column: 17, scope: !607)
!611 = !DILocation(line: 156, column: 16, scope: !607)
!612 = !DILocation(line: 157, column: 43, scope: !607)
!613 = !DILocation(line: 157, column: 48, scope: !607)
!614 = !DILocation(line: 155, column: 5, scope: !607)
!615 = !DILocation(line: 158, column: 1, scope: !459)
!616 = distinct !DISubprogram(name: "c_isspace", scope: !131, file: !131, line: 69, type: !617, isLocal: true, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !407)
!617 = !DISubroutineType(types: !618)
!618 = !{!153, !155}
!619 = !DILocalVariable(name: "c", arg: 1, scope: !616, file: !131, line: 69, type: !155)
!620 = !DILocation(line: 69, column: 15, scope: !616)
!621 = !DILocation(line: 71, column: 18, scope: !616)
!622 = !DILocation(line: 71, column: 9, scope: !616)
!623 = !DILocation(line: 71, column: 2, scope: !616)
!624 = distinct !DISubprogram(name: "f_charfield", scope: !125, file: !125, line: 161, type: !159, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !407)
!625 = !DILocalVariable(name: "pkg", arg: 1, scope: !624, file: !125, line: 161, type: !161)
!626 = !DILocation(line: 161, column: 29, scope: !624)
!627 = !DILocalVariable(name: "pkgbin", arg: 2, scope: !624, file: !125, line: 161, type: !331)
!628 = !DILocation(line: 161, column: 49, scope: !624)
!629 = !DILocalVariable(name: "ps", arg: 3, scope: !624, file: !125, line: 162, type: !360)
!630 = !DILocation(line: 162, column: 35, scope: !624)
!631 = !DILocalVariable(name: "value", arg: 4, scope: !624, file: !125, line: 163, type: !144)
!632 = !DILocation(line: 163, column: 25, scope: !624)
!633 = !DILocalVariable(name: "fip", arg: 5, scope: !624, file: !125, line: 163, type: !379)
!634 = !DILocation(line: 163, column: 56, scope: !624)
!635 = !DILocation(line: 165, column: 8, scope: !636)
!636 = distinct !DILexicalBlock(scope: !624, file: !125, line: 165, column: 7)
!637 = !DILocation(line: 165, column: 7, scope: !636)
!638 = !DILocation(line: 165, column: 7, scope: !624)
!639 = !DILocation(line: 166, column: 69, scope: !636)
!640 = !DILocation(line: 166, column: 59, scope: !636)
!641 = !DILocation(line: 166, column: 30, scope: !636)
!642 = !DILocation(line: 166, column: 18, scope: !636)
!643 = !DILocation(line: 166, column: 41, scope: !636)
!644 = !DILocation(line: 166, column: 46, scope: !636)
!645 = !DILocation(line: 166, column: 38, scope: !636)
!646 = !DILocation(line: 166, column: 7, scope: !636)
!647 = !DILocation(line: 166, column: 57, scope: !636)
!648 = !DILocation(line: 166, column: 5, scope: !636)
!649 = !DILocation(line: 167, column: 1, scope: !624)
!650 = distinct !DISubprogram(name: "f_boolean", scope: !125, file: !125, line: 170, type: !159, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !407)
!651 = !DILocalVariable(name: "pkg", arg: 1, scope: !650, file: !125, line: 170, type: !161)
!652 = !DILocation(line: 170, column: 27, scope: !650)
!653 = !DILocalVariable(name: "pkgbin", arg: 2, scope: !650, file: !125, line: 170, type: !331)
!654 = !DILocation(line: 170, column: 47, scope: !650)
!655 = !DILocalVariable(name: "ps", arg: 3, scope: !650, file: !125, line: 171, type: !360)
!656 = !DILocation(line: 171, column: 33, scope: !650)
!657 = !DILocalVariable(name: "value", arg: 4, scope: !650, file: !125, line: 172, type: !144)
!658 = !DILocation(line: 172, column: 23, scope: !650)
!659 = !DILocalVariable(name: "fip", arg: 5, scope: !650, file: !125, line: 172, type: !379)
!660 = !DILocation(line: 172, column: 54, scope: !650)
!661 = !DILocalVariable(name: "boolean", scope: !650, file: !125, line: 174, type: !153)
!662 = !DILocation(line: 174, column: 7, scope: !650)
!663 = !DILocation(line: 176, column: 9, scope: !664)
!664 = distinct !DILexicalBlock(scope: !650, file: !125, line: 176, column: 7)
!665 = !DILocation(line: 176, column: 8, scope: !664)
!666 = !DILocation(line: 176, column: 7, scope: !650)
!667 = !DILocation(line: 177, column: 5, scope: !664)
!668 = !DILocation(line: 179, column: 22, scope: !650)
!669 = !DILocation(line: 179, column: 13, scope: !650)
!670 = !DILocation(line: 179, column: 11, scope: !650)
!671 = !DILocation(line: 180, column: 23, scope: !672)
!672 = distinct !DILexicalBlock(scope: !650, file: !125, line: 180, column: 7)
!673 = !DILocation(line: 180, column: 27, scope: !672)
!674 = !DILocation(line: 180, column: 7, scope: !672)
!675 = !DILocation(line: 180, column: 7, scope: !650)
!676 = !DILocation(line: 181, column: 17, scope: !672)
!677 = !DILocation(line: 181, column: 20, scope: !672)
!678 = !DILocation(line: 182, column: 17, scope: !672)
!679 = !DILocation(line: 182, column: 22, scope: !672)
!680 = !DILocation(line: 182, column: 28, scope: !672)
!681 = !DILocation(line: 182, column: 32, scope: !672)
!682 = !DILocation(line: 182, column: 36, scope: !672)
!683 = !DILocation(line: 181, column: 5, scope: !684)
!684 = !DILexicalBlockFile(scope: !672, file: !125, discriminator: 1)
!685 = !DILocation(line: 181, column: 5, scope: !672)
!686 = !DILocation(line: 184, column: 46, scope: !650)
!687 = !DILocation(line: 184, column: 17, scope: !650)
!688 = !DILocation(line: 184, column: 5, scope: !650)
!689 = !DILocation(line: 184, column: 28, scope: !650)
!690 = !DILocation(line: 184, column: 33, scope: !650)
!691 = !DILocation(line: 184, column: 25, scope: !650)
!692 = !DILocation(line: 184, column: 44, scope: !650)
!693 = !DILocation(line: 185, column: 1, scope: !650)
!694 = !DILocation(line: 185, column: 1, scope: !695)
!695 = !DILexicalBlockFile(scope: !650, file: !125, discriminator: 1)
!696 = distinct !DISubprogram(name: "parse_nv", scope: !125, file: !125, line: 64, type: !697, isLocal: true, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !407)
!697 = !DISubroutineType(types: !698)
!698 = !{!155, !360, !124, !143, !699}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "namevalue", file: !702, line: 35, size: 128, align: 64, elements: !703)
!702 = !DIFile(filename: "../../lib/dpkg/namevalue.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!703 = !{!704, !705, !706}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !701, file: !702, line: 36, baseType: !144, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !701, file: !702, line: 37, baseType: !155, size: 32, align: 32, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !701, file: !702, line: 38, baseType: !155, size: 32, align: 32, offset: 96)
!707 = !DILocalVariable(name: "ps", arg: 1, scope: !696, file: !125, line: 64, type: !360)
!708 = !DILocation(line: 64, column: 32, scope: !696)
!709 = !DILocalVariable(name: "flags", arg: 2, scope: !696, file: !125, line: 64, type: !124)
!710 = !DILocation(line: 64, column: 56, scope: !696)
!711 = !DILocalVariable(name: "strp", arg: 3, scope: !696, file: !125, line: 65, type: !143)
!712 = !DILocation(line: 65, column: 23, scope: !696)
!713 = !DILocalVariable(name: "nv_head", arg: 4, scope: !696, file: !125, line: 65, type: !699)
!714 = !DILocation(line: 65, column: 53, scope: !696)
!715 = !DILocalVariable(name: "str_start", scope: !696, file: !125, line: 67, type: !144)
!716 = !DILocation(line: 67, column: 15, scope: !696)
!717 = !DILocation(line: 67, column: 28, scope: !696)
!718 = !DILocation(line: 67, column: 27, scope: !696)
!719 = !DILocalVariable(name: "str_end", scope: !696, file: !125, line: 67, type: !144)
!720 = !DILocation(line: 67, column: 35, scope: !696)
!721 = !DILocalVariable(name: "nv", scope: !696, file: !125, line: 68, type: !699)
!722 = !DILocation(line: 68, column: 27, scope: !696)
!723 = !DILocalVariable(name: "value", scope: !696, file: !125, line: 69, type: !155)
!724 = !DILocation(line: 69, column: 7, scope: !696)
!725 = !DILocation(line: 71, column: 23, scope: !696)
!726 = !DILocation(line: 71, column: 27, scope: !696)
!727 = !DILocation(line: 71, column: 3, scope: !696)
!728 = !DILocation(line: 73, column: 7, scope: !729)
!729 = distinct !DILexicalBlock(scope: !696, file: !125, line: 73, column: 7)
!730 = !DILocation(line: 73, column: 20, scope: !729)
!731 = !DILocation(line: 73, column: 7, scope: !696)
!732 = !DILocation(line: 74, column: 28, scope: !729)
!733 = !DILocation(line: 74, column: 32, scope: !729)
!734 = !DILocation(line: 74, column: 36, scope: !729)
!735 = !DILocation(line: 74, column: 12, scope: !736)
!736 = !DILexicalBlockFile(scope: !729, file: !125, discriminator: 1)
!737 = !DILocation(line: 74, column: 5, scope: !729)
!738 = !DILocation(line: 76, column: 31, scope: !696)
!739 = !DILocation(line: 76, column: 40, scope: !696)
!740 = !DILocation(line: 76, column: 8, scope: !696)
!741 = !DILocation(line: 76, column: 6, scope: !696)
!742 = !DILocation(line: 77, column: 7, scope: !743)
!743 = distinct !DILexicalBlock(scope: !696, file: !125, line: 77, column: 7)
!744 = !DILocation(line: 77, column: 10, scope: !743)
!745 = !DILocation(line: 77, column: 7, scope: !696)
!746 = !DILocation(line: 79, column: 11, scope: !747)
!747 = distinct !DILexicalBlock(scope: !748, file: !125, line: 79, column: 9)
!748 = distinct !DILexicalBlock(scope: !743, file: !125, line: 77, column: 18)
!749 = !DILocation(line: 79, column: 17, scope: !747)
!750 = !DILocation(line: 79, column: 9, scope: !748)
!751 = !DILocation(line: 80, column: 30, scope: !747)
!752 = !DILocation(line: 80, column: 34, scope: !747)
!753 = !DILocation(line: 80, column: 38, scope: !747)
!754 = !DILocation(line: 80, column: 70, scope: !747)
!755 = !DILocation(line: 80, column: 14, scope: !756)
!756 = !DILexicalBlockFile(scope: !747, file: !125, discriminator: 1)
!757 = !DILocation(line: 80, column: 7, scope: !747)
!758 = !DILocation(line: 82, column: 13, scope: !748)
!759 = !DILocation(line: 83, column: 11, scope: !748)
!760 = !DILocation(line: 84, column: 3, scope: !748)
!761 = !DILocation(line: 85, column: 15, scope: !762)
!762 = distinct !DILexicalBlock(scope: !743, file: !125, line: 84, column: 10)
!763 = !DILocation(line: 85, column: 27, scope: !762)
!764 = !DILocation(line: 85, column: 31, scope: !762)
!765 = !DILocation(line: 85, column: 25, scope: !762)
!766 = !DILocation(line: 85, column: 13, scope: !762)
!767 = !DILocation(line: 86, column: 5, scope: !762)
!768 = !DILocation(line: 86, column: 22, scope: !769)
!769 = !DILexicalBlockFile(scope: !762, file: !125, discriminator: 1)
