; ModuleID = './[inter]lib--dpkg--nfmalloc.o.i'
source_filename = "./[inter]lib--dpkg--nfmalloc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%union.anon = type { i64 }

@dbobs_init = internal global i8 0, align 1
@db_obs = internal global %struct.obstack zeroinitializer, align 8

; Function Attrs: nounwind uwtable
define i8* @nfmalloc(i64) #0 !dbg !59 {
  %2 = alloca i64, align 8
  %3 = alloca %struct.obstack*, align 8
  %4 = alloca %struct.obstack*, align 8
  %5 = alloca i32, align 4
  %6 = alloca i8*, align 8
  %7 = alloca %struct.obstack*, align 8
  %8 = alloca i8*, align 8
  %9 = alloca i8*, align 8
  store i64 %0, i64* %2, align 8
  call void @llvm.dbg.declare(metadata i64* %2, metadata !65, metadata !66), !dbg !67
  %10 = load i8, i8* @dbobs_init, align 1, !dbg !68
  %11 = trunc i8 %10 to i1, !dbg !68
  br i1 %11, label %13, label %12, !dbg !70

; <label>:12:                                     ; preds = %1
  call void @nfobstack_init(), !dbg !71
  br label %13, !dbg !74

; <label>:13:                                     ; preds = %12, %1
  call void @llvm.dbg.declare(metadata %struct.obstack** %3, metadata !75, metadata !66), !dbg !78

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !14)
!1 = !DIFile(filename: "[inter]lib--dpkg--nfmalloc.o.i", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!2 = !{}
!3 = !{!4, !5, !7, !11}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DISubroutineType(types: !9)
!9 = !{!4, !10}
!10 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DISubroutineType(types: !13)
!13 = !{null, !4}
!14 = !{!15, !54}
!15 = distinct !DIGlobalVariable(name: "db_obs", scope: !0, file: !16, line: 35, type: !17, isLocal: true, isDefinition: true, variable: %struct.obstack* @db_obs)
!16 = !DIFile(filename: "nfmalloc.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !18, line: 153, size: 704, align: 64, elements: !19)
!18 = !DIFile(filename: "/usr/include/obstack.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!19 = !{!20, !21, !31, !32, !33, !34, !39, !41, !45, !49, !50, !52, !53}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !17, file: !18, line: 155, baseType: !10, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !17, file: !18, line: 156, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !18, line: 146, size: 192, align: 64, elements: !24)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !23, file: !18, line: 148, baseType: !5, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !23, file: !18, line: 149, baseType: !22, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !23, file: !18, line: 150, baseType: !28, size: 32, align: 8, offset: 128)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32, align: 8, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 4)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !17, file: !18, line: 157, baseType: !5, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !17, file: !18, line: 158, baseType: !5, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !17, file: !18, line: 159, baseType: !5, size: 64, align: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !17, file: !18, line: 164, baseType: !35, size: 64, align: 64, offset: 320)
!35 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !17, file: !18, line: 160, size: 64, align: 64, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tempint", scope: !35, file: !18, line: 162, baseType: !10, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tempptr", scope: !35, file: !18, line: 163, baseType: !4, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !17, file: !18, line: 165, baseType: !40, size: 32, align: 32, offset: 384)
!40 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !17, file: !18, line: 169, baseType: !42, size: 64, align: 64, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!22, !4, !10}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !17, file: !18, line: 170, baseType: !46, size: 64, align: 64, offset: 512)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !4, !22}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !17, file: !18, line: 171, baseType: !4, size: 64, align: 64, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !17, file: !18, line: 172, baseType: !51, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!51 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !17, file: !18, line: 173, baseType: !51, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !17, file: !18, line: 177, baseType: !51, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!54 = distinct !DIGlobalVariable(name: "dbobs_init", scope: !0, file: !16, line: 36, type: !55, isLocal: true, isDefinition: true, variable: i8* @dbobs_init)
!55 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!56 = !{i32 2, !"Dwarf Version", i32 4}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!59 = distinct !DISubprogram(name: "nfmalloc", scope: !16, file: !16, line: 50, type: !60, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!60 = !DISubroutineType(types: !61)
!61 = !{!4, !62}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !63, line: 216, baseType: !64)
!63 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!64 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!65 = !DILocalVariable(name: "size", arg: 1, scope: !59, file: !16, line: 50, type: !62)
!66 = !DIExpression()
!67 = !DILocation(line: 50, column: 17, scope: !59)
!68 = !DILocation(line: 52, column: 8, scope: !69)
!69 = distinct !DILexicalBlock(scope: !59, file: !16, line: 52, column: 7)
!70 = !DILocation(line: 52, column: 7, scope: !59)
!71 = !DILocation(line: 52, column: 22, scope: !72)
!72 = !DILexicalBlockFile(scope: !73, file: !16, discriminator: 1)
!73 = distinct !DILexicalBlock(scope: !69, file: !16, line: 52, column: 20)
!74 = !DILocation(line: 52, column: 40, scope: !72)
!75 = !DILocalVariable(name: "__h", scope: !76, file: !16, line: 53, type: !77)
!76 = distinct !DILexicalBlock(scope: !59, file: !16, line: 53, column: 24)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!78 = !DILocation(line: 53, column: 42, scope: !76)
!79 = !DILocalVariable(name: "__o", scope: !80, file: !16, line: 53, type: !77)
!80 = distinct !DILexicalBlock(scope: !76, file: !16, line: 53, column: 27)
!81 = !DILocation(line: 53, column: 45, scope: !80)
!82 = !DILocation(line: 53, column: 52, scope: !80)
!83 = !DILocalVariable(name: "__len", scope: !80, file: !16, line: 53, type: !40)
!84 = !DILocation(line: 53, column: 62, scope: !80)
!85 = !DILocation(line: 53, column: 9, scope: !80)
!86 = !DILocation(line: 53, column: 70, scope: !80)
!87 = !DILocation(line: 53, column: 17, scope: !88)
!88 = distinct !DILexicalBlock(scope: !80, file: !16, line: 53, column: 17)
!89 = !DILocation(line: 53, column: 22, scope: !88)
!90 = !DILocation(line: 53, column: 36, scope: !88)
!91 = !DILocation(line: 53, column: 41, scope: !88)
!92 = !DILocation(line: 53, column: 34, scope: !88)
!93 = !DILocation(line: 53, column: 53, scope: !88)
!94 = !DILocation(line: 53, column: 51, scope: !88)
!95 = !DILocation(line: 53, column: 17, scope: !80)
!96 = !DILocation(line: 53, column: 79, scope: !97)
!97 = !DILexicalBlockFile(scope: !88, file: !16, discriminator: 1)
!98 = !DILocation(line: 53, column: 84, scope: !97)
!99 = !DILocation(line: 53, column: 60, scope: !97)
!100 = !DILocation(line: 53, column: 114, scope: !101)
!101 = !DILexicalBlockFile(scope: !80, file: !16, discriminator: 2)
!102 = !DILocation(line: 53, column: 94, scope: !101)
!103 = !DILocation(line: 53, column: 100, scope: !101)
!104 = !DILocation(line: 53, column: 110, scope: !101)
!105 = !DILocalVariable(name: "__o1", scope: !106, file: !16, line: 53, type: !77)
!106 = distinct !DILexicalBlock(scope: !76, file: !16, line: 53, column: 152)
!107 = !DILocation(line: 53, column: 170, scope: !106)
!108 = !DILocation(line: 53, column: 178, scope: !101)
!109 = !DILocation(line: 53, column: 170, scope: !101)
!110 = !DILocalVariable(name: "__value", scope: !106, file: !16, line: 53, type: !4)
