; ModuleID = './[inter]lib--dpkg--parse.o.i'
source_filename = "./[inter]lib--dpkg--parse.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.fieldinfo = type { i8*, i64, void (%struct.pkginfo*, %struct.pkgbin*, %struct.parsedb_state*, i8*, %struct.fieldinfo*)*, void (%struct.varbuf*, %struct.pkginfo*, %struct.pkgbin*, i32, %struct.fieldinfo*)*, i64 }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.1, i32 }
%struct.anon.1 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }
%struct.pkgbin = type { %struct.dependency*, i8, i32, %struct.dpkg_arch*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.dpkg_version, %struct.conffile*, %struct.arbitraryfield* }
%struct.conffile = type { %struct.conffile*, i8*, i8*, i8 }

!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgmultiarch", file: !4, line: 95, size: 32, align: 32, elements: !68)
!68 = !{!69, !70, !71, !72}
!69 = !DIEnumerator(name: "PKG_MULTIARCH_NO", value: 0)
!70 = !DIEnumerator(name: "PKG_MULTIARCH_SAME", value: 1)
!71 = !DIEnumerator(name: "PKG_MULTIARCH_ALLOWED", value: 2)
!72 = !DIEnumerator(name: "PKG_MULTIARCH_FOREIGN", value: 3)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "parsedbtype", file: !74, line: 41, size: 32, align: 32, elements: !75)
!74 = !DIFile(filename: "../../lib/dpkg/parsedump.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!75 = !{!76, !77, !78, !79}
!76 = !DIEnumerator(name: "pdb_file_update", value: 0)
!77 = !DIEnumerator(name: "pdb_file_status", value: 1)
!78 = !DIEnumerator(name: "pdb_file_control", value: 2)
!79 = !DIEnumerator(name: "pdb_file_available", value: 3)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "parsedbflags", file: !4, line: 328, size: 32, align: 32, elements: !81)
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!82 = !DIEnumerator(name: "pdb_single_stanza", value: 1)
!83 = !DIEnumerator(name: "pdb_recordavailable", value: 2)
!84 = !DIEnumerator(name: "pdb_rejectstatus", value: 4)
!85 = !DIEnumerator(name: "pdb_weakclassification", value: 8)
!86 = !DIEnumerator(name: "pdb_ignore_archives", value: 16)
!87 = !DIEnumerator(name: "pdb_ignoreolder", value: 32)
!88 = !DIEnumerator(name: "pdb_lax_version_parser", value: 64)
!89 = !DIEnumerator(name: "pdb_lax_stanza_parser", value: 512)
!90 = !DIEnumerator(name: "pdb_lax_parser", value: 576)
!91 = !DIEnumerator(name: "pdb_close_fd", value: 128)
!92 = !DIEnumerator(name: "pdb_dash_is_stdin", value: 256)
!93 = !DIEnumerator(name: "pdb_parse_status", value: 584)
!94 = !DIEnumerator(name: "pdb_parse_update", value: 585)
!95 = !DIEnumerator(name: "pdb_parse_available", value: 582)
!96 = !DIEnumerator(name: "pdb_parse_binary", value: 7)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_msg_type", file: !98, line: 36, size: 32, align: 32, elements: !99)
!98 = !DIFile(filename: "../../lib/dpkg/error.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!99 = !{!100, !101, !102}
!100 = !DIEnumerator(name: "DPKG_MSG_NONE", value: 0)
!101 = !DIEnumerator(name: "DPKG_MSG_WARN", value: 1)
!102 = !DIEnumerator(name: "DPKG_MSG_ERROR", value: 2)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fwriteflags", file: !74, line: 112, size: 32, align: 32, elements: !104)
!104 = !{!105}
!105 = !DIEnumerator(name: "fw_printheader", value: 1)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !107, line: 41, size: 32, align: 32, elements: !108)
!107 = !DIFile(filename: "../../lib/dpkg/ehandle.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!108 = !{!109, !110, !111}
!109 = !DIEnumerator(name: "ehflag_normaltidy", value: 1)
!110 = !DIEnumerator(name: "ehflag_bombout", value: 2)
!111 = !DIEnumerator(name: "ehflag_recursiveerror", value: 4)
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_ctype_bit", file: !113, line: 32, size: 32, align: 32, elements: !114)
!113 = !DIFile(filename: "../../lib/dpkg/c-ctype.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122}
!115 = !DIEnumerator(name: "C_CTYPE_BLANK", value: 1)
!116 = !DIEnumerator(name: "C_CTYPE_WHITE", value: 2)
!117 = !DIEnumerator(name: "C_CTYPE_SPACE", value: 4)
!118 = !DIEnumerator(name: "C_CTYPE_UPPER", value: 8)
!119 = !DIEnumerator(name: "C_CTYPE_LOWER", value: 16)
!120 = !DIEnumerator(name: "C_CTYPE_DIGIT", value: 32)
!121 = !DIEnumerator(name: "C_CTYPE_ALPHA", value: 24)
!122 = !DIEnumerator(name: "C_CTYPE_ALNUM", value: 56)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_name_arch_when", file: !4, line: 396, size: 32, align: 32, elements: !124)
!124 = !{!125, !126, !127, !128}
!125 = !DIEnumerator(name: "pnaw_never", value: 0)
!126 = !DIEnumerator(name: "pnaw_nonambig", value: 1)
!127 = !DIEnumerator(name: "pnaw_foreign", value: 2)
!128 = !DIEnumerator(name: "pnaw_always", value: 3)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "versiondisplayepochwhen", file: !4, line: 388, size: 32, align: 32, elements: !130)
!130 = !{!131, !132, !133}
!131 = !DIEnumerator(name: "vdew_never", value: 0)
!132 = !DIEnumerator(name: "vdew_nonambig", value: 1)
!133 = !DIEnumerator(name: "vdew_always", value: 2)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !137, line: 216, baseType: !138)
!137 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!138 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!139 = !{!140}
!140 = distinct !DIGlobalVariable(name: "fieldinfos", scope: !0, file: !141, line: 52, type: !142, isLocal: false, isDefinition: true, variable: [38 x %struct.fieldinfo]* @fieldinfos)
!141 = !DIFile(filename: "parse.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 12160, align: 64, elements: !332)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fieldinfo", file: !74, line: 133, size: 320, align: 64, elements: !145)
!145 = !{!146, !150, !151, !315, !331}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !144, file: !74, line: 134, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!149 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "namelen", scope: !144, file: !74, line: 135, baseType: !136, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "rcall", scope: !144, file: !74, line: 136, baseType: !152, size: 64, align: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "freadfunction", file: !74, line: 97, baseType: !154)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !156, !293, !294, !147, !314}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !158)
!158 = !{!159, !208, !209, !210, !211, !212, !213, !214, !215, !216, !246, !247, !250, !259, !275, !276, !282, !285, !291, !292}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !157, file: !4, line: 196, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !162)
!162 = !{!163, !164, !165, !166, !206}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !161, file: !4, line: 243, baseType: !160, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !161, file: !4, line: 244, baseType: !147, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !161, file: !4, line: 245, baseType: !157, size: 3072, align: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !161, file: !4, line: 249, baseType: !167, size: 128, align: 64, offset: 3200)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !4, line: 246, size: 128, align: 64, elements: !168)
!168 = !{!169, !205}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !167, file: !4, line: 247, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !172)
!172 = !{!173, !181, !182, !183, !184, !185, !194, !201, !202, !204}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !171, file: !4, line: 64, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !176)
!176 = !{!177, !178, !179, !180}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !175, file: !4, line: 57, baseType: !156, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !175, file: !4, line: 58, baseType: !174, size: 64, align: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !175, file: !4, line: 59, baseType: !170, size: 64, align: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !175, file: !4, line: 60, baseType: !3, size: 32, align: 32, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !171, file: !4, line: 65, baseType: !160, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !4, line: 66, baseType: !170, size: 64, align: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !171, file: !4, line: 66, baseType: !170, size: 64, align: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !171, file: !4, line: 66, baseType: !170, size: 64, align: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !171, file: !4, line: 67, baseType: !186, size: 64, align: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !16, line: 48, size: 192, align: 64, elements: !189)
!189 = !{!190, !192, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !188, file: !16, line: 49, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !188, file: !16, line: 50, baseType: !147, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !188, file: !16, line: 51, baseType: !15, size: 32, align: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !171, file: !4, line: 68, baseType: !195, size: 192, align: 64, offset: 384)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !27, line: 42, size: 192, align: 64, elements: !196)
!196 = !{!197, !199, !200}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !195, file: !27, line: 44, baseType: !198, size: 32, align: 32)
!198 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !195, file: !27, line: 46, baseType: !147, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !195, file: !27, line: 48, baseType: !147, size: 64, align: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !171, file: !4, line: 69, baseType: !26, size: 32, align: 32, offset: 576)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !171, file: !4, line: 70, baseType: !203, size: 8, align: 8, offset: 608)
!203 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !171, file: !4, line: 71, baseType: !203, size: 8, align: 8, offset: 616)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !167, file: !4, line: 248, baseType: !170, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !161, file: !4, line: 250, baseType: !207, size: 32, align: 32, offset: 3328)
!207 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !157, file: !4, line: 197, baseType: !156, size: 64, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !157, file: !4, line: 199, baseType: !35, size: 32, align: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !157, file: !4, line: 201, baseType: !43, size: 32, align: 32, offset: 160)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !157, file: !4, line: 202, baseType: !47, size: 32, align: 32, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !157, file: !4, line: 203, baseType: !57, size: 32, align: 32, offset: 224)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !157, file: !4, line: 204, baseType: !147, size: 64, align: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !157, file: !4, line: 205, baseType: !147, size: 64, align: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !157, file: !4, line: 206, baseType: !195, size: 192, align: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !157, file: !4, line: 207, baseType: !217, size: 960, align: 64, offset: 576)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !239}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !217, file: !4, line: 108, baseType: !174, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !217, file: !4, line: 110, baseType: !203, size: 8, align: 8, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !217, file: !4, line: 111, baseType: !67, size: 32, align: 32, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !217, file: !4, line: 112, baseType: !186, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !217, file: !4, line: 115, baseType: !147, size: 64, align: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !217, file: !4, line: 116, baseType: !147, size: 64, align: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !217, file: !4, line: 117, baseType: !147, size: 64, align: 64, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !217, file: !4, line: 118, baseType: !147, size: 64, align: 64, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !217, file: !4, line: 119, baseType: !147, size: 64, align: 64, offset: 448)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !217, file: !4, line: 120, baseType: !147, size: 64, align: 64, offset: 512)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !217, file: !4, line: 121, baseType: !147, size: 64, align: 64, offset: 576)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !217, file: !4, line: 122, baseType: !195, size: 192, align: 64, offset: 640)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !217, file: !4, line: 123, baseType: !232, size: 64, align: 64, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !234)
!234 = !{!235, !236, !237, !238}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !233, file: !4, line: 81, baseType: !232, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !4, line: 82, baseType: !147, size: 64, align: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !233, file: !4, line: 83, baseType: !147, size: 64, align: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !233, file: !4, line: 84, baseType: !203, size: 8, align: 8, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !217, file: !4, line: 124, baseType: !240, size: 64, align: 64, offset: 896)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !242)
!242 = !{!243, !244, !245}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !4, line: 75, baseType: !240, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !241, file: !4, line: 76, baseType: !147, size: 64, align: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !241, file: !4, line: 77, baseType: !147, size: 64, align: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !157, file: !4, line: 208, baseType: !217, size: 960, align: 64, offset: 1536)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !157, file: !4, line: 209, baseType: !248, size: 64, align: 64, offset: 2496)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !4, line: 151, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !157, file: !4, line: 211, baseType: !251, size: 64, align: 64, offset: 2560)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !253)
!253 = !{!254, !255, !256, !257, !258}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !252, file: !4, line: 88, baseType: !251, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !252, file: !4, line: 89, baseType: !147, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !252, file: !4, line: 90, baseType: !147, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !252, file: !4, line: 91, baseType: !147, size: 64, align: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !252, file: !4, line: 92, baseType: !147, size: 64, align: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !157, file: !4, line: 216, baseType: !260, size: 128, align: 64, offset: 2624)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !157, file: !4, line: 213, size: 128, align: 64, elements: !261)
!261 = !{!262, !274}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !260, file: !4, line: 215, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !265)
!265 = !{!266, !267, !268, !269}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !264, file: !4, line: 143, baseType: !156, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !264, file: !4, line: 143, baseType: !156, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !264, file: !4, line: 144, baseType: !263, size: 64, align: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !264, file: !4, line: 147, baseType: !270, size: 128, align: 64, offset: 192)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !264, file: !4, line: 145, size: 128, align: 64, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !270, file: !4, line: 146, baseType: !263, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !270, file: !4, line: 146, baseType: !263, size: 64, align: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !260, file: !4, line: 215, baseType: !263, size: 64, align: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !157, file: !4, line: 219, baseType: !263, size: 64, align: 64, offset: 2752)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !157, file: !4, line: 220, baseType: !277, size: 64, align: 64, offset: 2816)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !4, line: 135, baseType: !277, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !278, file: !4, line: 136, baseType: !147, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !157, file: !4, line: 231, baseType: !283, size: 64, align: 64, offset: 2880)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !4, line: 231, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !157, file: !4, line: 232, baseType: !286, size: 64, align: 64, offset: 2944)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !287, line: 86, baseType: !288)
!287 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !289, line: 131, baseType: !290)
!289 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!290 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !157, file: !4, line: 233, baseType: !203, size: 8, align: 8, offset: 3008)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !157, file: !4, line: 236, baseType: !203, size: 8, align: 8, offset: 3016)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parsedb_state", file: !74, line: 48, size: 640, align: 64, elements: !296)
!296 = !{!297, !298, !299, !306, !307, !308, !309, !310, !311, !312, !313}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !295, file: !74, line: 49, baseType: !73, size: 32, align: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !295, file: !74, line: 50, baseType: !80, size: 32, align: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !295, file: !74, line: 51, baseType: !300, size: 128, align: 64, offset: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_error", file: !98, line: 42, size: 128, align: 64, elements: !301)
!301 = !{!302, !303, !304}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !300, file: !98, line: 43, baseType: !97, size: 32, align: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "syserrno", scope: !300, file: !98, line: 45, baseType: !207, size: 32, align: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !300, file: !98, line: 46, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !295, file: !74, line: 52, baseType: !156, size: 64, align: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pkgbin", scope: !295, file: !74, line: 53, baseType: !293, size: 64, align: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !295, file: !74, line: 54, baseType: !305, size: 64, align: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "dataptr", scope: !295, file: !74, line: 55, baseType: !305, size: 64, align: 64, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "endptr", scope: !295, file: !74, line: 56, baseType: !305, size: 64, align: 64, offset: 448)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !295, file: !74, line: 57, baseType: !147, size: 64, align: 64, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !295, file: !74, line: 58, baseType: !207, size: 32, align: 32, offset: 576)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "lno", scope: !295, file: !74, line: 59, baseType: !207, size: 32, align: 32, offset: 608)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "wcall", scope: !144, file: !74, line: 137, baseType: !316, size: 64, align: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "fwritefunction", file: !74, line: 117, baseType: !318)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !320, !327, !329, !103, !314}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !322, line: 55, size: 192, align: 64, elements: !323)
!322 = !DIFile(filename: "../../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!323 = !{!324, !325, !326}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !321, file: !322, line: 56, baseType: !136, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !321, file: !322, line: 56, baseType: !136, size: 64, align: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !321, file: !322, line: 57, baseType: !305, size: 64, align: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !217)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !144, file: !74, line: 138, baseType: !136, size: 64, align: 64, offset: 256)
!332 = !{!333}
!333 = !DISubrange(count: 38)
!334 = !{i32 2, !"Dwarf Version", i32 4}
!335 = !{i32 2, !"Debug Info Version", i32 3}
!336 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!337 = distinct !DISubprogram(name: "parsedb_new", scope: !141, file: !141, line: 523, type: !338, isLocal: false, isDefinition: true, scopeLine: 524, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !340)
!338 = !DISubroutineType(types: !339)
!339 = !{!294, !147, !207, !80}
!340 = !{}
!341 = !DILocalVariable(name: "filename", arg: 1, scope: !337, file: !141, line: 523, type: !147)
!342 = !DIExpression()
!343 = !DILocation(line: 523, column: 25, scope: !337)
!344 = !DILocalVariable(name: "fd", arg: 2, scope: !337, file: !141, line: 523, type: !207)
!345 = !DILocation(line: 523, column: 39, scope: !337)
!346 = !DILocalVariable(name: "flags", arg: 3, scope: !337, file: !141, line: 523, type: !80)
!347 = !DILocation(line: 523, column: 61, scope: !337)
!348 = !DILocalVariable(name: "ps", scope: !337, file: !141, line: 525, type: !294)
!349 = !DILocation(line: 525, column: 25, scope: !337)
!350 = !DILocation(line: 527, column: 8, scope: !337)
!351 = !DILocation(line: 527, column: 6, scope: !337)
!352 = !DILocation(line: 528, column: 3, scope: !337)
!353 = !DILocation(line: 528, column: 7, scope: !337)
!354 = !DILocation(line: 528, column: 32, scope: !337)
!355 = !DILocation(line: 528, column: 13, scope: !337)
!356 = !DILocation(line: 529, column: 18, scope: !337)
!357 = !DILocation(line: 529, column: 3, scope: !337)
!358 = !DILocation(line: 529, column: 7, scope: !337)
!359 = !DILocation(line: 529, column: 16, scope: !337)
!360 = !DILocation(line: 530, column: 29, scope: !337)
!361 = !DILocation(line: 530, column: 33, scope: !337)
!362 = !DILocation(line: 530, column: 14, scope: !337)
!363 = !DILocation(line: 530, column: 3, scope: !337)
!364 = !DILocation(line: 530, column: 7, scope: !337)
!365 = !DILocation(line: 530, column: 12, scope: !337)
!366 = !DILocation(line: 531, column: 15, scope: !337)
!367 = !DILocation(line: 531, column: 3, scope: !337)
!368 = !DILocation(line: 531, column: 7, scope: !337)
!369 = !DILocation(line: 531, column: 13, scope: !337)
!370 = !DILocation(line: 532, column: 12, scope: !337)
!371 = !DILocation(line: 532, column: 3, scope: !337)
!372 = !DILocation(line: 532, column: 7, scope: !337)
!373 = !DILocation(line: 532, column: 10, scope: !337)
!374 = !DILocation(line: 533, column: 3, scope: !337)
!375 = !DILocation(line: 533, column: 7, scope: !337)
!376 = !DILocation(line: 533, column: 11, scope: !337)
!377 = !DILocation(line: 534, column: 3, scope: !337)
!378 = !DILocation(line: 534, column: 7, scope: !337)
!379 = !DILocation(line: 534, column: 11, scope: !337)
!380 = !DILocation(line: 535, column: 3, scope: !337)
!381 = !DILocation(line: 535, column: 7, scope: !337)
!382 = !DILocation(line: 535, column: 14, scope: !337)
!383 = !DILocation(line: 537, column: 10, scope: !337)
!384 = !DILocation(line: 537, column: 3, scope: !337)
!385 = distinct !DISubprogram(name: "parse_get_type", scope: !141, file: !141, line: 504, type: !386, isLocal: true, isDefinition: true, scopeLine: 505, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !340)
!386 = !DISubroutineType(types: !387)
!387 = !{!73, !294, !80}
!388 = !DILocalVariable(name: "ps", arg: 1, scope: !385, file: !141, line: 504, type: !294)
!389 = !DILocation(line: 504, column: 38, scope: !385)
!390 = !DILocalVariable(name: "flags", arg: 2, scope: !385, file: !141, line: 504, type: !80)
!391 = !DILocation(line: 504, column: 60, scope: !385)
!392 = !DILocation(line: 506, column: 7, scope: !393)
!393 = distinct !DILexicalBlock(scope: !385, file: !141, line: 506, column: 7)
!394 = !DILocation(line: 506, column: 13, scope: !393)
!395 = !DILocation(line: 506, column: 7, scope: !385)
!396 = !DILocation(line: 507, column: 9, scope: !397)
!397 = distinct !DILexicalBlock(scope: !398, file: !141, line: 507, column: 9)
!398 = distinct !DILexicalBlock(scope: !393, file: !141, line: 506, column: 36)
!399 = !DILocation(line: 507, column: 15, scope: !397)
!400 = !DILocation(line: 507, column: 9, scope: !398)
!401 = !DILocation(line: 508, column: 7, scope: !397)
!402 = !DILocation(line: 510, column: 7, scope: !397)
!403 = !DILocation(line: 512, column: 9, scope: !404)
!404 = distinct !DILexicalBlock(scope: !405, file: !141, line: 512, column: 9)
!405 = distinct !DILexicalBlock(scope: !393, file: !141, line: 511, column: 10)
!406 = !DILocation(line: 512, column: 15, scope: !404)
!407 = !DILocation(line: 512, column: 9, scope: !405)
!408 = !DILocation(line: 513, column: 7, scope: !404)
!409 = !DILocation(line: 515, column: 7, scope: !404)
!410 = !DILocation(line: 517, column: 1, scope: !385)
!411 = distinct !DISubprogram(name: "parsedb_open", scope: !141, file: !141, line: 544, type: !412, isLocal: false, isDefinition: true, scopeLine: 545, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !340)
!412 = !DISubroutineType(types: !413)
!413 = !{!294, !147, !80}
!414 = !DILocalVariable(name: "filename", arg: 1, scope: !411, file: !141, line: 544, type: !147)
!415 = !DILocation(line: 544, column: 26, scope: !411)
!416 = !DILocalVariable(name: "flags", arg: 2, scope: !411, file: !141, line: 544, type: !80)
!417 = !DILocation(line: 544, column: 54, scope: !411)
!418 = !DILocalVariable(name: "ps", scope: !411, file: !141, line: 546, type: !294)
!419 = !DILocation(line: 546, column: 25, scope: !411)
!420 = !DILocalVariable(name: "fd", scope: !411, file: !141, line: 547, type: !207)
!421 = !DILocation(line: 547, column: 7, scope: !411)
!422 = !DILocation(line: 550, column: 7, scope: !423)
!423 = distinct !DILexicalBlock(scope: !411, file: !141, line: 550, column: 7)
!424 = !DILocation(line: 550, column: 13, scope: !423)
!425 = !DILocation(line: 550, column: 33, scope: !423)
!426 = !DILocation(line: 550, column: 43, scope: !427)
!427 = !DILexicalBlockFile(scope: !423, file: !141, discriminator: 1)
!428 = !DILocation(line: 550, column: 36, scope: !427)
!429 = !DILocation(line: 550, column: 58, scope: !427)
!430 = !DILocation(line: 550, column: 7, scope: !427)
!431 = !DILocation(line: 551, column: 24, scope: !423)
!432 = !DILocation(line: 551, column: 47, scope: !423)
!433 = !DILocation(line: 551, column: 12, scope: !423)
!434 = !DILocation(line: 551, column: 5, scope: !423)
!435 = !DILocation(line: 553, column: 13, scope: !411)
!436 = !DILocation(line: 553, column: 8, scope: !411)
!437 = !DILocation(line: 553, column: 6, scope: !411)
!438 = !DILocation(line: 554, column: 7, scope: !439)
!439 = distinct !DILexicalBlock(scope: !411, file: !141, line: 554, column: 7)
!440 = !DILocation(line: 554, column: 10, scope: !439)
!441 = !DILocation(line: 554, column: 7, scope: !411)
!442 = !DILocation(line: 555, column: 12, scope: !439)
!443 = !DILocation(line: 556, column: 13, scope: !439)
!444 = !DILocation(line: 555, column: 5, scope: !445)
!445 = !DILexicalBlockFile(scope: !439, file: !141, discriminator: 1)
!446 = !DILocation(line: 555, column: 5, scope: !439)
!447 = !DILocation(line: 558, column: 20, scope: !411)
!448 = !DILocation(line: 558, column: 30, scope: !411)
!449 = !DILocation(line: 558, column: 34, scope: !411)
!450 = !DILocation(line: 558, column: 40, scope: !411)
!451 = !DILocation(line: 558, column: 8, scope: !411)
!452 = !DILocation(line: 558, column: 6, scope: !411)
!453 = !DILocation(line: 560, column: 52, scope: !411)
!454 = !DILocation(line: 560, column: 56, scope: !411)
!455 = !DILocation(line: 560, column: 3, scope: !411)
!456 = !DILocation(line: 562, column: 10, scope: !411)
!457 = !DILocation(line: 562, column: 3, scope: !411)
!458 = !DILocation(line: 563, column: 1, scope: !411)
!459 = distinct !DISubprogram(name: "parsedb_load", scope: !141, file: !141, line: 569, type: !460, isLocal: false, isDefinition: true, scopeLine: 570, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !340)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !294}
!462 = !DILocalVariable(name: "ps", arg: 1, scope: !459, file: !141, line: 569, type: !294)
!463 = !DILocation(line: 569, column: 36, scope: !459)
!464 = !DILocalVariable(name: "st", scope: !459, file: !141, line: 571, type: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !466, line: 46, size: 1152, align: 64, elements: !467)
!466 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!467 = !{!468, !470, !472, !474, !476, !478, !480, !481, !482, !483, !485, !487, !495, !496, !497}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !465, file: !466, line: 48, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !289, line: 124, baseType: !138)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !465, file: !466, line: 53, baseType: !471, size: 64, align: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !289, line: 127, baseType: !138)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !465, file: !466, line: 61, baseType: !473, size: 64, align: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !289, line: 130, baseType: !138)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !465, file: !466, line: 62, baseType: !475, size: 32, align: 32, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !289, line: 129, baseType: !198)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !465, file: !466, line: 64, baseType: !477, size: 32, align: 32, offset: 224)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !289, line: 125, baseType: !198)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !465, file: !466, line: 65, baseType: !479, size: 32, align: 32, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !289, line: 126, baseType: !198)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !465, file: !466, line: 67, baseType: !207, size: 32, align: 32, offset: 288)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !465, file: !466, line: 69, baseType: !469, size: 64, align: 64, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !465, file: !466, line: 74, baseType: !288, size: 64, align: 64, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !465, file: !466, line: 78, baseType: !484, size: 64, align: 64, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !289, line: 153, baseType: !290)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !465, file: !466, line: 80, baseType: !486, size: 64, align: 64, offset: 512)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !289, line: 158, baseType: !290)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !465, file: !466, line: 91, baseType: !488, size: 128, align: 64, offset: 576)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !489, line: 120, size: 128, align: 64, elements: !490)
!489 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!490 = !{!491, !493}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !488, file: !489, line: 122, baseType: !492, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !289, line: 139, baseType: !290)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !488, file: !489, line: 123, baseType: !494, size: 64, align: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !289, line: 175, baseType: !290)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !465, file: !466, line: 92, baseType: !488, size: 128, align: 64, offset: 704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !465, file: !466, line: 93, baseType: !488, size: 128, align: 64, offset: 832)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !465, file: !466, line: 106, baseType: !498, size: 192, align: 64, offset: 960)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 192, align: 64, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 3)
!501 = !DILocation(line: 571, column: 15, scope: !459)
!502 = !DILocation(line: 573, column: 13, scope: !503)
!503 = distinct !DILexicalBlock(scope: !459, file: !141, line: 573, column: 7)
!504 = !DILocation(line: 573, column: 17, scope: !503)
!505 = !DILocation(line: 573, column: 7, scope: !503)
!506 = !DILocation(line: 573, column: 26, scope: !503)
!507 = !DILocation(line: 573, column: 7, scope: !459)
!508 = !DILocation(line: 574, column: 12, scope: !503)
!509 = !DILocation(line: 574, column: 56, scope: !503)
!510 = !DILocation(line: 574, column: 60, scope: !503)
!511 = !DILocation(line: 574, column: 5, scope: !512)
!512 = !DILexicalBlockFile(scope: !503, file: !141, discriminator: 1)
!513 = !DILocation(line: 574, column: 5, scope: !503)
!514 = !DILocation(line: 576, column: 9, scope: !515)
!515 = distinct !DILexicalBlock(scope: !459, file: !141, line: 576, column: 6)
!516 = !DILocation(line: 576, column: 20, scope: !515)
!517 = !DILocation(line: 576, column: 6, scope: !459)
!518 = !DILocalVariable(name: "buf", scope: !519, file: !141, line: 577, type: !321)
!519 = distinct !DILexicalBlock(scope: !515, file: !141, line: 576, column: 28)
!520 = !DILocation(line: 577, column: 19, scope: !519)
!521 = !DILocalVariable(name: "err", scope: !519, file: !141, line: 578, type: !300)
!522 = !DILocation(line: 578, column: 23, scope: !519)
!523 = !DILocalVariable(name: "size", scope: !519, file: !141, line: 579, type: !286)
!524 = !DILocation(line: 579, column: 11, scope: !519)
!525 = !DILocation(line: 581, column: 31, scope: !519)
!526 = !DILocation(line: 581, column: 35, scope: !519)
!527 = !DILocation(line: 581, column: 16, scope: !519)
!528 = !DILocation(line: 581, column: 12, scope: !519)
!529 = !DILocation(line: 581, column: 10, scope: !519)
!530 = !DILocation(line: 582, column: 9, scope: !531)
!531 = distinct !DILexicalBlock(scope: !519, file: !141, line: 582, column: 9)
!532 = !DILocation(line: 582, column: 14, scope: !531)
!533 = !DILocation(line: 582, column: 9, scope: !519)
!534 = !DILocation(line: 583, column: 13, scope: !531)
!535 = !DILocation(line: 583, column: 54, scope: !531)
!536 = !DILocation(line: 583, column: 58, scope: !531)
!537 = !DILocation(line: 583, column: 72, scope: !531)
!538 = !DILocation(line: 583, column: 7, scope: !539)
!539 = !DILexicalBlockFile(scope: !531, file: !141, discriminator: 1)
!540 = !DILocation(line: 583, column: 7, scope: !531)
!541 = !DILocation(line: 585, column: 5, scope: !519)
!542 = !DILocation(line: 587, column: 19, scope: !519)
!543 = !DILocation(line: 587, column: 5, scope: !519)
!544 = !DILocation(line: 587, column: 9, scope: !519)
!545 = !DILocation(line: 587, column: 17, scope: !519)
!546 = !DILocation(line: 588, column: 18, scope: !519)
!547 = !DILocation(line: 588, column: 22, scope: !519)
!548 = !DILocation(line: 588, column: 32, scope: !519)
!549 = !DILocation(line: 588, column: 30, scope: !519)
!550 = !DILocation(line: 588, column: 5, scope: !519)
!551 = !DILocation(line: 588, column: 9, scope: !519)
!552 = !DILocation(line: 588, column: 16, scope: !519)
!553 = !DILocation(line: 589, column: 3, scope: !519)
!554 = !DILocation(line: 589, column: 17, scope: !555)
!555 = !DILexicalBlockFile(scope: !556, file: !141, discriminator: 1)
!556 = distinct !DILexicalBlock(scope: !515, file: !141, line: 589, column: 14)
!557 = !DILocation(line: 589, column: 25, scope: !555)
!558 = !DILocation(line: 589, column: 14, scope: !555)
!559 = !DILocation(line: 595, column: 31, scope: !560)
!560 = distinct !DILexicalBlock(scope: !556, file: !141, line: 589, column: 30)
!561 = !DILocation(line: 595, column: 19, scope: !560)
!562 = !DILocation(line: 595, column: 5, scope: !560)
!563 = !DILocation(line: 595, column: 9, scope: !560)
!564 = !DILocation(line: 595, column: 17, scope: !560)
!565 = !DILocation(line: 597, column: 17, scope: !566)
!566 = distinct !DILexicalBlock(scope: !560, file: !141, line: 597, column: 9)
!567 = !DILocation(line: 597, column: 21, scope: !566)
!568 = !DILocation(line: 597, column: 25, scope: !566)
!569 = !DILocation(line: 597, column: 29, scope: !566)
!570 = !DILocation(line: 597, column: 41, scope: !566)
!571 = !DILocation(line: 597, column: 9, scope: !566)
!572 = !DILocation(line: 597, column: 50, scope: !566)
!573 = !DILocation(line: 597, column: 9, scope: !560)
!574 = !DILocation(line: 598, column: 14, scope: !566)
!575 = !DILocation(line: 598, column: 55, scope: !566)
!576 = !DILocation(line: 598, column: 59, scope: !566)
!577 = !DILocation(line: 598, column: 7, scope: !578)
!578 = !DILexicalBlockFile(scope: !566, file: !141, discriminator: 1)
!579 = !DILocation(line: 598, column: 7, scope: !566)
!580 = !DILocation(line: 600, column: 18, scope: !560)
!581 = !DILocation(line: 600, column: 22, scope: !560)
!582 = !DILocation(line: 600, column: 35, scope: !560)
!583 = !DILocation(line: 600, column: 30, scope: !560)
!584 = !DILocation(line: 600, column: 5, scope: !560)
!585 = !DILocation(line: 600, column: 9, scope: !560)
!586 = !DILocation(line: 600, column: 16, scope: !560)
!587 = !DILocation(line: 601, column: 3, scope: !560)
!588 = !DILocation(line: 602, column: 19, scope: !589)
!589 = distinct !DILexicalBlock(scope: !556, file: !141, line: 601, column: 10)
!590 = !DILocation(line: 602, column: 23, scope: !589)
!591 = !DILocation(line: 602, column: 30, scope: !589)
!592 = !DILocation(line: 602, column: 5, scope: !589)
!593 = !DILocation(line: 602, column: 9, scope: !589)
!594 = !DILocation(line: 602, column: 17, scope: !589)
!595 = !DILocation(line: 604, column: 14, scope: !459)
!596 = !DILocation(line: 604, column: 18, scope: !459)
!597 = !DILocation(line: 604, column: 3, scope: !459)
!598 = !DILocation(line: 604, column: 7, scope: !459)
!599 = !DILocation(line: 604, column: 12, scope: !459)
!600 = !DILocation(line: 605, column: 1, scope: !459)
!601 = distinct !DISubprogram(name: "parse_stanza", scope: !141, file: !141, line: 611, type: !602, isLocal: false, isDefinition: true, scopeLine: 613, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !340)
!602 = !DISubroutineType(types: !603)
!603 = !{!203, !294, !604, !614, !135}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64, align: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "field_state", file: !74, line: 66, size: 448, align: 64, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "fieldstart", scope: !605, file: !74, line: 67, baseType: !147, size: 64, align: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "valuestart", scope: !605, file: !74, line: 68, baseType: !147, size: 64, align: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !605, file: !74, line: 69, baseType: !321, size: 192, align: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "fieldlen", scope: !605, file: !74, line: 70, baseType: !207, size: 32, align: 32, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "valuelen", scope: !605, file: !74, line: 71, baseType: !207, size: 32, align: 32, offset: 352)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "fieldencountered", scope: !605, file: !74, line: 72, baseType: !613, size: 64, align: 64, offset: 384)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "parse_field_func", file: !74, line: 86, baseType: !616)
!616 = !DISubroutineType(types: !617)
!617 = !{null, !294, !604, !135}
!618 = !DILocalVariable(name: "ps", arg: 1, scope: !601, file: !141, line: 611, type: !294)
!619 = !DILocation(line: 611, column: 36, scope: !601)
!620 = !DILocalVariable(name: "fs", arg: 2, scope: !601, file: !141, line: 611, type: !604)
!621 = !DILocation(line: 611, column: 60, scope: !601)
!622 = !DILocalVariable(name: "parse_field", arg: 3, scope: !601, file: !141, line: 612, type: !614)
!623 = !DILocation(line: 612, column: 32, scope: !601)
!624 = !DILocalVariable(name: "parse_obj", arg: 4, scope: !601, file: !141, line: 612, type: !135)
!625 = !DILocation(line: 612, column: 51, scope: !601)
!626 = !DILocalVariable(name: "c", scope: !601, file: !141, line: 614, type: !207)
!627 = !DILocation(line: 614, column: 7, scope: !601)
!628 = !DILocation(line: 617, column: 3, scope: !601)
!629 = !DILocation(line: 617, column: 13, scope: !630)
!630 = !DILexicalBlockFile(scope: !601, file: !141, discriminator: 1)
!631 = !DILocation(line: 617, column: 18, scope: !630)
!632 = !DILocation(line: 617, column: 30, scope: !630)
!633 = !DILocation(line: 617, column: 35, scope: !630)
!634 = !DILocation(line: 617, column: 26, scope: !630)
!635 = !DILocation(line: 617, column: 10, scope: !630)
!636 = !DILocation(line: 617, column: 3, scope: !630)
!637 = !DILocation(line: 618, column: 11, scope: !638)
!638 = distinct !DILexicalBlock(scope: !601, file: !141, line: 617, column: 44)
!639 = !DILocation(line: 618, column: 16, scope: !638)
!640 = !DILocation(line: 618, column: 23, scope: !638)
!641 = !DILocation(line: 618, column: 9, scope: !638)
!642 = !DILocation(line: 618, column: 7, scope: !638)
!643 = !DILocation(line: 619, column: 9, scope: !644)
!644 = distinct !DILexicalBlock(scope: !638, file: !141, line: 619, column: 9)
!645 = !DILocation(line: 619, column: 11, scope: !644)
!646 = !DILocation(line: 619, column: 19, scope: !644)
!647 = !DILocation(line: 619, column: 22, scope: !648)
!648 = !DILexicalBlockFile(scope: !644, file: !141, discriminator: 1)
!649 = !DILocation(line: 619, column: 24, scope: !648)
!650 = !DILocation(line: 619, column: 9, scope: !648)
!651 = !DILocation(line: 620, column: 7, scope: !644)
!652 = !DILocation(line: 621, column: 5, scope: !638)
!653 = !DILocation(line: 621, column: 9, scope: !638)
!654 = !DILocation(line: 621, column: 12, scope: !638)
!655 = !DILocation(line: 617, column: 3, scope: !656)
!656 = !DILexicalBlockFile(scope: !601, file: !141, discriminator: 2)
!657 = distinct !{!657, !628}
!658 = !DILocation(line: 625, column: 9, scope: !659)
!659 = distinct !DILexicalBlock(scope: !601, file: !141, line: 625, column: 7)
!660 = !DILocation(line: 625, column: 14, scope: !659)
!661 = !DILocation(line: 625, column: 26, scope: !659)
!662 = !DILocation(line: 625, column: 31, scope: !659)
!663 = !DILocation(line: 625, column: 22, scope: !659)
!664 = !DILocation(line: 625, column: 7, scope: !601)
!665 = !DILocation(line: 626, column: 5, scope: !659)
!666 = !DILocation(line: 629, column: 3, scope: !601)
!667 = !DILocalVariable(name: "blank_line", scope: !668, file: !141, line: 630, type: !203)
!668 = distinct !DILexicalBlock(scope: !669, file: !141, line: 629, column: 12)
!669 = distinct !DILexicalBlock(scope: !670, file: !141, line: 629, column: 3)
!670 = distinct !DILexicalBlock(scope: !601, file: !141, line: 629, column: 3)
!671 = !DILocation(line: 630, column: 9, scope: !668)
!672 = !DILocation(line: 633, column: 22, scope: !668)
!673 = !DILocation(line: 633, column: 26, scope: !668)
!674 = !DILocation(line: 633, column: 34, scope: !668)
!675 = !DILocation(line: 633, column: 5, scope: !668)
!676 = !DILocation(line: 633, column: 9, scope: !668)
!677 = !DILocation(line: 633, column: 20, scope: !668)
!678 = !DILocation(line: 634, column: 5, scope: !668)
!679 = !DILocation(line: 634, column: 15, scope: !680)
!680 = !DILexicalBlockFile(scope: !668, file: !141, discriminator: 1)
!681 = !DILocation(line: 634, column: 20, scope: !680)
!682 = !DILocation(line: 634, column: 32, scope: !680)
!683 = !DILocation(line: 634, column: 37, scope: !680)
!684 = !DILocation(line: 634, column: 28, scope: !680)
!685 = !DILocation(line: 634, column: 45, scope: !680)
!686 = !DILocation(line: 634, column: 59, scope: !687)
!687 = !DILexicalBlockFile(scope: !668, file: !141, discriminator: 2)
!688 = !DILocation(line: 634, column: 49, scope: !687)
!689 = !DILocation(line: 634, column: 62, scope: !687)
!690 = !DILocation(line: 634, column: 65, scope: !691)
!691 = !DILexicalBlockFile(scope: !668, file: !141, discriminator: 3)
!692 = !DILocation(line: 634, column: 67, scope: !691)
!693 = !DILocation(line: 634, column: 74, scope: !691)
!694 = !DILocation(line: 634, column: 77, scope: !695)
!695 = !DILexicalBlockFile(scope: !668, file: !141, discriminator: 4)
!696 = !DILocation(line: 634, column: 79, scope: !695)
!697 = !DILocation(line: 634, column: 5, scope: !698)
!698 = !DILexicalBlockFile(scope: !668, file: !141, discriminator: 5)
!699 = !DILocation(line: 635, column: 13, scope: !668)
!700 = !DILocation(line: 635, column: 18, scope: !668)
!701 = !DILocation(line: 635, column: 25, scope: !668)
!702 = !DILocation(line: 635, column: 11, scope: !668)
!703 = !DILocation(line: 635, column: 9, scope: !668)
!704 = !DILocation(line: 634, column: 5, scope: !705)
!705 = !DILexicalBlockFile(scope: !668, file: !141, discriminator: 6)
!706 = distinct !{!706, !678}
!707 = !DILocation(line: 636, column: 20, scope: !668)
!708 = !DILocation(line: 636, column: 24, scope: !668)
!709 = !DILocation(line: 636, column: 34, scope: !668)
!710 = !DILocation(line: 636, column: 38, scope: !668)
!711 = !DILocation(line: 636, column: 32, scope: !668)
!712 = !DILocation(line: 636, column: 49, scope: !668)
!713 = !DILocation(line: 636, column: 5, scope: !668)
!714 = !DILocation(line: 636, column: 9, scope: !668)
!715 = !DILocation(line: 636, column: 18, scope: !668)
!716 = !DILocation(line: 637, column: 9, scope: !717)
!717 = distinct !DILexicalBlock(scope: !668, file: !141, line: 637, column: 9)
!718 = !DILocation(line: 637, column: 13, scope: !717)
!719 = !DILocation(line: 637, column: 22, scope: !717)
!720 = !DILocation(line: 637, column: 9, scope: !668)
!721 = !DILocation(line: 638, column: 19, scope: !717)
!722 = !DILocation(line: 638, column: 23, scope: !717)
!723 = !DILocation(line: 638, column: 7, scope: !724)
!724 = !DILexicalBlockFile(scope: !717, file: !141, discriminator: 1)
!725 = !DILocation(line: 638, column: 7, scope: !717)
!726 = !DILocation(line: 639, column: 9, scope: !727)
!727 = distinct !DILexicalBlock(scope: !668, file: !141, line: 639, column: 9)
!728 = !DILocation(line: 639, column: 13, scope: !727)
!729 = !DILocation(line: 639, column: 27, scope: !727)
!730 = !DILocation(line: 639, column: 9, scope: !668)
!731 = !DILocation(line: 640, column: 19, scope: !727)
!732 = !DILocation(line: 640, column: 23, scope: !727)
!733 = !DILocation(line: 641, column: 19, scope: !727)
!734 = !DILocation(line: 641, column: 23, scope: !727)
!735 = !DILocation(line: 641, column: 33, scope: !727)
!736 = !DILocation(line: 641, column: 37, scope: !727)
!737 = !DILocation(line: 640, column: 7, scope: !738)
!738 = !DILexicalBlockFile(scope: !727, file: !141, discriminator: 1)
!739 = !DILocation(line: 640, column: 7, scope: !727)
!740 = !DILocation(line: 644, column: 5, scope: !668)
!741 = !DILocation(line: 644, column: 15, scope: !680)
!742 = !DILocation(line: 644, column: 20, scope: !680)
!743 = !DILocation(line: 644, column: 32, scope: !680)
!744 = !DILocation(line: 644, column: 37, scope: !680)
!745 = !DILocation(line: 644, column: 28, scope: !680)
!746 = !DILocation(line: 644, column: 45, scope: !680)
!747 = !DILocation(line: 644, column: 48, scope: !687)
!748 = !DILocation(line: 644, column: 50, scope: !687)
!749 = !DILocation(line: 644, column: 58, scope: !687)
!750 = !DILocation(line: 644, column: 71, scope: !691)
!751 = !DILocation(line: 644, column: 61, scope: !691)
!752 = !DILocation(line: 644, column: 5, scope: !695)
!753 = !DILocation(line: 645, column: 13, scope: !668)
!754 = !DILocation(line: 645, column: 18, scope: !668)
!755 = !DILocation(line: 645, column: 25, scope: !668)
!756 = !DILocation(line: 645, column: 11, scope: !668)
!757 = !DILocation(line: 645, column: 9, scope: !668)
!758 = !DILocation(line: 644, column: 5, scope: !698)
!759 = distinct !{!759, !740}
!760 = !DILocation(line: 648, column: 11, scope: !761)
!761 = distinct !DILexicalBlock(scope: !668, file: !141, line: 648, column: 9)
!762 = !DILocation(line: 648, column: 16, scope: !761)
!763 = !DILocation(line: 648, column: 28, scope: !761)
!764 = !DILocation(line: 648, column: 33, scope: !761)
!765 = !DILocation(line: 648, column: 24, scope: !761)
!766 = !DILocation(line: 648, column: 9, scope: !668)
!767 = !DILocation(line: 649, column: 19, scope: !761)
!768 = !DILocation(line: 649, column: 22, scope: !761)
!769 = !DILocation(line: 650, column: 19, scope: !761)
!770 = !DILocation(line: 650, column: 23, scope: !761)
!771 = !DILocation(line: 650, column: 33, scope: !761)
!772 = !DILocation(line: 650, column: 37, scope: !761)
!773 = !DILocation(line: 649, column: 7, scope: !774)
!774 = !DILexicalBlockFile(scope: !761, file: !141, discriminator: 1)
!775 = !DILocation(line: 649, column: 7, scope: !761)
!776 = !DILocation(line: 651, column: 9, scope: !777)
!777 = distinct !DILexicalBlock(scope: !668, file: !141, line: 651, column: 9)
!778 = !DILocation(line: 651, column: 11, scope: !777)
!779 = !DILocation(line: 651, column: 9, scope: !668)
!780 = !DILocation(line: 652, column: 19, scope: !777)
!781 = !DILocation(line: 653, column: 18, scope: !777)
!782 = !DILocation(line: 653, column: 53, scope: !777)
!783 = !DILocation(line: 653, column: 57, scope: !777)
!784 = !DILocation(line: 653, column: 67, scope: !777)
!785 = !DILocation(line: 653, column: 71, scope: !777)
!786 = !DILocation(line: 652, column: 7, scope: !777)
!787 = !DILocation(line: 654, column: 9, scope: !788)
!788 = distinct !DILexicalBlock(scope: !668, file: !141, line: 654, column: 9)
!789 = !DILocation(line: 654, column: 11, scope: !788)
!790 = !DILocation(line: 654, column: 9, scope: !668)
!791 = !DILocation(line: 655, column: 19, scope: !788)
!792 = !DILocation(line: 655, column: 22, scope: !788)
!793 = !DILocation(line: 656, column: 19, scope: !788)
!794 = !DILocation(line: 656, column: 23, scope: !788)
!795 = !DILocation(line: 656, column: 33, scope: !788)
!796 = !DILocation(line: 656, column: 37, scope: !788)
!797 = !DILocation(line: 655, column: 7, scope: !798)
!798 = !DILexicalBlockFile(scope: !788, file: !141, discriminator: 1)
!799 = !DILocation(line: 655, column: 7, scope: !788)
!800 = !DILocation(line: 657, column: 9, scope: !801)
!801 = distinct !DILexicalBlock(scope: !668, file: !141, line: 657, column: 9)
!802 = !DILocation(line: 657, column: 11, scope: !801)
!803 = !DILocation(line: 657, column: 9, scope: !668)
!804 = !DILocation(line: 658, column: 19, scope: !801)
!805 = !DILocation(line: 659, column: 18, scope: !801)
!806 = !DILocation(line: 660, column: 19, scope: !801)
!807 = !DILocation(line: 660, column: 23, scope: !801)
!808 = !DILocation(line: 660, column: 33, scope: !801)
!809 = !DILocation(line: 660, column: 37, scope: !801)
!810 = !DILocation(line: 658, column: 7, scope: !801)
!811 = !DILocation(line: 663, column: 5, scope: !668)
!812 = !DILocation(line: 663, column: 15, scope: !680)
!813 = !DILocation(line: 663, column: 20, scope: !680)
!814 = !DILocation(line: 663, column: 32, scope: !680)
!815 = !DILocation(line: 663, column: 37, scope: !680)
!816 = !DILocation(line: 663, column: 28, scope: !680)
!817 = !DILocation(line: 663, column: 12, scope: !680)
!818 = !DILocation(line: 663, column: 5, scope: !680)
!819 = !DILocation(line: 664, column: 13, scope: !820)
!820 = distinct !DILexicalBlock(scope: !668, file: !141, line: 663, column: 46)
!821 = !DILocation(line: 664, column: 18, scope: !820)
!822 = !DILocation(line: 664, column: 25, scope: !820)
!823 = !DILocation(line: 664, column: 11, scope: !820)
!824 = !DILocation(line: 664, column: 9, scope: !820)
!825 = !DILocation(line: 665, column: 11, scope: !826)
!826 = distinct !DILexicalBlock(scope: !820, file: !141, line: 665, column: 11)
!827 = !DILocation(line: 665, column: 13, scope: !826)
!828 = !DILocation(line: 665, column: 21, scope: !826)
!829 = !DILocation(line: 665, column: 35, scope: !830)
!830 = !DILexicalBlockFile(scope: !826, file: !141, discriminator: 1)
!831 = !DILocation(line: 665, column: 25, scope: !830)
!832 = !DILocation(line: 665, column: 11, scope: !830)
!833 = !DILocation(line: 666, column: 9, scope: !826)
!834 = !DILocation(line: 663, column: 5, scope: !687)
!835 = distinct !{!835, !811}
!836 = !DILocation(line: 668, column: 11, scope: !837)
!837 = distinct !DILexicalBlock(scope: !668, file: !141, line: 668, column: 9)
!838 = !DILocation(line: 668, column: 16, scope: !837)
!839 = !DILocation(line: 668, column: 28, scope: !837)
!840 = !DILocation(line: 668, column: 33, scope: !837)
!841 = !DILocation(line: 668, column: 24, scope: !837)
!842 = !DILocation(line: 668, column: 9, scope: !668)
!843 = !DILocation(line: 669, column: 19, scope: !837)
!844 = !DILocation(line: 669, column: 22, scope: !837)
!845 = !DILocation(line: 670, column: 19, scope: !837)
!846 = !DILocation(line: 670, column: 23, scope: !837)
!847 = !DILocation(line: 670, column: 33, scope: !837)
!848 = !DILocation(line: 670, column: 37, scope: !837)
!849 = !DILocation(line: 669, column: 7, scope: !850)
!850 = !DILexicalBlockFile(scope: !837, file: !141, discriminator: 1)
!851 = !DILocation(line: 669, column: 7, scope: !837)
!852 = !DILocation(line: 671, column: 9, scope: !853)
!853 = distinct !DILexicalBlock(scope: !668, file: !141, line: 671, column: 9)
!854 = !DILocation(line: 671, column: 11, scope: !853)
!855 = !DILocation(line: 671, column: 9, scope: !668)
!856 = !DILocation(line: 672, column: 19, scope: !853)
!857 = !DILocation(line: 672, column: 22, scope: !853)
!858 = !DILocation(line: 673, column: 19, scope: !853)
!859 = !DILocation(line: 673, column: 23, scope: !853)
!860 = !DILocation(line: 673, column: 33, scope: !853)
!861 = !DILocation(line: 673, column: 37, scope: !853)
!862 = !DILocation(line: 672, column: 7, scope: !863)
!863 = !DILexicalBlockFile(scope: !853, file: !141, discriminator: 1)
!864 = !DILocation(line: 672, column: 7, scope: !853)
!865 = !DILocation(line: 675, column: 16, scope: !668)
!866 = !DILocation(line: 678, column: 22, scope: !668)
!867 = !DILocation(line: 678, column: 26, scope: !668)
!868 = !DILocation(line: 678, column: 34, scope: !668)
!869 = !DILocation(line: 678, column: 5, scope: !668)
!870 = !DILocation(line: 678, column: 9, scope: !668)
!871 = !DILocation(line: 678, column: 20, scope: !668)
!872 = !DILocation(line: 679, column: 5, scope: !668)
!873 = !DILocation(line: 680, column: 11, scope: !874)
!874 = distinct !DILexicalBlock(scope: !875, file: !141, line: 680, column: 11)
!875 = distinct !DILexicalBlock(scope: !876, file: !141, line: 679, column: 14)
!876 = distinct !DILexicalBlock(scope: !877, file: !141, line: 679, column: 5)
!877 = distinct !DILexicalBlock(scope: !668, file: !141, line: 679, column: 5)
!878 = !DILocation(line: 680, column: 13, scope: !874)
!879 = !DILocation(line: 680, column: 21, scope: !874)
!880 = !DILocation(line: 680, column: 24, scope: !881)
!881 = !DILexicalBlockFile(scope: !874, file: !141, discriminator: 1)
!882 = !DILocation(line: 680, column: 26, scope: !881)
!883 = !DILocation(line: 680, column: 11, scope: !881)
!884 = !DILocation(line: 681, column: 13, scope: !885)
!885 = distinct !DILexicalBlock(scope: !886, file: !141, line: 681, column: 13)
!886 = distinct !DILexicalBlock(scope: !874, file: !141, line: 680, column: 37)
!887 = !DILocation(line: 681, column: 13, scope: !886)
!888 = !DILocation(line: 682, column: 15, scope: !889)
!889 = distinct !DILexicalBlock(scope: !890, file: !141, line: 682, column: 15)
!890 = distinct !DILexicalBlock(scope: !885, file: !141, line: 681, column: 25)
!891 = !DILocation(line: 682, column: 19, scope: !889)
!892 = !DILocation(line: 682, column: 25, scope: !889)
!893 = !DILocation(line: 682, column: 15, scope: !890)
!894 = !DILocation(line: 683, column: 24, scope: !889)
!895 = !DILocation(line: 683, column: 27, scope: !889)
!896 = !DILocation(line: 684, column: 24, scope: !889)
!897 = !DILocation(line: 684, column: 28, scope: !889)
!898 = !DILocation(line: 684, column: 38, scope: !889)
!899 = !DILocation(line: 684, column: 42, scope: !889)
!900 = !DILocation(line: 683, column: 13, scope: !901)
!901 = !DILexicalBlockFile(scope: !889, file: !141, discriminator: 1)
!902 = !DILocation(line: 683, column: 13, scope: !889)
!903 = !DILocation(line: 686, column: 25, scope: !889)
!904 = !DILocation(line: 686, column: 28, scope: !889)
!905 = !DILocation(line: 687, column: 25, scope: !889)
!906 = !DILocation(line: 687, column: 29, scope: !889)
!907 = !DILocation(line: 687, column: 39, scope: !889)
!908 = !DILocation(line: 687, column: 43, scope: !889)
!909 = !DILocation(line: 686, column: 13, scope: !901)
!910 = !DILocation(line: 686, column: 13, scope: !889)
!911 = !DILocation(line: 688, column: 9, scope: !890)
!912 = !DILocation(line: 689, column: 9, scope: !886)
!913 = !DILocation(line: 689, column: 13, scope: !886)
!914 = !DILocation(line: 689, column: 16, scope: !886)
!915 = !DILocation(line: 691, column: 15, scope: !916)
!916 = distinct !DILexicalBlock(scope: !886, file: !141, line: 691, column: 13)
!917 = !DILocation(line: 691, column: 20, scope: !916)
!918 = !DILocation(line: 691, column: 32, scope: !916)
!919 = !DILocation(line: 691, column: 37, scope: !916)
!920 = !DILocation(line: 691, column: 28, scope: !916)
!921 = !DILocation(line: 691, column: 13, scope: !886)
!922 = !DILocation(line: 692, column: 11, scope: !916)
!923 = !DILocation(line: 693, column: 15, scope: !886)
!924 = !DILocation(line: 693, column: 20, scope: !886)
!925 = !DILocation(line: 693, column: 27, scope: !886)
!926 = !DILocation(line: 693, column: 13, scope: !886)
!927 = !DILocation(line: 693, column: 11, scope: !886)
!928 = !DILocation(line: 696, column: 15, scope: !929)
!929 = distinct !DILexicalBlock(scope: !886, file: !141, line: 696, column: 13)
!930 = !DILocation(line: 696, column: 20, scope: !929)
!931 = !DILocation(line: 696, column: 32, scope: !929)
!932 = !DILocation(line: 696, column: 37, scope: !929)
!933 = !DILocation(line: 696, column: 28, scope: !929)
!934 = !DILocation(line: 696, column: 45, scope: !929)
!935 = !DILocation(line: 696, column: 48, scope: !936)
!936 = !DILexicalBlockFile(scope: !929, file: !141, discriminator: 1)
!937 = !DILocation(line: 696, column: 50, scope: !936)
!938 = !DILocation(line: 696, column: 58, scope: !936)
!939 = !DILocation(line: 696, column: 72, scope: !940)
!940 = !DILexicalBlockFile(scope: !929, file: !141, discriminator: 2)
!941 = !DILocation(line: 696, column: 62, scope: !940)
!942 = !DILocation(line: 696, column: 13, scope: !940)
!943 = !DILocation(line: 697, column: 11, scope: !929)
!944 = !DILocation(line: 699, column: 10, scope: !886)
!945 = !DILocation(line: 699, column: 15, scope: !886)
!946 = !DILocation(line: 699, column: 22, scope: !886)
!947 = !DILocation(line: 700, column: 20, scope: !886)
!948 = !DILocation(line: 701, column: 7, scope: !886)
!949 = !DILocation(line: 701, column: 18, scope: !950)
!950 = !DILexicalBlockFile(scope: !951, file: !141, discriminator: 1)
!951 = distinct !DILexicalBlock(scope: !874, file: !141, line: 701, column: 18)
!952 = !DILocation(line: 701, column: 29, scope: !950)
!953 = !DILocation(line: 701, column: 43, scope: !954)
!954 = !DILexicalBlockFile(scope: !951, file: !141, discriminator: 2)
!955 = !DILocation(line: 701, column: 33, scope: !954)
!956 = !DILocation(line: 701, column: 18, scope: !954)
!957 = !DILocation(line: 702, column: 20, scope: !958)
!958 = distinct !DILexicalBlock(scope: !951, file: !141, line: 701, column: 47)
!959 = !DILocation(line: 703, column: 7, scope: !958)
!960 = !DILocation(line: 705, column: 13, scope: !961)
!961 = distinct !DILexicalBlock(scope: !875, file: !141, line: 705, column: 11)
!962 = !DILocation(line: 705, column: 18, scope: !961)
!963 = !DILocation(line: 705, column: 30, scope: !961)
!964 = !DILocation(line: 705, column: 35, scope: !961)
!965 = !DILocation(line: 705, column: 26, scope: !961)
!966 = !DILocation(line: 705, column: 11, scope: !875)
!967 = !DILocation(line: 706, column: 21, scope: !961)
!968 = !DILocation(line: 706, column: 24, scope: !961)
!969 = !DILocation(line: 707, column: 21, scope: !961)
!970 = !DILocation(line: 707, column: 25, scope: !961)
!971 = !DILocation(line: 707, column: 35, scope: !961)
!972 = !DILocation(line: 707, column: 39, scope: !961)
!973 = !DILocation(line: 706, column: 9, scope: !974)
!974 = !DILexicalBlockFile(scope: !961, file: !141, discriminator: 1)
!975 = !DILocation(line: 706, column: 9, scope: !961)
!976 = !DILocation(line: 709, column: 13, scope: !875)
!977 = !DILocation(line: 709, column: 18, scope: !875)
!978 = !DILocation(line: 709, column: 25, scope: !875)
!979 = !DILocation(line: 709, column: 11, scope: !875)
!980 = !DILocation(line: 709, column: 9, scope: !875)
!981 = !DILocation(line: 679, column: 5, scope: !982)
!982 = !DILexicalBlockFile(scope: !876, file: !141, discriminator: 1)
!983 = distinct !{!983, !872}
!984 = !DILocation(line: 711, column: 20, scope: !668)
!985 = !DILocation(line: 711, column: 24, scope: !668)
!986 = !DILocation(line: 711, column: 34, scope: !668)
!987 = !DILocation(line: 711, column: 38, scope: !668)
!988 = !DILocation(line: 711, column: 32, scope: !668)
!989 = !DILocation(line: 711, column: 49, scope: !668)
!990 = !DILocation(line: 711, column: 5, scope: !668)
!991 = !DILocation(line: 711, column: 9, scope: !668)
!992 = !DILocation(line: 711, column: 18, scope: !668)
!993 = !DILocation(line: 714, column: 5, scope: !668)
!994 = !DILocation(line: 714, column: 12, scope: !680)
!995 = !DILocation(line: 714, column: 16, scope: !680)
!996 = !DILocation(line: 714, column: 25, scope: !680)
!997 = !DILocation(line: 714, column: 40, scope: !687)
!998 = !DILocation(line: 714, column: 44, scope: !687)
!999 = !DILocation(line: 714, column: 57, scope: !687)
!1000 = !DILocation(line: 714, column: 61, scope: !687)
!1001 = !DILocation(line: 714, column: 55, scope: !687)
!1002 = !DILocation(line: 714, column: 70, scope: !687)
!1003 = !DILocation(line: 714, column: 38, scope: !687)
!1004 = !DILocation(line: 714, column: 28, scope: !687)
!1005 = !DILocation(line: 714, column: 5, scope: !691)
!1006 = !DILocation(line: 715, column: 7, scope: !668)
!1007 = !DILocation(line: 715, column: 11, scope: !668)
!1008 = !DILocation(line: 715, column: 19, scope: !668)
!1009 = !DILocation(line: 714, column: 5, scope: !695)
!1010 = distinct !{!1010, !993}
!1011 = !DILocation(line: 717, column: 5, scope: !668)
!1012 = !DILocation(line: 717, column: 17, scope: !668)
!1013 = !DILocation(line: 717, column: 21, scope: !668)
!1014 = !DILocation(line: 717, column: 25, scope: !668)
!1015 = !DILocation(line: 719, column: 11, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !668, file: !141, line: 719, column: 9)
!1017 = !DILocation(line: 719, column: 16, scope: !1016)
!1018 = !DILocation(line: 719, column: 28, scope: !1016)
!1019 = !DILocation(line: 719, column: 33, scope: !1016)
!1020 = !DILocation(line: 719, column: 24, scope: !1016)
!1021 = !DILocation(line: 719, column: 41, scope: !1016)
!1022 = !DILocation(line: 719, column: 44, scope: !1023)
!1023 = !DILexicalBlockFile(scope: !1016, file: !141, discriminator: 1)
!1024 = !DILocation(line: 719, column: 46, scope: !1023)
!1025 = !DILocation(line: 719, column: 54, scope: !1023)
!1026 = !DILocation(line: 719, column: 57, scope: !1027)
!1027 = !DILexicalBlockFile(scope: !1016, file: !141, discriminator: 2)
!1028 = !DILocation(line: 719, column: 59, scope: !1027)
!1029 = !DILocation(line: 719, column: 9, scope: !1027)
!1030 = !DILocation(line: 720, column: 7, scope: !1016)
!1031 = !DILocation(line: 629, column: 3, scope: !1032)
!1032 = !DILexicalBlockFile(scope: !669, file: !141, discriminator: 1)
!1033 = distinct !{!1033, !666}
!1034 = !DILocation(line: 723, column: 7, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !601, file: !141, line: 723, column: 7)
!1036 = !DILocation(line: 723, column: 9, scope: !1035)
!1037 = !DILocation(line: 723, column: 7, scope: !601)
!1038 = !DILocation(line: 724, column: 5, scope: !1035)
!1039 = !DILocation(line: 724, column: 9, scope: !1035)
!1040 = !DILocation(line: 724, column: 12, scope: !1035)
!1041 = !DILocation(line: 726, column: 3, scope: !601)
!1042 = !DILocation(line: 727, column: 1, scope: !601)
!1043 = distinct !DISubprogram(name: "c_isspace", scope: !113, file: !113, line: 69, type: !1044, isLocal: true, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !340)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!203, !207}
!1046 = !DILocalVariable(name: "c", arg: 1, scope: !1043, file: !113, line: 69, type: !207)
!1047 = !DILocation(line: 69, column: 15, scope: !1043)
!1048 = !DILocation(line: 71, column: 18, scope: !1043)
!1049 = !DILocation(line: 71, column: 9, scope: !1043)
!1050 = !DILocation(line: 71, column: 2, scope: !1043)
!1051 = distinct !DISubprogram(name: "parsedb_close", scope: !141, file: !141, line: 733, type: !460, isLocal: false, isDefinition: true, scopeLine: 734, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !340)
!1052 = !DILocalVariable(name: "ps", arg: 1, scope: !1051, file: !141, line: 733, type: !294)
!1053 = !DILocation(line: 733, column: 37, scope: !1051)
!1054 = !DILocation(line: 735, column: 7, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1051, file: !141, line: 735, column: 7)
!1056 = !DILocation(line: 735, column: 11, scope: !1055)
!1057 = !DILocation(line: 735, column: 17, scope: !1055)
!1058 = !DILocation(line: 735, column: 7, scope: !1051)
!1059 = !DILocation(line: 736, column: 5, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1055, file: !141, line: 735, column: 33)
!1061 = !DILocation(line: 738, column: 15, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1060, file: !141, line: 738, column: 9)
!1063 = !DILocation(line: 738, column: 19, scope: !1062)
!1064 = !DILocation(line: 738, column: 9, scope: !1062)
!1065 = !DILocation(line: 738, column: 9, scope: !1060)
!1066 = !DILocation(line: 739, column: 14, scope: !1062)
!1067 = !DILocation(line: 739, column: 57, scope: !1062)
!1068 = !DILocation(line: 739, column: 61, scope: !1062)
!1069 = !DILocation(line: 739, column: 7, scope: !1070)
!1070 = !DILexicalBlockFile(scope: !1062, file: !141, discriminator: 1)
!1071 = !DILocation(line: 739, column: 7, scope: !1062)
!1072 = !DILocation(line: 740, column: 3, scope: !1060)
!1073 = !DILocation(line: 742, column: 7, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1051, file: !141, line: 742, column: 7)
!1075 = !DILocation(line: 742, column: 11, scope: !1074)
!1076 = !DILocation(line: 742, column: 16, scope: !1074)
!1077 = !DILocation(line: 742, column: 7, scope: !1051)
!1078 = !DILocation(line: 746, column: 10, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1074, file: !141, line: 742, column: 24)
!1080 = !DILocation(line: 746, column: 14, scope: !1079)
!1081 = !DILocation(line: 746, column: 5, scope: !1079)
!1082 = !DILocation(line: 748, column: 3, scope: !1079)
!1083 = !DILocation(line: 749, column: 8, scope: !1051)
!1084 = !DILocation(line: 749, column: 3, scope: !1051)
!1085 = !DILocation(line: 750, column: 1, scope: !1051)
!1086 = distinct !DISubprogram(name: "parsedb_parse", scope: !141, file: !141, line: 759, type: !1087, isLocal: false, isDefinition: true, scopeLine: 760, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !340)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!207, !294, !1089}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!1090 = !DILocalVariable(name: "ps", arg: 1, scope: !1086, file: !141, line: 759, type: !294)
!1091 = !DILocation(line: 759, column: 37, scope: !1086)
!1092 = !DILocalVariable(name: "donep", arg: 2, scope: !1086, file: !141, line: 759, type: !1089)
!1093 = !DILocation(line: 759, column: 58, scope: !1086)
!1094 = !DILocalVariable(name: "tmp_set", scope: !1086, file: !141, line: 761, type: !161)
!1095 = !DILocation(line: 761, column: 17, scope: !1086)
!1096 = !DILocalVariable(name: "new_pkg", scope: !1086, file: !141, line: 762, type: !156)
!1097 = !DILocation(line: 762, column: 19, scope: !1086)
!1098 = !DILocalVariable(name: "db_pkg", scope: !1086, file: !141, line: 762, type: !156)
!1099 = !DILocation(line: 762, column: 29, scope: !1086)
!1100 = !DILocalVariable(name: "new_pkgbin", scope: !1086, file: !141, line: 763, type: !293)
!1101 = !DILocation(line: 763, column: 18, scope: !1086)
!1102 = !DILocalVariable(name: "db_pkgbin", scope: !1086, file: !141, line: 763, type: !293)
!1103 = !DILocation(line: 763, column: 31, scope: !1086)
!1104 = !DILocalVariable(name: "pkg_obj", scope: !1086, file: !141, line: 764, type: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_parse_object", file: !141, line: 101, size: 128, align: 64, elements: !1106)
!1106 = !{!1107, !1108}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !1105, file: !141, line: 102, baseType: !156, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "pkgbin", scope: !1105, file: !141, line: 103, baseType: !293, size: 64, align: 64, offset: 64)
!1109 = !DILocation(line: 764, column: 27, scope: !1086)
!1110 = !DILocalVariable(name: "fieldencountered", scope: !1086, file: !141, line: 765, type: !1111)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 1216, align: 32, elements: !332)
!1112 = !DILocation(line: 765, column: 7, scope: !1086)
!1113 = !DILocalVariable(name: "pdone", scope: !1086, file: !141, line: 766, type: !207)
!1114 = !DILocation(line: 766, column: 7, scope: !1086)
!1115 = !DILocalVariable(name: "fs", scope: !1086, file: !141, line: 767, type: !605)
!1116 = !DILocation(line: 767, column: 22, scope: !1086)
!1117 = !DILocation(line: 769, column: 3, scope: !1086)
!1118 = !DILocation(line: 770, column: 25, scope: !1086)
!1119 = !DILocation(line: 770, column: 6, scope: !1086)
!1120 = !DILocation(line: 770, column: 23, scope: !1086)
!1121 = !DILocation(line: 772, column: 22, scope: !1086)
!1122 = !DILocation(line: 772, column: 11, scope: !1086)
!1123 = !DILocation(line: 773, column: 7, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1086, file: !141, line: 773, column: 7)
!1125 = !DILocation(line: 773, column: 11, scope: !1124)
!1126 = !DILocation(line: 773, column: 17, scope: !1124)
!1127 = !DILocation(line: 773, column: 7, scope: !1086)
!1128 = !DILocation(line: 774, column: 19, scope: !1124)
!1129 = !DILocation(line: 774, column: 28, scope: !1124)
!1130 = !DILocation(line: 774, column: 16, scope: !1124)
!1131 = !DILocation(line: 774, column: 5, scope: !1124)
!1132 = !DILocation(line: 776, column: 19, scope: !1124)
!1133 = !DILocation(line: 776, column: 28, scope: !1124)
!1134 = !DILocation(line: 776, column: 16, scope: !1124)
!1135 = !DILocation(line: 778, column: 13, scope: !1086)
!1136 = !DILocation(line: 778, column: 3, scope: !1086)
!1137 = !DILocation(line: 778, column: 7, scope: !1086)
!1138 = !DILocation(line: 778, column: 11, scope: !1086)
!1139 = !DILocation(line: 779, column: 16, scope: !1086)
!1140 = !DILocation(line: 779, column: 3, scope: !1086)
!1141 = !DILocation(line: 779, column: 7, scope: !1086)
!1142 = !DILocation(line: 779, column: 14, scope: !1086)
!1143 = !DILocation(line: 781, column: 17, scope: !1086)
!1144 = !DILocation(line: 781, column: 11, scope: !1086)
!1145 = !DILocation(line: 781, column: 15, scope: !1086)
!1146 = !DILocation(line: 782, column: 20, scope: !1086)
!1147 = !DILocation(line: 782, column: 11, scope: !1086)
!1148 = !DILocation(line: 782, column: 18, scope: !1086)
!1149 = !DILocation(line: 784, column: 8, scope: !1086)
!1150 = !DILocation(line: 787, column: 3, scope: !1086)
!1151 = !DILocation(line: 788, column: 5, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1153, file: !141, line: 787, column: 12)
!1153 = distinct !DILexicalBlock(scope: !1154, file: !141, line: 787, column: 3)
!1154 = distinct !DILexicalBlock(scope: !1086, file: !141, line: 787, column: 3)
!1155 = !DILocation(line: 789, column: 5, scope: !1152)
!1156 = !DILocation(line: 791, column: 23, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1152, file: !141, line: 791, column: 9)
!1158 = !DILocation(line: 791, column: 49, scope: !1157)
!1159 = !DILocation(line: 791, column: 10, scope: !1157)
!1160 = !DILocation(line: 791, column: 9, scope: !1152)
!1161 = !DILocation(line: 792, column: 7, scope: !1157)
!1162 = !DILocation(line: 794, column: 9, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1152, file: !141, line: 794, column: 9)
!1164 = !DILocation(line: 794, column: 15, scope: !1163)
!1165 = !DILocation(line: 794, column: 18, scope: !1166)
!1166 = !DILexicalBlockFile(scope: !1163, file: !141, discriminator: 1)
!1167 = !DILocation(line: 794, column: 9, scope: !1166)
!1168 = !DILocation(line: 795, column: 19, scope: !1163)
!1169 = !DILocation(line: 796, column: 18, scope: !1163)
!1170 = !DILocation(line: 795, column: 7, scope: !1163)
!1171 = !DILocation(line: 798, column: 22, scope: !1152)
!1172 = !DILocation(line: 798, column: 26, scope: !1152)
!1173 = !DILocation(line: 798, column: 35, scope: !1152)
!1174 = !DILocation(line: 798, column: 5, scope: !1152)
!1175 = !DILocation(line: 800, column: 34, scope: !1152)
!1176 = !DILocation(line: 800, column: 38, scope: !1152)
!1177 = !DILocation(line: 800, column: 47, scope: !1152)
!1178 = !DILocation(line: 800, column: 14, scope: !1152)
!1179 = !DILocation(line: 800, column: 12, scope: !1152)
!1180 = !DILocation(line: 801, column: 9, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1152, file: !141, line: 801, column: 9)
!1182 = !DILocation(line: 801, column: 13, scope: !1181)
!1183 = !DILocation(line: 801, column: 19, scope: !1181)
!1184 = !DILocation(line: 801, column: 9, scope: !1152)
!1185 = !DILocation(line: 802, column: 20, scope: !1181)
!1186 = !DILocation(line: 802, column: 28, scope: !1181)
!1187 = !DILocation(line: 802, column: 17, scope: !1181)
!1188 = !DILocation(line: 802, column: 7, scope: !1181)
!1189 = !DILocation(line: 804, column: 20, scope: !1181)
!1190 = !DILocation(line: 804, column: 28, scope: !1181)
!1191 = !DILocation(line: 804, column: 17, scope: !1181)
!1192 = !DILocation(line: 806, column: 11, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1152, file: !141, line: 806, column: 9)
!1194 = !DILocation(line: 806, column: 15, scope: !1193)
!1195 = !DILocation(line: 806, column: 21, scope: !1193)
!1196 = !DILocation(line: 806, column: 40, scope: !1193)
!1197 = !DILocation(line: 806, column: 43, scope: !1198)
!1198 = !DILexicalBlockFile(scope: !1193, file: !141, discriminator: 1)
!1199 = !DILocation(line: 806, column: 47, scope: !1198)
!1200 = !DILocation(line: 806, column: 52, scope: !1198)
!1201 = !DILocation(line: 806, column: 75, scope: !1198)
!1202 = !DILocation(line: 807, column: 38, scope: !1193)
!1203 = !DILocation(line: 807, column: 49, scope: !1193)
!1204 = !DILocation(line: 807, column: 9, scope: !1193)
!1205 = !DILocation(line: 807, column: 58, scope: !1193)
!1206 = !DILocation(line: 808, column: 31, scope: !1193)
!1207 = !DILocation(line: 808, column: 43, scope: !1193)
!1208 = !DILocation(line: 808, column: 53, scope: !1193)
!1209 = !DILocation(line: 808, column: 64, scope: !1193)
!1210 = !DILocation(line: 808, column: 9, scope: !1193)
!1211 = !DILocation(line: 808, column: 73, scope: !1193)
!1212 = !DILocation(line: 806, column: 9, scope: !1213)
!1213 = !DILexicalBlockFile(scope: !1152, file: !141, discriminator: 2)
!1214 = !DILocation(line: 809, column: 7, scope: !1193)
!1215 = distinct !{!1215, !1150}
!1216 = !DILocation(line: 811, column: 20, scope: !1152)
!1217 = !DILocation(line: 811, column: 24, scope: !1152)
!1218 = !DILocation(line: 811, column: 32, scope: !1152)
!1219 = !DILocation(line: 811, column: 43, scope: !1152)
!1220 = !DILocation(line: 811, column: 52, scope: !1152)
!1221 = !DILocation(line: 811, column: 5, scope: !1152)
!1222 = !DILocation(line: 813, column: 9, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1152, file: !141, line: 813, column: 9)
!1224 = !DILocation(line: 813, column: 9, scope: !1152)
!1225 = !DILocation(line: 814, column: 16, scope: !1223)
!1226 = !DILocation(line: 814, column: 8, scope: !1223)
!1227 = !DILocation(line: 814, column: 14, scope: !1223)
!1228 = !DILocation(line: 814, column: 7, scope: !1223)
!1229 = !DILocation(line: 815, column: 10, scope: !1152)
!1230 = !DILocation(line: 816, column: 11, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1152, file: !141, line: 816, column: 9)
!1232 = !DILocation(line: 816, column: 16, scope: !1231)
!1233 = !DILocation(line: 816, column: 28, scope: !1231)
!1234 = !DILocation(line: 816, column: 33, scope: !1231)
!1235 = !DILocation(line: 816, column: 24, scope: !1231)
!1236 = !DILocation(line: 816, column: 9, scope: !1152)
!1237 = !DILocation(line: 817, column: 7, scope: !1231)
!1238 = !DILocation(line: 787, column: 3, scope: !1239)
!1239 = !DILexicalBlockFile(scope: !1153, file: !141, discriminator: 1)
!1240 = !DILocation(line: 820, column: 22, scope: !1086)
!1241 = !DILocation(line: 820, column: 3, scope: !1086)
!1242 = !DILocation(line: 821, column: 7, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1086, file: !141, line: 821, column: 7)
!1244 = !DILocation(line: 821, column: 13, scope: !1243)
!1245 = !DILocation(line: 821, column: 17, scope: !1246)
!1246 = !DILexicalBlockFile(scope: !1243, file: !141, discriminator: 1)
!1247 = !DILocation(line: 821, column: 7, scope: !1246)
!1248 = !DILocation(line: 822, column: 11, scope: !1243)
!1249 = !DILocation(line: 822, column: 52, scope: !1243)
!1250 = !DILocation(line: 822, column: 56, scope: !1243)
!1251 = !DILocation(line: 822, column: 5, scope: !1246)
!1252 = !DILocation(line: 822, column: 5, scope: !1243)
!1253 = !DILocation(line: 824, column: 10, scope: !1086)
!1254 = !DILocation(line: 824, column: 3, scope: !1086)
!1255 = distinct !DISubprogram(name: "pkg_parse_field", scope: !141, file: !141, line: 110, type: !616, isLocal: true, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !340)
!1256 = !DILocalVariable(name: "ps", arg: 1, scope: !1255, file: !141, line: 110, type: !294)
!1257 = !DILocation(line: 110, column: 39, scope: !1255)
!1258 = !DILocalVariable(name: "fs", arg: 2, scope: !1255, file: !141, line: 110, type: !604)
!1259 = !DILocation(line: 110, column: 63, scope: !1255)
!1260 = !DILocalVariable(name: "parse_obj", arg: 3, scope: !1255, file: !141, line: 111, type: !135)
!1261 = !DILocation(line: 111, column: 23, scope: !1255)
!1262 = !DILocalVariable(name: "pkg_obj", scope: !1255, file: !141, line: 113, type: !1263)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1264 = !DILocation(line: 113, column: 28, scope: !1255)
!1265 = !DILocation(line: 113, column: 38, scope: !1255)
!1266 = !DILocalVariable(name: "fip", scope: !1255, file: !141, line: 114, type: !314)
!1267 = !DILocation(line: 114, column: 27, scope: !1255)
!1268 = !DILocalVariable(name: "ip", scope: !1255, file: !141, line: 115, type: !613)
!1269 = !DILocation(line: 115, column: 8, scope: !1255)
!1270 = !DILocation(line: 117, column: 12, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1255, file: !141, line: 117, column: 3)
!1272 = !DILocation(line: 117, column: 31, scope: !1271)
!1273 = !DILocation(line: 117, column: 35, scope: !1271)
!1274 = !DILocation(line: 117, column: 29, scope: !1271)
!1275 = !DILocation(line: 117, column: 8, scope: !1271)
!1276 = !DILocation(line: 117, column: 53, scope: !1277)
!1277 = !DILexicalBlockFile(scope: !1278, file: !141, discriminator: 1)
!1278 = distinct !DILexicalBlock(scope: !1271, file: !141, line: 117, column: 3)
!1279 = !DILocation(line: 117, column: 58, scope: !1277)
!1280 = !DILocation(line: 117, column: 3, scope: !1277)
!1281 = !DILocation(line: 118, column: 9, scope: !1282)
!1282 = distinct !DILexicalBlock(scope: !1278, file: !141, line: 118, column: 9)
!1283 = !DILocation(line: 118, column: 14, scope: !1282)
!1284 = !DILocation(line: 118, column: 33, scope: !1282)
!1285 = !DILocation(line: 118, column: 37, scope: !1282)
!1286 = !DILocation(line: 118, column: 25, scope: !1282)
!1287 = !DILocation(line: 118, column: 22, scope: !1282)
!1288 = !DILocation(line: 118, column: 46, scope: !1282)
!1289 = !DILocation(line: 119, column: 21, scope: !1282)
!1290 = !DILocation(line: 119, column: 26, scope: !1282)
!1291 = !DILocation(line: 119, column: 32, scope: !1282)
!1292 = !DILocation(line: 119, column: 36, scope: !1282)
!1293 = !DILocation(line: 119, column: 48, scope: !1282)
!1294 = !DILocation(line: 119, column: 52, scope: !1282)
!1295 = !DILocation(line: 119, column: 9, scope: !1282)
!1296 = !DILocation(line: 119, column: 62, scope: !1282)
!1297 = !DILocation(line: 118, column: 9, scope: !1277)
!1298 = !DILocation(line: 120, column: 7, scope: !1282)
!1299 = !DILocation(line: 119, column: 65, scope: !1300)
!1300 = !DILexicalBlockFile(scope: !1282, file: !141, discriminator: 1)
!1301 = !DILocation(line: 117, column: 67, scope: !1302)
!1302 = !DILexicalBlockFile(scope: !1278, file: !141, discriminator: 2)
!1303 = !DILocation(line: 117, column: 73, scope: !1302)
!1304 = !DILocation(line: 117, column: 3, scope: !1302)
!1305 = distinct !{!1305, !1306}
!1306 = !DILocation(line: 117, column: 3, scope: !1255)
!1307 = !DILocation(line: 121, column: 7, scope: !1308)
!1308 = distinct !DILexicalBlock(scope: !1255, file: !141, line: 121, column: 7)
!1309 = !DILocation(line: 121, column: 12, scope: !1308)
!1310 = !DILocation(line: 121, column: 7, scope: !1255)
!1311 = !DILocation(line: 122, column: 11, scope: !1312)
!1312 = distinct !DILexicalBlock(scope: !1313, file: !141, line: 122, column: 9)
!1313 = distinct !DILexicalBlock(scope: !1308, file: !141, line: 121, column: 18)
!1314 = !DILocation(line: 122, column: 14, scope: !1312)
!1315 = !DILocation(line: 122, column: 9, scope: !1313)
!1316 = !DILocation(line: 123, column: 19, scope: !1312)
!1317 = !DILocation(line: 124, column: 18, scope: !1312)
!1318 = !DILocation(line: 124, column: 55, scope: !1312)
!1319 = !DILocation(line: 124, column: 60, scope: !1312)
!1320 = !DILocation(line: 123, column: 7, scope: !1312)
!1321 = !DILocation(line: 126, column: 19, scope: !1313)
!1322 = !DILocation(line: 126, column: 23, scope: !1313)
!1323 = !DILocation(line: 126, column: 5, scope: !1313)
!1324 = !DILocation(line: 127, column: 21, scope: !1313)
!1325 = !DILocation(line: 127, column: 25, scope: !1313)
!1326 = !DILocation(line: 127, column: 32, scope: !1313)
!1327 = !DILocation(line: 127, column: 36, scope: !1313)
!1328 = !DILocation(line: 127, column: 48, scope: !1313)
!1329 = !DILocation(line: 127, column: 52, scope: !1313)
!1330 = !DILocation(line: 127, column: 5, scope: !1313)
!1331 = !DILocation(line: 128, column: 21, scope: !1313)
!1332 = !DILocation(line: 128, column: 25, scope: !1313)
!1333 = !DILocation(line: 128, column: 5, scope: !1313)
!1334 = !DILocation(line: 130, column: 5, scope: !1313)
!1335 = !DILocation(line: 130, column: 10, scope: !1313)
!1336 = !DILocation(line: 130, column: 16, scope: !1313)
!1337 = !DILocation(line: 130, column: 25, scope: !1313)
!1338 = !DILocation(line: 130, column: 30, scope: !1313)
!1339 = !DILocation(line: 130, column: 39, scope: !1313)
!1340 = !DILocation(line: 130, column: 47, scope: !1313)
!1341 = !DILocation(line: 130, column: 51, scope: !1313)
!1342 = !DILocation(line: 130, column: 55, scope: !1313)
!1343 = !DILocation(line: 130, column: 61, scope: !1313)
!1344 = !DILocation(line: 130, column: 66, scope: !1313)
!1345 = !DILocation(line: 131, column: 3, scope: !1313)
!1346 = !DILocalVariable(name: "arp", scope: !1347, file: !141, line: 132, type: !240)
!1347 = distinct !DILexicalBlock(scope: !1308, file: !141, line: 131, column: 10)
!1348 = !DILocation(line: 132, column: 28, scope: !1347)
!1349 = !DILocalVariable(name: "larpp", scope: !1347, file: !141, line: 132, type: !1350)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!1351 = !DILocation(line: 132, column: 35, scope: !1347)
!1352 = !DILocation(line: 134, column: 9, scope: !1353)
!1353 = distinct !DILexicalBlock(scope: !1347, file: !141, line: 134, column: 9)
!1354 = !DILocation(line: 134, column: 13, scope: !1353)
!1355 = !DILocation(line: 134, column: 22, scope: !1353)
!1356 = !DILocation(line: 134, column: 9, scope: !1347)
!1357 = !DILocation(line: 135, column: 19, scope: !1353)
!1358 = !DILocation(line: 136, column: 18, scope: !1353)
!1359 = !DILocation(line: 137, column: 19, scope: !1353)
!1360 = !DILocation(line: 137, column: 23, scope: !1353)
!1361 = !DILocation(line: 137, column: 33, scope: !1353)
!1362 = !DILocation(line: 137, column: 37, scope: !1353)
!1363 = !DILocation(line: 135, column: 7, scope: !1353)
!1364 = !DILocation(line: 138, column: 14, scope: !1347)
!1365 = !DILocation(line: 138, column: 23, scope: !1347)
!1366 = !DILocation(line: 138, column: 31, scope: !1347)
!1367 = !DILocation(line: 138, column: 11, scope: !1347)
!1368 = !DILocation(line: 139, column: 5, scope: !1347)
!1369 = !DILocation(line: 139, column: 20, scope: !1370)
!1370 = !DILexicalBlockFile(scope: !1347, file: !141, discriminator: 1)
!1371 = !DILocation(line: 139, column: 19, scope: !1370)
!1372 = !DILocation(line: 139, column: 17, scope: !1370)
!1373 = !DILocation(line: 139, column: 27, scope: !1370)
!1374 = !DILocation(line: 139, column: 5, scope: !1370)
!1375 = !DILocation(line: 140, column: 23, scope: !1376)
!1376 = distinct !DILexicalBlock(scope: !1377, file: !141, line: 140, column: 11)
!1377 = distinct !DILexicalBlock(scope: !1347, file: !141, line: 139, column: 35)
!1378 = !DILocation(line: 140, column: 28, scope: !1376)
!1379 = !DILocation(line: 140, column: 34, scope: !1376)
!1380 = !DILocation(line: 140, column: 38, scope: !1376)
!1381 = !DILocation(line: 140, column: 50, scope: !1376)
!1382 = !DILocation(line: 140, column: 54, scope: !1376)
!1383 = !DILocation(line: 140, column: 11, scope: !1376)
!1384 = !DILocation(line: 140, column: 64, scope: !1376)
!1385 = !DILocation(line: 140, column: 69, scope: !1376)
!1386 = !DILocation(line: 141, column: 18, scope: !1376)
!1387 = !DILocation(line: 141, column: 23, scope: !1376)
!1388 = !DILocation(line: 141, column: 11, scope: !1376)
!1389 = !DILocation(line: 141, column: 40, scope: !1376)
!1390 = !DILocation(line: 141, column: 44, scope: !1376)
!1391 = !DILocation(line: 141, column: 32, scope: !1376)
!1392 = !DILocation(line: 141, column: 29, scope: !1376)
!1393 = !DILocation(line: 140, column: 11, scope: !1394)
!1394 = !DILexicalBlockFile(scope: !1377, file: !141, discriminator: 1)
!1395 = !DILocation(line: 142, column: 21, scope: !1376)
!1396 = !DILocation(line: 143, column: 19, scope: !1376)
!1397 = !DILocation(line: 144, column: 20, scope: !1376)
!1398 = !DILocation(line: 144, column: 24, scope: !1376)
!1399 = !DILocation(line: 144, column: 34, scope: !1376)
!1400 = !DILocation(line: 144, column: 38, scope: !1376)
!1401 = !DILocation(line: 142, column: 9, scope: !1376)
!1402 = !DILocation(line: 145, column: 16, scope: !1377)
!1403 = !DILocation(line: 145, column: 21, scope: !1377)
!1404 = !DILocation(line: 145, column: 13, scope: !1377)
!1405 = !DILocation(line: 139, column: 5, scope: !1406)
!1406 = !DILexicalBlockFile(scope: !1347, file: !141, discriminator: 2)
!1407 = distinct !{!1407, !1368}
!1408 = !DILocation(line: 147, column: 11, scope: !1347)
!1409 = !DILocation(line: 147, column: 9, scope: !1347)
!1410 = !DILocation(line: 148, column: 28, scope: !1347)
!1411 = !DILocation(line: 148, column: 32, scope: !1347)
!1412 = !DILocation(line: 148, column: 44, scope: !1347)
!1413 = !DILocation(line: 148, column: 48, scope: !1347)
!1414 = !DILocation(line: 148, column: 17, scope: !1347)
!1415 = !DILocation(line: 148, column: 5, scope: !1347)
!1416 = !DILocation(line: 148, column: 10, scope: !1347)
!1417 = !DILocation(line: 148, column: 15, scope: !1347)
!1418 = !DILocation(line: 149, column: 29, scope: !1347)
!1419 = !DILocation(line: 149, column: 33, scope: !1347)
!1420 = !DILocation(line: 149, column: 45, scope: !1347)
!1421 = !DILocation(line: 149, column: 49, scope: !1347)
!1422 = !DILocation(line: 149, column: 18, scope: !1347)
!1423 = !DILocation(line: 149, column: 5, scope: !1347)
!1424 = !DILocation(line: 149, column: 10, scope: !1347)
!1425 = !DILocation(line: 149, column: 16, scope: !1347)
!1426 = !DILocation(line: 150, column: 5, scope: !1347)
!1427 = !DILocation(line: 150, column: 10, scope: !1347)
!1428 = !DILocation(line: 150, column: 15, scope: !1347)
!1429 = !DILocation(line: 151, column: 14, scope: !1347)
!1430 = !DILocation(line: 151, column: 6, scope: !1347)
!1431 = !DILocation(line: 151, column: 12, scope: !1347)
!1432 = !DILocation(line: 153, column: 1, scope: !1255)
!1433 = distinct !DISubprogram(name: "pkg_parse_verify", scope: !141, file: !141, line: 159, type: !1434, isLocal: true, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !340)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{null, !294, !156, !293}
!1436 = !DILocalVariable(name: "ps", arg: 1, scope: !1433, file: !141, line: 159, type: !294)
!1437 = !DILocation(line: 159, column: 40, scope: !1433)
!1438 = !DILocalVariable(name: "pkg", arg: 2, scope: !1433, file: !141, line: 160, type: !156)
!1439 = !DILocation(line: 160, column: 34, scope: !1433)
!1440 = !DILocalVariable(name: "pkgbin", arg: 3, scope: !1433, file: !141, line: 160, type: !293)
!1441 = !DILocation(line: 160, column: 54, scope: !1433)
!1442 = !DILocalVariable(name: "dep", scope: !1433, file: !141, line: 162, type: !174)
!1443 = !DILocation(line: 162, column: 22, scope: !1433)
!1444 = !DILocalVariable(name: "dop", scope: !1433, file: !141, line: 163, type: !170)
!1445 = !DILocation(line: 163, column: 20, scope: !1433)
!1446 = !DILocation(line: 165, column: 25, scope: !1433)
!1447 = !DILocation(line: 165, column: 29, scope: !1433)
!1448 = !DILocation(line: 165, column: 34, scope: !1433)
!1449 = !DILocation(line: 165, column: 39, scope: !1433)
!1450 = !DILocation(line: 165, column: 3, scope: !1433)
!1451 = !DILocation(line: 171, column: 8, scope: !1452)
!1452 = distinct !DILexicalBlock(scope: !1433, file: !141, line: 171, column: 7)
!1453 = !DILocation(line: 171, column: 12, scope: !1452)
!1454 = !DILocation(line: 171, column: 18, scope: !1452)
!1455 = !DILocation(line: 171, column: 41, scope: !1452)
!1456 = !DILocation(line: 172, column: 8, scope: !1452)
!1457 = !DILocation(line: 172, column: 13, scope: !1452)
!1458 = !DILocation(line: 172, column: 20, scope: !1452)
!1459 = !DILocation(line: 172, column: 45, scope: !1452)
