; ModuleID = './[inter]lib--dpkg--treewalk.o.i'
source_filename = "./[inter]lib--dpkg--treewalk.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.treenode = type { %struct.treenode*, %struct.treenode*, %struct.treenode**, i8*, i8*, i8*, %struct.stat*, i32, i64, i64, i64 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.treeroot = type { %struct.treenode*, %struct.treenode*, %struct.treenode*, i32, %struct.treewalk_funcs }
%struct.treewalk_funcs = type { i32 (%struct.treenode*)*, i32 (%struct.treenode*)*, i1 (%struct.treenode*)* }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }

@.str = private unnamed_addr constant [5 x i8] c"dpkg\00", align 1
@.str.1 = private unnamed_addr constant [36 x i8] c"treewalk root %s is not a directory\00", align 1
@.str.2 = private unnamed_addr constant [26 x i8] c"cannot stat pathname '%s'\00", align 1
@.str.3 = private unnamed_addr constant [27 x i8] c"cannot open directory '%s'\00", align 1
@.str.4 = private unnamed_addr constant [2 x i8] c".\00", align 1
@.str.5 = private unnamed_addr constant [3 x i8] c"..\00", align 1
@.str.6 = private unnamed_addr constant [6 x i8] c"%s/%s\00", align 1
@treeroot_sort_node.down_empty = internal global [2 x %struct.treenode*] zeroinitializer, align 16


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, globals: !79)
!1 = !DIFile(filename: "[inter]lib--dpkg--treewalk.o.i", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "treewalk_options", file: !4, line: 39, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../lib/dpkg/treewalk.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "TREEWALK_NONE", value: 0)
!7 = !DIEnumerator(name: "TREEWALK_FORCE_STAT", value: 1)
!8 = !DIEnumerator(name: "TREEWALK_FOLLOW_LINKS", value: 2)
!9 = !{!10, !11}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "treenode", file: !15, line: 40, size: 704, align: 64, elements: !16)
!15 = !DIFile(filename: "treewalk.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!16 = !{!17, !19, !20, !22, !25, !26, !27, !71, !74, !77, !78}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !14, file: !15, line: 41, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !14, file: !15, line: 42, baseType: !18, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !14, file: !15, line: 43, baseType: !21, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pathname", scope: !14, file: !15, line: 45, baseType: !23, size: 64, align: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "virtname", scope: !14, file: !15, line: 46, baseType: !23, size: 64, align: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !15, line: 47, baseType: !23, size: 64, align: 64, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !14, file: !15, line: 49, baseType: !28, size: 64, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !30, line: 46, size: 1152, align: 64, elements: !31)
!30 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!31 = !{!32, !36, !38, !40, !43, !45, !47, !49, !50, !53, !55, !57, !65, !66, !67}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !29, file: !30, line: 48, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !34, line: 124, baseType: !35)
!34 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!35 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !29, file: !30, line: 53, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !34, line: 127, baseType: !35)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !29, file: !30, line: 61, baseType: !39, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !34, line: 130, baseType: !35)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !29, file: !30, line: 62, baseType: !41, size: 32, align: 32, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !34, line: 129, baseType: !42)
!42 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !29, file: !30, line: 64, baseType: !44, size: 32, align: 32, offset: 224)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !34, line: 125, baseType: !42)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !29, file: !30, line: 65, baseType: !46, size: 32, align: 32, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !34, line: 126, baseType: !42)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !29, file: !30, line: 67, baseType: !48, size: 32, align: 32, offset: 288)
!48 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !29, file: !30, line: 69, baseType: !33, size: 64, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !29, file: !30, line: 74, baseType: !51, size: 64, align: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !34, line: 131, baseType: !52)
!52 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !29, file: !30, line: 78, baseType: !54, size: 64, align: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !34, line: 153, baseType: !52)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !29, file: !30, line: 80, baseType: !56, size: 64, align: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !34, line: 158, baseType: !52)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !29, file: !30, line: 91, baseType: !58, size: 128, align: 64, offset: 576)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !59, line: 120, size: 128, align: 64, elements: !60)
!59 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!60 = !{!61, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !58, file: !59, line: 122, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !34, line: 139, baseType: !52)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !58, file: !59, line: 123, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !34, line: 175, baseType: !52)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !29, file: !30, line: 92, baseType: !58, size: 128, align: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !29, file: !30, line: 93, baseType: !58, size: 128, align: 64, offset: 832)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !29, file: !30, line: 106, baseType: !68, size: 192, align: 64, offset: 960)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, align: 64, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 3)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !14, file: !15, line: 50, baseType: !72, size: 32, align: 32, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !73, line: 62, baseType: !41)
!73 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pathname_len", scope: !14, file: !15, line: 52, baseType: !75, size: 64, align: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 216, baseType: !35)
!76 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!77 = !DIDerivedType(tag: DW_TAG_member, name: "down_used", scope: !14, file: !15, line: 54, baseType: !75, size: 64, align: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "down_size", scope: !14, file: !15, line: 55, baseType: !75, size: 64, align: 64, offset: 640)
!79 = !{!80}
!80 = distinct !DIGlobalVariable(name: "down_empty", scope: !81, file: !15, line: 336, type: !109, isLocal: true, isDefinition: true, variable: [2 x %struct.treenode*]* @treeroot_sort_node.down_empty)
!81 = distinct !DISubprogram(name: "treeroot_sort_node", scope: !15, file: !15, line: 334, type: !82, isLocal: true, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !84, !18}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "treeroot", file: !15, line: 296, size: 448, align: 64, elements: !86)
!86 = !{!87, !88, !89, !90, !91}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "rootnode", scope: !85, file: !15, line: 297, baseType: !18, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "curdir", scope: !85, file: !15, line: 299, baseType: !18, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "curnode", scope: !85, file: !15, line: 300, baseType: !18, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !85, file: !15, line: 302, baseType: !3, size: 32, align: 32, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !85, file: !15, line: 303, baseType: !92, size: 192, align: 64, offset: 256)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "treewalk_funcs", file: !4, line: 51, size: 192, align: 64, elements: !93)
!93 = !{!94, !99, !102}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "visit", scope: !92, file: !4, line: 52, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "treenode_visit_func", file: !4, line: 47, baseType: !97)
!97 = !DISubroutineType(types: !98)
!98 = !{!48, !18}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !92, file: !4, line: 53, baseType: !100, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "treenode_sort_func", file: !4, line: 49, baseType: !97)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !92, file: !4, line: 54, baseType: !103, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "treenode_skip_func", file: !4, line: 48, baseType: !105)
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !18}
!107 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!108 = !{}
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 128, align: 64, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 2)
!112 = !{i32 2, !"Dwarf Version", i32 4}
!113 = !{i32 2, !"Debug Info Version", i32 3}
!114 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!115 = distinct !DISubprogram(name: "treenode_get_name", scope: !15, file: !15, line: 155, type: !116, isLocal: false, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !18}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!120 = !DILocalVariable(name: "node", arg: 1, scope: !115, file: !15, line: 155, type: !18)
!121 = !DIExpression()
!122 = !DILocation(line: 155, column: 36, scope: !115)
!123 = !DILocation(line: 157, column: 9, scope: !115)
!124 = !DILocation(line: 157, column: 15, scope: !115)
!125 = !DILocation(line: 157, column: 2, scope: !115)
!126 = distinct !DISubprogram(name: "treenode_get_pathname", scope: !15, file: !15, line: 161, type: !116, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!127 = !DILocalVariable(name: "node", arg: 1, scope: !126, file: !15, line: 161, type: !18)
!128 = !DILocation(line: 161, column: 40, scope: !126)
!129 = !DILocation(line: 163, column: 9, scope: !126)
!130 = !DILocation(line: 163, column: 15, scope: !126)
!131 = !DILocation(line: 163, column: 2, scope: !126)
!132 = distinct !DISubprogram(name: "treenode_get_virtname", scope: !15, file: !15, line: 167, type: !116, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!133 = !DILocalVariable(name: "node", arg: 1, scope: !132, file: !15, line: 167, type: !18)
!134 = !DILocation(line: 167, column: 40, scope: !132)
!135 = !DILocation(line: 169, column: 9, scope: !132)
!136 = !DILocation(line: 169, column: 15, scope: !132)
!137 = !DILocation(line: 169, column: 2, scope: !132)
!138 = distinct !DISubprogram(name: "treenode_get_mode", scope: !15, file: !15, line: 173, type: !139, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!139 = !DISubroutineType(types: !140)
!140 = !{!72, !18}
!141 = !DILocalVariable(name: "node", arg: 1, scope: !138, file: !15, line: 173, type: !18)
!142 = !DILocation(line: 173, column: 36, scope: !138)
!143 = !DILocation(line: 175, column: 9, scope: !138)
!144 = !DILocation(line: 175, column: 15, scope: !138)
!145 = !DILocation(line: 175, column: 2, scope: !138)
!146 = distinct !DISubprogram(name: "treenode_get_stat", scope: !15, file: !15, line: 179, type: !147, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!147 = !DISubroutineType(types: !148)
!148 = !{!28, !18}
!149 = !DILocalVariable(name: "node", arg: 1, scope: !146, file: !15, line: 179, type: !18)
!150 = !DILocation(line: 179, column: 36, scope: !146)
!151 = !DILocation(line: 181, column: 16, scope: !146)
!152 = !DILocation(line: 181, column: 2, scope: !146)
!153 = !DILocation(line: 182, column: 9, scope: !146)
!154 = !DILocation(line: 182, column: 15, scope: !146)
!155 = !DILocation(line: 182, column: 2, scope: !146)
!156 = distinct !DISubprogram(name: "treenode_stat", scope: !15, file: !15, line: 100, type: !157, isLocal: true, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !18, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "treewalk_stat_func", file: !15, line: 38, baseType: !161)
!161 = !DISubroutineType(types: !162)
!162 = !{!48, !118, !28}
!163 = !DILocalVariable(name: "node", arg: 1, scope: !156, file: !15, line: 100, type: !18)
!164 = !DILocation(line: 100, column: 32, scope: !156)
!165 = !DILocalVariable(name: "stat_func", arg: 2, scope: !156, file: !15, line: 100, type: !159)
!166 = !DILocation(line: 100, column: 58, scope: !156)
!167 = !DILocation(line: 102, column: 6, scope: !168)
!168 = distinct !DILexicalBlock(scope: !156, file: !15, line: 102, column: 6)
!169 = !DILocation(line: 102, column: 12, scope: !168)
!170 = !DILocation(line: 102, column: 6, scope: !156)
!171 = !DILocation(line: 103, column: 3, scope: !168)
!172 = !DILocation(line: 105, column: 15, scope: !156)
!173 = !DILocation(line: 105, column: 2, scope: !156)
!174 = !DILocation(line: 105, column: 8, scope: !156)
!175 = !DILocation(line: 105, column: 13, scope: !156)
!176 = !DILocation(line: 107, column: 6, scope: !177)
!177 = distinct !DILexicalBlock(scope: !156, file: !15, line: 107, column: 6)
!178 = !DILocation(line: 107, column: 16, scope: !177)
!179 = !DILocation(line: 107, column: 22, scope: !177)
!180 = !DILocation(line: 107, column: 32, scope: !177)
!181 = !DILocation(line: 107, column: 38, scope: !177)
!182 = !DILocation(line: 107, column: 44, scope: !177)
!183 = !DILocation(line: 107, column: 6, scope: !156)
!184 = !DILocation(line: 108, column: 10, scope: !177)
!185 = !DILocation(line: 108, column: 42, scope: !177)
!186 = !DILocation(line: 108, column: 48, scope: !177)
!187 = !DILocation(line: 108, column: 3, scope: !188)
!188 = !DILexicalBlockFile(scope: !177, file: !15, discriminator: 1)
!189 = !DILocation(line: 108, column: 3, scope: !177)
!190 = !DILocation(line: 110, column: 15, scope: !156)
!191 = !DILocation(line: 110, column: 21, scope: !156)
!192 = !DILocation(line: 110, column: 27, scope: !156)
!193 = !DILocation(line: 110, column: 2, scope: !156)
!194 = !DILocation(line: 110, column: 8, scope: !156)
!195 = !DILocation(line: 110, column: 13, scope: !156)
!196 = !DILocation(line: 111, column: 1, scope: !156)
!197 = !DILocation(line: 111, column: 1, scope: !198)
!198 = !DILexicalBlockFile(scope: !156, file: !15, discriminator: 1)
!199 = distinct !DISubprogram(name: "treenode_get_parent", scope: !15, file: !15, line: 186, type: !200, isLocal: false, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!200 = !DISubroutineType(types: !201)
!201 = !{!18, !18}
!202 = !DILocalVariable(name: "node", arg: 1, scope: !199, file: !15, line: 186, type: !18)
!203 = !DILocation(line: 186, column: 38, scope: !199)
!204 = !DILocation(line: 188, column: 9, scope: !199)
!205 = !DILocation(line: 188, column: 15, scope: !199)
!206 = !DILocation(line: 188, column: 2, scope: !199)
!207 = distinct !DISubprogram(name: "treewalk_open", scope: !15, file: !15, line: 364, type: !208, isLocal: false, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!208 = !DISubroutineType(types: !209)
!209 = !{!84, !118, !3, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!211 = !DILocalVariable(name: "rootdir", arg: 1, scope: !207, file: !15, line: 364, type: !118)
!212 = !DILocation(line: 364, column: 27, scope: !207)
!213 = !DILocalVariable(name: "options", arg: 2, scope: !207, file: !15, line: 364, type: !3)
!214 = !DILocation(line: 364, column: 58, scope: !207)
!215 = !DILocalVariable(name: "func", arg: 3, scope: !207, file: !15, line: 365, type: !210)
!216 = !DILocation(line: 365, column: 38, scope: !207)
!217 = !DILocalVariable(name: "tree", scope: !207, file: !15, line: 367, type: !84)
!218 = !DILocation(line: 367, column: 19, scope: !207)
!219 = !DILocalVariable(name: "root", scope: !207, file: !15, line: 368, type: !18)
!220 = !DILocation(line: 368, column: 19, scope: !207)
!221 = !DILocation(line: 370, column: 9, scope: !207)
!222 = !DILocation(line: 370, column: 7, scope: !207)
!223 = !DILocation(line: 372, column: 18, scope: !207)
!224 = !DILocation(line: 372, column: 2, scope: !207)
!225 = !DILocation(line: 372, column: 8, scope: !207)
!226 = !DILocation(line: 372, column: 16, scope: !207)
!227 = !DILocation(line: 373, column: 6, scope: !228)
!228 = distinct !DILexicalBlock(scope: !207, file: !15, line: 373, column: 6)
!229 = !DILocation(line: 373, column: 6, scope: !207)
!230 = !DILocation(line: 374, column: 3, scope: !228)
!231 = !DILocation(line: 374, column: 9, scope: !228)
!232 = !DILocation(line: 374, column: 17, scope: !228)
!233 = !DILocation(line: 374, column: 16, scope: !228)
!234 = !DILocation(line: 376, column: 3, scope: !228)
!235 = !DILocation(line: 376, column: 9, scope: !228)
!236 = !DILocation(line: 376, column: 16, scope: !228)
!237 = !DILocation(line: 376, column: 16, scope: !238)
!238 = !DILexicalBlockFile(scope: !228, file: !15, discriminator: 1)
!239 = !DILocation(line: 378, column: 27, scope: !207)
!240 = !DILocation(line: 378, column: 9, scope: !207)
!241 = !DILocation(line: 378, column: 7, scope: !207)
!242 = !DILocation(line: 379, column: 16, scope: !207)
!243 = !DILocation(line: 379, column: 2, scope: !207)
!244 = !DILocation(line: 381, column: 23, scope: !245)
!245 = distinct !DILexicalBlock(scope: !207, file: !15, line: 381, column: 6)
!246 = !DILocation(line: 381, column: 7, scope: !245)
!247 = !DILocation(line: 381, column: 6, scope: !207)
!248 = !DILocation(line: 382, column: 9, scope: !245)
!249 = !DILocation(line: 382, column: 51, scope: !245)
!250 = !DILocation(line: 382, column: 3, scope: !251)
!251 = !DILexicalBlockFile(scope: !245, file: !15, discriminator: 1)
!252 = !DILocation(line: 382, column: 3, scope: !245)
!253 = !DILocation(line: 384, column: 23, scope: !207)
!254 = !DILocation(line: 384, column: 29, scope: !207)
!255 = !DILocation(line: 384, column: 2, scope: !207)
!256 = !DILocation(line: 385, column: 34, scope: !207)
!257 = !DILocation(line: 385, column: 19, scope: !207)
!258 = !DILocation(line: 385, column: 25, scope: !207)
!259 = !DILocation(line: 385, column: 32, scope: !207)
!260 = !DILocation(line: 385, column: 2, scope: !207)
!261 = !DILocation(line: 385, column: 8, scope: !207)
!262 = !DILocation(line: 385, column: 17, scope: !207)
!263 = !DILocation(line: 387, column: 9, scope: !207)
!264 = !DILocation(line: 387, column: 2, scope: !207)
!265 = distinct !DISubprogram(name: "treenode_root_new", scope: !15, file: !15, line: 65, type: !266, isLocal: true, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!266 = !DISubroutineType(types: !267)
!267 = !{!18, !118}
!268 = !DILocalVariable(name: "rootdir", arg: 1, scope: !265, file: !15, line: 65, type: !118)
!269 = !DILocation(line: 65, column: 31, scope: !265)
!270 = !DILocalVariable(name: "node", scope: !265, file: !15, line: 67, type: !18)
!271 = !DILocation(line: 67, column: 19, scope: !265)
!272 = !DILocation(line: 69, column: 9, scope: !265)
!273 = !DILocation(line: 69, column: 7, scope: !265)
!274 = !DILocation(line: 70, column: 2, scope: !265)
!275 = !DILocation(line: 70, column: 8, scope: !265)
!276 = !DILocation(line: 70, column: 11, scope: !265)
!277 = !DILocation(line: 71, column: 28, scope: !265)
!278 = !DILocation(line: 71, column: 19, scope: !265)
!279 = !DILocation(line: 71, column: 2, scope: !265)
!280 = !DILocation(line: 71, column: 8, scope: !265)
!281 = !DILocation(line: 71, column: 17, scope: !265)
!282 = !DILocation(line: 72, column: 30, scope: !265)
!283 = !DILocation(line: 72, column: 36, scope: !265)
!284 = !DILocation(line: 72, column: 23, scope: !265)
!285 = !DILocation(line: 72, column: 2, scope: !265)
!286 = !DILocation(line: 72, column: 8, scope: !265)
!287 = !DILocation(line: 72, column: 21, scope: !265)
!288 = !DILocation(line: 73, column: 19, scope: !265)
!289 = !DILocation(line: 73, column: 25, scope: !265)
!290 = !DILocation(line: 73, column: 36, scope: !265)
!291 = !DILocation(line: 73, column: 42, scope: !265)
!292 = !DILocation(line: 73, column: 34, scope: !265)
!293 = !DILocation(line: 73, column: 2, scope: !265)
!294 = !DILocation(line: 73, column: 8, scope: !265)
!295 = !DILocation(line: 73, column: 17, scope: !265)
!296 = !DILocation(line: 74, column: 23, scope: !265)
!297 = !DILocation(line: 74, column: 29, scope: !265)
!298 = !DILocation(line: 74, column: 15, scope: !265)
!299 = !DILocation(line: 74, column: 2, scope: !265)
!300 = !DILocation(line: 74, column: 8, scope: !265)
!301 = !DILocation(line: 74, column: 13, scope: !265)
!302 = !DILocation(line: 75, column: 6, scope: !303)
!303 = distinct !DILexicalBlock(scope: !265, file: !15, line: 75, column: 6)
!304 = !DILocation(line: 75, column: 12, scope: !303)
!305 = !DILocation(line: 75, column: 17, scope: !303)
!306 = !DILocation(line: 75, column: 6, scope: !265)
!307 = !DILocation(line: 76, column: 16, scope: !303)
!308 = !DILocation(line: 76, column: 22, scope: !303)
!309 = !DILocation(line: 76, column: 3, scope: !303)
!310 = !DILocation(line: 76, column: 9, scope: !303)
!311 = !DILocation(line: 76, column: 14, scope: !303)
!312 = !DILocation(line: 78, column: 3, scope: !303)
!313 = !DILocation(line: 78, column: 9, scope: !303)
!314 = !DILocation(line: 78, column: 13, scope: !303)
!315 = !DILocation(line: 80, column: 9, scope: !265)
!316 = !DILocation(line: 80, column: 2, scope: !265)
!317 = distinct !DISubprogram(name: "treenode_is_dir", scope: !15, file: !15, line: 192, type: !105, isLocal: true, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!318 = !DILocalVariable(name: "node", arg: 1, scope: !317, file: !15, line: 192, type: !18)
!319 = !DILocation(line: 192, column: 34, scope: !317)
!320 = !DILocation(line: 194, column: 9, scope: !317)
!321 = !DILocation(line: 194, column: 14, scope: !317)
!322 = !DILocation(line: 194, column: 16, scope: !323)
!323 = !DILexicalBlockFile(scope: !317, file: !15, discriminator: 1)
!324 = !DILocation(line: 194, column: 22, scope: !323)
!325 = !DILocation(line: 194, column: 19, scope: !323)
!326 = !DILocation(line: 194, column: 30, scope: !323)
!327 = !DILocation(line: 194, column: 2, scope: !328)
!328 = !DILexicalBlockFile(scope: !317, file: !15, discriminator: 2)
!329 = distinct !DISubprogram(name: "treeroot_set_curnode", scope: !15, file: !15, line: 313, type: !82, isLocal: true, isDefinition: true, scopeLine: 314, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!330 = !DILocalVariable(name: "tree", arg: 1, scope: !329, file: !15, line: 313, type: !84)
!331 = !DILocation(line: 313, column: 39, scope: !329)
!332 = !DILocalVariable(name: "node", arg: 2, scope: !329, file: !15, line: 313, type: !18)
!333 = !DILocation(line: 313, column: 62, scope: !329)
!334 = !DILocation(line: 315, column: 18, scope: !329)
!335 = !DILocation(line: 315, column: 2, scope: !329)
!336 = !DILocation(line: 315, column: 8, scope: !329)
!337 = !DILocation(line: 315, column: 16, scope: !329)
!338 = !DILocation(line: 316, column: 1, scope: !329)
!339 = distinct !DISubprogram(name: "treewalk_node", scope: !15, file: !15, line: 409, type: !340, isLocal: false, isDefinition: true, scopeLine: 410, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!340 = !DISubroutineType(types: !341)
!341 = !{!18, !84}
!342 = !DILocalVariable(name: "tree", arg: 1, scope: !339, file: !15, line: 409, type: !84)
!343 = !DILocation(line: 409, column: 32, scope: !339)
!344 = !DILocation(line: 411, column: 9, scope: !339)
!345 = !DILocation(line: 411, column: 15, scope: !339)
!346 = !DILocation(line: 411, column: 2, scope: !339)
!347 = distinct !DISubprogram(name: "treewalk_next", scope: !15, file: !15, line: 435, type: !340, isLocal: false, isDefinition: true, scopeLine: 436, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!348 = !DILocalVariable(name: "tree", arg: 1, scope: !347, file: !15, line: 435, type: !84)
!349 = !DILocation(line: 435, column: 32, scope: !347)
!350 = !DILocalVariable(name: "node", scope: !347, file: !15, line: 437, type: !18)
!351 = !DILocation(line: 437, column: 19, scope: !347)
!352 = !DILocation(line: 439, column: 9, scope: !347)
!353 = !DILocation(line: 439, column: 15, scope: !347)
!354 = !DILocation(line: 439, column: 7, scope: !347)
!355 = !DILocation(line: 442, column: 6, scope: !356)
!356 = distinct !DILexicalBlock(scope: !347, file: !15, line: 442, column: 6)
!357 = !DILocation(line: 442, column: 11, scope: !356)
!358 = !DILocation(line: 442, column: 6, scope: !347)
!359 = !DILocation(line: 443, column: 3, scope: !356)
!360 = !DILocation(line: 446, column: 22, scope: !361)
!361 = distinct !DILexicalBlock(scope: !347, file: !15, line: 446, column: 6)
!362 = !DILocation(line: 446, column: 6, scope: !361)
!363 = !DILocation(line: 446, column: 28, scope: !361)
!364 = !DILocation(line: 446, column: 51, scope: !365)
!365 = !DILexicalBlockFile(scope: !361, file: !15, discriminator: 1)
!366 = !DILocation(line: 446, column: 57, scope: !365)
!367 = !DILocation(line: 446, column: 32, scope: !365)
!368 = !DILocation(line: 446, column: 6, scope: !365)
!369 = !DILocalVariable(name: "dir", scope: !370, file: !15, line: 447, type: !18)
!370 = distinct !DILexicalBlock(scope: !361, file: !15, line: 446, column: 64)
!371 = !DILocation(line: 447, column: 20, scope: !370)
!372 = !DILocation(line: 449, column: 22, scope: !370)
!373 = !DILocation(line: 449, column: 28, scope: !370)
!374 = !DILocation(line: 449, column: 3, scope: !370)
!375 = !DILocation(line: 450, column: 22, scope: !370)
!376 = !DILocation(line: 450, column: 28, scope: !370)
!377 = !DILocation(line: 450, column: 3, scope: !370)
!378 = !DILocation(line: 451, column: 23, scope: !370)
!379 = !DILocation(line: 451, column: 29, scope: !370)
!380 = !DILocation(line: 451, column: 3, scope: !370)
!381 = !DILocation(line: 454, column: 14, scope: !382)
!382 = distinct !DILexicalBlock(scope: !370, file: !15, line: 454, column: 3)
!383 = !DILocation(line: 454, column: 20, scope: !382)
!384 = !DILocation(line: 454, column: 12, scope: !382)
!385 = !DILocation(line: 454, column: 8, scope: !382)
!386 = !DILocation(line: 454, column: 24, scope: !387)
!387 = !DILexicalBlockFile(scope: !388, file: !15, discriminator: 1)
!388 = distinct !DILexicalBlock(scope: !382, file: !15, line: 454, column: 3)
!389 = !DILocation(line: 454, column: 3, scope: !387)
!390 = !DILocation(line: 455, column: 8, scope: !391)
!391 = distinct !DILexicalBlock(scope: !392, file: !15, line: 455, column: 8)
!392 = distinct !DILexicalBlock(scope: !388, file: !15, line: 454, column: 44)
!393 = !DILocation(line: 455, column: 13, scope: !391)
!394 = !DILocation(line: 455, column: 19, scope: !391)
!395 = !DILocation(line: 455, column: 29, scope: !391)
!396 = !DILocation(line: 455, column: 35, scope: !391)
!397 = !DILocation(line: 455, column: 41, scope: !391)
!398 = !DILocation(line: 455, column: 26, scope: !391)
!399 = !DILocation(line: 455, column: 48, scope: !391)
!400 = !DILocation(line: 456, column: 8, scope: !391)
!401 = !DILocation(line: 456, column: 13, scope: !391)
!402 = !DILocation(line: 456, column: 19, scope: !391)
!403 = !DILocation(line: 456, column: 29, scope: !391)
!404 = !DILocation(line: 456, column: 35, scope: !391)
!405 = !DILocation(line: 456, column: 41, scope: !391)
!406 = !DILocation(line: 456, column: 26, scope: !391)
!407 = !DILocation(line: 455, column: 8, scope: !408)
!408 = !DILexicalBlockFile(scope: !392, file: !15, discriminator: 1)
!409 = !DILocation(line: 457, column: 5, scope: !391)
!410 = !DILocation(line: 458, column: 3, scope: !392)
!411 = !DILocation(line: 454, column: 35, scope: !412)
!412 = !DILexicalBlockFile(scope: !388, file: !15, discriminator: 2)
!413 = !DILocation(line: 454, column: 40, scope: !412)
!414 = !DILocation(line: 454, column: 33, scope: !412)
!415 = !DILocation(line: 454, column: 3, scope: !412)
!416 = distinct !{!416, !417}
!417 = !DILocation(line: 454, column: 3, scope: !370)
!418 = !DILocation(line: 461, column: 7, scope: !419)
!419 = distinct !DILexicalBlock(scope: !370, file: !15, line: 461, column: 7)
!420 = !DILocation(line: 461, column: 7, scope: !370)
!421 = !DILocation(line: 462, column: 11, scope: !419)
!422 = !DILocation(line: 462, column: 17, scope: !419)
!423 = !DILocation(line: 462, column: 9, scope: !419)
!424 = !DILocation(line: 462, column: 4, scope: !419)
!425 = !DILocation(line: 464, column: 11, scope: !419)
!426 = !DILocation(line: 464, column: 17, scope: !419)
!427 = !DILocation(line: 464, column: 9, scope: !419)
!428 = !DILocation(line: 465, column: 2, scope: !370)
!429 = !DILocation(line: 466, column: 10, scope: !430)
!430 = distinct !DILexicalBlock(scope: !361, file: !15, line: 465, column: 9)
!431 = !DILocation(line: 466, column: 16, scope: !430)
!432 = !DILocation(line: 466, column: 8, scope: !430)
!433 = !DILocation(line: 470, column: 2, scope: !347)
!434 = !DILocation(line: 470, column: 9, scope: !435)
!435 = !DILexicalBlockFile(scope: !347, file: !15, discriminator: 1)
!436 = !DILocation(line: 470, column: 14, scope: !435)
!437 = !DILocation(line: 470, column: 2, scope: !435)
!438 = !DILocalVariable(name: "olddir", scope: !439, file: !15, line: 471, type: !18)
!439 = distinct !DILexicalBlock(scope: !347, file: !15, line: 470, column: 22)
!440 = !DILocation(line: 471, column: 20, scope: !439)
!441 = !DILocation(line: 471, column: 29, scope: !439)
!442 = !DILocation(line: 471, column: 35, scope: !439)
!443 = !DILocation(line: 473, column: 7, scope: !444)
!444 = distinct !DILexicalBlock(scope: !439, file: !15, line: 473, column: 7)
!445 = !DILocation(line: 473, column: 13, scope: !444)
!446 = !DILocation(line: 473, column: 21, scope: !444)
!447 = !DILocation(line: 473, column: 7, scope: !439)
!448 = !DILocation(line: 475, column: 11, scope: !449)
!449 = distinct !DILexicalBlock(scope: !444, file: !15, line: 473, column: 27)
!450 = !DILocation(line: 475, column: 17, scope: !449)
!451 = !DILocation(line: 475, column: 25, scope: !449)
!452 = !DILocation(line: 475, column: 9, scope: !449)
!453 = !DILocation(line: 476, column: 24, scope: !449)
!454 = !DILocation(line: 476, column: 30, scope: !449)
!455 = !DILocation(line: 476, column: 38, scope: !449)
!456 = !DILocation(line: 476, column: 4, scope: !449)
!457 = !DILocation(line: 477, column: 23, scope: !449)
!458 = !DILocation(line: 477, column: 4, scope: !449)
!459 = !DILocation(line: 478, column: 3, scope: !449)
!460 = !DILocation(line: 478, column: 14, scope: !461)
!461 = !DILexicalBlockFile(scope: !462, file: !15, discriminator: 1)
!462 = distinct !DILexicalBlock(scope: !444, file: !15, line: 478, column: 14)
!463 = !DILocation(line: 478, column: 20, scope: !461)
!464 = !DILocation(line: 478, column: 28, scope: !461)
!465 = !DILocation(line: 480, column: 11, scope: !466)
!466 = distinct !DILexicalBlock(scope: !462, file: !15, line: 478, column: 32)
!467 = !DILocation(line: 480, column: 17, scope: !466)
!468 = !DILocation(line: 480, column: 25, scope: !466)
!469 = !DILocation(line: 480, column: 29, scope: !466)
!470 = !DILocation(line: 480, column: 9, scope: !466)
!471 = !DILocation(line: 481, column: 24, scope: !466)
!472 = !DILocation(line: 481, column: 30, scope: !466)
!473 = !DILocation(line: 481, column: 38, scope: !466)
!474 = !DILocation(line: 481, column: 42, scope: !466)
!475 = !DILocation(line: 481, column: 4, scope: !466)
!476 = !DILocation(line: 482, column: 23, scope: !466)
!477 = !DILocation(line: 482, column: 4, scope: !466)
!478 = !DILocation(line: 483, column: 23, scope: !466)
!479 = !DILocation(line: 483, column: 31, scope: !466)
!480 = !DILocation(line: 483, column: 4, scope: !466)
!481 = !DILocation(line: 484, column: 3, scope: !466)
!482 = !DILocation(line: 486, column: 23, scope: !483)
!483 = distinct !DILexicalBlock(scope: !462, file: !15, line: 484, column: 10)
!484 = !DILocation(line: 486, column: 4, scope: !483)
!485 = !DILocation(line: 487, column: 23, scope: !483)
!486 = !DILocation(line: 487, column: 4, scope: !483)
!487 = !DILocation(line: 488, column: 4, scope: !483)
!488 = !DILocation(line: 491, column: 7, scope: !489)
!489 = distinct !DILexicalBlock(scope: !439, file: !15, line: 491, column: 7)
!490 = !DILocation(line: 491, column: 13, scope: !489)
!491 = !DILocation(line: 491, column: 20, scope: !489)
!492 = !DILocation(line: 491, column: 7, scope: !439)
!493 = !DILocation(line: 492, column: 4, scope: !489)
!494 = !DILocation(line: 470, column: 2, scope: !495)
!495 = !DILexicalBlockFile(scope: !347, file: !15, discriminator: 2)
!496 = distinct !{!496, !433}
!497 = !DILocation(line: 495, column: 23, scope: !347)
!498 = !DILocation(line: 495, column: 29, scope: !347)
!499 = !DILocation(line: 495, column: 2, scope: !347)
!500 = !DILocation(line: 497, column: 9, scope: !347)
!501 = !DILocation(line: 497, column: 2, scope: !347)
!502 = !DILocation(line: 498, column: 1, scope: !347)
!503 = distinct !DISubprogram(name: "treeroot_skip_node", scope: !15, file: !15, line: 319, type: !504, isLocal: true, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!504 = !DISubroutineType(types: !505)
!505 = !{!107, !84, !18}
!506 = !DILocalVariable(name: "tree", arg: 1, scope: !503, file: !15, line: 319, type: !84)
!507 = !DILocation(line: 319, column: 37, scope: !503)
!508 = !DILocalVariable(name: "node", arg: 2, scope: !503, file: !15, line: 319, type: !18)
!509 = !DILocation(line: 319, column: 60, scope: !503)
!510 = !DILocation(line: 321, column: 6, scope: !511)
!511 = distinct !DILexicalBlock(scope: !503, file: !15, line: 321, column: 6)
!512 = !DILocation(line: 321, column: 12, scope: !511)
!513 = !DILocation(line: 321, column: 17, scope: !511)
!514 = !DILocation(line: 321, column: 6, scope: !503)
!515 = !DILocation(line: 322, column: 10, scope: !511)
!516 = !DILocation(line: 322, column: 16, scope: !511)
!517 = !DILocation(line: 322, column: 21, scope: !511)
!518 = !DILocation(line: 322, column: 26, scope: !511)
!519 = !DILocation(line: 322, column: 3, scope: !511)
!520 = !DILocation(line: 324, column: 2, scope: !503)
!521 = !DILocation(line: 325, column: 1, scope: !503)
!522 = distinct !DISubprogram(name: "treeroot_fill_node", scope: !15, file: !15, line: 328, type: !82, isLocal: true, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!523 = !DILocalVariable(name: "tree", arg: 1, scope: !522, file: !15, line: 328, type: !84)
!524 = !DILocation(line: 328, column: 37, scope: !522)
!525 = !DILocalVariable(name: "dir", arg: 2, scope: !522, file: !15, line: 328, type: !18)
!526 = !DILocation(line: 328, column: 60, scope: !522)
!527 = !DILocation(line: 330, column: 21, scope: !522)
!528 = !DILocation(line: 330, column: 27, scope: !522)
!529 = !DILocation(line: 330, column: 37, scope: !522)
!530 = !DILocation(line: 330, column: 42, scope: !522)
!531 = !DILocation(line: 330, column: 48, scope: !522)
!532 = !DILocation(line: 330, column: 2, scope: !522)
!533 = !DILocation(line: 331, column: 1, scope: !522)
!534 = !DILocalVariable(name: "tree", arg: 1, scope: !81, file: !15, line: 334, type: !84)
!535 = !DILocation(line: 334, column: 37, scope: !81)
!536 = !DILocalVariable(name: "dir", arg: 2, scope: !81, file: !15, line: 334, type: !18)
!537 = !DILocation(line: 334, column: 60, scope: !81)
!538 = !DILocation(line: 338, column: 6, scope: !539)
!539 = distinct !DILexicalBlock(scope: !81, file: !15, line: 338, column: 6)
!540 = !DILocation(line: 338, column: 11, scope: !539)
!541 = !DILocation(line: 338, column: 21, scope: !539)
!542 = !DILocation(line: 338, column: 6, scope: !81)
!543 = !DILocation(line: 339, column: 3, scope: !539)
!544 = !DILocation(line: 339, column: 8, scope: !539)
!545 = !DILocation(line: 339, column: 13, scope: !539)
!546 = !DILocation(line: 340, column: 11, scope: !547)
!547 = distinct !DILexicalBlock(scope: !539, file: !15, line: 340, column: 11)
!548 = !DILocation(line: 340, column: 17, scope: !547)
!549 = !DILocation(line: 340, column: 22, scope: !547)
!550 = !DILocation(line: 340, column: 11, scope: !539)
!551 = !DILocation(line: 341, column: 3, scope: !547)
!552 = !DILocation(line: 341, column: 9, scope: !547)
!553 = !DILocation(line: 341, column: 14, scope: !547)
!554 = !DILocation(line: 341, column: 19, scope: !547)
!555 = !DILocation(line: 343, column: 22, scope: !547)
!556 = !DILocation(line: 343, column: 3, scope: !547)
!557 = !DILocation(line: 344, column: 1, scope: !81)
!558 = distinct !DISubprogram(name: "treeroot_set_curdir", scope: !15, file: !15, line: 307, type: !82, isLocal: true, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!559 = !DILocalVariable(name: "tree", arg: 1, scope: !558, file: !15, line: 307, type: !84)
!560 = !DILocation(line: 307, column: 38, scope: !558)
!561 = !DILocalVariable(name: "node", arg: 2, scope: !558, file: !15, line: 307, type: !18)
!562 = !DILocation(line: 307, column: 61, scope: !558)
!563 = !DILocation(line: 309, column: 17, scope: !558)
!564 = !DILocation(line: 309, column: 2, scope: !558)
!565 = !DILocation(line: 309, column: 8, scope: !558)
!566 = !DILocation(line: 309, column: 15, scope: !558)
!567 = !DILocation(line: 310, column: 1, scope: !558)
!568 = distinct !DISubprogram(name: "treenode_free_down", scope: !15, file: !15, line: 281, type: !569, isLocal: true, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !18}
!571 = !DILocalVariable(name: "node", arg: 1, scope: !568, file: !15, line: 281, type: !18)
!572 = !DILocation(line: 281, column: 37, scope: !568)
!573 = !DILocalVariable(name: "i", scope: !568, file: !15, line: 283, type: !75)
!574 = !DILocation(line: 283, column: 9, scope: !568)
!575 = !DILocation(line: 285, column: 7, scope: !576)
!576 = distinct !DILexicalBlock(scope: !568, file: !15, line: 285, column: 6)
!577 = !DILocation(line: 285, column: 13, scope: !576)
!578 = !DILocation(line: 285, column: 6, scope: !568)
!579 = !DILocation(line: 286, column: 3, scope: !576)
!580 = !DILocation(line: 288, column: 9, scope: !581)
!581 = distinct !DILexicalBlock(scope: !568, file: !15, line: 288, column: 2)
!582 = !DILocation(line: 288, column: 7, scope: !581)
!583 = !DILocation(line: 288, column: 14, scope: !584)
!584 = !DILexicalBlockFile(scope: !585, file: !15, discriminator: 1)
!585 = distinct !DILexicalBlock(scope: !581, file: !15, line: 288, column: 2)
!586 = !DILocation(line: 288, column: 18, scope: !584)
!587 = !DILocation(line: 288, column: 24, scope: !584)
!588 = !DILocation(line: 288, column: 16, scope: !584)
!589 = !DILocation(line: 288, column: 2, scope: !584)
!590 = !DILocation(line: 289, column: 33, scope: !585)
!591 = !DILocation(line: 289, column: 22, scope: !585)
!592 = !DILocation(line: 289, column: 28, scope: !585)
!593 = !DILocation(line: 289, column: 3, scope: !585)
!594 = !DILocation(line: 288, column: 36, scope: !595)
!595 = !DILexicalBlockFile(scope: !585, file: !15, discriminator: 2)
!596 = !DILocation(line: 288, column: 2, scope: !595)
!597 = distinct !{!597, !598}
!598 = !DILocation(line: 288, column: 2, scope: !568)
!599 = !DILocation(line: 290, column: 7, scope: !568)
!600 = !DILocation(line: 290, column: 13, scope: !568)
!601 = !DILocation(line: 290, column: 2, scope: !568)
!602 = !DILocation(line: 291, column: 1, scope: !568)
!603 = !DILocation(line: 291, column: 1, scope: !604)
!604 = !DILexicalBlockFile(scope: !568, file: !15, discriminator: 1)
!605 = distinct !DISubprogram(name: "treenode_free_node", scope: !15, file: !15, line: 274, type: !569, isLocal: true, isDefinition: true, scopeLine: 275, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!606 = !DILocalVariable(name: "node", arg: 1, scope: !605, file: !15, line: 274, type: !18)
!607 = !DILocation(line: 274, column: 37, scope: !605)
!608 = !DILocation(line: 276, column: 7, scope: !605)
!609 = !DILocation(line: 276, column: 13, scope: !605)
!610 = !DILocation(line: 276, column: 2, scope: !605)
!611 = !DILocation(line: 277, column: 7, scope: !605)
!612 = !DILocation(line: 277, column: 2, scope: !605)
!613 = !DILocation(line: 278, column: 1, scope: !605)
!614 = distinct !DISubprogram(name: "treewalk_close", scope: !15, file: !15, line: 506, type: !615, isLocal: false, isDefinition: true, scopeLine: 507, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !84}
!617 = !DILocalVariable(name: "tree", arg: 1, scope: !614, file: !15, line: 506, type: !84)
!618 = !DILocation(line: 506, column: 33, scope: !614)
!619 = !DILocation(line: 508, column: 7, scope: !614)
!620 = !DILocation(line: 508, column: 2, scope: !614)
!621 = !DILocation(line: 509, column: 1, scope: !614)
!622 = distinct !DISubprogram(name: "treewalk", scope: !15, file: !15, line: 519, type: !623, isLocal: false, isDefinition: true, scopeLine: 521, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!623 = !DISubroutineType(types: !624)
!624 = !{!48, !118, !3, !210}
!625 = !DILocalVariable(name: "rootdir", arg: 1, scope: !622, file: !15, line: 519, type: !118)
!626 = !DILocation(line: 519, column: 22, scope: !622)
!627 = !DILocalVariable(name: "options", arg: 2, scope: !622, file: !15, line: 519, type: !3)
!628 = !DILocation(line: 519, column: 53, scope: !622)
!629 = !DILocalVariable(name: "func", arg: 3, scope: !622, file: !15, line: 520, type: !210)
!630 = !DILocation(line: 520, column: 33, scope: !622)
!631 = !DILocalVariable(name: "tree", scope: !622, file: !15, line: 522, type: !84)
!632 = !DILocation(line: 522, column: 19, scope: !622)
!633 = !DILocalVariable(name: "node", scope: !622, file: !15, line: 523, type: !18)
!634 = !DILocation(line: 523, column: 19, scope: !622)
!635 = !DILocation(line: 525, column: 23, scope: !622)
!636 = !DILocation(line: 525, column: 32, scope: !622)
!637 = !DILocation(line: 525, column: 41, scope: !622)
!638 = !DILocation(line: 525, column: 9, scope: !622)
!639 = !DILocation(line: 525, column: 7, scope: !622)
!640 = !DILocation(line: 528, column: 28, scope: !641)
!641 = distinct !DILexicalBlock(scope: !622, file: !15, line: 528, column: 2)
!642 = !DILocation(line: 528, column: 14, scope: !641)
!643 = !DILocation(line: 528, column: 12, scope: !641)
!644 = !DILocation(line: 528, column: 7, scope: !641)
!645 = !DILocation(line: 528, column: 35, scope: !646)
!646 = !DILexicalBlockFile(scope: !647, file: !15, discriminator: 1)
!647 = distinct !DILexicalBlock(scope: !641, file: !15, line: 528, column: 2)
!648 = !DILocation(line: 528, column: 2, scope: !646)
!649 = !DILocation(line: 529, column: 23, scope: !647)
!650 = !DILocation(line: 529, column: 29, scope: !647)
!651 = !DILocation(line: 529, column: 3, scope: !647)
!652 = !DILocation(line: 528, column: 62, scope: !653)
!653 = !DILexicalBlockFile(scope: !647, file: !15, discriminator: 2)
!654 = !DILocation(line: 528, column: 48, scope: !653)
!655 = !DILocation(line: 528, column: 46, scope: !653)
!656 = !DILocation(line: 528, column: 2, scope: !653)
!657 = distinct !{!657, !658}
!658 = !DILocation(line: 528, column: 2, scope: !622)
!659 = !DILocation(line: 531, column: 17, scope: !622)
!660 = !DILocation(line: 531, column: 2, scope: !622)
!661 = !DILocation(line: 533, column: 2, scope: !622)
!662 = distinct !DISubprogram(name: "treeroot_visit_node", scope: !15, file: !15, line: 347, type: !82, isLocal: true, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!663 = !DILocalVariable(name: "tree", arg: 1, scope: !662, file: !15, line: 347, type: !84)
!664 = !DILocation(line: 347, column: 38, scope: !662)
!665 = !DILocalVariable(name: "node", arg: 2, scope: !662, file: !15, line: 347, type: !18)
!666 = !DILocation(line: 347, column: 61, scope: !662)
!667 = !DILocation(line: 349, column: 6, scope: !668)
!668 = distinct !DILexicalBlock(scope: !662, file: !15, line: 349, column: 6)
!669 = !DILocation(line: 349, column: 12, scope: !668)
!670 = !DILocation(line: 349, column: 17, scope: !668)
!671 = !DILocation(line: 349, column: 23, scope: !668)
!672 = !DILocation(line: 349, column: 6, scope: !662)
!673 = !DILocation(line: 350, column: 3, scope: !668)
!674 = !DILocation(line: 352, column: 26, scope: !675)
!675 = distinct !DILexicalBlock(scope: !662, file: !15, line: 352, column: 6)
!676 = !DILocation(line: 352, column: 32, scope: !675)
!677 = !DILocation(line: 352, column: 7, scope: !675)
!678 = !DILocation(line: 352, column: 6, scope: !662)
!679 = !DILocation(line: 353, column: 3, scope: !675)
!680 = !DILocation(line: 353, column: 9, scope: !675)
!681 = !DILocation(line: 353, column: 14, scope: !675)
!682 = !DILocation(line: 353, column: 20, scope: !675)
!683 = !DILocation(line: 354, column: 1, scope: !662)
!684 = distinct !DISubprogram(name: "treenode_alloc", scope: !15, file: !15, line: 59, type: !685, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!685 = !DISubroutineType(types: !686)
!686 = !{!18}
!687 = !DILocation(line: 61, column: 9, scope: !684)
!688 = !DILocation(line: 61, column: 2, scope: !684)
!689 = distinct !DISubprogram(name: "treenode_fill_down", scope: !15, file: !15, line: 234, type: !690, isLocal: true, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !108)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !18, !18, !3}
!692 = !DILocalVariable(name: "root", arg: 1, scope: !689, file: !15, line: 234, type: !18)
!693 = !DILocation(line: 234, column: 37, scope: !689)
!694 = !DILocalVariable(name: "dir", arg: 2, scope: !689, file: !15, line: 234, type: !18)
!695 = !DILocation(line: 234, column: 60, scope: !689)
!696 = !DILocalVariable(name: "options", arg: 3, scope: !689, file: !15, line: 235, type: !3)
!697 = !DILocation(line: 235, column: 42, scope: !689)
!698 = !DILocalVariable(name: "d", scope: !689, file: !15, line: 237, type: !699)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !701, line: 127, baseType: !702)
!701 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !701, line: 127, flags: DIFlagFwdDecl)
!703 = !DILocation(line: 237, column: 7, scope: !689)
!704 = !DILocalVariable(name: "e", scope: !689, file: !15, line: 238, type: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64, align: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !707, line: 22, size: 2240, align: 64, elements: !708)
!707 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!708 = !{!709, !710, !711, !713, !715}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !706, file: !707, line: 25, baseType: !37, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !706, file: !707, line: 26, baseType: !51, size: 64, align: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !706, file: !707, line: 31, baseType: !712, size: 16, align: 16, offset: 128)
!712 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !706, file: !707, line: 32, baseType: !714, size: 8, align: 8, offset: 144)
!714 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !706, file: !707, line: 33, baseType: !716, size: 2048, align: 8, offset: 152)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 2048, align: 8, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 256)
!719 = !DILocation(line: 238, column: 17, scope: !689)
!720 = !DILocalVariable(name: "stat_func", scope: !689, file: !15, line: 239, type: !159)
!721 = !DILocation(line: 239, column: 22, scope: !689)
!722 = !DILocation(line: 241, column: 6, scope: !723)
!723 = distinct !DILexicalBlock(scope: !689, file: !15, line: 241, column: 6)
!724 = !DILocation(line: 241, column: 14, scope: !723)
!725 = !DILocation(line: 241, column: 6, scope: !689)
!726 = !DILocation(line: 242, column: 13, scope: !723)
!727 = !DILocation(line: 242, column: 3, scope: !723)
!728 = !DILocation(line: 244, column: 13, scope: !723)
!729 = !DILocation(line: 246, column: 14, scope: !689)
!730 = !DILocation(line: 246, column: 19, scope: !689)
!731 = !DILocation(line: 246, column: 6, scope: !689)
!732 = !DILocation(line: 246, column: 4, scope: !689)
!733 = !DILocation(line: 247, column: 7, scope: !734)
!734 = distinct !DILexicalBlock(scope: !689, file: !15, line: 247, column: 6)
!735 = !DILocation(line: 247, column: 6, scope: !689)
!736 = !DILocation(line: 248, column: 10, scope: !734)
!737 = !DILocation(line: 248, column: 43, scope: !734)
!738 = !DILocation(line: 248, column: 48, scope: !734)
!739 = !DILocation(line: 248, column: 3, scope: !740)
!740 = !DILexicalBlockFile(scope: !734, file: !15, discriminator: 1)
!741 = !DILocation(line: 248, column: 3, scope: !734)
!742 = !DILocation(line: 250, column: 2, scope: !689)
!743 = !DILocation(line: 250, column: 22, scope: !744)
!744 = !DILexicalBlockFile(scope: !689, file: !15, discriminator: 1)
!745 = !DILocation(line: 250, column: 14, scope: !744)
!746 = !DILocation(line: 250, column: 12, scope: !744)
!747 = !DILocation(line: 250, column: 26, scope: !744)
!748 = !DILocation(line: 250, column: 2, scope: !744)
!749 = !DILocalVariable(name: "node", scope: !750, file: !15, line: 251, type: !18)
!750 = distinct !DILexicalBlock(scope: !689, file: !15, line: 250, column: 34)
!751 = !DILocation(line: 251, column: 20, scope: !750)
!752 = !DILocation(line: 253, column: 14, scope: !753)
!753 = distinct !DILexicalBlock(scope: !750, file: !15, line: 253, column: 7)
!754 = !DILocation(line: 253, column: 17, scope: !753)
!755 = !DILocation(line: 253, column: 7, scope: !753)
!756 = !DILocation(line: 253, column: 30, scope: !753)
!757 = !DILocation(line: 253, column: 35, scope: !753)
!758 = !DILocation(line: 254, column: 14, scope: !753)
!759 = !DILocation(line: 254, column: 17, scope: !753)
!760 = !DILocation(line: 254, column: 7, scope: !753)
!761 = !DILocation(line: 254, column: 31, scope: !753)
!762 = !DILocation(line: 253, column: 7, scope: !763)
!763 = !DILexicalBlockFile(scope: !750, file: !15, discriminator: 1)
!764 = !DILocation(line: 255, column: 4, scope: !753)
!765 = distinct !{!765, !742}
!766 = !DILocation(line: 257, column: 7, scope: !767)
!767 = distinct !DILexicalBlock(scope: !750, file: !15, line: 257, column: 7)
!768 = !DILocation(line: 257, column: 12, scope: !767)
!769 = !DILocation(line: 257, column: 25, scope: !767)
!770 = !DILocation(line: 257, column: 30, scope: !767)
!771 = !DILocation(line: 257, column: 22, scope: !767)
!772 = !DILocation(line: 257, column: 7, scope: !750)
!773 = !DILocation(line: 258, column: 25, scope: !767)
!774 = !DILocation(line: 258, column: 4, scope: !767)
!775 = !DILocation(line: 260, column: 28, scope: !750)
!776 = !DILocation(line: 260, column: 34, scope: !750)
!777 = !DILocation(line: 260, column: 39, scope: !750)
!778 = !DILocation(line: 260, column: 42, scope: !750)
!779 = !DILocation(line: 260, column: 10, scope: !750)
!780 = !DILocation(line: 260, column: 8, scope: !750)
!781 = !DILocation(line: 261, column: 7, scope: !782)
!782 = distinct !DILexicalBlock(scope: !750, file: !15, line: 261, column: 7)
