; ModuleID = './[inter]lib--dpkg--db-fsys-override.o.i'
source_filename = "./[inter]lib--dpkg--db-fsys-override.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.file_stat = type { i32, i32, i32, i8*, i8* }
%struct.fsys_namenode = type { %struct.fsys_namenode*, i8*, %struct.pkg_list*, %struct.fsys_diversion*, %struct.file_stat*, %struct.trigfileint*, i32, i8*, i8*, %struct.file_ondisk_id* }
%struct.pkg_list = type opaque
%struct.fsys_diversion = type { %struct.fsys_namenode*, %struct.fsys_namenode*, %struct.pkgset*, %struct.fsys_diversion* }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.1, i32 }

!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_relation", file: !53, line: 61, size: 32, align: 32, elements: !54)
!53 = !DIFile(filename: "../../lib/dpkg/version.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!54 = !{!55, !56, !57, !58, !59, !60}
!55 = !DIEnumerator(name: "DPKG_RELATION_NONE", value: 0)
!56 = !DIEnumerator(name: "DPKG_RELATION_EQ", value: 1)
!57 = !DIEnumerator(name: "DPKG_RELATION_LT", value: 2)
!58 = !DIEnumerator(name: "DPKG_RELATION_LE", value: 3)
!59 = !DIEnumerator(name: "DPKG_RELATION_GT", value: 4)
!60 = !DIEnumerator(name: "DPKG_RELATION_GE", value: 5)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "deptype", file: !9, line: 44, size: 32, align: 32, elements: !62)
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71}
!63 = !DIEnumerator(name: "dep_suggests", value: 0)
!64 = !DIEnumerator(name: "dep_recommends", value: 1)
!65 = !DIEnumerator(name: "dep_depends", value: 2)
!66 = !DIEnumerator(name: "dep_predepends", value: 3)
!67 = !DIEnumerator(name: "dep_breaks", value: 4)
!68 = !DIEnumerator(name: "dep_conflicts", value: 5)
!69 = !DIEnumerator(name: "dep_provides", value: 6)
!70 = !DIEnumerator(name: "dep_replaces", value: 7)
!71 = !DIEnumerator(name: "dep_enhances", value: 8)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgmultiarch", file: !9, line: 95, size: 32, align: 32, elements: !73)
!73 = !{!74, !75, !76, !77}
!74 = !DIEnumerator(name: "PKG_MULTIARCH_NO", value: 0)
!75 = !DIEnumerator(name: "PKG_MULTIARCH_SAME", value: 1)
!76 = !DIEnumerator(name: "PKG_MULTIARCH_ALLOWED", value: 2)
!77 = !DIEnumerator(name: "PKG_MULTIARCH_FOREIGN", value: 3)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fsys_namenode_flags", file: !79, line: 61, size: 32, align: 32, elements: !80)
!79 = !DIFile(filename: "../../lib/dpkg/fsys.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90}
!81 = !DIEnumerator(name: "FNNF_NEW_CONFF", value: 1)
!82 = !DIEnumerator(name: "FNNF_NEW_INARCHIVE", value: 2)
!83 = !DIEnumerator(name: "FNNF_OLD_CONFF", value: 4)
!84 = !DIEnumerator(name: "FNNF_OBS_CONFF", value: 8)
!85 = !DIEnumerator(name: "FNNF_ELIDE_OTHER_LISTS", value: 16)
!86 = !DIEnumerator(name: "FNNF_NO_ATOMIC_OVERWRITE", value: 32)
!87 = !DIEnumerator(name: "FNNF_PLACED_ON_DISK", value: 64)
!88 = !DIEnumerator(name: "FNNF_DEFERRED_FSYNC", value: 128)
!89 = !DIEnumerator(name: "FNNF_DEFERRED_RENAME", value: 256)
!90 = !DIEnumerator(name: "FNNF_FILTERED", value: 512)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "debugflags", file: !92, line: 41, size: 32, align: 32, elements: !93)
!92 = !DIFile(filename: "../../lib/dpkg/debug.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!94 = !DIEnumerator(name: "dbg_general", value: 1)
!95 = !DIEnumerator(name: "dbg_scripts", value: 2)
!96 = !DIEnumerator(name: "dbg_eachfile", value: 8)
!97 = !DIEnumerator(name: "dbg_eachfiledetail", value: 64)
!98 = !DIEnumerator(name: "dbg_conff", value: 16)
!99 = !DIEnumerator(name: "dbg_conffdetail", value: 128)
!100 = !DIEnumerator(name: "dbg_depcon", value: 32)
!101 = !DIEnumerator(name: "dbg_depcondetail", value: 256)
!102 = !DIEnumerator(name: "dbg_veryverbose", value: 512)
!103 = !DIEnumerator(name: "dbg_stupidlyverbose", value: 1024)
!104 = !DIEnumerator(name: "dbg_triggers", value: 4096)
!105 = !DIEnumerator(name: "dbg_triggersdetail", value: 8192)
!106 = !DIEnumerator(name: "dbg_triggersstupid", value: 16384)
!107 = !{!108, !113, !114, !116}
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !109, line: 80, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !111, line: 125, baseType: !112)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!112 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !109, line: 65, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !111, line: 126, baseType: !112)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !109, line: 70, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !111, line: 129, baseType: !112)
!118 = !{!119, !162, !220}
!119 = distinct !DIGlobalVariable(name: "sb_prev", scope: !120, file: !121, line: 114, type: !125, isLocal: true, isDefinition: true, variable: %struct.stat* @ensure_statoverrides.sb_prev)
!120 = distinct !DISubprogram(name: "ensure_statoverrides", scope: !121, file: !121, line: 112, type: !122, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !124)
!121 = !DIFile(filename: "db-fsys-override.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!122 = !DISubroutineType(types: !123)
!123 = !{null, !3}
!124 = !{}
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !126, line: 46, size: 1152, align: 64, elements: !127)
!126 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!127 = !{!128, !131, !133, !135, !136, !137, !138, !140, !141, !144, !146, !148, !156, !157, !158}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !125, file: !126, line: 48, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !111, line: 124, baseType: !130)
!130 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !125, file: !126, line: 53, baseType: !132, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !111, line: 127, baseType: !130)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !125, file: !126, line: 61, baseType: !134, size: 64, align: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !111, line: 130, baseType: !130)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !125, file: !126, line: 62, baseType: !117, size: 32, align: 32, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !125, file: !126, line: 64, baseType: !110, size: 32, align: 32, offset: 224)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !125, file: !126, line: 65, baseType: !115, size: 32, align: 32, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !125, file: !126, line: 67, baseType: !139, size: 32, align: 32, offset: 288)
!139 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !125, file: !126, line: 69, baseType: !129, size: 64, align: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !125, file: !126, line: 74, baseType: !142, size: 64, align: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !111, line: 131, baseType: !143)
!143 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !125, file: !126, line: 78, baseType: !145, size: 64, align: 64, offset: 448)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !111, line: 153, baseType: !143)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !125, file: !126, line: 80, baseType: !147, size: 64, align: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !111, line: 158, baseType: !143)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !125, file: !126, line: 91, baseType: !149, size: 128, align: 64, offset: 576)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !150, line: 120, size: 128, align: 64, elements: !151)
!150 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!151 = !{!152, !154}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !149, file: !150, line: 122, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !111, line: 139, baseType: !143)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !149, file: !150, line: 123, baseType: !155, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !111, line: 175, baseType: !143)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !125, file: !126, line: 92, baseType: !149, size: 128, align: 64, offset: 704)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !125, file: !126, line: 93, baseType: !149, size: 128, align: 64, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !125, file: !126, line: 106, baseType: !159, size: 192, align: 64, offset: 960)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 192, align: 64, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 3)
!162 = distinct !DIGlobalVariable(name: "file_prev", scope: !120, file: !121, line: 116, type: !163, isLocal: true, isDefinition: true, variable: %struct._IO_FILE** @ensure_statoverrides.file_prev)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !165, line: 48, baseType: !166)
!165 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !167, line: 241, size: 1728, align: 64, elements: !168)
!167 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!168 = !{!169, !170, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !191, !192, !193, !194, !195, !197, !199, !203, !206, !208, !209, !210, !211, !212, !215, !216}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !166, file: !167, line: 242, baseType: !139, size: 32, align: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !166, file: !167, line: 247, baseType: !171, size: 64, align: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !166, file: !167, line: 248, baseType: !171, size: 64, align: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !166, file: !167, line: 249, baseType: !171, size: 64, align: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !166, file: !167, line: 250, baseType: !171, size: 64, align: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !166, file: !167, line: 251, baseType: !171, size: 64, align: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !166, file: !167, line: 252, baseType: !171, size: 64, align: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !166, file: !167, line: 253, baseType: !171, size: 64, align: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !166, file: !167, line: 254, baseType: !171, size: 64, align: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !166, file: !167, line: 256, baseType: !171, size: 64, align: 64, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !166, file: !167, line: 257, baseType: !171, size: 64, align: 64, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !166, file: !167, line: 258, baseType: !171, size: 64, align: 64, offset: 704)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !166, file: !167, line: 260, baseType: !184, size: 64, align: 64, offset: 768)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !167, line: 156, size: 192, align: 64, elements: !186)
!186 = !{!187, !188, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !185, file: !167, line: 157, baseType: !184, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !185, file: !167, line: 158, baseType: !189, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !185, file: !167, line: 162, baseType: !139, size: 32, align: 32, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !166, file: !167, line: 262, baseType: !189, size: 64, align: 64, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !166, file: !167, line: 264, baseType: !139, size: 32, align: 32, offset: 896)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !166, file: !167, line: 268, baseType: !139, size: 32, align: 32, offset: 928)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !166, file: !167, line: 270, baseType: !142, size: 64, align: 64, offset: 960)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !166, file: !167, line: 274, baseType: !196, size: 16, align: 16, offset: 1024)
!196 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !166, file: !167, line: 275, baseType: !198, size: 8, align: 8, offset: 1040)
!198 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !166, file: !167, line: 276, baseType: !200, size: 8, align: 8, offset: 1048)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 8, align: 8, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 1)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !166, file: !167, line: 280, baseType: !204, size: 64, align: 64, offset: 1088)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !167, line: 150, baseType: null)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !166, file: !167, line: 289, baseType: !207, size: 64, align: 64, offset: 1152)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !111, line: 132, baseType: !143)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !166, file: !167, line: 297, baseType: !113, size: 64, align: 64, offset: 1216)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !166, file: !167, line: 298, baseType: !113, size: 64, align: 64, offset: 1280)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !166, file: !167, line: 299, baseType: !113, size: 64, align: 64, offset: 1344)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !166, file: !167, line: 300, baseType: !113, size: 64, align: 64, offset: 1408)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !166, file: !167, line: 302, baseType: !213, size: 64, align: 64, offset: 1472)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !214, line: 216, baseType: !130)
!214 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !166, file: !167, line: 303, baseType: !139, size: 32, align: 32, offset: 1536)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !166, file: !167, line: 305, baseType: !217, size: 160, align: 8, offset: 1568)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 160, align: 8, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 20)
!220 = distinct !DIGlobalVariable(name: "statoverridename", scope: !0, file: !121, line: 44, type: !171, isLocal: true, isDefinition: true, variable: i8** @statoverridename)
!221 = !{i32 2, !"Dwarf Version", i32 4}
!222 = !{i32 2, !"Debug Info Version", i32 3}
!223 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!224 = distinct !DISubprogram(name: "statdb_parse_uid", scope: !121, file: !121, line: 47, type: !225, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !124)
!225 = !DISubroutineType(types: !226)
!226 = !{!108, !227}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!229 = !DILocalVariable(name: "str", arg: 1, scope: !224, file: !121, line: 47, type: !227)
!230 = !DIExpression()
!231 = !DILocation(line: 47, column: 30, scope: !224)
!232 = !DILocalVariable(name: "endptr", scope: !224, file: !121, line: 49, type: !171)
!233 = !DILocation(line: 49, column: 8, scope: !224)
!234 = !DILocalVariable(name: "uid", scope: !224, file: !121, line: 50, type: !108)
!235 = !DILocation(line: 50, column: 8, scope: !224)
!236 = !DILocation(line: 52, column: 6, scope: !237)
!237 = distinct !DILexicalBlock(scope: !224, file: !121, line: 52, column: 6)
!238 = !DILocation(line: 52, column: 13, scope: !237)
!239 = !DILocation(line: 52, column: 6, scope: !224)
!240 = !DILocalVariable(name: "value", scope: !241, file: !121, line: 53, type: !143)
!241 = distinct !DILexicalBlock(scope: !237, file: !121, line: 52, column: 21)
!242 = !DILocation(line: 53, column: 12, scope: !241)
!243 = !DILocation(line: 55, column: 4, scope: !241)
!244 = !DILocation(line: 55, column: 8, scope: !241)
!245 = !DILocation(line: 56, column: 18, scope: !241)
!246 = !DILocation(line: 56, column: 22, scope: !241)
!247 = !DILocation(line: 56, column: 11, scope: !241)
!248 = !DILocation(line: 56, column: 9, scope: !241)
!249 = !DILocation(line: 57, column: 7, scope: !250)
!250 = distinct !DILexicalBlock(scope: !241, file: !121, line: 57, column: 7)
!251 = !DILocation(line: 57, column: 11, scope: !250)
!252 = !DILocation(line: 57, column: 18, scope: !250)
!253 = !DILocation(line: 57, column: 15, scope: !250)
!254 = !DILocation(line: 57, column: 25, scope: !250)
!255 = !DILocation(line: 57, column: 29, scope: !256)
!256 = !DILexicalBlockFile(scope: !250, file: !121, discriminator: 1)
!257 = !DILocation(line: 57, column: 28, scope: !256)
!258 = !DILocation(line: 57, column: 36, scope: !256)
!259 = !DILocation(line: 57, column: 39, scope: !260)
!260 = !DILexicalBlockFile(scope: !250, file: !121, discriminator: 2)
!261 = !DILocation(line: 57, column: 45, scope: !260)
!262 = !DILocation(line: 57, column: 49, scope: !260)
!263 = !DILocation(line: 57, column: 53, scope: !264)
!264 = !DILexicalBlockFile(scope: !250, file: !121, discriminator: 3)
!265 = !DILocation(line: 57, column: 52, scope: !264)
!266 = !DILocation(line: 57, column: 57, scope: !264)
!267 = !DILocation(line: 57, column: 7, scope: !264)
!268 = !DILocation(line: 58, column: 10, scope: !250)
!269 = !DILocation(line: 58, column: 44, scope: !250)
!270 = !DILocation(line: 58, column: 4, scope: !256)
!271 = !DILocation(line: 58, column: 4, scope: !250)
!272 = !DILocation(line: 59, column: 16, scope: !241)
!273 = !DILocation(line: 59, column: 9, scope: !241)
!274 = !DILocation(line: 59, column: 7, scope: !241)
!275 = !DILocation(line: 60, column: 2, scope: !241)
!276 = !DILocalVariable(name: "pw", scope: !277, file: !121, line: 61, type: !278)
!277 = distinct !DILexicalBlock(scope: !237, file: !121, line: 60, column: 9)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !280, line: 49, size: 384, align: 64, elements: !281)
!280 = !DIFile(filename: "/usr/include/pwd.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!281 = !{!282, !283, !284, !285, !286, !287, !288}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !279, file: !280, line: 51, baseType: !171, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !279, file: !280, line: 52, baseType: !171, size: 64, align: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !279, file: !280, line: 53, baseType: !110, size: 32, align: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !279, file: !280, line: 54, baseType: !115, size: 32, align: 32, offset: 160)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !279, file: !280, line: 55, baseType: !171, size: 64, align: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !279, file: !280, line: 56, baseType: !171, size: 64, align: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !279, file: !280, line: 57, baseType: !171, size: 64, align: 64, offset: 320)
!289 = !DILocation(line: 61, column: 18, scope: !277)
!290 = !DILocation(line: 61, column: 32, scope: !277)
!291 = !DILocation(line: 61, column: 23, scope: !277)
!292 = !DILocation(line: 63, column: 7, scope: !293)
!293 = distinct !DILexicalBlock(scope: !277, file: !121, line: 63, column: 7)
!294 = !DILocation(line: 63, column: 10, scope: !293)
!295 = !DILocation(line: 63, column: 7, scope: !277)
!296 = !DILocation(line: 64, column: 8, scope: !293)
!297 = !DILocation(line: 64, column: 4, scope: !293)
!298 = !DILocation(line: 66, column: 10, scope: !293)
!299 = !DILocation(line: 66, column: 14, scope: !293)
!300 = !DILocation(line: 66, column: 8, scope: !293)
!301 = !DILocation(line: 69, column: 9, scope: !224)
!302 = !DILocation(line: 69, column: 2, scope: !224)
!303 = distinct !DISubprogram(name: "statdb_parse_gid", scope: !121, file: !121, line: 73, type: !304, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !124)
!304 = !DISubroutineType(types: !305)
!305 = !{!114, !227}
!306 = !DILocalVariable(name: "str", arg: 1, scope: !303, file: !121, line: 73, type: !227)
!307 = !DILocation(line: 73, column: 30, scope: !303)
!308 = !DILocalVariable(name: "endptr", scope: !303, file: !121, line: 75, type: !171)
!309 = !DILocation(line: 75, column: 8, scope: !303)
!310 = !DILocalVariable(name: "gid", scope: !303, file: !121, line: 76, type: !114)
!311 = !DILocation(line: 76, column: 8, scope: !303)
!312 = !DILocation(line: 78, column: 6, scope: !313)
!313 = distinct !DILexicalBlock(scope: !303, file: !121, line: 78, column: 6)
!314 = !DILocation(line: 78, column: 13, scope: !313)
!315 = !DILocation(line: 78, column: 6, scope: !303)
!316 = !DILocalVariable(name: "value", scope: !317, file: !121, line: 79, type: !143)
!317 = distinct !DILexicalBlock(scope: !313, file: !121, line: 78, column: 21)
!318 = !DILocation(line: 79, column: 12, scope: !317)
!319 = !DILocation(line: 81, column: 4, scope: !317)
!320 = !DILocation(line: 81, column: 8, scope: !317)
!321 = !DILocation(line: 82, column: 18, scope: !317)
!322 = !DILocation(line: 82, column: 22, scope: !317)
!323 = !DILocation(line: 82, column: 11, scope: !317)
!324 = !DILocation(line: 82, column: 9, scope: !317)
!325 = !DILocation(line: 83, column: 7, scope: !326)
!326 = distinct !DILexicalBlock(scope: !317, file: !121, line: 83, column: 7)
!327 = !DILocation(line: 83, column: 11, scope: !326)
!328 = !DILocation(line: 83, column: 18, scope: !326)
!329 = !DILocation(line: 83, column: 15, scope: !326)
!330 = !DILocation(line: 83, column: 25, scope: !326)
!331 = !DILocation(line: 83, column: 29, scope: !332)
!332 = !DILexicalBlockFile(scope: !326, file: !121, discriminator: 1)
!333 = !DILocation(line: 83, column: 28, scope: !332)
!334 = !DILocation(line: 83, column: 36, scope: !332)
!335 = !DILocation(line: 83, column: 39, scope: !336)
!336 = !DILexicalBlockFile(scope: !326, file: !121, discriminator: 2)
!337 = !DILocation(line: 83, column: 45, scope: !336)
!338 = !DILocation(line: 83, column: 49, scope: !336)
!339 = !DILocation(line: 83, column: 53, scope: !340)
!340 = !DILexicalBlockFile(scope: !326, file: !121, discriminator: 3)
!341 = !DILocation(line: 83, column: 52, scope: !340)
!342 = !DILocation(line: 83, column: 57, scope: !340)
!343 = !DILocation(line: 83, column: 7, scope: !340)
!344 = !DILocation(line: 84, column: 10, scope: !326)
!345 = !DILocation(line: 84, column: 44, scope: !326)
!346 = !DILocation(line: 84, column: 4, scope: !332)
!347 = !DILocation(line: 84, column: 4, scope: !326)
!348 = !DILocation(line: 85, column: 16, scope: !317)
!349 = !DILocation(line: 85, column: 9, scope: !317)
!350 = !DILocation(line: 85, column: 7, scope: !317)
!351 = !DILocation(line: 86, column: 2, scope: !317)
!352 = !DILocalVariable(name: "gr", scope: !353, file: !121, line: 87, type: !354)
!353 = distinct !DILexicalBlock(scope: !313, file: !121, line: 86, column: 9)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !356, line: 42, size: 256, align: 64, elements: !357)
!356 = !DIFile(filename: "/usr/include/grp.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!357 = !{!358, !359, !360, !361}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !355, file: !356, line: 44, baseType: !171, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !355, file: !356, line: 45, baseType: !171, size: 64, align: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !355, file: !356, line: 46, baseType: !115, size: 32, align: 32, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !355, file: !356, line: 47, baseType: !362, size: 64, align: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!363 = !DILocation(line: 87, column: 17, scope: !353)
!364 = !DILocation(line: 87, column: 31, scope: !353)
!365 = !DILocation(line: 87, column: 22, scope: !353)
!366 = !DILocation(line: 89, column: 7, scope: !367)
!367 = distinct !DILexicalBlock(scope: !353, file: !121, line: 89, column: 7)
!368 = !DILocation(line: 89, column: 10, scope: !367)
!369 = !DILocation(line: 89, column: 7, scope: !353)
!370 = !DILocation(line: 90, column: 8, scope: !367)
!371 = !DILocation(line: 90, column: 4, scope: !367)
!372 = !DILocation(line: 92, column: 10, scope: !367)
!373 = !DILocation(line: 92, column: 14, scope: !367)
!374 = !DILocation(line: 92, column: 8, scope: !367)
!375 = !DILocation(line: 95, column: 9, scope: !303)
!376 = !DILocation(line: 95, column: 2, scope: !303)
!377 = distinct !DISubprogram(name: "statdb_parse_mode", scope: !121, file: !121, line: 99, type: !378, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !124)
!378 = !DISubroutineType(types: !379)
!379 = !{!116, !227}
!380 = !DILocalVariable(name: "str", arg: 1, scope: !377, file: !121, line: 99, type: !227)
!381 = !DILocation(line: 99, column: 31, scope: !377)
!382 = !DILocalVariable(name: "endptr", scope: !377, file: !121, line: 101, type: !171)
!383 = !DILocation(line: 101, column: 8, scope: !377)
!384 = !DILocalVariable(name: "mode", scope: !377, file: !121, line: 102, type: !143)
!385 = !DILocation(line: 102, column: 11, scope: !377)
!386 = !DILocation(line: 104, column: 16, scope: !377)
!387 = !DILocation(line: 104, column: 9, scope: !377)
!388 = !DILocation(line: 104, column: 7, scope: !377)
!389 = !DILocation(line: 105, column: 6, scope: !390)
!390 = distinct !DILexicalBlock(scope: !377, file: !121, line: 105, column: 6)
!391 = !DILocation(line: 105, column: 13, scope: !390)
!392 = !DILocation(line: 105, column: 10, scope: !390)
!393 = !DILocation(line: 105, column: 20, scope: !390)
!394 = !DILocation(line: 105, column: 24, scope: !395)
!395 = !DILexicalBlockFile(scope: !390, file: !121, discriminator: 1)
!396 = !DILocation(line: 105, column: 23, scope: !395)
!397 = !DILocation(line: 105, column: 31, scope: !395)
!398 = !DILocation(line: 105, column: 34, scope: !399)
!399 = !DILexicalBlockFile(scope: !390, file: !121, discriminator: 2)
!400 = !DILocation(line: 105, column: 39, scope: !399)
!401 = !DILocation(line: 105, column: 43, scope: !399)
!402 = !DILocation(line: 105, column: 46, scope: !403)
!403 = !DILexicalBlockFile(scope: !390, file: !121, discriminator: 3)
!404 = !DILocation(line: 105, column: 51, scope: !403)
!405 = !DILocation(line: 105, column: 6, scope: !403)
!406 = !DILocation(line: 106, column: 9, scope: !390)
!407 = !DILocation(line: 106, column: 44, scope: !390)
!408 = !DILocation(line: 106, column: 3, scope: !395)
!409 = !DILocation(line: 106, column: 3, scope: !390)
!410 = !DILocation(line: 108, column: 17, scope: !377)
!411 = !DILocation(line: 108, column: 9, scope: !377)
!412 = !DILocation(line: 108, column: 2, scope: !377)
!413 = !DILocalVariable(name: "flags", arg: 1, scope: !120, file: !121, line: 112, type: !3)
!414 = !DILocation(line: 112, column: 46, scope: !120)
!415 = !DILocalVariable(name: "sb_next", scope: !120, file: !121, line: 115, type: !125)
!416 = !DILocation(line: 115, column: 14, scope: !120)
!417 = !DILocalVariable(name: "file", scope: !120, file: !121, line: 117, type: !163)
!418 = !DILocation(line: 117, column: 8, scope: !120)
!419 = !DILocalVariable(name: "loaded_list", scope: !120, file: !121, line: 118, type: !171)
!420 = !DILocation(line: 118, column: 8, scope: !120)
!421 = !DILocalVariable(name: "loaded_list_end", scope: !120, file: !121, line: 118, type: !171)
!422 = !DILocation(line: 118, column: 22, scope: !120)
!423 = !DILocalVariable(name: "thisline", scope: !120, file: !121, line: 118, type: !171)
!424 = !DILocation(line: 118, column: 40, scope: !120)
!425 = !DILocalVariable(name: "nextline", scope: !120, file: !121, line: 118, type: !171)
!426 = !DILocation(line: 118, column: 51, scope: !120)
!427 = !DILocalVariable(name: "ptr", scope: !120, file: !121, line: 118, type: !171)
!428 = !DILocation(line: 118, column: 62, scope: !120)
!429 = !DILocalVariable(name: "fso", scope: !120, file: !121, line: 119, type: !430)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !432, line: 40, size: 256, align: 64, elements: !433)
!432 = !DIFile(filename: "../../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!433 = !{!434, !435, !436, !437, !438}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !431, file: !432, line: 41, baseType: !108, size: 32, align: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !431, file: !432, line: 42, baseType: !114, size: 32, align: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !431, file: !432, line: 43, baseType: !116, size: 32, align: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !431, file: !432, line: 47, baseType: !171, size: 64, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !431, file: !432, line: 48, baseType: !171, size: 64, align: 64, offset: 192)
!439 = !DILocation(line: 119, column: 20, scope: !120)
!440 = !DILocalVariable(name: "fnn", scope: !120, file: !121, line: 120, type: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode", file: !79, line: 90, size: 640, align: 64, elements: !443)
!443 = !{!444, !445, !446, !449, !591, !592, !595, !596, !597, !598}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !442, file: !79, line: 91, baseType: !441, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !442, file: !79, line: 92, baseType: !227, size: 64, align: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "packages", scope: !442, file: !79, line: 93, baseType: !447, size: 64, align: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_list", file: !79, line: 93, flags: DIFlagFwdDecl)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "divert", scope: !442, file: !79, line: 94, baseType: !450, size: 64, align: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_diversion", file: !79, line: 151, size: 256, align: 64, elements: !452)
!452 = !{!453, !454, !455, !590}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "useinstead", scope: !451, file: !79, line: 152, baseType: !441, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "camefrom", scope: !451, file: !79, line: 153, baseType: !441, size: 64, align: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pkgset", scope: !451, file: !79, line: 154, baseType: !456, size: 64, align: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !9, line: 242, size: 3392, align: 64, elements: !458)
!458 = !{!459, !460, !461, !584, !589}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !457, file: !9, line: 243, baseType: !456, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !457, file: !9, line: 244, baseType: !227, size: 64, align: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !457, file: !9, line: 245, baseType: !462, size: 3072, align: 64, offset: 128)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !9, line: 195, size: 3072, align: 64, elements: !463)
!463 = !{!464, !465, !467, !468, !469, !470, !471, !472, !473, !479, !538, !539, !542, !551, !567, !568, !574, !580, !582, !583}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !462, file: !9, line: 196, baseType: !456, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !462, file: !9, line: 197, baseType: !466, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !462, file: !9, line: 199, baseType: !8, size: 32, align: 32, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !462, file: !9, line: 201, baseType: !17, size: 32, align: 32, offset: 160)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !462, file: !9, line: 202, baseType: !21, size: 32, align: 32, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !462, file: !9, line: 203, baseType: !31, size: 32, align: 32, offset: 224)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !462, file: !9, line: 204, baseType: !227, size: 64, align: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !462, file: !9, line: 205, baseType: !227, size: 64, align: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !462, file: !9, line: 206, baseType: !474, size: 192, align: 64, offset: 384)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !53, line: 42, size: 192, align: 64, elements: !475)
!475 = !{!476, !477, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !474, file: !53, line: 44, baseType: !112, size: 32, align: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !474, file: !53, line: 46, baseType: !227, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !474, file: !53, line: 48, baseType: !227, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !462, file: !9, line: 207, baseType: !480, size: 960, align: 64, offset: 576)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !9, line: 107, size: 960, align: 64, elements: !481)
!481 = !{!482, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !531}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !480, file: !9, line: 108, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64, align: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !9, line: 56, size: 256, align: 64, elements: !485)
!485 = !{!486, !487, !488, !511}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !484, file: !9, line: 57, baseType: !466, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !484, file: !9, line: 58, baseType: !483, size: 64, align: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !484, file: !9, line: 59, baseType: !489, size: 64, align: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !9, line: 63, size: 640, align: 64, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !506, !507, !508, !510}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !490, file: !9, line: 64, baseType: !483, size: 64, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !490, file: !9, line: 65, baseType: !456, size: 64, align: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !490, file: !9, line: 66, baseType: !489, size: 64, align: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !490, file: !9, line: 66, baseType: !489, size: 64, align: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !490, file: !9, line: 66, baseType: !489, size: 64, align: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !490, file: !9, line: 67, baseType: !498, size: 64, align: 64, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !42, line: 48, size: 192, align: 64, elements: !501)
!501 = !{!502, !504, !505}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !500, file: !42, line: 49, baseType: !503, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !500, file: !42, line: 50, baseType: !227, size: 64, align: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !500, file: !42, line: 51, baseType: !41, size: 32, align: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !490, file: !9, line: 68, baseType: !474, size: 192, align: 64, offset: 384)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !490, file: !9, line: 69, baseType: !52, size: 32, align: 32, offset: 576)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !490, file: !9, line: 70, baseType: !509, size: 8, align: 8, offset: 608)
!509 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !490, file: !9, line: 71, baseType: !509, size: 8, align: 8, offset: 616)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !484, file: !9, line: 60, baseType: !61, size: 32, align: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !480, file: !9, line: 110, baseType: !509, size: 8, align: 8, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !480, file: !9, line: 111, baseType: !72, size: 32, align: 32, offset: 96)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !480, file: !9, line: 112, baseType: !498, size: 64, align: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !480, file: !9, line: 115, baseType: !227, size: 64, align: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !480, file: !9, line: 116, baseType: !227, size: 64, align: 64, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !480, file: !9, line: 117, baseType: !227, size: 64, align: 64, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !480, file: !9, line: 118, baseType: !227, size: 64, align: 64, offset: 384)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !480, file: !9, line: 119, baseType: !227, size: 64, align: 64, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !480, file: !9, line: 120, baseType: !227, size: 64, align: 64, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !480, file: !9, line: 121, baseType: !227, size: 64, align: 64, offset: 576)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !480, file: !9, line: 122, baseType: !474, size: 192, align: 64, offset: 640)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !480, file: !9, line: 123, baseType: !524, size: 64, align: 64, offset: 832)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !9, line: 80, size: 256, align: 64, elements: !526)
!526 = !{!527, !528, !529, !530}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !525, file: !9, line: 81, baseType: !524, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !525, file: !9, line: 82, baseType: !227, size: 64, align: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !525, file: !9, line: 83, baseType: !227, size: 64, align: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !525, file: !9, line: 84, baseType: !509, size: 8, align: 8, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !480, file: !9, line: 124, baseType: !532, size: 64, align: 64, offset: 896)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !9, line: 74, size: 192, align: 64, elements: !534)
!534 = !{!535, !536, !537}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !533, file: !9, line: 75, baseType: !532, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !533, file: !9, line: 76, baseType: !227, size: 64, align: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !533, file: !9, line: 77, baseType: !227, size: 64, align: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !462, file: !9, line: 208, baseType: !480, size: 960, align: 64, offset: 1536)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !462, file: !9, line: 209, baseType: !540, size: 64, align: 64, offset: 2496)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !9, line: 151, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !462, file: !9, line: 211, baseType: !543, size: 64, align: 64, offset: 2560)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !9, line: 87, size: 320, align: 64, elements: !545)
!545 = !{!546, !547, !548, !549, !550}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !544, file: !9, line: 88, baseType: !543, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !544, file: !9, line: 89, baseType: !227, size: 64, align: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !544, file: !9, line: 90, baseType: !227, size: 64, align: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !544, file: !9, line: 91, baseType: !227, size: 64, align: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !544, file: !9, line: 92, baseType: !227, size: 64, align: 64, offset: 256)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !462, file: !9, line: 216, baseType: !552, size: 128, align: 64, offset: 2624)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !462, file: !9, line: 213, size: 128, align: 64, elements: !553)
!553 = !{!554, !566}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !552, file: !9, line: 215, baseType: !555, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !9, line: 142, size: 320, align: 64, elements: !557)
!557 = !{!558, !559, !560, !561}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !556, file: !9, line: 143, baseType: !466, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !556, file: !9, line: 143, baseType: !466, size: 64, align: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !556, file: !9, line: 144, baseType: !555, size: 64, align: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !556, file: !9, line: 147, baseType: !562, size: 128, align: 64, offset: 192)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !556, file: !9, line: 145, size: 128, align: 64, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !562, file: !9, line: 146, baseType: !555, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !562, file: !9, line: 146, baseType: !555, size: 64, align: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !552, file: !9, line: 215, baseType: !555, size: 64, align: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !462, file: !9, line: 219, baseType: !555, size: 64, align: 64, offset: 2752)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !462, file: !9, line: 220, baseType: !569, size: 64, align: 64, offset: 2816)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64, align: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !9, line: 134, size: 128, align: 64, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !570, file: !9, line: 135, baseType: !569, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !570, file: !9, line: 136, baseType: !227, size: 64, align: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !462, file: !9, line: 231, baseType: !575, size: 64, align: 64, offset: 2880)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64, align: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !79, line: 122, size: 128, align: 64, elements: !577)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !576, file: !79, line: 123, baseType: !575, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "namenode", scope: !576, file: !79, line: 124, baseType: !441, size: 64, align: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !462, file: !9, line: 232, baseType: !581, size: 64, align: 64, offset: 2944)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !109, line: 86, baseType: !142)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !462, file: !9, line: 233, baseType: !509, size: 8, align: 8, offset: 3008)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !462, file: !9, line: 236, baseType: !509, size: 8, align: 8, offset: 3016)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !457, file: !9, line: 249, baseType: !585, size: 128, align: 64, offset: 3200)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !457, file: !9, line: 246, size: 128, align: 64, elements: !586)
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !585, file: !9, line: 247, baseType: !489, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !585, file: !9, line: 248, baseType: !489, size: 64, align: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !457, file: !9, line: 250, baseType: !139, size: 32, align: 32, offset: 3328)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !451, file: !79, line: 157, baseType: !450, size: 64, align: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "statoverride", scope: !442, file: !79, line: 101, baseType: !430, size: 64, align: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "trig_interested", scope: !442, file: !79, line: 103, baseType: !593, size: 64, align: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "trigfileint", file: !79, line: 103, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !442, file: !79, line: 111, baseType: !78, size: 32, align: 32, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "oldhash", scope: !442, file: !79, line: 114, baseType: !227, size: 64, align: 64, offset: 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "newhash", scope: !442, file: !79, line: 117, baseType: !227, size: 64, align: 64, offset: 512)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "file_ondisk_id", scope: !442, file: !79, line: 119, baseType: !599, size: 64, align: 64, offset: 576)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_ondisk_id", file: !79, line: 85, size: 128, align: 64, elements: !601)
!601 = !{!602, !604}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "id_dev", scope: !600, file: !79, line: 86, baseType: !603, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !109, line: 60, baseType: !129)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "id_ino", scope: !600, file: !79, line: 87, baseType: !605, size: 64, align: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !109, line: 48, baseType: !132)
!606 = !DILocation(line: 120, column: 24, scope: !120)
!607 = !DILocalVariable(name: "iter", scope: !120, file: !121, line: 121, type: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_hash_iter", file: !79, line: 177, flags: DIFlagFwdDecl)
!610 = !DILocation(line: 121, column: 25, scope: !120)
!611 = !DILocation(line: 123, column: 6, scope: !612)
!612 = distinct !DILexicalBlock(scope: !120, file: !121, line: 123, column: 6)
!613 = !DILocation(line: 123, column: 23, scope: !612)
!614 = !DILocation(line: 123, column: 6, scope: !120)
!615 = !DILocation(line: 124, column: 22, scope: !612)
!616 = !DILocation(line: 124, column: 20, scope: !612)
!617 = !DILocation(line: 124, column: 3, scope: !612)
!618 = !DILocation(line: 126, column: 13, scope: !120)
!619 = !DILocation(line: 128, column: 15, scope: !120)
!620 = !DILocation(line: 128, column: 9, scope: !120)
!621 = !DILocation(line: 128, column: 7, scope: !120)
!622 = !DILocation(line: 129, column: 7, scope: !623)
!623 = distinct !DILexicalBlock(scope: !120, file: !121, line: 129, column: 6)
!624 = !DILocation(line: 129, column: 6, scope: !120)
!625 = !DILocation(line: 130, column: 8, scope: !626)
!626 = distinct !DILexicalBlock(scope: !627, file: !121, line: 130, column: 6)
!627 = distinct !DILexicalBlock(scope: !623, file: !121, line: 129, column: 13)
!628 = !DILocation(line: 130, column: 7, scope: !626)
!629 = !DILocation(line: 130, column: 12, scope: !626)
!630 = !DILocation(line: 130, column: 6, scope: !627)
!631 = !DILocation(line: 131, column: 11, scope: !626)
!632 = !DILocation(line: 131, column: 4, scope: !633)
!633 = !DILexicalBlockFile(scope: !626, file: !121, discriminator: 1)
!634 = !DILocation(line: 131, column: 4, scope: !626)
!635 = !DILocation(line: 132, column: 2, scope: !627)
!636 = !DILocation(line: 133, column: 21, scope: !637)
!637 = distinct !DILexicalBlock(scope: !623, file: !121, line: 132, column: 9)
!638 = !DILocation(line: 133, column: 14, scope: !637)
!639 = !DILocation(line: 133, column: 28, scope: !637)
!640 = !DILocation(line: 133, column: 3, scope: !641)
!641 = !DILexicalBlockFile(scope: !637, file: !121, discriminator: 1)
!642 = !DILocation(line: 135, column: 20, scope: !643)
!643 = distinct !DILexicalBlock(scope: !637, file: !121, line: 135, column: 7)
!644 = !DILocation(line: 135, column: 13, scope: !643)
!645 = !DILocation(line: 135, column: 7, scope: !646)
!646 = !DILexicalBlockFile(scope: !643, file: !121, discriminator: 1)
!647 = !DILocation(line: 135, column: 7, scope: !643)
!648 = !DILocation(line: 135, column: 7, scope: !637)
!649 = !DILocation(line: 136, column: 11, scope: !643)
!650 = !DILocation(line: 136, column: 4, scope: !646)
!651 = !DILocation(line: 136, column: 4, scope: !643)
!652 = !DILocation(line: 145, column: 7, scope: !653)
!653 = distinct !DILexicalBlock(scope: !637, file: !121, line: 145, column: 7)
!654 = !DILocation(line: 145, column: 17, scope: !653)
!655 = !DILocation(line: 146, column: 15, scope: !653)
!656 = !DILocation(line: 146, column: 33, scope: !653)
!657 = !DILocation(line: 146, column: 22, scope: !653)
!658 = !DILocation(line: 146, column: 40, scope: !653)
!659 = !DILocation(line: 147, column: 15, scope: !653)
!660 = !DILocation(line: 147, column: 33, scope: !653)
!661 = !DILocation(line: 147, column: 22, scope: !653)
!662 = !DILocation(line: 145, column: 7, scope: !641)
!663 = !DILocation(line: 148, column: 11, scope: !664)
!664 = distinct !DILexicalBlock(scope: !653, file: !121, line: 147, column: 41)
!665 = !DILocation(line: 148, column: 4, scope: !664)
!666 = !DILocation(line: 149, column: 15, scope: !664)
!667 = !DILocation(line: 150, column: 4, scope: !664)
