; ModuleID = './[inter]lib--dpkg--dump.o.i'
source_filename = "./[inter]lib--dpkg--dump.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.namevalue = type { i8*, i32, i32 }
%struct.fieldinfo = type { i8*, i64, void (%struct.pkginfo*, %struct.pkgbin*, %struct.parsedb_state*, i8*, %struct.fieldinfo*)*, {}*, i64 }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.1, i32 }
%struct.anon.1 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }
%struct.pkgbin = type { %struct.dependency*, i8, i32, %struct.dpkg_arch*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.dpkg_version, %struct.conffile*, %struct.arbitraryfield* }
%struct.conffile = type { %struct.conffile*, i8*, i8*, i8 }
%struct.arbitraryfield = type { %struct.arbitraryfield*, i8*, i8* }

!74 = !DIFile(filename: "../../lib/dpkg/parsedump.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!75 = !{!76}
!76 = !DIEnumerator(name: "fw_printheader", value: 1)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "parsedbtype", file: !74, line: 41, size: 32, align: 32, elements: !78)
!78 = !{!79, !80, !81, !82}
!79 = !DIEnumerator(name: "pdb_file_update", value: 0)
!80 = !DIEnumerator(name: "pdb_file_status", value: 1)
!81 = !DIEnumerator(name: "pdb_file_control", value: 2)
!82 = !DIEnumerator(name: "pdb_file_available", value: 3)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "parsedbflags", file: !4, line: 328, size: 32, align: 32, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99}
!85 = !DIEnumerator(name: "pdb_single_stanza", value: 1)
!86 = !DIEnumerator(name: "pdb_recordavailable", value: 2)
!87 = !DIEnumerator(name: "pdb_rejectstatus", value: 4)
!88 = !DIEnumerator(name: "pdb_weakclassification", value: 8)
!89 = !DIEnumerator(name: "pdb_ignore_archives", value: 16)
!90 = !DIEnumerator(name: "pdb_ignoreolder", value: 32)
!91 = !DIEnumerator(name: "pdb_lax_version_parser", value: 64)
!92 = !DIEnumerator(name: "pdb_lax_stanza_parser", value: 512)
!93 = !DIEnumerator(name: "pdb_lax_parser", value: 576)
!94 = !DIEnumerator(name: "pdb_close_fd", value: 128)
!95 = !DIEnumerator(name: "pdb_dash_is_stdin", value: 256)
!96 = !DIEnumerator(name: "pdb_parse_status", value: 584)
!97 = !DIEnumerator(name: "pdb_parse_update", value: 585)
!98 = !DIEnumerator(name: "pdb_parse_available", value: 582)
!99 = !DIEnumerator(name: "pdb_parse_binary", value: 7)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_msg_type", file: !101, line: 36, size: 32, align: 32, elements: !102)
!101 = !DIFile(filename: "../../lib/dpkg/error.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!102 = !{!103, !104, !105}
!103 = !DIEnumerator(name: "DPKG_MSG_NONE", value: 0)
!104 = !DIEnumerator(name: "DPKG_MSG_WARN", value: 1)
!105 = !DIEnumerator(name: "DPKG_MSG_ERROR", value: 2)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "versiondisplayepochwhen", file: !4, line: 388, size: 32, align: 32, elements: !107)
!107 = !{!108, !109, !110}
!108 = !DIEnumerator(name: "vdew_never", value: 0)
!109 = !DIEnumerator(name: "vdew_nonambig", value: 1)
!110 = !DIEnumerator(name: "vdew_always", value: 2)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_name_arch_when", file: !4, line: 396, size: 32, align: 32, elements: !112)
!112 = !{!113, !114, !115, !116}
!113 = !DIEnumerator(name: "pnaw_never", value: 0)
!114 = !DIEnumerator(name: "pnaw_nonambig", value: 1)
!115 = !DIEnumerator(name: "pnaw_foreign", value: 2)
!116 = !DIEnumerator(name: "pnaw_always", value: 3)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "writedb_flags", file: !4, line: 445, size: 32, align: 32, elements: !118)
!118 = !{!119, !120}
!119 = !DIEnumerator(name: "wdb_dump_available", value: 1)
!120 = !DIEnumerator(name: "wdb_must_sync", value: 2)
!121 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "atomic_file_flags", file: !122, line: 36, size: 32, align: 32, elements: !123)
!122 = !DIFile(filename: "../../lib/dpkg/atomic-file.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!123 = !{!124}
!124 = !DIEnumerator(name: "ATOMIC_FILE_BACKUP", value: 1)
!125 = !{!126, !127, !131, !134, !136}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !132, line: 122, baseType: !133)
!132 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!133 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!138 = !{!139}
!139 = distinct !DIGlobalVariable(name: "writebuf", scope: !140, file: !141, line: 499, type: !204, isLocal: true, isDefinition: true, variable: [8192 x i8]* @writedb_records.writebuf)
!140 = distinct !DISubprogram(name: "writedb_records", scope: !141, file: !141, line: 497, type: !142, isLocal: false, isDefinition: true, scopeLine: 498, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!141 = !DIFile(filename: "dump.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!142 = !DISubroutineType(types: !143)
!143 = !{null, !144, !128, !117}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !146, line: 48, baseType: !147)
!146 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !148, line: 241, size: 1728, align: 64, elements: !149)
!148 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!149 = !{!150, !151, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !171, !172, !173, !174, !178, !180, !182, !186, !189, !191, !192, !193, !194, !195, !198, !199}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !147, file: !148, line: 242, baseType: !137, size: 32, align: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !147, file: !148, line: 247, baseType: !152, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !147, file: !148, line: 248, baseType: !152, size: 64, align: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !147, file: !148, line: 249, baseType: !152, size: 64, align: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !147, file: !148, line: 250, baseType: !152, size: 64, align: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !147, file: !148, line: 251, baseType: !152, size: 64, align: 64, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !147, file: !148, line: 252, baseType: !152, size: 64, align: 64, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !147, file: !148, line: 253, baseType: !152, size: 64, align: 64, offset: 448)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !147, file: !148, line: 254, baseType: !152, size: 64, align: 64, offset: 512)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !147, file: !148, line: 256, baseType: !152, size: 64, align: 64, offset: 576)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !147, file: !148, line: 257, baseType: !152, size: 64, align: 64, offset: 640)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !147, file: !148, line: 258, baseType: !152, size: 64, align: 64, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !147, file: !148, line: 260, baseType: !164, size: 64, align: 64, offset: 768)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !148, line: 156, size: 192, align: 64, elements: !166)
!166 = !{!167, !168, !170}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !165, file: !148, line: 157, baseType: !164, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !165, file: !148, line: 158, baseType: !169, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !165, file: !148, line: 162, baseType: !137, size: 32, align: 32, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !147, file: !148, line: 262, baseType: !169, size: 64, align: 64, offset: 832)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !147, file: !148, line: 264, baseType: !137, size: 32, align: 32, offset: 896)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !147, file: !148, line: 268, baseType: !137, size: 32, align: 32, offset: 928)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !147, file: !148, line: 270, baseType: !175, size: 64, align: 64, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !176, line: 131, baseType: !177)
!176 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!177 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !147, file: !148, line: 274, baseType: !179, size: 16, align: 16, offset: 1024)
!179 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !147, file: !148, line: 275, baseType: !181, size: 8, align: 8, offset: 1040)
!181 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !147, file: !148, line: 276, baseType: !183, size: 8, align: 8, offset: 1048)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 8, align: 8, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 1)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !147, file: !148, line: 280, baseType: !187, size: 64, align: 64, offset: 1088)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !148, line: 150, baseType: null)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !147, file: !148, line: 289, baseType: !190, size: 64, align: 64, offset: 1152)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !176, line: 132, baseType: !177)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !147, file: !148, line: 297, baseType: !126, size: 64, align: 64, offset: 1216)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !147, file: !148, line: 298, baseType: !126, size: 64, align: 64, offset: 1280)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !147, file: !148, line: 299, baseType: !126, size: 64, align: 64, offset: 1344)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !147, file: !148, line: 300, baseType: !126, size: 64, align: 64, offset: 1408)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !147, file: !148, line: 302, baseType: !196, size: 64, align: 64, offset: 1472)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !197, line: 216, baseType: !133)
!197 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !147, file: !148, line: 303, baseType: !137, size: 32, align: 32, offset: 1536)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !147, file: !148, line: 305, baseType: !200, size: 160, align: 8, offset: 1568)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 160, align: 8, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 20)
!203 = !{}
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 65536, align: 8, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 8192)
!207 = !{i32 2, !"Dwarf Version", i32 4}
!208 = !{i32 2, !"Debug Info Version", i32 3}
!209 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!210 = distinct !DISubprogram(name: "w_name", scope: !141, file: !141, line: 57, type: !211, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !213, !220, !354, !73, !356}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !215, line: 55, size: 192, align: 64, elements: !216)
!215 = !DIFile(filename: "../../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !214, file: !215, line: 56, baseType: !196, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !214, file: !215, line: 56, baseType: !196, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !214, file: !215, line: 57, baseType: !152, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !223)
!223 = !{!224, !272, !273, !274, !275, !276, !277, !278, !279, !280, !310, !311, !314, !323, !339, !340, !346, !349, !352, !353}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !222, file: !4, line: 196, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !227)
!227 = !{!228, !229, !230, !231, !271}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !226, file: !4, line: 243, baseType: !225, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !226, file: !4, line: 244, baseType: !128, size: 64, align: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !226, file: !4, line: 245, baseType: !222, size: 3072, align: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !226, file: !4, line: 249, baseType: !232, size: 128, align: 64, offset: 3200)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !226, file: !4, line: 246, size: 128, align: 64, elements: !233)
!233 = !{!234, !270}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !232, file: !4, line: 247, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !237)
!237 = !{!238, !247, !248, !249, !250, !251, !260, !267, !268, !269}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !236, file: !4, line: 64, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !241)
!241 = !{!242, !244, !245, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !240, file: !4, line: 57, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !240, file: !4, line: 58, baseType: !239, size: 64, align: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !240, file: !4, line: 59, baseType: !235, size: 64, align: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !240, file: !4, line: 60, baseType: !3, size: 32, align: 32, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !236, file: !4, line: 65, baseType: !225, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !4, line: 66, baseType: !235, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !236, file: !4, line: 66, baseType: !235, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !236, file: !4, line: 66, baseType: !235, size: 64, align: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !236, file: !4, line: 67, baseType: !252, size: 64, align: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !16, line: 48, size: 192, align: 64, elements: !255)
!255 = !{!256, !258, !259}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !254, file: !16, line: 49, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !254, file: !16, line: 50, baseType: !128, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !254, file: !16, line: 51, baseType: !15, size: 32, align: 32, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !236, file: !4, line: 68, baseType: !261, size: 192, align: 64, offset: 384)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !27, line: 42, size: 192, align: 64, elements: !262)
!262 = !{!263, !265, !266}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !261, file: !27, line: 44, baseType: !264, size: 32, align: 32)
!264 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !261, file: !27, line: 46, baseType: !128, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !261, file: !27, line: 48, baseType: !128, size: 64, align: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !236, file: !4, line: 69, baseType: !26, size: 32, align: 32, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !236, file: !4, line: 70, baseType: !135, size: 8, align: 8, offset: 608)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !236, file: !4, line: 71, baseType: !135, size: 8, align: 8, offset: 616)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !232, file: !4, line: 248, baseType: !235, size: 64, align: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !226, file: !4, line: 250, baseType: !137, size: 32, align: 32, offset: 3328)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !222, file: !4, line: 197, baseType: !243, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !222, file: !4, line: 199, baseType: !35, size: 32, align: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !222, file: !4, line: 201, baseType: !43, size: 32, align: 32, offset: 160)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !222, file: !4, line: 202, baseType: !47, size: 32, align: 32, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !222, file: !4, line: 203, baseType: !57, size: 32, align: 32, offset: 224)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !222, file: !4, line: 204, baseType: !128, size: 64, align: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !222, file: !4, line: 205, baseType: !128, size: 64, align: 64, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !222, file: !4, line: 206, baseType: !261, size: 192, align: 64, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !222, file: !4, line: 207, baseType: !281, size: 960, align: 64, offset: 576)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !282)
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !303}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !281, file: !4, line: 108, baseType: !239, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !281, file: !4, line: 110, baseType: !135, size: 8, align: 8, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !281, file: !4, line: 111, baseType: !67, size: 32, align: 32, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !281, file: !4, line: 112, baseType: !252, size: 64, align: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !281, file: !4, line: 115, baseType: !128, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !281, file: !4, line: 116, baseType: !128, size: 64, align: 64, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !281, file: !4, line: 117, baseType: !128, size: 64, align: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !281, file: !4, line: 118, baseType: !128, size: 64, align: 64, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !281, file: !4, line: 119, baseType: !128, size: 64, align: 64, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !281, file: !4, line: 120, baseType: !128, size: 64, align: 64, offset: 512)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !281, file: !4, line: 121, baseType: !128, size: 64, align: 64, offset: 576)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !281, file: !4, line: 122, baseType: !261, size: 192, align: 64, offset: 640)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !281, file: !4, line: 123, baseType: !296, size: 64, align: 64, offset: 832)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !298)
!298 = !{!299, !300, !301, !302}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !4, line: 81, baseType: !296, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !297, file: !4, line: 82, baseType: !128, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !297, file: !4, line: 83, baseType: !128, size: 64, align: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !297, file: !4, line: 84, baseType: !135, size: 8, align: 8, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !281, file: !4, line: 124, baseType: !304, size: 64, align: 64, offset: 896)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !306)
!306 = !{!307, !308, !309}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !4, line: 75, baseType: !304, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !4, line: 76, baseType: !128, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !305, file: !4, line: 77, baseType: !128, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !222, file: !4, line: 208, baseType: !281, size: 960, align: 64, offset: 1536)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !222, file: !4, line: 209, baseType: !312, size: 64, align: 64, offset: 2496)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !4, line: 151, flags: DIFlagFwdDecl)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !222, file: !4, line: 211, baseType: !315, size: 64, align: 64, offset: 2560)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !317)
!317 = !{!318, !319, !320, !321, !322}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !316, file: !4, line: 88, baseType: !315, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !316, file: !4, line: 89, baseType: !128, size: 64, align: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !316, file: !4, line: 90, baseType: !128, size: 64, align: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !316, file: !4, line: 91, baseType: !128, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !316, file: !4, line: 92, baseType: !128, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !222, file: !4, line: 216, baseType: !324, size: 128, align: 64, offset: 2624)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !222, file: !4, line: 213, size: 128, align: 64, elements: !325)
!325 = !{!326, !338}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !324, file: !4, line: 215, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !329)
!329 = !{!330, !331, !332, !333}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !328, file: !4, line: 143, baseType: !243, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !328, file: !4, line: 143, baseType: !243, size: 64, align: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !328, file: !4, line: 144, baseType: !327, size: 64, align: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !328, file: !4, line: 147, baseType: !334, size: 128, align: 64, offset: 192)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !4, line: 145, size: 128, align: 64, elements: !335)
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !334, file: !4, line: 146, baseType: !327, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !334, file: !4, line: 146, baseType: !327, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !324, file: !4, line: 215, baseType: !327, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !222, file: !4, line: 219, baseType: !327, size: 64, align: 64, offset: 2752)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !222, file: !4, line: 220, baseType: !341, size: 64, align: 64, offset: 2816)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !342, file: !4, line: 135, baseType: !341, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !342, file: !4, line: 136, baseType: !128, size: 64, align: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !222, file: !4, line: 231, baseType: !347, size: 64, align: 64, offset: 2880)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !4, line: 231, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !222, file: !4, line: 232, baseType: !350, size: 64, align: 64, offset: 2944)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !351, line: 86, baseType: !175)
!351 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!352 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !222, file: !4, line: 233, baseType: !135, size: 8, align: 8, offset: 3008)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !222, file: !4, line: 236, baseType: !135, size: 8, align: 8, offset: 3016)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fieldinfo", file: !74, line: 133, size: 320, align: 64, elements: !359)
!359 = !{!360, !361, !362, !387, !390}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !358, file: !74, line: 134, baseType: !128, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "namelen", scope: !358, file: !74, line: 135, baseType: !196, size: 64, align: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "rcall", scope: !358, file: !74, line: 136, baseType: !363, size: 64, align: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "freadfunction", file: !74, line: 97, baseType: !365)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !243, !367, !368, !128, !356}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parsedb_state", file: !74, line: 48, size: 640, align: 64, elements: !370)
!370 = !{!371, !372, !373, !379, !380, !381, !382, !383, !384, !385, !386}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !369, file: !74, line: 49, baseType: !77, size: 32, align: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !369, file: !74, line: 50, baseType: !83, size: 32, align: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !369, file: !74, line: 51, baseType: !374, size: 128, align: 64, offset: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_error", file: !101, line: 42, size: 128, align: 64, elements: !375)
!375 = !{!376, !377, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !374, file: !101, line: 43, baseType: !100, size: 32, align: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "syserrno", scope: !374, file: !101, line: 45, baseType: !137, size: 32, align: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !374, file: !101, line: 46, baseType: !152, size: 64, align: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !369, file: !74, line: 52, baseType: !243, size: 64, align: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pkgbin", scope: !369, file: !74, line: 53, baseType: !367, size: 64, align: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !369, file: !74, line: 54, baseType: !152, size: 64, align: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "dataptr", scope: !369, file: !74, line: 55, baseType: !152, size: 64, align: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "endptr", scope: !369, file: !74, line: 56, baseType: !152, size: 64, align: 64, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !369, file: !74, line: 57, baseType: !128, size: 64, align: 64, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !369, file: !74, line: 58, baseType: !137, size: 32, align: 32, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "lno", scope: !369, file: !74, line: 59, baseType: !137, size: 32, align: 32, offset: 608)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "wcall", scope: !358, file: !74, line: 137, baseType: !388, size: 64, align: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "fwritefunction", file: !74, line: 117, baseType: !211)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !358, file: !74, line: 138, baseType: !196, size: 64, align: 64, offset: 256)
!391 = !DILocalVariable(name: "vb", arg: 1, scope: !210, file: !141, line: 57, type: !213)
!392 = !DIExpression()
!393 = !DILocation(line: 57, column: 23, scope: !210)
!394 = !DILocalVariable(name: "pkg", arg: 2, scope: !210, file: !141, line: 58, type: !220)
!395 = !DILocation(line: 58, column: 30, scope: !210)
!396 = !DILocalVariable(name: "pkgbin", arg: 3, scope: !210, file: !141, line: 58, type: !354)
!397 = !DILocation(line: 58, column: 56, scope: !210)
!398 = !DILocalVariable(name: "flags", arg: 4, scope: !210, file: !141, line: 59, type: !73)
!399 = !DILocation(line: 59, column: 25, scope: !210)
!400 = !DILocalVariable(name: "fip", arg: 5, scope: !210, file: !141, line: 59, type: !356)
!401 = !DILocation(line: 59, column: 56, scope: !210)
!402 = !DILocation(line: 61, column: 7, scope: !403)
!403 = distinct !DILexicalBlock(scope: !210, file: !141, line: 61, column: 7)
!404 = !DILocation(line: 61, column: 12, scope: !403)
!405 = !DILocation(line: 61, column: 17, scope: !403)
!406 = !DILocation(line: 61, column: 22, scope: !403)
!407 = !DILocation(line: 61, column: 7, scope: !210)
!408 = !DILocation(line: 62, column: 5, scope: !403)
!409 = !DILocation(line: 64, column: 7, scope: !410)
!410 = distinct !DILexicalBlock(scope: !210, file: !141, line: 64, column: 7)
!411 = !DILocation(line: 64, column: 12, scope: !410)
!412 = !DILocation(line: 64, column: 7, scope: !210)
!413 = !DILocation(line: 65, column: 20, scope: !410)
!414 = !DILocation(line: 65, column: 5, scope: !410)
!415 = !DILocation(line: 66, column: 18, scope: !210)
!416 = !DILocation(line: 66, column: 22, scope: !210)
!417 = !DILocation(line: 66, column: 27, scope: !210)
!418 = !DILocation(line: 66, column: 32, scope: !210)
!419 = !DILocation(line: 66, column: 45, scope: !210)
!420 = !DILocation(line: 66, column: 50, scope: !210)
!421 = !DILocation(line: 66, column: 55, scope: !210)
!422 = !DILocation(line: 66, column: 38, scope: !210)
!423 = !DILocation(line: 66, column: 3, scope: !424)
!424 = !DILexicalBlockFile(scope: !210, file: !141, discriminator: 1)
!425 = !DILocation(line: 67, column: 7, scope: !426)
!426 = distinct !DILexicalBlock(scope: !210, file: !141, line: 67, column: 7)
!427 = !DILocation(line: 67, column: 12, scope: !426)
!428 = !DILocation(line: 67, column: 7, scope: !210)
!429 = !DILocation(line: 68, column: 21, scope: !426)
!430 = !DILocation(line: 68, column: 5, scope: !426)
!431 = !DILocation(line: 69, column: 1, scope: !210)
!432 = distinct !DISubprogram(name: "w_version", scope: !141, file: !141, line: 72, type: !211, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!433 = !DILocalVariable(name: "vb", arg: 1, scope: !432, file: !141, line: 72, type: !213)
!434 = !DILocation(line: 72, column: 26, scope: !432)
!435 = !DILocalVariable(name: "pkg", arg: 2, scope: !432, file: !141, line: 73, type: !220)
!436 = !DILocation(line: 73, column: 33, scope: !432)
!437 = !DILocalVariable(name: "pkgbin", arg: 3, scope: !432, file: !141, line: 73, type: !354)
!438 = !DILocation(line: 73, column: 59, scope: !432)
!439 = !DILocalVariable(name: "flags", arg: 4, scope: !432, file: !141, line: 74, type: !73)
!440 = !DILocation(line: 74, column: 28, scope: !432)
!441 = !DILocalVariable(name: "fip", arg: 5, scope: !432, file: !141, line: 74, type: !356)
!442 = !DILocation(line: 74, column: 59, scope: !432)
!443 = !DILocation(line: 76, column: 37, scope: !444)
!444 = distinct !DILexicalBlock(scope: !432, file: !141, line: 76, column: 7)
!445 = !DILocation(line: 76, column: 45, scope: !444)
!446 = !DILocation(line: 76, column: 8, scope: !444)
!447 = !DILocation(line: 76, column: 7, scope: !432)
!448 = !DILocation(line: 77, column: 5, scope: !444)
!449 = !DILocation(line: 78, column: 7, scope: !450)
!450 = distinct !DILexicalBlock(scope: !432, file: !141, line: 78, column: 7)
!451 = !DILocation(line: 78, column: 12, scope: !450)
!452 = !DILocation(line: 78, column: 7, scope: !432)
!453 = !DILocation(line: 79, column: 20, scope: !450)
!454 = !DILocation(line: 79, column: 5, scope: !450)
!455 = !DILocation(line: 80, column: 17, scope: !432)
!456 = !DILocation(line: 80, column: 22, scope: !432)
!457 = !DILocation(line: 80, column: 30, scope: !432)
!458 = !DILocation(line: 80, column: 3, scope: !432)
!459 = !DILocation(line: 81, column: 7, scope: !460)
!460 = distinct !DILexicalBlock(scope: !432, file: !141, line: 81, column: 7)
!461 = !DILocation(line: 81, column: 12, scope: !460)
!462 = !DILocation(line: 81, column: 7, scope: !432)
!463 = !DILocation(line: 82, column: 21, scope: !460)
!464 = !DILocation(line: 82, column: 5, scope: !460)
!465 = !DILocation(line: 83, column: 1, scope: !432)
!466 = distinct !DISubprogram(name: "w_configversion", scope: !141, file: !141, line: 86, type: !211, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!467 = !DILocalVariable(name: "vb", arg: 1, scope: !466, file: !141, line: 86, type: !213)
!468 = !DILocation(line: 86, column: 32, scope: !466)
!469 = !DILocalVariable(name: "pkg", arg: 2, scope: !466, file: !141, line: 87, type: !220)
!470 = !DILocation(line: 87, column: 39, scope: !466)
!471 = !DILocalVariable(name: "pkgbin", arg: 3, scope: !466, file: !141, line: 87, type: !354)
!472 = !DILocation(line: 87, column: 65, scope: !466)
!473 = !DILocalVariable(name: "flags", arg: 4, scope: !466, file: !141, line: 88, type: !73)
!474 = !DILocation(line: 88, column: 34, scope: !466)
!475 = !DILocalVariable(name: "fip", arg: 5, scope: !466, file: !141, line: 88, type: !356)
!476 = !DILocation(line: 88, column: 65, scope: !466)
!477 = !DILocation(line: 90, column: 7, scope: !478)
!478 = distinct !DILexicalBlock(scope: !466, file: !141, line: 90, column: 7)
!479 = !DILocation(line: 90, column: 18, scope: !478)
!480 = !DILocation(line: 90, column: 23, scope: !478)
!481 = !DILocation(line: 90, column: 14, scope: !478)
!482 = !DILocation(line: 90, column: 7, scope: !466)
!483 = !DILocation(line: 91, column: 5, scope: !478)
!484 = !DILocation(line: 92, column: 37, scope: !485)
!485 = distinct !DILexicalBlock(scope: !466, file: !141, line: 92, column: 7)
!486 = !DILocation(line: 92, column: 42, scope: !485)
!487 = !DILocation(line: 92, column: 8, scope: !485)
!488 = !DILocation(line: 92, column: 7, scope: !466)
!489 = !DILocation(line: 93, column: 5, scope: !485)
!490 = !DILocation(line: 94, column: 7, scope: !491)
!491 = distinct !DILexicalBlock(scope: !466, file: !141, line: 94, column: 7)
!492 = !DILocation(line: 94, column: 12, scope: !491)
!493 = !DILocation(line: 94, column: 19, scope: !491)
!494 = !DILocation(line: 94, column: 41, scope: !491)
!495 = !DILocation(line: 95, column: 7, scope: !491)
!496 = !DILocation(line: 95, column: 12, scope: !491)
!497 = !DILocation(line: 95, column: 19, scope: !491)
!498 = !DILocation(line: 95, column: 44, scope: !491)
!499 = !DILocation(line: 96, column: 7, scope: !491)
!500 = !DILocation(line: 96, column: 12, scope: !491)
!501 = !DILocation(line: 96, column: 19, scope: !491)
!502 = !DILocation(line: 94, column: 7, scope: !503)
!503 = !DILexicalBlockFile(scope: !466, file: !141, discriminator: 1)
!504 = !DILocation(line: 97, column: 5, scope: !491)
!505 = !DILocation(line: 98, column: 7, scope: !506)
!506 = distinct !DILexicalBlock(scope: !466, file: !141, line: 98, column: 7)
!507 = !DILocation(line: 98, column: 12, scope: !506)
!508 = !DILocation(line: 98, column: 7, scope: !466)
!509 = !DILocation(line: 99, column: 20, scope: !506)
!510 = !DILocation(line: 99, column: 5, scope: !506)
!511 = !DILocation(line: 100, column: 17, scope: !466)
!512 = !DILocation(line: 100, column: 22, scope: !466)
!513 = !DILocation(line: 100, column: 27, scope: !466)
!514 = !DILocation(line: 100, column: 3, scope: !466)
!515 = !DILocation(line: 101, column: 7, scope: !516)
!516 = distinct !DILexicalBlock(scope: !466, file: !141, line: 101, column: 7)
!517 = !DILocation(line: 101, column: 12, scope: !516)
!518 = !DILocation(line: 101, column: 7, scope: !466)
!519 = !DILocation(line: 102, column: 21, scope: !516)
!520 = !DILocation(line: 102, column: 5, scope: !516)
!521 = !DILocation(line: 103, column: 1, scope: !466)
!522 = distinct !DISubprogram(name: "w_null", scope: !141, file: !141, line: 106, type: !211, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!523 = !DILocalVariable(name: "vb", arg: 1, scope: !522, file: !141, line: 106, type: !213)
!524 = !DILocation(line: 106, column: 23, scope: !522)
!525 = !DILocalVariable(name: "pkg", arg: 2, scope: !522, file: !141, line: 107, type: !220)
!526 = !DILocation(line: 107, column: 30, scope: !522)
!527 = !DILocalVariable(name: "pkgbin", arg: 3, scope: !522, file: !141, line: 107, type: !354)
!528 = !DILocation(line: 107, column: 56, scope: !522)
!529 = !DILocalVariable(name: "flags", arg: 4, scope: !522, file: !141, line: 108, type: !73)
!530 = !DILocation(line: 108, column: 25, scope: !522)
!531 = !DILocalVariable(name: "fip", arg: 5, scope: !522, file: !141, line: 108, type: !356)
!532 = !DILocation(line: 108, column: 56, scope: !522)
!533 = !DILocation(line: 110, column: 1, scope: !522)
!534 = distinct !DISubprogram(name: "w_section", scope: !141, file: !141, line: 113, type: !211, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!535 = !DILocalVariable(name: "vb", arg: 1, scope: !534, file: !141, line: 113, type: !213)
!536 = !DILocation(line: 113, column: 26, scope: !534)
!537 = !DILocalVariable(name: "pkg", arg: 2, scope: !534, file: !141, line: 114, type: !220)
!538 = !DILocation(line: 114, column: 33, scope: !534)
!539 = !DILocalVariable(name: "pkgbin", arg: 3, scope: !534, file: !141, line: 114, type: !354)
!540 = !DILocation(line: 114, column: 59, scope: !534)
!541 = !DILocalVariable(name: "flags", arg: 4, scope: !534, file: !141, line: 115, type: !73)
!542 = !DILocation(line: 115, column: 28, scope: !534)
!543 = !DILocalVariable(name: "fip", arg: 5, scope: !534, file: !141, line: 115, type: !356)
!544 = !DILocation(line: 115, column: 59, scope: !534)
!545 = !DILocalVariable(name: "value", scope: !534, file: !141, line: 117, type: !128)
!546 = !DILocation(line: 117, column: 15, scope: !534)
!547 = !DILocation(line: 117, column: 23, scope: !534)
!548 = !DILocation(line: 117, column: 28, scope: !534)
!549 = !DILocation(line: 119, column: 20, scope: !550)
!550 = distinct !DILexicalBlock(scope: !534, file: !141, line: 119, column: 7)
!551 = !DILocation(line: 119, column: 7, scope: !550)
!552 = !DILocation(line: 119, column: 7, scope: !534)
!553 = !DILocation(line: 120, column: 5, scope: !550)
!554 = !DILocation(line: 121, column: 7, scope: !555)
!555 = distinct !DILexicalBlock(scope: !534, file: !141, line: 121, column: 7)
!556 = !DILocation(line: 121, column: 12, scope: !555)
!557 = !DILocation(line: 121, column: 7, scope: !534)
!558 = !DILocation(line: 122, column: 20, scope: !555)
!559 = !DILocation(line: 122, column: 5, scope: !555)
!560 = !DILocation(line: 123, column: 18, scope: !534)
!561 = !DILocation(line: 123, column: 22, scope: !534)
!562 = !DILocation(line: 123, column: 36, scope: !534)
!563 = !DILocation(line: 123, column: 29, scope: !534)
!564 = !DILocation(line: 123, column: 3, scope: !565)
!565 = !DILexicalBlockFile(scope: !534, file: !141, discriminator: 1)
!566 = !DILocation(line: 124, column: 7, scope: !567)
!567 = distinct !DILexicalBlock(scope: !534, file: !141, line: 124, column: 7)
!568 = !DILocation(line: 124, column: 12, scope: !567)
!569 = !DILocation(line: 124, column: 7, scope: !534)
!570 = !DILocation(line: 125, column: 21, scope: !567)
!571 = !DILocation(line: 125, column: 5, scope: !567)
!572 = !DILocation(line: 126, column: 1, scope: !534)
!573 = distinct !DISubprogram(name: "str_is_unset", scope: !574, file: !574, line: 41, type: !575, isLocal: true, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!574 = !DIFile(filename: "../../lib/dpkg/string.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!575 = !DISubroutineType(types: !576)
!576 = !{!135, !128}
!577 = !DILocalVariable(name: "str", arg: 1, scope: !573, file: !574, line: 41, type: !128)
!578 = !DILocation(line: 41, column: 26, scope: !573)
!579 = !DILocation(line: 43, column: 9, scope: !573)
!580 = !DILocation(line: 43, column: 13, scope: !573)
!581 = !DILocation(line: 43, column: 20, scope: !573)
!582 = !DILocation(line: 43, column: 23, scope: !583)
!583 = !DILexicalBlockFile(scope: !573, file: !574, discriminator: 1)
!584 = !DILocation(line: 43, column: 30, scope: !583)
!585 = !DILocation(line: 43, column: 20, scope: !583)
!586 = !DILocation(line: 43, column: 2, scope: !587)
!587 = !DILexicalBlockFile(scope: !573, file: !574, discriminator: 2)
!588 = distinct !DISubprogram(name: "w_charfield", scope: !141, file: !141, line: 129, type: !211, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!589 = !DILocalVariable(name: "vb", arg: 1, scope: !588, file: !141, line: 129, type: !213)
!590 = !DILocation(line: 129, column: 28, scope: !588)
!591 = !DILocalVariable(name: "pkg", arg: 2, scope: !588, file: !141, line: 130, type: !220)
!592 = !DILocation(line: 130, column: 35, scope: !588)
!593 = !DILocalVariable(name: "pkgbin", arg: 3, scope: !588, file: !141, line: 130, type: !354)
!594 = !DILocation(line: 130, column: 61, scope: !588)
!595 = !DILocalVariable(name: "flags", arg: 4, scope: !588, file: !141, line: 131, type: !73)
!596 = !DILocation(line: 131, column: 30, scope: !588)
!597 = !DILocalVariable(name: "fip", arg: 5, scope: !588, file: !141, line: 131, type: !356)
!598 = !DILocation(line: 131, column: 61, scope: !588)
!599 = !DILocalVariable(name: "value", scope: !588, file: !141, line: 133, type: !128)
!600 = !DILocation(line: 133, column: 15, scope: !588)
!601 = !DILocation(line: 133, column: 54, scope: !588)
!602 = !DILocation(line: 133, column: 42, scope: !588)
!603 = !DILocation(line: 133, column: 65, scope: !588)
!604 = !DILocation(line: 133, column: 70, scope: !588)
!605 = !DILocation(line: 133, column: 62, scope: !588)
!606 = !DILocation(line: 133, column: 25, scope: !588)
!607 = !DILocation(line: 133, column: 24, scope: !588)
!608 = !DILocation(line: 135, column: 20, scope: !609)
!609 = distinct !DILexicalBlock(scope: !588, file: !141, line: 135, column: 7)
!610 = !DILocation(line: 135, column: 7, scope: !609)
!611 = !DILocation(line: 135, column: 7, scope: !588)
!612 = !DILocation(line: 136, column: 5, scope: !609)
!613 = !DILocation(line: 137, column: 7, scope: !614)
!614 = distinct !DILexicalBlock(scope: !588, file: !141, line: 137, column: 7)
!615 = !DILocation(line: 137, column: 13, scope: !614)
!616 = !DILocation(line: 137, column: 7, scope: !588)
!617 = !DILocation(line: 138, column: 26, scope: !614)
!618 = !DILocation(line: 138, column: 30, scope: !614)
!619 = !DILocation(line: 138, column: 5, scope: !614)
!620 = !DILocation(line: 139, column: 18, scope: !588)
!621 = !DILocation(line: 139, column: 22, scope: !588)
!622 = !DILocation(line: 139, column: 36, scope: !588)
!623 = !DILocation(line: 139, column: 29, scope: !588)
!624 = !DILocation(line: 139, column: 3, scope: !625)
!625 = !DILexicalBlockFile(scope: !588, file: !141, discriminator: 1)
!626 = !DILocation(line: 140, column: 7, scope: !627)
!627 = distinct !DILexicalBlock(scope: !588, file: !141, line: 140, column: 7)
!628 = !DILocation(line: 140, column: 12, scope: !627)
!629 = !DILocation(line: 140, column: 7, scope: !588)
!630 = !DILocation(line: 141, column: 21, scope: !627)
!631 = !DILocation(line: 141, column: 5, scope: !627)
!632 = !DILocation(line: 142, column: 1, scope: !588)
!633 = distinct !DISubprogram(name: "varbuf_add_fieldname", scope: !141, file: !141, line: 50, type: !634, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !213, !356}
!636 = !DILocalVariable(name: "vb", arg: 1, scope: !633, file: !141, line: 50, type: !213)
!637 = !DILocation(line: 50, column: 37, scope: !633)
!638 = !DILocalVariable(name: "fip", arg: 2, scope: !633, file: !141, line: 50, type: !356)
!639 = !DILocation(line: 50, column: 65, scope: !633)
!640 = !DILocation(line: 52, column: 18, scope: !633)
!641 = !DILocation(line: 52, column: 22, scope: !633)
!642 = !DILocation(line: 52, column: 27, scope: !633)
!643 = !DILocation(line: 52, column: 40, scope: !633)
!644 = !DILocation(line: 52, column: 45, scope: !633)
!645 = !DILocation(line: 52, column: 33, scope: !633)
!646 = !DILocation(line: 52, column: 3, scope: !647)
!647 = !DILexicalBlockFile(scope: !633, file: !141, discriminator: 1)
!648 = !DILocation(line: 53, column: 18, scope: !633)
!649 = !DILocation(line: 53, column: 3, scope: !633)
!650 = !DILocation(line: 54, column: 1, scope: !633)
!651 = distinct !DISubprogram(name: "w_archives", scope: !141, file: !141, line: 145, type: !211, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!652 = !DILocalVariable(name: "vb", arg: 1, scope: !651, file: !141, line: 145, type: !213)
!653 = !DILocation(line: 145, column: 27, scope: !651)
!654 = !DILocalVariable(name: "pkg", arg: 2, scope: !651, file: !141, line: 146, type: !220)
!655 = !DILocation(line: 146, column: 34, scope: !651)
!656 = !DILocalVariable(name: "pkgbin", arg: 3, scope: !651, file: !141, line: 146, type: !354)
!657 = !DILocation(line: 146, column: 60, scope: !651)
!658 = !DILocalVariable(name: "flags", arg: 4, scope: !651, file: !141, line: 147, type: !73)
!659 = !DILocation(line: 147, column: 29, scope: !651)
!660 = !DILocalVariable(name: "fip", arg: 5, scope: !651, file: !141, line: 147, type: !356)
!661 = !DILocation(line: 147, column: 60, scope: !651)
!662 = !DILocalVariable(name: "archive", scope: !651, file: !141, line: 149, type: !315)
!663 = !DILocation(line: 149, column: 26, scope: !651)
!664 = !DILocation(line: 151, column: 7, scope: !665)
!665 = distinct !DILexicalBlock(scope: !651, file: !141, line: 151, column: 7)
!666 = !DILocation(line: 151, column: 18, scope: !665)
!667 = !DILocation(line: 151, column: 23, scope: !665)
!668 = !DILocation(line: 151, column: 14, scope: !665)
!669 = !DILocation(line: 151, column: 7, scope: !651)
!670 = !DILocation(line: 152, column: 5, scope: !665)
!671 = !DILocation(line: 153, column: 13, scope: !651)
!672 = !DILocation(line: 153, column: 18, scope: !651)
!673 = !DILocation(line: 153, column: 11, scope: !651)
!674 = !DILocation(line: 154, column: 8, scope: !675)
!675 = distinct !DILexicalBlock(scope: !651, file: !141, line: 154, column: 7)
!676 = !DILocation(line: 154, column: 16, scope: !675)
!677 = !DILocation(line: 154, column: 51, scope: !678)
!678 = !DILexicalBlockFile(scope: !675, file: !141, discriminator: 1)
!679 = !DILocation(line: 154, column: 39, scope: !678)
!680 = !DILocation(line: 154, column: 63, scope: !678)
!681 = !DILocation(line: 154, column: 68, scope: !678)
!682 = !DILocation(line: 154, column: 60, scope: !678)
!683 = !DILocation(line: 154, column: 22, scope: !678)
!684 = !DILocation(line: 154, column: 21, scope: !678)
!685 = !DILocation(line: 154, column: 20, scope: !678)
!686 = !DILocation(line: 154, column: 7, scope: !678)
!687 = !DILocation(line: 155, column: 5, scope: !675)
!688 = !DILocation(line: 157, column: 7, scope: !689)
!689 = distinct !DILexicalBlock(scope: !651, file: !141, line: 157, column: 7)
!690 = !DILocation(line: 157, column: 12, scope: !689)
!691 = !DILocation(line: 157, column: 7, scope: !651)
!692 = !DILocation(line: 158, column: 20, scope: !693)
!693 = distinct !DILexicalBlock(scope: !689, file: !141, line: 157, column: 29)
!694 = !DILocation(line: 158, column: 24, scope: !693)
!695 = !DILocation(line: 158, column: 29, scope: !693)
!696 = !DILocation(line: 158, column: 42, scope: !693)
!697 = !DILocation(line: 158, column: 47, scope: !693)
!698 = !DILocation(line: 158, column: 35, scope: !693)
!699 = !DILocation(line: 158, column: 5, scope: !700)
!700 = !DILexicalBlockFile(scope: !693, file: !141, discriminator: 1)
!701 = !DILocation(line: 159, column: 21, scope: !693)
!702 = !DILocation(line: 159, column: 5, scope: !693)
!703 = !DILocation(line: 160, column: 3, scope: !693)
!704 = !DILocation(line: 162, column: 3, scope: !651)
!705 = !DILocation(line: 162, column: 10, scope: !706)
!706 = !DILexicalBlockFile(scope: !651, file: !141, discriminator: 1)
!707 = !DILocation(line: 162, column: 3, scope: !706)
!708 = !DILocation(line: 163, column: 21, scope: !709)
!709 = distinct !DILexicalBlock(scope: !651, file: !141, line: 162, column: 19)
!710 = !DILocation(line: 163, column: 5, scope: !709)
!711 = !DILocation(line: 164, column: 20, scope: !709)
!712 = !DILocation(line: 164, column: 55, scope: !709)
!713 = !DILocation(line: 164, column: 43, scope: !709)
!714 = !DILocation(line: 164, column: 67, scope: !709)
!715 = !DILocation(line: 164, column: 72, scope: !709)
!716 = !DILocation(line: 164, column: 64, scope: !709)
!717 = !DILocation(line: 164, column: 26, scope: !709)
!718 = !DILocation(line: 164, column: 25, scope: !709)
!719 = !DILocation(line: 164, column: 122, scope: !709)
!720 = !DILocation(line: 164, column: 110, scope: !709)
!721 = !DILocation(line: 164, column: 134, scope: !709)
!722 = !DILocation(line: 164, column: 139, scope: !709)
!723 = !DILocation(line: 164, column: 131, scope: !709)
!724 = !DILocation(line: 164, column: 93, scope: !709)
!725 = !DILocation(line: 164, column: 92, scope: !709)
!726 = !DILocation(line: 164, column: 84, scope: !709)
!727 = !DILocation(line: 164, column: 5, scope: !728)
!728 = !DILexicalBlockFile(scope: !709, file: !141, discriminator: 1)
!729 = !DILocation(line: 165, column: 15, scope: !709)
!730 = !DILocation(line: 165, column: 24, scope: !709)
!731 = !DILocation(line: 165, column: 13, scope: !709)
!732 = !DILocation(line: 162, column: 3, scope: !733)
!733 = !DILexicalBlockFile(scope: !651, file: !141, discriminator: 2)
!734 = distinct !{!734, !704}
!735 = !DILocation(line: 168, column: 7, scope: !736)
!736 = distinct !DILexicalBlock(scope: !651, file: !141, line: 168, column: 7)
!737 = !DILocation(line: 168, column: 12, scope: !736)
!738 = !DILocation(line: 168, column: 7, scope: !651)
!739 = !DILocation(line: 169, column: 21, scope: !736)
!740 = !DILocation(line: 169, column: 5, scope: !736)
!741 = !DILocation(line: 170, column: 1, scope: !651)
!742 = distinct !DISubprogram(name: "w_booleandefno", scope: !141, file: !141, line: 173, type: !211, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!743 = !DILocalVariable(name: "vb", arg: 1, scope: !742, file: !141, line: 173, type: !213)
!744 = !DILocation(line: 173, column: 31, scope: !742)
!745 = !DILocalVariable(name: "pkg", arg: 2, scope: !742, file: !141, line: 174, type: !220)
!746 = !DILocation(line: 174, column: 38, scope: !742)
!747 = !DILocalVariable(name: "pkgbin", arg: 3, scope: !742, file: !141, line: 174, type: !354)
!748 = !DILocation(line: 174, column: 64, scope: !742)
!749 = !DILocalVariable(name: "flags", arg: 4, scope: !742, file: !141, line: 175, type: !73)
!750 = !DILocation(line: 175, column: 33, scope: !742)
!751 = !DILocalVariable(name: "fip", arg: 5, scope: !742, file: !141, line: 175, type: !356)
!752 = !DILocation(line: 175, column: 64, scope: !742)
!753 = !DILocalVariable(name: "value", scope: !742, file: !141, line: 177, type: !135)
!754 = !DILocation(line: 177, column: 7, scope: !742)
!755 = !DILocation(line: 177, column: 30, scope: !742)
!756 = !DILocation(line: 177, column: 18, scope: !742)
!757 = !DILocation(line: 177, column: 41, scope: !742)
!758 = !DILocation(line: 177, column: 46, scope: !742)
!759 = !DILocation(line: 177, column: 38, scope: !742)
!760 = !DILocation(line: 177, column: 17, scope: !742)
!761 = !DILocation(line: 177, column: 16, scope: !742)
!762 = !DILocation(line: 179, column: 8, scope: !763)
!763 = distinct !DILexicalBlock(scope: !742, file: !141, line: 179, column: 7)
!764 = !DILocation(line: 179, column: 14, scope: !763)
!765 = !DILocation(line: 179, column: 32, scope: !763)
!766 = !DILocation(line: 179, column: 36, scope: !767)
!767 = !DILexicalBlockFile(scope: !763, file: !141, discriminator: 1)
!768 = !DILocation(line: 179, column: 7, scope: !767)
!769 = !DILocation(line: 180, column: 5, scope: !763)
!770 = !DILocation(line: 182, column: 7, scope: !771)
!771 = distinct !DILexicalBlock(scope: !742, file: !141, line: 182, column: 7)
!772 = !DILocation(line: 182, column: 13, scope: !771)
!773 = !DILocation(line: 182, column: 7, scope: !742)
!774 = !DILocation(line: 183, column: 26, scope: !771)
!775 = !DILocation(line: 183, column: 30, scope: !771)
!776 = !DILocation(line: 183, column: 5, scope: !771)
!777 = !DILocation(line: 185, column: 18, scope: !742)
!778 = !DILocation(line: 185, column: 22, scope: !742)
!779 = !DILocation(line: 185, column: 51, scope: !742)
!780 = !DILocation(line: 185, column: 44, scope: !742)
!781 = !DILocation(line: 185, column: 3, scope: !782)
!782 = !DILexicalBlockFile(scope: !742, file: !141, discriminator: 1)
!783 = !DILocation(line: 187, column: 7, scope: !784)
!784 = distinct !DILexicalBlock(scope: !742, file: !141, line: 187, column: 7)
!785 = !DILocation(line: 187, column: 13, scope: !784)
!786 = !DILocation(line: 187, column: 7, scope: !742)
!787 = !DILocation(line: 188, column: 21, scope: !784)
!788 = !DILocation(line: 188, column: 5, scope: !784)
!789 = !DILocation(line: 189, column: 1, scope: !742)
!790 = distinct !DISubprogram(name: "w_multiarch", scope: !141, file: !141, line: 192, type: !211, isLocal: false, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!791 = !DILocalVariable(name: "vb", arg: 1, scope: !790, file: !141, line: 192, type: !213)
!792 = !DILocation(line: 192, column: 28, scope: !790)
!793 = !DILocalVariable(name: "pkg", arg: 2, scope: !790, file: !141, line: 193, type: !220)
!794 = !DILocation(line: 193, column: 35, scope: !790)
!795 = !DILocalVariable(name: "pkgbin", arg: 3, scope: !790, file: !141, line: 193, type: !354)
!796 = !DILocation(line: 193, column: 61, scope: !790)
!797 = !DILocalVariable(name: "flags", arg: 4, scope: !790, file: !141, line: 194, type: !73)
!798 = !DILocation(line: 194, column: 30, scope: !790)
!799 = !DILocalVariable(name: "fip", arg: 5, scope: !790, file: !141, line: 194, type: !356)
!800 = !DILocation(line: 194, column: 61, scope: !790)
!801 = !DILocalVariable(name: "value", scope: !790, file: !141, line: 196, type: !137)
!802 = !DILocation(line: 196, column: 7, scope: !790)
!803 = !DILocation(line: 196, column: 37, scope: !790)
!804 = !DILocation(line: 196, column: 25, scope: !790)
!805 = !DILocation(line: 196, column: 48, scope: !790)
!806 = !DILocation(line: 196, column: 53, scope: !790)
!807 = !DILocation(line: 196, column: 45, scope: !790)
!808 = !DILocation(line: 196, column: 17, scope: !790)
!809 = !DILocation(line: 196, column: 16, scope: !790)
!810 = !DILocation(line: 198, column: 8, scope: !811)
!811 = distinct !DILexicalBlock(scope: !790, file: !141, line: 198, column: 7)
!812 = !DILocation(line: 198, column: 14, scope: !811)
!813 = !DILocation(line: 198, column: 32, scope: !811)
!814 = !DILocation(line: 198, column: 36, scope: !815)
!815 = !DILexicalBlockFile(scope: !811, file: !141, discriminator: 1)
!816 = !DILocation(line: 198, column: 7, scope: !815)
!817 = !DILocation(line: 199, column: 5, scope: !811)
!818 = !DILocation(line: 201, column: 7, scope: !819)
!819 = distinct !DILexicalBlock(scope: !790, file: !141, line: 201, column: 7)
!820 = !DILocation(line: 201, column: 13, scope: !819)
!821 = !DILocation(line: 201, column: 7, scope: !790)
!822 = !DILocation(line: 202, column: 26, scope: !819)
!823 = !DILocation(line: 202, column: 30, scope: !819)
!824 = !DILocation(line: 202, column: 5, scope: !819)
!825 = !DILocation(line: 204, column: 18, scope: !790)
!826 = !DILocation(line: 204, column: 37, scope: !790)
!827 = !DILocation(line: 204, column: 22, scope: !790)
!828 = !DILocation(line: 204, column: 44, scope: !790)
!829 = !DILocation(line: 204, column: 72, scope: !790)
!830 = !DILocation(line: 204, column: 57, scope: !790)
!831 = !DILocation(line: 204, column: 79, scope: !790)
!832 = !DILocation(line: 204, column: 50, scope: !790)
!833 = !DILocation(line: 204, column: 3, scope: !834)
!834 = !DILexicalBlockFile(scope: !790, file: !141, discriminator: 1)
!835 = !DILocation(line: 206, column: 7, scope: !836)
!836 = distinct !DILexicalBlock(scope: !790, file: !141, line: 206, column: 7)
!837 = !DILocation(line: 206, column: 13, scope: !836)
!838 = !DILocation(line: 206, column: 7, scope: !790)
!839 = !DILocation(line: 207, column: 21, scope: !836)
!840 = !DILocation(line: 207, column: 5, scope: !836)
!841 = !DILocation(line: 208, column: 1, scope: !790)
!842 = distinct !DISubprogram(name: "w_architecture", scope: !141, file: !141, line: 211, type: !211, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!843 = !DILocalVariable(name: "vb", arg: 1, scope: !842, file: !141, line: 211, type: !213)
!844 = !DILocation(line: 211, column: 31, scope: !842)
!845 = !DILocalVariable(name: "pkg", arg: 2, scope: !842, file: !141, line: 212, type: !220)
!846 = !DILocation(line: 212, column: 38, scope: !842)
!847 = !DILocalVariable(name: "pkgbin", arg: 3, scope: !842, file: !141, line: 212, type: !354)
!848 = !DILocation(line: 212, column: 64, scope: !842)
!849 = !DILocalVariable(name: "flags", arg: 4, scope: !842, file: !141, line: 213, type: !73)
!850 = !DILocation(line: 213, column: 33, scope: !842)
!851 = !DILocalVariable(name: "fip", arg: 5, scope: !842, file: !141, line: 213, type: !356)
!852 = !DILocation(line: 213, column: 64, scope: !842)
!853 = !DILocation(line: 215, column: 8, scope: !854)
!854 = distinct !DILexicalBlock(scope: !842, file: !141, line: 215, column: 7)
!855 = !DILocation(line: 215, column: 16, scope: !854)
!856 = !DILocation(line: 215, column: 7, scope: !842)
!857 = !DILocation(line: 216, column: 5, scope: !854)
!858 = !DILocation(line: 217, column: 7, scope: !859)
!859 = distinct !DILexicalBlock(scope: !842, file: !141, line: 217, column: 7)
!860 = !DILocation(line: 217, column: 15, scope: !859)
!861 = !DILocation(line: 217, column: 21, scope: !859)
!862 = !DILocation(line: 217, column: 26, scope: !859)
!863 = !DILocation(line: 217, column: 7, scope: !842)
!864 = !DILocation(line: 218, column: 5, scope: !859)
!865 = !DILocation(line: 219, column: 7, scope: !866)
!866 = distinct !DILexicalBlock(scope: !842, file: !141, line: 219, column: 7)
!867 = !DILocation(line: 219, column: 15, scope: !866)
!868 = !DILocation(line: 219, column: 21, scope: !866)
!869 = !DILocation(line: 219, column: 26, scope: !866)
!870 = !DILocation(line: 219, column: 7, scope: !842)
!871 = !DILocation(line: 220, column: 5, scope: !866)
!872 = !DILocation(line: 222, column: 7, scope: !873)
!873 = distinct !DILexicalBlock(scope: !842, file: !141, line: 222, column: 7)
!874 = !DILocation(line: 222, column: 13, scope: !873)
!875 = !DILocation(line: 222, column: 7, scope: !842)
!876 = !DILocation(line: 223, column: 26, scope: !873)
!877 = !DILocation(line: 223, column: 30, scope: !873)
!878 = !DILocation(line: 223, column: 5, scope: !873)
!879 = !DILocation(line: 224, column: 18, scope: !842)
!880 = !DILocation(line: 224, column: 22, scope: !842)
!881 = !DILocation(line: 224, column: 30, scope: !842)
!882 = !DILocation(line: 224, column: 36, scope: !842)
!883 = !DILocation(line: 224, column: 49, scope: !842)
!884 = !DILocation(line: 224, column: 57, scope: !842)
!885 = !DILocation(line: 224, column: 63, scope: !842)
!886 = !DILocation(line: 224, column: 42, scope: !842)
!887 = !DILocation(line: 224, column: 3, scope: !888)
!888 = !DILexicalBlockFile(scope: !842, file: !141, discriminator: 1)
!889 = !DILocation(line: 225, column: 7, scope: !890)
!890 = distinct !DILexicalBlock(scope: !842, file: !141, line: 225, column: 7)
!891 = !DILocation(line: 225, column: 13, scope: !890)
!892 = !DILocation(line: 225, column: 7, scope: !842)
!893 = !DILocation(line: 226, column: 21, scope: !890)
!894 = !DILocation(line: 226, column: 5, scope: !890)
!895 = !DILocation(line: 227, column: 1, scope: !842)
!896 = distinct !DISubprogram(name: "w_priority", scope: !141, file: !141, line: 230, type: !211, isLocal: false, isDefinition: true, scopeLine: 233, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!897 = !DILocalVariable(name: "vb", arg: 1, scope: !896, file: !141, line: 230, type: !213)
!898 = !DILocation(line: 230, column: 27, scope: !896)
!899 = !DILocalVariable(name: "pkg", arg: 2, scope: !896, file: !141, line: 231, type: !220)
!900 = !DILocation(line: 231, column: 34, scope: !896)
!901 = !DILocalVariable(name: "pkgbin", arg: 3, scope: !896, file: !141, line: 231, type: !354)
!902 = !DILocation(line: 231, column: 60, scope: !896)
!903 = !DILocalVariable(name: "flags", arg: 4, scope: !896, file: !141, line: 232, type: !73)
!904 = !DILocation(line: 232, column: 29, scope: !896)
!905 = !DILocalVariable(name: "fip", arg: 5, scope: !896, file: !141, line: 232, type: !356)
!906 = !DILocation(line: 232, column: 60, scope: !896)
!907 = !DILocation(line: 234, column: 7, scope: !908)
!908 = distinct !DILexicalBlock(scope: !896, file: !141, line: 234, column: 7)
!909 = !DILocation(line: 234, column: 12, scope: !908)
!910 = !DILocation(line: 234, column: 21, scope: !908)
!911 = !DILocation(line: 234, column: 7, scope: !896)
!912 = !DILocation(line: 235, column: 5, scope: !908)
!913 = !DILocation(line: 237, column: 7, scope: !914)
!914 = distinct !DILexicalBlock(scope: !896, file: !141, line: 237, column: 7)
!915 = !DILocation(line: 237, column: 12, scope: !914)
!916 = !DILocation(line: 237, column: 21, scope: !914)
!917 = !DILocation(line: 237, column: 7, scope: !896)
!918 = !DILocation(line: 238, column: 78, scope: !914)
!919 = !DILocation(line: 238, column: 83, scope: !914)
!920 = !DILocation(line: 238, column: 60, scope: !914)
!921 = !DILocation(line: 238, column: 105, scope: !914)
!922 = !DILocation(line: 238, column: 110, scope: !914)
!923 = !DILocation(line: 238, column: 5, scope: !924)
!924 = !DILexicalBlockFile(scope: !914, file: !141, discriminator: 1)
!925 = !DILocation(line: 238, column: 5, scope: !914)
!926 = !DILocation(line: 241, column: 7, scope: !927)
!927 = distinct !DILexicalBlock(scope: !896, file: !141, line: 241, column: 7)
!928 = !DILocation(line: 241, column: 12, scope: !927)
!929 = !DILocation(line: 241, column: 7, scope: !896)
!930 = !DILocation(line: 242, column: 20, scope: !927)
!931 = !DILocation(line: 242, column: 5, scope: !927)
!932 = !DILocation(line: 243, column: 18, scope: !896)
!933 = !DILocation(line: 243, column: 40, scope: !896)
!934 = !DILocation(line: 243, column: 22, scope: !896)
!935 = !DILocation(line: 243, column: 71, scope: !896)
!936 = !DILocation(line: 243, column: 53, scope: !937)
!937 = !DILexicalBlockFile(scope: !896, file: !141, discriminator: 1)
!938 = !DILocation(line: 243, column: 46, scope: !939)
!939 = !DILexicalBlockFile(scope: !896, file: !141, discriminator: 2)
!940 = !DILocation(line: 243, column: 3, scope: !941)
!941 = !DILexicalBlockFile(scope: !896, file: !141, discriminator: 3)
!942 = !DILocation(line: 244, column: 7, scope: !943)
!943 = distinct !DILexicalBlock(scope: !896, file: !141, line: 244, column: 7)
!944 = !DILocation(line: 244, column: 12, scope: !943)
!945 = !DILocation(line: 244, column: 7, scope: !896)
!946 = !DILocation(line: 245, column: 21, scope: !943)
!947 = !DILocation(line: 245, column: 5, scope: !943)
!948 = !DILocation(line: 246, column: 1, scope: !896)
!949 = distinct !DISubprogram(name: "w_status", scope: !141, file: !141, line: 249, type: !211, isLocal: false, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!950 = !DILocalVariable(name: "vb", arg: 1, scope: !949, file: !141, line: 249, type: !213)
!951 = !DILocation(line: 249, column: 25, scope: !949)
!952 = !DILocalVariable(name: "pkg", arg: 2, scope: !949, file: !141, line: 250, type: !220)
!953 = !DILocation(line: 250, column: 32, scope: !949)
!954 = !DILocalVariable(name: "pkgbin", arg: 3, scope: !949, file: !141, line: 250, type: !354)
!955 = !DILocation(line: 250, column: 58, scope: !949)
!956 = !DILocalVariable(name: "flags", arg: 4, scope: !949, file: !141, line: 251, type: !73)
!957 = !DILocation(line: 251, column: 27, scope: !949)
!958 = !DILocalVariable(name: "fip", arg: 5, scope: !949, file: !141, line: 251, type: !356)
!959 = !DILocation(line: 251, column: 58, scope: !949)
!960 = !DILocation(line: 253, column: 7, scope: !961)
!961 = distinct !DILexicalBlock(scope: !949, file: !141, line: 253, column: 7)
!962 = !DILocation(line: 253, column: 18, scope: !961)
!963 = !DILocation(line: 253, column: 23, scope: !961)
!964 = !DILocation(line: 253, column: 14, scope: !961)
!965 = !DILocation(line: 253, column: 7, scope: !949)
!966 = !DILocation(line: 254, column: 5, scope: !961)
!967 = !DILocation(line: 256, column: 7, scope: !968)
!968 = distinct !DILexicalBlock(scope: !949, file: !141, line: 256, column: 7)
!969 = !DILocation(line: 256, column: 12, scope: !968)
!970 = !DILocation(line: 256, column: 17, scope: !968)
!971 = !DILocation(line: 256, column: 7, scope: !949)
!972 = !DILocation(line: 257, column: 75, scope: !968)
!973 = !DILocation(line: 257, column: 80, scope: !968)
!974 = !DILocation(line: 257, column: 57, scope: !968)
!975 = !DILocation(line: 257, column: 102, scope: !968)
!976 = !DILocation(line: 257, column: 107, scope: !968)
!977 = !DILocation(line: 257, column: 5, scope: !978)
!978 = !DILexicalBlockFile(scope: !968, file: !141, discriminator: 1)
!979 = !DILocation(line: 257, column: 5, scope: !968)
!980 = !DILocation(line: 259, column: 7, scope: !981)
!981 = distinct !DILexicalBlock(scope: !949, file: !141, line: 259, column: 7)
!982 = !DILocation(line: 259, column: 12, scope: !981)
!983 = !DILocation(line: 259, column: 18, scope: !981)
!984 = !DILocation(line: 259, column: 7, scope: !949)
!985 = !DILocation(line: 260, column: 76, scope: !981)
!986 = !DILocation(line: 260, column: 81, scope: !981)
!987 = !DILocation(line: 260, column: 58, scope: !981)
!988 = !DILocation(line: 260, column: 103, scope: !981)
!989 = !DILocation(line: 260, column: 108, scope: !981)
!990 = !DILocation(line: 260, column: 5, scope: !991)
!991 = !DILexicalBlockFile(scope: !981, file: !141, discriminator: 1)
!992 = !DILocation(line: 260, column: 5, scope: !981)
!993 = !DILocation(line: 263, column: 11, scope: !949)
!994 = !DILocation(line: 263, column: 16, scope: !949)
!995 = !DILocation(line: 263, column: 3, scope: !949)
!996 = !DILocation(line: 266, column: 9, scope: !997)
!997 = distinct !DILexicalBlock(scope: !998, file: !141, line: 266, column: 9)
!998 = distinct !DILexicalBlock(scope: !949, file: !141, line: 263, column: 24)
!999 = !DILocation(line: 266, column: 14, scope: !997)
!1000 = !DILocation(line: 266, column: 28, scope: !997)
!1001 = !DILocation(line: 266, column: 31, scope: !1002)
!1002 = !DILexicalBlockFile(scope: !997, file: !141, discriminator: 1)
!1003 = !DILocation(line: 266, column: 36, scope: !1002)
!1004 = !DILocation(line: 266, column: 43, scope: !1002)
!1005 = !DILocation(line: 266, column: 9, scope: !1002)
!1006 = !DILocation(line: 267, column: 96, scope: !997)
!1007 = !DILocation(line: 267, column: 101, scope: !997)
!1008 = !DILocation(line: 267, column: 78, scope: !997)
!1009 = !DILocation(line: 267, column: 139, scope: !997)
!1010 = !DILocation(line: 267, column: 123, scope: !1002)
!1011 = !DILocation(line: 267, column: 7, scope: !1012)
!1012 = !DILexicalBlockFile(scope: !997, file: !141, discriminator: 2)
!1013 = !DILocation(line: 267, column: 7, scope: !997)
!1014 = !DILocation(line: 269, column: 5, scope: !998)
!1015 = !DILocation(line: 273, column: 9, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !998, file: !141, line: 273, column: 9)
!1017 = !DILocation(line: 273, column: 14, scope: !1016)
!1018 = !DILocation(line: 273, column: 9, scope: !998)
!1019 = !DILocation(line: 274, column: 85, scope: !1016)
!1020 = !DILocation(line: 274, column: 90, scope: !1016)
!1021 = !DILocation(line: 274, column: 67, scope: !1016)
!1022 = !DILocation(line: 274, column: 128, scope: !1016)
!1023 = !DILocation(line: 274, column: 112, scope: !1024)
!1024 = !DILexicalBlockFile(scope: !1016, file: !141, discriminator: 1)
!1025 = !DILocation(line: 274, column: 7, scope: !1026)
!1026 = !DILexicalBlockFile(scope: !1016, file: !141, discriminator: 2)
!1027 = !DILocation(line: 274, column: 7, scope: !1016)
!1028 = !DILocation(line: 276, column: 5, scope: !998)
!1029 = !DILocation(line: 278, column: 9, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !998, file: !141, line: 278, column: 9)
!1031 = !DILocation(line: 278, column: 14, scope: !1030)
!1032 = !DILocation(line: 278, column: 21, scope: !1030)
!1033 = !DILocation(line: 278, column: 26, scope: !1030)
!1034 = !DILocation(line: 278, column: 9, scope: !998)
!1035 = !DILocation(line: 279, column: 88, scope: !1030)
!1036 = !DILocation(line: 279, column: 93, scope: !1030)
!1037 = !DILocation(line: 279, column: 70, scope: !1030)
!1038 = !DILocation(line: 279, column: 131, scope: !1030)
!1039 = !DILocation(line: 279, column: 115, scope: !1040)
!1040 = !DILexicalBlockFile(scope: !1030, file: !141, discriminator: 1)
!1041 = !DILocation(line: 279, column: 7, scope: !1042)
!1042 = !DILexicalBlockFile(scope: !1030, file: !141, discriminator: 2)
!1043 = !DILocation(line: 279, column: 7, scope: !1030)
!1044 = !DILocation(line: 281, column: 5, scope: !998)
!1045 = !DILocation(line: 283, column: 9, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !998, file: !141, line: 283, column: 9)
!1047 = !DILocation(line: 283, column: 14, scope: !1046)
!1048 = !DILocation(line: 283, column: 28, scope: !1046)
!1049 = !DILocation(line: 283, column: 35, scope: !1046)
!1050 = !DILocation(line: 283, column: 38, scope: !1051)
!1051 = !DILexicalBlockFile(scope: !1046, file: !141, discriminator: 1)
!1052 = !DILocation(line: 283, column: 43, scope: !1051)
!1053 = !DILocation(line: 283, column: 50, scope: !1051)
!1054 = !DILocation(line: 283, column: 9, scope: !1051)
!1055 = !DILocation(line: 284, column: 99, scope: !1046)
!1056 = !DILocation(line: 284, column: 104, scope: !1046)
!1057 = !DILocation(line: 284, column: 81, scope: !1046)
!1058 = !DILocation(line: 284, column: 142, scope: !1046)
!1059 = !DILocation(line: 284, column: 126, scope: !1051)
!1060 = !DILocation(line: 284, column: 7, scope: !1061)
!1061 = !DILexicalBlockFile(scope: !1046, file: !141, discriminator: 2)
!1062 = !DILocation(line: 284, column: 7, scope: !1046)
!1063 = !DILocation(line: 286, column: 5, scope: !998)
!1064 = !DILocation(line: 288, column: 9, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !998, file: !141, line: 288, column: 9)
!1066 = !DILocation(line: 288, column: 14, scope: !1065)
!1067 = !DILocation(line: 288, column: 28, scope: !1065)
!1068 = !DILocation(line: 288, column: 31, scope: !1069)
!1069 = !DILexicalBlockFile(scope: !1065, file: !141, discriminator: 1)
!1070 = !DILocation(line: 288, column: 36, scope: !1069)
!1071 = !DILocation(line: 288, column: 43, scope: !1069)
!1072 = !DILocation(line: 288, column: 9, scope: !1069)
!1073 = !DILocation(line: 289, column: 96, scope: !1065)
!1074 = !DILocation(line: 289, column: 101, scope: !1065)
!1075 = !DILocation(line: 289, column: 78, scope: !1065)
!1076 = !DILocation(line: 289, column: 139, scope: !1065)
!1077 = !DILocation(line: 289, column: 123, scope: !1069)
!1078 = !DILocation(line: 289, column: 7, scope: !1079)
!1079 = !DILexicalBlockFile(scope: !1065, file: !141, discriminator: 2)
!1080 = !DILocation(line: 289, column: 7, scope: !1065)
!1081 = !DILocation(line: 291, column: 5, scope: !998)
!1082 = !DILocation(line: 293, column: 74, scope: !998)
!1083 = !DILocation(line: 293, column: 79, scope: !998)
!1084 = !DILocation(line: 293, column: 5, scope: !998)
!1085 = !DILocation(line: 296, column: 7, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !949, file: !141, line: 296, column: 7)
!1087 = !DILocation(line: 296, column: 12, scope: !1086)
!1088 = !DILocation(line: 296, column: 7, scope: !949)
!1089 = !DILocation(line: 297, column: 20, scope: !1086)
!1090 = !DILocation(line: 297, column: 5, scope: !1086)
!1091 = !DILocation(line: 298, column: 18, scope: !949)
!1092 = !DILocation(line: 298, column: 36, scope: !949)
!1093 = !DILocation(line: 298, column: 22, scope: !949)
!1094 = !DILocation(line: 298, column: 63, scope: !949)
!1095 = !DILocation(line: 298, column: 49, scope: !1096)
!1096 = !DILexicalBlockFile(scope: !949, file: !141, discriminator: 1)
!1097 = !DILocation(line: 298, column: 42, scope: !1098)
!1098 = !DILexicalBlockFile(scope: !949, file: !141, discriminator: 2)
!1099 = !DILocation(line: 298, column: 3, scope: !1100)
!1100 = !DILexicalBlockFile(scope: !949, file: !141, discriminator: 3)
!1101 = !DILocation(line: 299, column: 19, scope: !949)
!1102 = !DILocation(line: 299, column: 3, scope: !949)
!1103 = !DILocation(line: 300, column: 18, scope: !949)
!1104 = !DILocation(line: 300, column: 37, scope: !949)
!1105 = !DILocation(line: 300, column: 22, scope: !949)
!1106 = !DILocation(line: 300, column: 65, scope: !949)
!1107 = !DILocation(line: 300, column: 50, scope: !1096)
!1108 = !DILocation(line: 300, column: 43, scope: !1098)
!1109 = !DILocation(line: 300, column: 3, scope: !1100)
!1110 = !DILocation(line: 301, column: 19, scope: !949)
!1111 = !DILocation(line: 301, column: 3, scope: !949)
!1112 = !DILocation(line: 302, column: 18, scope: !949)
!1113 = !DILocation(line: 302, column: 38, scope: !949)
!1114 = !DILocation(line: 302, column: 22, scope: !949)
!1115 = !DILocation(line: 302, column: 67, scope: !949)
!1116 = !DILocation(line: 302, column: 51, scope: !1096)
!1117 = !DILocation(line: 302, column: 44, scope: !1098)
!1118 = !DILocation(line: 302, column: 3, scope: !1100)
!1119 = !DILocation(line: 303, column: 7, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !949, file: !141, line: 303, column: 7)
!1121 = !DILocation(line: 303, column: 12, scope: !1120)
!1122 = !DILocation(line: 303, column: 7, scope: !949)
!1123 = !DILocation(line: 304, column: 21, scope: !1120)
!1124 = !DILocation(line: 304, column: 5, scope: !1120)
!1125 = !DILocation(line: 305, column: 1, scope: !949)
!1126 = distinct !DISubprogram(name: "varbufdependency", scope: !141, file: !141, line: 307, type: !1127, isLocal: false, isDefinition: true, scopeLine: 307, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{null, !213, !239}
!1129 = !DILocalVariable(name: "vb", arg: 1, scope: !1126, file: !141, line: 307, type: !213)
!1130 = !DILocation(line: 307, column: 38, scope: !1126)
!1131 = !DILocalVariable(name: "dep", arg: 2, scope: !1126, file: !141, line: 307, type: !239)
!1132 = !DILocation(line: 307, column: 61, scope: !1126)
!1133 = !DILocalVariable(name: "dop", scope: !1126, file: !141, line: 308, type: !235)
!1134 = !DILocation(line: 308, column: 20, scope: !1126)
!1135 = !DILocalVariable(name: "possdel", scope: !1126, file: !141, line: 309, type: !128)
!1136 = !DILocation(line: 309, column: 15, scope: !1126)
!1137 = !DILocation(line: 311, column: 10, scope: !1126)
!1138 = !DILocation(line: 312, column: 13, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1126, file: !141, line: 312, column: 3)
!1140 = !DILocation(line: 312, column: 18, scope: !1139)
!1141 = !DILocation(line: 312, column: 11, scope: !1139)
!1142 = !DILocation(line: 312, column: 8, scope: !1139)
!1143 = !DILocation(line: 312, column: 24, scope: !1144)
!1144 = !DILexicalBlockFile(scope: !1145, file: !141, discriminator: 1)
!1145 = distinct !DILexicalBlock(scope: !1139, file: !141, line: 312, column: 3)
!1146 = !DILocation(line: 312, column: 3, scope: !1144)
!1147 = !DILocation(line: 313, column: 9, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1149, file: !141, line: 313, column: 9)
!1149 = distinct !DILexicalBlock(scope: !1145, file: !141, line: 312, column: 45)
!1150 = !DILocation(line: 313, column: 14, scope: !1148)
!1151 = !DILocation(line: 313, column: 20, scope: !1148)
!1152 = !DILocation(line: 313, column: 17, scope: !1148)
!1153 = !DILocation(line: 313, column: 9, scope: !1149)
!1154 = !DILocation(line: 314, column: 7, scope: !1148)
!1155 = !DILocation(line: 316, column: 20, scope: !1149)
!1156 = !DILocation(line: 316, column: 24, scope: !1149)
!1157 = !DILocation(line: 316, column: 40, scope: !1149)
!1158 = !DILocation(line: 316, column: 33, scope: !1149)
!1159 = !DILocation(line: 316, column: 5, scope: !1160)
!1160 = !DILexicalBlockFile(scope: !1149, file: !141, discriminator: 1)
!1161 = !DILocation(line: 317, column: 13, scope: !1149)
!1162 = !DILocation(line: 318, column: 20, scope: !1149)
!1163 = !DILocation(line: 318, column: 24, scope: !1149)
!1164 = !DILocation(line: 318, column: 29, scope: !1149)
!1165 = !DILocation(line: 318, column: 33, scope: !1149)
!1166 = !DILocation(line: 318, column: 46, scope: !1149)
!1167 = !DILocation(line: 318, column: 51, scope: !1149)
!1168 = !DILocation(line: 318, column: 55, scope: !1149)
!1169 = !DILocation(line: 318, column: 39, scope: !1149)
!1170 = !DILocation(line: 318, column: 5, scope: !1160)
!1171 = !DILocation(line: 319, column: 10, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1149, file: !141, line: 319, column: 9)
!1173 = !DILocation(line: 319, column: 15, scope: !1172)
!1174 = !DILocation(line: 319, column: 9, scope: !1149)
!1175 = !DILocation(line: 320, column: 27, scope: !1172)
!1176 = !DILocation(line: 320, column: 31, scope: !1172)
!1177 = !DILocation(line: 320, column: 36, scope: !1172)
!1178 = !DILocation(line: 320, column: 7, scope: !1172)
!1179 = !DILocation(line: 321, column: 9, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1149, file: !141, line: 321, column: 9)
!1181 = !DILocation(line: 321, column: 14, scope: !1180)
!1182 = !DILocation(line: 321, column: 21, scope: !1180)
!1183 = !DILocation(line: 321, column: 9, scope: !1149)
!1184 = !DILocation(line: 322, column: 22, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1180, file: !141, line: 321, column: 44)
!1186 = !DILocation(line: 322, column: 7, scope: !1185)
!1187 = !DILocation(line: 323, column: 15, scope: !1185)
!1188 = !DILocation(line: 323, column: 20, scope: !1185)
!1189 = !DILocation(line: 323, column: 7, scope: !1185)
!1190 = !DILocation(line: 325, column: 25, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1185, file: !141, line: 323, column: 28)
!1192 = !DILocation(line: 325, column: 9, scope: !1191)
!1193 = !DILocation(line: 326, column: 9, scope: !1191)
!1194 = !DILocation(line: 328, column: 24, scope: !1191)
!1195 = !DILocation(line: 328, column: 9, scope: !1191)
!1196 = !DILocation(line: 329, column: 9, scope: !1191)
!1197 = !DILocation(line: 331, column: 24, scope: !1191)
!1198 = !DILocation(line: 331, column: 9, scope: !1191)
!1199 = !DILocation(line: 332, column: 9, scope: !1191)
!1200 = !DILocation(line: 334, column: 24, scope: !1191)
!1201 = !DILocation(line: 334, column: 9, scope: !1191)
!1202 = !DILocation(line: 335, column: 9, scope: !1191)
!1203 = !DILocation(line: 337, column: 24, scope: !1191)
!1204 = !DILocation(line: 337, column: 9, scope: !1191)
!1205 = !DILocation(line: 338, column: 9, scope: !1191)
!1206 = !DILocation(line: 340, column: 75, scope: !1191)
!1207 = !DILocation(line: 340, column: 80, scope: !1191)
!1208 = !DILocation(line: 340, column: 9, scope: !1191)
!1209 = !DILocation(line: 342, column: 23, scope: !1185)
!1210 = !DILocation(line: 342, column: 7, scope: !1185)
!1211 = !DILocation(line: 343, column: 21, scope: !1185)
!1212 = !DILocation(line: 343, column: 25, scope: !1185)
!1213 = !DILocation(line: 343, column: 30, scope: !1185)
!1214 = !DILocation(line: 343, column: 7, scope: !1185)
!1215 = !DILocation(line: 344, column: 23, scope: !1185)
!1216 = !DILocation(line: 344, column: 7, scope: !1185)
!1217 = !DILocation(line: 345, column: 5, scope: !1185)
!1218 = !DILocation(line: 346, column: 3, scope: !1149)
!1219 = !DILocation(line: 312, column: 34, scope: !1220)
!1220 = !DILexicalBlockFile(scope: !1145, file: !141, discriminator: 2)
!1221 = !DILocation(line: 312, column: 39, scope: !1220)
!1222 = !DILocation(line: 312, column: 32, scope: !1220)
!1223 = !DILocation(line: 312, column: 3, scope: !1220)
!1224 = distinct !{!1224, !1225}
!1225 = !DILocation(line: 312, column: 3, scope: !1126)
!1226 = !DILocation(line: 347, column: 1, scope: !1126)
!1227 = distinct !DISubprogram(name: "w_dependency", scope: !141, file: !141, line: 350, type: !211, isLocal: false, isDefinition: true, scopeLine: 353, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!1228 = !DILocalVariable(name: "vb", arg: 1, scope: !1227, file: !141, line: 350, type: !213)
!1229 = !DILocation(line: 350, column: 29, scope: !1227)
!1230 = !DILocalVariable(name: "pkg", arg: 2, scope: !1227, file: !141, line: 351, type: !220)
!1231 = !DILocation(line: 351, column: 36, scope: !1227)
!1232 = !DILocalVariable(name: "pkgbin", arg: 3, scope: !1227, file: !141, line: 351, type: !354)
!1233 = !DILocation(line: 351, column: 62, scope: !1227)
!1234 = !DILocalVariable(name: "flags", arg: 4, scope: !1227, file: !141, line: 352, type: !73)
!1235 = !DILocation(line: 352, column: 31, scope: !1227)
!1236 = !DILocalVariable(name: "fip", arg: 5, scope: !1227, file: !141, line: 352, type: !356)
!1237 = !DILocation(line: 352, column: 62, scope: !1227)
!1238 = !DILocalVariable(name: "dyp", scope: !1227, file: !141, line: 354, type: !239)
!1239 = !DILocation(line: 354, column: 22, scope: !1227)
!1240 = !DILocalVariable(name: "dep_found", scope: !1227, file: !141, line: 355, type: !135)
!1241 = !DILocation(line: 355, column: 7, scope: !1227)
!1242 = !DILocation(line: 357, column: 14, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1227, file: !141, line: 357, column: 3)
!1244 = !DILocation(line: 357, column: 22, scope: !1243)
!1245 = !DILocation(line: 357, column: 12, scope: !1243)
!1246 = !DILocation(line: 357, column: 8, scope: !1243)
!1247 = !DILocation(line: 357, column: 31, scope: !1248)
!1248 = !DILexicalBlockFile(scope: !1249, file: !141, discriminator: 1)
!1249 = distinct !DILexicalBlock(scope: !1243, file: !141, line: 357, column: 3)
!1250 = !DILocation(line: 357, column: 3, scope: !1248)
!1251 = !DILocation(line: 358, column: 9, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1253, file: !141, line: 358, column: 9)
!1253 = distinct !DILexicalBlock(scope: !1249, file: !141, line: 357, column: 53)
!1254 = !DILocation(line: 358, column: 14, scope: !1252)
!1255 = !DILocation(line: 358, column: 22, scope: !1252)
!1256 = !DILocation(line: 358, column: 27, scope: !1252)
!1257 = !DILocation(line: 358, column: 19, scope: !1252)
!1258 = !DILocation(line: 358, column: 9, scope: !1253)
!1259 = !DILocation(line: 358, column: 36, scope: !1260)
!1260 = !DILexicalBlockFile(scope: !1252, file: !141, discriminator: 1)
!1261 = !DILocation(line: 360, column: 9, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1253, file: !141, line: 360, column: 9)
!1263 = !DILocation(line: 360, column: 14, scope: !1262)
!1264 = !DILocation(line: 360, column: 20, scope: !1262)
!1265 = !DILocation(line: 360, column: 17, scope: !1262)
!1266 = !DILocation(line: 360, column: 9, scope: !1253)
!1267 = !DILocation(line: 361, column: 86, scope: !1262)
!1268 = !DILocation(line: 361, column: 91, scope: !1262)
!1269 = !DILocation(line: 361, column: 68, scope: !1262)
!1270 = !DILocation(line: 361, column: 7, scope: !1271)
!1271 = !DILexicalBlockFile(scope: !1262, file: !141, discriminator: 1)
!1272 = !DILocation(line: 361, column: 7, scope: !1262)
!1273 = !DILocation(line: 364, column: 9, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1253, file: !141, line: 364, column: 9)
!1275 = !DILocation(line: 364, column: 9, scope: !1253)
!1276 = !DILocation(line: 365, column: 22, scope: !1277)
!1277 = distinct !DILexicalBlock(scope: !1274, file: !141, line: 364, column: 20)
!1278 = !DILocation(line: 365, column: 7, scope: !1277)
!1279 = !DILocation(line: 366, column: 5, scope: !1277)
!1280 = !DILocation(line: 367, column: 11, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !1282, file: !141, line: 367, column: 11)
!1282 = distinct !DILexicalBlock(scope: !1274, file: !141, line: 366, column: 12)
!1283 = !DILocation(line: 367, column: 17, scope: !1281)
!1284 = !DILocation(line: 367, column: 11, scope: !1282)
!1285 = !DILocation(line: 368, column: 30, scope: !1281)
!1286 = !DILocation(line: 368, column: 34, scope: !1281)
!1287 = !DILocation(line: 368, column: 9, scope: !1281)
!1288 = !DILocation(line: 369, column: 17, scope: !1282)
!1289 = !DILocation(line: 371, column: 22, scope: !1253)
!1290 = !DILocation(line: 371, column: 25, scope: !1253)
!1291 = !DILocation(line: 371, column: 5, scope: !1253)
!1292 = !DILocation(line: 372, column: 3, scope: !1253)
!1293 = !DILocation(line: 357, column: 42, scope: !1294)
!1294 = !DILexicalBlockFile(scope: !1249, file: !141, discriminator: 2)
!1295 = !DILocation(line: 357, column: 47, scope: !1294)
!1296 = !DILocation(line: 357, column: 40, scope: !1294)
!1297 = !DILocation(line: 357, column: 3, scope: !1294)
!1298 = distinct !{!1298, !1299}
!1299 = !DILocation(line: 357, column: 3, scope: !1227)
!1300 = !DILocation(line: 373, column: 8, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !1227, file: !141, line: 373, column: 7)
!1302 = !DILocation(line: 373, column: 14, scope: !1301)
!1303 = !DILocation(line: 373, column: 32, scope: !1301)
!1304 = !DILocation(line: 373, column: 35, scope: !1305)
!1305 = !DILexicalBlockFile(scope: !1301, file: !141, discriminator: 1)
!1306 = !DILocation(line: 373, column: 7, scope: !1305)
!1307 = !DILocation(line: 374, column: 21, scope: !1301)
!1308 = !DILocation(line: 374, column: 5, scope: !1301)
!1309 = !DILocation(line: 375, column: 1, scope: !1227)
!1310 = distinct !DISubprogram(name: "w_conffiles", scope: !141, file: !141, line: 378, type: !211, isLocal: false, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!1311 = !DILocalVariable(name: "vb", arg: 1, scope: !1310, file: !141, line: 378, type: !213)
!1312 = !DILocation(line: 378, column: 28, scope: !1310)
!1313 = !DILocalVariable(name: "pkg", arg: 2, scope: !1310, file: !141, line: 379, type: !220)
!1314 = !DILocation(line: 379, column: 35, scope: !1310)
!1315 = !DILocalVariable(name: "pkgbin", arg: 3, scope: !1310, file: !141, line: 379, type: !354)
!1316 = !DILocation(line: 379, column: 61, scope: !1310)
!1317 = !DILocalVariable(name: "flags", arg: 4, scope: !1310, file: !141, line: 380, type: !73)
!1318 = !DILocation(line: 380, column: 30, scope: !1310)
!1319 = !DILocalVariable(name: "fip", arg: 5, scope: !1310, file: !141, line: 380, type: !356)
!1320 = !DILocation(line: 380, column: 61, scope: !1310)
!1321 = !DILocalVariable(name: "i", scope: !1310, file: !141, line: 382, type: !296)
!1322 = !DILocation(line: 382, column: 20, scope: !1310)
!1323 = !DILocation(line: 384, column: 8, scope: !1324)
!1324 = distinct !DILexicalBlock(scope: !1310, file: !141, line: 384, column: 7)
!1325 = !DILocation(line: 384, column: 16, scope: !1324)
!1326 = !DILocation(line: 384, column: 26, scope: !1324)
!1327 = !DILocation(line: 384, column: 29, scope: !1328)
!1328 = !DILexicalBlockFile(scope: !1324, file: !141, discriminator: 1)
!1329 = !DILocation(line: 384, column: 40, scope: !1328)
!1330 = !DILocation(line: 384, column: 45, scope: !1328)
!1331 = !DILocation(line: 384, column: 36, scope: !1328)
!1332 = !DILocation(line: 384, column: 7, scope: !1328)
!1333 = !DILocation(line: 385, column: 5, scope: !1324)
!1334 = !DILocation(line: 386, column: 7, scope: !1335)
!1335 = distinct !DILexicalBlock(scope: !1310, file: !141, line: 386, column: 7)
!1336 = !DILocation(line: 386, column: 12, scope: !1335)
!1337 = !DILocation(line: 386, column: 7, scope: !1310)
!1338 = !DILocation(line: 387, column: 20, scope: !1335)
!1339 = !DILocation(line: 387, column: 5, scope: !1335)
!1340 = !DILocation(line: 388, column: 12, scope: !1341)
!1341 = distinct !DILexicalBlock(scope: !1310, file: !141, line: 388, column: 3)
!1342 = !DILocation(line: 388, column: 20, scope: !1341)
!1343 = !DILocation(line: 388, column: 10, scope: !1341)
!1344 = !DILocation(line: 388, column: 8, scope: !1341)
!1345 = !DILocation(line: 388, column: 31, scope: !1346)
!1346 = !DILexicalBlockFile(scope: !1347, file: !141, discriminator: 1)
!1347 = distinct !DILexicalBlock(scope: !1341, file: !141, line: 388, column: 3)
!1348 = !DILocation(line: 388, column: 3, scope: !1346)
!1349 = !DILocation(line: 389, column: 9, scope: !1350)
!1350 = distinct !DILexicalBlock(scope: !1351, file: !141, line: 389, column: 9)
!1351 = distinct !DILexicalBlock(scope: !1347, file: !141, line: 388, column: 47)
!1352 = !DILocation(line: 389, column: 14, scope: !1350)
!1353 = !DILocation(line: 389, column: 22, scope: !1350)
!1354 = !DILocation(line: 389, column: 11, scope: !1350)
!1355 = !DILocation(line: 389, column: 9, scope: !1351)
!1356 = !DILocation(line: 390, column: 23, scope: !1350)
!1357 = !DILocation(line: 390, column: 7, scope: !1350)
!1358 = !DILocation(line: 391, column: 21, scope: !1351)
!1359 = !DILocation(line: 391, column: 5, scope: !1351)
!1360 = !DILocation(line: 392, column: 20, scope: !1351)
!1361 = !DILocation(line: 392, column: 24, scope: !1351)
!1362 = !DILocation(line: 392, column: 27, scope: !1351)
!1363 = !DILocation(line: 392, column: 40, scope: !1351)
!1364 = !DILocation(line: 392, column: 43, scope: !1351)
!1365 = !DILocation(line: 392, column: 33, scope: !1351)
!1366 = !DILocation(line: 392, column: 5, scope: !1367)
!1367 = !DILexicalBlockFile(scope: !1351, file: !141, discriminator: 1)
!1368 = !DILocation(line: 393, column: 21, scope: !1351)
!1369 = !DILocation(line: 393, column: 5, scope: !1351)
!1370 = !DILocation(line: 394, column: 20, scope: !1351)
!1371 = !DILocation(line: 394, column: 24, scope: !1351)
!1372 = !DILocation(line: 394, column: 27, scope: !1351)
!1373 = !DILocation(line: 394, column: 40, scope: !1351)
!1374 = !DILocation(line: 394, column: 43, scope: !1351)
!1375 = !DILocation(line: 394, column: 33, scope: !1351)
!1376 = !DILocation(line: 394, column: 5, scope: !1367)
!1377 = !DILocation(line: 395, column: 9, scope: !1378)
!1378 = distinct !DILexicalBlock(scope: !1351, file: !141, line: 395, column: 9)
!1379 = !DILocation(line: 395, column: 12, scope: !1378)
!1380 = !DILocation(line: 395, column: 9, scope: !1351)
!1381 = !DILocation(line: 396, column: 22, scope: !1378)
!1382 = !DILocation(line: 396, column: 7, scope: !1378)
!1383 = !DILocation(line: 397, column: 3, scope: !1351)
!1384 = !DILocation(line: 388, column: 38, scope: !1385)
!1385 = !DILexicalBlockFile(scope: !1347, file: !141, discriminator: 2)
!1386 = !DILocation(line: 388, column: 41, scope: !1385)
!1387 = !DILocation(line: 388, column: 36, scope: !1385)
!1388 = !DILocation(line: 388, column: 3, scope: !1385)
!1389 = distinct !{!1389, !1390}
!1390 = !DILocation(line: 388, column: 3, scope: !1310)
!1391 = !DILocation(line: 398, column: 7, scope: !1392)
!1392 = distinct !DILexicalBlock(scope: !1310, file: !141, line: 398, column: 7)
!1393 = !DILocation(line: 398, column: 12, scope: !1392)
!1394 = !DILocation(line: 398, column: 7, scope: !1310)
!1395 = !DILocation(line: 399, column: 21, scope: !1392)
!1396 = !DILocation(line: 399, column: 5, scope: !1392)
!1397 = !DILocation(line: 400, column: 1, scope: !1310)
!1398 = distinct !DISubprogram(name: "w_trigpend", scope: !141, file: !141, line: 403, type: !211, isLocal: false, isDefinition: true, scopeLine: 406, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!1399 = !DILocalVariable(name: "vb", arg: 1, scope: !1398, file: !141, line: 403, type: !213)
!1400 = !DILocation(line: 403, column: 27, scope: !1398)
