; ModuleID = './[inter]lib--dpkg--options.o.i'
source_filename = "./[inter]lib--dpkg--options.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.cmdinfo = type { i8*, i8, i32, i32*, i8**, void (%struct.cmdinfo*, i8*)*, i32, i8*, i32 (i8**)* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [7 x i8] c"%s\0A\0A%s\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"dpkg\00", align 1
@printforhelp = internal global i8* null, align 8
@.str.2 = private unnamed_addr constant [10 x i8] c"%s/%s.cfg\00", align 1
@.str.3 = private unnamed_addr constant [20 x i8] c"/usr/local/etc/dpkg\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"HOME\00", align 1
@.str.5 = private unnamed_addr constant [11 x i8] c"%s/.%s.cfg\00", align 1
@.str.6 = private unnamed_addr constant [3 x i8] c"--\00", align 1
@.str.7 = private unnamed_addr constant [20 x i8] c"unknown option --%s\00", align 1
@.str.8 = private unnamed_addr constant [26 x i8] c"--%s option takes a value\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !14, globals: !16)
!1 = !DIFile(filename: "[inter]lib--dpkg--options.o.i", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_ctype_bit", file: !4, line: 32, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../lib/dpkg/c-ctype.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13}
!6 = !DIEnumerator(name: "C_CTYPE_BLANK", value: 1)
!7 = !DIEnumerator(name: "C_CTYPE_WHITE", value: 2)
!8 = !DIEnumerator(name: "C_CTYPE_SPACE", value: 4)
!9 = !DIEnumerator(name: "C_CTYPE_UPPER", value: 8)
!10 = !DIEnumerator(name: "C_CTYPE_LOWER", value: 16)
!11 = !DIEnumerator(name: "C_CTYPE_DIGIT", value: 32)
!12 = !DIEnumerator(name: "C_CTYPE_ALPHA", value: 24)
!13 = !DIEnumerator(name: "C_CTYPE_ALNUM", value: 56)
!14 = !{!15}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!16 = !{!17, !48}
!17 = distinct !DIGlobalVariable(name: "cipaction", scope: !0, file: !18, line: 306, type: !19, isLocal: false, isDefinition: true, variable: %struct.cmdinfo** @cipaction)
!18 = !DIFile(filename: "options.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmdinfo", file: !22, line: 38, size: 512, align: 64, elements: !23)
!22 = !DIFile(filename: "../../lib/dpkg/options.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!23 = !{!24, !28, !29, !31, !33, !35, !39, !40, !41}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "olong", scope: !21, file: !22, line: 39, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "oshort", scope: !21, file: !22, line: 40, baseType: !27, size: 8, align: 8, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "takesvalue", scope: !21, file: !22, line: 48, baseType: !30, size: 32, align: 32, offset: 96)
!30 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "iassignto", scope: !21, file: !22, line: 49, baseType: !32, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "sassignto", scope: !21, file: !22, line: 50, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !21, file: !22, line: 51, baseType: !36, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !19, !25}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "arg_int", scope: !21, file: !22, line: 53, baseType: !30, size: 32, align: 32, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "arg_ptr", scope: !21, file: !22, line: 54, baseType: !15, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !21, file: !22, line: 56, baseType: !42, size: 64, align: 64, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "action_func", file: !22, line: 36, baseType: !44)
!44 = !DISubroutineType(types: !45)
!45 = !{!30, !46}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!48 = distinct !DIGlobalVariable(name: "printforhelp", scope: !0, file: !18, line: 39, type: !25, isLocal: true, isDefinition: true, variable: i8** @printforhelp)
!49 = !{i32 2, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!52 = distinct !DISubprogram(name: "badusage", scope: !18, file: !18, line: 42, type: !53, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !55)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !25, null}
!55 = !{}
!56 = !DILocalVariable(name: "fmt", arg: 1, scope: !52, file: !18, line: 42, type: !25)
!57 = !DIExpression()
!58 = !DILocation(line: 42, column: 22, scope: !52)
!59 = !DILocalVariable(name: "buf", scope: !52, file: !18, line: 44, type: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!61 = !DILocation(line: 44, column: 9, scope: !52)
!62 = !DILocalVariable(name: "args", scope: !52, file: !18, line: 45, type: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !64, line: 98, baseType: !65)
!64 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !64, line: 40, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 45, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 192, align: 64, elements: !75)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 45, size: 192, align: 64, elements: !69)
!69 = !{!70, !72, !73, !74}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !68, file: !1, line: 45, baseType: !71, size: 32, align: 32)
!71 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !68, file: !1, line: 45, baseType: !71, size: 32, align: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !68, file: !1, line: 45, baseType: !15, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !68, file: !1, line: 45, baseType: !15, size: 64, align: 64, offset: 128)
!75 = !{!76}
!76 = !DISubrange(count: 1)
!77 = !DILocation(line: 45, column: 11, scope: !52)
!78 = !DILocation(line: 47, column: 2, scope: !52)
!79 = !DILocation(line: 48, column: 21, scope: !52)
!80 = !DILocation(line: 48, column: 26, scope: !52)
!81 = !DILocation(line: 48, column: 3, scope: !52)
!82 = !DILocation(line: 49, column: 2, scope: !52)
!83 = !DILocation(line: 51, column: 22, scope: !52)
!84 = !DILocation(line: 51, column: 26, scope: !52)
!85 = !DILocation(line: 51, column: 3, scope: !86)
!86 = !DILexicalBlockFile(scope: !52, file: !18, discriminator: 1)
!87 = !DILocation(line: 51, column: 3, scope: !52)
!88 = !DILocation(line: 52, column: 1, scope: !52)
!89 = distinct !DISubprogram(name: "dpkg_options_load", scope: !18, file: !18, line: 197, type: !90, isLocal: false, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !55)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !25, !19}
!92 = !DILocalVariable(name: "prog", arg: 1, scope: !89, file: !18, line: 197, type: !25)
!93 = !DILocation(line: 197, column: 31, scope: !89)
!94 = !DILocalVariable(name: "cmdinfos", arg: 2, scope: !89, file: !18, line: 197, type: !19)
!95 = !DILocation(line: 197, column: 59, scope: !89)
!96 = !DILocalVariable(name: "home", scope: !89, file: !18, line: 199, type: !60)
!97 = !DILocation(line: 199, column: 9, scope: !89)
!98 = !DILocalVariable(name: "file", scope: !89, file: !18, line: 199, type: !60)
!99 = !DILocation(line: 199, column: 16, scope: !89)
!100 = !DILocation(line: 201, column: 25, scope: !89)
!101 = !DILocation(line: 201, column: 31, scope: !89)
!102 = !DILocation(line: 201, column: 3, scope: !89)
!103 = !DILocation(line: 203, column: 54, scope: !89)
!104 = !DILocation(line: 203, column: 10, scope: !89)
!105 = !DILocation(line: 203, column: 8, scope: !89)
!106 = !DILocation(line: 204, column: 26, scope: !89)
!107 = !DILocation(line: 204, column: 32, scope: !89)
!108 = !DILocation(line: 204, column: 3, scope: !89)
!109 = !DILocation(line: 205, column: 8, scope: !89)
!110 = !DILocation(line: 205, column: 3, scope: !89)
!111 = !DILocation(line: 207, column: 10, scope: !89)
!112 = !DILocation(line: 207, column: 8, scope: !89)
!113 = !DILocation(line: 208, column: 7, scope: !114)
!114 = distinct !DILexicalBlock(scope: !89, file: !18, line: 208, column: 7)
!115 = !DILocation(line: 208, column: 12, scope: !114)
!116 = !DILocation(line: 208, column: 7, scope: !89)
!117 = !DILocation(line: 209, column: 34, scope: !118)
!118 = distinct !DILexicalBlock(scope: !114, file: !18, line: 208, column: 20)
!119 = !DILocation(line: 209, column: 40, scope: !118)
!120 = !DILocation(line: 209, column: 12, scope: !118)
!121 = !DILocation(line: 209, column: 10, scope: !118)
!122 = !DILocation(line: 210, column: 28, scope: !118)
!123 = !DILocation(line: 210, column: 34, scope: !118)
!124 = !DILocation(line: 210, column: 5, scope: !118)
!125 = !DILocation(line: 211, column: 10, scope: !118)
!126 = !DILocation(line: 211, column: 5, scope: !118)
!127 = !DILocation(line: 212, column: 3, scope: !118)
!128 = !DILocation(line: 213, column: 1, scope: !89)
!129 = distinct !DISubprogram(name: "dpkg_options_load_dir", scope: !18, file: !18, line: 165, type: !90, isLocal: true, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !55)
!130 = !DILocalVariable(name: "prog", arg: 1, scope: !129, file: !18, line: 165, type: !25)
!131 = !DILocation(line: 165, column: 35, scope: !129)
!132 = !DILocalVariable(name: "cmdinfos", arg: 2, scope: !129, file: !18, line: 165, type: !19)
!133 = !DILocation(line: 165, column: 63, scope: !129)
!134 = !DILocalVariable(name: "dirname", scope: !129, file: !18, line: 167, type: !60)
!135 = !DILocation(line: 167, column: 9, scope: !129)
!136 = !DILocalVariable(name: "dlist", scope: !129, file: !18, line: 168, type: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !140, line: 22, size: 2240, align: 64, elements: !141)
!140 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!141 = !{!142, !146, !149, !151, !153}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !139, file: !140, line: 25, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !144, line: 127, baseType: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!145 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !139, file: !140, line: 26, baseType: !147, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !144, line: 131, baseType: !148)
!148 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !139, file: !140, line: 31, baseType: !150, size: 16, align: 16, offset: 128)
!150 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !139, file: !140, line: 32, baseType: !152, size: 8, align: 8, offset: 144)
!152 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !139, file: !140, line: 33, baseType: !154, size: 2048, align: 8, offset: 152)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, align: 8, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 256)
!157 = !DILocation(line: 168, column: 19, scope: !129)
!158 = !DILocalVariable(name: "dlist_n", scope: !129, file: !18, line: 169, type: !30)
!159 = !DILocation(line: 169, column: 7, scope: !129)
!160 = !DILocalVariable(name: "i", scope: !129, file: !18, line: 169, type: !30)
!161 = !DILocation(line: 169, column: 16, scope: !129)
!162 = !DILocation(line: 171, column: 59, scope: !129)
!163 = !DILocation(line: 171, column: 13, scope: !129)
!164 = !DILocation(line: 171, column: 11, scope: !129)
!165 = !DILocation(line: 173, column: 21, scope: !129)
!166 = !DILocation(line: 173, column: 13, scope: !129)
!167 = !DILocation(line: 173, column: 11, scope: !129)
!168 = !DILocation(line: 174, column: 7, scope: !169)
!169 = distinct !DILexicalBlock(scope: !129, file: !18, line: 174, column: 7)
!170 = !DILocation(line: 174, column: 15, scope: !169)
!171 = !DILocation(line: 174, column: 7, scope: !129)
!172 = !DILocation(line: 175, column: 10, scope: !173)
!173 = distinct !DILexicalBlock(scope: !174, file: !18, line: 175, column: 8)
!174 = distinct !DILexicalBlock(scope: !169, file: !18, line: 174, column: 20)
!175 = !DILocation(line: 175, column: 9, scope: !173)
!176 = !DILocation(line: 175, column: 14, scope: !173)
!177 = !DILocation(line: 175, column: 8, scope: !174)
!178 = !DILocation(line: 176, column: 12, scope: !179)
!179 = distinct !DILexicalBlock(scope: !173, file: !18, line: 175, column: 25)
!180 = !DILocation(line: 176, column: 7, scope: !179)
!181 = !DILocation(line: 177, column: 7, scope: !179)
!182 = !DILocation(line: 179, column: 14, scope: !173)
!183 = !DILocation(line: 179, column: 63, scope: !173)
!184 = !DILocation(line: 179, column: 7, scope: !185)
!185 = !DILexicalBlockFile(scope: !173, file: !18, discriminator: 1)
!186 = !DILocation(line: 179, column: 7, scope: !173)
!187 = !DILocation(line: 182, column: 10, scope: !188)
!188 = distinct !DILexicalBlock(scope: !129, file: !18, line: 182, column: 3)
!189 = !DILocation(line: 182, column: 8, scope: !188)
!190 = !DILocation(line: 182, column: 15, scope: !191)
!191 = !DILexicalBlockFile(scope: !192, file: !18, discriminator: 1)
!192 = distinct !DILexicalBlock(scope: !188, file: !18, line: 182, column: 3)
!193 = !DILocation(line: 182, column: 19, scope: !191)
!194 = !DILocation(line: 182, column: 17, scope: !191)
!195 = !DILocation(line: 182, column: 3, scope: !191)
!196 = !DILocalVariable(name: "filename", scope: !197, file: !18, line: 183, type: !60)
!197 = distinct !DILexicalBlock(scope: !192, file: !18, line: 182, column: 33)
!198 = !DILocation(line: 183, column: 11, scope: !197)
!199 = !DILocation(line: 185, column: 33, scope: !197)
!200 = !DILocation(line: 185, column: 48, scope: !197)
!201 = !DILocation(line: 185, column: 42, scope: !197)
!202 = !DILocation(line: 185, column: 52, scope: !197)
!203 = !DILocation(line: 185, column: 16, scope: !197)
!204 = !DILocation(line: 185, column: 14, scope: !197)
!205 = !DILocation(line: 186, column: 28, scope: !197)
!206 = !DILocation(line: 186, column: 38, scope: !197)
!207 = !DILocation(line: 186, column: 5, scope: !197)
!208 = !DILocation(line: 188, column: 16, scope: !197)
!209 = !DILocation(line: 188, column: 10, scope: !197)
!210 = !DILocation(line: 188, column: 5, scope: !197)
!211 = !DILocation(line: 189, column: 10, scope: !197)
!212 = !DILocation(line: 189, column: 5, scope: !197)
!213 = !DILocation(line: 190, column: 3, scope: !197)
!214 = !DILocation(line: 182, column: 29, scope: !215)
!215 = !DILexicalBlockFile(scope: !192, file: !18, discriminator: 2)
!216 = !DILocation(line: 182, column: 3, scope: !215)
!217 = distinct !{!217, !218}
!218 = !DILocation(line: 182, column: 3, scope: !129)
!219 = !DILocation(line: 192, column: 8, scope: !129)
!220 = !DILocation(line: 192, column: 3, scope: !129)
!221 = !DILocation(line: 193, column: 8, scope: !129)
!222 = !DILocation(line: 193, column: 3, scope: !129)
!223 = !DILocation(line: 194, column: 1, scope: !129)
!224 = !DILocation(line: 194, column: 1, scope: !225)
!225 = !DILexicalBlockFile(scope: !129, file: !18, discriminator: 1)
!226 = distinct !DISubprogram(name: "dpkg_options_load_file", scope: !18, file: !18, line: 68, type: !90, isLocal: true, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !55)
!227 = !DILocalVariable(name: "fn", arg: 1, scope: !226, file: !18, line: 68, type: !25)
!228 = !DILocation(line: 68, column: 36, scope: !226)
!229 = !DILocalVariable(name: "cmdinfos", arg: 2, scope: !226, file: !18, line: 68, type: !19)
!230 = !DILocation(line: 68, column: 62, scope: !226)
!231 = !DILocalVariable(name: "file", scope: !226, file: !18, line: 70, type: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !234, line: 48, baseType: !235)
!234 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !236, line: 241, size: 1728, align: 64, elements: !237)
!236 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !258, !259, !260, !261, !262, !263, !265, !267, !270, !272, !273, !274, !275, !276, !279, !280}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !235, file: !236, line: 242, baseType: !30, size: 32, align: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !235, file: !236, line: 247, baseType: !60, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !235, file: !236, line: 248, baseType: !60, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !235, file: !236, line: 249, baseType: !60, size: 64, align: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !235, file: !236, line: 250, baseType: !60, size: 64, align: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !235, file: !236, line: 251, baseType: !60, size: 64, align: 64, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !235, file: !236, line: 252, baseType: !60, size: 64, align: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !235, file: !236, line: 253, baseType: !60, size: 64, align: 64, offset: 448)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !235, file: !236, line: 254, baseType: !60, size: 64, align: 64, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !235, file: !236, line: 256, baseType: !60, size: 64, align: 64, offset: 576)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !235, file: !236, line: 257, baseType: !60, size: 64, align: 64, offset: 640)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !235, file: !236, line: 258, baseType: !60, size: 64, align: 64, offset: 704)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !235, file: !236, line: 260, baseType: !251, size: 64, align: 64, offset: 768)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !236, line: 156, size: 192, align: 64, elements: !253)
!253 = !{!254, !255, !257}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !252, file: !236, line: 157, baseType: !251, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !252, file: !236, line: 158, baseType: !256, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !252, file: !236, line: 162, baseType: !30, size: 32, align: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !235, file: !236, line: 262, baseType: !256, size: 64, align: 64, offset: 832)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !235, file: !236, line: 264, baseType: !30, size: 32, align: 32, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !235, file: !236, line: 268, baseType: !30, size: 32, align: 32, offset: 928)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !235, file: !236, line: 270, baseType: !147, size: 64, align: 64, offset: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !235, file: !236, line: 274, baseType: !150, size: 16, align: 16, offset: 1024)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !235, file: !236, line: 275, baseType: !264, size: 8, align: 8, offset: 1040)
!264 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !235, file: !236, line: 276, baseType: !266, size: 8, align: 8, offset: 1048)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, align: 8, elements: !75)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !235, file: !236, line: 280, baseType: !268, size: 64, align: 64, offset: 1088)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !236, line: 150, baseType: null)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !235, file: !236, line: 289, baseType: !271, size: 64, align: 64, offset: 1152)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !144, line: 132, baseType: !148)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !235, file: !236, line: 297, baseType: !15, size: 64, align: 64, offset: 1216)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !235, file: !236, line: 298, baseType: !15, size: 64, align: 64, offset: 1280)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !235, file: !236, line: 299, baseType: !15, size: 64, align: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !235, file: !236, line: 300, baseType: !15, size: 64, align: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !235, file: !236, line: 302, baseType: !277, size: 64, align: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !278, line: 216, baseType: !145)
!278 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !235, file: !236, line: 303, baseType: !30, size: 32, align: 32, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !235, file: !236, line: 305, baseType: !281, size: 160, align: 8, offset: 1568)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, align: 8, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 20)
!284 = !DILocation(line: 70, column: 9, scope: !226)
!285 = !DILocalVariable(name: "line_num", scope: !226, file: !18, line: 71, type: !30)
!286 = !DILocation(line: 71, column: 7, scope: !226)
!287 = !DILocalVariable(name: "linebuf", scope: !226, file: !18, line: 72, type: !288)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8192, align: 8, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 1024)
!291 = !DILocation(line: 72, column: 8, scope: !226)
!292 = !DILocation(line: 74, column: 15, scope: !226)
!293 = !DILocation(line: 74, column: 9, scope: !226)
!294 = !DILocation(line: 74, column: 7, scope: !226)
!295 = !DILocation(line: 75, column: 8, scope: !296)
!296 = distinct !DILexicalBlock(scope: !226, file: !18, line: 75, column: 7)
!297 = !DILocation(line: 75, column: 7, scope: !226)
!298 = !DILocation(line: 76, column: 10, scope: !299)
!299 = distinct !DILexicalBlock(scope: !300, file: !18, line: 76, column: 8)
!300 = distinct !DILexicalBlock(scope: !296, file: !18, line: 75, column: 14)
!301 = !DILocation(line: 76, column: 9, scope: !299)
!302 = !DILocation(line: 76, column: 13, scope: !299)
!303 = !DILocation(line: 76, column: 8, scope: !300)
!304 = !DILocation(line: 77, column: 7, scope: !299)
!305 = !DILocation(line: 78, column: 12, scope: !300)
!306 = !DILocation(line: 79, column: 13, scope: !300)
!307 = !DILocation(line: 79, column: 27, scope: !300)
!308 = !DILocation(line: 79, column: 26, scope: !300)
!309 = !DILocation(line: 79, column: 17, scope: !310)
!310 = !DILexicalBlockFile(scope: !300, file: !18, discriminator: 1)
!311 = !DILocation(line: 78, column: 5, scope: !310)
!312 = !DILocation(line: 80, column: 5, scope: !300)
!313 = !DILocation(line: 83, column: 3, scope: !226)
!314 = !DILocation(line: 83, column: 16, scope: !315)
!315 = !DILexicalBlockFile(scope: !226, file: !18, discriminator: 1)
!316 = !DILocation(line: 83, column: 42, scope: !315)
!317 = !DILocation(line: 83, column: 10, scope: !315)
!318 = !DILocation(line: 83, column: 3, scope: !315)
!319 = !DILocalVariable(name: "opt", scope: !320, file: !18, line: 84, type: !60)
!320 = distinct !DILexicalBlock(scope: !226, file: !18, line: 83, column: 49)
!321 = !DILocation(line: 84, column: 11, scope: !320)
!322 = !DILocalVariable(name: "cip", scope: !320, file: !18, line: 85, type: !19)
!323 = !DILocation(line: 85, column: 27, scope: !320)
!324 = !DILocalVariable(name: "l", scope: !320, file: !18, line: 86, type: !30)
!325 = !DILocation(line: 86, column: 9, scope: !320)
!326 = !DILocation(line: 88, column: 13, scope: !320)
!327 = !DILocation(line: 90, column: 16, scope: !320)
!328 = !DILocation(line: 90, column: 9, scope: !320)
!329 = !DILocation(line: 90, column: 7, scope: !320)
!330 = !DILocation(line: 91, column: 5, scope: !320)
!331 = !DILocation(line: 91, column: 12, scope: !332)
!332 = !DILexicalBlockFile(scope: !320, file: !18, discriminator: 1)
!333 = !DILocation(line: 91, column: 14, scope: !332)
!334 = !DILocation(line: 91, column: 35, scope: !335)
!335 = !DILexicalBlockFile(scope: !320, file: !18, discriminator: 2)
!336 = !DILocation(line: 91, column: 37, scope: !335)
!337 = !DILocation(line: 91, column: 27, scope: !335)
!338 = !DILocation(line: 91, column: 17, scope: !335)
!339 = !DILocation(line: 91, column: 5, scope: !340)
!340 = !DILexicalBlockFile(scope: !320, file: !18, discriminator: 3)
!341 = !DILocation(line: 92, column: 8, scope: !320)
!342 = !DILocation(line: 91, column: 5, scope: !343)
!343 = !DILexicalBlockFile(scope: !320, file: !18, discriminator: 4)
!344 = distinct !{!344, !330}
!345 = !DILocation(line: 93, column: 13, scope: !320)
!346 = !DILocation(line: 93, column: 5, scope: !320)
!347 = !DILocation(line: 93, column: 16, scope: !320)
