; ModuleID = './[inter]lib--dpkg--parsehelp.o.i'
source_filename = "./[inter]lib--dpkg--parsehelp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.varbuf = type { i64, i64, i8* }
%struct.parsedb_state = type { i32, i32, %struct.dpkg_error, %struct.pkginfo*, %struct.pkgbin*, i8*, i8*, i8*, i8*, i32, i32 }
%struct.dpkg_error = type { i32, i32, i8* }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.1, i32 }
%struct.anon.1 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }
%struct.pkgbin = type { %struct.dependency*, i8, i32, %struct.dpkg_arch*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.dpkg_version, %struct.conffile*, %struct.arbitraryfield* }
%struct.conffile = type { %struct.conffile*, i8*, i8*, i8 }

!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgeflag", file: !11, line: 163, size: 32, align: 32, elements: !74)
!74 = !{!75, !76}
!75 = !DIEnumerator(name: "PKG_EFLAG_OK", value: 0)
!76 = !DIEnumerator(name: "PKG_EFLAG_REINSTREQ", value: 1)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgstatus", file: !11, line: 168, size: 32, align: 32, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86}
!79 = !DIEnumerator(name: "PKG_STAT_NOTINSTALLED", value: 0)
!80 = !DIEnumerator(name: "PKG_STAT_CONFIGFILES", value: 1)
!81 = !DIEnumerator(name: "PKG_STAT_HALFINSTALLED", value: 2)
!82 = !DIEnumerator(name: "PKG_STAT_UNPACKED", value: 3)
!83 = !DIEnumerator(name: "PKG_STAT_HALFCONFIGURED", value: 4)
!84 = !DIEnumerator(name: "PKG_STAT_TRIGGERSAWAITED", value: 5)
!85 = !DIEnumerator(name: "PKG_STAT_TRIGGERSPENDING", value: 6)
!86 = !DIEnumerator(name: "PKG_STAT_INSTALLED", value: 7)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgpriority", file: !11, line: 179, size: 32, align: 32, elements: !88)
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96}
!89 = !DIEnumerator(name: "PKG_PRIO_REQUIRED", value: 0)
!90 = !DIEnumerator(name: "PKG_PRIO_IMPORTANT", value: 1)
!91 = !DIEnumerator(name: "PKG_PRIO_STANDARD", value: 2)
!92 = !DIEnumerator(name: "PKG_PRIO_OPTIONAL", value: 3)
!93 = !DIEnumerator(name: "PKG_PRIO_EXTRA", value: 4)
!94 = !DIEnumerator(name: "PKG_PRIO_OTHER", value: 5)
!95 = !DIEnumerator(name: "PKG_PRIO_UNKNOWN", value: 6)
!96 = !DIEnumerator(name: "PKG_PRIO_UNSET", value: -1)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgmultiarch", file: !11, line: 95, size: 32, align: 32, elements: !98)
!98 = !{!99, !100, !101, !102}
!99 = !DIEnumerator(name: "PKG_MULTIARCH_NO", value: 0)
!100 = !DIEnumerator(name: "PKG_MULTIARCH_SAME", value: 1)
!101 = !DIEnumerator(name: "PKG_MULTIARCH_ALLOWED", value: 2)
!102 = !DIEnumerator(name: "PKG_MULTIARCH_FOREIGN", value: 3)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fwriteflags", file: !4, line: 112, size: 32, align: 32, elements: !104)
!104 = !{!105}
!105 = !DIEnumerator(name: "fw_printheader", value: 1)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "versiondisplayepochwhen", file: !11, line: 388, size: 32, align: 32, elements: !107)
!107 = !{!108, !109, !110}
!108 = !DIEnumerator(name: "vdew_never", value: 0)
!109 = !DIEnumerator(name: "vdew_nonambig", value: 1)
!110 = !DIEnumerator(name: "vdew_always", value: 2)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_name_arch_when", file: !11, line: 396, size: 32, align: 32, elements: !112)
!112 = !{!113, !114, !115, !116}
!113 = !DIEnumerator(name: "pnaw_never", value: 0)
!114 = !DIEnumerator(name: "pnaw_nonambig", value: 1)
!115 = !DIEnumerator(name: "pnaw_foreign", value: 2)
!116 = !DIEnumerator(name: "pnaw_always", value: 3)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_ctype_bit", file: !118, line: 32, size: 32, align: 32, elements: !119)
!118 = !DIFile(filename: "../../lib/dpkg/c-ctype.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!119 = !{!120, !121, !122, !123, !124, !125, !126, !127}
!120 = !DIEnumerator(name: "C_CTYPE_BLANK", value: 1)
!121 = !DIEnumerator(name: "C_CTYPE_WHITE", value: 2)
!122 = !DIEnumerator(name: "C_CTYPE_SPACE", value: 4)
!123 = !DIEnumerator(name: "C_CTYPE_UPPER", value: 8)
!124 = !DIEnumerator(name: "C_CTYPE_LOWER", value: 16)
!125 = !DIEnumerator(name: "C_CTYPE_DIGIT", value: 32)
!126 = !DIEnumerator(name: "C_CTYPE_ALPHA", value: 24)
!127 = !DIEnumerator(name: "C_CTYPE_ALNUM", value: 56)
!128 = !{!129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!130 = !{!131, !143, !147, !172, !174, !332}
!131 = distinct !DIGlobalVariable(name: "alsoallowed", scope: !132, file: !133, line: 126, type: !140, isLocal: true, isDefinition: true, variable: [5 x i8]* @pkg_name_is_illegal.alsoallowed)
!132 = distinct !DISubprogram(name: "pkg_name_is_illegal", scope: !133, file: !133, line: 123, type: !134, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!133 = !DIFile(filename: "parsehelp.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!139 = !{}
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 40, align: 8, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 5)
!143 = distinct !DIGlobalVariable(name: "buf", scope: !132, file: !133, line: 127, type: !144, isLocal: true, isDefinition: true, variable: [150 x i8]* @pkg_name_is_illegal.buf)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 1200, align: 8, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 150)
!147 = distinct !DIGlobalVariable(name: "bufs", scope: !148, file: !133, line: 175, type: !159, isLocal: true, isDefinition: true, variable: [10 x %struct.varbuf]* @versiondescribe.bufs)
!148 = distinct !DISubprogram(name: "versiondescribe", scope: !133, file: !133, line: 171, type: !149, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!149 = !DISubroutineType(types: !150)
!150 = !{!136, !151, !106}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !57, line: 42, size: 192, align: 64, elements: !154)
!154 = !{!155, !157, !158}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !153, file: !57, line: 44, baseType: !156, size: 32, align: 32)
!156 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !153, file: !57, line: 46, baseType: !136, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !153, file: !57, line: 48, baseType: !136, size: 64, align: 64, offset: 128)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 1920, align: 64, elements: !170)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !161, line: 55, size: 192, align: 64, elements: !162)
!161 = !DIFile(filename: "../../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!162 = !{!163, !167, !168}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !160, file: !161, line: 56, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !165, line: 216, baseType: !166)
!165 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!166 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !160, file: !161, line: 56, baseType: !164, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !160, file: !161, line: 57, baseType: !169, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!170 = !{!171}
!171 = !DISubrange(count: 10)
!172 = distinct !DIGlobalVariable(name: "bufnum", scope: !148, file: !133, line: 176, type: !173, isLocal: true, isDefinition: true, variable: i32* @versiondescribe.bufnum)
!173 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!174 = distinct !DIGlobalVariable(name: "empty", scope: !175, file: !133, line: 321, type: !329, isLocal: true, isDefinition: true, variable: [1 x i8]* @parse_ensure_have_field.empty)
!175 = distinct !DISubprogram(name: "parse_ensure_have_field", scope: !133, file: !133, line: 318, type: !176, isLocal: false, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !178, !328, !136}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parsedb_state", file: !4, line: 48, size: 640, align: 64, elements: !180)
!180 = !{!181, !182, !183, !189, !320, !322, !323, !324, !325, !326, !327}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !179, file: !4, line: 49, baseType: !3, size: 32, align: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !179, file: !4, line: 50, baseType: !10, size: 32, align: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !179, file: !4, line: 51, baseType: !184, size: 128, align: 64, offset: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_error", file: !29, line: 42, size: 128, align: 64, elements: !185)
!185 = !{!186, !187, !188}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !184, file: !29, line: 43, baseType: !28, size: 32, align: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "syserrno", scope: !184, file: !29, line: 45, baseType: !173, size: 32, align: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !184, file: !29, line: 46, baseType: !169, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !179, file: !4, line: 52, baseType: !190, size: 64, align: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !11, line: 195, size: 3072, align: 64, elements: !192)
!192 = !{!193, !235, !236, !237, !238, !239, !240, !241, !242, !243, !273, !274, !277, !286, !302, !303, !309, !312, !318, !319}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !191, file: !11, line: 196, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !11, line: 242, size: 3392, align: 64, elements: !196)
!196 = !{!197, !198, !199, !200, !234}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !195, file: !11, line: 243, baseType: !194, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !11, line: 244, baseType: !136, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !195, file: !11, line: 245, baseType: !191, size: 3072, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !195, file: !11, line: 249, baseType: !201, size: 128, align: 64, offset: 3200)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !195, file: !11, line: 246, size: 128, align: 64, elements: !202)
!202 = !{!203, !233}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !201, file: !11, line: 247, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !11, line: 63, size: 640, align: 64, elements: !206)
!206 = !{!207, !215, !216, !217, !218, !219, !228, !229, !230, !232}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !205, file: !11, line: 64, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !11, line: 56, size: 256, align: 64, elements: !210)
!210 = !{!211, !212, !213, !214}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !209, file: !11, line: 57, baseType: !190, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !209, file: !11, line: 58, baseType: !208, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !209, file: !11, line: 59, baseType: !204, size: 64, align: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !209, file: !11, line: 60, baseType: !34, size: 32, align: 32, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !205, file: !11, line: 65, baseType: !194, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !11, line: 66, baseType: !204, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !205, file: !11, line: 66, baseType: !204, size: 64, align: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !205, file: !11, line: 66, baseType: !204, size: 64, align: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !205, file: !11, line: 67, baseType: !220, size: 64, align: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !46, line: 48, size: 192, align: 64, elements: !223)
!223 = !{!224, !226, !227}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !46, line: 49, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !222, file: !46, line: 50, baseType: !136, size: 64, align: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !222, file: !46, line: 51, baseType: !45, size: 32, align: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !205, file: !11, line: 68, baseType: !153, size: 192, align: 64, offset: 384)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !205, file: !11, line: 69, baseType: !56, size: 32, align: 32, offset: 576)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !205, file: !11, line: 70, baseType: !231, size: 8, align: 8, offset: 608)
!231 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !205, file: !11, line: 71, baseType: !231, size: 8, align: 8, offset: 616)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !201, file: !11, line: 248, baseType: !204, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !195, file: !11, line: 250, baseType: !173, size: 32, align: 32, offset: 3328)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !191, file: !11, line: 197, baseType: !190, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !191, file: !11, line: 199, baseType: !65, size: 32, align: 32, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !191, file: !11, line: 201, baseType: !73, size: 32, align: 32, offset: 160)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !191, file: !11, line: 202, baseType: !77, size: 32, align: 32, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !191, file: !11, line: 203, baseType: !87, size: 32, align: 32, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !191, file: !11, line: 204, baseType: !136, size: 64, align: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !191, file: !11, line: 205, baseType: !136, size: 64, align: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !191, file: !11, line: 206, baseType: !153, size: 192, align: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !191, file: !11, line: 207, baseType: !244, size: 960, align: 64, offset: 576)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !11, line: 107, size: 960, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !266}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !244, file: !11, line: 108, baseType: !208, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !244, file: !11, line: 110, baseType: !231, size: 8, align: 8, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !244, file: !11, line: 111, baseType: !97, size: 32, align: 32, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !244, file: !11, line: 112, baseType: !220, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !244, file: !11, line: 115, baseType: !136, size: 64, align: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !244, file: !11, line: 116, baseType: !136, size: 64, align: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !244, file: !11, line: 117, baseType: !136, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !244, file: !11, line: 118, baseType: !136, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !244, file: !11, line: 119, baseType: !136, size: 64, align: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !244, file: !11, line: 120, baseType: !136, size: 64, align: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !244, file: !11, line: 121, baseType: !136, size: 64, align: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !244, file: !11, line: 122, baseType: !153, size: 192, align: 64, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !244, file: !11, line: 123, baseType: !259, size: 64, align: 64, offset: 832)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !11, line: 80, size: 256, align: 64, elements: !261)
!261 = !{!262, !263, !264, !265}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !11, line: 81, baseType: !259, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !11, line: 82, baseType: !136, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !260, file: !11, line: 83, baseType: !136, size: 64, align: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !260, file: !11, line: 84, baseType: !231, size: 8, align: 8, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !244, file: !11, line: 124, baseType: !267, size: 64, align: 64, offset: 896)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !11, line: 74, size: 192, align: 64, elements: !269)
!269 = !{!270, !271, !272}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !11, line: 75, baseType: !267, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !11, line: 76, baseType: !136, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !268, file: !11, line: 77, baseType: !136, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !191, file: !11, line: 208, baseType: !244, size: 960, align: 64, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !191, file: !11, line: 209, baseType: !275, size: 64, align: 64, offset: 2496)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !11, line: 151, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !191, file: !11, line: 211, baseType: !278, size: 64, align: 64, offset: 2560)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !11, line: 87, size: 320, align: 64, elements: !280)
!280 = !{!281, !282, !283, !284, !285}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !279, file: !11, line: 88, baseType: !278, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !279, file: !11, line: 89, baseType: !136, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !279, file: !11, line: 90, baseType: !136, size: 64, align: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !279, file: !11, line: 91, baseType: !136, size: 64, align: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !279, file: !11, line: 92, baseType: !136, size: 64, align: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !191, file: !11, line: 216, baseType: !287, size: 128, align: 64, offset: 2624)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !191, file: !11, line: 213, size: 128, align: 64, elements: !288)
!288 = !{!289, !301}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !287, file: !11, line: 215, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !11, line: 142, size: 320, align: 64, elements: !292)
!292 = !{!293, !294, !295, !296}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !291, file: !11, line: 143, baseType: !190, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !291, file: !11, line: 143, baseType: !190, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !291, file: !11, line: 144, baseType: !290, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !291, file: !11, line: 147, baseType: !297, size: 128, align: 64, offset: 192)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !291, file: !11, line: 145, size: 128, align: 64, elements: !298)
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !11, line: 146, baseType: !290, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !297, file: !11, line: 146, baseType: !290, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !287, file: !11, line: 215, baseType: !290, size: 64, align: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !191, file: !11, line: 219, baseType: !290, size: 64, align: 64, offset: 2752)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !191, file: !11, line: 220, baseType: !304, size: 64, align: 64, offset: 2816)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !11, line: 134, size: 128, align: 64, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !11, line: 135, baseType: !304, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !11, line: 136, baseType: !136, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !191, file: !11, line: 231, baseType: !310, size: 64, align: 64, offset: 2880)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !11, line: 231, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !191, file: !11, line: 232, baseType: !313, size: 64, align: 64, offset: 2944)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !314, line: 86, baseType: !315)
!314 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !316, line: 131, baseType: !317)
!316 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!317 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !191, file: !11, line: 233, baseType: !231, size: 8, align: 8, offset: 3008)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !191, file: !11, line: 236, baseType: !231, size: 8, align: 8, offset: 3016)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pkgbin", scope: !179, file: !4, line: 53, baseType: !321, size: 64, align: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !179, file: !4, line: 54, baseType: !169, size: 64, align: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "dataptr", scope: !179, file: !4, line: 55, baseType: !169, size: 64, align: 64, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "endptr", scope: !179, file: !4, line: 56, baseType: !169, size: 64, align: 64, offset: 448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !179, file: !4, line: 57, baseType: !136, size: 64, align: 64, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !179, file: !4, line: 58, baseType: !173, size: 32, align: 32, offset: 576)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "lno", scope: !179, file: !4, line: 59, baseType: !173, size: 32, align: 32, offset: 608)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 8, align: 8, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 1)
!332 = distinct !DIGlobalVariable(name: "msg", scope: !333, file: !133, line: 42, type: !336, isLocal: true, isDefinition: true, variable: [1024 x i8]* @parse_error_msg.msg)
!333 = distinct !DISubprogram(name: "parse_error_msg", scope: !133, file: !133, line: 40, type: !334, isLocal: true, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!334 = !DISubroutineType(types: !335)
!335 = !{!136, !178, !136}
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 8192, align: 8, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 1024)
!339 = !{i32 2, !"Dwarf Version", i32 4}
!340 = !{i32 2, !"Debug Info Version", i32 3}
!341 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!342 = distinct !DISubprogram(name: "parse_error", scope: !133, file: !133, line: 62, type: !343, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !178, !136, null}
!345 = !DILocalVariable(name: "ps", arg: 1, scope: !342, file: !133, line: 62, type: !178)
!346 = !DIExpression()
!347 = !DILocation(line: 62, column: 35, scope: !342)
!348 = !DILocalVariable(name: "fmt", arg: 2, scope: !342, file: !133, line: 62, type: !136)
!349 = !DILocation(line: 62, column: 51, scope: !342)
!350 = !DILocalVariable(name: "args", scope: !342, file: !133, line: 64, type: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !352, line: 79, baseType: !353)
!352 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !354, line: 40, baseType: !355)
!354 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 64, baseType: !356)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 192, align: 64, elements: !330)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 64, size: 192, align: 64, elements: !358)
!358 = !{!359, !360, !361, !362}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !357, file: !1, line: 64, baseType: !156, size: 32, align: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !357, file: !1, line: 64, baseType: !156, size: 32, align: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !357, file: !1, line: 64, baseType: !129, size: 64, align: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !357, file: !1, line: 64, baseType: !129, size: 64, align: 64, offset: 128)
!363 = !DILocation(line: 64, column: 11, scope: !342)
!364 = !DILocation(line: 66, column: 2, scope: !342)
!365 = !DILocation(line: 67, column: 27, scope: !342)
!366 = !DILocation(line: 67, column: 31, scope: !342)
!367 = !DILocation(line: 67, column: 11, scope: !342)
!368 = !DILocation(line: 67, column: 37, scope: !342)
!369 = !DILocation(line: 67, column: 3, scope: !370)
!370 = !DILexicalBlockFile(scope: !342, file: !133, discriminator: 1)
!371 = !DILocation(line: 67, column: 3, scope: !342)
!372 = !DILocation(line: 68, column: 1, scope: !342)
!373 = !DILocalVariable(name: "ps", arg: 1, scope: !333, file: !133, line: 40, type: !178)
!374 = !DILocation(line: 40, column: 39, scope: !333)
!375 = !DILocalVariable(name: "fmt", arg: 2, scope: !333, file: !133, line: 40, type: !136)
!376 = !DILocation(line: 40, column: 55, scope: !333)
!377 = !DILocalVariable(name: "filename", scope: !333, file: !133, line: 43, type: !378)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 2048, align: 8, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 256)
!381 = !DILocation(line: 43, column: 8, scope: !333)
!382 = !DILocation(line: 45, column: 18, scope: !333)
!383 = !DILocation(line: 45, column: 28, scope: !333)
!384 = !DILocation(line: 45, column: 32, scope: !333)
!385 = !DILocation(line: 45, column: 3, scope: !333)
!386 = !DILocation(line: 47, column: 7, scope: !387)
!387 = distinct !DILexicalBlock(scope: !333, file: !133, line: 47, column: 7)
!388 = !DILocation(line: 47, column: 11, scope: !387)
!389 = !DILocation(line: 47, column: 15, scope: !387)
!390 = !DILocation(line: 47, column: 18, scope: !391)
!391 = !DILexicalBlockFile(scope: !387, file: !133, discriminator: 1)
!392 = !DILocation(line: 47, column: 22, scope: !391)
!393 = !DILocation(line: 47, column: 27, scope: !391)
!394 = !DILocation(line: 47, column: 32, scope: !391)
!395 = !DILocation(line: 47, column: 7, scope: !391)
!396 = !DILocalVariable(name: "pkgname", scope: !397, file: !133, line: 48, type: !378)
!397 = distinct !DILexicalBlock(scope: !387, file: !133, line: 47, column: 38)
!398 = !DILocation(line: 48, column: 10, scope: !397)
!399 = !DILocation(line: 50, column: 20, scope: !397)
!400 = !DILocation(line: 50, column: 41, scope: !397)
!401 = !DILocation(line: 50, column: 45, scope: !397)
!402 = !DILocation(line: 50, column: 50, scope: !397)
!403 = !DILocation(line: 50, column: 54, scope: !397)
!404 = !DILocation(line: 50, column: 29, scope: !397)
!405 = !DILocation(line: 50, column: 5, scope: !406)
!406 = !DILexicalBlockFile(scope: !397, file: !133, discriminator: 1)
!407 = !DILocation(line: 52, column: 17, scope: !397)
!408 = !DILocation(line: 53, column: 31, scope: !397)
!409 = !DILocation(line: 53, column: 41, scope: !397)
!410 = !DILocation(line: 53, column: 45, scope: !397)
!411 = !DILocation(line: 53, column: 50, scope: !397)
!412 = !DILocation(line: 53, column: 59, scope: !397)
!413 = !DILocation(line: 52, column: 5, scope: !406)
!414 = !DILocation(line: 54, column: 3, scope: !397)
!415 = !DILocation(line: 55, column: 17, scope: !387)
!416 = !DILocation(line: 56, column: 31, scope: !387)
!417 = !DILocation(line: 56, column: 41, scope: !387)
!418 = !DILocation(line: 56, column: 45, scope: !387)
!419 = !DILocation(line: 56, column: 50, scope: !387)
!420 = !DILocation(line: 55, column: 5, scope: !391)
!421 = !DILocation(line: 58, column: 3, scope: !333)
!422 = distinct !DISubprogram(name: "parse_warn", scope: !133, file: !133, line: 71, type: !343, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!423 = !DILocalVariable(name: "ps", arg: 1, scope: !422, file: !133, line: 71, type: !178)
!424 = !DILocation(line: 71, column: 34, scope: !422)
!425 = !DILocalVariable(name: "fmt", arg: 2, scope: !422, file: !133, line: 71, type: !136)
!426 = !DILocation(line: 71, column: 50, scope: !422)
!427 = !DILocalVariable(name: "args", scope: !422, file: !133, line: 73, type: !351)
!428 = !DILocation(line: 73, column: 11, scope: !422)
!429 = !DILocation(line: 75, column: 2, scope: !422)
!430 = !DILocation(line: 76, column: 28, scope: !422)
!431 = !DILocation(line: 76, column: 32, scope: !422)
!432 = !DILocation(line: 76, column: 12, scope: !422)
!433 = !DILocation(line: 76, column: 38, scope: !422)
!434 = !DILocation(line: 76, column: 3, scope: !435)
!435 = !DILexicalBlockFile(scope: !422, file: !133, discriminator: 1)
!436 = !DILocation(line: 77, column: 2, scope: !422)
!437 = !DILocation(line: 78, column: 1, scope: !422)
!438 = distinct !DISubprogram(name: "parse_problem", scope: !133, file: !133, line: 81, type: !343, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!439 = !DILocalVariable(name: "ps", arg: 1, scope: !438, file: !133, line: 81, type: !178)
!440 = !DILocation(line: 81, column: 37, scope: !438)
!441 = !DILocalVariable(name: "fmt", arg: 2, scope: !438, file: !133, line: 81, type: !136)
!442 = !DILocation(line: 81, column: 53, scope: !438)
!443 = !DILocalVariable(name: "args", scope: !438, file: !133, line: 83, type: !351)
!444 = !DILocation(line: 83, column: 11, scope: !438)
!445 = !DILocalVariable(name: "str", scope: !438, file: !133, line: 84, type: !169)
!446 = !DILocation(line: 84, column: 9, scope: !438)
!447 = !DILocation(line: 86, column: 2, scope: !438)
!448 = !DILocation(line: 87, column: 37, scope: !438)
!449 = !DILocation(line: 87, column: 41, scope: !438)
!450 = !DILocation(line: 87, column: 21, scope: !438)
!451 = !DILocation(line: 87, column: 47, scope: !438)
!452 = !DILocation(line: 87, column: 3, scope: !453)
!453 = !DILexicalBlockFile(scope: !438, file: !133, discriminator: 1)
!454 = !DILocation(line: 88, column: 2, scope: !438)
!455 = !DILocation(line: 90, column: 7, scope: !456)
!456 = distinct !DILexicalBlock(scope: !438, file: !133, line: 90, column: 7)
!457 = !DILocation(line: 90, column: 11, scope: !456)
!458 = !DILocation(line: 90, column: 15, scope: !456)
!459 = !DILocation(line: 90, column: 20, scope: !456)
!460 = !DILocation(line: 90, column: 7, scope: !438)
!461 = !DILocation(line: 91, column: 23, scope: !456)
!462 = !DILocation(line: 91, column: 28, scope: !456)
!463 = !DILocation(line: 91, column: 32, scope: !456)
!464 = !DILocation(line: 91, column: 36, scope: !456)
!465 = !DILocation(line: 91, column: 5, scope: !456)
!466 = !DILocation(line: 93, column: 22, scope: !456)
!467 = !DILocation(line: 93, column: 27, scope: !456)
!468 = !DILocation(line: 93, column: 31, scope: !456)
!469 = !DILocation(line: 93, column: 35, scope: !456)
!470 = !DILocation(line: 93, column: 5, scope: !456)
!471 = !DILocation(line: 95, column: 8, scope: !438)
!472 = !DILocation(line: 95, column: 3, scope: !438)
!473 = !DILocation(line: 96, column: 1, scope: !438)
!474 = distinct !DISubprogram(name: "find_field_info", scope: !133, file: !133, line: 99, type: !475, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!475 = !DISubroutineType(types: !476)
!476 = !{!477, !477, !136}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fieldinfo", file: !4, line: 133, size: 320, align: 64, elements: !480)
!480 = !{!481, !482, !483, !488, !498}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !479, file: !4, line: 134, baseType: !136, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "namelen", scope: !479, file: !4, line: 135, baseType: !164, size: 64, align: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "rcall", scope: !479, file: !4, line: 136, baseType: !484, size: 64, align: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "freadfunction", file: !4, line: 97, baseType: !486)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !190, !321, !178, !136, !477}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "wcall", scope: !479, file: !4, line: 137, baseType: !489, size: 64, align: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "fwritefunction", file: !4, line: 117, baseType: !491)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !493, !494, !496, !103, !477}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !479, file: !4, line: 138, baseType: !164, size: 64, align: 64, offset: 256)
!499 = !DILocalVariable(name: "fields", arg: 1, scope: !474, file: !133, line: 99, type: !477)
!500 = !DILocation(line: 99, column: 41, scope: !474)
!501 = !DILocalVariable(name: "fieldname", arg: 2, scope: !474, file: !133, line: 99, type: !136)
!502 = !DILocation(line: 99, column: 61, scope: !474)
!503 = !DILocalVariable(name: "field", scope: !474, file: !133, line: 101, type: !477)
!504 = !DILocation(line: 101, column: 27, scope: !474)
!505 = !DILocation(line: 103, column: 16, scope: !506)
!506 = distinct !DILexicalBlock(scope: !474, file: !133, line: 103, column: 3)
!507 = !DILocation(line: 103, column: 14, scope: !506)
!508 = !DILocation(line: 103, column: 8, scope: !506)
!509 = !DILocation(line: 103, column: 24, scope: !510)
!510 = !DILexicalBlockFile(scope: !511, file: !133, discriminator: 1)
!511 = distinct !DILexicalBlock(scope: !506, file: !133, line: 103, column: 3)
!512 = !DILocation(line: 103, column: 31, scope: !510)
!513 = !DILocation(line: 103, column: 3, scope: !510)
!514 = !DILocation(line: 104, column: 20, scope: !515)
!515 = distinct !DILexicalBlock(scope: !511, file: !133, line: 104, column: 9)
!516 = !DILocation(line: 104, column: 27, scope: !515)
!517 = !DILocation(line: 104, column: 33, scope: !515)
!518 = !DILocation(line: 104, column: 9, scope: !515)
!519 = !DILocation(line: 104, column: 44, scope: !515)
!520 = !DILocation(line: 104, column: 9, scope: !511)
!521 = !DILocation(line: 105, column: 14, scope: !515)
!522 = !DILocation(line: 105, column: 7, scope: !515)
!523 = !DILocation(line: 104, column: 47, scope: !524)
!524 = !DILexicalBlockFile(scope: !515, file: !133, discriminator: 1)
!525 = !DILocation(line: 103, column: 42, scope: !526)
!526 = !DILexicalBlockFile(scope: !511, file: !133, discriminator: 2)
!527 = !DILocation(line: 103, column: 3, scope: !526)
!528 = distinct !{!528, !529}
!529 = !DILocation(line: 103, column: 3, scope: !474)
!530 = !DILocation(line: 107, column: 3, scope: !474)
!531 = !DILocation(line: 108, column: 1, scope: !474)
!532 = distinct !DISubprogram(name: "find_arbfield_info", scope: !133, file: !133, line: 111, type: !533, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!533 = !DISubroutineType(types: !534)
!534 = !{!535, !535, !136}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!537 = !DILocalVariable(name: "arbs", arg: 1, scope: !532, file: !133, line: 111, type: !535)
!538 = !DILocation(line: 111, column: 49, scope: !532)
!539 = !DILocalVariable(name: "fieldname", arg: 2, scope: !532, file: !133, line: 111, type: !136)
!540 = !DILocation(line: 111, column: 67, scope: !532)
!541 = !DILocalVariable(name: "arbfield", scope: !532, file: !133, line: 113, type: !535)
!542 = !DILocation(line: 113, column: 32, scope: !532)
!543 = !DILocation(line: 115, column: 19, scope: !544)
!544 = distinct !DILexicalBlock(scope: !532, file: !133, line: 115, column: 3)
!545 = !DILocation(line: 115, column: 17, scope: !544)
!546 = !DILocation(line: 115, column: 8, scope: !544)
!547 = !DILocation(line: 115, column: 25, scope: !548)
!548 = !DILexicalBlockFile(scope: !549, file: !133, discriminator: 1)
!549 = distinct !DILexicalBlock(scope: !544, file: !133, line: 115, column: 3)
!550 = !DILocation(line: 115, column: 3, scope: !548)
!551 = !DILocation(line: 116, column: 20, scope: !552)
!552 = distinct !DILexicalBlock(scope: !549, file: !133, line: 116, column: 9)
!553 = !DILocation(line: 116, column: 30, scope: !552)
!554 = !DILocation(line: 116, column: 36, scope: !552)
!555 = !DILocation(line: 116, column: 9, scope: !552)
!556 = !DILocation(line: 116, column: 47, scope: !552)
!557 = !DILocation(line: 116, column: 9, scope: !549)
!558 = !DILocation(line: 117, column: 14, scope: !552)
