; ModuleID = './[inter]lib--dpkg--pkg.o.i'
source_filename = "./[inter]lib--dpkg--pkg.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.1, i32 }
%struct.anon.1 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }
%struct.pkgbin = type { %struct.dependency*, i8, i32, %struct.dpkg_arch*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.dpkg_version, %struct.conffile*, %struct.arbitraryfield* }
%struct.conffile = type { %struct.conffile*, i8*, i8*, i8 }
%struct.arbitraryfield = type { %struct.arbitraryfield*, i8*, i8* }
%struct.perpackagestate = type opaque
%struct.archivedetails = type { %struct.archivedetails*, i8*, i8*, i8*, i8* }
%struct.anon = type { %struct.trigaw*, %struct.trigaw* }

!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "deptype", file: !4, line: 44, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../lib/dpkg/dpkg-db.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "dep_suggests", value: 0)
!7 = !DIEnumerator(name: "dep_recommends", value: 1)
!8 = !DIEnumerator(name: "dep_depends", value: 2)
!9 = !DIEnumerator(name: "dep_predepends", value: 3)
!10 = !DIEnumerator(name: "dep_breaks", value: 4)
!11 = !DIEnumerator(name: "dep_conflicts", value: 5)
!12 = !DIEnumerator(name: "dep_provides", value: 6)
!13 = !DIEnumerator(name: "dep_replaces", value: 7)
!14 = !DIEnumerator(name: "dep_enhances", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_arch_type", file: !16, line: 37, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "../../lib/dpkg/arch.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25}
!18 = !DIEnumerator(name: "DPKG_ARCH_NONE", value: 0)
!19 = !DIEnumerator(name: "DPKG_ARCH_EMPTY", value: 1)
!20 = !DIEnumerator(name: "DPKG_ARCH_ILLEGAL", value: 2)
!21 = !DIEnumerator(name: "DPKG_ARCH_WILDCARD", value: 3)
!22 = !DIEnumerator(name: "DPKG_ARCH_ALL", value: 4)
!23 = !DIEnumerator(name: "DPKG_ARCH_NATIVE", value: 5)
!24 = !DIEnumerator(name: "DPKG_ARCH_FOREIGN", value: 6)
!25 = !DIEnumerator(name: "DPKG_ARCH_UNKNOWN", value: 7)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_relation", file: !27, line: 61, size: 32, align: 32, elements: !28)
!27 = !DIFile(filename: "../../lib/dpkg/version.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "DPKG_RELATION_NONE", value: 0)
!30 = !DIEnumerator(name: "DPKG_RELATION_EQ", value: 1)
!31 = !DIEnumerator(name: "DPKG_RELATION_LT", value: 2)
!32 = !DIEnumerator(name: "DPKG_RELATION_LE", value: 3)
!33 = !DIEnumerator(name: "DPKG_RELATION_GT", value: 4)
!34 = !DIEnumerator(name: "DPKG_RELATION_GE", value: 5)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgwant", file: !4, line: 153, size: 32, align: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41, !42}
!37 = !DIEnumerator(name: "PKG_WANT_UNKNOWN", value: 0)
!38 = !DIEnumerator(name: "PKG_WANT_INSTALL", value: 1)
!39 = !DIEnumerator(name: "PKG_WANT_HOLD", value: 2)
!40 = !DIEnumerator(name: "PKG_WANT_DEINSTALL", value: 3)
!41 = !DIEnumerator(name: "PKG_WANT_PURGE", value: 4)
!42 = !DIEnumerator(name: "PKG_WANT_SENTINEL", value: 5)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgeflag", file: !4, line: 163, size: 32, align: 32, elements: !44)
!44 = !{!45, !46}
!45 = !DIEnumerator(name: "PKG_EFLAG_OK", value: 0)
!46 = !DIEnumerator(name: "PKG_EFLAG_REINSTREQ", value: 1)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgstatus", file: !4, line: 168, size: 32, align: 32, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56}
!49 = !DIEnumerator(name: "PKG_STAT_NOTINSTALLED", value: 0)
!50 = !DIEnumerator(name: "PKG_STAT_CONFIGFILES", value: 1)
!51 = !DIEnumerator(name: "PKG_STAT_HALFINSTALLED", value: 2)
!52 = !DIEnumerator(name: "PKG_STAT_UNPACKED", value: 3)
!53 = !DIEnumerator(name: "PKG_STAT_HALFCONFIGURED", value: 4)
!54 = !DIEnumerator(name: "PKG_STAT_TRIGGERSAWAITED", value: 5)
!55 = !DIEnumerator(name: "PKG_STAT_TRIGGERSPENDING", value: 6)
!56 = !DIEnumerator(name: "PKG_STAT_INSTALLED", value: 7)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgpriority", file: !4, line: 179, size: 32, align: 32, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66}
!59 = !DIEnumerator(name: "PKG_PRIO_REQUIRED", value: 0)
!60 = !DIEnumerator(name: "PKG_PRIO_IMPORTANT", value: 1)
!61 = !DIEnumerator(name: "PKG_PRIO_STANDARD", value: 2)
!62 = !DIEnumerator(name: "PKG_PRIO_OPTIONAL", value: 3)
!63 = !DIEnumerator(name: "PKG_PRIO_EXTRA", value: 4)
!64 = !DIEnumerator(name: "PKG_PRIO_OTHER", value: 5)
!65 = !DIEnumerator(name: "PKG_PRIO_UNKNOWN", value: 6)
!66 = !DIEnumerator(name: "PKG_PRIO_UNSET", value: -1)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgmultiarch", file: !4, line: 95, size: 32, align: 32, elements: !68)
!68 = !{!69, !70, !71, !72}
!69 = !DIEnumerator(name: "PKG_MULTIARCH_NO", value: 0)
!70 = !DIEnumerator(name: "PKG_MULTIARCH_SAME", value: 1)
!71 = !DIEnumerator(name: "PKG_MULTIARCH_ALLOWED", value: 2)
!72 = !DIEnumerator(name: "PKG_MULTIARCH_FOREIGN", value: 3)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!75 = !{i32 2, !"Dwarf Version", i32 4}
!76 = !{i32 2, !"Debug Info Version", i32 3}
!77 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!78 = distinct !DISubprogram(name: "pkg_set_status", scope: !79, file: !79, line: 36, type: !80, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !222)
!79 = !DIFile(filename: "pkg.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!80 = !DISubroutineType(types: !81)
!81 = !{null, !82, !47}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !84)
!84 = !{!85, !137, !138, !139, !140, !141, !142, !143, !144, !145, !175, !176, !179, !188, !204, !205, !211, !214, !220, !221}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !83, file: !4, line: 196, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !88)
!88 = !{!89, !90, !94, !95, !135}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !4, line: 243, baseType: !86, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !87, file: !4, line: 244, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !87, file: !4, line: 245, baseType: !83, size: 3072, align: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !87, file: !4, line: 249, baseType: !96, size: 128, align: 64, offset: 3200)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !4, line: 246, size: 128, align: 64, elements: !97)
!97 = !{!98, !134}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !96, file: !4, line: 247, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !101)
!101 = !{!102, !110, !111, !112, !113, !114, !123, !130, !131, !133}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !100, file: !4, line: 64, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !105)
!105 = !{!106, !107, !108, !109}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !104, file: !4, line: 57, baseType: !82, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !4, line: 58, baseType: !103, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !104, file: !4, line: 59, baseType: !99, size: 64, align: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !4, line: 60, baseType: !3, size: 32, align: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !100, file: !4, line: 65, baseType: !86, size: 64, align: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !100, file: !4, line: 66, baseType: !99, size: 64, align: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !100, file: !4, line: 66, baseType: !99, size: 64, align: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !100, file: !4, line: 66, baseType: !99, size: 64, align: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !100, file: !4, line: 67, baseType: !115, size: 64, align: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !16, line: 48, size: 192, align: 64, elements: !118)
!118 = !{!119, !121, !122}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !117, file: !16, line: 49, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !16, line: 50, baseType: !91, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !117, file: !16, line: 51, baseType: !15, size: 32, align: 32, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !100, file: !4, line: 68, baseType: !124, size: 192, align: 64, offset: 384)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !27, line: 42, size: 192, align: 64, elements: !125)
!125 = !{!126, !128, !129}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !124, file: !27, line: 44, baseType: !127, size: 32, align: 32)
!127 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !124, file: !27, line: 46, baseType: !91, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !124, file: !27, line: 48, baseType: !91, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !100, file: !4, line: 69, baseType: !26, size: 32, align: 32, offset: 576)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !100, file: !4, line: 70, baseType: !132, size: 8, align: 8, offset: 608)
!132 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !100, file: !4, line: 71, baseType: !132, size: 8, align: 8, offset: 616)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !96, file: !4, line: 248, baseType: !99, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !87, file: !4, line: 250, baseType: !136, size: 32, align: 32, offset: 3328)
!136 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !83, file: !4, line: 197, baseType: !82, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !83, file: !4, line: 199, baseType: !35, size: 32, align: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !83, file: !4, line: 201, baseType: !43, size: 32, align: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !83, file: !4, line: 202, baseType: !47, size: 32, align: 32, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !83, file: !4, line: 203, baseType: !57, size: 32, align: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !83, file: !4, line: 204, baseType: !91, size: 64, align: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !83, file: !4, line: 205, baseType: !91, size: 64, align: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !83, file: !4, line: 206, baseType: !124, size: 192, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !83, file: !4, line: 207, baseType: !146, size: 960, align: 64, offset: 576)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !147)
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !168}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !146, file: !4, line: 108, baseType: !103, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !146, file: !4, line: 110, baseType: !132, size: 8, align: 8, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !146, file: !4, line: 111, baseType: !67, size: 32, align: 32, offset: 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !146, file: !4, line: 112, baseType: !115, size: 64, align: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !146, file: !4, line: 115, baseType: !91, size: 64, align: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !146, file: !4, line: 116, baseType: !91, size: 64, align: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !146, file: !4, line: 117, baseType: !91, size: 64, align: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !146, file: !4, line: 118, baseType: !91, size: 64, align: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !146, file: !4, line: 119, baseType: !91, size: 64, align: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !146, file: !4, line: 120, baseType: !91, size: 64, align: 64, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !146, file: !4, line: 121, baseType: !91, size: 64, align: 64, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !146, file: !4, line: 122, baseType: !124, size: 192, align: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !146, file: !4, line: 123, baseType: !161, size: 64, align: 64, offset: 832)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !163)
!163 = !{!164, !165, !166, !167}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !162, file: !4, line: 81, baseType: !161, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !4, line: 82, baseType: !91, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !162, file: !4, line: 83, baseType: !91, size: 64, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !162, file: !4, line: 84, baseType: !132, size: 8, align: 8, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !146, file: !4, line: 124, baseType: !169, size: 64, align: 64, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !171)
!171 = !{!172, !173, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !4, line: 75, baseType: !169, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !170, file: !4, line: 76, baseType: !91, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !170, file: !4, line: 77, baseType: !91, size: 64, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !83, file: !4, line: 208, baseType: !146, size: 960, align: 64, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !83, file: !4, line: 209, baseType: !177, size: 64, align: 64, offset: 2496)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !4, line: 151, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !83, file: !4, line: 211, baseType: !180, size: 64, align: 64, offset: 2560)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !182)
!182 = !{!183, !184, !185, !186, !187}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !4, line: 88, baseType: !180, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !4, line: 89, baseType: !91, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !181, file: !4, line: 90, baseType: !91, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !181, file: !4, line: 91, baseType: !91, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !181, file: !4, line: 92, baseType: !91, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !83, file: !4, line: 216, baseType: !189, size: 128, align: 64, offset: 2624)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !83, file: !4, line: 213, size: 128, align: 64, elements: !190)
!190 = !{!191, !203}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !189, file: !4, line: 215, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !194)
!194 = !{!195, !196, !197, !198}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !193, file: !4, line: 143, baseType: !82, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !193, file: !4, line: 143, baseType: !82, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !193, file: !4, line: 144, baseType: !192, size: 64, align: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !193, file: !4, line: 147, baseType: !199, size: 128, align: 64, offset: 192)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !193, file: !4, line: 145, size: 128, align: 64, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !4, line: 146, baseType: !192, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !199, file: !4, line: 146, baseType: !192, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !189, file: !4, line: 215, baseType: !192, size: 64, align: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !83, file: !4, line: 219, baseType: !192, size: 64, align: 64, offset: 2752)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !83, file: !4, line: 220, baseType: !206, size: 64, align: 64, offset: 2816)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !4, line: 135, baseType: !206, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !207, file: !4, line: 136, baseType: !91, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !83, file: !4, line: 231, baseType: !212, size: 64, align: 64, offset: 2880)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !4, line: 231, flags: DIFlagFwdDecl)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !83, file: !4, line: 232, baseType: !215, size: 64, align: 64, offset: 2944)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !216, line: 86, baseType: !217)
!216 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !218, line: 131, baseType: !219)
!218 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!219 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !83, file: !4, line: 233, baseType: !132, size: 8, align: 8, offset: 3008)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !83, file: !4, line: 236, baseType: !132, size: 8, align: 8, offset: 3016)
!222 = !{}
!223 = !DILocalVariable(name: "pkg", arg: 1, scope: !78, file: !79, line: 36, type: !82)
!224 = !DIExpression()
!225 = !DILocation(line: 36, column: 32, scope: !78)
!226 = !DILocalVariable(name: "status", arg: 2, scope: !78, file: !79, line: 36, type: !47)
!227 = !DILocation(line: 36, column: 52, scope: !78)
!228 = !DILocation(line: 38, column: 6, scope: !229)
!229 = distinct !DILexicalBlock(scope: !78, file: !79, line: 38, column: 6)
!230 = !DILocation(line: 38, column: 11, scope: !229)
!231 = !DILocation(line: 38, column: 21, scope: !229)
!232 = !DILocation(line: 38, column: 18, scope: !229)
!233 = !DILocation(line: 38, column: 6, scope: !78)
!234 = !DILocation(line: 39, column: 3, scope: !229)
!235 = !DILocation(line: 40, column: 11, scope: !236)
!236 = distinct !DILexicalBlock(scope: !229, file: !79, line: 40, column: 11)
!237 = !DILocation(line: 40, column: 16, scope: !236)
!238 = !DILocation(line: 40, column: 23, scope: !236)
!239 = !DILocation(line: 40, column: 11, scope: !229)
!240 = !DILocation(line: 41, column: 3, scope: !236)
!241 = !DILocation(line: 41, column: 8, scope: !236)
!242 = !DILocation(line: 41, column: 13, scope: !236)
!243 = !DILocation(line: 41, column: 32, scope: !236)
!244 = !DILocation(line: 42, column: 11, scope: !245)
!245 = distinct !DILexicalBlock(scope: !236, file: !79, line: 42, column: 11)
!246 = !DILocation(line: 42, column: 18, scope: !245)
!247 = !DILocation(line: 42, column: 11, scope: !236)
!248 = !DILocation(line: 43, column: 3, scope: !245)
!249 = !DILocation(line: 43, column: 8, scope: !245)
!250 = !DILocation(line: 43, column: 13, scope: !245)
!251 = !DILocation(line: 43, column: 32, scope: !245)
!252 = !DILocation(line: 45, column: 6, scope: !253)
!253 = distinct !DILexicalBlock(scope: !78, file: !79, line: 45, column: 6)
!254 = !DILocation(line: 45, column: 11, scope: !253)
!255 = !DILocation(line: 45, column: 16, scope: !253)
!256 = !DILocation(line: 45, column: 36, scope: !253)
!257 = !DILocation(line: 45, column: 6, scope: !78)
!258 = !DILocation(line: 46, column: 70, scope: !253)
!259 = !DILocation(line: 46, column: 75, scope: !253)
!260 = !DILocation(line: 46, column: 80, scope: !253)
!261 = !DILocation(line: 46, column: 86, scope: !253)
!262 = !DILocation(line: 46, column: 91, scope: !253)
!263 = !DILocation(line: 46, column: 96, scope: !253)
!264 = !DILocation(line: 46, column: 3, scope: !253)
!265 = !DILocation(line: 49, column: 16, scope: !78)
!266 = !DILocation(line: 49, column: 2, scope: !78)
!267 = !DILocation(line: 49, column: 7, scope: !78)
!268 = !DILocation(line: 49, column: 14, scope: !78)
!269 = !DILocation(line: 50, column: 2, scope: !78)
!270 = !DILocation(line: 50, column: 7, scope: !78)
!271 = !DILocation(line: 50, column: 20, scope: !78)
!272 = !DILocation(line: 51, column: 1, scope: !78)
!273 = !DILocation(line: 51, column: 1, scope: !274)
!274 = !DILexicalBlockFile(scope: !78, file: !79, discriminator: 1)
!275 = distinct !DISubprogram(name: "pkg_set_eflags", scope: !79, file: !79, line: 57, type: !276, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !222)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !82, !43}
!278 = !DILocalVariable(name: "pkg", arg: 1, scope: !275, file: !79, line: 57, type: !82)
!279 = !DILocation(line: 57, column: 32, scope: !275)
!280 = !DILocalVariable(name: "eflag", arg: 2, scope: !275, file: !79, line: 57, type: !43)
!281 = !DILocation(line: 57, column: 51, scope: !275)
!282 = !DILocation(line: 59, column: 16, scope: !275)
!283 = !DILocation(line: 59, column: 2, scope: !275)
!284 = !DILocation(line: 59, column: 7, scope: !275)
!285 = !DILocation(line: 59, column: 13, scope: !275)
!286 = !DILocation(line: 60, column: 1, scope: !275)
