; ModuleID = './[inter]lib--dpkg--pkg-spec.o.i'
source_filename = "./[inter]lib--dpkg--pkg-spec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pkg_spec = type { i8*, %struct.dpkg_arch*, i32, i8, i8, %struct.pkg_hash_iter*, %struct.pkginfo* }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.pkg_hash_iter = type opaque
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.1, i32 }
%struct.anon.1 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }
%struct.pkgbin = type { %struct.dependency*, i8, i32, %struct.dpkg_arch*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.dpkg_version, %struct.conffile*, %struct.arbitraryfield* }
%struct.conffile = type { %struct.conffile*, i8*, i8*, i8 }
%struct.arbitraryfield = type { %struct.arbitraryfield*, i8*, i8* }
%struct.perpackagestate = type opaque

!15 = !DIFile(filename: "../../lib/dpkg/pkg-spec.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "PKG_SPEC_PATTERNS", value: 1)
!18 = !DIEnumerator(name: "PKG_SPEC_ARCH_SINGLE", value: 256)
!19 = !DIEnumerator(name: "PKG_SPEC_ARCH_WILDCARD", value: 512)
!20 = !DIEnumerator(name: "PKG_SPEC_ARCH_MASK", value: 65280)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "deptype", file: !22, line: 44, size: 32, align: 32, elements: !23)
!22 = !DIFile(filename: "../../lib/dpkg/dpkg-db.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32}
!24 = !DIEnumerator(name: "dep_suggests", value: 0)
!25 = !DIEnumerator(name: "dep_recommends", value: 1)
!26 = !DIEnumerator(name: "dep_depends", value: 2)
!27 = !DIEnumerator(name: "dep_predepends", value: 3)
!28 = !DIEnumerator(name: "dep_breaks", value: 4)
!29 = !DIEnumerator(name: "dep_conflicts", value: 5)
!30 = !DIEnumerator(name: "dep_provides", value: 6)
!31 = !DIEnumerator(name: "dep_replaces", value: 7)
!32 = !DIEnumerator(name: "dep_enhances", value: 8)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_relation", file: !34, line: 61, size: 32, align: 32, elements: !35)
!34 = !DIFile(filename: "../../lib/dpkg/version.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!35 = !{!36, !37, !38, !39, !40, !41}
!36 = !DIEnumerator(name: "DPKG_RELATION_NONE", value: 0)
!37 = !DIEnumerator(name: "DPKG_RELATION_EQ", value: 1)
!38 = !DIEnumerator(name: "DPKG_RELATION_LT", value: 2)
!39 = !DIEnumerator(name: "DPKG_RELATION_LE", value: 3)
!40 = !DIEnumerator(name: "DPKG_RELATION_GT", value: 4)
!41 = !DIEnumerator(name: "DPKG_RELATION_GE", value: 5)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgwant", file: !22, line: 153, size: 32, align: 32, elements: !43)
!43 = !{!44, !45, !46, !47, !48, !49}
!44 = !DIEnumerator(name: "PKG_WANT_UNKNOWN", value: 0)
!45 = !DIEnumerator(name: "PKG_WANT_INSTALL", value: 1)
!46 = !DIEnumerator(name: "PKG_WANT_HOLD", value: 2)
!47 = !DIEnumerator(name: "PKG_WANT_DEINSTALL", value: 3)
!48 = !DIEnumerator(name: "PKG_WANT_PURGE", value: 4)
!49 = !DIEnumerator(name: "PKG_WANT_SENTINEL", value: 5)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgeflag", file: !22, line: 163, size: 32, align: 32, elements: !51)
!51 = !{!52, !53}
!52 = !DIEnumerator(name: "PKG_EFLAG_OK", value: 0)
!53 = !DIEnumerator(name: "PKG_EFLAG_REINSTREQ", value: 1)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgstatus", file: !22, line: 168, size: 32, align: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63}
!56 = !DIEnumerator(name: "PKG_STAT_NOTINSTALLED", value: 0)
!57 = !DIEnumerator(name: "PKG_STAT_CONFIGFILES", value: 1)
!58 = !DIEnumerator(name: "PKG_STAT_HALFINSTALLED", value: 2)
!59 = !DIEnumerator(name: "PKG_STAT_UNPACKED", value: 3)
!60 = !DIEnumerator(name: "PKG_STAT_HALFCONFIGURED", value: 4)
!61 = !DIEnumerator(name: "PKG_STAT_TRIGGERSAWAITED", value: 5)
!62 = !DIEnumerator(name: "PKG_STAT_TRIGGERSPENDING", value: 6)
!63 = !DIEnumerator(name: "PKG_STAT_INSTALLED", value: 7)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgpriority", file: !22, line: 179, size: 32, align: 32, elements: !65)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73}
!66 = !DIEnumerator(name: "PKG_PRIO_REQUIRED", value: 0)
!67 = !DIEnumerator(name: "PKG_PRIO_IMPORTANT", value: 1)
!68 = !DIEnumerator(name: "PKG_PRIO_STANDARD", value: 2)
!69 = !DIEnumerator(name: "PKG_PRIO_OPTIONAL", value: 3)
!70 = !DIEnumerator(name: "PKG_PRIO_EXTRA", value: 4)
!71 = !DIEnumerator(name: "PKG_PRIO_OTHER", value: 5)
!72 = !DIEnumerator(name: "PKG_PRIO_UNKNOWN", value: 6)
!73 = !DIEnumerator(name: "PKG_PRIO_UNSET", value: -1)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgmultiarch", file: !22, line: 95, size: 32, align: 32, elements: !75)
!75 = !{!76, !77, !78, !79}
!76 = !DIEnumerator(name: "PKG_MULTIARCH_NO", value: 0)
!77 = !DIEnumerator(name: "PKG_MULTIARCH_SAME", value: 1)
!78 = !DIEnumerator(name: "PKG_MULTIARCH_ALLOWED", value: 2)
!79 = !DIEnumerator(name: "PKG_MULTIARCH_FOREIGN", value: 3)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_msg_type", file: !81, line: 36, size: 32, align: 32, elements: !82)
!81 = !DIFile(filename: "../../lib/dpkg/error.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!82 = !{!83, !84, !85}
!83 = !DIEnumerator(name: "DPKG_MSG_NONE", value: 0)
!84 = !DIEnumerator(name: "DPKG_MSG_WARN", value: 1)
!85 = !DIEnumerator(name: "DPKG_MSG_ERROR", value: 2)
!86 = !{!87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!88 = !{!89}
!89 = distinct !DIGlobalVariable(name: "msg", scope: !90, file: !91, line: 65, type: !248, isLocal: true, isDefinition: true, variable: [1024 x i8]* @pkg_spec_is_illegal.msg)
!90 = distinct !DISubprogram(name: "pkg_spec_is_illegal", scope: !91, file: !91, line: 63, type: !92, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!91 = !DIFile(filename: "pkg-spec.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !97}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!96 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_spec", file: !15, line: 51, size: 320, align: 64, elements: !99)
!99 = !{!100, !102, !111, !112, !114, !115, !118}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !98, file: !15, line: 52, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !98, file: !15, line: 53, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !4, line: 48, size: 192, align: 64, elements: !106)
!106 = !{!107, !109, !110}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !105, file: !4, line: 49, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !105, file: !4, line: 50, baseType: !94, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !4, line: 51, baseType: !3, size: 32, align: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !98, file: !15, line: 55, baseType: !14, size: 32, align: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name_is_pattern", scope: !98, file: !15, line: 59, baseType: !113, size: 8, align: 8, offset: 160)
!113 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_pattern", scope: !98, file: !15, line: 60, baseType: !113, size: 8, align: 8, offset: 168)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_iter", scope: !98, file: !15, line: 63, baseType: !116, size: 64, align: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_hash_iter", file: !22, line: 314, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_next", scope: !98, file: !15, line: 65, baseType: !119, size: 64, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !22, line: 195, size: 3072, align: 64, elements: !121)
!121 = !{!122, !162, !163, !164, !165, !166, !167, !168, !169, !170, !200, !201, !204, !213, !229, !230, !236, !239, !245, !246}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !120, file: !22, line: 196, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !22, line: 242, size: 3392, align: 64, elements: !125)
!125 = !{!126, !127, !128, !129, !160}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !124, file: !22, line: 243, baseType: !123, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !124, file: !22, line: 244, baseType: !94, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !124, file: !22, line: 245, baseType: !120, size: 3072, align: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !124, file: !22, line: 249, baseType: !130, size: 128, align: 64, offset: 3200)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !124, file: !22, line: 246, size: 128, align: 64, elements: !131)
!131 = !{!132, !159}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !130, file: !22, line: 247, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !22, line: 63, size: 640, align: 64, elements: !135)
!135 = !{!136, !144, !145, !146, !147, !148, !149, !156, !157, !158}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !134, file: !22, line: 64, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !22, line: 56, size: 256, align: 64, elements: !139)
!139 = !{!140, !141, !142, !143}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !138, file: !22, line: 57, baseType: !119, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !138, file: !22, line: 58, baseType: !137, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !138, file: !22, line: 59, baseType: !133, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !22, line: 60, baseType: !21, size: 32, align: 32, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !134, file: !22, line: 65, baseType: !123, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !22, line: 66, baseType: !133, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !134, file: !22, line: 66, baseType: !133, size: 64, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !134, file: !22, line: 66, baseType: !133, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !134, file: !22, line: 67, baseType: !103, size: 64, align: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !134, file: !22, line: 68, baseType: !150, size: 192, align: 64, offset: 384)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !34, line: 42, size: 192, align: 64, elements: !151)
!151 = !{!152, !154, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !150, file: !34, line: 44, baseType: !153, size: 32, align: 32)
!153 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !150, file: !34, line: 46, baseType: !94, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !150, file: !34, line: 48, baseType: !94, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !134, file: !22, line: 69, baseType: !33, size: 32, align: 32, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !134, file: !22, line: 70, baseType: !113, size: 8, align: 8, offset: 608)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !134, file: !22, line: 71, baseType: !113, size: 8, align: 8, offset: 616)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !130, file: !22, line: 248, baseType: !133, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !124, file: !22, line: 250, baseType: !161, size: 32, align: 32, offset: 3328)
!161 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !120, file: !22, line: 197, baseType: !119, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !120, file: !22, line: 199, baseType: !42, size: 32, align: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !120, file: !22, line: 201, baseType: !50, size: 32, align: 32, offset: 160)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !120, file: !22, line: 202, baseType: !54, size: 32, align: 32, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !120, file: !22, line: 203, baseType: !64, size: 32, align: 32, offset: 224)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !120, file: !22, line: 204, baseType: !94, size: 64, align: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !120, file: !22, line: 205, baseType: !94, size: 64, align: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !120, file: !22, line: 206, baseType: !150, size: 192, align: 64, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !120, file: !22, line: 207, baseType: !171, size: 960, align: 64, offset: 576)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !22, line: 107, size: 960, align: 64, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !193}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !171, file: !22, line: 108, baseType: !137, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !171, file: !22, line: 110, baseType: !113, size: 8, align: 8, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !171, file: !22, line: 111, baseType: !74, size: 32, align: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !171, file: !22, line: 112, baseType: !103, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !171, file: !22, line: 115, baseType: !94, size: 64, align: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !171, file: !22, line: 116, baseType: !94, size: 64, align: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !171, file: !22, line: 117, baseType: !94, size: 64, align: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !171, file: !22, line: 118, baseType: !94, size: 64, align: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !171, file: !22, line: 119, baseType: !94, size: 64, align: 64, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !171, file: !22, line: 120, baseType: !94, size: 64, align: 64, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !171, file: !22, line: 121, baseType: !94, size: 64, align: 64, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !171, file: !22, line: 122, baseType: !150, size: 192, align: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !171, file: !22, line: 123, baseType: !186, size: 64, align: 64, offset: 832)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !22, line: 80, size: 256, align: 64, elements: !188)
!188 = !{!189, !190, !191, !192}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !187, file: !22, line: 81, baseType: !186, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !22, line: 82, baseType: !94, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !187, file: !22, line: 83, baseType: !94, size: 64, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !187, file: !22, line: 84, baseType: !113, size: 8, align: 8, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !171, file: !22, line: 124, baseType: !194, size: 64, align: 64, offset: 896)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !22, line: 74, size: 192, align: 64, elements: !196)
!196 = !{!197, !198, !199}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !195, file: !22, line: 75, baseType: !194, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !22, line: 76, baseType: !94, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !195, file: !22, line: 77, baseType: !94, size: 64, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !120, file: !22, line: 208, baseType: !171, size: 960, align: 64, offset: 1536)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !120, file: !22, line: 209, baseType: !202, size: 64, align: 64, offset: 2496)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !22, line: 151, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !120, file: !22, line: 211, baseType: !205, size: 64, align: 64, offset: 2560)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !22, line: 87, size: 320, align: 64, elements: !207)
!207 = !{!208, !209, !210, !211, !212}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !206, file: !22, line: 88, baseType: !205, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !206, file: !22, line: 89, baseType: !94, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !206, file: !22, line: 90, baseType: !94, size: 64, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !206, file: !22, line: 91, baseType: !94, size: 64, align: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !206, file: !22, line: 92, baseType: !94, size: 64, align: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !120, file: !22, line: 216, baseType: !214, size: 128, align: 64, offset: 2624)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !120, file: !22, line: 213, size: 128, align: 64, elements: !215)
!215 = !{!216, !228}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !214, file: !22, line: 215, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !22, line: 142, size: 320, align: 64, elements: !219)
!219 = !{!220, !221, !222, !223}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !218, file: !22, line: 143, baseType: !119, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !218, file: !22, line: 143, baseType: !119, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !218, file: !22, line: 144, baseType: !217, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !218, file: !22, line: 147, baseType: !224, size: 128, align: 64, offset: 192)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !218, file: !22, line: 145, size: 128, align: 64, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !224, file: !22, line: 146, baseType: !217, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !224, file: !22, line: 146, baseType: !217, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !214, file: !22, line: 215, baseType: !217, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !120, file: !22, line: 219, baseType: !217, size: 64, align: 64, offset: 2752)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !120, file: !22, line: 220, baseType: !231, size: 64, align: 64, offset: 2816)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !22, line: 134, size: 128, align: 64, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !22, line: 135, baseType: !231, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !232, file: !22, line: 136, baseType: !94, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !120, file: !22, line: 231, baseType: !237, size: 64, align: 64, offset: 2880)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !22, line: 231, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !120, file: !22, line: 232, baseType: !240, size: 64, align: 64, offset: 2944)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !241, line: 86, baseType: !242)
!241 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !243, line: 131, baseType: !244)
!243 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!244 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !120, file: !22, line: 233, baseType: !113, size: 8, align: 8, offset: 3008)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !120, file: !22, line: 236, baseType: !113, size: 8, align: 8, offset: 3016)
!247 = !{}
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 8192, align: 8, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 1024)
!251 = !{i32 2, !"Dwarf Version", i32 4}
!252 = !{i32 2, !"Debug Info Version", i32 3}
!253 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!254 = distinct !DISubprogram(name: "pkg_spec_init", scope: !91, file: !91, line: 54, type: !255, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !97, !14}
!257 = !DILocalVariable(name: "ps", arg: 1, scope: !254, file: !91, line: 54, type: !97)
!258 = !DIExpression()
!259 = !DILocation(line: 54, column: 32, scope: !254)
!260 = !DILocalVariable(name: "flags", arg: 2, scope: !254, file: !91, line: 54, type: !14)
!261 = !DILocation(line: 54, column: 56, scope: !254)
!262 = !DILocation(line: 56, column: 14, scope: !254)
!263 = !DILocation(line: 56, column: 2, scope: !254)
!264 = !DILocation(line: 56, column: 6, scope: !254)
!265 = !DILocation(line: 56, column: 12, scope: !254)
!266 = !DILocation(line: 58, column: 17, scope: !254)
!267 = !DILocation(line: 58, column: 2, scope: !254)
!268 = !DILocation(line: 59, column: 22, scope: !254)
!269 = !DILocation(line: 59, column: 2, scope: !254)
!270 = !DILocation(line: 60, column: 1, scope: !254)
!271 = distinct !DISubprogram(name: "pkg_spec_blank", scope: !91, file: !91, line: 37, type: !272, isLocal: true, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !97}
!274 = !DILocalVariable(name: "ps", arg: 1, scope: !271, file: !91, line: 37, type: !97)
!275 = !DILocation(line: 37, column: 33, scope: !271)
!276 = !DILocation(line: 39, column: 2, scope: !271)
!277 = !DILocation(line: 39, column: 6, scope: !271)
!278 = !DILocation(line: 39, column: 11, scope: !271)
!279 = !DILocation(line: 40, column: 2, scope: !271)
!280 = !DILocation(line: 40, column: 6, scope: !271)
!281 = !DILocation(line: 40, column: 11, scope: !271)
!282 = !DILocation(line: 42, column: 2, scope: !271)
!283 = !DILocation(line: 42, column: 6, scope: !271)
!284 = !DILocation(line: 42, column: 22, scope: !271)
!285 = !DILocation(line: 43, column: 2, scope: !271)
!286 = !DILocation(line: 43, column: 6, scope: !271)
!287 = !DILocation(line: 43, column: 22, scope: !271)
!288 = !DILocation(line: 44, column: 1, scope: !271)
!289 = distinct !DISubprogram(name: "pkg_spec_iter_blank", scope: !91, file: !91, line: 47, type: !272, isLocal: true, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!290 = !DILocalVariable(name: "ps", arg: 1, scope: !289, file: !91, line: 47, type: !97)
!291 = !DILocation(line: 47, column: 38, scope: !289)
!292 = !DILocation(line: 49, column: 2, scope: !289)
!293 = !DILocation(line: 49, column: 6, scope: !289)
!294 = !DILocation(line: 49, column: 15, scope: !289)
!295 = !DILocation(line: 50, column: 2, scope: !289)
!296 = !DILocation(line: 50, column: 6, scope: !289)
!297 = !DILocation(line: 50, column: 15, scope: !289)
!298 = !DILocation(line: 51, column: 1, scope: !289)
!299 = !DILocalVariable(name: "ps", arg: 1, scope: !90, file: !91, line: 63, type: !97)
!300 = !DILocation(line: 63, column: 38, scope: !90)
!301 = !DILocalVariable(name: "emsg", scope: !90, file: !91, line: 66, type: !94)
!302 = !DILocation(line: 66, column: 14, scope: !90)
!303 = !DILocation(line: 68, column: 7, scope: !304)
!304 = distinct !DILexicalBlock(scope: !90, file: !91, line: 68, column: 6)
!305 = !DILocation(line: 68, column: 11, scope: !304)
!306 = !DILocation(line: 68, column: 27, scope: !304)
!307 = !DILocation(line: 69, column: 34, scope: !304)
!308 = !DILocation(line: 69, column: 38, scope: !304)
!309 = !DILocation(line: 69, column: 14, scope: !304)
!310 = !DILocation(line: 69, column: 12, scope: !304)
!311 = !DILocation(line: 68, column: 6, scope: !312)
!312 = !DILexicalBlockFile(scope: !90, file: !91, discriminator: 1)
!313 = !DILocalVariable(name: "arch_sep", scope: !314, file: !91, line: 70, type: !94)
!314 = distinct !DILexicalBlock(scope: !304, file: !91, line: 69, column: 46)
!315 = !DILocation(line: 70, column: 15, scope: !314)
!316 = !DILocation(line: 75, column: 7, scope: !317)
!317 = distinct !DILexicalBlock(scope: !314, file: !91, line: 75, column: 7)
!318 = !DILocation(line: 75, column: 11, scope: !317)
!319 = !DILocation(line: 75, column: 17, scope: !317)
!320 = !DILocation(line: 75, column: 22, scope: !317)
!321 = !DILocation(line: 75, column: 7, scope: !314)
!322 = !DILocation(line: 76, column: 13, scope: !317)
!323 = !DILocation(line: 76, column: 4, scope: !317)
!324 = !DILocation(line: 78, column: 13, scope: !317)
!325 = !DILocation(line: 81, column: 11, scope: !314)
!326 = !DILocation(line: 82, column: 12, scope: !314)
!327 = !DILocation(line: 82, column: 16, scope: !314)
!328 = !DILocation(line: 82, column: 22, scope: !314)
!329 = !DILocation(line: 82, column: 32, scope: !314)
!330 = !DILocation(line: 82, column: 36, scope: !314)
!331 = !DILocation(line: 82, column: 42, scope: !314)
!332 = !DILocation(line: 82, column: 48, scope: !314)
!333 = !DILocation(line: 80, column: 3, scope: !314)
!334 = !DILocation(line: 83, column: 3, scope: !314)
!335 = !DILocation(line: 86, column: 8, scope: !336)
!336 = distinct !DILexicalBlock(scope: !90, file: !91, line: 86, column: 6)
!337 = !DILocation(line: 86, column: 12, scope: !336)
!338 = !DILocation(line: 86, column: 28, scope: !336)
!339 = !DILocation(line: 86, column: 31, scope: !340)
!340 = !DILexicalBlockFile(scope: !336, file: !91, discriminator: 1)
!341 = !DILocation(line: 86, column: 35, scope: !340)
!342 = !DILocation(line: 86, column: 41, scope: !340)
!343 = !DILocation(line: 86, column: 46, scope: !340)
!344 = !DILocation(line: 86, column: 68, scope: !340)
!345 = !DILocation(line: 87, column: 6, scope: !336)
!346 = !DILocation(line: 87, column: 10, scope: !336)
!347 = !DILocation(line: 87, column: 16, scope: !336)
!348 = !DILocation(line: 87, column: 21, scope: !336)
!349 = !DILocation(line: 86, column: 6, scope: !350)
!350 = !DILexicalBlockFile(scope: !90, file: !91, discriminator: 2)
!351 = !DILocation(line: 88, column: 36, scope: !352)
!352 = distinct !DILexicalBlock(scope: !336, file: !91, line: 87, column: 41)
!353 = !DILocation(line: 88, column: 40, scope: !352)
!354 = !DILocation(line: 88, column: 46, scope: !352)
!355 = !DILocation(line: 88, column: 10, scope: !352)
!356 = !DILocation(line: 88, column: 8, scope: !352)
!357 = !DILocation(line: 90, column: 11, scope: !352)
!358 = !DILocation(line: 91, column: 12, scope: !352)
!359 = !DILocation(line: 91, column: 16, scope: !352)
!360 = !DILocation(line: 91, column: 22, scope: !352)
!361 = !DILocation(line: 91, column: 26, scope: !352)
!362 = !DILocation(line: 91, column: 32, scope: !352)
!363 = !DILocation(line: 91, column: 38, scope: !352)
!364 = !DILocation(line: 89, column: 3, scope: !352)
!365 = !DILocation(line: 92, column: 3, scope: !352)
!366 = !DILocation(line: 97, column: 7, scope: !367)
!367 = distinct !DILexicalBlock(scope: !90, file: !91, line: 97, column: 6)
!368 = !DILocation(line: 97, column: 11, scope: !367)
!369 = !DILocation(line: 97, column: 27, scope: !367)
!370 = !DILocation(line: 97, column: 30, scope: !371)
!371 = !DILexicalBlockFile(scope: !367, file: !91, discriminator: 1)
!372 = !DILocation(line: 97, column: 34, scope: !371)
!373 = !DILocation(line: 97, column: 40, scope: !371)
!374 = !DILocation(line: 97, column: 6, scope: !371)
!375 = !DILocalVariable(name: "set", scope: !376, file: !91, line: 98, type: !123)
!376 = distinct !DILexicalBlock(scope: !367, file: !91, line: 97, column: 64)
!377 = !DILocation(line: 98, column: 18, scope: !376)
!378 = !DILocation(line: 100, column: 27, scope: !376)
!379 = !DILocation(line: 100, column: 31, scope: !376)
!380 = !DILocation(line: 100, column: 9, scope: !376)
!381 = !DILocation(line: 100, column: 7, scope: !376)
!382 = !DILocation(line: 103, column: 7, scope: !383)
!383 = distinct !DILexicalBlock(scope: !376, file: !91, line: 103, column: 7)
!384 = !DILocation(line: 103, column: 11, scope: !383)
!385 = !DILocation(line: 103, column: 17, scope: !383)
!386 = !DILocation(line: 103, column: 22, scope: !383)
!387 = !DILocation(line: 103, column: 40, scope: !383)
!388 = !DILocation(line: 104, column: 34, scope: !383)
!389 = !DILocation(line: 104, column: 7, scope: !383)
!390 = !DILocation(line: 104, column: 39, scope: !383)
!391 = !DILocation(line: 103, column: 7, scope: !392)
!392 = !DILexicalBlockFile(scope: !376, file: !91, discriminator: 1)
!393 = !DILocation(line: 106, column: 12, scope: !394)
!394 = distinct !DILexicalBlock(scope: !383, file: !91, line: 104, column: 44)
!395 = !DILocation(line: 107, column: 46, scope: !394)
!396 = !DILocation(line: 107, column: 50, scope: !394)
!397 = !DILocation(line: 105, column: 4, scope: !394)
!398 = !DILocation(line: 108, column: 4, scope: !394)
!399 = !DILocation(line: 110, column: 2, scope: !376)
!400 = !DILocation(line: 112, column: 2, scope: !90)
!401 = !DILocation(line: 113, column: 1, scope: !90)
!402 = distinct !DISubprogram(name: "pkg_spec_set", scope: !91, file: !91, line: 135, type: !403, isLocal: false, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!403 = !DISubroutineType(types: !404)
!404 = !{!94, !97, !94, !94}
!405 = !DILocalVariable(name: "ps", arg: 1, scope: !402, file: !91, line: 135, type: !97)
!406 = !DILocation(line: 135, column: 31, scope: !402)
!407 = !DILocalVariable(name: "pkgname", arg: 2, scope: !402, file: !91, line: 135, type: !94)
!408 = !DILocation(line: 135, column: 47, scope: !402)
!409 = !DILocalVariable(name: "archname", arg: 3, scope: !402, file: !91, line: 135, type: !94)
!410 = !DILocation(line: 135, column: 68, scope: !402)
!411 = !DILocation(line: 137, column: 23, scope: !402)
!412 = !DILocation(line: 137, column: 36, scope: !402)
!413 = !DILocation(line: 137, column: 27, scope: !402)
!414 = !DILocation(line: 137, column: 46, scope: !402)
!415 = !DILocation(line: 137, column: 9, scope: !416)
!416 = !DILexicalBlockFile(scope: !402, file: !91, discriminator: 1)
!417 = !DILocation(line: 137, column: 2, scope: !402)
!418 = distinct !DISubprogram(name: "pkg_spec_prep", scope: !91, file: !91, line: 116, type: !419, isLocal: true, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!419 = !DISubroutineType(types: !420)
!420 = !{!94, !97, !101, !94}
!421 = !DILocalVariable(name: "ps", arg: 1, scope: !418, file: !91, line: 116, type: !97)
!422 = !DILocation(line: 116, column: 32, scope: !418)
!423 = !DILocalVariable(name: "pkgname", arg: 2, scope: !418, file: !91, line: 116, type: !101)
!424 = !DILocation(line: 116, column: 42, scope: !418)
!425 = !DILocalVariable(name: "archname", arg: 3, scope: !418, file: !91, line: 116, type: !94)
!426 = !DILocation(line: 116, column: 63, scope: !418)
!427 = !DILocation(line: 118, column: 13, scope: !418)
!428 = !DILocation(line: 118, column: 2, scope: !418)
!429 = !DILocation(line: 118, column: 6, scope: !418)
!430 = !DILocation(line: 118, column: 11, scope: !418)
!431 = !DILocation(line: 119, column: 28, scope: !418)
!432 = !DILocation(line: 119, column: 13, scope: !418)
!433 = !DILocation(line: 119, column: 2, scope: !418)
!434 = !DILocation(line: 119, column: 6, scope: !418)
!435 = !DILocation(line: 119, column: 11, scope: !418)
!436 = !DILocation(line: 121, column: 2, scope: !418)
!437 = !DILocation(line: 121, column: 6, scope: !418)
!438 = !DILocation(line: 121, column: 22, scope: !418)
!439 = !DILocation(line: 122, column: 2, scope: !418)
!440 = !DILocation(line: 122, column: 6, scope: !418)
!441 = !DILocation(line: 122, column: 22, scope: !418)
!442 = !DILocation(line: 125, column: 7, scope: !443)
!443 = distinct !DILexicalBlock(scope: !418, file: !91, line: 125, column: 6)
!444 = !DILocation(line: 125, column: 11, scope: !443)
!445 = !DILocation(line: 125, column: 17, scope: !443)
!446 = !DILocation(line: 125, column: 38, scope: !443)
!447 = !DILocation(line: 125, column: 49, scope: !448)
!448 = !DILexicalBlockFile(scope: !443, file: !91, discriminator: 1)
!449 = !DILocation(line: 125, column: 53, scope: !448)
!450 = !DILocation(line: 125, column: 41, scope: !448)
!451 = !DILocation(line: 125, column: 6, scope: !448)
!452 = !DILocation(line: 126, column: 3, scope: !443)
!453 = !DILocation(line: 126, column: 7, scope: !443)
!454 = !DILocation(line: 126, column: 23, scope: !443)
!455 = !DILocation(line: 128, column: 7, scope: !456)
!456 = distinct !DILexicalBlock(scope: !418, file: !91, line: 128, column: 6)
!457 = !DILocation(line: 128, column: 11, scope: !456)
!458 = !DILocation(line: 128, column: 17, scope: !456)
!459 = !DILocation(line: 128, column: 38, scope: !456)
!460 = !DILocation(line: 128, column: 49, scope: !461)
!461 = !DILexicalBlockFile(scope: !456, file: !91, discriminator: 1)
!462 = !DILocation(line: 128, column: 53, scope: !461)
!463 = !DILocation(line: 128, column: 59, scope: !461)
!464 = !DILocation(line: 128, column: 41, scope: !461)
!465 = !DILocation(line: 128, column: 6, scope: !461)
!466 = !DILocation(line: 129, column: 3, scope: !456)
!467 = !DILocation(line: 129, column: 7, scope: !456)
!468 = !DILocation(line: 129, column: 23, scope: !456)
!469 = !DILocation(line: 131, column: 29, scope: !418)
!470 = !DILocation(line: 131, column: 9, scope: !418)
!471 = !DILocation(line: 131, column: 2, scope: !418)
!472 = distinct !DISubprogram(name: "pkg_spec_parse", scope: !91, file: !91, line: 141, type: !473, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!473 = !DISubroutineType(types: !474)
!474 = !{!94, !97, !94}
!475 = !DILocalVariable(name: "ps", arg: 1, scope: !472, file: !91, line: 141, type: !97)
!476 = !DILocation(line: 141, column: 33, scope: !472)
!477 = !DILocalVariable(name: "str", arg: 2, scope: !472, file: !91, line: 141, type: !94)
!478 = !DILocation(line: 141, column: 49, scope: !472)
!479 = !DILocalVariable(name: "pkgname", scope: !472, file: !91, line: 143, type: !101)
!480 = !DILocation(line: 143, column: 8, scope: !472)
!481 = !DILocalVariable(name: "archname", scope: !472, file: !91, line: 143, type: !101)
!482 = !DILocation(line: 143, column: 18, scope: !472)
!483 = !DILocation(line: 145, column: 20, scope: !472)
!484 = !DILocation(line: 145, column: 13, scope: !472)
!485 = !DILocation(line: 145, column: 11, scope: !472)
!486 = !DILocation(line: 146, column: 6, scope: !487)
!487 = distinct !DILexicalBlock(scope: !472, file: !91, line: 146, column: 6)
!488 = !DILocation(line: 146, column: 15, scope: !487)
!489 = !DILocation(line: 146, column: 6, scope: !472)
!490 = !DILocation(line: 147, column: 22, scope: !491)
!491 = distinct !DILexicalBlock(scope: !487, file: !91, line: 146, column: 23)
!492 = !DILocation(line: 147, column: 13, scope: !491)
!493 = !DILocation(line: 147, column: 11, scope: !491)
!494 = !DILocation(line: 148, column: 2, scope: !491)
!495 = !DILocation(line: 149, column: 23, scope: !496)
!496 = distinct !DILexicalBlock(scope: !487, file: !91, line: 148, column: 9)
!497 = !DILocation(line: 149, column: 28, scope: !496)
!498 = !DILocation(line: 149, column: 39, scope: !496)
!499 = !DILocation(line: 149, column: 37, scope: !496)
!500 = !DILocation(line: 149, column: 13, scope: !496)
!501 = !DILocation(line: 149, column: 11, scope: !496)
!502 = !DILocation(line: 150, column: 11, scope: !496)
!503 = !DILocation(line: 153, column: 23, scope: !472)
!504 = !DILocation(line: 153, column: 27, scope: !472)
!505 = !DILocation(line: 153, column: 36, scope: !472)
!506 = !DILocation(line: 153, column: 9, scope: !472)
!507 = !DILocation(line: 153, column: 2, scope: !472)
!508 = distinct !DISubprogram(name: "pkg_spec_match_pkg", scope: !91, file: !91, line: 187, type: !509, isLocal: false, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!509 = !DISubroutineType(types: !510)
!510 = !{!113, !97, !119, !511}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!512 = !DILocalVariable(name: "ps", arg: 1, scope: !508, file: !91, line: 187, type: !97)
!513 = !DILocation(line: 187, column: 37, scope: !508)
!514 = !DILocalVariable(name: "pkg", arg: 2, scope: !508, file: !91, line: 187, type: !119)
!515 = !DILocation(line: 187, column: 57, scope: !508)
!516 = !DILocalVariable(name: "pkgbin", arg: 3, scope: !508, file: !91, line: 188, type: !511)
!517 = !DILocation(line: 188, column: 35, scope: !508)
!518 = !DILocation(line: 190, column: 30, scope: !508)
!519 = !DILocation(line: 190, column: 34, scope: !508)
!520 = !DILocation(line: 190, column: 39, scope: !508)
!521 = !DILocation(line: 190, column: 44, scope: !508)
!522 = !DILocation(line: 190, column: 10, scope: !508)
!523 = !DILocation(line: 190, column: 50, scope: !508)
!524 = !DILocation(line: 191, column: 30, scope: !508)
!525 = !DILocation(line: 191, column: 34, scope: !508)
!526 = !DILocation(line: 191, column: 39, scope: !508)
!527 = !DILocation(line: 191, column: 47, scope: !508)
!528 = !DILocation(line: 191, column: 10, scope: !508)
!529 = !DILocation(line: 190, column: 2, scope: !530)
!530 = !DILexicalBlockFile(scope: !508, file: !91, discriminator: 1)
!531 = distinct !DISubprogram(name: "pkg_spec_match_name", scope: !91, file: !91, line: 157, type: !532, isLocal: true, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!532 = !DISubroutineType(types: !533)
!533 = !{!113, !97, !94}
!534 = !DILocalVariable(name: "ps", arg: 1, scope: !531, file: !91, line: 157, type: !97)
!535 = !DILocation(line: 157, column: 38, scope: !531)
!536 = !DILocalVariable(name: "name", arg: 2, scope: !531, file: !91, line: 157, type: !94)
!537 = !DILocation(line: 157, column: 54, scope: !531)
!538 = !DILocation(line: 159, column: 6, scope: !539)
!539 = distinct !DILexicalBlock(scope: !531, file: !91, line: 159, column: 6)
!540 = !DILocation(line: 159, column: 10, scope: !539)
!541 = !DILocation(line: 159, column: 6, scope: !531)
!542 = !DILocation(line: 160, column: 19, scope: !539)
!543 = !DILocation(line: 160, column: 23, scope: !539)
!544 = !DILocation(line: 160, column: 29, scope: !539)
!545 = !DILocation(line: 160, column: 11, scope: !539)
!546 = !DILocation(line: 160, column: 38, scope: !539)
!547 = !DILocation(line: 160, column: 3, scope: !539)
!548 = !DILocation(line: 162, column: 18, scope: !539)
!549 = !DILocation(line: 162, column: 22, scope: !539)
!550 = !DILocation(line: 162, column: 28, scope: !539)
!551 = !DILocation(line: 162, column: 11, scope: !539)
!552 = !DILocation(line: 162, column: 34, scope: !539)
!553 = !DILocation(line: 162, column: 3, scope: !539)
!554 = !DILocation(line: 163, column: 1, scope: !531)
!555 = distinct !DISubprogram(name: "pkg_spec_match_arch", scope: !91, file: !91, line: 166, type: !556, isLocal: true, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!556 = !DISubroutineType(types: !557)
!557 = !{!113, !97, !119, !103}
!558 = !DILocalVariable(name: "ps", arg: 1, scope: !555, file: !91, line: 166, type: !97)
!559 = !DILocation(line: 166, column: 38, scope: !555)
!560 = !DILocalVariable(name: "pkg", arg: 2, scope: !555, file: !91, line: 166, type: !119)
!561 = !DILocation(line: 166, column: 58, scope: !555)
!562 = !DILocalVariable(name: "arch", arg: 3, scope: !555, file: !91, line: 167, type: !103)
!563 = !DILocation(line: 167, column: 45, scope: !555)
!564 = !DILocation(line: 169, column: 6, scope: !565)
!565 = distinct !DILexicalBlock(scope: !555, file: !91, line: 169, column: 6)
!566 = !DILocation(line: 169, column: 10, scope: !565)
!567 = !DILocation(line: 169, column: 6, scope: !555)
!568 = !DILocation(line: 170, column: 19, scope: !565)
!569 = !DILocation(line: 170, column: 23, scope: !565)
!570 = !DILocation(line: 170, column: 29, scope: !565)
!571 = !DILocation(line: 170, column: 35, scope: !565)
!572 = !DILocation(line: 170, column: 41, scope: !565)
!573 = !DILocation(line: 170, column: 11, scope: !565)
!574 = !DILocation(line: 170, column: 50, scope: !565)
!575 = !DILocation(line: 170, column: 3, scope: !565)
!576 = !DILocation(line: 171, column: 11, scope: !577)
!577 = distinct !DILexicalBlock(scope: !565, file: !91, line: 171, column: 11)
!578 = !DILocation(line: 171, column: 15, scope: !577)
!579 = !DILocation(line: 171, column: 21, scope: !577)
!580 = !DILocation(line: 171, column: 26, scope: !577)
!581 = !DILocation(line: 171, column: 11, scope: !565)
!582 = !DILocation(line: 172, column: 11, scope: !577)
!583 = !DILocation(line: 172, column: 15, scope: !577)
!584 = !DILocation(line: 172, column: 23, scope: !577)
!585 = !DILocation(line: 172, column: 20, scope: !577)
!586 = !DILocation(line: 172, column: 3, scope: !577)
!587 = !DILocation(line: 175, column: 10, scope: !555)
!588 = !DILocation(line: 175, column: 14, scope: !555)
!589 = !DILocation(line: 175, column: 20, scope: !555)
!590 = !DILocation(line: 175, column: 2, scope: !555)
!591 = !DILocation(line: 177, column: 37, scope: !592)
!592 = distinct !DILexicalBlock(scope: !555, file: !91, line: 175, column: 42)
!593 = !DILocation(line: 177, column: 42, scope: !592)
!594 = !DILocation(line: 177, column: 10, scope: !592)
!595 = !DILocation(line: 177, column: 47, scope: !592)
!596 = !DILocation(line: 177, column: 3, scope: !592)
!597 = !DILocation(line: 179, column: 3, scope: !592)
!598 = !DILocation(line: 181, column: 63, scope: !592)
!599 = !DILocation(line: 181, column: 67, scope: !592)
!600 = !DILocation(line: 181, column: 73, scope: !592)
!601 = !DILocation(line: 181, column: 3, scope: !592)
!602 = !DILocation(line: 184, column: 1, scope: !555)
!603 = distinct !DISubprogram(name: "pkg_spec_parse_pkg", scope: !91, file: !91, line: 204, type: !604, isLocal: false, isDefinition: true, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!604 = !DISubroutineType(types: !605)
!605 = !{!119, !94, !606}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64, align: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_error", file: !81, line: 42, size: 128, align: 64, elements: !608)
!608 = !{!609, !610, !611}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !607, file: !81, line: 43, baseType: !80, size: 32, align: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "syserrno", scope: !607, file: !81, line: 45, baseType: !161, size: 32, align: 32, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !607, file: !81, line: 46, baseType: !101, size: 64, align: 64, offset: 64)
!612 = !DILocalVariable(name: "str", arg: 1, scope: !603, file: !91, line: 204, type: !94)
!613 = !DILocation(line: 204, column: 32, scope: !603)
!614 = !DILocalVariable(name: "err", arg: 2, scope: !603, file: !91, line: 204, type: !606)
!615 = !DILocation(line: 204, column: 56, scope: !603)
!616 = !DILocalVariable(name: "ps", scope: !603, file: !91, line: 206, type: !98)
!617 = !DILocation(line: 206, column: 18, scope: !603)
!618 = !DILocalVariable(name: "pkg", scope: !603, file: !91, line: 207, type: !119)
!619 = !DILocation(line: 207, column: 18, scope: !603)
!620 = !DILocalVariable(name: "emsg", scope: !603, file: !91, line: 208, type: !94)
!621 = !DILocation(line: 208, column: 14, scope: !603)
!622 = !DILocation(line: 210, column: 2, scope: !603)
!623 = !DILocation(line: 211, column: 29, scope: !603)
!624 = !DILocation(line: 211, column: 9, scope: !603)
!625 = !DILocation(line: 211, column: 7, scope: !603)
!626 = !DILocation(line: 212, column: 6, scope: !627)
!627 = distinct !DILexicalBlock(scope: !603, file: !91, line: 212, column: 6)
!628 = !DILocation(line: 212, column: 6, scope: !603)
!629 = !DILocation(line: 213, column: 18, scope: !630)
!630 = distinct !DILexicalBlock(scope: !627, file: !91, line: 212, column: 12)
!631 = !DILocation(line: 213, column: 29, scope: !630)
!632 = !DILocation(line: 213, column: 3, scope: !630)
!633 = !DILocation(line: 214, column: 7, scope: !630)
!634 = !DILocation(line: 215, column: 2, scope: !630)
!635 = !DILocation(line: 216, column: 9, scope: !636)
!636 = distinct !DILexicalBlock(scope: !627, file: !91, line: 215, column: 9)
!637 = !DILocation(line: 216, column: 7, scope: !636)
!638 = !DILocation(line: 218, column: 2, scope: !603)
!639 = !DILocation(line: 220, column: 9, scope: !603)
!640 = !DILocation(line: 220, column: 2, scope: !603)
!641 = distinct !DISubprogram(name: "pkg_spec_get_pkg", scope: !91, file: !91, line: 195, type: !642, isLocal: true, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!642 = !DISubroutineType(types: !643)
!643 = !{!119, !97}
!644 = !DILocalVariable(name: "ps", arg: 1, scope: !641, file: !91, line: 195, type: !97)
!645 = !DILocation(line: 195, column: 35, scope: !641)
!646 = !DILocation(line: 197, column: 6, scope: !647)
!647 = distinct !DILexicalBlock(scope: !641, file: !91, line: 197, column: 6)
!648 = !DILocation(line: 197, column: 10, scope: !647)
!649 = !DILocation(line: 197, column: 16, scope: !647)
!650 = !DILocation(line: 197, column: 21, scope: !647)
!651 = !DILocation(line: 197, column: 6, scope: !641)
!652 = !DILocation(line: 198, column: 34, scope: !647)
!653 = !DILocation(line: 198, column: 38, scope: !647)
!654 = !DILocation(line: 198, column: 10, scope: !647)
!655 = !DILocation(line: 198, column: 3, scope: !647)
!656 = !DILocation(line: 200, column: 28, scope: !647)
!657 = !DILocation(line: 200, column: 32, scope: !647)
!658 = !DILocation(line: 200, column: 38, scope: !647)
!659 = !DILocation(line: 200, column: 42, scope: !647)
!660 = !DILocation(line: 200, column: 10, scope: !647)
!661 = !DILocation(line: 200, column: 3, scope: !647)
!662 = !DILocation(line: 201, column: 1, scope: !641)
!663 = distinct !DISubprogram(name: "pkg_spec_destroy", scope: !91, file: !91, line: 298, type: !272, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!664 = !DILocalVariable(name: "ps", arg: 1, scope: !663, file: !91, line: 298, type: !97)
!665 = !DILocation(line: 298, column: 35, scope: !663)
!666 = !DILocation(line: 300, column: 7, scope: !663)
!667 = !DILocation(line: 300, column: 11, scope: !663)
!668 = !DILocation(line: 300, column: 2, scope: !663)
!669 = !DILocation(line: 301, column: 17, scope: !663)
!670 = !DILocation(line: 301, column: 2, scope: !663)
!671 = !DILocation(line: 302, column: 24, scope: !663)
