; ModuleID = './[inter]lib--dpkg--dbmodify.o.i'
source_filename = "./[inter]lib--dpkg--dbmodify.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.fni = type { i8*, i8** }
%struct.varbuf = type { i64, i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.2, i32 }
%struct.anon.2 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }

!104 = !DIEnumerator(name: "PKG_PRIO_OPTIONAL", value: 3)
!105 = !DIEnumerator(name: "PKG_PRIO_EXTRA", value: 4)
!106 = !DIEnumerator(name: "PKG_PRIO_OTHER", value: 5)
!107 = !DIEnumerator(name: "PKG_PRIO_UNKNOWN", value: 6)
!108 = !DIEnumerator(name: "PKG_PRIO_UNSET", value: -1)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgmultiarch", file: !15, line: 95, size: 32, align: 32, elements: !110)
!110 = !{!111, !112, !113, !114}
!111 = !DIEnumerator(name: "PKG_MULTIARCH_NO", value: 0)
!112 = !DIEnumerator(name: "PKG_MULTIARCH_SAME", value: 1)
!113 = !DIEnumerator(name: "PKG_MULTIARCH_ALLOWED", value: 2)
!114 = !DIEnumerator(name: "PKG_MULTIARCH_FOREIGN", value: 3)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "trig_options", file: !116, line: 49, size: 32, align: 32, elements: !117)
!116 = !DIFile(filename: "../../lib/dpkg/triglib.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!117 = !{!118, !119}
!118 = !DIEnumerator(name: "TRIG_AWAIT", value: 0)
!119 = !DIEnumerator(name: "TRIG_NOAWAIT", value: 1)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fsys_namenode_flags", file: !121, line: 61, size: 32, align: 32, elements: !122)
!121 = !DIFile(filename: "../../lib/dpkg/fsys.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132}
!123 = !DIEnumerator(name: "FNNF_NEW_CONFF", value: 1)
!124 = !DIEnumerator(name: "FNNF_NEW_INARCHIVE", value: 2)
!125 = !DIEnumerator(name: "FNNF_OLD_CONFF", value: 4)
!126 = !DIEnumerator(name: "FNNF_OBS_CONFF", value: 8)
!127 = !DIEnumerator(name: "FNNF_ELIDE_OTHER_LISTS", value: 16)
!128 = !DIEnumerator(name: "FNNF_NO_ATOMIC_OVERWRITE", value: 32)
!129 = !DIEnumerator(name: "FNNF_PLACED_ON_DISK", value: 64)
!130 = !DIEnumerator(name: "FNNF_DEFERRED_FSYNC", value: 128)
!131 = !DIEnumerator(name: "FNNF_DEFERRED_RENAME", value: 256)
!132 = !DIEnumerator(name: "FNNF_FILTERED", value: 512)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_name_arch_when", file: !15, line: 396, size: 32, align: 32, elements: !134)
!134 = !{!135, !136, !137, !138}
!135 = !DIEnumerator(name: "pnaw_never", value: 0)
!136 = !DIEnumerator(name: "pnaw_nonambig", value: 1)
!137 = !DIEnumerator(name: "pnaw_foreign", value: 2)
!138 = !DIEnumerator(name: "pnaw_always", value: 3)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "versiondisplayepochwhen", file: !15, line: 388, size: 32, align: 32, elements: !140)
!140 = !{!141, !142, !143}
!141 = !DIEnumerator(name: "vdew_never", value: 0)
!142 = !DIEnumerator(name: "vdew_nonambig", value: 1)
!143 = !DIEnumerator(name: "vdew_always", value: 2)
!144 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_ctype_bit", file: !145, line: 32, size: 32, align: 32, elements: !146)
!145 = !DIFile(filename: "../../lib/dpkg/c-ctype.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154}
!147 = !DIEnumerator(name: "C_CTYPE_BLANK", value: 1)
!148 = !DIEnumerator(name: "C_CTYPE_WHITE", value: 2)
!149 = !DIEnumerator(name: "C_CTYPE_SPACE", value: 4)
!150 = !DIEnumerator(name: "C_CTYPE_UPPER", value: 8)
!151 = !DIEnumerator(name: "C_CTYPE_LOWER", value: 16)
!152 = !DIEnumerator(name: "C_CTYPE_DIGIT", value: 32)
!153 = !DIEnumerator(name: "C_CTYPE_ALPHA", value: 24)
!154 = !DIEnumerator(name: "C_CTYPE_ALNUM", value: 56)
!155 = !{!156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!157 = !{!158, !161, !164, !165, !166, !167, !228, !229, !230, !231, !232, !239, !251, !252, !253, !254, !255, !256}
!158 = distinct !DIGlobalVariable(name: "db_initialized", scope: !0, file: !159, line: 49, type: !160, isLocal: true, isDefinition: true, variable: i8* @db_initialized)
!159 = !DIFile(filename: "dbmodify.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!160 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!161 = distinct !DIGlobalVariable(name: "lockfile", scope: !0, file: !159, line: 52, type: !162, isLocal: true, isDefinition: true, variable: i8** @lockfile)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!164 = distinct !DIGlobalVariable(name: "frontendlockfile", scope: !0, file: !159, line: 53, type: !162, isLocal: true, isDefinition: true, variable: i8** @frontendlockfile)
!165 = distinct !DIGlobalVariable(name: "statusfile", scope: !0, file: !159, line: 54, type: !162, isLocal: true, isDefinition: true, variable: i8** @statusfile)
!166 = distinct !DIGlobalVariable(name: "availablefile", scope: !0, file: !159, line: 54, type: !162, isLocal: true, isDefinition: true, variable: i8** @availablefile)
!167 = distinct !DIGlobalVariable(name: "importanttmp", scope: !0, file: !159, line: 56, type: !168, isLocal: true, isDefinition: true, variable: %struct._IO_FILE** @importanttmp)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !170, line: 48, baseType: !171)
!170 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !172, line: 241, size: 1728, align: 64, elements: !173)
!172 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!173 = !{!174, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !195, !196, !197, !198, !202, !204, !206, !210, !213, !215, !216, !217, !218, !219, !223, !224}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !171, file: !172, line: 242, baseType: !175, size: 32, align: 32)
!175 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !171, file: !172, line: 247, baseType: !162, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !171, file: !172, line: 248, baseType: !162, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !171, file: !172, line: 249, baseType: !162, size: 64, align: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !171, file: !172, line: 250, baseType: !162, size: 64, align: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !171, file: !172, line: 251, baseType: !162, size: 64, align: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !171, file: !172, line: 252, baseType: !162, size: 64, align: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !171, file: !172, line: 253, baseType: !162, size: 64, align: 64, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !171, file: !172, line: 254, baseType: !162, size: 64, align: 64, offset: 512)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !171, file: !172, line: 256, baseType: !162, size: 64, align: 64, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !171, file: !172, line: 257, baseType: !162, size: 64, align: 64, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !171, file: !172, line: 258, baseType: !162, size: 64, align: 64, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !171, file: !172, line: 260, baseType: !188, size: 64, align: 64, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !172, line: 156, size: 192, align: 64, elements: !190)
!190 = !{!191, !192, !194}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !189, file: !172, line: 157, baseType: !188, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !189, file: !172, line: 158, baseType: !193, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !189, file: !172, line: 162, baseType: !175, size: 32, align: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !171, file: !172, line: 262, baseType: !193, size: 64, align: 64, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !171, file: !172, line: 264, baseType: !175, size: 32, align: 32, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !171, file: !172, line: 268, baseType: !175, size: 32, align: 32, offset: 928)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !171, file: !172, line: 270, baseType: !199, size: 64, align: 64, offset: 960)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !200, line: 131, baseType: !201)
!200 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!201 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !171, file: !172, line: 274, baseType: !203, size: 16, align: 16, offset: 1024)
!203 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !171, file: !172, line: 275, baseType: !205, size: 8, align: 8, offset: 1040)
!205 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !171, file: !172, line: 276, baseType: !207, size: 8, align: 8, offset: 1048)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 8, align: 8, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 1)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !171, file: !172, line: 280, baseType: !211, size: 64, align: 64, offset: 1088)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !172, line: 150, baseType: null)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !171, file: !172, line: 289, baseType: !214, size: 64, align: 64, offset: 1152)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !200, line: 132, baseType: !201)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !171, file: !172, line: 297, baseType: !156, size: 64, align: 64, offset: 1216)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !171, file: !172, line: 298, baseType: !156, size: 64, align: 64, offset: 1280)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !171, file: !172, line: 299, baseType: !156, size: 64, align: 64, offset: 1344)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !171, file: !172, line: 300, baseType: !156, size: 64, align: 64, offset: 1408)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !171, file: !172, line: 302, baseType: !220, size: 64, align: 64, offset: 1472)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !221, line: 216, baseType: !222)
!221 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!222 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !171, file: !172, line: 303, baseType: !175, size: 32, align: 32, offset: 1536)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !171, file: !172, line: 305, baseType: !225, size: 160, align: 8, offset: 1568)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 160, align: 8, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 20)
!228 = distinct !DIGlobalVariable(name: "nextupdate", scope: !0, file: !159, line: 57, type: !175, isLocal: true, isDefinition: true, variable: i32* @nextupdate)
!229 = distinct !DIGlobalVariable(name: "updatesdir", scope: !0, file: !159, line: 58, type: !162, isLocal: true, isDefinition: true, variable: i8** @updatesdir)
!230 = distinct !DIGlobalVariable(name: "updatefnbuf", scope: !0, file: !159, line: 60, type: !162, isLocal: true, isDefinition: true, variable: i8** @updatefnbuf)
!231 = distinct !DIGlobalVariable(name: "updatefnrest", scope: !0, file: !159, line: 60, type: !162, isLocal: true, isDefinition: true, variable: i8** @updatefnrest)
!232 = distinct !DIGlobalVariable(name: "uvb", scope: !0, file: !159, line: 61, type: !233, isLocal: true, isDefinition: true, variable: %struct.varbuf* @uvb)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !234, line: 55, size: 192, align: 64, elements: !235)
!234 = !DIFile(filename: "../../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!235 = !{!236, !237, !238}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !233, file: !234, line: 56, baseType: !220, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !233, file: !234, line: 56, baseType: !220, size: 64, align: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !233, file: !234, line: 57, baseType: !162, size: 64, align: 64, offset: 128)
!239 = distinct !DIGlobalVariable(name: "fnis", scope: !0, file: !159, line: 141, type: !240, isLocal: true, isDefinition: true, variable: [7 x %struct.fni]* @fnis)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 896, align: 64, elements: !249)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fni", file: !159, line: 138, size: 128, align: 64, elements: !243)
!243 = !{!244, !247}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "suffix", scope: !242, file: !159, line: 139, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !242, file: !159, line: 140, baseType: !248, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!249 = !{!250}
!250 = !DISubrange(count: 7)
!251 = distinct !DIGlobalVariable(name: "dblockfd", scope: !0, file: !159, line: 188, type: !175, isLocal: true, isDefinition: true, variable: i32* @dblockfd)
!252 = distinct !DIGlobalVariable(name: "frontendlockfd", scope: !0, file: !159, line: 189, type: !175, isLocal: true, isDefinition: true, variable: i32* @frontendlockfd)
!253 = distinct !DIGlobalVariable(name: "cflags", scope: !0, file: !159, line: 51, type: !14, isLocal: true, isDefinition: true, variable: i32* @cflags)
!254 = distinct !DIGlobalVariable(name: "cstatus", scope: !0, file: !159, line: 51, type: !14, isLocal: true, isDefinition: true, variable: i32* @cstatus)
!255 = distinct !DIGlobalVariable(name: "updateslength", scope: !0, file: !159, line: 59, type: !175, isLocal: true, isDefinition: true, variable: i32* @updateslength)
!256 = distinct !DIGlobalVariable(name: "importanttmpfile", scope: !0, file: !159, line: 55, type: !162, isLocal: true, isDefinition: true, variable: i8** @importanttmpfile)
!257 = !{i32 2, !"Dwarf Version", i32 4}
!258 = !{i32 2, !"Debug Info Version", i32 3}
!259 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!260 = distinct !DISubprogram(name: "modstatdb_init", scope: !159, file: !159, line: 152, type: !261, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!261 = !DISubroutineType(types: !262)
!262 = !{null}
!263 = !{}
!264 = !DILocalVariable(name: "fnip", scope: !260, file: !159, line: 154, type: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!266 = !DIExpression()
!267 = !DILocation(line: 154, column: 21, scope: !260)
!268 = !DILocation(line: 156, column: 7, scope: !269)
!269 = distinct !DILexicalBlock(scope: !260, file: !159, line: 156, column: 7)
!270 = !DILocation(line: 156, column: 7, scope: !260)
!271 = !DILocation(line: 157, column: 5, scope: !269)
!272 = !DILocation(line: 159, column: 13, scope: !273)
!273 = distinct !DILexicalBlock(scope: !260, file: !159, line: 159, column: 3)
!274 = !DILocation(line: 159, column: 8, scope: !273)
!275 = !DILocation(line: 159, column: 21, scope: !276)
!276 = !DILexicalBlockFile(scope: !277, file: !159, discriminator: 1)
!277 = distinct !DILexicalBlock(scope: !273, file: !159, line: 159, column: 3)
!278 = !DILocation(line: 159, column: 27, scope: !276)
!279 = !DILocation(line: 159, column: 3, scope: !276)
!280 = !DILocation(line: 160, column: 11, scope: !281)
!281 = distinct !DILexicalBlock(scope: !277, file: !159, line: 159, column: 43)
!282 = !DILocation(line: 160, column: 17, scope: !281)
!283 = !DILocation(line: 160, column: 10, scope: !281)
!284 = !DILocation(line: 160, column: 5, scope: !281)
!285 = !DILocation(line: 161, column: 37, scope: !281)
!286 = !DILocation(line: 161, column: 43, scope: !281)
!287 = !DILocation(line: 161, column: 20, scope: !281)
!288 = !DILocation(line: 161, column: 6, scope: !281)
!289 = !DILocation(line: 161, column: 12, scope: !281)
!290 = !DILocation(line: 161, column: 18, scope: !281)
!291 = !DILocation(line: 162, column: 3, scope: !281)
!292 = !DILocation(line: 159, column: 39, scope: !293)
!293 = !DILexicalBlockFile(scope: !277, file: !159, discriminator: 2)
!294 = !DILocation(line: 159, column: 3, scope: !293)
!295 = distinct !{!295, !296}
!296 = !DILocation(line: 159, column: 3, scope: !260)
!297 = !DILocation(line: 164, column: 33, scope: !260)
!298 = !DILocation(line: 164, column: 26, scope: !260)
!299 = !DILocation(line: 164, column: 45, scope: !260)
!300 = !DILocation(line: 164, column: 50, scope: !260)
!301 = !DILocation(line: 164, column: 17, scope: !302)
!302 = !DILexicalBlockFile(scope: !260, file: !159, discriminator: 1)
!303 = !DILocation(line: 164, column: 15, scope: !260)
!304 = !DILocation(line: 165, column: 10, scope: !260)
!305 = !DILocation(line: 165, column: 23, scope: !260)
!306 = !DILocation(line: 165, column: 3, scope: !260)
!307 = !DILocation(line: 166, column: 18, scope: !260)
!308 = !DILocation(line: 166, column: 39, scope: !260)
!309 = !DILocation(line: 166, column: 32, scope: !260)
!310 = !DILocation(line: 166, column: 30, scope: !260)
!311 = !DILocation(line: 166, column: 16, scope: !260)
!312 = !DILocation(line: 168, column: 18, scope: !260)
!313 = !DILocation(line: 169, column: 1, scope: !260)
!314 = !DILocation(line: 169, column: 1, scope: !302)
!315 = distinct !DISubprogram(name: "modstatdb_done", scope: !159, file: !159, line: 172, type: !261, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!316 = !DILocalVariable(name: "fnip", scope: !315, file: !159, line: 174, type: !265)
!317 = !DILocation(line: 174, column: 21, scope: !315)
!318 = !DILocation(line: 176, column: 8, scope: !319)
!319 = distinct !DILexicalBlock(scope: !315, file: !159, line: 176, column: 7)
!320 = !DILocation(line: 176, column: 7, scope: !315)
!321 = !DILocation(line: 177, column: 5, scope: !319)
!322 = !DILocation(line: 179, column: 13, scope: !323)
!323 = distinct !DILexicalBlock(scope: !315, file: !159, line: 179, column: 3)
!324 = !DILocation(line: 179, column: 8, scope: !323)
!325 = !DILocation(line: 179, column: 21, scope: !326)
!326 = !DILexicalBlockFile(scope: !327, file: !159, discriminator: 1)
!327 = distinct !DILexicalBlock(scope: !323, file: !159, line: 179, column: 3)
!328 = !DILocation(line: 179, column: 27, scope: !326)
!329 = !DILocation(line: 179, column: 3, scope: !326)
!330 = !DILocation(line: 180, column: 11, scope: !331)
!331 = distinct !DILexicalBlock(scope: !327, file: !159, line: 179, column: 43)
!332 = !DILocation(line: 180, column: 17, scope: !331)
!333 = !DILocation(line: 180, column: 10, scope: !331)
!334 = !DILocation(line: 180, column: 5, scope: !331)
!335 = !DILocation(line: 181, column: 6, scope: !331)
!336 = !DILocation(line: 181, column: 12, scope: !331)
!337 = !DILocation(line: 181, column: 18, scope: !331)
!338 = !DILocation(line: 182, column: 3, scope: !331)
!339 = !DILocation(line: 179, column: 39, scope: !340)
!340 = !DILexicalBlockFile(scope: !327, file: !159, discriminator: 2)
!341 = !DILocation(line: 179, column: 3, scope: !340)
!342 = distinct !{!342, !343}
!343 = !DILocation(line: 179, column: 3, scope: !315)
!344 = !DILocation(line: 183, column: 8, scope: !315)
!345 = !DILocation(line: 183, column: 3, scope: !315)
!346 = !DILocation(line: 185, column: 18, scope: !315)
!347 = !DILocation(line: 186, column: 1, scope: !315)
!348 = !DILocation(line: 186, column: 1, scope: !349)
!349 = !DILexicalBlockFile(scope: !315, file: !159, discriminator: 1)
!350 = distinct !DISubprogram(name: "modstatdb_is_locked", scope: !159, file: !159, line: 192, type: !351, isLocal: false, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!351 = !DISubroutineType(types: !352)
!352 = !{!160}
!353 = !DILocalVariable(name: "lockfd", scope: !350, file: !159, line: 194, type: !175)
!354 = !DILocation(line: 194, column: 7, scope: !350)
!355 = !DILocalVariable(name: "locked", scope: !350, file: !159, line: 195, type: !160)
!356 = !DILocation(line: 195, column: 7, scope: !350)
!357 = !DILocation(line: 197, column: 7, scope: !358)
!358 = distinct !DILexicalBlock(scope: !350, file: !159, line: 197, column: 7)
!359 = !DILocation(line: 197, column: 16, scope: !358)
!360 = !DILocation(line: 197, column: 7, scope: !350)
!361 = !DILocation(line: 198, column: 19, scope: !362)
!362 = distinct !DILexicalBlock(scope: !358, file: !159, line: 197, column: 23)
!363 = !DILocation(line: 198, column: 14, scope: !362)
!364 = !DILocation(line: 198, column: 12, scope: !362)
!365 = !DILocation(line: 199, column: 9, scope: !366)
!366 = distinct !DILexicalBlock(scope: !362, file: !159, line: 199, column: 9)
!367 = !DILocation(line: 199, column: 16, scope: !366)
!368 = !DILocation(line: 199, column: 9, scope: !362)
!369 = !DILocation(line: 200, column: 14, scope: !366)
!370 = !DILocation(line: 201, column: 15, scope: !366)
!371 = !DILocation(line: 200, column: 7, scope: !372)
!372 = !DILexicalBlockFile(scope: !366, file: !159, discriminator: 1)
!373 = !DILocation(line: 200, column: 7, scope: !366)
!374 = !DILocation(line: 202, column: 3, scope: !362)
!375 = !DILocation(line: 203, column: 14, scope: !376)
!376 = distinct !DILexicalBlock(scope: !358, file: !159, line: 202, column: 10)
!377 = !DILocation(line: 203, column: 12, scope: !376)
!378 = !DILocation(line: 206, column: 27, scope: !350)
!379 = !DILocation(line: 206, column: 35, scope: !350)
!380 = !DILocation(line: 206, column: 12, scope: !350)
!381 = !DILocation(line: 206, column: 10, scope: !350)
!382 = !DILocation(line: 210, column: 7, scope: !383)
!383 = distinct !DILexicalBlock(scope: !350, file: !159, line: 210, column: 7)
!384 = !DILocation(line: 210, column: 16, scope: !383)
!385 = !DILocation(line: 210, column: 7, scope: !350)
!386 = !DILocation(line: 211, column: 11, scope: !383)
!387 = !DILocation(line: 211, column: 5, scope: !383)
!388 = !DILocation(line: 213, column: 10, scope: !350)
!389 = !DILocation(line: 213, column: 3, scope: !350)
!390 = distinct !DISubprogram(name: "modstatdb_can_lock", scope: !159, file: !159, line: 217, type: !351, isLocal: false, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!391 = !DILocation(line: 219, column: 7, scope: !392)
!392 = distinct !DILexicalBlock(scope: !390, file: !159, line: 219, column: 7)
!393 = !DILocation(line: 219, column: 16, scope: !392)
!394 = !DILocation(line: 219, column: 7, scope: !390)
!395 = !DILocation(line: 220, column: 5, scope: !392)
!396 = !DILocation(line: 222, column: 7, scope: !397)
!397 = distinct !DILexicalBlock(scope: !390, file: !159, line: 222, column: 7)
!398 = !DILocation(line: 222, column: 38, scope: !397)
!399 = !DILocation(line: 222, column: 7, scope: !390)
!400 = !DILocation(line: 223, column: 27, scope: !401)
!401 = distinct !DILexicalBlock(scope: !397, file: !159, line: 222, column: 46)
!402 = !DILocation(line: 223, column: 22, scope: !401)
!403 = !DILocation(line: 223, column: 20, scope: !401)
!404 = !DILocation(line: 224, column: 9, scope: !405)
!405 = distinct !DILexicalBlock(scope: !401, file: !159, line: 224, column: 9)
!406 = !DILocation(line: 224, column: 24, scope: !405)
!407 = !DILocation(line: 224, column: 9, scope: !401)
!408 = !DILocation(line: 225, column: 12, scope: !409)
!409 = distinct !DILexicalBlock(scope: !410, file: !159, line: 225, column: 10)
!410 = distinct !DILexicalBlock(scope: !405, file: !159, line: 224, column: 31)
!411 = !DILocation(line: 225, column: 11, scope: !409)
!412 = !DILocation(line: 225, column: 16, scope: !409)
!413 = !DILocation(line: 225, column: 26, scope: !409)
!414 = !DILocation(line: 225, column: 31, scope: !415)
!415 = !DILexicalBlockFile(scope: !409, file: !159, discriminator: 1)
!416 = !DILocation(line: 225, column: 30, scope: !415)
!417 = !DILocation(line: 225, column: 35, scope: !415)
!418 = !DILocation(line: 225, column: 10, scope: !415)
!419 = !DILocation(line: 226, column: 9, scope: !409)
!420 = !DILocation(line: 228, column: 16, scope: !409)
!421 = !DILocation(line: 229, column: 17, scope: !409)
!422 = !DILocation(line: 228, column: 9, scope: !415)
!423 = !DILocation(line: 228, column: 9, scope: !409)
!424 = !DILocation(line: 231, column: 3, scope: !401)
!425 = !DILocation(line: 232, column: 20, scope: !426)
!426 = distinct !DILexicalBlock(scope: !397, file: !159, line: 231, column: 10)
!427 = !DILocation(line: 235, column: 19, scope: !390)
!428 = !DILocation(line: 235, column: 14, scope: !390)
!429 = !DILocation(line: 235, column: 12, scope: !390)
!430 = !DILocation(line: 236, column: 7, scope: !431)
!431 = distinct !DILexicalBlock(scope: !390, file: !159, line: 236, column: 7)
!432 = !DILocation(line: 236, column: 16, scope: !431)
!433 = !DILocation(line: 236, column: 7, scope: !390)
!434 = !DILocation(line: 237, column: 10, scope: !435)
!435 = distinct !DILexicalBlock(scope: !436, file: !159, line: 237, column: 8)
!436 = distinct !DILexicalBlock(scope: !431, file: !159, line: 236, column: 23)
!437 = !DILocation(line: 237, column: 9, scope: !435)
!438 = !DILocation(line: 237, column: 14, scope: !435)
!439 = !DILocation(line: 237, column: 24, scope: !435)
!440 = !DILocation(line: 237, column: 29, scope: !441)
!441 = !DILexicalBlockFile(scope: !435, file: !159, discriminator: 1)
!442 = !DILocation(line: 237, column: 28, scope: !441)
!443 = !DILocation(line: 237, column: 33, scope: !441)
!444 = !DILocation(line: 237, column: 8, scope: !441)
!445 = !DILocation(line: 238, column: 7, scope: !435)
!446 = !DILocation(line: 240, column: 14, scope: !435)
!447 = !DILocation(line: 241, column: 15, scope: !435)
!448 = !DILocation(line: 240, column: 7, scope: !441)
!449 = !DILocation(line: 240, column: 7, scope: !435)
!450 = !DILocation(line: 244, column: 3, scope: !390)
!451 = !DILocation(line: 245, column: 1, scope: !390)
!452 = distinct !DISubprogram(name: "modstatdb_lock", scope: !159, file: !159, line: 248, type: !261, isLocal: false, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!453 = !DILocation(line: 250, column: 8, scope: !454)
!454 = distinct !DILexicalBlock(scope: !452, file: !159, line: 250, column: 7)
!455 = !DILocation(line: 250, column: 7, scope: !452)
!456 = !DILocation(line: 251, column: 11, scope: !454)
!457 = !DILocation(line: 252, column: 12, scope: !454)
!458 = !DILocation(line: 251, column: 5, scope: !459)
!459 = !DILexicalBlockFile(scope: !454, file: !159, discriminator: 1)
!460 = !DILocation(line: 251, column: 5, scope: !454)
!461 = !DILocation(line: 254, column: 7, scope: !462)
!462 = distinct !DILexicalBlock(scope: !452, file: !159, line: 254, column: 7)
!463 = !DILocation(line: 254, column: 22, scope: !462)
!464 = !DILocation(line: 254, column: 7, scope: !452)
!465 = !DILocation(line: 255, column: 50, scope: !462)
!466 = !DILocation(line: 256, column: 14, scope: !462)
!467 = !DILocation(line: 255, column: 5, scope: !462)
!468 = !DILocation(line: 257, column: 42, scope: !452)
!469 = !DILocation(line: 258, column: 12, scope: !452)
!470 = !DILocation(line: 257, column: 3, scope: !452)
!471 = !DILocation(line: 259, column: 1, scope: !452)
!472 = distinct !DISubprogram(name: "modstatdb_unlock", scope: !159, file: !159, line: 262, type: !261, isLocal: false, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!473 = !DILocation(line: 265, column: 3, scope: !472)
!474 = !DILocation(line: 266, column: 7, scope: !475)
!475 = distinct !DILexicalBlock(scope: !472, file: !159, line: 266, column: 7)
!476 = !DILocation(line: 266, column: 22, scope: !475)
!477 = !DILocation(line: 266, column: 7, scope: !472)
!478 = !DILocation(line: 267, column: 5, scope: !475)
!479 = !DILocation(line: 269, column: 12, scope: !472)
!480 = !DILocation(line: 270, column: 18, scope: !472)
!481 = !DILocation(line: 271, column: 1, scope: !472)
!482 = distinct !DISubprogram(name: "modstatdb_open", scope: !159, file: !159, line: 274, type: !483, isLocal: false, isDefinition: true, scopeLine: 275, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!483 = !DISubroutineType(types: !484)
!484 = !{!14, !14}
!485 = !DILocalVariable(name: "readwritereq", arg: 1, scope: !482, file: !159, line: 274, type: !14)
!486 = !DILocation(line: 274, column: 34, scope: !482)
!487 = !DILocation(line: 276, column: 3, scope: !482)
!488 = !DILocation(line: 278, column: 12, scope: !482)
!489 = !DILocation(line: 278, column: 25, scope: !482)
!490 = !DILocation(line: 278, column: 10, scope: !482)
!491 = !DILocation(line: 279, column: 16, scope: !482)
!492 = !DILocation(line: 281, column: 11, scope: !482)
!493 = !DILocation(line: 281, column: 3, scope: !482)
!494 = !DILocation(line: 284, column: 9, scope: !495)
!495 = distinct !DILexicalBlock(scope: !496, file: !159, line: 284, column: 9)
!496 = distinct !DILexicalBlock(scope: !482, file: !159, line: 281, column: 25)
!497 = !DILocation(line: 284, column: 18, scope: !495)
!498 = !DILocation(line: 284, column: 21, scope: !499)
!499 = !DILexicalBlockFile(scope: !495, file: !159, discriminator: 1)
!500 = !DILocation(line: 284, column: 9, scope: !499)
!501 = !DILocation(line: 285, column: 13, scope: !495)
!502 = !DILocation(line: 285, column: 7, scope: !499)
!503 = !DILocation(line: 285, column: 7, scope: !495)
!504 = !DILocation(line: 284, column: 29, scope: !505)
!505 = !DILexicalBlockFile(scope: !495, file: !159, discriminator: 2)
!506 = !DILocation(line: 288, column: 16, scope: !507)
!507 = distinct !DILexicalBlock(scope: !496, file: !159, line: 288, column: 9)
!508 = !DILocation(line: 288, column: 9, scope: !509)
!509 = !DILexicalBlockFile(scope: !507, file: !159, discriminator: 1)
!510 = !DILocation(line: 288, column: 9, scope: !507)
!511 = !DILocation(line: 288, column: 9, scope: !496)
!512 = !DILocation(line: 289, column: 12, scope: !513)
!513 = distinct !DILexicalBlock(scope: !514, file: !159, line: 289, column: 10)
!514 = distinct !DILexicalBlock(scope: !507, file: !159, line: 288, column: 41)
!515 = !DILocation(line: 289, column: 11, scope: !513)
!516 = !DILocation(line: 289, column: 16, scope: !513)
!517 = !DILocation(line: 289, column: 10, scope: !514)
!518 = !DILocation(line: 290, column: 16, scope: !513)
!519 = !DILocation(line: 291, column: 17, scope: !513)
!520 = !DILocation(line: 290, column: 9, scope: !521)
!521 = !DILexicalBlockFile(scope: !513, file: !159, discriminator: 1)
!522 = !DILocation(line: 290, column: 9, scope: !513)
!523 = !DILocation(line: 292, column: 16, scope: !524)
!524 = distinct !DILexicalBlock(scope: !513, file: !159, line: 292, column: 16)
!525 = !DILocation(line: 292, column: 29, scope: !524)
!526 = !DILocation(line: 292, column: 16, scope: !513)
!527 = !DILocation(line: 293, column: 15, scope: !524)
!528 = !DILocation(line: 294, column: 16, scope: !524)
!529 = !DILocation(line: 293, column: 9, scope: !530)
!530 = !DILexicalBlockFile(scope: !524, file: !159, discriminator: 1)
!531 = !DILocation(line: 293, column: 9, scope: !524)
!532 = !DILocation(line: 295, column: 14, scope: !514)
!533 = !DILocation(line: 296, column: 5, scope: !514)
!534 = !DILocation(line: 297, column: 7, scope: !535)
!535 = distinct !DILexicalBlock(scope: !507, file: !159, line: 296, column: 12)
!536 = !DILocation(line: 298, column: 17, scope: !535)
!537 = !DILocation(line: 298, column: 30, scope: !535)
!538 = !DILocation(line: 298, column: 14, scope: !535)
!539 = !DILocation(line: 302, column: 5, scope: !496)
!540 = !DILocation(line: 304, column: 12, scope: !496)
!541 = !DILocation(line: 304, column: 31, scope: !496)
!542 = !DILocation(line: 306, column: 76, scope: !496)
!543 = !DILocation(line: 306, column: 5, scope: !496)
!544 = !DILocation(line: 309, column: 3, scope: !482)
!545 = !DILocation(line: 311, column: 7, scope: !546)
!546 = distinct !DILexicalBlock(scope: !482, file: !159, line: 311, column: 7)
!547 = !DILocation(line: 311, column: 15, scope: !546)
!548 = !DILocation(line: 311, column: 7, scope: !482)
!549 = !DILocation(line: 312, column: 5, scope: !550)
!550 = distinct !DILexicalBlock(scope: !546, file: !159, line: 311, column: 48)
!551 = !DILocation(line: 313, column: 9, scope: !552)
!552 = distinct !DILexicalBlock(scope: !550, file: !159, line: 313, column: 9)
!553 = !DILocation(line: 313, column: 16, scope: !552)
!554 = !DILocation(line: 313, column: 9, scope: !550)
!555 = !DILocation(line: 314, column: 15, scope: !552)
!556 = !DILocation(line: 314, column: 7, scope: !552)
!557 = !DILocation(line: 315, column: 3, scope: !550)
!558 = !DILocation(line: 317, column: 7, scope: !559)
!559 = distinct !DILexicalBlock(scope: !482, file: !159, line: 317, column: 7)
!560 = !DILocation(line: 317, column: 15, scope: !559)
!561 = !DILocation(line: 317, column: 7, scope: !482)
!562 = !DILocation(line: 318, column: 5, scope: !563)
!563 = distinct !DILexicalBlock(scope: !559, file: !159, line: 317, column: 32)
!564 = !DILocation(line: 319, column: 5, scope: !563)
!565 = !DILocation(line: 320, column: 3, scope: !563)
!566 = !DILocation(line: 322, column: 23, scope: !482)
!567 = !DILocation(line: 322, column: 3, scope: !482)
!568 = !DILocation(line: 323, column: 20, scope: !482)
!569 = !DILocation(line: 323, column: 3, scope: !482)
!570 = !DILocation(line: 325, column: 10, scope: !482)
!571 = !DILocation(line: 325, column: 3, scope: !482)
!572 = distinct !DISubprogram(name: "cleanupdates", scope: !159, file: !159, line: 79, type: !261, isLocal: true, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!573 = !DILocalVariable(name: "cdlist", scope: !572, file: !159, line: 80, type: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64, align: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !577, line: 22, size: 2240, align: 64, elements: !578)
!577 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!578 = !{!579, !581, !582, !583, !585}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !576, file: !577, line: 25, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !200, line: 127, baseType: !222)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !576, file: !577, line: 26, baseType: !199, size: 64, align: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !576, file: !577, line: 31, baseType: !203, size: 16, align: 16, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !576, file: !577, line: 32, baseType: !584, size: 8, align: 8, offset: 144)
!584 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !576, file: !577, line: 33, baseType: !586, size: 2048, align: 8, offset: 152)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 2048, align: 8, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 256)
!589 = !DILocation(line: 80, column: 19, scope: !572)
!590 = !DILocalVariable(name: "cdn", scope: !572, file: !159, line: 81, type: !175)
!591 = !DILocation(line: 81, column: 7, scope: !572)
!592 = !DILocalVariable(name: "i", scope: !572, file: !159, line: 81, type: !175)
!593 = !DILocation(line: 81, column: 12, scope: !572)
!594 = !DILocation(line: 83, column: 11, scope: !572)
!595 = !DILocation(line: 83, column: 3, scope: !572)
!596 = !DILocation(line: 85, column: 4, scope: !572)
!597 = !DILocation(line: 85, column: 17, scope: !572)
!598 = !DILocation(line: 86, column: 16, scope: !572)
!599 = !DILocation(line: 87, column: 16, scope: !572)
!600 = !DILocation(line: 87, column: 8, scope: !572)
!601 = !DILocation(line: 87, column: 6, scope: !572)
!602 = !DILocation(line: 88, column: 7, scope: !603)
!603 = distinct !DILexicalBlock(scope: !572, file: !159, line: 88, column: 7)
!604 = !DILocation(line: 88, column: 11, scope: !603)
!605 = !DILocation(line: 88, column: 7, scope: !572)
!606 = !DILocation(line: 89, column: 12, scope: !603)
!607 = !DILocation(line: 89, column: 57, scope: !603)
!608 = !DILocation(line: 89, column: 5, scope: !609)
!609 = !DILexicalBlockFile(scope: !603, file: !159, discriminator: 1)
!610 = !DILocation(line: 89, column: 5, scope: !603)
!611 = !DILocation(line: 91, column: 7, scope: !612)
!612 = distinct !DILexicalBlock(scope: !572, file: !159, line: 91, column: 7)
!613 = !DILocation(line: 91, column: 7, scope: !572)
!614 = !DILocation(line: 92, column: 11, scope: !615)
!615 = distinct !DILexicalBlock(scope: !616, file: !159, line: 92, column: 5)
!616 = distinct !DILexicalBlock(scope: !612, file: !159, line: 91, column: 12)
!617 = !DILocation(line: 92, column: 10, scope: !615)
!618 = !DILocation(line: 92, column: 15, scope: !619)
!619 = !DILexicalBlockFile(scope: !620, file: !159, discriminator: 1)
!620 = distinct !DILexicalBlock(scope: !615, file: !159, line: 92, column: 5)
!621 = !DILocation(line: 92, column: 17, scope: !619)
!622 = !DILocation(line: 92, column: 16, scope: !619)
!623 = !DILocation(line: 92, column: 5, scope: !619)
!624 = !DILocation(line: 93, column: 14, scope: !625)
!625 = distinct !DILexicalBlock(scope: !620, file: !159, line: 92, column: 27)
!626 = !DILocation(line: 93, column: 35, scope: !625)
!627 = !DILocation(line: 93, column: 28, scope: !625)
!628 = !DILocation(line: 93, column: 39, scope: !625)
!629 = !DILocation(line: 93, column: 7, scope: !625)
!630 = !DILocation(line: 94, column: 15, scope: !625)
!631 = !DILocation(line: 94, column: 7, scope: !625)
!632 = !DILocation(line: 95, column: 5, scope: !625)
!633 = !DILocation(line: 92, column: 23, scope: !634)
!634 = !DILexicalBlockFile(scope: !620, file: !159, discriminator: 2)
!635 = !DILocation(line: 92, column: 5, scope: !634)
!636 = distinct !{!636, !637}
!637 = !DILocation(line: 92, column: 5, scope: !616)
!638 = !DILocation(line: 97, column: 9, scope: !639)
!639 = distinct !DILexicalBlock(scope: !616, file: !159, line: 97, column: 9)
!640 = !DILocation(line: 97, column: 17, scope: !639)
!641 = !DILocation(line: 97, column: 9, scope: !616)
!642 = !DILocation(line: 98, column: 15, scope: !643)
!643 = distinct !DILexicalBlock(scope: !639, file: !159, line: 97, column: 34)
!644 = !DILocation(line: 98, column: 7, scope: !643)
!645 = !DILocation(line: 100, column: 13, scope: !646)
!646 = distinct !DILexicalBlock(scope: !643, file: !159, line: 100, column: 7)
!647 = !DILocation(line: 100, column: 12, scope: !646)
!648 = !DILocation(line: 100, column: 17, scope: !649)
!649 = !DILexicalBlockFile(scope: !650, file: !159, discriminator: 1)
!650 = distinct !DILexicalBlock(scope: !646, file: !159, line: 100, column: 7)
!651 = !DILocation(line: 100, column: 19, scope: !649)
!652 = !DILocation(line: 100, column: 18, scope: !649)
!653 = !DILocation(line: 100, column: 7, scope: !649)
!654 = !DILocation(line: 101, column: 16, scope: !655)
!655 = distinct !DILexicalBlock(scope: !650, file: !159, line: 100, column: 29)
!656 = !DILocation(line: 101, column: 37, scope: !655)
!657 = !DILocation(line: 101, column: 30, scope: !655)
!658 = !DILocation(line: 101, column: 41, scope: !655)
!659 = !DILocation(line: 101, column: 9, scope: !655)
!660 = !DILocation(line: 102, column: 20, scope: !661)
!661 = distinct !DILexicalBlock(scope: !655, file: !159, line: 102, column: 13)
!662 = !DILocation(line: 102, column: 13, scope: !661)
!663 = !DILocation(line: 102, column: 13, scope: !655)
!664 = !DILocation(line: 103, column: 18, scope: !661)
!665 = !DILocation(line: 103, column: 72, scope: !661)
!666 = !DILocation(line: 103, column: 11, scope: !667)
!667 = !DILexicalBlockFile(scope: !661, file: !159, discriminator: 1)
!668 = !DILocation(line: 103, column: 11, scope: !661)
!669 = !DILocation(line: 104, column: 7, scope: !655)
!670 = !DILocation(line: 100, column: 25, scope: !671)
!671 = !DILexicalBlockFile(scope: !650, file: !159, discriminator: 2)
!672 = !DILocation(line: 100, column: 7, scope: !671)
!673 = distinct !{!673, !674}
!674 = !DILocation(line: 100, column: 7, scope: !643)
!675 = !DILocation(line: 106, column: 21, scope: !643)
!676 = !DILocation(line: 106, column: 7, scope: !643)
!677 = !DILocation(line: 107, column: 5, scope: !643)
!678 = !DILocation(line: 109, column: 12, scope: !679)
!679 = distinct !DILexicalBlock(scope: !616, file: !159, line: 109, column: 5)
!680 = !DILocation(line: 109, column: 10, scope: !679)
!681 = !DILocation(line: 109, column: 17, scope: !682)
!682 = !DILexicalBlockFile(scope: !683, file: !159, discriminator: 1)
!683 = distinct !DILexicalBlock(scope: !679, file: !159, line: 109, column: 5)
!684 = !DILocation(line: 109, column: 21, scope: !682)
!685 = !DILocation(line: 109, column: 19, scope: !682)
!686 = !DILocation(line: 109, column: 5, scope: !682)
!687 = !DILocation(line: 110, column: 19, scope: !683)
!688 = !DILocation(line: 110, column: 12, scope: !683)
!689 = !DILocation(line: 110, column: 7, scope: !683)
!690 = !DILocation(line: 109, column: 27, scope: !691)
!691 = !DILexicalBlockFile(scope: !683, file: !159, discriminator: 2)
!692 = !DILocation(line: 109, column: 5, scope: !691)
!693 = distinct !{!693, !694}
!694 = !DILocation(line: 109, column: 5, scope: !616)
!695 = !DILocation(line: 111, column: 3, scope: !616)
!696 = !DILocation(line: 112, column: 8, scope: !572)
!697 = !DILocation(line: 112, column: 3, scope: !572)
!698 = !DILocation(line: 114, column: 13, scope: !572)
!699 = !DILocation(line: 115, column: 1, scope: !572)
!700 = distinct !DISubprogram(name: "createimptmp", scope: !159, file: !159, line: 117, type: !261, isLocal: true, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!701 = !DILocalVariable(name: "i", scope: !700, file: !159, line: 118, type: !175)
!702 = !DILocation(line: 118, column: 7, scope: !700)
!703 = !DILocation(line: 120, column: 14, scope: !700)
!704 = !DILocation(line: 122, column: 23, scope: !700)
!705 = !DILocation(line: 122, column: 17, scope: !700)
!706 = !DILocation(line: 122, column: 15, scope: !700)
!707 = !DILocation(line: 123, column: 8, scope: !708)
!708 = distinct !DILexicalBlock(scope: !700, file: !159, line: 123, column: 7)
!709 = !DILocation(line: 123, column: 7, scope: !700)
!710 = !DILocation(line: 124, column: 12, scope: !708)
!711 = !DILocation(line: 124, column: 44, scope: !708)
!712 = !DILocation(line: 124, column: 5, scope: !713)
!713 = !DILexicalBlockFile(scope: !708, file: !159, discriminator: 1)
!714 = !DILocation(line: 124, column: 5, scope: !708)
!715 = !DILocation(line: 125, column: 21, scope: !700)
!716 = !DILocation(line: 125, column: 14, scope: !700)
!717 = !DILocation(line: 125, column: 35, scope: !700)
!718 = !DILocation(line: 125, column: 3, scope: !719)
!719 = !DILexicalBlockFile(scope: !700, file: !159, discriminator: 1)
!720 = !DILocation(line: 126, column: 9, scope: !721)
!721 = distinct !DILexicalBlock(scope: !700, file: !159, line: 126, column: 3)
!722 = !DILocation(line: 126, column: 8, scope: !721)
!723 = !DILocation(line: 126, column: 13, scope: !724)
!724 = !DILexicalBlockFile(scope: !725, file: !159, discriminator: 1)
!725 = distinct !DILexicalBlock(scope: !721, file: !159, line: 126, column: 3)
!726 = !DILocation(line: 126, column: 14, scope: !724)
!727 = !DILocation(line: 126, column: 3, scope: !724)
!728 = !DILocation(line: 126, column: 44, scope: !729)
!729 = !DILexicalBlockFile(scope: !725, file: !159, discriminator: 2)
!730 = !DILocation(line: 126, column: 25, scope: !729)
!731 = !DILocation(line: 126, column: 21, scope: !732)
!732 = !DILexicalBlockFile(scope: !725, file: !159, discriminator: 3)
!733 = !DILocation(line: 126, column: 3, scope: !732)
!734 = distinct !{!734, !735}
!735 = !DILocation(line: 126, column: 3, scope: !700)
!736 = !DILocation(line: 127, column: 14, scope: !737)
!737 = distinct !DILexicalBlock(scope: !700, file: !159, line: 127, column: 7)
!738 = !DILocation(line: 127, column: 7, scope: !737)
!739 = !DILocation(line: 127, column: 7, scope: !700)
!740 = !DILocation(line: 128, column: 12, scope: !737)
!741 = !DILocation(line: 128, column: 52, scope: !737)
!742 = !DILocation(line: 128, column: 5, scope: !743)
!743 = !DILexicalBlockFile(scope: !737, file: !159, discriminator: 1)
!744 = !DILocation(line: 128, column: 5, scope: !737)
!745 = !DILocation(line: 129, column: 14, scope: !746)
!746 = distinct !DILexicalBlock(scope: !700, file: !159, line: 129, column: 7)
!747 = !DILocation(line: 129, column: 7, scope: !746)
!748 = !DILocation(line: 129, column: 7, scope: !700)
!749 = !DILocation(line: 130, column: 12, scope: !746)
!750 = !DILocation(line: 130, column: 55, scope: !746)
!751 = !DILocation(line: 130, column: 5, scope: !752)
!752 = !DILexicalBlockFile(scope: !746, file: !159, discriminator: 1)
!753 = !DILocation(line: 130, column: 5, scope: !746)
!754 = !DILocation(line: 131, column: 13, scope: !755)
!755 = distinct !DILexicalBlock(scope: !700, file: !159, line: 131, column: 7)
!756 = !DILocation(line: 131, column: 7, scope: !755)
!757 = !DILocation(line: 131, column: 7, scope: !700)
!758 = !DILocation(line: 132, column: 12, scope: !755)
!759 = !DILocation(line: 133, column: 6, scope: !755)
!760 = !DILocation(line: 132, column: 5, scope: !761)
!761 = !DILexicalBlockFile(scope: !755, file: !159, discriminator: 1)
!762 = !DILocation(line: 132, column: 5, scope: !755)
!763 = !DILocation(line: 135, column: 14, scope: !700)
!764 = !DILocation(line: 136, column: 1, scope: !700)
!765 = distinct !DISubprogram(name: "modstatdb_get_status", scope: !159, file: !159, line: 329, type: !766, isLocal: false, isDefinition: true, scopeLine: 330, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!766 = !DISubroutineType(types: !767)
!767 = !{!14}
!768 = !DILocation(line: 331, column: 10, scope: !765)
!769 = !DILocation(line: 331, column: 3, scope: !765)
!770 = distinct !DISubprogram(name: "modstatdb_checkpoint", scope: !159, file: !159, line: 334, type: !261, isLocal: false, isDefinition: true, scopeLine: 334, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!771 = !DILocalVariable(name: "i", scope: !770, file: !159, line: 335, type: !175)
!772 = !DILocation(line: 335, column: 7, scope: !770)
!773 = !DILocation(line: 337, column: 7, scope: !774)
!774 = distinct !DILexicalBlock(scope: !770, file: !159, line: 337, column: 7)
!775 = !DILocation(line: 337, column: 15, scope: !774)
!776 = !DILocation(line: 337, column: 7, scope: !770)
!777 = !DILocation(line: 338, column: 88, scope: !774)
!778 = !DILocation(line: 338, column: 5, scope: !774)
!779 = !DILocation(line: 340, column: 11, scope: !770)
!780 = !DILocation(line: 340, column: 3, scope: !770)
!781 = !DILocation(line: 342, column: 9, scope: !782)
!782 = distinct !DILexicalBlock(scope: !770, file: !159, line: 342, column: 3)
!783 = !DILocation(line: 342, column: 8, scope: !782)
!784 = !DILocation(line: 342, column: 13, scope: !785)
!785 = !DILexicalBlockFile(scope: !786, file: !159, discriminator: 1)
!786 = distinct !DILexicalBlock(scope: !782, file: !159, line: 342, column: 3)
!787 = !DILocation(line: 342, column: 15, scope: !785)
!788 = !DILocation(line: 342, column: 14, scope: !785)
!789 = !DILocation(line: 342, column: 3, scope: !785)
!790 = !DILocation(line: 343, column: 13, scope: !791)
!791 = distinct !DILexicalBlock(scope: !786, file: !159, line: 342, column: 32)
!792 = !DILocation(line: 343, column: 35, scope: !791)
!793 = !DILocation(line: 343, column: 5, scope: !791)
!794 = !DILocation(line: 346, column: 16, scope: !795)
!795 = distinct !DILexicalBlock(scope: !791, file: !159, line: 346, column: 9)
!796 = !DILocation(line: 346, column: 9, scope: !795)
!797 = !DILocation(line: 346, column: 30, scope: !795)
!798 = !DILocation(line: 346, column: 9, scope: !791)
!799 = !DILocation(line: 347, column: 70, scope: !795)
!800 = !DILocation(line: 347, column: 7, scope: !795)
!801 = !DILocation(line: 350, column: 16, scope: !802)
!802 = distinct !DILexicalBlock(scope: !791, file: !159, line: 350, column: 9)
!803 = !DILocation(line: 350, column: 9, scope: !802)
!804 = !DILocation(line: 350, column: 9, scope: !791)
!805 = !DILocation(line: 351, column: 14, scope: !802)
!806 = !DILocation(line: 351, column: 62, scope: !802)
!807 = !DILocation(line: 351, column: 7, scope: !808)
!808 = !DILexicalBlockFile(scope: !802, file: !159, discriminator: 1)
!809 = !DILocation(line: 351, column: 7, scope: !802)
!810 = !DILocation(line: 352, column: 3, scope: !791)
!811 = !DILocation(line: 342, column: 28, scope: !812)
!812 = !DILexicalBlockFile(scope: !786, file: !159, discriminator: 2)
!813 = !DILocation(line: 342, column: 3, scope: !812)
!814 = distinct !{!814, !815}
!815 = !DILocation(line: 342, column: 3, scope: !770)
!816 = !DILocation(line: 354, column: 17, scope: !770)
!817 = !DILocation(line: 354, column: 3, scope: !770)
!818 = !DILocation(line: 356, column: 13, scope: !770)
!819 = !DILocation(line: 357, column: 1, scope: !770)
!820 = distinct !DISubprogram(name: "modstatdb_shutdown", scope: !159, file: !159, line: 359, type: !261, isLocal: false, isDefinition: true, scopeLine: 359, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!821 = !DILocation(line: 360, column: 7, scope: !822)
!822 = distinct !DILexicalBlock(scope: !820, file: !159, line: 360, column: 7)
!823 = !DILocation(line: 360, column: 14, scope: !822)
!824 = !DILocation(line: 360, column: 7, scope: !820)
!825 = !DILocation(line: 361, column: 13, scope: !822)
!826 = !DILocation(line: 361, column: 5, scope: !822)
!827 = !DILocation(line: 363, column: 11, scope: !820)
!828 = !DILocation(line: 363, column: 3, scope: !820)
!829 = !DILocation(line: 365, column: 5, scope: !830)
!830 = distinct !DILexicalBlock(scope: !820, file: !159, line: 363, column: 20)
!831 = !DILocation(line: 367, column: 12, scope: !830)
!832 = !DILocation(line: 367, column: 5, scope: !830)
!833 = !DILocation(line: 368, column: 18, scope: !830)
!834 = !DILocation(line: 368, column: 11, scope: !830)
!835 = !DILocation(line: 369, column: 5, scope: !830)
!836 = !DILocation(line: 372, column: 5, scope: !830)
!837 = !DILocation(line: 374, column: 5, scope: !830)
!838 = !DILocation(line: 377, column: 3, scope: !820)
!839 = !DILocation(line: 379, column: 3, scope: !820)
!840 = !DILocation(line: 380, column: 1, scope: !820)
!841 = distinct !DISubprogram(name: "modstatdb_note", scope: !159, file: !159, line: 435, type: !842, isLocal: false, isDefinition: true, scopeLine: 435, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!842 = !DISubroutineType(types: !843)
!843 = !{null, !844}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64, align: 64)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !15, line: 195, size: 3072, align: 64, elements: !846)
!846 = !{!847, !894, !895, !896, !897, !898, !899, !900, !901, !902, !932, !933, !936, !945, !961, !962, !968, !1033, !1035, !1036}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !845, file: !15, line: 196, baseType: !848, size: 64, align: 64)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64, align: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !15, line: 242, size: 3392, align: 64, elements: !850)
!850 = !{!851, !852, !853, !854, !893}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !849, file: !15, line: 243, baseType: !848, size: 64, align: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !849, file: !15, line: 244, baseType: !245, size: 64, align: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !849, file: !15, line: 245, baseType: !845, size: 3072, align: 64, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !849, file: !15, line: 249, baseType: !855, size: 128, align: 64, offset: 3200)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !849, file: !15, line: 246, size: 128, align: 64, elements: !856)
!856 = !{!857, !892}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !855, file: !15, line: 247, baseType: !858, size: 64, align: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64, align: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !15, line: 63, size: 640, align: 64, elements: !860)
!860 = !{!861, !869, !870, !871, !872, !873, !882, !889, !890, !891}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !859, file: !15, line: 64, baseType: !862, size: 64, align: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64, align: 64)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !15, line: 56, size: 256, align: 64, elements: !864)
!864 = !{!865, !866, !867, !868}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !863, file: !15, line: 57, baseType: !844, size: 64, align: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !863, file: !15, line: 58, baseType: !862, size: 64, align: 64, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !863, file: !15, line: 59, baseType: !858, size: 64, align: 64, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !863, file: !15, line: 60, baseType: !46, size: 32, align: 32, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !859, file: !15, line: 65, baseType: !848, size: 64, align: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !859, file: !15, line: 66, baseType: !858, size: 64, align: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !859, file: !15, line: 66, baseType: !858, size: 64, align: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !859, file: !15, line: 66, baseType: !858, size: 64, align: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !859, file: !15, line: 67, baseType: !874, size: 64, align: 64, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64, align: 64)
!875 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !58, line: 48, size: 192, align: 64, elements: !877)
!877 = !{!878, !880, !881}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !876, file: !58, line: 49, baseType: !879, size: 64, align: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64, align: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !876, file: !58, line: 50, baseType: !245, size: 64, align: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !876, file: !58, line: 51, baseType: !57, size: 32, align: 32, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !859, file: !15, line: 68, baseType: !883, size: 192, align: 64, offset: 384)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !69, line: 42, size: 192, align: 64, elements: !884)
!884 = !{!885, !887, !888}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !883, file: !69, line: 44, baseType: !886, size: 32, align: 32)
!886 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !883, file: !69, line: 46, baseType: !245, size: 64, align: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !883, file: !69, line: 48, baseType: !245, size: 64, align: 64, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !859, file: !15, line: 69, baseType: !68, size: 32, align: 32, offset: 576)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !859, file: !15, line: 70, baseType: !160, size: 8, align: 8, offset: 608)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !859, file: !15, line: 71, baseType: !160, size: 8, align: 8, offset: 616)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !855, file: !15, line: 248, baseType: !858, size: 64, align: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !849, file: !15, line: 250, baseType: !175, size: 32, align: 32, offset: 3328)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !845, file: !15, line: 197, baseType: !844, size: 64, align: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !845, file: !15, line: 199, baseType: !77, size: 32, align: 32, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !845, file: !15, line: 201, baseType: !85, size: 32, align: 32, offset: 160)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !845, file: !15, line: 202, baseType: !89, size: 32, align: 32, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !845, file: !15, line: 203, baseType: !99, size: 32, align: 32, offset: 224)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !845, file: !15, line: 204, baseType: !245, size: 64, align: 64, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !845, file: !15, line: 205, baseType: !245, size: 64, align: 64, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !845, file: !15, line: 206, baseType: !883, size: 192, align: 64, offset: 384)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !845, file: !15, line: 207, baseType: !903, size: 960, align: 64, offset: 576)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !15, line: 107, size: 960, align: 64, elements: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !925}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !903, file: !15, line: 108, baseType: !862, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !903, file: !15, line: 110, baseType: !160, size: 8, align: 8, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !903, file: !15, line: 111, baseType: !109, size: 32, align: 32, offset: 96)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !903, file: !15, line: 112, baseType: !874, size: 64, align: 64, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !903, file: !15, line: 115, baseType: !245, size: 64, align: 64, offset: 192)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !903, file: !15, line: 116, baseType: !245, size: 64, align: 64, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !903, file: !15, line: 117, baseType: !245, size: 64, align: 64, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !903, file: !15, line: 118, baseType: !245, size: 64, align: 64, offset: 384)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !903, file: !15, line: 119, baseType: !245, size: 64, align: 64, offset: 448)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !903, file: !15, line: 120, baseType: !245, size: 64, align: 64, offset: 512)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !903, file: !15, line: 121, baseType: !245, size: 64, align: 64, offset: 576)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !903, file: !15, line: 122, baseType: !883, size: 192, align: 64, offset: 640)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !903, file: !15, line: 123, baseType: !918, size: 64, align: 64, offset: 832)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !15, line: 80, size: 256, align: 64, elements: !920)
!920 = !{!921, !922, !923, !924}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !919, file: !15, line: 81, baseType: !918, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !919, file: !15, line: 82, baseType: !245, size: 64, align: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !919, file: !15, line: 83, baseType: !245, size: 64, align: 64, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !919, file: !15, line: 84, baseType: !160, size: 8, align: 8, offset: 192)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !903, file: !15, line: 124, baseType: !926, size: 64, align: 64, offset: 896)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !15, line: 74, size: 192, align: 64, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !927, file: !15, line: 75, baseType: !926, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !927, file: !15, line: 76, baseType: !245, size: 64, align: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !927, file: !15, line: 77, baseType: !245, size: 64, align: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !845, file: !15, line: 208, baseType: !903, size: 960, align: 64, offset: 1536)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !845, file: !15, line: 209, baseType: !934, size: 64, align: 64, offset: 2496)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !15, line: 151, flags: DIFlagFwdDecl)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !845, file: !15, line: 211, baseType: !937, size: 64, align: 64, offset: 2560)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !15, line: 87, size: 320, align: 64, elements: !939)
!939 = !{!940, !941, !942, !943, !944}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !938, file: !15, line: 88, baseType: !937, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !938, file: !15, line: 89, baseType: !245, size: 64, align: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !938, file: !15, line: 90, baseType: !245, size: 64, align: 64, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !938, file: !15, line: 91, baseType: !245, size: 64, align: 64, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !938, file: !15, line: 92, baseType: !245, size: 64, align: 64, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !845, file: !15, line: 216, baseType: !946, size: 128, align: 64, offset: 2624)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !845, file: !15, line: 213, size: 128, align: 64, elements: !947)
!947 = !{!948, !960}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !946, file: !15, line: 215, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !15, line: 142, size: 320, align: 64, elements: !951)
!951 = !{!952, !953, !954, !955}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !950, file: !15, line: 143, baseType: !844, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !950, file: !15, line: 143, baseType: !844, size: 64, align: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !950, file: !15, line: 144, baseType: !949, size: 64, align: 64, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !950, file: !15, line: 147, baseType: !956, size: 128, align: 64, offset: 192)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !950, file: !15, line: 145, size: 128, align: 64, elements: !957)
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !956, file: !15, line: 146, baseType: !949, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !956, file: !15, line: 146, baseType: !949, size: 64, align: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !946, file: !15, line: 215, baseType: !949, size: 64, align: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !845, file: !15, line: 219, baseType: !949, size: 64, align: 64, offset: 2752)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !845, file: !15, line: 220, baseType: !963, size: 64, align: 64, offset: 2816)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !15, line: 134, size: 128, align: 64, elements: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !964, file: !15, line: 135, baseType: !963, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !964, file: !15, line: 136, baseType: !245, size: 64, align: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !845, file: !15, line: 231, baseType: !969, size: 64, align: 64, offset: 2880)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !121, line: 122, size: 128, align: 64, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !970, file: !121, line: 123, baseType: !969, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "namenode", scope: !970, file: !121, line: 124, baseType: !974, size: 64, align: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode", file: !121, line: 90, size: 640, align: 64, elements: !976)
!976 = !{!977, !978, !979, !982, !990, !1006, !1021, !1022, !1023, !1024}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !975, file: !121, line: 91, baseType: !974, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !975, file: !121, line: 92, baseType: !245, size: 64, align: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "packages", scope: !975, file: !121, line: 93, baseType: !980, size: 64, align: 64, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_list", file: !121, line: 93, flags: DIFlagFwdDecl)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "divert", scope: !975, file: !121, line: 94, baseType: !983, size: 64, align: 64, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_diversion", file: !121, line: 151, size: 256, align: 64, elements: !985)
!985 = !{!986, !987, !988, !989}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "useinstead", scope: !984, file: !121, line: 152, baseType: !974, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "camefrom", scope: !984, file: !121, line: 153, baseType: !974, size: 64, align: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "pkgset", scope: !984, file: !121, line: 154, baseType: !848, size: 64, align: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !984, file: !121, line: 157, baseType: !983, size: 64, align: 64, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "statoverride", scope: !975, file: !121, line: 101, baseType: !991, size: 64, align: 64, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !4, line: 40, size: 256, align: 64, elements: !993)
!993 = !{!994, !998, !1001, !1004, !1005}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !992, file: !4, line: 41, baseType: !995, size: 32, align: 32)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !996, line: 81, baseType: !997)
!996 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !200, line: 125, baseType: !886)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !992, file: !4, line: 42, baseType: !999, size: 32, align: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !996, line: 48, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !200, line: 126, baseType: !886)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !992, file: !4, line: 43, baseType: !1002, size: 32, align: 32, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !996, line: 62, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !200, line: 129, baseType: !886)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !992, file: !4, line: 47, baseType: !162, size: 64, align: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !992, file: !4, line: 48, baseType: !162, size: 64, align: 64, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "trig_interested", scope: !975, file: !121, line: 103, baseType: !1007, size: 64, align: 64, offset: 320)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigfileint", file: !116, line: 54, size: 448, align: 64, elements: !1009)
!1009 = !{!1010, !1011, !1013, !1014, !1015, !1016}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !1008, file: !116, line: 55, baseType: !844, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "pkgbin", scope: !1008, file: !116, line: 56, baseType: !1012, size: 64, align: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "fnn", scope: !1008, file: !116, line: 57, baseType: !974, size: 64, align: 64, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1008, file: !116, line: 58, baseType: !115, size: 32, align: 32, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "samefile_next", scope: !1008, file: !116, line: 59, baseType: !1007, size: 64, align: 64, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "inoverall", scope: !1008, file: !116, line: 62, baseType: !1017, size: 128, align: 64, offset: 320)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1008, file: !116, line: 60, size: 128, align: 64, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1017, file: !116, line: 61, baseType: !1007, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1017, file: !116, line: 61, baseType: !1007, size: 64, align: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !975, file: !121, line: 111, baseType: !120, size: 32, align: 32, offset: 384)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "oldhash", scope: !975, file: !121, line: 114, baseType: !245, size: 64, align: 64, offset: 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "newhash", scope: !975, file: !121, line: 117, baseType: !245, size: 64, align: 64, offset: 512)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "file_ondisk_id", scope: !975, file: !121, line: 119, baseType: !1025, size: 64, align: 64, offset: 576)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_ondisk_id", file: !121, line: 85, size: 128, align: 64, elements: !1027)
!1027 = !{!1028, !1031}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "id_dev", scope: !1026, file: !121, line: 86, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !996, line: 43, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !200, line: 124, baseType: !222)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "id_ino", scope: !1026, file: !121, line: 87, baseType: !1032, size: 64, align: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !996, line: 54, baseType: !580)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !845, file: !15, line: 232, baseType: !1034, size: 64, align: 64, offset: 2944)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !996, line: 73, baseType: !199)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !845, file: !15, line: 233, baseType: !160, size: 8, align: 8, offset: 3008)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !845, file: !15, line: 236, baseType: !160, size: 8, align: 8, offset: 3016)
!1037 = !DILocalVariable(name: "pkg", arg: 1, scope: !841, file: !159, line: 435, type: !844)
!1038 = !DILocation(line: 435, column: 37, scope: !841)
!1039 = !DILocalVariable(name: "ta", scope: !841, file: !159, line: 436, type: !949)
!1040 = !DILocation(line: 436, column: 18, scope: !841)
!1041 = !DILocation(line: 438, column: 14, scope: !841)
!1042 = !DILocation(line: 442, column: 7, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !841, file: !159, line: 442, column: 7)
!1044 = !DILocation(line: 442, column: 12, scope: !1043)
!1045 = !DILocation(line: 442, column: 19, scope: !1043)
!1046 = !DILocation(line: 442, column: 47, scope: !1043)
!1047 = !DILocation(line: 443, column: 7, scope: !1043)
!1048 = !DILocation(line: 443, column: 12, scope: !1043)
!1049 = !DILocation(line: 443, column: 19, scope: !1043)
!1050 = !DILocation(line: 442, column: 7, scope: !1051)
!1051 = !DILexicalBlockFile(scope: !841, file: !159, discriminator: 1)
!1052 = !DILocation(line: 444, column: 5, scope: !1043)
!1053 = !DILocation(line: 444, column: 10, scope: !1043)
!1054 = !DILocation(line: 444, column: 24, scope: !1043)
!1055 = !DILocation(line: 446, column: 7, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !841, file: !159, line: 446, column: 7)
!1057 = !DILocation(line: 446, column: 12, scope: !1056)
!1058 = !DILocation(line: 446, column: 19, scope: !1056)
!1059 = !DILocation(line: 446, column: 7, scope: !841)
!1060 = !DILocation(line: 447, column: 15, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !159, line: 447, column: 5)
!1062 = distinct !DILexicalBlock(scope: !1056, file: !159, line: 446, column: 44)
!1063 = !DILocation(line: 447, column: 20, scope: !1061)
!1064 = !DILocation(line: 447, column: 27, scope: !1061)
!1065 = !DILocation(line: 447, column: 13, scope: !1061)
!1066 = !DILocation(line: 447, column: 10, scope: !1061)
!1067 = !DILocation(line: 447, column: 33, scope: !1068)
!1068 = !DILexicalBlockFile(scope: !1069, file: !159, discriminator: 1)
!1069 = distinct !DILexicalBlock(scope: !1061, file: !159, line: 447, column: 5)
!1070 = !DILocation(line: 447, column: 5, scope: !1068)
!1071 = !DILocation(line: 448, column: 7, scope: !1069)
!1072 = !DILocation(line: 448, column: 11, scope: !1069)
!1073 = !DILocation(line: 448, column: 14, scope: !1069)
!1074 = !DILocation(line: 447, column: 42, scope: !1075)
!1075 = !DILexicalBlockFile(scope: !1069, file: !159, discriminator: 2)
!1076 = !DILocation(line: 447, column: 46, scope: !1075)
!1077 = !DILocation(line: 447, column: 53, scope: !1075)
!1078 = !DILocation(line: 447, column: 40, scope: !1075)
!1079 = !DILocation(line: 447, column: 5, scope: !1075)
!1080 = distinct !{!1080, !1081}
!1081 = !DILocation(line: 447, column: 5, scope: !1062)
!1082 = !DILocation(line: 449, column: 24, scope: !1062)
!1083 = !DILocation(line: 449, column: 29, scope: !1062)
!1084 = !DILocation(line: 449, column: 36, scope: !1062)
!1085 = !DILocation(line: 449, column: 41, scope: !1062)
!1086 = !DILocation(line: 449, column: 5, scope: !1062)
!1087 = !DILocation(line: 449, column: 10, scope: !1062)
!1088 = !DILocation(line: 449, column: 17, scope: !1062)
!1089 = !DILocation(line: 449, column: 22, scope: !1062)
!1090 = !DILocation(line: 450, column: 3, scope: !1062)
!1091 = !DILocation(line: 452, column: 7, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !841, file: !159, line: 452, column: 7)
!1093 = !DILocation(line: 452, column: 12, scope: !1092)
!1094 = !DILocation(line: 452, column: 7, scope: !841)
!1095 = !DILocation(line: 453, column: 52, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1092, file: !159, line: 452, column: 26)
!1097 = !DILocation(line: 453, column: 36, scope: !1096)
!1098 = !DILocation(line: 454, column: 26, scope: !1096)
!1099 = !DILocation(line: 454, column: 17, scope: !1096)
