; ModuleID = './[inter]lib--dpkg--ehandle.o.i'
source_filename = "./[inter]lib--dpkg--ehandle.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.error_context = type { %struct.error_context*, i32, %union.anon, %struct.anon, %struct.cleanup_entry*, i8* }
%union.anon = type { void ()* }
%struct.anon = type { void (i8*, i8*)*, i8* }
%struct.cleanup_entry = type { %struct.cleanup_entry*, [2 x %struct.anon.0], i32, i32, i32, [1 x i8*] }
%struct.anon.0 = type { i32, void (i32, i8**)* }
%struct.anon.1 = type { %struct.cleanup_entry, [20 x i8*], [4096 x i8] }
%struct.__jmp_buf_tag = type { [8 x i64], i32, %struct.__sigset_t }
%struct.__sigset_t = type { [16 x i64] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@onerr_abort = global i32 0, align 4
@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [20 x i8] c"%s%s:%s %s%s:%s %s\0A\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"\1B[1m\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"\1B[1;31m\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"dpkg\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !94, globals: !95)
!1 = !DIFile(filename: "[inter]lib--dpkg--ehandle.o.i", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 41, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../lib/dpkg/ehandle.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "ehflag_normaltidy", value: 1)
!7 = !DIEnumerator(name: "ehflag_bombout", value: 2)
!8 = !DIEnumerator(name: "ehflag_recursiveerror", value: 4)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !11, file: !10, line: 59, size: 32, align: 32, elements: !91)
!10 = !DIFile(filename: "ehandle.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "error_context", file: !10, line: 56, size: 448, align: 64, elements: !12)
!12 = !{!13, !15, !16, !52, !66, !89}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !11, file: !10, line: 57, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !11, file: !10, line: 62, baseType: !9, size: 32, align: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !11, file: !10, line: 67, baseType: !17, size: 64, align: 64, offset: 128)
!17 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !11, file: !10, line: 64, size: 64, align: 64, elements: !18)
!18 = !{!19, !24}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !17, file: !10, line: 65, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "error_handler_func", file: !4, line: 47, baseType: !22)
!22 = !DISubroutineType(types: !23)
!23 = !{null}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !17, file: !10, line: 66, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !27, line: 48, baseType: !28)
!27 = !DIFile(filename: "/usr/include/setjmp.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1600, align: 64, elements: !50)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !27, line: 34, size: 1600, align: 64, elements: !30)
!30 = !{!31, !38, !40}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !29, file: !27, line: 40, baseType: !32, size: 512, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !33, line: 31, baseType: !34)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 512, align: 64, elements: !36)
!35 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!36 = !{!37}
!37 = !DISubrange(count: 8)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !29, file: !27, line: 41, baseType: !39, size: 32, align: 32, offset: 512)
!39 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !29, file: !27, line: 42, baseType: !41, size: 1024, align: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !42, line: 30, baseType: !43)
!42 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !42, line: 27, size: 1024, align: 64, elements: !44)
!44 = !{!45}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !43, file: !42, line: 29, baseType: !46, size: 1024, align: 64)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 1024, align: 64, elements: !48)
!47 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!48 = !{!49}
!49 = !DISubrange(count: 16)
!50 = !{!51}
!51 = !DISubrange(count: 1)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "printer", scope: !11, file: !10, line: 72, baseType: !53, size: 128, align: 64, offset: 192)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !11, file: !10, line: 69, size: 128, align: 64, elements: !54)
!54 = !{!55, !65}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !53, file: !10, line: 70, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "error_printer_func", file: !4, line: 48, baseType: !58)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60, !63}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !53, file: !10, line: 71, baseType: !63, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "cleanups", scope: !11, file: !10, line: 74, baseType: !67, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cleanup_entry", file: !10, line: 45, size: 512, align: 64, elements: !69)
!69 = !{!70, !71, !84, !85, !86, !87}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !10, line: 46, baseType: !67, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !68, file: !10, line: 50, baseType: !72, size: 256, align: 64, offset: 64)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 256, align: 64, elements: !82)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !68, file: !10, line: 47, size: 128, align: 64, elements: !74)
!74 = !{!75, !76}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !73, file: !10, line: 48, baseType: !39, size: 32, align: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !73, file: !10, line: 49, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !39, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!82 = !{!83}
!83 = !DISubrange(count: 2)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "cpmask", scope: !68, file: !10, line: 51, baseType: !39, size: 32, align: 32, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "cpvalue", scope: !68, file: !10, line: 51, baseType: !39, size: 32, align: 32, offset: 352)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !68, file: !10, line: 52, baseType: !39, size: 32, align: 32, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !68, file: !10, line: 53, baseType: !88, size: 64, align: 64, offset: 448)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 64, align: 64, elements: !50)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "errmsg", scope: !11, file: !10, line: 76, baseType: !90, size: 64, align: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!91 = !{!92, !93}
!92 = !DIEnumerator(name: "HANDLER_TYPE_FUNC", value: 0)
!93 = !DIEnumerator(name: "HANDLER_TYPE_JUMP", value: 1)
!94 = !{!81, !39}
!95 = !{!96, !98, !110, !112}
!96 = distinct !DIGlobalVariable(name: "onerr_abort", scope: !0, file: !10, line: 41, type: !97, isLocal: false, isDefinition: true, variable: i32* @onerr_abort)
!97 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !39)
!98 = distinct !DIGlobalVariable(name: "emergency", scope: !0, file: !10, line: 102, type: !99, isLocal: true, isDefinition: true, variable: %struct.anon.1* @emergency)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 87, size: 34560, align: 64, elements: !100)
!100 = !{!101, !102, !106}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ce", scope: !99, file: !10, line: 88, baseType: !68, size: 512, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !99, file: !10, line: 89, baseType: !103, size: 1280, align: 64, offset: 512)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 1280, align: 64, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 20)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "errmsg", scope: !99, file: !10, line: 101, baseType: !107, size: 32768, align: 8, offset: 1792)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 32768, align: 8, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 4096)
!110 = distinct !DIGlobalVariable(name: "econtext", scope: !0, file: !10, line: 79, type: !111, isLocal: true, isDefinition: true, variable: %struct.error_context** @econtext)
!111 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !14)
!112 = distinct !DIGlobalVariable(name: "preventrecurse", scope: !113, file: !10, line: 258, type: !97, isLocal: true, isDefinition: true, variable: i32* @run_cleanups.preventrecurse)
!113 = distinct !DISubprogram(name: "run_cleanups", scope: !10, file: !10, line: 256, type: !114, isLocal: true, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !14, !39}
!116 = !{}
!117 = !{i32 2, !"Dwarf Version", i32 4}
!118 = !{i32 2, !"Debug Info Version", i32 3}
!119 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!120 = distinct !DISubprogram(name: "catch_fatal_error", scope: !10, file: !10, line: 111, type: !22, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!121 = !DILocation(line: 113, column: 3, scope: !120)
!122 = !DILocation(line: 114, column: 3, scope: !120)
!123 = !DILocation(line: 115, column: 1, scope: !120)
!124 = distinct !DISubprogram(name: "pop_error_context", scope: !10, file: !10, line: 405, type: !125, isLocal: false, isDefinition: true, scopeLine: 406, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !39}
!127 = !DILocalVariable(name: "flagset", arg: 1, scope: !124, file: !10, line: 405, type: !39)
!128 = !DIExpression()
!129 = !DILocation(line: 405, column: 23, scope: !124)
!130 = !DILocalVariable(name: "tecp", scope: !124, file: !10, line: 407, type: !14)
!131 = !DILocation(line: 407, column: 25, scope: !124)
!132 = !DILocation(line: 409, column: 10, scope: !124)
!133 = !DILocation(line: 409, column: 8, scope: !124)
!134 = !DILocation(line: 410, column: 14, scope: !124)
!135 = !DILocation(line: 410, column: 20, scope: !124)
!136 = !DILocation(line: 410, column: 12, scope: !124)
!137 = !DILocation(line: 413, column: 7, scope: !138)
!138 = distinct !DILexicalBlock(scope: !124, file: !10, line: 413, column: 7)
!139 = !DILocation(line: 413, column: 15, scope: !138)
!140 = !DILocation(line: 413, column: 7, scope: !124)
!141 = !DILocation(line: 414, column: 23, scope: !138)
!142 = !DILocation(line: 414, column: 5, scope: !138)
!143 = !DILocation(line: 415, column: 16, scope: !124)
!144 = !DILocation(line: 415, column: 22, scope: !124)
!145 = !DILocation(line: 415, column: 3, scope: !124)
!146 = !DILocation(line: 417, column: 29, scope: !124)
!147 = !DILocation(line: 417, column: 3, scope: !124)
!148 = !DILocation(line: 418, column: 8, scope: !124)
!149 = !DILocation(line: 418, column: 3, scope: !124)
!150 = !DILocation(line: 419, column: 1, scope: !124)
!151 = distinct !DISubprogram(name: "print_fatal_error", scope: !10, file: !10, line: 118, type: !58, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!152 = !DILocalVariable(name: "emsg", arg: 1, scope: !151, file: !10, line: 118, type: !60)
!153 = !DILocation(line: 118, column: 31, scope: !151)
!154 = !DILocalVariable(name: "data", arg: 2, scope: !151, file: !10, line: 118, type: !63)
!155 = !DILocation(line: 118, column: 49, scope: !151)
!156 = !DILocation(line: 120, column: 10, scope: !151)
!157 = !DILocation(line: 121, column: 11, scope: !151)
!158 = !DILocation(line: 121, column: 31, scope: !159)
!159 = !DILexicalBlockFile(scope: !151, file: !10, discriminator: 1)
!160 = !DILocation(line: 121, column: 52, scope: !161)
!161 = !DILexicalBlockFile(scope: !151, file: !10, discriminator: 2)
!162 = !DILocation(line: 122, column: 11, scope: !151)
!163 = !DILocation(line: 122, column: 34, scope: !159)
!164 = !DILocation(line: 122, column: 46, scope: !161)
!165 = !DILocation(line: 122, column: 61, scope: !151)
!166 = !DILocation(line: 120, column: 3, scope: !151)
!167 = !DILocation(line: 123, column: 1, scope: !151)
!168 = distinct !DISubprogram(name: "color_reset", scope: !169, file: !169, line: 78, type: !170, isLocal: true, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!169 = !DIFile(filename: "../../lib/dpkg/color.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!170 = !DISubroutineType(types: !171)
!171 = !{!60}
!172 = !DILocation(line: 80, column: 9, scope: !168)
!173 = !DILocation(line: 80, column: 2, scope: !168)
!174 = distinct !DISubprogram(name: "push_error_context_func", scope: !10, file: !10, line: 218, type: !175, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !20, !56, !63}
!177 = !DILocalVariable(name: "handler", arg: 1, scope: !174, file: !10, line: 218, type: !20)
!178 = !DILocation(line: 218, column: 45, scope: !174)
!179 = !DILocalVariable(name: "printer", arg: 2, scope: !174, file: !10, line: 219, type: !56)
!180 = !DILocation(line: 219, column: 45, scope: !174)
!181 = !DILocalVariable(name: "printer_data", arg: 3, scope: !174, file: !10, line: 220, type: !63)
!182 = !DILocation(line: 220, column: 37, scope: !174)
!183 = !DILocalVariable(name: "ec", scope: !174, file: !10, line: 222, type: !14)
!184 = !DILocation(line: 222, column: 25, scope: !174)
!185 = !DILocation(line: 224, column: 8, scope: !174)
!186 = !DILocation(line: 224, column: 6, scope: !174)
!187 = !DILocation(line: 225, column: 21, scope: !174)
!188 = !DILocation(line: 225, column: 25, scope: !174)
!189 = !DILocation(line: 225, column: 34, scope: !174)
!190 = !DILocation(line: 225, column: 3, scope: !174)
!191 = !DILocation(line: 226, column: 20, scope: !174)
!192 = !DILocation(line: 226, column: 24, scope: !174)
!193 = !DILocation(line: 226, column: 3, scope: !174)
!194 = !DILocation(line: 227, column: 15, scope: !174)
!195 = !DILocation(line: 228, column: 1, scope: !174)
!196 = distinct !DISubprogram(name: "error_context_new", scope: !10, file: !10, line: 134, type: !197, isLocal: true, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!197 = !DISubroutineType(types: !198)
!198 = !{!14}
!199 = !DILocalVariable(name: "necp", scope: !196, file: !10, line: 136, type: !14)
!200 = !DILocation(line: 136, column: 25, scope: !196)
!201 = !DILocation(line: 138, column: 10, scope: !196)
!202 = !DILocation(line: 138, column: 8, scope: !196)
!203 = !DILocation(line: 139, column: 8, scope: !204)
!204 = distinct !DILexicalBlock(scope: !196, file: !10, line: 139, column: 7)
!205 = !DILocation(line: 139, column: 7, scope: !196)
!206 = !DILocation(line: 140, column: 12, scope: !204)
!207 = !DILocation(line: 140, column: 5, scope: !208)
!208 = !DILexicalBlockFile(scope: !204, file: !10, discriminator: 1)
!209 = !DILocation(line: 140, column: 5, scope: !204)
!210 = !DILocation(line: 141, column: 15, scope: !196)
!211 = !DILocation(line: 141, column: 3, scope: !196)
!212 = !DILocation(line: 141, column: 9, scope: !196)
!213 = !DILocation(line: 141, column: 13, scope: !196)
!214 = !DILocation(line: 142, column: 3, scope: !196)
!215 = !DILocation(line: 142, column: 9, scope: !196)
!216 = !DILocation(line: 142, column: 17, scope: !196)
!217 = !DILocation(line: 143, column: 3, scope: !196)
!218 = !DILocation(line: 143, column: 9, scope: !196)
!219 = !DILocation(line: 143, column: 16, scope: !196)
!220 = !DILocation(line: 144, column: 13, scope: !196)
!221 = !DILocation(line: 144, column: 11, scope: !196)
!222 = !DILocation(line: 146, column: 10, scope: !196)
!223 = !DILocation(line: 146, column: 3, scope: !196)
!224 = distinct !DISubprogram(name: "set_error_printer", scope: !10, file: !10, line: 150, type: !225, isLocal: true, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !14, !56, !63}
!227 = !DILocalVariable(name: "ec", arg: 1, scope: !224, file: !10, line: 150, type: !14)
!228 = !DILocation(line: 150, column: 41, scope: !224)
!229 = !DILocalVariable(name: "func", arg: 2, scope: !224, file: !10, line: 150, type: !56)
!230 = !DILocation(line: 150, column: 65, scope: !224)
!231 = !DILocalVariable(name: "data", arg: 3, scope: !224, file: !10, line: 151, type: !63)
!232 = !DILocation(line: 151, column: 31, scope: !224)
!233 = !DILocation(line: 153, column: 22, scope: !224)
!234 = !DILocation(line: 153, column: 3, scope: !224)
!235 = !DILocation(line: 153, column: 7, scope: !224)
!236 = !DILocation(line: 153, column: 15, scope: !224)
!237 = !DILocation(line: 153, column: 20, scope: !224)
!238 = !DILocation(line: 154, column: 22, scope: !224)
!239 = !DILocation(line: 154, column: 3, scope: !224)
!240 = !DILocation(line: 154, column: 7, scope: !224)
!241 = !DILocation(line: 154, column: 15, scope: !224)
!242 = !DILocation(line: 154, column: 20, scope: !224)
!243 = !DILocation(line: 155, column: 1, scope: !224)
!244 = distinct !DISubprogram(name: "set_func_handler", scope: !10, file: !10, line: 158, type: !245, isLocal: true, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !14, !20}
!247 = !DILocalVariable(name: "ec", arg: 1, scope: !244, file: !10, line: 158, type: !14)
!248 = !DILocation(line: 158, column: 40, scope: !244)
!249 = !DILocalVariable(name: "func", arg: 2, scope: !244, file: !10, line: 158, type: !20)
!250 = !DILocation(line: 158, column: 64, scope: !244)
!251 = !DILocation(line: 160, column: 3, scope: !244)
!252 = !DILocation(line: 160, column: 7, scope: !244)
!253 = !DILocation(line: 160, column: 20, scope: !244)
!254 = !DILocation(line: 161, column: 22, scope: !244)
!255 = !DILocation(line: 161, column: 3, scope: !244)
!256 = !DILocation(line: 161, column: 7, scope: !244)
!257 = !DILocation(line: 161, column: 15, scope: !244)
!258 = !DILocation(line: 161, column: 20, scope: !244)
!259 = !DILocation(line: 162, column: 1, scope: !244)
!260 = distinct !DISubprogram(name: "push_error_context_jump", scope: !10, file: !10, line: 231, type: !261, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !25, !56, !63}
!263 = !DILocalVariable(name: "jumper", arg: 1, scope: !260, file: !10, line: 231, type: !25)
!264 = !DILocation(line: 231, column: 34, scope: !260)
!265 = !DILocalVariable(name: "printer", arg: 2, scope: !260, file: !10, line: 232, type: !56)
!266 = !DILocation(line: 232, column: 45, scope: !260)
!267 = !DILocalVariable(name: "printer_data", arg: 3, scope: !260, file: !10, line: 233, type: !63)
!268 = !DILocation(line: 233, column: 37, scope: !260)
!269 = !DILocalVariable(name: "ec", scope: !260, file: !10, line: 235, type: !14)
!270 = !DILocation(line: 235, column: 25, scope: !260)
!271 = !DILocation(line: 237, column: 8, scope: !260)
!272 = !DILocation(line: 237, column: 6, scope: !260)
!273 = !DILocation(line: 238, column: 21, scope: !260)
!274 = !DILocation(line: 238, column: 25, scope: !260)
!275 = !DILocation(line: 238, column: 34, scope: !260)
!276 = !DILocation(line: 238, column: 3, scope: !260)
!277 = !DILocation(line: 239, column: 20, scope: !260)
!278 = !DILocation(line: 239, column: 24, scope: !260)
!279 = !DILocation(line: 239, column: 3, scope: !260)
!280 = !DILocation(line: 240, column: 15, scope: !260)
!281 = !DILocation(line: 241, column: 1, scope: !260)
!282 = distinct !DISubprogram(name: "set_jump_handler", scope: !10, file: !10, line: 165, type: !283, isLocal: true, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !14, !25}
!285 = !DILocalVariable(name: "ec", arg: 1, scope: !282, file: !10, line: 165, type: !14)
!286 = !DILocation(line: 165, column: 40, scope: !282)
!287 = !DILocalVariable(name: "jump", arg: 2, scope: !282, file: !10, line: 165, type: !25)
!288 = !DILocation(line: 165, column: 53, scope: !282)
!289 = !DILocation(line: 167, column: 3, scope: !282)
!290 = !DILocation(line: 167, column: 7, scope: !282)
!291 = !DILocation(line: 167, column: 20, scope: !282)
!292 = !DILocation(line: 168, column: 22, scope: !282)
!293 = !DILocation(line: 168, column: 3, scope: !282)
!294 = !DILocation(line: 168, column: 7, scope: !282)
!295 = !DILocation(line: 168, column: 15, scope: !282)
!296 = !DILocation(line: 168, column: 20, scope: !282)
!297 = !DILocation(line: 169, column: 1, scope: !282)
!298 = distinct !DISubprogram(name: "push_error_context", scope: !10, file: !10, line: 244, type: !22, isLocal: false, isDefinition: true, scopeLine: 245, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!299 = !DILocation(line: 246, column: 3, scope: !298)
!300 = !DILocation(line: 247, column: 1, scope: !298)
!301 = distinct !DISubprogram(name: "push_checkpoint", scope: !10, file: !10, line: 310, type: !302, isLocal: false, isDefinition: true, scopeLine: 310, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !39, !39}
!304 = !DILocalVariable(name: "mask", arg: 1, scope: !301, file: !10, line: 310, type: !39)
!305 = !DILocation(line: 310, column: 26, scope: !301)
!306 = !DILocalVariable(name: "value", arg: 2, scope: !301, file: !10, line: 310, type: !39)
!307 = !DILocation(line: 310, column: 36, scope: !301)
!308 = !DILocalVariable(name: "cep", scope: !301, file: !10, line: 311, type: !67)
!309 = !DILocation(line: 311, column: 25, scope: !301)
!310 = !DILocalVariable(name: "i", scope: !301, file: !10, line: 312, type: !39)
!311 = !DILocation(line: 312, column: 7, scope: !301)
!312 = !DILocation(line: 314, column: 9, scope: !301)
!313 = !DILocation(line: 314, column: 7, scope: !301)
!314 = !DILocation(line: 315, column: 7, scope: !315)
!315 = distinct !DILexicalBlock(scope: !301, file: !10, line: 315, column: 7)
!316 = !DILocation(line: 315, column: 11, scope: !315)
!317 = !DILocation(line: 315, column: 7, scope: !301)
!318 = !DILocation(line: 316, column: 16, scope: !319)
!319 = distinct !DILexicalBlock(scope: !315, file: !10, line: 315, column: 19)
!320 = !DILocation(line: 317, column: 12, scope: !319)
!321 = !DILocation(line: 317, column: 5, scope: !322)
!322 = !DILexicalBlockFile(scope: !319, file: !10, discriminator: 1)
!323 = !DILocation(line: 317, column: 5, scope: !319)
!324 = !DILocation(line: 320, column: 9, scope: !325)
!325 = distinct !DILexicalBlock(scope: !301, file: !10, line: 320, column: 3)
!326 = !DILocation(line: 320, column: 8, scope: !325)
!327 = !DILocation(line: 320, column: 13, scope: !328)
!328 = !DILexicalBlockFile(scope: !329, file: !10, discriminator: 1)
!329 = distinct !DILexicalBlock(scope: !325, file: !10, line: 320, column: 3)
!330 = !DILocation(line: 320, column: 14, scope: !328)
!331 = !DILocation(line: 320, column: 3, scope: !328)
!332 = !DILocation(line: 320, column: 36, scope: !333)
!333 = !DILexicalBlockFile(scope: !334, file: !10, discriminator: 2)
!334 = distinct !DILexicalBlock(scope: !329, file: !10, line: 320, column: 23)
!335 = !DILocation(line: 320, column: 25, scope: !333)
!336 = !DILocation(line: 320, column: 30, scope: !333)
!337 = !DILocation(line: 320, column: 39, scope: !333)
!338 = !DILocation(line: 320, column: 43, scope: !333)
!339 = !DILocation(line: 320, column: 65, scope: !333)
!340 = !DILocation(line: 320, column: 54, scope: !333)
!341 = !DILocation(line: 320, column: 59, scope: !333)
!342 = !DILocation(line: 320, column: 68, scope: !333)
!343 = !DILocation(line: 320, column: 72, scope: !333)
!344 = !DILocation(line: 320, column: 76, scope: !333)
!345 = !DILocation(line: 320, column: 19, scope: !346)
!346 = !DILexicalBlockFile(scope: !329, file: !10, discriminator: 3)
!347 = !DILocation(line: 320, column: 3, scope: !346)
!348 = distinct !{!348, !349}
!349 = !DILocation(line: 320, column: 3, scope: !301)
!350 = !DILocation(line: 321, column: 16, scope: !301)
!351 = !DILocation(line: 321, column: 3, scope: !301)
!352 = !DILocation(line: 321, column: 8, scope: !301)
!353 = !DILocation(line: 321, column: 14, scope: !301)
!354 = !DILocation(line: 321, column: 36, scope: !301)
!355 = !DILocation(line: 321, column: 22, scope: !301)
!356 = !DILocation(line: 321, column: 27, scope: !301)
!357 = !DILocation(line: 321, column: 34, scope: !301)
!358 = !DILocation(line: 322, column: 3, scope: !301)
!359 = !DILocation(line: 322, column: 8, scope: !301)
!360 = !DILocation(line: 322, column: 12, scope: !301)
!361 = !DILocation(line: 322, column: 17, scope: !301)
!362 = !DILocation(line: 322, column: 22, scope: !301)
!363 = !DILocation(line: 322, column: 29, scope: !301)
!364 = !DILocation(line: 323, column: 14, scope: !301)
!365 = !DILocation(line: 323, column: 24, scope: !301)
!366 = !DILocation(line: 323, column: 3, scope: !301)
!367 = !DILocation(line: 323, column: 8, scope: !301)
!368 = !DILocation(line: 323, column: 12, scope: !301)
!369 = !DILocation(line: 324, column: 23, scope: !301)
!370 = !DILocation(line: 324, column: 3, scope: !301)
!371 = !DILocation(line: 324, column: 13, scope: !301)
!372 = !DILocation(line: 324, column: 21, scope: !301)
!373 = !DILocation(line: 325, column: 1, scope: !301)
!374 = distinct !DISubprogram(name: "ohshite", scope: !10, file: !10, line: 465, type: !375, isLocal: false, isDefinition: true, scopeLine: 465, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !60, null}
!377 = !DILocalVariable(name: "fmt", arg: 1, scope: !374, file: !10, line: 465, type: !60)
!378 = !DILocation(line: 465, column: 26, scope: !374)
!379 = !DILocalVariable(name: "e", scope: !374, file: !10, line: 466, type: !39)
!380 = !DILocation(line: 466, column: 7, scope: !374)
!381 = !DILocalVariable(name: "rc", scope: !374, file: !10, line: 466, type: !39)
!382 = !DILocation(line: 466, column: 10, scope: !374)
!383 = !DILocalVariable(name: "args", scope: !374, file: !10, line: 467, type: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !385, line: 98, baseType: !386)
!385 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !385, line: 40, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 369, baseType: !388)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 192, align: 64, elements: !50)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 369, size: 192, align: 64, elements: !390)
!390 = !{!391, !393, !394, !395}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !389, file: !1, line: 369, baseType: !392, size: 32, align: 32)
!392 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !389, file: !1, line: 369, baseType: !392, size: 32, align: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !389, file: !1, line: 369, baseType: !81, size: 64, align: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !389, file: !1, line: 369, baseType: !81, size: 64, align: 64, offset: 128)
!396 = !DILocation(line: 467, column: 11, scope: !374)
!397 = !DILocation(line: 469, column: 6, scope: !374)
!398 = !DILocation(line: 469, column: 5, scope: !374)
!399 = !DILocation(line: 469, column: 4, scope: !374)
!400 = !DILocation(line: 472, column: 2, scope: !374)
!401 = !DILocation(line: 473, column: 36, scope: !374)
!402 = !DILocation(line: 473, column: 41, scope: !374)
!403 = !DILocation(line: 473, column: 8, scope: !374)
!404 = !DILocation(line: 473, column: 6, scope: !374)
!405 = !DILocation(line: 474, column: 2, scope: !374)
!406 = !DILocation(line: 479, column: 7, scope: !407)
!407 = distinct !DILexicalBlock(scope: !374, file: !10, line: 479, column: 7)
!408 = !DILocation(line: 479, column: 10, scope: !407)
!409 = !DILocation(line: 479, column: 7, scope: !374)
!410 = !DILocalVariable(name: "errmsg", scope: !411, file: !10, line: 480, type: !90)
!411 = distinct !DILexicalBlock(scope: !407, file: !10, line: 479, column: 15)
!412 = !DILocation(line: 480, column: 11, scope: !411)
!413 = !DILocation(line: 482, column: 38, scope: !411)
!414 = !DILocation(line: 482, column: 48, scope: !411)
!415 = !DILocation(line: 482, column: 65, scope: !411)
!416 = !DILocation(line: 482, column: 56, scope: !411)
!417 = !DILocation(line: 482, column: 10, scope: !418)
!418 = !DILexicalBlockFile(scope: !411, file: !10, discriminator: 1)
!419 = !DILocation(line: 482, column: 8, scope: !411)
!420 = !DILocation(line: 483, column: 9, scope: !421)
!421 = distinct !DILexicalBlock(scope: !411, file: !10, line: 483, column: 9)
!422 = !DILocation(line: 483, column: 12, scope: !421)
!423 = !DILocation(line: 483, column: 9, scope: !411)
!424 = !DILocation(line: 484, column: 32, scope: !421)
!425 = !DILocation(line: 484, column: 42, scope: !421)
!426 = !DILocation(line: 484, column: 7, scope: !421)
!427 = !DILocation(line: 485, column: 3, scope: !411)
!428 = !DILocation(line: 487, column: 3, scope: !374)
!429 = !DILocation(line: 488, column: 1, scope: !374)
!430 = distinct !DISubprogram(name: "push_cleanup", scope: !10, file: !10, line: 366, type: !431, isLocal: false, isDefinition: true, scopeLine: 368, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !77, !39, !392, null}
!433 = !DILocalVariable(name: "call", arg: 1, scope: !430, file: !10, line: 366, type: !77)
!434 = !DILocation(line: 366, column: 21, scope: !430)
!435 = !DILocalVariable(name: "mask", arg: 2, scope: !430, file: !10, line: 366, type: !39)
!436 = !DILocation(line: 366, column: 55, scope: !430)
!437 = !DILocalVariable(name: "nargs", arg: 3, scope: !430, file: !10, line: 367, type: !392)
!438 = !DILocation(line: 367, column: 27, scope: !430)
!439 = !DILocalVariable(name: "args", scope: !430, file: !10, line: 369, type: !384)
!440 = !DILocation(line: 369, column: 11, scope: !430)
!441 = !DILocation(line: 371, column: 2, scope: !430)
!442 = !DILocation(line: 372, column: 21, scope: !430)
!443 = !DILocation(line: 372, column: 27, scope: !430)
!444 = !DILocation(line: 372, column: 41, scope: !430)
!445 = !DILocation(line: 372, column: 48, scope: !430)
!446 = !DILocation(line: 372, column: 3, scope: !430)
!447 = !DILocation(line: 373, column: 2, scope: !430)
!448 = !DILocation(line: 374, column: 1, scope: !430)
!449 = distinct !DISubprogram(name: "cleanup_entry_new", scope: !10, file: !10, line: 328, type: !450, isLocal: true, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !116)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !77, !39, !77, !39, !392, !452}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!453 = !DILocalVariable(name: "call1", arg: 1, scope: !449, file: !10, line: 328, type: !77)
!454 = !DILocation(line: 328, column: 26, scope: !449)
