; ModuleID = './[inter]lib--dpkg--file.o.i'
source_filename = "./[inter]lib--dpkg--file.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.varbuf = type { i64, i64, i8* }
%struct.dpkg_error = type { i32, i32, i8* }
%struct.flock = type { i16, i16, i64, i64, i32 }
%struct.pager = type opaque

@.str = private unnamed_addr constant [5 x i8] c"dpkg\00", align 1
@.str.1 = private unnamed_addr constant [36 x i8] c"unable to stat source file '%.250s'\00", align 1
@.str.2 = private unnamed_addr constant [51 x i8] c"unable to change ownership of target file '%.250s'\00", align 1
@.str.3 = private unnamed_addr constant [43 x i8] c"unable to set mode of target file '%.250s'\00", align 1
@.str.4 = private unnamed_addr constant [15 x i8] c"cannot open %s\00", align 1
@.str.5 = private unnamed_addr constant [7 x i8] c"file.c\00", align 1
@__func__.file_unlock = private unnamed_addr constant [12 x i8] c"file_unlock\00", align 1
@.str.6 = private unnamed_addr constant [21 x i8] c"%s (%s) fd is %d < 0\00", align 1
@.str.7 = private unnamed_addr constant [20 x i8] c"unable to unlock %s\00", align 1
@.str.8 = private unnamed_addr constant [38 x i8] c"unable to check file '%s' lock status\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !14)
!1 = !DIFile(filename: "[inter]lib--dpkg--file.o.i", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_msg_type", file: !4, line: 36, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../lib/dpkg/error.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "DPKG_MSG_NONE", value: 0)
!7 = !DIEnumerator(name: "DPKG_MSG_WARN", value: 1)
!8 = !DIEnumerator(name: "DPKG_MSG_ERROR", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "file_lock_flags", file: !10, line: 56, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "../../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!11 = !{!12, !13}
!12 = !DIEnumerator(name: "FILE_LOCK_NOWAIT", value: 0)
!13 = !DIEnumerator(name: "FILE_LOCK_WAIT", value: 1)
!14 = !{!15, !16}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !{i32 2, !"Dwarf Version", i32 4}
!19 = !{i32 2, !"Debug Info Version", i32 3}
!20 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!21 = distinct !DISubprogram(name: "file_copy_perms", scope: !22, file: !22, line: 46, type: !23, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!22 = !DIFile(filename: "file.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!23 = !DISubroutineType(types: !24)
!24 = !{null, !25, !25}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!28 = !{}
!29 = !DILocalVariable(name: "src", arg: 1, scope: !21, file: !22, line: 46, type: !25)
!30 = !DIExpression()
!31 = !DILocation(line: 46, column: 29, scope: !21)
!32 = !DILocalVariable(name: "dst", arg: 2, scope: !21, file: !22, line: 46, type: !25)
!33 = !DILocation(line: 46, column: 46, scope: !21)
!34 = !DILocalVariable(name: "stab", scope: !21, file: !22, line: 48, type: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !36, line: 46, size: 1152, align: 64, elements: !37)
!36 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!37 = !{!38, !42, !44, !46, !49, !51, !53, !54, !55, !58, !60, !62, !70, !71, !72}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !35, file: !36, line: 48, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !40, line: 124, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!41 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !35, file: !36, line: 53, baseType: !43, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !40, line: 127, baseType: !41)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !35, file: !36, line: 61, baseType: !45, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !40, line: 130, baseType: !41)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !35, file: !36, line: 62, baseType: !47, size: 32, align: 32, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !40, line: 129, baseType: !48)
!48 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !35, file: !36, line: 64, baseType: !50, size: 32, align: 32, offset: 224)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !40, line: 125, baseType: !48)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !35, file: !36, line: 65, baseType: !52, size: 32, align: 32, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !40, line: 126, baseType: !48)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !35, file: !36, line: 67, baseType: !17, size: 32, align: 32, offset: 288)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !35, file: !36, line: 69, baseType: !39, size: 64, align: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !35, file: !36, line: 74, baseType: !56, size: 64, align: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !40, line: 131, baseType: !57)
!57 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !35, file: !36, line: 78, baseType: !59, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !40, line: 153, baseType: !57)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !35, file: !36, line: 80, baseType: !61, size: 64, align: 64, offset: 512)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !40, line: 158, baseType: !57)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !35, file: !36, line: 91, baseType: !63, size: 128, align: 64, offset: 576)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !64, line: 120, size: 128, align: 64, elements: !65)
!64 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!65 = !{!66, !68}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !63, file: !64, line: 122, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !40, line: 139, baseType: !57)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !63, file: !64, line: 123, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !40, line: 175, baseType: !57)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !35, file: !36, line: 92, baseType: !63, size: 128, align: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !35, file: !36, line: 93, baseType: !63, size: 128, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !35, file: !36, line: 106, baseType: !73, size: 192, align: 64, offset: 960)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 192, align: 64, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 3)
!76 = !DILocation(line: 48, column: 14, scope: !21)
!77 = !DILocation(line: 50, column: 11, scope: !78)
!78 = distinct !DILexicalBlock(scope: !21, file: !22, line: 50, column: 6)
!79 = !DILocation(line: 50, column: 6, scope: !78)
!80 = !DILocation(line: 50, column: 23, scope: !78)
!81 = !DILocation(line: 50, column: 6, scope: !21)
!82 = !DILocation(line: 51, column: 8, scope: !83)
!83 = distinct !DILexicalBlock(scope: !84, file: !22, line: 51, column: 6)
!84 = distinct !DILexicalBlock(scope: !78, file: !22, line: 50, column: 30)
!85 = !DILocation(line: 51, column: 7, scope: !83)
!86 = !DILocation(line: 51, column: 12, scope: !83)
!87 = !DILocation(line: 51, column: 6, scope: !84)
!88 = !DILocation(line: 52, column: 4, scope: !83)
!89 = !DILocation(line: 53, column: 10, scope: !84)
!90 = !DILocation(line: 53, column: 52, scope: !84)
!91 = !DILocation(line: 53, column: 3, scope: !92)
!92 = !DILexicalBlockFile(scope: !84, file: !22, discriminator: 1)
!93 = !DILocation(line: 53, column: 3, scope: !84)
!94 = !DILocation(line: 56, column: 12, scope: !95)
!95 = distinct !DILexicalBlock(scope: !21, file: !22, line: 56, column: 6)
!96 = !DILocation(line: 56, column: 22, scope: !95)
!97 = !DILocation(line: 56, column: 35, scope: !95)
!98 = !DILocation(line: 56, column: 6, scope: !95)
!99 = !DILocation(line: 56, column: 43, scope: !95)
!100 = !DILocation(line: 56, column: 6, scope: !21)
!101 = !DILocation(line: 57, column: 10, scope: !95)
!102 = !DILocation(line: 58, column: 11, scope: !95)
!103 = !DILocation(line: 57, column: 3, scope: !104)
!104 = !DILexicalBlockFile(scope: !95, file: !22, discriminator: 1)
!105 = !DILocation(line: 57, column: 3, scope: !95)
!106 = !DILocation(line: 60, column: 12, scope: !107)
!107 = distinct !DILexicalBlock(scope: !21, file: !22, line: 60, column: 6)
!108 = !DILocation(line: 60, column: 23, scope: !107)
!109 = !DILocation(line: 60, column: 31, scope: !107)
!110 = !DILocation(line: 60, column: 6, scope: !107)
!111 = !DILocation(line: 60, column: 42, scope: !107)
!112 = !DILocation(line: 60, column: 6, scope: !21)
!113 = !DILocation(line: 61, column: 10, scope: !107)
!114 = !DILocation(line: 61, column: 59, scope: !107)
!115 = !DILocation(line: 61, column: 3, scope: !116)
!116 = !DILexicalBlockFile(scope: !107, file: !22, discriminator: 1)
!117 = !DILocation(line: 61, column: 3, scope: !107)
!118 = !DILocation(line: 62, column: 1, scope: !21)
!119 = distinct !DISubprogram(name: "file_slurp", scope: !22, file: !22, line: 89, type: !120, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!120 = !DISubroutineType(types: !121)
!121 = !{!17, !25, !122, !132}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !124, line: 55, size: 192, align: 64, elements: !125)
!124 = !DIFile(filename: "../../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!125 = !{!126, !129, !130}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !123, file: !124, line: 56, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !128, line: 216, baseType: !41)
!128 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !123, file: !124, line: 56, baseType: !127, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !123, file: !124, line: 57, baseType: !131, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_error", file: !4, line: 42, size: 128, align: 64, elements: !134)
!134 = !{!135, !136, !137}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !133, file: !4, line: 43, baseType: !3, size: 32, align: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "syserrno", scope: !133, file: !4, line: 45, baseType: !17, size: 32, align: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !133, file: !4, line: 46, baseType: !131, size: 64, align: 64, offset: 64)
!138 = !DILocalVariable(name: "filename", arg: 1, scope: !119, file: !22, line: 89, type: !25)
!139 = !DILocation(line: 89, column: 24, scope: !119)
!140 = !DILocalVariable(name: "vb", arg: 2, scope: !119, file: !22, line: 89, type: !122)
!141 = !DILocation(line: 89, column: 49, scope: !119)
!142 = !DILocalVariable(name: "err", arg: 3, scope: !119, file: !22, line: 89, type: !132)
!143 = !DILocation(line: 89, column: 72, scope: !119)
!144 = !DILocalVariable(name: "fd", scope: !119, file: !22, line: 91, type: !17)
!145 = !DILocation(line: 91, column: 6, scope: !119)
!146 = !DILocalVariable(name: "rc", scope: !119, file: !22, line: 92, type: !17)
!147 = !DILocation(line: 92, column: 6, scope: !119)
!148 = !DILocation(line: 94, column: 14, scope: !119)
!149 = !DILocation(line: 94, column: 2, scope: !119)
!150 = !DILocation(line: 96, column: 12, scope: !119)
!151 = !DILocation(line: 96, column: 7, scope: !119)
!152 = !DILocation(line: 96, column: 5, scope: !119)
!153 = !DILocation(line: 97, column: 6, scope: !154)
!154 = distinct !DILexicalBlock(scope: !119, file: !22, line: 97, column: 6)
!155 = !DILocation(line: 97, column: 9, scope: !154)
!156 = !DILocation(line: 97, column: 6, scope: !119)
!157 = !DILocation(line: 98, column: 25, scope: !154)
!158 = !DILocation(line: 98, column: 29, scope: !154)
!159 = !DILocation(line: 98, column: 50, scope: !154)
!160 = !DILocation(line: 98, column: 10, scope: !161)
!161 = !DILexicalBlockFile(scope: !154, file: !22, discriminator: 1)
!162 = !DILocation(line: 98, column: 3, scope: !154)
!163 = !DILocation(line: 100, column: 21, scope: !119)
!164 = !DILocation(line: 100, column: 25, scope: !119)
!165 = !DILocation(line: 100, column: 35, scope: !119)
!166 = !DILocation(line: 100, column: 39, scope: !119)
!167 = !DILocation(line: 100, column: 7, scope: !119)
!168 = !DILocation(line: 100, column: 5, scope: !119)
!169 = !DILocation(line: 102, column: 14, scope: !119)
!170 = !DILocation(line: 102, column: 8, scope: !119)
!171 = !DILocation(line: 104, column: 9, scope: !119)
!172 = !DILocation(line: 104, column: 2, scope: !119)
!173 = !DILocation(line: 105, column: 1, scope: !119)
!174 = distinct !DISubprogram(name: "file_slurp_fd", scope: !22, file: !22, line: 65, type: !175, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!175 = !DISubroutineType(types: !176)
!176 = !{!17, !17, !25, !122, !132}
!177 = !DILocalVariable(name: "fd", arg: 1, scope: !174, file: !22, line: 65, type: !17)
!178 = !DILocation(line: 65, column: 19, scope: !174)
!179 = !DILocalVariable(name: "filename", arg: 2, scope: !174, file: !22, line: 65, type: !25)
!180 = !DILocation(line: 65, column: 35, scope: !174)
!181 = !DILocalVariable(name: "vb", arg: 3, scope: !174, file: !22, line: 65, type: !122)
!182 = !DILocation(line: 65, column: 60, scope: !174)
!183 = !DILocalVariable(name: "err", arg: 4, scope: !174, file: !22, line: 66, type: !132)
!184 = !DILocation(line: 66, column: 34, scope: !174)
!185 = !DILocalVariable(name: "st", scope: !174, file: !22, line: 68, type: !35)
!186 = !DILocation(line: 68, column: 14, scope: !174)
!187 = !DILocation(line: 70, column: 12, scope: !188)
!188 = distinct !DILexicalBlock(scope: !174, file: !22, line: 70, column: 6)
!189 = !DILocation(line: 70, column: 6, scope: !188)
!190 = !DILocation(line: 70, column: 21, scope: !188)
!191 = !DILocation(line: 70, column: 6, scope: !174)
!192 = !DILocation(line: 71, column: 25, scope: !188)
!193 = !DILocation(line: 71, column: 29, scope: !188)
!194 = !DILocation(line: 71, column: 50, scope: !188)
!195 = !DILocation(line: 71, column: 10, scope: !196)
!196 = !DILexicalBlockFile(scope: !188, file: !22, discriminator: 1)
!197 = !DILocation(line: 71, column: 3, scope: !188)
!198 = !DILocation(line: 73, column: 9, scope: !199)
!199 = distinct !DILexicalBlock(scope: !174, file: !22, line: 73, column: 6)
!200 = !DILocation(line: 73, column: 20, scope: !199)
!201 = !DILocation(line: 73, column: 6, scope: !174)
!202 = !DILocation(line: 74, column: 25, scope: !199)
!203 = !DILocation(line: 74, column: 29, scope: !199)
!204 = !DILocation(line: 75, column: 25, scope: !199)
!205 = !DILocation(line: 74, column: 10, scope: !206)
!206 = !DILexicalBlockFile(scope: !199, file: !22, discriminator: 1)
!207 = !DILocation(line: 74, column: 3, scope: !199)
!208 = !DILocation(line: 77, column: 9, scope: !209)
!209 = distinct !DILexicalBlock(scope: !174, file: !22, line: 77, column: 6)
!210 = !DILocation(line: 77, column: 17, scope: !209)
!211 = !DILocation(line: 77, column: 6, scope: !174)
!212 = !DILocation(line: 78, column: 3, scope: !209)
!213 = !DILocation(line: 80, column: 14, scope: !174)
!214 = !DILocation(line: 80, column: 21, scope: !174)
!215 = !DILocation(line: 80, column: 2, scope: !174)
!216 = !DILocation(line: 81, column: 14, scope: !217)
!217 = distinct !DILexicalBlock(scope: !174, file: !22, line: 81, column: 6)
!218 = !DILocation(line: 81, column: 18, scope: !217)
!219 = !DILocation(line: 81, column: 22, scope: !217)
!220 = !DILocation(line: 81, column: 30, scope: !217)
!221 = !DILocation(line: 81, column: 6, scope: !217)
!222 = !DILocation(line: 81, column: 39, scope: !217)
!223 = !DILocation(line: 81, column: 6, scope: !174)
!224 = !DILocation(line: 82, column: 25, scope: !217)
!225 = !DILocation(line: 82, column: 29, scope: !217)
!226 = !DILocation(line: 82, column: 50, scope: !217)
!227 = !DILocation(line: 82, column: 10, scope: !228)
!228 = !DILexicalBlockFile(scope: !217, file: !22, discriminator: 1)
!229 = !DILocation(line: 82, column: 3, scope: !217)
!230 = !DILocation(line: 83, column: 16, scope: !174)
!231 = !DILocation(line: 83, column: 2, scope: !174)
!232 = !DILocation(line: 83, column: 6, scope: !174)
!233 = !DILocation(line: 83, column: 11, scope: !174)
!234 = !DILocation(line: 85, column: 2, scope: !174)
!235 = !DILocation(line: 86, column: 1, scope: !174)
!236 = distinct !DISubprogram(name: "file_unlock", scope: !22, file: !22, line: 121, type: !237, isLocal: false, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !17, !25, !25}
!239 = !DILocalVariable(name: "lockfd", arg: 1, scope: !236, file: !22, line: 121, type: !17)
!240 = !DILocation(line: 121, column: 17, scope: !236)
!241 = !DILocalVariable(name: "lockfile", arg: 2, scope: !236, file: !22, line: 121, type: !25)
!242 = !DILocation(line: 121, column: 37, scope: !236)
!243 = !DILocalVariable(name: "lockdesc", arg: 3, scope: !236, file: !22, line: 121, type: !25)
!244 = !DILocation(line: 121, column: 59, scope: !236)
!245 = !DILocalVariable(name: "fl", scope: !236, file: !22, line: 123, type: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flock", file: !247, line: 35, size: 256, align: 64, elements: !248)
!247 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/fcntl.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!248 = !{!249, !251, !252, !253, !254}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "l_type", scope: !246, file: !247, line: 37, baseType: !250, size: 16, align: 16)
!250 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "l_whence", scope: !246, file: !247, line: 38, baseType: !250, size: 16, align: 16, offset: 16)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "l_start", scope: !246, file: !247, line: 40, baseType: !56, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "l_len", scope: !246, file: !247, line: 41, baseType: !56, size: 64, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "l_pid", scope: !246, file: !247, line: 46, baseType: !255, size: 32, align: 32, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !40, line: 133, baseType: !17)
!256 = !DILocation(line: 123, column: 15, scope: !236)
!257 = !DILocation(line: 125, column: 6, scope: !258)
!258 = distinct !DILexicalBlock(scope: !236, file: !22, line: 125, column: 6)
!259 = !DILocation(line: 125, column: 13, scope: !258)
!260 = !DILocation(line: 125, column: 6, scope: !236)
!261 = !DILocation(line: 126, column: 65, scope: !258)
!262 = !DILocation(line: 126, column: 75, scope: !258)
!263 = !DILocation(line: 126, column: 85, scope: !258)
!264 = !DILocation(line: 126, column: 3, scope: !258)
!265 = !DILocation(line: 128, column: 2, scope: !236)
!266 = !DILocation(line: 130, column: 12, scope: !267)
!267 = distinct !DILexicalBlock(scope: !236, file: !22, line: 130, column: 6)
!268 = !DILocation(line: 130, column: 6, scope: !267)
!269 = !DILocation(line: 130, column: 33, scope: !267)
!270 = !DILocation(line: 130, column: 6, scope: !236)
!271 = !DILocation(line: 131, column: 10, scope: !267)
!272 = !DILocation(line: 131, column: 36, scope: !267)
!273 = !DILocation(line: 131, column: 3, scope: !274)
!274 = !DILexicalBlockFile(scope: !267, file: !22, discriminator: 1)
!275 = !DILocation(line: 131, column: 3, scope: !267)
!276 = !DILocation(line: 132, column: 1, scope: !236)
!277 = distinct !DISubprogram(name: "file_lock_setup", scope: !22, file: !22, line: 108, type: !278, isLocal: true, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !280, !250}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!281 = !DILocalVariable(name: "fl", arg: 1, scope: !277, file: !22, line: 108, type: !280)
!282 = !DILocation(line: 108, column: 31, scope: !277)
!283 = !DILocalVariable(name: "type", arg: 2, scope: !277, file: !22, line: 108, type: !250)
!284 = !DILocation(line: 108, column: 41, scope: !277)
!285 = !DILocation(line: 110, column: 15, scope: !277)
!286 = !DILocation(line: 110, column: 2, scope: !277)
!287 = !DILocation(line: 110, column: 6, scope: !277)
!288 = !DILocation(line: 110, column: 13, scope: !277)
!289 = !DILocation(line: 111, column: 2, scope: !277)
!290 = !DILocation(line: 111, column: 6, scope: !277)
!291 = !DILocation(line: 111, column: 15, scope: !277)
!292 = !DILocation(line: 112, column: 2, scope: !277)
!293 = !DILocation(line: 112, column: 6, scope: !277)
!294 = !DILocation(line: 112, column: 14, scope: !277)
!295 = !DILocation(line: 113, column: 2, scope: !277)
!296 = !DILocation(line: 113, column: 6, scope: !277)
!297 = !DILocation(line: 113, column: 12, scope: !277)
!298 = !DILocation(line: 114, column: 2, scope: !277)
!299 = !DILocation(line: 114, column: 6, scope: !277)
!300 = !DILocation(line: 114, column: 12, scope: !277)
!301 = !DILocation(line: 115, column: 1, scope: !277)
!302 = distinct !DISubprogram(name: "file_is_locked", scope: !22, file: !22, line: 151, type: !303, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !28)
!303 = !DISubroutineType(types: !304)
!304 = !{!305, !17, !25}
!305 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!306 = !DILocalVariable(name: "lockfd", arg: 1, scope: !302, file: !22, line: 151, type: !17)
!307 = !DILocation(line: 151, column: 20, scope: !302)
!308 = !DILocalVariable(name: "filename", arg: 2, scope: !302, file: !22, line: 151, type: !25)
!309 = !DILocation(line: 151, column: 40, scope: !302)
!310 = !DILocalVariable(name: "fl", scope: !302, file: !22, line: 153, type: !246)
!311 = !DILocation(line: 153, column: 15, scope: !302)
!312 = !DILocation(line: 155, column: 2, scope: !302)
!313 = !DILocation(line: 157, column: 12, scope: !314)
!314 = distinct !DILexicalBlock(scope: !302, file: !22, line: 157, column: 6)
