; ModuleID = './[inter]lib--dpkg--path-remove.o.i'
source_filename = "./[inter]lib--dpkg--path-remove.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [28 x i8] c"secure_remove '%s' rmdir OK\00", align 1
@.str.1 = private unnamed_addr constant [28 x i8] c"secure_remove '%s' rmdir %s\00", align 1
@.str.2 = private unnamed_addr constant [29 x i8] c"secure_remove '%s' unlink %s\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"OK\00", align 1
@.str.4 = private unnamed_addr constant [14 x i8] c"path-remove.c\00", align 1
@__func__.path_remove_tree = private unnamed_addr constant [17 x i8] c"path_remove_tree\00", align 1
@.str.5 = private unnamed_addr constant [33 x i8] c"pathname '%s' reduces to nothing\00", align 1
@.str.6 = private unnamed_addr constant [8 x i8] c"%s '%s'\00", align 1
@.str.7 = private unnamed_addr constant [5 x i8] c"dpkg\00", align 1
@.str.8 = private unnamed_addr constant [35 x i8] c"unable to securely remove '%.255s'\00", align 1
@.str.9 = private unnamed_addr constant [3 x i8] c"rm\00", align 1
@.str.10 = private unnamed_addr constant [4 x i8] c"-rf\00", align 1
@.str.11 = private unnamed_addr constant [3 x i8] c"--\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19)
!1 = !DIFile(filename: "[inter]lib--dpkg--path-remove.o.i", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "debugflags", file: !4, line: 41, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../lib/dpkg/debug.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!6 = !DIEnumerator(name: "dbg_general", value: 1)
!7 = !DIEnumerator(name: "dbg_scripts", value: 2)
!8 = !DIEnumerator(name: "dbg_eachfile", value: 8)
!9 = !DIEnumerator(name: "dbg_eachfiledetail", value: 64)
!10 = !DIEnumerator(name: "dbg_conff", value: 16)
!11 = !DIEnumerator(name: "dbg_conffdetail", value: 128)
!12 = !DIEnumerator(name: "dbg_depcon", value: 32)
!13 = !DIEnumerator(name: "dbg_depcondetail", value: 256)
!14 = !DIEnumerator(name: "dbg_veryverbose", value: 512)
!15 = !DIEnumerator(name: "dbg_stupidlyverbose", value: 1024)
!16 = !DIEnumerator(name: "dbg_triggers", value: 4096)
!17 = !DIEnumerator(name: "dbg_triggersdetail", value: 8192)
!18 = !DIEnumerator(name: "dbg_triggersstupid", value: 16384)
!19 = !{!20}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!21 = !{i32 2, !"Dwarf Version", i32 4}
!22 = !{i32 2, !"Debug Info Version", i32 3}
!23 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!24 = distinct !DISubprogram(name: "secure_unlink_statted", scope: !25, file: !25, line: 38, type: !26, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !75)
!25 = !DIFile(filename: "path-remove.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !29, !32}
!28 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !35, line: 46, size: 1152, align: 64, elements: !36)
!35 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!36 = !{!37, !41, !43, !45, !48, !50, !52, !53, !54, !57, !59, !61, !69, !70, !71}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !34, file: !35, line: 48, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !39, line: 124, baseType: !40)
!39 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!40 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !34, file: !35, line: 53, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !39, line: 127, baseType: !40)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !34, file: !35, line: 61, baseType: !44, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !39, line: 130, baseType: !40)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !34, file: !35, line: 62, baseType: !46, size: 32, align: 32, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !39, line: 129, baseType: !47)
!47 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !34, file: !35, line: 64, baseType: !49, size: 32, align: 32, offset: 224)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !39, line: 125, baseType: !47)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !34, file: !35, line: 65, baseType: !51, size: 32, align: 32, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !39, line: 126, baseType: !47)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !34, file: !35, line: 67, baseType: !28, size: 32, align: 32, offset: 288)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !34, file: !35, line: 69, baseType: !38, size: 64, align: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !34, file: !35, line: 74, baseType: !55, size: 64, align: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !39, line: 131, baseType: !56)
!56 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !34, file: !35, line: 78, baseType: !58, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !39, line: 153, baseType: !56)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !34, file: !35, line: 80, baseType: !60, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !39, line: 158, baseType: !56)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !34, file: !35, line: 91, baseType: !62, size: 128, align: 64, offset: 576)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !63, line: 120, size: 128, align: 64, elements: !64)
!63 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!64 = !{!65, !67}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !62, file: !63, line: 122, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !39, line: 139, baseType: !56)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !62, file: !63, line: 123, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !39, line: 175, baseType: !56)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !34, file: !35, line: 92, baseType: !62, size: 128, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !34, file: !35, line: 93, baseType: !62, size: 128, align: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !34, file: !35, line: 106, baseType: !72, size: 192, align: 64, offset: 960)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 192, align: 64, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 3)
!75 = !{}
!76 = !DILocalVariable(name: "pathname", arg: 1, scope: !24, file: !25, line: 38, type: !29)
!77 = !DIExpression()
!78 = !DILocation(line: 38, column: 35, scope: !24)
!79 = !DILocalVariable(name: "stab", arg: 2, scope: !24, file: !25, line: 38, type: !32)
!80 = !DILocation(line: 38, column: 64, scope: !24)
!81 = !DILocation(line: 40, column: 5, scope: !82)
!82 = distinct !DILexicalBlock(scope: !24, file: !25, line: 40, column: 5)
!83 = !DILocation(line: 40, column: 11, scope: !82)
!84 = !DILocation(line: 40, column: 8, scope: !82)
!85 = !DILocation(line: 40, column: 19, scope: !82)
!86 = !DILocation(line: 40, column: 5, scope: !24)
!87 = !DILocation(line: 40, column: 31, scope: !88)
!88 = !DILexicalBlockFile(scope: !82, file: !25, discriminator: 1)
!89 = !DILocation(line: 40, column: 37, scope: !88)
!90 = !DILocation(line: 40, column: 45, scope: !88)
!91 = !DILocation(line: 40, column: 5, scope: !88)
!92 = !DILocation(line: 41, column: 7, scope: !82)
!93 = !DILocation(line: 41, column: 13, scope: !82)
!94 = !DILocation(line: 41, column: 10, scope: !82)
!95 = !DILocation(line: 41, column: 21, scope: !82)
!96 = !DILocation(line: 41, column: 30, scope: !82)
!97 = !DILocation(line: 41, column: 33, scope: !88)
!98 = !DILocation(line: 41, column: 39, scope: !88)
!99 = !DILocation(line: 41, column: 36, scope: !88)
!100 = !DILocation(line: 41, column: 47, scope: !88)
!101 = !DILocation(line: 41, column: 56, scope: !88)
!102 = !DILocation(line: 42, column: 7, scope: !82)
!103 = !DILocation(line: 42, column: 13, scope: !82)
!104 = !DILocation(line: 42, column: 10, scope: !82)
!105 = !DILocation(line: 42, column: 21, scope: !82)
!106 = !DILocation(line: 42, column: 31, scope: !82)
!107 = !DILocation(line: 42, column: 34, scope: !88)
!108 = !DILocation(line: 42, column: 40, scope: !88)
!109 = !DILocation(line: 42, column: 37, scope: !88)
!110 = !DILocation(line: 42, column: 48, scope: !88)
!111 = !DILocation(line: 42, column: 31, scope: !88)
!112 = !DILocation(line: 41, column: 6, scope: !113)
!113 = !DILexicalBlockFile(scope: !82, file: !25, discriminator: 2)
!114 = !DILocation(line: 40, column: 5, scope: !115)
!115 = !DILexicalBlockFile(scope: !24, file: !25, discriminator: 2)
!116 = !DILocation(line: 43, column: 13, scope: !117)
!117 = distinct !DILexicalBlock(scope: !118, file: !25, line: 43, column: 7)
!118 = distinct !DILexicalBlock(scope: !82, file: !25, line: 42, column: 60)
!119 = !DILocation(line: 43, column: 7, scope: !117)
!120 = !DILocation(line: 43, column: 7, scope: !118)
!121 = !DILocation(line: 44, column: 4, scope: !117)
!122 = !DILocation(line: 45, column: 2, scope: !118)
!123 = !DILocation(line: 47, column: 13, scope: !124)
!124 = distinct !DILexicalBlock(scope: !24, file: !25, line: 47, column: 6)
!125 = !DILocation(line: 47, column: 6, scope: !124)
!126 = !DILocation(line: 47, column: 6, scope: !24)
!127 = !DILocation(line: 48, column: 3, scope: !124)
!128 = !DILocation(line: 50, column: 2, scope: !24)
!129 = !DILocation(line: 51, column: 1, scope: !24)
!130 = distinct !DISubprogram(name: "secure_unlink", scope: !25, file: !25, line: 65, type: !131, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !75)
!131 = !DISubroutineType(types: !132)
!132 = !{!28, !29}
!133 = !DILocalVariable(name: "pathname", arg: 1, scope: !130, file: !25, line: 65, type: !29)
!134 = !DILocation(line: 65, column: 27, scope: !130)
!135 = !DILocalVariable(name: "stab", scope: !130, file: !25, line: 67, type: !34)
!136 = !DILocation(line: 67, column: 14, scope: !130)
!137 = !DILocation(line: 69, column: 12, scope: !138)
!138 = distinct !DILexicalBlock(scope: !130, file: !25, line: 69, column: 6)
