; ModuleID = './[inter]lib--dpkg--trigdeferred.o.i'
source_filename = "./[inter]lib--dpkg--trigdeferred.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.varbuf = type { i64, i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.trigdefmeths = type { void (i8*)*, void (i8*)*, void ()* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [9 x i8] c"triggers\00", align 1
@triggersdir = internal global i8* null, align 8
@fn = internal global %struct.varbuf zeroinitializer, align 8
@.str.1 = private unnamed_addr constant [5 x i8] c"Lock\00", align 1
@lock_fd = internal global i32 -1, align 4
@.str.2 = private unnamed_addr constant [5 x i8] c"dpkg\00", align 1
@.str.3 = private unnamed_addr constant [50 x i8] c"unable to open/create triggers lock file '%.250s'\00", align 1
@.str.4 = private unnamed_addr constant [23 x i8] c"triggers database lock\00", align 1
@.str.5 = private unnamed_addr constant [9 x i8] c"Unincorp\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !40)
!1 = !DIFile(filename: "[inter]lib--dpkg--trigdeferred.o.i", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!2 = !{!3, !11, !18, !23, !29}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "trigdef_update_status", file: !4, line: 45, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../lib/dpkg/trigdeferred.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "TDUS_ERROR_NO_DIR", value: -1)
!7 = !DIEnumerator(name: "TDUS_ERROR_EMPTY_DEFERRED", value: -2)
!8 = !DIEnumerator(name: "TDUS_ERROR_NO_DEFERRED", value: -3)
!9 = !DIEnumerator(name: "TDUS_NO_DEFERRED", value: 1)
!10 = !DIEnumerator(name: "TDUS_OK", value: 2)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "trigdef_update_flags", file: !4, line: 36, size: 32, align: 32, elements: !12)
!12 = !{!13, !14, !15, !16, !17}
!13 = !DIEnumerator(name: "TDUF_NO_LOCK_OK", value: 1)
!14 = !DIEnumerator(name: "TDUF_WRITE", value: 2)
!15 = !DIEnumerator(name: "TDUF_NO_LOCK", value: 3)
!16 = !DIEnumerator(name: "TDUF_WRITE_IF_EMPTY", value: 8)
!17 = !DIEnumerator(name: "TDUF_WRITE_IF_ENOENT", value: 16)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "file_lock_flags", file: !19, line: 56, size: 32, align: 32, elements: !20)
!19 = !DIFile(filename: "../../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!20 = !{!21, !22}
!21 = !DIEnumerator(name: "FILE_LOCK_NOWAIT", value: 0)
!22 = !DIEnumerator(name: "FILE_LOCK_WAIT", value: 1)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !24, line: 41, size: 32, align: 32, elements: !25)
!24 = !DIFile(filename: "../../lib/dpkg/ehandle.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "ehflag_normaltidy", value: 1)
!27 = !DIEnumerator(name: "ehflag_bombout", value: 2)
!28 = !DIEnumerator(name: "ehflag_recursiveerror", value: 4)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_ctype_bit", file: !30, line: 32, size: 32, align: 32, elements: !31)
!30 = !DIFile(filename: "../../lib/dpkg/c-ctype.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39}
!32 = !DIEnumerator(name: "C_CTYPE_BLANK", value: 1)
!33 = !DIEnumerator(name: "C_CTYPE_WHITE", value: 2)
!34 = !DIEnumerator(name: "C_CTYPE_SPACE", value: 4)
!35 = !DIEnumerator(name: "C_CTYPE_UPPER", value: 8)
!36 = !DIEnumerator(name: "C_CTYPE_LOWER", value: 16)
!37 = !DIEnumerator(name: "C_CTYPE_DIGIT", value: 32)
!38 = !DIEnumerator(name: "C_CTYPE_ALPHA", value: 24)
!39 = !DIEnumerator(name: "C_CTYPE_ALNUM", value: 56)
!40 = !{!41, !54, !55, !71, !72, !131, !132}
!41 = distinct !DIGlobalVariable(name: "fn", scope: !0, file: !42, line: 42, type: !43, isLocal: true, isDefinition: true, variable: %struct.varbuf* @fn)
!42 = !DIFile(filename: "trigdeferred.c", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !44, line: 55, size: 192, align: 64, elements: !45)
!44 = !DIFile(filename: "../../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!45 = !{!46, !50, !51}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !43, file: !44, line: 56, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 216, baseType: !49)
!48 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!49 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !43, file: !44, line: 56, baseType: !47, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !43, file: !44, line: 57, baseType: !52, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!54 = distinct !DIGlobalVariable(name: "newfn", scope: !0, file: !42, line: 42, type: !43, isLocal: true, isDefinition: true, variable: %struct.varbuf* @newfn)
!55 = distinct !DIGlobalVariable(name: "trigdef", scope: !0, file: !42, line: 44, type: !56, isLocal: true, isDefinition: true, variable: %struct.trigdefmeths** @trigdef)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigdefmeths", file: !4, line: 53, size: 192, align: 64, elements: !59)
!59 = !{!60, !66, !67}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "trig_begin", scope: !58, file: !4, line: 54, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !64}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !58, file: !4, line: 55, baseType: !61, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "trig_end", scope: !58, file: !4, line: 56, baseType: !68, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null}
!71 = distinct !DIGlobalVariable(name: "triggersdir", scope: !0, file: !42, line: 48, type: !52, isLocal: true, isDefinition: true, variable: i8** @triggersdir)
!72 = distinct !DIGlobalVariable(name: "old_deferred", scope: !0, file: !42, line: 50, type: !73, isLocal: true, isDefinition: true, variable: %struct._IO_FILE** @old_deferred)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !75, line: 48, baseType: !76)
!75 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !77, line: 241, size: 1728, align: 64, elements: !78)
!77 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!78 = !{!79, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !100, !101, !102, !103, !107, !109, !111, !115, !118, !120, !122, !123, !124, !125, !126, !127}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !76, file: !77, line: 242, baseType: !80, size: 32, align: 32)
!80 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !76, file: !77, line: 247, baseType: !52, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !76, file: !77, line: 248, baseType: !52, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !76, file: !77, line: 249, baseType: !52, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !76, file: !77, line: 250, baseType: !52, size: 64, align: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !76, file: !77, line: 251, baseType: !52, size: 64, align: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !76, file: !77, line: 252, baseType: !52, size: 64, align: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !76, file: !77, line: 253, baseType: !52, size: 64, align: 64, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !76, file: !77, line: 254, baseType: !52, size: 64, align: 64, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !76, file: !77, line: 256, baseType: !52, size: 64, align: 64, offset: 576)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !76, file: !77, line: 257, baseType: !52, size: 64, align: 64, offset: 640)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !76, file: !77, line: 258, baseType: !52, size: 64, align: 64, offset: 704)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !76, file: !77, line: 260, baseType: !93, size: 64, align: 64, offset: 768)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !77, line: 156, size: 192, align: 64, elements: !95)
!95 = !{!96, !97, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !94, file: !77, line: 157, baseType: !93, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !94, file: !77, line: 158, baseType: !98, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !94, file: !77, line: 162, baseType: !80, size: 32, align: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !76, file: !77, line: 262, baseType: !98, size: 64, align: 64, offset: 832)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !76, file: !77, line: 264, baseType: !80, size: 32, align: 32, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !76, file: !77, line: 268, baseType: !80, size: 32, align: 32, offset: 928)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !76, file: !77, line: 270, baseType: !104, size: 64, align: 64, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !105, line: 131, baseType: !106)
!105 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!106 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !76, file: !77, line: 274, baseType: !108, size: 16, align: 16, offset: 1024)
!108 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !76, file: !77, line: 275, baseType: !110, size: 8, align: 8, offset: 1040)
!110 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !76, file: !77, line: 276, baseType: !112, size: 8, align: 8, offset: 1048)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 8, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 1)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !76, file: !77, line: 280, baseType: !116, size: 64, align: 64, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !77, line: 150, baseType: null)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !76, file: !77, line: 289, baseType: !119, size: 64, align: 64, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !105, line: 132, baseType: !106)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !76, file: !77, line: 297, baseType: !121, size: 64, align: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !76, file: !77, line: 298, baseType: !121, size: 64, align: 64, offset: 1280)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !76, file: !77, line: 299, baseType: !121, size: 64, align: 64, offset: 1344)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !76, file: !77, line: 300, baseType: !121, size: 64, align: 64, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !76, file: !77, line: 302, baseType: !47, size: 64, align: 64, offset: 1472)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !76, file: !77, line: 303, baseType: !80, size: 32, align: 32, offset: 1536)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !76, file: !77, line: 305, baseType: !128, size: 160, align: 8, offset: 1568)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 160, align: 8, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 20)
!131 = distinct !DIGlobalVariable(name: "trig_new_deferred", scope: !0, file: !42, line: 51, type: !73, isLocal: true, isDefinition: true, variable: %struct._IO_FILE** @trig_new_deferred)
!132 = distinct !DIGlobalVariable(name: "lock_fd", scope: !0, file: !42, line: 49, type: !80, isLocal: true, isDefinition: true, variable: i32* @lock_fd)
!133 = !{i32 2, !"Dwarf Version", i32 4}
!134 = !{i32 2, !"Debug Info Version", i32 3}
!135 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!136 = distinct !DISubprogram(name: "trigdef_update_start", scope: !42, file: !42, line: 75, type: !137, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!137 = !DISubroutineType(types: !138)
!138 = !{!3, !11}
!139 = !{}
!140 = !DILocalVariable(name: "uf", arg: 1, scope: !136, file: !42, line: 75, type: !11)
!141 = !DIExpression()
!142 = !DILocation(line: 75, column: 48, scope: !136)
!143 = !DILocation(line: 77, column: 16, scope: !136)
!144 = !DILocation(line: 77, column: 14, scope: !136)
!145 = !DILocation(line: 79, column: 6, scope: !146)
!146 = distinct !DILexicalBlock(scope: !136, file: !42, line: 79, column: 6)
!147 = !DILocation(line: 79, column: 9, scope: !146)
!148 = !DILocation(line: 79, column: 6, scope: !136)
!149 = !DILocation(line: 80, column: 20, scope: !150)
!150 = distinct !DILexicalBlock(scope: !146, file: !42, line: 79, column: 23)
!151 = !DILocation(line: 80, column: 3, scope: !150)
!152 = !DILocation(line: 81, column: 7, scope: !153)
!153 = distinct !DILexicalBlock(scope: !150, file: !42, line: 81, column: 7)
!154 = !DILocation(line: 81, column: 15, scope: !153)
!155 = !DILocation(line: 81, column: 7, scope: !150)
!156 = !DILocation(line: 82, column: 22, scope: !157)
!157 = distinct !DILexicalBlock(scope: !153, file: !42, line: 81, column: 22)
!158 = !DILocation(line: 82, column: 14, scope: !157)
!159 = !DILocation(line: 82, column: 12, scope: !157)
!160 = !DILocation(line: 83, column: 8, scope: !161)
!161 = distinct !DILexicalBlock(scope: !157, file: !42, line: 83, column: 8)
!162 = !DILocation(line: 83, column: 16, scope: !161)
!163 = !DILocation(line: 83, column: 8, scope: !157)
!164 = !DILocation(line: 84, column: 12, scope: !165)
!165 = distinct !DILexicalBlock(scope: !166, file: !42, line: 84, column: 9)
!166 = distinct !DILexicalBlock(scope: !161, file: !42, line: 83, column: 23)
!167 = !DILocation(line: 84, column: 11, scope: !165)
!168 = !DILocation(line: 84, column: 16, scope: !165)
!169 = !DILocation(line: 84, column: 26, scope: !165)
!170 = !DILocation(line: 84, column: 30, scope: !171)
!171 = !DILexicalBlockFile(scope: !165, file: !42, discriminator: 1)
!172 = !DILocation(line: 84, column: 33, scope: !171)
!173 = !DILocation(line: 84, column: 9, scope: !171)
!174 = !DILocation(line: 85, column: 13, scope: !165)
!175 = !DILocation(line: 87, column: 17, scope: !165)
!176 = !DILocation(line: 85, column: 6, scope: !171)
!177 = !DILocation(line: 85, column: 6, scope: !165)
!178 = !DILocation(line: 88, column: 5, scope: !166)
!179 = !DILocation(line: 90, column: 3, scope: !157)
!180 = !DILocation(line: 92, column: 42, scope: !150)
!181 = !DILocation(line: 93, column: 12, scope: !150)
!182 = !DILocation(line: 92, column: 3, scope: !150)
!183 = !DILocation(line: 94, column: 2, scope: !150)
!184 = !DILocation(line: 96, column: 19, scope: !136)
!185 = !DILocation(line: 96, column: 2, scope: !136)
!186 = !DILocation(line: 98, column: 6, scope: !187)
!187 = distinct !DILexicalBlock(scope: !136, file: !42, line: 98, column: 6)
!188 = !DILocation(line: 98, column: 6, scope: !136)
!189 = !DILocation(line: 99, column: 10, scope: !187)
!190 = !DILocation(line: 99, column: 3, scope: !187)
!191 = !DILocation(line: 100, column: 26, scope: !136)
!192 = !DILocation(line: 100, column: 17, scope: !136)
!193 = !DILocation(line: 100, column: 15, scope: !136)
!194 = !DILocation(line: 101, column: 7, scope: !195)
!195 = distinct !DILexicalBlock(scope: !136, file: !42, line: 101, column: 6)
!196 = !DILocation(line: 101, column: 6, scope: !136)
!197 = !DILocation(line: 102, column: 8, scope: !198)
!198 = distinct !DILexicalBlock(scope: !199, file: !42, line: 102, column: 6)
!199 = distinct !DILexicalBlock(scope: !195, file: !42, line: 101, column: 21)
!200 = !DILocation(line: 102, column: 7, scope: !198)
!201 = !DILocation(line: 102, column: 12, scope: !198)
!202 = !DILocation(line: 102, column: 6, scope: !199)
!203 = !DILocation(line: 103, column: 11, scope: !198)
!204 = !DILocation(line: 104, column: 15, scope: !198)
!205 = !DILocation(line: 103, column: 4, scope: !206)
!206 = !DILexicalBlockFile(scope: !198, file: !42, discriminator: 1)
!207 = !DILocation(line: 103, column: 4, scope: !198)
!208 = !DILocation(line: 105, column: 9, scope: !209)
!209 = distinct !DILexicalBlock(scope: !199, file: !42, line: 105, column: 7)
!210 = !DILocation(line: 105, column: 12, scope: !209)
!211 = !DILocation(line: 105, column: 7, scope: !199)
!212 = !DILocation(line: 106, column: 8, scope: !213)
!213 = distinct !DILexicalBlock(scope: !214, file: !42, line: 106, column: 8)
!214 = distinct !DILexicalBlock(scope: !209, file: !42, line: 105, column: 37)
!215 = !DILocation(line: 106, column: 11, scope: !213)
!216 = !DILocation(line: 106, column: 8, scope: !214)
!217 = !DILocation(line: 107, column: 5, scope: !213)
!218 = !DILocation(line: 108, column: 4, scope: !214)
!219 = !DILocation(line: 110, column: 2, scope: !199)
!220 = !DILocalVariable(name: "stab", scope: !221, file: !42, line: 111, type: !222)
!221 = distinct !DILexicalBlock(scope: !195, file: !42, line: 110, column: 9)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !223, line: 46, size: 1152, align: 64, elements: !224)
!223 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!224 = !{!225, !227, !229, !231, !234, !236, !238, !239, !240, !241, !243, !245, !253, !254, !255}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !222, file: !223, line: 48, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !105, line: 124, baseType: !49)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !222, file: !223, line: 53, baseType: !228, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !105, line: 127, baseType: !49)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !222, file: !223, line: 61, baseType: !230, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !105, line: 130, baseType: !49)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !222, file: !223, line: 62, baseType: !232, size: 32, align: 32, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !105, line: 129, baseType: !233)
!233 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !222, file: !223, line: 64, baseType: !235, size: 32, align: 32, offset: 224)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !105, line: 125, baseType: !233)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !222, file: !223, line: 65, baseType: !237, size: 32, align: 32, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !105, line: 126, baseType: !233)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !222, file: !223, line: 67, baseType: !80, size: 32, align: 32, offset: 288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !222, file: !223, line: 69, baseType: !226, size: 64, align: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !222, file: !223, line: 74, baseType: !104, size: 64, align: 64, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !222, file: !223, line: 78, baseType: !242, size: 64, align: 64, offset: 448)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !105, line: 153, baseType: !106)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !222, file: !223, line: 80, baseType: !244, size: 64, align: 64, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !105, line: 158, baseType: !106)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !222, file: !223, line: 91, baseType: !246, size: 128, align: 64, offset: 576)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !247, line: 120, size: 128, align: 64, elements: !248)
!247 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!248 = !{!249, !251}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !246, file: !247, line: 122, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !105, line: 139, baseType: !106)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !246, file: !247, line: 123, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !105, line: 175, baseType: !106)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !222, file: !223, line: 92, baseType: !246, size: 128, align: 64, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !222, file: !223, line: 93, baseType: !246, size: 128, align: 64, offset: 832)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !222, file: !223, line: 106, baseType: !256, size: 192, align: 64, offset: 960)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 192, align: 64, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 3)
!259 = !DILocation(line: 111, column: 15, scope: !221)
!260 = !DILocalVariable(name: "rc", scope: !221, file: !42, line: 112, type: !80)
!261 = !DILocation(line: 112, column: 7, scope: !221)
!262 = !DILocation(line: 114, column: 21, scope: !221)
!263 = !DILocation(line: 114, column: 14, scope: !221)
!264 = !DILocation(line: 114, column: 39, scope: !221)
!265 = !DILocation(line: 114, column: 3, scope: !266)
!266 = !DILexicalBlockFile(scope: !221, file: !42, discriminator: 1)
!267 = !DILocation(line: 116, column: 21, scope: !221)
!268 = !DILocation(line: 116, column: 14, scope: !221)
!269 = !DILocation(line: 116, column: 8, scope: !266)
!270 = !DILocation(line: 116, column: 6, scope: !221)
!271 = !DILocation(line: 117, column: 7, scope: !272)
!272 = distinct !DILexicalBlock(scope: !221, file: !42, line: 117, column: 7)
!273 = !DILocation(line: 117, column: 10, scope: !272)
!274 = !DILocation(line: 117, column: 7, scope: !221)
!275 = !DILocation(line: 118, column: 11, scope: !272)
!276 = !DILocation(line: 119, column: 15, scope: !272)
!277 = !DILocation(line: 118, column: 4, scope: !278)
!278 = !DILexicalBlockFile(scope: !272, file: !42, discriminator: 1)
!279 = !DILocation(line: 118, column: 4, scope: !272)
!280 = !DILocation(line: 121, column: 12, scope: !281)
!281 = distinct !DILexicalBlock(scope: !221, file: !42, line: 121, column: 7)
!282 = !DILocation(line: 121, column: 20, scope: !281)
!283 = !DILocation(line: 121, column: 25, scope: !281)
!284 = !DILocation(line: 121, column: 30, scope: !285)
!285 = !DILexicalBlockFile(scope: !281, file: !42, discriminator: 1)
!286 = !DILocation(line: 121, column: 33, scope: !285)
!287 = !DILocation(line: 121, column: 7, scope: !285)
!288 = !DILocation(line: 122, column: 8, scope: !289)
!289 = distinct !DILexicalBlock(scope: !290, file: !42, line: 122, column: 8)
!290 = distinct !DILexicalBlock(scope: !281, file: !42, line: 121, column: 57)
!291 = !DILocation(line: 122, column: 11, scope: !289)
!292 = !DILocation(line: 122, column: 8, scope: !290)
!293 = !DILocation(line: 123, column: 5, scope: !289)
!294 = !DILocation(line: 124, column: 4, scope: !290)
!295 = !DILocation(line: 128, column: 6, scope: !296)
!296 = distinct !DILexicalBlock(scope: !136, file: !42, line: 128, column: 6)
!297 = !DILocation(line: 128, column: 9, scope: !296)
!298 = !DILocation(line: 128, column: 6, scope: !136)
!299 = !DILocation(line: 129, column: 23, scope: !300)
!300 = distinct !DILexicalBlock(scope: !296, file: !42, line: 128, column: 23)
!301 = !DILocation(line: 129, column: 3, scope: !300)
!302 = !DILocation(line: 130, column: 7, scope: !303)
!303 = distinct !DILexicalBlock(scope: !300, file: !42, line: 130, column: 7)
!304 = !DILocation(line: 130, column: 7, scope: !300)
!305 = !DILocation(line: 131, column: 11, scope: !303)
!306 = !DILocation(line: 131, column: 4, scope: !303)
!307 = !DILocation(line: 132, column: 35, scope: !300)
!308 = !DILocation(line: 132, column: 23, scope: !300)
!309 = !DILocation(line: 132, column: 21, scope: !300)
!310 = !DILocation(line: 133, column: 8, scope: !311)
!311 = distinct !DILexicalBlock(scope: !300, file: !42, line: 133, column: 7)
!312 = !DILocation(line: 133, column: 7, scope: !300)
!313 = !DILocation(line: 134, column: 11, scope: !311)
!314 = !DILocation(line: 135, column: 18, scope: !311)
!315 = !DILocation(line: 134, column: 4, scope: !316)
!316 = !DILexicalBlockFile(scope: !311, file: !42, discriminator: 1)
!317 = !DILocation(line: 134, column: 4, scope: !311)
!318 = !DILocation(line: 137, column: 21, scope: !300)
!319 = !DILocation(line: 137, column: 14, scope: !300)
!320 = !DILocation(line: 137, column: 47, scope: !300)
!321 = !DILocation(line: 137, column: 3, scope: !322)
!322 = !DILexicalBlockFile(scope: !300, file: !42, discriminator: 1)
!323 = !DILocation(line: 138, column: 2, scope: !300)
!324 = !DILocation(line: 140, column: 7, scope: !325)
!325 = distinct !DILexicalBlock(scope: !136, file: !42, line: 140, column: 6)
!326 = !DILocation(line: 140, column: 6, scope: !136)
!327 = !DILocation(line: 141, column: 3, scope: !325)
!328 = !DILocation(line: 143, column: 2, scope: !136)
!329 = !DILocation(line: 144, column: 1, scope: !136)
!330 = distinct !DISubprogram(name: "constructfn", scope: !42, file: !42, line: 54, type: !331, isLocal: true, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !333, !64, !64}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!334 = !DILocalVariable(name: "vb", arg: 1, scope: !330, file: !42, line: 54, type: !333)
!335 = !DILocation(line: 54, column: 28, scope: !330)
!336 = !DILocalVariable(name: "dir", arg: 2, scope: !330, file: !42, line: 54, type: !64)
!337 = !DILocation(line: 54, column: 44, scope: !330)
!338 = !DILocalVariable(name: "tail", arg: 3, scope: !330, file: !42, line: 54, type: !64)
!339 = !DILocation(line: 54, column: 61, scope: !330)
!340 = !DILocation(line: 56, column: 15, scope: !330)
!341 = !DILocation(line: 56, column: 2, scope: !330)
!342 = !DILocation(line: 57, column: 17, scope: !330)
!343 = !DILocation(line: 57, column: 21, scope: !330)
!344 = !DILocation(line: 57, column: 33, scope: !330)
!345 = !DILocation(line: 57, column: 26, scope: !330)
!346 = !DILocation(line: 57, column: 2, scope: !347)
!347 = !DILexicalBlockFile(scope: !330, file: !42, discriminator: 1)
!348 = !DILocation(line: 58, column: 18, scope: !330)
!349 = !DILocation(line: 58, column: 2, scope: !330)
!350 = !DILocation(line: 59, column: 17, scope: !330)
!351 = !DILocation(line: 59, column: 21, scope: !330)
!352 = !DILocation(line: 59, column: 34, scope: !330)
!353 = !DILocation(line: 59, column: 27, scope: !330)
!354 = !DILocation(line: 59, column: 2, scope: !347)
!355 = !DILocation(line: 60, column: 17, scope: !330)
!356 = !DILocation(line: 60, column: 2, scope: !330)
!357 = !DILocation(line: 61, column: 1, scope: !330)
!358 = distinct !DISubprogram(name: "trigdef_set_methods", scope: !42, file: !42, line: 147, type: !359, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !56}
!361 = !DILocalVariable(name: "methods", arg: 1, scope: !358, file: !42, line: 147, type: !56)
!362 = !DILocation(line: 147, column: 48, scope: !358)
!363 = !DILocation(line: 149, column: 12, scope: !358)
!364 = !DILocation(line: 149, column: 10, scope: !358)
!365 = !DILocation(line: 150, column: 1, scope: !358)
!366 = distinct !DISubprogram(name: "trigdef_update_printf", scope: !42, file: !42, line: 153, type: !367, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !64, null}
!369 = !DILocalVariable(name: "format", arg: 1, scope: !366, file: !42, line: 153, type: !64)
!370 = !DILocation(line: 153, column: 35, scope: !366)
!371 = !DILocalVariable(name: "ap", scope: !366, file: !42, line: 155, type: !372)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !75, line: 79, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !374, line: 40, baseType: !375)
!374 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/dpkg/[lib]lib--dpkg--.libs--libdpkg.a")
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 155, baseType: !376)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 192, align: 64, elements: !113)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 155, size: 192, align: 64, elements: !378)
!378 = !{!379, !380, !381, !382}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !377, file: !1, line: 155, baseType: !233, size: 32, align: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !377, file: !1, line: 155, baseType: !233, size: 32, align: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !377, file: !1, line: 155, baseType: !121, size: 64, align: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !377, file: !1, line: 155, baseType: !121, size: 64, align: 64, offset: 128)
!383 = !DILocation(line: 155, column: 10, scope: !366)
!384 = !DILocation(line: 157, column: 1, scope: !366)
!385 = !DILocation(line: 158, column: 11, scope: !366)
!386 = !DILocation(line: 158, column: 30, scope: !366)
!387 = !DILocation(line: 158, column: 38, scope: !366)
!388 = !DILocation(line: 158, column: 2, scope: !366)
!389 = !DILocation(line: 159, column: 1, scope: !366)
!390 = !DILocation(line: 160, column: 1, scope: !366)
!391 = distinct !DISubprogram(name: "trigdef_parse", scope: !42, file: !42, line: 184, type: !392, isLocal: false, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!392 = !DISubroutineType(types: !393)
!393 = !{!80}
!394 = !DILocalVariable(name: "line", scope: !391, file: !42, line: 186, type: !395)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 16384, align: 8, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 2048)
!398 = !DILocation(line: 186, column: 7, scope: !391)
!399 = !DILocalVariable(name: "ptr", scope: !391, file: !42, line: 187, type: !52)
!400 = !DILocation(line: 187, column: 8, scope: !391)
!401 = !DILocalVariable(name: "ptr_ini", scope: !391, file: !42, line: 187, type: !52)
!402 = !DILocation(line: 187, column: 14, scope: !391)
!403 = !DILocalVariable(name: "line_num", scope: !391, file: !42, line: 188, type: !80)
!404 = !DILocation(line: 188, column: 6, scope: !391)
!405 = !DILocation(line: 190, column: 2, scope: !391)
!406 = !DILocation(line: 190, column: 23, scope: !407)
!407 = !DILexicalBlockFile(scope: !391, file: !42, discriminator: 1)
!408 = !DILocation(line: 190, column: 43, scope: !407)
!409 = !DILocation(line: 190, column: 60, scope: !407)
!410 = !DILocation(line: 190, column: 9, scope: !407)
!411 = !DILocation(line: 190, column: 65, scope: !407)
!412 = !DILocation(line: 190, column: 2, scope: !407)
!413 = !DILocation(line: 191, column: 11, scope: !414)
!414 = distinct !DILexicalBlock(scope: !391, file: !42, line: 190, column: 70)
!415 = !DILocation(line: 193, column: 33, scope: !414)
!416 = !DILocation(line: 193, column: 9, scope: !414)
!417 = !DILocation(line: 193, column: 7, scope: !414)
!418 = !DILocation(line: 196, column: 8, scope: !419)
!419 = distinct !DILexicalBlock(scope: !414, file: !42, line: 196, column: 7)
!420 = !DILocation(line: 196, column: 7, scope: !419)
!421 = !DILocation(line: 196, column: 12, scope: !419)
!422 = !DILocation(line: 196, column: 20, scope: !419)
!423 = !DILocation(line: 196, column: 24, scope: !424)
!424 = !DILexicalBlockFile(scope: !419, file: !42, discriminator: 1)
!425 = !DILocation(line: 196, column: 23, scope: !424)
!426 = !DILocation(line: 196, column: 28, scope: !424)
!427 = !DILocation(line: 196, column: 7, scope: !424)
!428 = !DILocation(line: 197, column: 4, scope: !419)
!429 = distinct !{!429, !405}
!430 = !DILocation(line: 200, column: 13, scope: !414)
!431 = !DILocation(line: 200, column: 11, scope: !414)
!432 = !DILocation(line: 201, column: 3, scope: !414)
!433 = !DILocation(line: 201, column: 11, scope: !434)
!434 = !DILexicalBlockFile(scope: !414, file: !42, discriminator: 1)
!435 = !DILocation(line: 201, column: 10, scope: !434)
!436 = !DILocation(line: 201, column: 3, scope: !434)
!437 = !DILocation(line: 202, column: 9, scope: !438)
!438 = distinct !DILexicalBlock(scope: !439, file: !42, line: 202, column: 8)
!439 = distinct !DILexicalBlock(scope: !414, file: !42, line: 201, column: 16)
!440 = !DILocation(line: 202, column: 8, scope: !438)
!441 = !DILocation(line: 202, column: 13, scope: !438)
!442 = !DILocation(line: 202, column: 20, scope: !438)
!443 = !DILocation(line: 202, column: 24, scope: !444)
!444 = !DILexicalBlockFile(scope: !438, file: !42, discriminator: 1)
!445 = !DILocation(line: 202, column: 23, scope: !444)
!446 = !DILocation(line: 202, column: 28, scope: !444)
