; ModuleID = '/home/lichi/Desktop/genwqe/[task]tools--genwqe_cksum/[inter]tools--genwqe_cksum.o.i'
source_filename = "/home/lichi/Desktop/genwqe/[task]tools--genwqe_cksum/[inter]tools--genwqe_cksum.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.card_dev_t = type opaque
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.ddcb_cmd = type { i64, i64, i8, i8, i8, i8, i16, i16, i16, i16, i32, i64, i64, i64, i64, [64 x i8], %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i64, [96 x i8] }
%struct.asv_runtime_dma_error = type { i64, i32, i16, i16, i64, i64, i64, i32, i16, i16, i64, i64 }
%struct.asiv_memcpy = type { i64, i32, i32, i64, i32, i32, [4 x i64], i16, i16, i32, [3 x i64] }
%struct.asv_memcpy = type { [2 x i64], i32, i32, i32, i32, [4 x i64] }

@verbose_flag = global i32 0, align 4

!144 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137)
!145 = !DIEnumerator(name: "_SC_CPUTIME", value: 138)
!146 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139)
!147 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!148 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!149 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!150 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!151 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!152 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!153 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!154 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!155 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!156 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!157 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!158 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!159 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!160 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!161 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!162 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!163 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!164 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!165 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!166 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!167 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!168 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!169 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!170 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!171 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!172 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!173 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!174 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!175 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!176 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!177 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!178 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!179 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!180 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!181 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!182 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!183 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!184 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!185 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!186 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!187 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!188 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!189 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!190 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!191 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!192 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!193 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!194 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!195 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!196 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!197 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!198 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!199 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!200 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!201 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!202 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!203 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!204 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!205 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!206 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!207 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!208 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!209 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!210 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!211 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!212 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!213 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!214 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!215 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!216 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!217 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!218 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!219 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!220 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!221 = !{!222, !225, !226, !227, !250, !253, !255, !256, !257, !258, !259, !234, !236, !280}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!226 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asv_runtime_dma_error", file: !229, line: 101, size: 512, align: 8, elements: !230)
!229 = !DIFile(filename: "../include/libcard.h", directory: "/home/lichi/Desktop")
!230 = !{!231, !235, !238, !241, !242, !243, !244, !245, !246, !247, !248, !249}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "raddr_be64", scope: !228, file: !229, line: 102, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !233, line: 55, baseType: !234)
!233 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop")
!234 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "rfmt_chan_disccnt_be32", scope: !228, file: !229, line: 103, baseType: !236, size: 32, align: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !233, line: 51, baseType: !237)
!237 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "rdmae_be16", scope: !228, file: !229, line: 104, baseType: !239, size: 16, align: 16, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !233, line: 49, baseType: !240)
!240 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "rsge_be16", scope: !228, file: !229, line: 105, baseType: !239, size: 16, align: 16, offset: 112)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "res0", scope: !228, file: !229, line: 107, baseType: !232, size: 64, align: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !228, file: !229, line: 108, baseType: !232, size: 64, align: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "waddr_be64", scope: !228, file: !229, line: 110, baseType: !232, size: 64, align: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "wfmt_chan_disccnt_be32", scope: !228, file: !229, line: 111, baseType: !236, size: 32, align: 32, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "wdmae_be16", scope: !228, file: !229, line: 112, baseType: !239, size: 16, align: 16, offset: 352)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "wsge_be16", scope: !228, file: !229, line: 113, baseType: !239, size: 16, align: 16, offset: 368)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "res2", scope: !228, file: !229, line: 115, baseType: !232, size: 64, align: 64, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "res3", scope: !228, file: !229, line: 116, baseType: !232, size: 64, align: 64, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !251, line: 30, baseType: !252)
!251 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop")
!252 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be64", file: !254, line: 32, baseType: !250)
!254 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/lichi/Desktop")
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !251, line: 26, baseType: !237)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !254, line: 30, baseType: !255)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !251, line: 23, baseType: !240)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !254, line: 28, baseType: !257)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asiv_memcpy", file: !261, line: 42, size: 768, align: 8, elements: !262)
!261 = !DIFile(filename: "../include/memcopy_ddcb.h", directory: "/home/lichi/Desktop")
!262 = !{!263, !264, !265, !266, !267, !268, !269, !273, !274, !275, !276}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "inp_buff", scope: !260, file: !261, line: 43, baseType: !232, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "inp_buff_len", scope: !260, file: !261, line: 44, baseType: !236, size: 32, align: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "in_crc32", scope: !260, file: !261, line: 45, baseType: !236, size: 32, align: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "outp_buff", scope: !260, file: !261, line: 47, baseType: !232, size: 64, align: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "outp_buff_len", scope: !260, file: !261, line: 48, baseType: !236, size: 32, align: 32, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "in_adler32", scope: !260, file: !261, line: 49, baseType: !236, size: 32, align: 32, offset: 224)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "res0", scope: !260, file: !261, line: 51, baseType: !270, size: 256, align: 64, offset: 256)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 256, align: 64, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 4)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !260, file: !261, line: 52, baseType: !239, size: 16, align: 16, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "input_lists", scope: !260, file: !261, line: 53, baseType: !239, size: 16, align: 16, offset: 528)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "res2", scope: !260, file: !261, line: 54, baseType: !236, size: 32, align: 32, offset: 544)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "res3", scope: !260, file: !261, line: 56, baseType: !277, size: 192, align: 64, offset: 576)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 192, align: 64, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 3)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asv_memcpy", file: !261, line: 63, size: 512, align: 8, elements: !282)
!282 = !{!283, !287, !288, !289, !290, !291}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "res0", scope: !281, file: !261, line: 64, baseType: !284, size: 128, align: 64)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 128, align: 64, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 2)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "out_crc32", scope: !281, file: !261, line: 65, baseType: !236, size: 32, align: 32, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "out_adler32", scope: !281, file: !261, line: 66, baseType: !236, size: 32, align: 32, offset: 160)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "inp_processed", scope: !281, file: !261, line: 67, baseType: !236, size: 32, align: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "outp_returned", scope: !281, file: !261, line: 68, baseType: !236, size: 32, align: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !281, file: !261, line: 69, baseType: !270, size: 256, align: 64, offset: 256)
!292 = !{!293, !296, !314, !315}
!293 = distinct !DIGlobalVariable(name: "verbose_flag", scope: !0, file: !294, line: 36, type: !295, isLocal: false, isDefinition: true, variable: i32* @verbose_flag)
!294 = !DIFile(filename: "genwqe_cksum.c", directory: "/home/lichi/Desktop")
!295 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!296 = distinct !DIGlobalVariable(name: "long_options", scope: !297, file: !294, line: 306, type: !301, isLocal: true, isDefinition: true, variable: [12 x %struct.option]* @main.long_options)
!297 = distinct !DISubprogram(name: "main", scope: !294, file: !294, line: 288, type: !298, isLocal: false, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !300)
!298 = !DISubroutineType(types: !299)
!299 = !{!295, !295, !222}
!300 = !{}
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 3072, align: 64, elements: !312)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !303, line: 104, size: 256, align: 64, elements: !304)
!303 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/lichi/Desktop")
!304 = !{!305, !308, !309, !311}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !302, file: !303, line: 106, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !302, file: !303, line: 109, baseType: !295, size: 32, align: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !302, file: !303, line: 110, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !302, file: !303, line: 111, baseType: !295, size: 32, align: 32, offset: 192)
!312 = !{!313}
!313 = !DISubrange(count: 12)
!314 = distinct !DIGlobalVariable(name: "version", scope: !0, file: !294, line: 41, type: !306, isLocal: true, isDefinition: true, variable: i8** @version)
!315 = distinct !DIGlobalVariable(name: "debug_flag", scope: !0, file: !294, line: 37, type: !295, isLocal: true, isDefinition: true, variable: i32* @debug_flag)
!316 = !{i32 2, !"Dwarf Version", i32 4}
!317 = !{i32 2, !"Debug Info Version", i32 3}
!318 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!319 = !DILocalVariable(name: "argc", arg: 1, scope: !297, file: !294, line: 288, type: !295)
!320 = !DIExpression()
!321 = !DILocation(line: 288, column: 14, scope: !297)
!322 = !DILocalVariable(name: "argv", arg: 2, scope: !297, file: !294, line: 288, type: !222)
!323 = !DILocation(line: 288, column: 26, scope: !297)
!324 = !DILocalVariable(name: "card_no", scope: !297, file: !294, line: 290, type: !295)
!325 = !DILocation(line: 290, column: 6, scope: !297)
!326 = !DILocalVariable(name: "err_code", scope: !297, file: !294, line: 290, type: !295)
!327 = !DILocation(line: 290, column: 19, scope: !297)
!328 = !DILocalVariable(name: "accel", scope: !297, file: !294, line: 291, type: !329)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "accel_t", file: !330, line: 198, baseType: !331)
!330 = !DIFile(filename: "../include/libddcb.h", directory: "/home/lichi/Desktop")
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "card_dev_t", file: !330, line: 198, flags: DIFlagFwdDecl)
!333 = !DILocation(line: 291, column: 10, scope: !297)
!334 = !DILocalVariable(name: "ibuf", scope: !297, file: !294, line: 292, type: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !233, line: 48, baseType: !337)
!337 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!338 = !DILocation(line: 292, column: 11, scope: !297)
!339 = !DILocalVariable(name: "obuf", scope: !297, file: !294, line: 292, type: !335)
!340 = !DILocation(line: 292, column: 18, scope: !297)
!341 = !DILocalVariable(name: "page_size", scope: !297, file: !294, line: 293, type: !237)
!342 = !DILocation(line: 293, column: 15, scope: !297)
!343 = !DILocation(line: 293, column: 27, scope: !297)
!344 = !DILocalVariable(name: "in_f", scope: !297, file: !294, line: 294, type: !306)
!345 = !DILocation(line: 294, column: 14, scope: !297)
!346 = !DILocalVariable(name: "cpu", scope: !297, file: !294, line: 295, type: !295)
!347 = !DILocation(line: 295, column: 6, scope: !297)
!348 = !DILocalVariable(name: "card_type", scope: !297, file: !294, line: 296, type: !295)
!349 = !DILocation(line: 296, column: 6, scope: !297)
!350 = !DILocalVariable(name: "check_result", scope: !297, file: !294, line: 297, type: !295)
!351 = !DILocation(line: 297, column: 6, scope: !297)
!352 = !DILocalVariable(name: "use_sglist", scope: !297, file: !294, line: 298, type: !295)
!353 = !DILocation(line: 298, column: 6, scope: !297)
!354 = !DILocalVariable(name: "use_adler", scope: !297, file: !294, line: 299, type: !295)
!355 = !DILocation(line: 299, column: 6, scope: !297)
!356 = !DILocalVariable(name: "data_buf_size", scope: !297, file: !294, line: 300, type: !295)
!357 = !DILocation(line: 300, column: 6, scope: !297)
!358 = !DILocation(line: 302, column: 2, scope: !297)
!359 = !DILocalVariable(name: "ch", scope: !360, file: !294, line: 303, type: !295)
!360 = distinct !DILexicalBlock(scope: !297, file: !294, line: 302, column: 12)
!361 = !DILocation(line: 303, column: 7, scope: !360)
!362 = !DILocalVariable(name: "option_index", scope: !360, file: !294, line: 304, type: !295)
!363 = !DILocation(line: 304, column: 7, scope: !360)
!364 = !DILocation(line: 327, column: 20, scope: !360)
!365 = !DILocation(line: 327, column: 26, scope: !360)
!366 = !DILocation(line: 327, column: 8, scope: !360)
!367 = !DILocation(line: 327, column: 6, scope: !360)
!368 = !DILocation(line: 329, column: 7, scope: !369)
!369 = distinct !DILexicalBlock(scope: !360, file: !294, line: 329, column: 7)
!370 = !DILocation(line: 329, column: 10, scope: !369)
!371 = !DILocation(line: 329, column: 7, scope: !360)
!372 = !DILocation(line: 330, column: 4, scope: !369)
!373 = !DILocation(line: 332, column: 11, scope: !360)
!374 = !DILocation(line: 332, column: 3, scope: !360)
!375 = !DILocation(line: 335, column: 15, scope: !376)
!376 = distinct !DILexicalBlock(scope: !377, file: !294, line: 335, column: 8)
!377 = distinct !DILexicalBlock(scope: !360, file: !294, line: 332, column: 15)
!378 = !DILocation(line: 335, column: 8, scope: !376)
!379 = !DILocation(line: 335, column: 30, scope: !376)
!380 = !DILocation(line: 335, column: 8, scope: !377)
!381 = !DILocation(line: 336, column: 13, scope: !382)
!382 = distinct !DILexicalBlock(scope: !376, file: !294, line: 335, column: 36)
!383 = !DILocation(line: 337, column: 5, scope: !382)
!384 = !DILocation(line: 339, column: 21, scope: !377)
!385 = !DILocation(line: 339, column: 14, scope: !377)
!386 = !DILocation(line: 339, column: 12, scope: !377)
!387 = !DILocation(line: 340, column: 4, scope: !377)
!388 = !DILocation(line: 342, column: 15, scope: !389)
!389 = distinct !DILexicalBlock(scope: !377, file: !294, line: 342, column: 8)
!390 = !DILocation(line: 342, column: 8, scope: !389)
!391 = !DILocation(line: 342, column: 33, scope: !389)
!392 = !DILocation(line: 342, column: 8, scope: !377)
!393 = !DILocation(line: 343, column: 15, scope: !394)
!394 = distinct !DILexicalBlock(scope: !389, file: !294, line: 342, column: 39)
!395 = !DILocation(line: 344, column: 5, scope: !394)
!396 = !DILocation(line: 346, column: 15, scope: !397)
!397 = distinct !DILexicalBlock(scope: !377, file: !294, line: 346, column: 8)
!398 = !DILocation(line: 346, column: 8, scope: !397)
!399 = !DILocation(line: 346, column: 31, scope: !397)
!400 = !DILocation(line: 346, column: 8, scope: !377)
!401 = !DILocation(line: 347, column: 15, scope: !402)
!402 = distinct !DILexicalBlock(scope: !397, file: !294, line: 346, column: 37)
!403 = !DILocation(line: 348, column: 5, scope: !402)
!404 = !DILocation(line: 351, column: 23, scope: !377)
!405 = !DILocation(line: 351, column: 16, scope: !377)
!406 = !DILocation(line: 351, column: 14, scope: !377)
!407 = !DILocation(line: 352, column: 19, scope: !408)
!408 = distinct !DILexicalBlock(scope: !377, file: !294, line: 352, column: 8)
!409 = !DILocation(line: 352, column: 16, scope: !408)
!410 = !DILocation(line: 352, column: 30, scope: !408)
!411 = !DILocation(line: 353, column: 16, scope: !408)
!412 = !DILocation(line: 353, column: 13, scope: !408)
!413 = !DILocation(line: 352, column: 8, scope: !414)
!414 = !DILexicalBlockFile(scope: !377, file: !294, discriminator: 1)
!415 = !DILocation(line: 354, column: 11, scope: !416)
!416 = distinct !DILexicalBlock(scope: !408, file: !294, line: 353, column: 28)
!417 = !DILocation(line: 354, column: 5, scope: !416)
!418 = !DILocation(line: 355, column: 5, scope: !416)
!419 = !DILocation(line: 357, column: 4, scope: !377)
!420 = !DILocation(line: 359, column: 18, scope: !377)
!421 = !DILocation(line: 359, column: 10, scope: !377)
!422 = !DILocation(line: 359, column: 8, scope: !377)
!423 = !DILocation(line: 360, column: 4, scope: !377)
!424 = !DILocation(line: 362, column: 14, scope: !377)
!425 = !DILocation(line: 363, column: 4, scope: !377)
!426 = !DILocation(line: 365, column: 14, scope: !377)
!427 = !DILocation(line: 366, column: 4, scope: !377)
!428 = !DILocation(line: 368, column: 16, scope: !377)
!429 = !DILocation(line: 369, column: 4, scope: !377)
!430 = !DILocation(line: 371, column: 31, scope: !377)
!431 = !DILocation(line: 371, column: 20, scope: !377)
!432 = !DILocation(line: 371, column: 18, scope: !377)
!433 = !DILocation(line: 372, column: 4, scope: !377)
!434 = !DILocation(line: 375, column: 10, scope: !377)
!435 = !DILocation(line: 375, column: 4, scope: !377)
!436 = !DILocation(line: 376, column: 4, scope: !377)
!437 = !DILocation(line: 379, column: 19, scope: !377)
!438 = !DILocation(line: 379, column: 4, scope: !377)
!439 = !DILocation(line: 380, column: 4, scope: !377)
!440 = !DILocation(line: 382, column: 14, scope: !377)
!441 = !DILocation(line: 383, column: 4, scope: !377)
!442 = !DILocation(line: 385, column: 16, scope: !377)
!443 = !DILocation(line: 386, column: 4, scope: !377)
!444 = !DILocation(line: 388, column: 10, scope: !377)
!445 = !DILocation(line: 388, column: 4, scope: !377)
!446 = !DILocation(line: 389, column: 4, scope: !377)
!447 = !DILocation(line: 302, column: 2, scope: !448)
!448 = !DILexicalBlockFile(scope: !297, file: !294, discriminator: 1)
!449 = distinct !{!449, !358}
!450 = !DILocation(line: 393, column: 13, scope: !297)
!451 = !DILocation(line: 393, column: 18, scope: !297)
!452 = !DILocation(line: 393, column: 2, scope: !297)
!453 = !DILocation(line: 394, column: 13, scope: !297)
!454 = !DILocation(line: 394, column: 26, scope: !297)
!455 = !DILocation(line: 394, column: 2, scope: !297)
!456 = !DILocation(line: 395, column: 24, scope: !297)
!457 = !DILocation(line: 395, column: 2, scope: !297)
!458 = !DILocation(line: 396, column: 12, scope: !459)
!459 = distinct !DILexicalBlock(scope: !297, file: !294, line: 396, column: 6)
!460 = !DILocation(line: 396, column: 9, scope: !459)
!461 = !DILocation(line: 396, column: 6, scope: !297)
!462 = !DILocation(line: 397, column: 12, scope: !463)
!463 = distinct !DILexicalBlock(scope: !464, file: !294, line: 397, column: 7)
!464 = distinct !DILexicalBlock(scope: !459, file: !294, line: 396, column: 21)
!465 = !DILocation(line: 397, column: 9, scope: !463)
!466 = !DILocation(line: 397, column: 7, scope: !464)
!467 = !DILocation(line: 398, column: 4, scope: !468)
!468 = distinct !DILexicalBlock(scope: !463, file: !294, line: 397, column: 24)
!469 = distinct !{!469, !467}
!470 = !DILocation(line: 398, column: 13, scope: !471)
!471 = !DILexicalBlockFile(scope: !472, file: !294, discriminator: 1)
!472 = distinct !DILexicalBlock(scope: !473, file: !294, line: 398, column: 13)
!473 = distinct !DILexicalBlock(scope: !468, file: !294, line: 398, column: 7)
!474 = !DILocation(line: 398, column: 3, scope: !475)
!475 = !DILexicalBlockFile(scope: !472, file: !294, discriminator: 2)
!476 = !DILocation(line: 398, column: 27, scope: !475)
!477 = !DILocation(line: 398, column: 71, scope: !478)
!478 = !DILexicalBlockFile(scope: !473, file: !294, discriminator: 3)
!479 = !DILocation(line: 400, column: 15, scope: !468)
!480 = !DILocation(line: 401, column: 3, scope: !468)
!481 = !DILocation(line: 402, column: 2, scope: !464)
!482 = !DILocation(line: 404, column: 21, scope: !297)
!483 = !DILocation(line: 404, column: 30, scope: !297)
!484 = !DILocation(line: 404, column: 10, scope: !297)
!485 = !DILocation(line: 404, column: 8, scope: !297)
!486 = !DILocation(line: 406, column: 6, scope: !487)
!487 = distinct !DILexicalBlock(scope: !297, file: !294, line: 406, column: 6)
!488 = !DILocation(line: 406, column: 12, scope: !487)
!489 = !DILocation(line: 406, column: 6, scope: !297)
!490 = !DILocation(line: 408, column: 4, scope: !491)
!491 = distinct !DILexicalBlock(scope: !487, file: !294, line: 406, column: 20)
!492 = !DILocation(line: 408, column: 13, scope: !491)
!493 = !DILocation(line: 409, column: 18, scope: !491)
!494 = !DILocation(line: 409, column: 4, scope: !491)
!495 = !DILocation(line: 409, column: 29, scope: !491)
!496 = !DILocation(line: 409, column: 49, scope: !497)
!497 = !DILexicalBlockFile(scope: !491, file: !294, discriminator: 1)
!498 = !DILocation(line: 409, column: 48, scope: !491)
!499 = !DILocation(line: 409, column: 39, scope: !500)
!500 = !DILexicalBlockFile(scope: !491, file: !294, discriminator: 2)
!501 = !DILocation(line: 407, column: 3, scope: !491)
!502 = !DILocation(line: 410, column: 3, scope: !491)
!503 = !DILocation(line: 413, column: 6, scope: !504)
!504 = distinct !DILexicalBlock(scope: !297, file: !294, line: 413, column: 6)
!505 = !DILocation(line: 413, column: 6, scope: !297)
!506 = !DILocation(line: 414, column: 19, scope: !507)
!507 = distinct !DILexicalBlock(scope: !504, file: !294, line: 413, column: 18)
!508 = !DILocation(line: 414, column: 30, scope: !507)
!509 = !DILocation(line: 414, column: 10, scope: !507)
!510 = !DILocation(line: 414, column: 8, scope: !507)
!511 = !DILocation(line: 415, column: 19, scope: !507)
!512 = !DILocation(line: 415, column: 30, scope: !507)
!513 = !DILocation(line: 415, column: 10, scope: !507)
!514 = !DILocation(line: 415, column: 8, scope: !507)
!515 = !DILocation(line: 416, column: 7, scope: !516)
!516 = distinct !DILexicalBlock(scope: !507, file: !294, line: 416, column: 7)
!517 = !DILocation(line: 416, column: 18, scope: !516)
!518 = !DILocation(line: 416, column: 7, scope: !507)
!519 = !DILocation(line: 417, column: 21, scope: !520)
!520 = distinct !DILexicalBlock(scope: !516, file: !294, line: 416, column: 23)
!521 = !DILocation(line: 417, column: 28, scope: !520)
!522 = !DILocation(line: 417, column: 34, scope: !520)
!523 = !DILocation(line: 417, column: 4, scope: !520)
!524 = !DILocation(line: 418, column: 21, scope: !520)
!525 = !DILocation(line: 418, column: 28, scope: !520)
!526 = !DILocation(line: 418, column: 34, scope: !520)
!527 = !DILocation(line: 418, column: 4, scope: !520)
!528 = !DILocation(line: 419, column: 3, scope: !520)
!529 = !DILocation(line: 420, column: 2, scope: !507)
!530 = !DILocation(line: 421, column: 23, scope: !531)
!531 = distinct !DILexicalBlock(scope: !504, file: !294, line: 420, column: 9)
!532 = !DILocation(line: 421, column: 30, scope: !531)
!533 = !DILocation(line: 421, column: 10, scope: !531)
!534 = !DILocation(line: 421, column: 8, scope: !531)
!535 = !DILocation(line: 422, column: 23, scope: !531)
!536 = !DILocation(line: 422, column: 30, scope: !531)
!537 = !DILocation(line: 422, column: 10, scope: !531)
!538 = !DILocation(line: 422, column: 8, scope: !531)
!539 = !DILocation(line: 425, column: 7, scope: !540)
!540 = distinct !DILexicalBlock(scope: !297, file: !294, line: 425, column: 6)
!541 = !DILocation(line: 425, column: 12, scope: !540)
!542 = !DILocation(line: 425, column: 20, scope: !540)
!543 = !DILocation(line: 425, column: 24, scope: !544)
!544 = !DILexicalBlockFile(scope: !540, file: !294, discriminator: 1)
!545 = !DILocation(line: 425, column: 29, scope: !544)
!546 = !DILocation(line: 425, column: 6, scope: !544)
!547 = !DILocation(line: 426, column: 3, scope: !548)
!548 = distinct !DILexicalBlock(scope: !540, file: !294, line: 425, column: 39)
!549 = distinct !{!549, !547}
!550 = !DILocation(line: 426, column: 2, scope: !551)
!551 = !DILexicalBlockFile(scope: !552, file: !294, discriminator: 1)
!552 = distinct !DILexicalBlock(scope: !548, file: !294, line: 426, column: 6)
!553 = !DILocation(line: 426, column: 8, scope: !551)
!554 = !DILocation(line: 426, column: 73, scope: !551)
!555 = !DILocation(line: 427, column: 3, scope: !548)
!556 = !DILocation(line: 430, column: 2, scope: !297)
!557 = !DILocation(line: 430, column: 9, scope: !448)
!558 = !DILocation(line: 430, column: 18, scope: !448)
!559 = !DILocation(line: 430, column: 16, scope: !448)
!560 = !DILocation(line: 430, column: 2, scope: !448)
!561 = !DILocation(line: 431, column: 21, scope: !562)
!562 = distinct !DILexicalBlock(scope: !297, file: !294, line: 430, column: 24)
!563 = !DILocation(line: 431, column: 10, scope: !562)
!564 = !DILocation(line: 431, column: 8, scope: !562)
!565 = !DILocation(line: 432, column: 19, scope: !562)
!566 = !DILocation(line: 432, column: 26, scope: !562)
!567 = !DILocation(line: 432, column: 32, scope: !562)
!568 = !DILocation(line: 432, column: 38, scope: !562)
!569 = !DILocation(line: 432, column: 44, scope: !562)
!570 = !DILocation(line: 433, column: 4, scope: !562)
!571 = !DILocation(line: 433, column: 18, scope: !562)
!572 = !DILocation(line: 433, column: 30, scope: !562)
!573 = !DILocation(line: 432, column: 3, scope: !562)
!574 = !DILocation(line: 430, column: 2, scope: !575)
!575 = !DILexicalBlockFile(scope: !297, file: !294, discriminator: 2)
!576 = distinct !{!576, !556}
!577 = !DILocation(line: 436, column: 6, scope: !578)
!578 = distinct !DILexicalBlock(scope: !297, file: !294, line: 436, column: 6)
!579 = !DILocation(line: 436, column: 6, scope: !297)
!580 = !DILocation(line: 437, column: 7, scope: !581)
!581 = distinct !DILexicalBlock(scope: !582, file: !294, line: 437, column: 7)
!582 = distinct !DILexicalBlock(scope: !578, file: !294, line: 436, column: 18)
!583 = !DILocation(line: 437, column: 18, scope: !581)
!584 = !DILocation(line: 437, column: 7, scope: !582)
!585 = !DILocation(line: 438, column: 23, scope: !586)
!586 = distinct !DILexicalBlock(scope: !581, file: !294, line: 437, column: 23)
!587 = !DILocation(line: 438, column: 30, scope: !586)
!588 = !DILocation(line: 438, column: 36, scope: !586)
!589 = !DILocation(line: 438, column: 4, scope: !586)
!590 = !DILocation(line: 439, column: 23, scope: !586)
!591 = !DILocation(line: 439, column: 30, scope: !586)
!592 = !DILocation(line: 439, column: 36, scope: !586)
!593 = !DILocation(line: 439, column: 4, scope: !586)
!594 = !DILocation(line: 440, column: 3, scope: !586)
!595 = !DILocation(line: 441, column: 8, scope: !582)
!596 = !DILocation(line: 441, column: 3, scope: !582)
!597 = !DILocation(line: 442, column: 8, scope: !582)
!598 = !DILocation(line: 442, column: 3, scope: !582)
!599 = !DILocation(line: 443, column: 2, scope: !582)
!600 = !DILocation(line: 444, column: 14, scope: !601)
!601 = distinct !DILexicalBlock(scope: !578, file: !294, line: 443, column: 9)
!602 = !DILocation(line: 444, column: 21, scope: !601)
!603 = !DILocation(line: 444, column: 27, scope: !601)
!604 = !DILocation(line: 444, column: 3, scope: !601)
!605 = !DILocation(line: 445, column: 14, scope: !601)
!606 = !DILocation(line: 445, column: 21, scope: !601)
!607 = !DILocation(line: 445, column: 27, scope: !601)
!608 = !DILocation(line: 445, column: 3, scope: !601)
!609 = !DILocation(line: 448, column: 14, scope: !297)
!610 = !DILocation(line: 448, column: 2, scope: !297)
!611 = !DILocation(line: 449, column: 2, scope: !297)
!612 = !DILocation(line: 450, column: 1, scope: !297)
!613 = distinct !DISubprogram(name: "usage", scope: !294, file: !294, line: 58, type: !614, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !300)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !306}
!616 = !DILocalVariable(name: "prog", arg: 1, scope: !613, file: !294, line: 58, type: !306)
!617 = !DILocation(line: 58, column: 31, scope: !613)
!618 = !DILocation(line: 75, column: 9, scope: !613)
!619 = !DILocation(line: 60, column: 2, scope: !613)
!620 = !DILocation(line: 76, column: 1, scope: !613)
!621 = distinct !DISubprogram(name: "str_to_num", scope: !294, file: !294, line: 84, type: !622, isLocal: true, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !300)
!622 = !DISubroutineType(types: !623)
!623 = !{!232, !223}
!624 = !DILocalVariable(name: "str", arg: 1, scope: !621, file: !294, line: 84, type: !223)
!625 = !DILocation(line: 84, column: 41, scope: !621)
!626 = !DILocalVariable(name: "s", scope: !621, file: !294, line: 86, type: !223)
!627 = !DILocation(line: 86, column: 8, scope: !621)
!628 = !DILocation(line: 86, column: 12, scope: !621)
!629 = !DILocalVariable(name: "num", scope: !621, file: !294, line: 87, type: !232)
!630 = !DILocation(line: 87, column: 11, scope: !621)
!631 = !DILocation(line: 87, column: 26, scope: !621)
!632 = !DILocation(line: 87, column: 17, scope: !621)
!633 = !DILocation(line: 89, column: 7, scope: !634)
!634 = distinct !DILexicalBlock(scope: !621, file: !294, line: 89, column: 6)
!635 = !DILocation(line: 89, column: 6, scope: !634)
!636 = !DILocation(line: 89, column: 9, scope: !634)
!637 = !DILocation(line: 89, column: 6, scope: !621)
!638 = !DILocation(line: 90, column: 10, scope: !634)
!639 = !DILocation(line: 90, column: 3, scope: !634)
!640 = !DILocation(line: 92, column: 13, scope: !641)
!641 = distinct !DILexicalBlock(scope: !621, file: !294, line: 92, column: 6)
!642 = !DILocation(line: 92, column: 6, scope: !641)
!643 = !DILocation(line: 92, column: 23, scope: !641)
!644 = !DILocation(line: 92, column: 6, scope: !621)
!645 = !DILocation(line: 93, column: 7, scope: !641)
!646 = !DILocation(line: 93, column: 3, scope: !641)
!647 = !DILocation(line: 94, column: 18, scope: !648)
!648 = distinct !DILexicalBlock(scope: !641, file: !294, line: 94, column: 11)
!649 = !DILocation(line: 94, column: 11, scope: !648)
!650 = !DILocation(line: 94, column: 28, scope: !648)
!651 = !DILocation(line: 94, column: 11, scope: !641)
!652 = !DILocation(line: 95, column: 7, scope: !648)
!653 = !DILocation(line: 95, column: 3, scope: !648)
!654 = !DILocation(line: 96, column: 18, scope: !655)
!655 = distinct !DILexicalBlock(scope: !648, file: !294, line: 96, column: 11)
!656 = !DILocation(line: 96, column: 11, scope: !655)
!657 = !DILocation(line: 96, column: 28, scope: !655)
!658 = !DILocation(line: 96, column: 11, scope: !648)
!659 = !DILocation(line: 97, column: 7, scope: !655)
!660 = !DILocation(line: 97, column: 3, scope: !655)
!661 = !DILocation(line: 99, column: 9, scope: !621)
!662 = !DILocation(line: 99, column: 2, scope: !621)
!663 = !DILocation(line: 100, column: 1, scope: !621)
!664 = distinct !DISubprogram(name: "process_in_file", scope: !294, file: !294, line: 172, type: !665, isLocal: true, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !300)
!665 = !DISubroutineType(types: !666)
!666 = !{!295, !329, !306, !335, !225, !295, !295, !295, !295}
!667 = !DILocalVariable(name: "accel", arg: 1, scope: !664, file: !294, line: 172, type: !329)
!668 = !DILocation(line: 172, column: 36, scope: !664)
!669 = !DILocalVariable(name: "in_f", arg: 2, scope: !664, file: !294, line: 172, type: !306)
!670 = !DILocation(line: 172, column: 55, scope: !664)
!671 = !DILocalVariable(name: "ibuf", arg: 3, scope: !664, file: !294, line: 173, type: !335)
!672 = !DILocation(line: 173, column: 16, scope: !664)
!673 = !DILocalVariable(name: "obuf", arg: 4, scope: !664, file: !294, line: 173, type: !225)
!674 = !DILocation(line: 173, column: 28, scope: !664)
!675 = !DILocalVariable(name: "ibuf_size", arg: 5, scope: !664, file: !294, line: 173, type: !295)
!676 = !DILocation(line: 173, column: 38, scope: !664)
!677 = !DILocalVariable(name: "check_result", arg: 6, scope: !664, file: !294, line: 174, type: !295)
!678 = !DILocation(line: 174, column: 11, scope: !664)
!679 = !DILocalVariable(name: "use_sglist", arg: 7, scope: !664, file: !294, line: 175, type: !295)
!680 = !DILocation(line: 175, column: 11, scope: !664)
!681 = !DILocalVariable(name: "use_adler", arg: 8, scope: !664, file: !294, line: 176, type: !295)
!682 = !DILocation(line: 176, column: 32, scope: !664)
!683 = !DILocalVariable(name: "rc", scope: !664, file: !294, line: 178, type: !295)
!684 = !DILocation(line: 178, column: 6, scope: !664)
!685 = !DILocalVariable(name: "size_f", scope: !664, file: !294, line: 178, type: !295)
!686 = !DILocation(line: 178, column: 10, scope: !664)
!687 = !DILocalVariable(name: "st", scope: !664, file: !294, line: 179, type: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !689, line: 46, size: 1152, align: 64, elements: !690)
!689 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop")
!690 = !{!691, !694, !696, !698, !700, !702, !704, !705, !706, !709, !711, !713, !721, !722, !723}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !688, file: !689, line: 48, baseType: !692, size: 64, align: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !693, line: 124, baseType: !234)
!693 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop")
!694 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !688, file: !689, line: 53, baseType: !695, size: 64, align: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !693, line: 127, baseType: !234)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !688, file: !689, line: 61, baseType: !697, size: 64, align: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !693, line: 130, baseType: !234)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !688, file: !689, line: 62, baseType: !699, size: 32, align: 32, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !693, line: 129, baseType: !237)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !688, file: !689, line: 64, baseType: !701, size: 32, align: 32, offset: 224)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !693, line: 125, baseType: !237)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !688, file: !689, line: 65, baseType: !703, size: 32, align: 32, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !693, line: 126, baseType: !237)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !688, file: !689, line: 67, baseType: !295, size: 32, align: 32, offset: 288)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !688, file: !689, line: 69, baseType: !692, size: 64, align: 64, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !688, file: !689, line: 74, baseType: !707, size: 64, align: 64, offset: 384)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !693, line: 131, baseType: !708)
!708 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !688, file: !689, line: 78, baseType: !710, size: 64, align: 64, offset: 448)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !693, line: 153, baseType: !708)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !688, file: !689, line: 80, baseType: !712, size: 64, align: 64, offset: 512)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !693, line: 158, baseType: !708)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !688, file: !689, line: 91, baseType: !714, size: 128, align: 64, offset: 576)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !715, line: 120, size: 128, align: 64, elements: !716)
!715 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop")
!716 = !{!717, !719}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !714, file: !715, line: 122, baseType: !718, size: 64, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !693, line: 139, baseType: !708)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !714, file: !715, line: 123, baseType: !720, size: 64, align: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !693, line: 175, baseType: !708)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !688, file: !689, line: 92, baseType: !714, size: 128, align: 64, offset: 704)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !688, file: !689, line: 93, baseType: !714, size: 128, align: 64, offset: 832)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !688, file: !689, line: 106, baseType: !724, size: 192, align: 64, offset: 960)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 192, align: 64, elements: !278)
!725 = !DILocation(line: 179, column: 14, scope: !664)
!726 = !DILocalVariable(name: "i_fp", scope: !664, file: !294, line: 180, type: !727)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !729, line: 48, baseType: !730)
!729 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop")
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !731, line: 241, size: 1728, align: 64, elements: !732)
!731 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop")
!732 = !{!733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !753, !754, !755, !756, !757, !758, !760, !764, !767, !769, !770, !771, !772, !773, !776, !777}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !730, file: !731, line: 242, baseType: !295, size: 32, align: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !730, file: !731, line: 247, baseType: !223, size: 64, align: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !730, file: !731, line: 248, baseType: !223, size: 64, align: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !730, file: !731, line: 249, baseType: !223, size: 64, align: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !730, file: !731, line: 250, baseType: !223, size: 64, align: 64, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !730, file: !731, line: 251, baseType: !223, size: 64, align: 64, offset: 320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !730, file: !731, line: 252, baseType: !223, size: 64, align: 64, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !730, file: !731, line: 253, baseType: !223, size: 64, align: 64, offset: 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !730, file: !731, line: 254, baseType: !223, size: 64, align: 64, offset: 512)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !730, file: !731, line: 256, baseType: !223, size: 64, align: 64, offset: 576)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !730, file: !731, line: 257, baseType: !223, size: 64, align: 64, offset: 640)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !730, file: !731, line: 258, baseType: !223, size: 64, align: 64, offset: 704)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !730, file: !731, line: 260, baseType: !746, size: 64, align: 64, offset: 768)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64, align: 64)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !731, line: 156, size: 192, align: 64, elements: !748)
!748 = !{!749, !750, !752}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !747, file: !731, line: 157, baseType: !746, size: 64, align: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !747, file: !731, line: 158, baseType: !751, size: 64, align: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !747, file: !731, line: 162, baseType: !295, size: 32, align: 32, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !730, file: !731, line: 262, baseType: !751, size: 64, align: 64, offset: 832)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !730, file: !731, line: 264, baseType: !295, size: 32, align: 32, offset: 896)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !730, file: !731, line: 268, baseType: !295, size: 32, align: 32, offset: 928)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !730, file: !731, line: 270, baseType: !707, size: 64, align: 64, offset: 960)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !730, file: !731, line: 274, baseType: !240, size: 16, align: 16, offset: 1024)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !730, file: !731, line: 275, baseType: !759, size: 8, align: 8, offset: 1040)
!759 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !730, file: !731, line: 276, baseType: !761, size: 8, align: 8, offset: 1048)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 8, align: 8, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 1)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !730, file: !731, line: 280, baseType: !765, size: 64, align: 64, offset: 1088)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !731, line: 150, baseType: null)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !730, file: !731, line: 289, baseType: !768, size: 64, align: 64, offset: 1152)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !693, line: 132, baseType: !708)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !730, file: !731, line: 297, baseType: !225, size: 64, align: 64, offset: 1216)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !730, file: !731, line: 298, baseType: !225, size: 64, align: 64, offset: 1280)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !730, file: !731, line: 299, baseType: !225, size: 64, align: 64, offset: 1344)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !730, file: !731, line: 300, baseType: !225, size: 64, align: 64, offset: 1408)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !730, file: !731, line: 302, baseType: !774, size: 64, align: 64, offset: 1472)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !775, line: 216, baseType: !234)
!775 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop")
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !730, file: !731, line: 303, baseType: !295, size: 32, align: 32, offset: 1536)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !730, file: !731, line: 305, baseType: !778, size: 160, align: 8, offset: 1568)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 160, align: 8, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 20)
!781 = !DILocation(line: 180, column: 8, scope: !664)
!782 = !DILocalVariable(name: "crc", scope: !664, file: !294, line: 181, type: !236)
!783 = !DILocation(line: 181, column: 11, scope: !664)
!784 = !DILocalVariable(name: "m_crc32", scope: !664, file: !294, line: 181, type: !236)
!785 = !DILocation(line: 181, column: 20, scope: !664)
!786 = !DILocalVariable(name: "m_adler32", scope: !664, file: !294, line: 182, type: !236)
!787 = !DILocation(line: 182, column: 11, scope: !664)
!788 = !DILocalVariable(name: "m_inp_processed", scope: !664, file: !294, line: 183, type: !236)
!789 = !DILocation(line: 183, column: 11, scope: !664)
!790 = !DILocalVariable(name: "cmd", scope: !664, file: !294, line: 184, type: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ddcb_cmd", file: !330, line: 154, size: 1856, align: 64, elements: !792)
!792 = !{!793, !794, !795, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !813}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "next_addr", scope: !791, file: !330, line: 155, baseType: !250, size: 64, align: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !791, file: !330, line: 156, baseType: !250, size: 64, align: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "acfunc", scope: !791, file: !330, line: 158, baseType: !796, size: 8, align: 8, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !251, line: 20, baseType: !337)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !791, file: !330, line: 159, baseType: !796, size: 8, align: 8, offset: 136)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "asiv_length", scope: !791, file: !330, line: 160, baseType: !796, size: 8, align: 8, offset: 144)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "asv_length", scope: !791, file: !330, line: 161, baseType: !796, size: 8, align: 8, offset: 152)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "cmdopts", scope: !791, file: !330, line: 162, baseType: !257, size: 16, align: 16, offset: 160)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "retc", scope: !791, file: !330, line: 163, baseType: !257, size: 16, align: 16, offset: 176)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "attn", scope: !791, file: !330, line: 165, baseType: !257, size: 16, align: 16, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "vcrc", scope: !791, file: !330, line: 166, baseType: !257, size: 16, align: 16, offset: 208)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !791, file: !330, line: 167, baseType: !255, size: 32, align: 32, offset: 224)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "deque_ts", scope: !791, file: !330, line: 169, baseType: !250, size: 64, align: 64, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "cmplt_ts", scope: !791, file: !330, line: 170, baseType: !250, size: 64, align: 64, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "disp_ts", scope: !791, file: !330, line: 171, baseType: !250, size: 64, align: 64, offset: 384)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ddata_addr", scope: !791, file: !330, line: 173, baseType: !250, size: 64, align: 64, offset: 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "asv", scope: !791, file: !330, line: 175, baseType: !810, size: 512, align: 8, offset: 512)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 512, align: 8, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, scope: !791, file: !330, line: 177, baseType: !814, size: 832, align: 64, offset: 1024)
!814 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !791, file: !330, line: 177, size: 832, align: 64, elements: !815)
!815 = !{!816, !824}
!816 = !DIDerivedType(tag: DW_TAG_member, scope: !814, file: !330, line: 179, baseType: !817, size: 832, align: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !814, file: !330, line: 179, size: 832, align: 64, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ats", scope: !817, file: !330, line: 180, baseType: !250, size: 64, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "asiv", scope: !817, file: !330, line: 181, baseType: !821, size: 768, align: 8, offset: 64)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 768, align: 8, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__asiv", scope: !814, file: !330, line: 184, baseType: !825, size: 832, align: 8)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 832, align: 8, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 104)
!828 = !DILocation(line: 184, column: 18, scope: !664)
!829 = !DILocalVariable(name: "xerrno", scope: !664, file: !294, line: 185, type: !295)
!830 = !DILocation(line: 185, column: 6, scope: !664)
!831 = !DILocation(line: 187, column: 6, scope: !832)
!832 = distinct !DILexicalBlock(scope: !664, file: !294, line: 187, column: 6)
!833 = !DILocation(line: 187, column: 6, scope: !664)
!834 = !DILocation(line: 188, column: 9, scope: !832)
!835 = !DILocation(line: 188, column: 7, scope: !832)
!836 = !DILocation(line: 188, column: 3, scope: !832)
!837 = !DILocation(line: 191, column: 11, scope: !838)
!838 = distinct !DILexicalBlock(scope: !664, file: !294, line: 191, column: 6)
!839 = !DILocation(line: 191, column: 6, scope: !838)
!840 = !DILocation(line: 191, column: 22, scope: !838)
!841 = !DILocation(line: 191, column: 6, scope: !664)
!842 = !DILocation(line: 192, column: 10, scope: !843)
!843 = distinct !DILexicalBlock(scope: !838, file: !294, line: 191, column: 29)
!844 = !DILocation(line: 193, column: 14, scope: !843)
!845 = !DILocation(line: 193, column: 13, scope: !843)
!846 = !DILocation(line: 193, column: 4, scope: !847)
!847 = !DILexicalBlockFile(scope: !843, file: !294, discriminator: 1)
!848 = !DILocation(line: 192, column: 3, scope: !843)
!849 = !DILocation(line: 194, column: 4, scope: !843)
!850 = !DILocation(line: 196, column: 14, scope: !664)
!851 = !DILocation(line: 196, column: 11, scope: !664)
!852 = !DILocation(line: 196, column: 9, scope: !664)
!853 = !DILocation(line: 198, column: 15, scope: !664)
!854 = !DILocation(line: 198, column: 9, scope: !664)
!855 = !DILocation(line: 198, column: 7, scope: !664)
!856 = !DILocation(line: 199, column: 7, scope: !857)
!857 = distinct !DILexicalBlock(scope: !664, file: !294, line: 199, column: 6)
!858 = !DILocation(line: 199, column: 6, scope: !664)
!859 = !DILocation(line: 200, column: 3, scope: !860)
!860 = distinct !DILexicalBlock(scope: !857, file: !294, line: 199, column: 13)
!861 = distinct !{!861, !859}
!862 = !DILocation(line: 200, column: 2, scope: !863)
!863 = !DILexicalBlockFile(scope: !864, file: !294, discriminator: 1)
!864 = distinct !DILexicalBlock(scope: !860, file: !294, line: 200, column: 6)
!865 = !DILocation(line: 200, column: 5, scope: !863)
!866 = !DILocation(line: 200, column: 4, scope: !863)
!867 = !DILocation(line: 200, column: 3, scope: !863)
!868 = !DILocation(line: 200, column: 11, scope: !869)
!869 = !DILexicalBlockFile(scope: !863, file: !294, discriminator: 2)
!870 = !DILocation(line: 200, column: 8, scope: !871)
!871 = !DILexicalBlockFile(scope: !863, file: !294, discriminator: 3)
!872 = !DILocation(line: 200, column: 6, scope: !863)
!873 = !DILocation(line: 202, column: 3, scope: !860)
!874 = !DILocation(line: 205, column: 2, scope: !664)
!875 = !DILocation(line: 205, column: 9, scope: !876)
!876 = !DILexicalBlockFile(scope: !664, file: !294, discriminator: 1)
!877 = !DILocation(line: 205, column: 2, scope: !876)
!878 = !DILocalVariable(name: "tocopy", scope: !879, file: !294, line: 206, type: !295)
!879 = distinct !DILexicalBlock(scope: !664, file: !294, line: 205, column: 17)
!880 = !DILocation(line: 206, column: 7, scope: !879)
!881 = !DILocalVariable(name: "_a", scope: !882, file: !294, line: 206, type: !295)
!882 = distinct !DILexicalBlock(scope: !879, file: !294, line: 206, column: 17)
!883 = !DILocation(line: 206, column: 42, scope: !882)
!884 = !DILocation(line: 206, column: 48, scope: !882)
