; ModuleID = './hgfsmounter.o.i'
source_filename = "./hgfsmounter.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.MountOptions = type { i8*, i32, i8, i8*, i8*, i8 (i8*, %struct.HgfsMountInfo*, i32*)* }
%struct.HgfsMountInfo = type <{ i32, i32, i32, i32, i32, i32, i8, i32, i8, i16, i16, i32, i8*, i8* }>
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.mntent = type { i8*, i8*, i8*, i8*, i32, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }

@vm_version = constant [20 x i8] c"version=10.3.0.5330\00", section ".modinfo", align 16
@thisProgram = internal global i8* null, align 8
@thisProgramBase = internal global i8* null, align 8
@.str = private unnamed_addr constant [7 x i8] c"hno:vV\00", align 1
@optarg = external global i8*, align 8
@.str.1 = private unnamed_addr constant [2 x i8] c",\00", align 1
@.str.2 = private unnamed_addr constant [46 x i8] c"Error: could not allocate memory for options\0A\00", align 1

!16 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!17 = !DIEnumerator(name: "_ISspace", value: 8192)
!18 = !DIEnumerator(name: "_ISprint", value: 16384)
!19 = !DIEnumerator(name: "_ISgraph", value: 32768)
!20 = !DIEnumerator(name: "_ISblank", value: 1)
!21 = !DIEnumerator(name: "_IScntrl", value: 2)
!22 = !DIEnumerator(name: "_ISpunct", value: 4)
!23 = !DIEnumerator(name: "_ISalnum", value: 8)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 24, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/confname.h", directory: "/home/lichi/Desktop/open-vm-tools/line1289")
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47}
!27 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0)
!28 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1)
!29 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2)
!30 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3)
!31 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4)
!32 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5)
!33 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6)
!34 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7)
!35 = !DIEnumerator(name: "_PC_VDISABLE", value: 8)
!36 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9)
!37 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10)
!38 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11)
!39 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12)
!40 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13)
!41 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14)
!42 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15)
!43 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16)
!44 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17)
!45 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18)
!46 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!47 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 33, size: 32, align: 32, elements: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/mount.h", directory: "/home/lichi/Desktop/open-vm-tools/line1289")
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76}
!51 = !DIEnumerator(name: "MS_RDONLY", value: 1)
!52 = !DIEnumerator(name: "MS_NOSUID", value: 2)
!53 = !DIEnumerator(name: "MS_NODEV", value: 4)
!54 = !DIEnumerator(name: "MS_NOEXEC", value: 8)
!55 = !DIEnumerator(name: "MS_SYNCHRONOUS", value: 16)
!56 = !DIEnumerator(name: "MS_REMOUNT", value: 32)
!57 = !DIEnumerator(name: "MS_MANDLOCK", value: 64)
!58 = !DIEnumerator(name: "MS_DIRSYNC", value: 128)
!59 = !DIEnumerator(name: "MS_NOATIME", value: 1024)
!60 = !DIEnumerator(name: "MS_NODIRATIME", value: 2048)
!61 = !DIEnumerator(name: "MS_BIND", value: 4096)
!62 = !DIEnumerator(name: "MS_MOVE", value: 8192)
!63 = !DIEnumerator(name: "MS_REC", value: 16384)
!64 = !DIEnumerator(name: "MS_SILENT", value: 32768)
!65 = !DIEnumerator(name: "MS_POSIXACL", value: 65536)
!66 = !DIEnumerator(name: "MS_UNBINDABLE", value: 131072)
!67 = !DIEnumerator(name: "MS_PRIVATE", value: 262144)
!68 = !DIEnumerator(name: "MS_SLAVE", value: 524288)
!69 = !DIEnumerator(name: "MS_SHARED", value: 1048576)
!70 = !DIEnumerator(name: "MS_RELATIME", value: 2097152)
!71 = !DIEnumerator(name: "MS_KERNMOUNT", value: 4194304)
!72 = !DIEnumerator(name: "MS_I_VERSION", value: 8388608)
!73 = !DIEnumerator(name: "MS_STRICTATIME", value: 16777216)
!74 = !DIEnumerator(name: "MS_LAZYTIME", value: 33554432)
!75 = !DIEnumerator(name: "MS_ACTIVE", value: 1073741824)
!76 = !DIEnumerator(name: "MS_NOUSER", value: -2147483648)
!77 = !{!78, !79, !80}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!79 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!80 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!81 = !{!82, !89, !91, !92, !93, !94, !144}
!82 = distinct !DIGlobalVariable(name: "vm_version", scope: !0, file: !83, line: 109, type: !84, isLocal: false, isDefinition: true, variable: [20 x i8]* @vm_version)
!83 = !DIFile(filename: "hgfsmounter.c", directory: "/home/lichi/Desktop/open-vm-tools/line1289")
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 160, align: 8, elements: !87)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!86 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !{!88}
!88 = !DISubrange(count: 20)
!89 = distinct !DIGlobalVariable(name: "thisProgram", scope: !0, file: !83, line: 142, type: !90, isLocal: true, isDefinition: true, variable: i8** @thisProgram)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!91 = distinct !DIGlobalVariable(name: "thisProgramBase", scope: !0, file: !83, line: 143, type: !90, isLocal: true, isDefinition: true, variable: i8** @thisProgramBase)
!92 = distinct !DIGlobalVariable(name: "shareName", scope: !0, file: !83, line: 144, type: !90, isLocal: true, isDefinition: true, variable: i8** @shareName)
!93 = distinct !DIGlobalVariable(name: "mountPoint", scope: !0, file: !83, line: 145, type: !90, isLocal: true, isDefinition: true, variable: i8** @mountPoint)
!94 = distinct !DIGlobalVariable(name: "mountOptions", scope: !0, file: !83, line: 672, type: !95, isLocal: true, isDefinition: true, variable: [26 x %struct.MountOptions]* @mountOptions)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 8320, align: 64, elements: !142)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "MountOptions", file: !83, line: 140, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MountOptions", file: !83, line: 131, size: 320, align: 64, elements: !98)
!98 = !{!99, !100, !101, !104, !105, !106}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !97, file: !83, line: 132, baseType: !90, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !97, file: !83, line: 133, baseType: !79, size: 32, align: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !97, file: !83, line: 134, baseType: !102, size: 8, align: 8, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !103, line: 230, baseType: !86)
!103 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1289")
!104 = !DIDerivedType(tag: DW_TAG_member, name: "helpMsg", scope: !97, file: !83, line: 135, baseType: !90, size: 64, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "logMsg", scope: !97, file: !83, line: 136, baseType: !90, size: 64, align: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !97, file: !83, line: 138, baseType: !107, size: 64, align: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!102, !110, !111, !141}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsMountInfo", file: !4, line: 103, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsMountInfo", file: !4, line: 75, size: 432, align: 8, elements: !114)
!114 = !{!115, !120, !121, !123, !124, !125, !130, !131, !135, !136, !137, !138, !139, !140}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "magicNumber", scope: !113, file: !4, line: 76, baseType: !116, size: 32, align: 32)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !103, line: 173, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !118, line: 51, baseType: !119)
!118 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line1289")
!119 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "infoSize", scope: !113, file: !4, line: 77, baseType: !116, size: 32, align: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !113, file: !4, line: 78, baseType: !122, size: 32, align: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsMountInfoVersion", file: !4, line: 58, baseType: !3)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !113, file: !4, line: 79, baseType: !116, size: 32, align: 32, offset: 96)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !113, file: !4, line: 80, baseType: !116, size: 32, align: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !113, file: !4, line: 82, baseType: !126, size: 32, align: 32, offset: 160)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !127, line: 43, baseType: !128)
!127 = !DIFile(filename: "/usr/include/pwd.h", directory: "/home/lichi/Desktop/open-vm-tools/line1289")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !129, line: 125, baseType: !119)
!129 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1289")
!130 = !DIDerivedType(tag: DW_TAG_member, name: "uidSet", scope: !113, file: !4, line: 83, baseType: !102, size: 8, align: 8, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !113, file: !4, line: 84, baseType: !132, size: 32, align: 32, offset: 200)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !133, line: 37, baseType: !134)
!133 = !DIFile(filename: "/usr/include/grp.h", directory: "/home/lichi/Desktop/open-vm-tools/line1289")
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !129, line: 126, baseType: !119)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "gidSet", scope: !113, file: !4, line: 85, baseType: !102, size: 8, align: 8, offset: 232)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "fmask", scope: !113, file: !4, line: 86, baseType: !80, size: 16, align: 16, offset: 240)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "dmask", scope: !113, file: !4, line: 87, baseType: !80, size: 16, align: 16, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !113, file: !4, line: 88, baseType: !116, size: 32, align: 32, offset: 272)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "shareNameHost", scope: !113, file: !4, line: 93, baseType: !110, size: 64, align: 64, offset: 304)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "shareNameDir", scope: !113, file: !4, line: 94, baseType: !110, size: 64, align: 64, offset: 368)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!142 = !{!143}
!143 = !DISubrange(count: 26)
!144 = distinct !DIGlobalVariable(name: "beVerbose", scope: !0, file: !83, line: 146, type: !102, isLocal: true, isDefinition: true, variable: i8* @beVerbose)
!145 = !{i32 2, !"Dwarf Version", i32 4}
!146 = !{i32 2, !"Debug Info Version", i32 3}
!147 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!148 = distinct !DISubprogram(name: "main", scope: !83, file: !83, line: 1025, type: !149, isLocal: false, isDefinition: true, scopeLine: 1027, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!149 = !DISubroutineType(types: !150)
!150 = !{!79, !79, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!152 = !{}
!153 = !DILocalVariable(name: "argc", arg: 1, scope: !148, file: !83, line: 1025, type: !79)
!154 = !DIExpression()
!155 = !DILocation(line: 1025, column: 10, scope: !148)
!156 = !DILocalVariable(name: "argv", arg: 2, scope: !148, file: !83, line: 1026, type: !151)
!157 = !DILocation(line: 1026, column: 12, scope: !148)
!158 = !DILocalVariable(name: "doMtab", scope: !148, file: !83, line: 1029, type: !102)
!159 = !DILocation(line: 1029, column: 9, scope: !148)
!160 = !DILocalVariable(name: "c", scope: !148, file: !83, line: 1031, type: !86)
!161 = !DILocation(line: 1031, column: 9, scope: !148)
!162 = !DILocalVariable(name: "i", scope: !148, file: !83, line: 1032, type: !79)
!163 = !DILocation(line: 1032, column: 8, scope: !148)
!164 = !DILocalVariable(name: "result", scope: !148, file: !83, line: 1033, type: !79)
!165 = !DILocation(line: 1033, column: 8, scope: !148)
!166 = !DILocalVariable(name: "flags", scope: !148, file: !83, line: 1034, type: !79)
!167 = !DILocation(line: 1034, column: 8, scope: !148)
!168 = !DILocalVariable(name: "mntRes", scope: !148, file: !83, line: 1035, type: !79)
!169 = !DILocation(line: 1035, column: 8, scope: !148)
!170 = !DILocalVariable(name: "optionString", scope: !148, file: !83, line: 1036, type: !90)
!171 = !DILocation(line: 1036, column: 10, scope: !148)
!172 = !DILocalVariable(name: "shareNameHost", scope: !148, file: !83, line: 1037, type: !110)
!173 = !DILocation(line: 1037, column: 16, scope: !148)
!174 = !DILocalVariable(name: "shareNameDir", scope: !148, file: !83, line: 1038, type: !110)
!175 = !DILocation(line: 1038, column: 16, scope: !148)
!176 = !DILocalVariable(name: "statBuf", scope: !148, file: !83, line: 1039, type: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !178, line: 46, size: 1152, align: 64, elements: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/open-vm-tools/line1289")
!179 = !{!180, !183, !185, !187, !189, !190, !191, !192, !193, !196, !198, !200, !208, !209, !210}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !177, file: !178, line: 48, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !129, line: 124, baseType: !182)
!182 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !177, file: !178, line: 53, baseType: !184, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !129, line: 127, baseType: !182)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !177, file: !178, line: 61, baseType: !186, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !129, line: 130, baseType: !182)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !177, file: !178, line: 62, baseType: !188, size: 32, align: 32, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !129, line: 129, baseType: !119)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !177, file: !178, line: 64, baseType: !128, size: 32, align: 32, offset: 224)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !177, file: !178, line: 65, baseType: !134, size: 32, align: 32, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !177, file: !178, line: 67, baseType: !79, size: 32, align: 32, offset: 288)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !177, file: !178, line: 69, baseType: !181, size: 64, align: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !177, file: !178, line: 74, baseType: !194, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !129, line: 131, baseType: !195)
!195 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !177, file: !178, line: 78, baseType: !197, size: 64, align: 64, offset: 448)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !129, line: 153, baseType: !195)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !177, file: !178, line: 80, baseType: !199, size: 64, align: 64, offset: 512)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !129, line: 158, baseType: !195)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !177, file: !178, line: 91, baseType: !201, size: 128, align: 64, offset: 576)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !202, line: 120, size: 128, align: 64, elements: !203)
!202 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line1289")
!203 = !{!204, !206}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !201, file: !202, line: 122, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !129, line: 139, baseType: !195)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !201, file: !202, line: 123, baseType: !207, size: 64, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !129, line: 175, baseType: !195)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !177, file: !178, line: 92, baseType: !201, size: 128, align: 64, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !177, file: !178, line: 93, baseType: !201, size: 128, align: 64, offset: 832)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !177, file: !178, line: 106, baseType: !211, size: 192, align: 64, offset: 960)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 192, align: 64, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 3)
!214 = !DILocation(line: 1039, column: 16, scope: !148)
!215 = !DILocalVariable(name: "mountInfo", scope: !148, file: !83, line: 1040, type: !112)
!216 = !DILocation(line: 1040, column: 18, scope: !148)
!217 = !DILocalVariable(name: "canonicalizedPath", scope: !148, file: !83, line: 1041, type: !90)
!218 = !DILocation(line: 1041, column: 10, scope: !148)
!219 = !DILocalVariable(name: "pathMax", scope: !148, file: !83, line: 1042, type: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !221, line: 216, baseType: !182)
!221 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1289")
!222 = !DILocation(line: 1042, column: 11, scope: !148)
!223 = !DILocation(line: 1044, column: 18, scope: !148)
!224 = !DILocation(line: 1044, column: 16, scope: !148)
!225 = !DILocation(line: 1047, column: 30, scope: !148)
!226 = !DILocation(line: 1047, column: 22, scope: !148)
!227 = !DILocation(line: 1047, column: 20, scope: !148)
!228 = !DILocation(line: 1048, column: 8, scope: !229)
!229 = distinct !DILexicalBlock(scope: !148, file: !83, line: 1048, column: 8)
!230 = !DILocation(line: 1048, column: 24, scope: !229)
!231 = !DILocation(line: 1048, column: 8, scope: !148)
!232 = !DILocation(line: 1049, column: 22, scope: !233)
!233 = distinct !DILexicalBlock(scope: !229, file: !83, line: 1048, column: 32)
!234 = !DILocation(line: 1050, column: 4, scope: !233)
!235 = !DILocation(line: 1051, column: 25, scope: !236)
!236 = distinct !DILexicalBlock(scope: !229, file: !83, line: 1050, column: 11)
!237 = !DILocation(line: 1051, column: 23, scope: !236)
!238 = !DILocation(line: 1053, column: 4, scope: !148)
!239 = !DILocation(line: 1055, column: 8, scope: !240)
!240 = distinct !DILexicalBlock(scope: !148, file: !83, line: 1055, column: 8)
!241 = !DILocation(line: 1055, column: 13, scope: !240)
!242 = !DILocation(line: 1055, column: 8, scope: !148)
!243 = !DILocation(line: 1056, column: 7, scope: !244)
!244 = distinct !DILexicalBlock(scope: !240, file: !83, line: 1055, column: 18)
!245 = !DILocation(line: 1057, column: 4, scope: !244)
!246 = !DILocation(line: 1059, column: 4, scope: !148)
!247 = !DILocation(line: 1059, column: 23, scope: !248)
!248 = !DILexicalBlockFile(scope: !148, file: !83, discriminator: 1)
!249 = !DILocation(line: 1059, column: 29, scope: !248)
!250 = !DILocation(line: 1059, column: 16, scope: !248)
!251 = !DILocation(line: 1059, column: 14, scope: !248)
!252 = !DILocation(line: 1059, column: 11, scope: !248)
!253 = !DILocation(line: 1059, column: 46, scope: !248)
!254 = !DILocation(line: 1059, column: 4, scope: !248)
!255 = !DILocation(line: 1060, column: 15, scope: !256)
!256 = distinct !DILexicalBlock(scope: !148, file: !83, line: 1059, column: 53)
!257 = !DILocation(line: 1060, column: 7, scope: !256)
!258 = !DILocation(line: 1063, column: 10, scope: !259)
!259 = distinct !DILexicalBlock(scope: !256, file: !83, line: 1060, column: 18)
!260 = !DILocation(line: 1066, column: 17, scope: !259)
!261 = !DILocation(line: 1067, column: 10, scope: !259)
!262 = !DILocation(line: 1070, column: 14, scope: !263)
!263 = distinct !DILexicalBlock(scope: !259, file: !83, line: 1070, column: 14)
!264 = !DILocation(line: 1070, column: 27, scope: !263)
!265 = !DILocation(line: 1070, column: 14, scope: !259)
!266 = !DILocation(line: 1071, column: 35, scope: !267)
!267 = distinct !DILexicalBlock(scope: !263, file: !83, line: 1070, column: 35)
!268 = !DILocation(line: 1071, column: 28, scope: !267)
!269 = !DILocation(line: 1071, column: 26, scope: !267)
!270 = !DILocation(line: 1072, column: 10, scope: !267)
!271 = !DILocalVariable(name: "newLength", scope: !272, file: !83, line: 1073, type: !220)
!272 = distinct !DILexicalBlock(scope: !263, file: !83, line: 1072, column: 17)
!273 = !DILocation(line: 1073, column: 20, scope: !272)
!274 = !DILocalVariable(name: "savedString", scope: !272, file: !83, line: 1074, type: !90)
!275 = !DILocation(line: 1074, column: 19, scope: !272)
!276 = !DILocation(line: 1074, column: 33, scope: !272)
!277 = !DILocation(line: 1075, column: 32, scope: !272)
!278 = !DILocation(line: 1075, column: 25, scope: !272)
!279 = !DILocation(line: 1075, column: 46, scope: !272)
!280 = !DILocation(line: 1076, column: 32, scope: !272)
!281 = !DILocation(line: 1076, column: 25, scope: !272)
!282 = !DILocation(line: 1075, column: 60, scope: !272)
!283 = !DILocation(line: 1076, column: 40, scope: !272)
!284 = !DILocation(line: 1075, column: 23, scope: !272)
!285 = !DILocation(line: 1077, column: 36, scope: !272)
!286 = !DILocation(line: 1077, column: 50, scope: !272)
!287 = !DILocation(line: 1077, column: 28, scope: !272)
!288 = !DILocation(line: 1077, column: 26, scope: !272)
!289 = !DILocation(line: 1078, column: 17, scope: !290)
!290 = distinct !DILexicalBlock(scope: !272, file: !83, line: 1078, column: 17)
!291 = !DILocation(line: 1078, column: 30, scope: !290)
!292 = !DILocation(line: 1078, column: 17, scope: !272)
!293 = !DILocation(line: 1079, column: 27, scope: !294)
!294 = distinct !DILexicalBlock(scope: !290, file: !83, line: 1078, column: 38)
!295 = !DILocation(line: 1079, column: 46, scope: !294)
!296 = !DILocation(line: 1079, column: 16, scope: !294)
!297 = !DILocation(line: 1080, column: 27, scope: !294)
!298 = !DILocation(line: 1080, column: 41, scope: !294)
!299 = !DILocation(line: 1080, column: 49, scope: !294)
!300 = !DILocation(line: 1080, column: 16, scope: !294)
!301 = !DILocation(line: 1081, column: 13, scope: !294)
!302 = !DILocation(line: 1082, column: 21, scope: !303)
!303 = distinct !DILexicalBlock(scope: !290, file: !83, line: 1081, column: 20)
!304 = !DILocation(line: 1082, column: 16, scope: !303)
!305 = !DILocation(line: 1085, column: 14, scope: !306)
!306 = distinct !DILexicalBlock(scope: !259, file: !83, line: 1085, column: 14)
!307 = !DILocation(line: 1085, column: 27, scope: !306)
!308 = !DILocation(line: 1085, column: 14, scope: !259)
!309 = !DILocation(line: 1086, column: 13, scope: !310)
!310 = distinct !DILexicalBlock(scope: !306, file: !83, line: 1085, column: 35)
!311 = !DILocation(line: 1087, column: 13, scope: !310)
!312 = !DILocation(line: 1089, column: 10, scope: !259)
!313 = !DILocation(line: 1091, column: 20, scope: !259)
!314 = !DILocation(line: 1092, column: 10, scope: !259)
!315 = !DILocation(line: 1094, column: 10, scope: !259)
!316 = !DILocation(line: 1096, column: 53, scope: !259)
!317 = !DILocation(line: 1096, column: 10, scope: !259)
!318 = !DILocation(line: 1097, column: 10, scope: !259)
!319 = !DILocation(line: 1098, column: 7, scope: !259)
!320 = !DILocation(line: 1059, column: 4, scope: !321)
!321 = !DILexicalBlockFile(scope: !148, file: !83, discriminator: 2)
!322 = distinct !{!322, !246}
!323 = !DILocation(line: 1101, column: 5, scope: !148)
!324 = !DILocation(line: 1101, column: 55, scope: !248)
!325 = !DILocation(line: 1101, column: 17, scope: !248)
!326 = !DILocation(line: 1101, column: 5, scope: !248)
!327 = !DILocation(line: 1101, column: 5, scope: !321)
!328 = !DILocation(line: 1101, column: 5, scope: !329)
!329 = !DILexicalBlockFile(scope: !148, file: !83, discriminator: 3)
!330 = !DILocation(line: 1102, column: 11, scope: !331)
!331 = distinct !DILexicalBlock(scope: !148, file: !83, line: 1102, column: 4)
!332 = !DILocation(line: 1102, column: 9, scope: !331)
!333 = !DILocation(line: 1102, column: 16, scope: !334)
!334 = !DILexicalBlockFile(scope: !335, file: !83, discriminator: 1)
!335 = distinct !DILexicalBlock(scope: !331, file: !83, line: 1102, column: 4)
!336 = !DILocation(line: 1102, column: 20, scope: !334)
!337 = !DILocation(line: 1102, column: 18, scope: !334)
!338 = !DILocation(line: 1102, column: 4, scope: !334)
!339 = !DILocation(line: 1103, column: 8, scope: !340)
!340 = distinct !DILexicalBlock(scope: !335, file: !83, line: 1102, column: 31)
!341 = !DILocation(line: 1103, column: 39, scope: !342)
!342 = !DILexicalBlockFile(scope: !340, file: !83, discriminator: 1)
!343 = !DILocation(line: 1103, column: 34, scope: !342)
!344 = !DILocation(line: 1103, column: 20, scope: !342)
!345 = !DILocation(line: 1103, column: 8, scope: !342)
!346 = !DILocation(line: 1103, column: 8, scope: !347)
!347 = !DILexicalBlockFile(scope: !340, file: !83, discriminator: 2)
!348 = !DILocation(line: 1103, column: 8, scope: !349)
!349 = !DILexicalBlockFile(scope: !340, file: !83, discriminator: 3)
!350 = !DILocation(line: 1104, column: 4, scope: !340)
!351 = !DILocation(line: 1102, column: 27, scope: !352)
!352 = !DILexicalBlockFile(scope: !335, file: !83, discriminator: 2)
!353 = !DILocation(line: 1102, column: 4, scope: !352)
!354 = distinct !{!354, !355}
!355 = !DILocation(line: 1102, column: 4, scope: !148)
!356 = !DILocation(line: 1105, column: 5, scope: !148)
!357 = !DILocation(line: 1105, column: 17, scope: !248)
!358 = !DILocation(line: 1105, column: 5, scope: !248)
!359 = !DILocation(line: 1105, column: 5, scope: !321)
!360 = !DILocation(line: 1105, column: 5, scope: !329)
!361 = !DILocation(line: 1108, column: 21, scope: !148)
!362 = !DILocation(line: 1108, column: 16, scope: !148)
!363 = !DILocation(line: 1108, column: 14, scope: !148)
!364 = !DILocation(line: 1109, column: 22, scope: !148)
!365 = !DILocation(line: 1109, column: 29, scope: !148)
!366 = !DILocation(line: 1109, column: 17, scope: !148)
!367 = !DILocation(line: 1109, column: 15, scope: !148)
!368 = !DILocation(line: 1116, column: 25, scope: !148)
!369 = !DILocation(line: 1116, column: 14, scope: !148)
!370 = !DILocation(line: 1116, column: 12, scope: !148)
!371 = !DILocation(line: 1117, column: 31, scope: !148)
!372 = !DILocation(line: 1117, column: 39, scope: !148)
!373 = !DILocation(line: 1117, column: 24, scope: !148)
!374 = !DILocation(line: 1117, column: 22, scope: !148)
!375 = !DILocation(line: 1118, column: 8, scope: !376)
!376 = distinct !DILexicalBlock(scope: !148, file: !83, line: 1118, column: 8)
!377 = !DILocation(line: 1118, column: 26, scope: !376)
!378 = !DILocation(line: 1118, column: 8, scope: !148)
!379 = !DILocation(line: 1119, column: 7, scope: !380)
!380 = distinct !DILexicalBlock(scope: !376, file: !83, line: 1118, column: 34)
!381 = !DILocation(line: 1121, column: 7, scope: !380)
!382 = !DILocation(line: 1122, column: 25, scope: !383)
!383 = distinct !DILexicalBlock(scope: !376, file: !83, line: 1122, column: 15)
!384 = !DILocation(line: 1122, column: 37, scope: !383)
!385 = !DILocation(line: 1122, column: 16, scope: !383)
!386 = !DILocation(line: 1122, column: 15, scope: !376)
!387 = !DILocation(line: 1123, column: 7, scope: !388)
!388 = distinct !DILexicalBlock(scope: !383, file: !83, line: 1122, column: 57)
!389 = !DILocation(line: 1124, column: 7, scope: !388)
!390 = !DILocation(line: 1126, column: 17, scope: !148)
!391 = !DILocation(line: 1126, column: 15, scope: !148)
!392 = !DILocation(line: 1128, column: 24, scope: !393)
!393 = distinct !DILexicalBlock(scope: !148, file: !83, line: 1128, column: 8)
!394 = !DILocation(line: 1128, column: 9, scope: !393)
!395 = !DILocation(line: 1128, column: 8, scope: !148)
!396 = !DILocation(line: 1129, column: 7, scope: !397)
!397 = distinct !DILexicalBlock(scope: !393, file: !83, line: 1128, column: 67)
!398 = !DILocation(line: 1130, column: 7, scope: !397)
!399 = !DILocation(line: 1133, column: 14, scope: !148)
!400 = !DILocation(line: 1133, column: 26, scope: !148)
!401 = !DILocation(line: 1134, column: 14, scope: !148)
!402 = !DILocation(line: 1134, column: 23, scope: !148)
!403 = !DILocation(line: 1135, column: 14, scope: !148)
!404 = !DILocation(line: 1135, column: 22, scope: !148)
!405 = !DILocation(line: 1138, column: 14, scope: !148)
!406 = !DILocation(line: 1138, column: 20, scope: !148)
!407 = !DILocation(line: 1139, column: 14, scope: !148)
!408 = !DILocation(line: 1139, column: 20, scope: !148)
!409 = !DILocation(line: 1140, column: 14, scope: !148)
!410 = !DILocation(line: 1140, column: 21, scope: !148)
!411 = !DILocation(line: 1141, column: 14, scope: !148)
!412 = !DILocation(line: 1141, column: 21, scope: !148)
!413 = !DILocation(line: 1142, column: 14, scope: !148)
!414 = !DILocation(line: 1142, column: 18, scope: !148)
!415 = !DILocation(line: 1147, column: 30, scope: !148)
!416 = !DILocation(line: 1147, column: 14, scope: !148)
!417 = !DILocation(line: 1147, column: 28, scope: !148)
!418 = !DILocation(line: 1148, column: 29, scope: !148)
!419 = !DILocation(line: 1148, column: 14, scope: !148)
!420 = !DILocation(line: 1148, column: 27, scope: !148)
!421 = !DILocation(line: 1154, column: 14, scope: !148)
!422 = !DILocation(line: 1154, column: 20, scope: !148)
!423 = !DILocation(line: 1160, column: 8, scope: !424)
!424 = distinct !DILexicalBlock(scope: !148, file: !83, line: 1160, column: 8)
!425 = !DILocation(line: 1160, column: 21, scope: !424)
!426 = !DILocation(line: 1160, column: 38, scope: !427)
!427 = !DILexicalBlockFile(scope: !424, file: !83, discriminator: 1)
!428 = !DILocation(line: 1160, column: 25, scope: !427)
!429 = !DILocation(line: 1160, column: 8, scope: !427)
!430 = !DILocation(line: 1161, column: 7, scope: !431)
!431 = distinct !DILexicalBlock(scope: !424, file: !83, line: 1160, column: 73)
!432 = !DILocation(line: 1162, column: 7, scope: !431)
!433 = !DILocation(line: 1166, column: 13, scope: !434)
!434 = distinct !DILexicalBlock(scope: !148, file: !83, line: 1166, column: 8)
!435 = !DILocation(line: 1166, column: 8, scope: !434)
!436 = !DILocation(line: 1166, column: 8, scope: !148)
!437 = !DILocation(line: 1167, column: 7, scope: !438)
!438 = distinct !DILexicalBlock(scope: !434, file: !83, line: 1166, column: 36)
!439 = !DILocation(line: 1168, column: 7, scope: !438)
!440 = !DILocation(line: 1170, column: 15, scope: !441)
!441 = distinct !DILexicalBlock(scope: !148, file: !83, line: 1170, column: 7)
!442 = !DILocation(line: 1170, column: 10, scope: !441)
!443 = !DILocation(line: 1170, column: 21, scope: !441)
!444 = !DILocation(line: 1170, column: 32, scope: !441)
!445 = !DILocation(line: 1170, column: 7, scope: !148)
!446 = !DILocation(line: 1171, column: 64, scope: !447)
!447 = distinct !DILexicalBlock(scope: !441, file: !83, line: 1170, column: 38)
!448 = !DILocation(line: 1171, column: 7, scope: !447)
!449 = !DILocation(line: 1172, column: 7, scope: !447)
!450 = !DILocation(line: 1179, column: 8, scope: !451)
!451 = distinct !DILexicalBlock(scope: !148, file: !83, line: 1179, column: 8)
!452 = !DILocation(line: 1179, column: 18, scope: !451)
!453 = !DILocation(line: 1179, column: 8, scope: !148)
!454 = !DILocation(line: 1181, column: 14, scope: !455)
!455 = distinct !DILexicalBlock(scope: !451, file: !83, line: 1179, column: 24)
!456 = !DILocation(line: 1180, column: 7, scope: !455)
!457 = !DILocation(line: 1182, column: 7, scope: !455)
!458 = !DILocation(line: 1183, column: 15, scope: !459)
!459 = distinct !DILexicalBlock(scope: !451, file: !83, line: 1183, column: 15)
!460 = !DILocation(line: 1183, column: 24, scope: !459)
!461 = !DILocation(line: 1183, column: 29, scope: !459)
!462 = !DILocation(line: 1183, column: 33, scope: !463)
!463 = !DILexicalBlockFile(scope: !459, file: !83, discriminator: 1)
!464 = !DILocation(line: 1183, column: 53, scope: !463)
!465 = !DILocation(line: 1183, column: 42, scope: !463)
!466 = !DILocation(line: 1183, column: 60, scope: !463)
!467 = !DILocation(line: 1184, column: 42, scope: !459)
!468 = !DILocation(line: 1184, column: 50, scope: !459)
!469 = !DILocation(line: 1184, column: 60, scope: !459)
!470 = !DILocation(line: 1183, column: 15, scope: !471)
!471 = !DILexicalBlockFile(scope: !451, file: !83, discriminator: 2)
!472 = !DILocation(line: 1185, column: 7, scope: !473)
!473 = distinct !DILexicalBlock(scope: !459, file: !83, line: 1184, column: 73)
!474 = !DILocation(line: 1186, column: 7, scope: !473)
!475 = !DILocation(line: 1191, column: 19, scope: !148)
!476 = !DILocation(line: 1191, column: 30, scope: !148)
!477 = !DILocation(line: 1191, column: 52, scope: !148)
!478 = !DILocation(line: 1191, column: 59, scope: !148)
!479 = !DILocation(line: 1191, column: 13, scope: !148)
!480 = !DILocation(line: 1191, column: 11, scope: !148)
!481 = !DILocation(line: 1217, column: 8, scope: !482)
!482 = distinct !DILexicalBlock(scope: !148, file: !83, line: 1217, column: 8)
!483 = !DILocation(line: 1217, column: 8, scope: !148)
!484 = !DILocation(line: 1218, column: 7, scope: !485)
!485 = distinct !DILexicalBlock(scope: !482, file: !83, line: 1217, column: 16)
!486 = !DILocation(line: 1219, column: 7, scope: !485)
!487 = !DILocation(line: 1221, column: 11, scope: !148)
!488 = !DILocation(line: 1224, column: 8, scope: !489)
!489 = distinct !DILexicalBlock(scope: !148, file: !83, line: 1224, column: 8)
!490 = !DILocation(line: 1224, column: 8, scope: !148)
!491 = !DILocation(line: 1225, column: 30, scope: !492)
!492 = distinct !DILexicalBlock(scope: !489, file: !83, line: 1224, column: 16)
!493 = !DILocation(line: 1225, column: 7, scope: !492)
!494 = !DILocation(line: 1226, column: 4, scope: !492)
!495 = !DILocation(line: 1224, column: 8, scope: !496)
!496 = !DILexicalBlockFile(scope: !489, file: !83, discriminator: 1)
!497 = !DILocation(line: 1230, column: 9, scope: !148)
!498 = !DILocation(line: 1230, column: 4, scope: !148)
!499 = !DILocation(line: 1231, column: 9, scope: !148)
!500 = !DILocation(line: 1231, column: 4, scope: !148)
!501 = !DILocation(line: 1232, column: 11, scope: !148)
!502 = !DILocation(line: 1232, column: 4, scope: !148)
!503 = distinct !DISubprogram(name: "PrintUsage", scope: !83, file: !83, line: 853, type: !504, isLocal: true, isDefinition: true, scopeLine: 854, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!504 = !DISubroutineType(types: !505)
!505 = !{null}
!506 = !DILocalVariable(name: "i", scope: !503, file: !83, line: 855, type: !79)
!507 = !DILocation(line: 855, column: 8, scope: !503)
!508 = !DILocation(line: 857, column: 59, scope: !503)
!509 = !DILocation(line: 857, column: 4, scope: !503)
!510 = !DILocation(line: 858, column: 4, scope: !503)
!511 = !DILocation(line: 859, column: 4, scope: !503)
!512 = !DILocation(line: 861, column: 11, scope: !513)
!513 = distinct !DILexicalBlock(scope: !503, file: !83, line: 861, column: 4)
!514 = !DILocation(line: 861, column: 9, scope: !513)
!515 = !DILocation(line: 861, column: 16, scope: !516)
!516 = !DILexicalBlockFile(scope: !517, file: !83, discriminator: 1)
!517 = distinct !DILexicalBlock(scope: !513, file: !83, line: 861, column: 4)
!518 = !DILocation(line: 861, column: 18, scope: !516)
!519 = !DILocation(line: 861, column: 4, scope: !516)
!520 = !DILocalVariable(name: "printOptName", scope: !521, file: !83, line: 862, type: !102)
!521 = distinct !DILexicalBlock(scope: !517, file: !83, line: 861, column: 75)
!522 = !DILocation(line: 862, column: 12, scope: !521)
!523 = !DILocalVariable(name: "tokidx", scope: !521, file: !83, line: 863, type: !119)
!524 = !DILocation(line: 863, column: 20, scope: !521)
!525 = !DILocalVariable(name: "msg", scope: !521, file: !83, line: 864, type: !90)
!526 = !DILocation(line: 864, column: 13, scope: !521)
!527 = !DILocation(line: 866, column: 7, scope: !521)
!528 = !DILocation(line: 867, column: 55, scope: !521)
!529 = !DILocation(line: 867, column: 42, scope: !521)
!530 = !DILocation(line: 867, column: 58, scope: !521)
!531 = !DILocation(line: 866, column: 21, scope: !532)
!532 = !DILexicalBlockFile(scope: !521, file: !83, discriminator: 1)
!533 = !DILocation(line: 866, column: 19, scope: !532)
!534 = !DILocation(line: 868, column: 49, scope: !521)
!535 = !DILocation(line: 866, column: 7, scope: !532)
!536 = !DILocation(line: 870, column: 17, scope: !537)
!537 = distinct !DILexicalBlock(scope: !521, file: !83, line: 868, column: 57)
!538 = !DILocation(line: 870, column: 45, scope: !539)
!539 = !DILexicalBlockFile(scope: !537, file: !83, discriminator: 1)
!540 = !DILocation(line: 870, column: 32, scope: !539)
!541 = !DILocation(line: 870, column: 48, scope: !539)
!542 = !DILocation(line: 870, column: 17, scope: !539)
!543 = !DILocation(line: 870, column: 17, scope: !544)
!544 = !DILexicalBlockFile(scope: !537, file: !83, discriminator: 2)
!545 = !DILocation(line: 870, column: 17, scope: !546)
!546 = !DILexicalBlockFile(scope: !537, file: !83, discriminator: 3)
!547 = !DILocation(line: 870, column: 58, scope: !546)
!548 = !DILocation(line: 869, column: 10, scope: !537)
!549 = !DILocation(line: 871, column: 15, scope: !537)
!550 = !DILocation(line: 871, column: 10, scope: !537)
!551 = !DILocation(line: 872, column: 23, scope: !537)
!552 = !DILocation(line: 866, column: 7, scope: !553)
!553 = !DILexicalBlockFile(scope: !521, file: !83, discriminator: 2)
!554 = distinct !{!554, !527}
!555 = !DILocation(line: 874, column: 4, scope: !521)
!556 = !DILocation(line: 861, column: 71, scope: !557)
!557 = !DILexicalBlockFile(scope: !517, file: !83, discriminator: 2)
!558 = !DILocation(line: 861, column: 4, scope: !557)
!559 = distinct !{!559, !560}
!560 = !DILocation(line: 861, column: 4, scope: !503)
!561 = !DILocation(line: 876, column: 4, scope: !503)
!562 = !DILocation(line: 877, column: 4, scope: !503)
!563 = !DILocation(line: 878, column: 4, scope: !503)
!564 = !DILocation(line: 879, column: 4, scope: !503)
!565 = !DILocation(line: 880, column: 4, scope: !503)
!566 = !DILocation(line: 881, column: 4, scope: !503)
!567 = !DILocation(line: 882, column: 4, scope: !503)
!568 = !DILocation(line: 883, column: 1, scope: !503)
!569 = distinct !DISubprogram(name: "PrintVersion", scope: !83, file: !83, line: 165, type: !504, isLocal: true, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!570 = !DILocation(line: 167, column: 31, scope: !569)
!571 = !DILocation(line: 167, column: 4, scope: !569)
!572 = !DILocation(line: 168, column: 4, scope: !569)
!573 = !DILocation(line: 169, column: 1, scope: !569)
!574 = distinct !DISubprogram(name: "GetPathMax", scope: !83, file: !83, line: 195, type: !575, isLocal: true, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!575 = !DISubroutineType(types: !576)
!576 = !{!220, !110}
!577 = !DILocalVariable(name: "path", arg: 1, scope: !574, file: !83, line: 195, type: !110)
!578 = !DILocation(line: 195, column: 24, scope: !574)
!579 = !DILocalVariable(name: "pathMax", scope: !574, file: !83, line: 197, type: !220)
!580 = !DILocation(line: 197, column: 11, scope: !574)
!581 = !DILocalVariable(name: "sysPathMax", scope: !574, file: !83, line: 200, type: !195)
!582 = !DILocation(line: 200, column: 9, scope: !574)
!583 = !DILocation(line: 210, column: 26, scope: !574)
!584 = !DILocation(line: 210, column: 17, scope: !574)
!585 = !DILocation(line: 210, column: 15, scope: !574)
!586 = !DILocation(line: 211, column: 8, scope: !587)
!587 = distinct !DILexicalBlock(scope: !574, file: !83, line: 211, column: 8)
!588 = !DILocation(line: 211, column: 19, scope: !587)
!589 = !DILocation(line: 211, column: 24, scope: !587)
!590 = !DILocation(line: 211, column: 27, scope: !591)
!591 = !DILexicalBlockFile(scope: !587, file: !83, discriminator: 1)
!592 = !DILocation(line: 211, column: 38, scope: !591)
!593 = !DILocation(line: 211, column: 8, scope: !591)
!594 = !DILocation(line: 212, column: 15, scope: !595)
!595 = distinct !DILexicalBlock(scope: !587, file: !83, line: 211, column: 46)
!596 = !DILocation(line: 213, column: 4, scope: !595)
!597 = !DILocation(line: 214, column: 17, scope: !598)
!598 = distinct !DILexicalBlock(scope: !587, file: !83, line: 213, column: 11)
!599 = !DILocation(line: 214, column: 15, scope: !598)
!600 = !DILocation(line: 220, column: 11, scope: !574)
!601 = !DILocation(line: 220, column: 4, scope: !574)
!602 = distinct !DISubprogram(name: "ParseShareName", scope: !83, file: !83, line: 243, type: !603, isLocal: true, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!603 = !DISubroutineType(types: !604)
!604 = !{!102, !110, !605, !605}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!606 = !DILocalVariable(name: "shareName", arg: 1, scope: !602, file: !83, line: 243, type: !110)
!607 = !DILocation(line: 243, column: 28, scope: !602)
!608 = !DILocalVariable(name: "shareNameHost", arg: 2, scope: !602, file: !83, line: 244, type: !605)
!609 = !DILocation(line: 244, column: 29, scope: !602)
!610 = !DILocalVariable(name: "shareNameDir", arg: 3, scope: !602, file: !83, line: 245, type: !605)
!611 = !DILocation(line: 245, column: 29, scope: !602)
!612 = !DILocalVariable(name: "colon", scope: !602, file: !83, line: 247, type: !110)
!613 = !DILocation(line: 247, column: 16, scope: !602)
!614 = !DILocalVariable(name: "dir", scope: !602, file: !83, line: 248, type: !110)
!615 = !DILocation(line: 248, column: 16, scope: !602)
!616 = !DILocation(line: 251, column: 19, scope: !602)
!617 = !DILocation(line: 251, column: 12, scope: !602)
!618 = !DILocation(line: 251, column: 10, scope: !602)
!619 = !DILocation(line: 252, column: 8, scope: !620)
!620 = distinct !DILexicalBlock(scope: !602, file: !83, line: 252, column: 8)
!621 = !DILocation(line: 252, column: 14, scope: !620)
!622 = !DILocation(line: 252, column: 8, scope: !602)
!623 = !DILocation(line: 253, column: 7, scope: !624)
!624 = distinct !DILexicalBlock(scope: !620, file: !83, line: 252, column: 22)
!625 = !DILocation(line: 254, column: 7, scope: !624)
!626 = !DILocation(line: 258, column: 10, scope: !602)
!627 = !DILocation(line: 258, column: 16, scope: !602)
!628 = !DILocation(line: 258, column: 8, scope: !602)
!629 = !DILocation(line: 259, column: 9, scope: !630)
!630 = distinct !DILexicalBlock(scope: !602, file: !83, line: 259, column: 8)
!631 = !DILocation(line: 259, column: 8, scope: !630)
!632 = !DILocation(line: 259, column: 13, scope: !630)
!633 = !DILocation(line: 259, column: 8, scope: !602)
!634 = !DILocation(line: 260, column: 7, scope: !635)
!635 = distinct !DILexicalBlock(scope: !630, file: !83, line: 259, column: 22)
!636 = !DILocation(line: 261, column: 7, scope: !635)
!637 = !DILocation(line: 265, column: 9, scope: !638)
!638 = distinct !DILexicalBlock(scope: !602, file: !83, line: 265, column: 8)
!639 = !DILocation(line: 265, column: 8, scope: !638)
!640 = !DILocation(line: 265, column: 13, scope: !638)
!641 = !DILocation(line: 265, column: 8, scope: !602)
!642 = !DILocation(line: 266, column: 7, scope: !643)
!643 = distinct !DILexicalBlock(scope: !638, file: !83, line: 265, column: 21)
!644 = !DILocation(line: 267, column: 7, scope: !643)
!645 = !DILocation(line: 271, column: 16, scope: !646)
!646 = distinct !DILexicalBlock(scope: !602, file: !83, line: 271, column: 8)
!647 = !DILocation(line: 271, column: 8, scope: !646)
!648 = !DILocation(line: 271, column: 40, scope: !646)
!649 = !DILocation(line: 271, column: 8, scope: !602)
!650 = !DILocation(line: 272, column: 7, scope: !651)
!651 = distinct !DILexicalBlock(scope: !646, file: !83, line: 271, column: 46)
!652 = !DILocation(line: 273, column: 7, scope: !651)
!653 = !DILocation(line: 276, column: 5, scope: !602)
!654 = !DILocation(line: 276, column: 19, scope: !602)
!655 = !DILocation(line: 277, column: 5, scope: !602)
!656 = !DILocation(line: 277, column: 69, scope: !657)
!657 = !DILexicalBlockFile(scope: !602, file: !83, discriminator: 1)
!658 = !DILocation(line: 277, column: 68, scope: !657)
!659 = !DILocation(line: 277, column: 17, scope: !657)
!660 = !DILocation(line: 277, column: 5, scope: !657)
!661 = !DILocation(line: 277, column: 5, scope: !662)
!662 = !DILexicalBlockFile(scope: !602, file: !83, discriminator: 2)
!663 = !DILocation(line: 277, column: 5, scope: !664)
!664 = !DILexicalBlockFile(scope: !602, file: !83, discriminator: 3)
!665 = !DILocation(line: 278, column: 20, scope: !602)
!666 = !DILocation(line: 278, column: 5, scope: !602)
!667 = !DILocation(line: 278, column: 18, scope: !602)
!668 = !DILocation(line: 279, column: 5, scope: !602)
!669 = !DILocation(line: 279, column: 74, scope: !657)
!670 = !DILocation(line: 279, column: 73, scope: !657)
!671 = !DILocation(line: 279, column: 17, scope: !657)
!672 = !DILocation(line: 279, column: 5, scope: !657)
!673 = !DILocation(line: 279, column: 5, scope: !662)
!674 = !DILocation(line: 279, column: 5, scope: !664)
!675 = !DILocation(line: 280, column: 4, scope: !602)
!676 = !DILocation(line: 281, column: 1, scope: !602)
!677 = distinct !DISubprogram(name: "ParseOptions", scope: !83, file: !83, line: 760, type: !108, isLocal: true, isDefinition: true, scopeLine: 763, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!678 = !DILocalVariable(name: "optionString", arg: 1, scope: !677, file: !83, line: 760, type: !110)
!679 = !DILocation(line: 760, column: 26, scope: !677)
!680 = !DILocalVariable(name: "mountInfo", arg: 2, scope: !677, file: !83, line: 761, type: !111)
!681 = !DILocation(line: 761, column: 29, scope: !677)
!682 = !DILocalVariable(name: "flags", arg: 3, scope: !677, file: !83, line: 762, type: !141)
!683 = !DILocation(line: 762, column: 19, scope: !677)
!684 = !DILocalVariable(name: "commaIndex", scope: !677, file: !83, line: 764, type: !119)
!685 = !DILocation(line: 764, column: 17, scope: !677)
!686 = !DILocalVariable(name: "success", scope: !677, file: !83, line: 765, type: !102)
!687 = !DILocation(line: 765, column: 9, scope: !677)
!688 = !DILocalVariable(name: "key", scope: !677, file: !83, line: 766, type: !90)
!689 = !DILocation(line: 766, column: 10, scope: !677)
!690 = !DILocalVariable(name: "keyVal", scope: !677, file: !83, line: 767, type: !90)
!691 = !DILocation(line: 767, column: 10, scope: !677)
!692 = !DILocalVariable(name: "i", scope: !677, file: !83, line: 768, type: !79)
!693 = !DILocation(line: 768, column: 8, scope: !677)
!694 = !DILocation(line: 775, column: 5, scope: !677)
!695 = !DILocation(line: 775, column: 55, scope: !696)
!696 = !DILexicalBlockFile(scope: !677, file: !83, discriminator: 1)
!697 = !DILocation(line: 775, column: 17, scope: !696)
!698 = !DILocation(line: 775, column: 5, scope: !696)
!699 = !DILocation(line: 775, column: 5, scope: !700)
!700 = !DILexicalBlockFile(scope: !677, file: !83, discriminator: 2)
!701 = !DILocation(line: 775, column: 5, scope: !702)
!702 = !DILexicalBlockFile(scope: !677, file: !83, discriminator: 3)
!703 = !DILocation(line: 778, column: 4, scope: !677)
!704 = !DILocation(line: 779, column: 42, scope: !677)
!705 = !DILocation(line: 778, column: 21, scope: !696)
!706 = !DILocation(line: 778, column: 19, scope: !696)
!707 = !DILocation(line: 779, column: 62, scope: !677)
!708 = !DILocation(line: 778, column: 4, scope: !696)
!709 = !DILocalVariable(name: "equalsIndex", scope: !710, file: !83, line: 781, type: !119)
!710 = distinct !DILexicalBlock(scope: !677, file: !83, line: 779, column: 70)
!711 = !DILocation(line: 781, column: 20, scope: !710)
!712 = !DILocation(line: 782, column: 48, scope: !710)
!713 = !DILocation(line: 782, column: 13, scope: !710)
!714 = !DILocation(line: 782, column: 11, scope: !710)
!715 = !DILocation(line: 783, column: 11, scope: !716)
!716 = distinct !DILexicalBlock(scope: !710, file: !83, line: 783, column: 11)
!717 = !DILocation(line: 783, column: 15, scope: !716)
!718 = !DILocation(line: 783, column: 11, scope: !710)
!719 = !DILocation(line: 784, column: 10, scope: !720)
!720 = distinct !DILexicalBlock(scope: !716, file: !83, line: 783, column: 23)
!721 = !DILocation(line: 785, column: 10, scope: !720)
!722 = !DILocation(line: 788, column: 14, scope: !723)
!723 = distinct !DILexicalBlock(scope: !710, file: !83, line: 788, column: 7)
!724 = !DILocation(line: 788, column: 12, scope: !723)
!725 = !DILocation(line: 788, column: 19, scope: !726)
!726 = !DILexicalBlockFile(scope: !727, file: !83, discriminator: 1)
!727 = distinct !DILexicalBlock(scope: !723, file: !83, line: 788, column: 7)
!728 = !DILocation(line: 788, column: 21, scope: !726)
!729 = !DILocation(line: 788, column: 7, scope: !726)
!730 = !DILocalVariable(name: "match", scope: !731, file: !83, line: 789, type: !102)
!731 = distinct !DILexicalBlock(scope: !727, file: !83, line: 788, column: 78)
!732 = !DILocation(line: 789, column: 15, scope: !731)
!733 = !DILocalVariable(name: "idx", scope: !731, file: !83, line: 790, type: !119)
!734 = !DILocation(line: 790, column: 23, scope: !731)
!735 = !DILocalVariable(name: "optName", scope: !731, file: !83, line: 791, type: !90)
!736 = !DILocation(line: 791, column: 16, scope: !731)
!737 = !DILocation(line: 791, column: 66, scope: !731)
!738 = !DILocation(line: 791, column: 53, scope: !731)
!739 = !DILocation(line: 791, column: 69, scope: !731)
!740 = !DILocation(line: 791, column: 26, scope: !731)
!741 = !DILocation(line: 793, column: 15, scope: !742)
!742 = distinct !DILexicalBlock(scope: !731, file: !83, line: 793, column: 14)
!743 = !DILocation(line: 793, column: 14, scope: !731)
!744 = !DILocation(line: 794, column: 13, scope: !745)
!745 = distinct !DILexicalBlock(scope: !742, file: !83, line: 793, column: 24)
!746 = !DILocation(line: 795, column: 13, scope: !745)
!747 = !DILocation(line: 798, column: 25, scope: !731)
!748 = !DILocation(line: 798, column: 30, scope: !731)
!749 = !DILocation(line: 798, column: 18, scope: !731)
!750 = !DILocation(line: 798, column: 39, scope: !731)
!751 = !DILocation(line: 798, column: 16, scope: !731)
!752 = !DILocation(line: 799, column: 15, scope: !731)
!753 = !DILocation(line: 799, column: 10, scope: !731)
!754 = !DILocation(line: 801, column: 14, scope: !755)
!755 = distinct !DILexicalBlock(scope: !731, file: !83, line: 801, column: 14)
!756 = !DILocation(line: 801, column: 14, scope: !731)
!757 = !DILocation(line: 802, column: 30, scope: !758)
!758 = distinct !DILexicalBlock(scope: !759, file: !83, line: 802, column: 17)
!759 = distinct !DILexicalBlock(scope: !755, file: !83, line: 801, column: 21)
!760 = !DILocation(line: 802, column: 17, scope: !758)
!761 = !DILocation(line: 802, column: 33, scope: !758)
!762 = !DILocation(line: 802, column: 17, scope: !759)
!763 = !DILocation(line: 803, column: 34, scope: !764)
!764 = distinct !DILexicalBlock(scope: !765, file: !83, line: 803, column: 20)
!765 = distinct !DILexicalBlock(scope: !758, file: !83, line: 802, column: 42)
!766 = !DILocation(line: 803, column: 21, scope: !764)
!767 = !DILocation(line: 803, column: 37, scope: !764)
!768 = !DILocation(line: 803, column: 45, scope: !764)
!769 = !DILocation(line: 803, column: 53, scope: !764)
!770 = !DILocation(line: 803, column: 64, scope: !764)
!771 = !DILocation(line: 803, column: 20, scope: !765)
!772 = !DILocation(line: 804, column: 19, scope: !773)
!773 = distinct !DILexicalBlock(scope: !764, file: !83, line: 803, column: 72)
!774 = !DILocation(line: 806, column: 13, scope: !765)
!775 = !DILocation(line: 807, column: 33, scope: !776)
!776 = distinct !DILexicalBlock(scope: !777, file: !83, line: 807, column: 20)
!777 = distinct !DILexicalBlock(scope: !758, file: !83, line: 806, column: 20)
!778 = !DILocation(line: 807, column: 20, scope: !776)
!779 = !DILocation(line: 807, column: 36, scope: !776)
!780 = !DILocation(line: 807, column: 20, scope: !777)
!781 = !DILocation(line: 808, column: 42, scope: !782)
!782 = distinct !DILexicalBlock(scope: !776, file: !83, line: 807, column: 41)
!783 = !DILocation(line: 808, column: 29, scope: !782)
!784 = !DILocation(line: 808, column: 45, scope: !782)
!785 = !DILocation(line: 808, column: 20, scope: !782)
!786 = !DILocation(line: 808, column: 26, scope: !782)
!787 = !DILocation(line: 809, column: 16, scope: !782)
!788 = !DILocation(line: 810, column: 43, scope: !789)
!789 = distinct !DILexicalBlock(scope: !776, file: !83, line: 809, column: 23)
!790 = !DILocation(line: 810, column: 30, scope: !789)
!791 = !DILocation(line: 810, column: 46, scope: !789)
!792 = !DILocation(line: 810, column: 29, scope: !789)
!793 = !DILocation(line: 810, column: 20, scope: !789)
!794 = !DILocation(line: 810, column: 26, scope: !789)
!795 = !DILocation(line: 812, column: 17, scope: !777)
!796 = !DILocation(line: 812, column: 57, scope: !797)
!797 = !DILexicalBlockFile(scope: !777, file: !83, discriminator: 1)
!798 = !DILocation(line: 812, column: 44, scope: !797)
!799 = !DILocation(line: 812, column: 60, scope: !797)
!800 = !DILocation(line: 812, column: 29, scope: !797)
!801 = !DILocation(line: 812, column: 17, scope: !797)
!802 = !DILocation(line: 812, column: 17, scope: !803)
!803 = !DILexicalBlockFile(scope: !777, file: !83, discriminator: 2)
!804 = !DILocation(line: 812, column: 17, scope: !805)
!805 = !DILexicalBlockFile(scope: !777, file: !83, discriminator: 3)
!806 = !DILocation(line: 814, column: 13, scope: !759)
!807 = !DILocation(line: 816, column: 7, scope: !731)
!808 = !DILocation(line: 788, column: 74, scope: !809)
!809 = !DILexicalBlockFile(scope: !727, file: !83, discriminator: 2)
!810 = !DILocation(line: 788, column: 7, scope: !809)
!811 = distinct !{!811, !812}
!812 = !DILocation(line: 788, column: 7, scope: !710)
!813 = !DILocation(line: 818, column: 11, scope: !814)
!814 = distinct !DILexicalBlock(scope: !710, file: !83, line: 818, column: 11)
!815 = !DILocation(line: 818, column: 13, scope: !814)
!816 = !DILocation(line: 818, column: 11, scope: !710)
!817 = !DILocation(line: 819, column: 11, scope: !818)
!818 = distinct !DILexicalBlock(scope: !814, file: !83, line: 818, column: 66)
!819 = !DILocation(line: 819, column: 71, scope: !820)
!820 = !DILexicalBlockFile(scope: !818, file: !83, discriminator: 1)
!821 = !DILocation(line: 819, column: 23, scope: !820)
!822 = !DILocation(line: 819, column: 11, scope: !820)
!823 = !DILocation(line: 819, column: 11, scope: !824)
!824 = !DILexicalBlockFile(scope: !818, file: !83, discriminator: 2)
!825 = !DILocation(line: 819, column: 11, scope: !826)
!826 = !DILexicalBlockFile(scope: !818, file: !83, discriminator: 3)
!827 = !DILocation(line: 820, column: 7, scope: !818)
!828 = !DILocation(line: 822, column: 12, scope: !710)
!829 = !DILocation(line: 822, column: 7, scope: !710)
!830 = !DILocation(line: 823, column: 12, scope: !710)
!831 = !DILocation(line: 823, column: 7, scope: !710)
!832 = !DILocation(line: 824, column: 11, scope: !710)
!833 = !DILocation(line: 825, column: 14, scope: !710)
!834 = !DILocation(line: 778, column: 4, scope: !700)
!835 = distinct !{!835, !703}
!836 = !DILocation(line: 828, column: 12, scope: !677)
!837 = !DILocation(line: 828, column: 4, scope: !677)
!838 = !DILocation(line: 831, column: 9, scope: !677)
!839 = !DILocation(line: 831, column: 4, scope: !677)
!840 = !DILocation(line: 832, column: 9, scope: !677)
!841 = !DILocation(line: 832, column: 4, scope: !677)
!842 = !DILocation(line: 833, column: 11, scope: !677)
!843 = !DILocation(line: 833, column: 4, scope: !677)
!844 = distinct !DISubprogram(name: "UpdateMtab", scope: !83, file: !83, line: 904, type: !845, isLocal: true, isDefinition: true, scopeLine: 906, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !111, !79}
!847 = !DILocalVariable(name: "mountInfo", arg: 1, scope: !844, file: !83, line: 904, type: !111)
!848 = !DILocation(line: 904, column: 27, scope: !844)
!849 = !DILocalVariable(name: "flags", arg: 2, scope: !844, file: !83, line: 905, type: !79)
!850 = !DILocation(line: 905, column: 16, scope: !844)
!851 = !DILocalVariable(name: "mountEnt", scope: !844, file: !83, line: 907, type: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mntent", file: !853, line: 53, size: 320, align: 64, elements: !854)
!853 = !DIFile(filename: "/usr/include/mntent.h", directory: "/home/lichi/Desktop/open-vm-tools/line1289")
!854 = !{!855, !856, !857, !858, !859, !860}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_fsname", scope: !852, file: !853, line: 55, baseType: !90, size: 64, align: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_dir", scope: !852, file: !853, line: 56, baseType: !90, size: 64, align: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_type", scope: !852, file: !853, line: 57, baseType: !90, size: 64, align: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_opts", scope: !852, file: !853, line: 58, baseType: !90, size: 64, align: 64, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_freq", scope: !852, file: !853, line: 59, baseType: !79, size: 32, align: 32, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_passno", scope: !852, file: !853, line: 60, baseType: !79, size: 32, align: 32, offset: 288)
!861 = !DILocation(line: 907, column: 18, scope: !844)
!862 = !DILocalVariable(name: "mountFile", scope: !844, file: !83, line: 908, type: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64, align: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !865, line: 48, baseType: !866)
!865 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1289")
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !867, line: 241, size: 1728, align: 64, elements: !868)
!867 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1289")
!868 = !{!869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !889, !890, !891, !892, !893, !894, !896, !900, !903, !905, !906, !907, !908, !909, !910, !911}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !866, file: !867, line: 242, baseType: !79, size: 32, align: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !866, file: !867, line: 247, baseType: !90, size: 64, align: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !866, file: !867, line: 248, baseType: !90, size: 64, align: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !866, file: !867, line: 249, baseType: !90, size: 64, align: 64, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !866, file: !867, line: 250, baseType: !90, size: 64, align: 64, offset: 256)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !866, file: !867, line: 251, baseType: !90, size: 64, align: 64, offset: 320)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !866, file: !867, line: 252, baseType: !90, size: 64, align: 64, offset: 384)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !866, file: !867, line: 253, baseType: !90, size: 64, align: 64, offset: 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !866, file: !867, line: 254, baseType: !90, size: 64, align: 64, offset: 512)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !866, file: !867, line: 256, baseType: !90, size: 64, align: 64, offset: 576)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !866, file: !867, line: 257, baseType: !90, size: 64, align: 64, offset: 640)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !866, file: !867, line: 258, baseType: !90, size: 64, align: 64, offset: 704)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !866, file: !867, line: 260, baseType: !882, size: 64, align: 64, offset: 768)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64, align: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !867, line: 156, size: 192, align: 64, elements: !884)
!884 = !{!885, !886, !888}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !883, file: !867, line: 157, baseType: !882, size: 64, align: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !883, file: !867, line: 158, baseType: !887, size: 64, align: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64, align: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !883, file: !867, line: 162, baseType: !79, size: 32, align: 32, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !866, file: !867, line: 262, baseType: !887, size: 64, align: 64, offset: 832)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !866, file: !867, line: 264, baseType: !79, size: 32, align: 32, offset: 896)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !866, file: !867, line: 268, baseType: !79, size: 32, align: 32, offset: 928)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !866, file: !867, line: 270, baseType: !194, size: 64, align: 64, offset: 960)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !866, file: !867, line: 274, baseType: !80, size: 16, align: 16, offset: 1024)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !866, file: !867, line: 275, baseType: !895, size: 8, align: 8, offset: 1040)
!895 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !866, file: !867, line: 276, baseType: !897, size: 8, align: 8, offset: 1048)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 8, align: 8, elements: !898)
!898 = !{!899}
!899 = !DISubrange(count: 1)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !866, file: !867, line: 280, baseType: !901, size: 64, align: 64, offset: 1088)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !867, line: 150, baseType: null)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !866, file: !867, line: 289, baseType: !904, size: 64, align: 64, offset: 1152)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !129, line: 132, baseType: !195)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !866, file: !867, line: 297, baseType: !78, size: 64, align: 64, offset: 1216)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !866, file: !867, line: 298, baseType: !78, size: 64, align: 64, offset: 1280)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !866, file: !867, line: 299, baseType: !78, size: 64, align: 64, offset: 1344)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !866, file: !867, line: 300, baseType: !78, size: 64, align: 64, offset: 1408)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !866, file: !867, line: 302, baseType: !220, size: 64, align: 64, offset: 1472)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !866, file: !867, line: 303, baseType: !79, size: 32, align: 32, offset: 1536)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !866, file: !867, line: 305, baseType: !912, size: 160, align: 8, offset: 1568)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 160, align: 8, elements: !87)
!913 = !DILocation(line: 908, column: 10, scope: !844)
!914 = !DILocalVariable(name: "password", scope: !844, file: !83, line: 909, type: !915)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64, align: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !127, line: 49, size: 384, align: 64, elements: !917)
!917 = !{!918, !919, !920, !921, !922, !923, !924}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !916, file: !127, line: 51, baseType: !90, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !916, file: !127, line: 52, baseType: !90, size: 64, align: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !916, file: !127, line: 53, baseType: !128, size: 32, align: 32, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !916, file: !127, line: 54, baseType: !134, size: 32, align: 32, offset: 160)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !916, file: !127, line: 55, baseType: !90, size: 64, align: 64, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !916, file: !127, line: 56, baseType: !90, size: 64, align: 64, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !916, file: !127, line: 57, baseType: !90, size: 64, align: 64, offset: 320)
!925 = !DILocation(line: 909, column: 19, scope: !844)
!926 = !DILocalVariable(name: "userName", scope: !844, file: !83, line: 910, type: !90)
!927 = !DILocation(line: 910, column: 10, scope: !844)
!928 = !DILocation(line: 914, column: 16, scope: !844)
!929 = !DILocation(line: 914, column: 14, scope: !844)
!930 = !DILocation(line: 915, column: 8, scope: !931)
!931 = distinct !DILexicalBlock(scope: !844, file: !83, line: 915, column: 8)
!932 = !DILocation(line: 915, column: 18, scope: !931)
!933 = !DILocation(line: 915, column: 8, scope: !844)
!934 = !DILocation(line: 916, column: 7, scope: !935)
!935 = distinct !DILexicalBlock(scope: !931, file: !83, line: 915, column: 26)
!936 = !DILocation(line: 917, column: 7, scope: !935)
!937 = !DILocation(line: 921, column: 8, scope: !938)
!938 = distinct !DILexicalBlock(scope: !844, file: !83, line: 921, column: 8)
!939 = !DILocation(line: 921, column: 17, scope: !938)
!940 = !DILocation(line: 921, column: 8, scope: !844)
!941 = !DILocation(line: 922, column: 27, scope: !942)
!942 = distinct !DILexicalBlock(scope: !938, file: !83, line: 921, column: 23)
!943 = !DILocation(line: 922, column: 18, scope: !944)
!944 = !DILexicalBlockFile(scope: !942, file: !83, discriminator: 1)
!945 = !DILocation(line: 922, column: 16, scope: !942)
!946 = !DILocation(line: 923, column: 11, scope: !947)
!947 = distinct !DILexicalBlock(scope: !942, file: !83, line: 923, column: 11)
!948 = !DILocation(line: 923, column: 20, scope: !947)
!949 = !DILocation(line: 923, column: 11, scope: !942)
!950 = !DILocation(line: 924, column: 10, scope: !951)
!951 = distinct !DILexicalBlock(scope: !947, file: !83, line: 923, column: 28)
!952 = !DILocation(line: 925, column: 7, scope: !951)
!953 = !DILocation(line: 926, column: 21, scope: !954)
!954 = distinct !DILexicalBlock(scope: !947, file: !83, line: 925, column: 14)
!955 = !DILocation(line: 926, column: 31, scope: !954)
!956 = !DILocation(line: 926, column: 19, scope: !954)
!957 = !DILocation(line: 928, column: 4, scope: !942)
!958 = !DILocation(line: 934, column: 26, scope: !844)
!959 = !DILocation(line: 934, column: 13, scope: !844)
!960 = !DILocation(line: 934, column: 24, scope: !844)
!961 = !DILocation(line: 935, column: 23, scope: !844)
!962 = !DILocation(line: 935, column: 13, scope: !844)
!963 = !DILocation(line: 935, column: 21, scope: !844)
!964 = !DILocation(line: 936, column: 13, scope: !844)
!965 = !DILocation(line: 936, column: 22, scope: !844)
!966 = !DILocation(line: 937, column: 13, scope: !844)
!967 = !DILocation(line: 937, column: 22, scope: !844)
!968 = !DILocation(line: 938, column: 13, scope: !844)
!969 = !DILocation(line: 938, column: 24, scope: !844)
!970 = !DILocation(line: 939, column: 24, scope: !844)
!971 = !DILocation(line: 939, column: 13, scope: !844)
!972 = !DILocation(line: 939, column: 22, scope: !844)
!973 = !DILocation(line: 940, column: 17, scope: !974)
!974 = distinct !DILexicalBlock(scope: !844, file: !83, line: 940, column: 8)
!975 = !DILocation(line: 940, column: 8, scope: !974)
!976 = !DILocation(line: 940, column: 8, scope: !844)
!977 = !DILocalVariable(name: "ttlString", scope: !978, file: !83, line: 941, type: !90)
!978 = distinct !DILexicalBlock(scope: !974, file: !83, line: 940, column: 27)
!979 = !DILocation(line: 941, column: 13, scope: !978)
!980 = !DILocation(line: 943, column: 23, scope: !978)
!981 = !DILocation(line: 943, column: 7, scope: !978)
!982 = !DILocation(line: 950, column: 11, scope: !983)
!983 = distinct !DILexicalBlock(scope: !978, file: !83, line: 950, column: 11)
!984 = !DILocation(line: 950, column: 17, scope: !983)
!985 = !DILocation(line: 950, column: 11, scope: !978)
!986 = !DILocation(line: 951, column: 30, scope: !987)
!987 = distinct !DILexicalBlock(scope: !983, file: !83, line: 950, column: 29)
!988 = !DILocation(line: 951, column: 10, scope: !987)
!989 = !DILocation(line: 952, column: 7, scope: !987)
!990 = !DILocation(line: 953, column: 30, scope: !991)
!991 = distinct !DILexicalBlock(scope: !983, file: !83, line: 952, column: 14)
!992 = !DILocation(line: 953, column: 10, scope: !991)
!993 = !DILocation(line: 955, column: 11, scope: !994)
!994 = distinct !DILexicalBlock(scope: !978, file: !83, line: 955, column: 11)
!995 = !DILocation(line: 955, column: 17, scope: !994)
!996 = !DILocation(line: 955, column: 11, scope: !978)
!997 = !DILocation(line: 956, column: 30, scope: !998)
!998 = distinct !DILexicalBlock(scope: !994, file: !83, line: 955, column: 29)
!999 = !DILocation(line: 956, column: 10, scope: !998)
!1000 = !DILocation(line: 957, column: 7, scope: !998)
!1001 = !DILocation(line: 959, column: 11, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !978, file: !83, line: 959, column: 11)
!1003 = !DILocation(line: 959, column: 17, scope: !1002)
!1004 = !DILocation(line: 959, column: 11, scope: !978)
!1005 = !DILocation(line: 960, column: 30, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !1002, file: !83, line: 959, column: 28)
!1007 = !DILocation(line: 960, column: 10, scope: !1006)
!1008 = !DILocation(line: 961, column: 7, scope: !1006)
!1009 = !DILocation(line: 963, column: 11, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !978, file: !83, line: 963, column: 11)
!1011 = !DILocation(line: 963, column: 17, scope: !1010)
!1012 = !DILocation(line: 963, column: 11, scope: !978)
!1013 = !DILocation(line: 964, column: 30, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1010, file: !83, line: 963, column: 29)
!1015 = !DILocation(line: 964, column: 10, scope: !1014)
!1016 = !DILocation(line: 965, column: 7, scope: !1014)
!1017 = !DILocation(line: 966, column: 11, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !978, file: !83, line: 966, column: 11)
!1019 = !DILocation(line: 966, column: 17, scope: !1018)
!1020 = !DILocation(line: 966, column: 11, scope: !978)
!1021 = !DILocation(line: 967, column: 30, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1018, file: !83, line: 966, column: 34)
!1023 = !DILocation(line: 967, column: 10, scope: !1022)
!1024 = !DILocation(line: 968, column: 7, scope: !1022)
!1025 = !DILocation(line: 969, column: 11, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !978, file: !83, line: 969, column: 11)
!1027 = !DILocation(line: 969, column: 17, scope: !1026)
!1028 = !DILocation(line: 969, column: 11, scope: !978)
!1029 = !DILocation(line: 970, column: 30, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1026, file: !83, line: 969, column: 31)
!1031 = !DILocation(line: 970, column: 10, scope: !1030)
!1032 = !DILocation(line: 971, column: 7, scope: !1030)
!1033 = !DILocation(line: 972, column: 11, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !978, file: !83, line: 972, column: 11)
!1035 = !DILocation(line: 972, column: 17, scope: !1034)
!1036 = !DILocation(line: 972, column: 11, scope: !978)
!1037 = !DILocation(line: 973, column: 30, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1034, file: !83, line: 972, column: 30)
!1039 = !DILocation(line: 973, column: 10, scope: !1038)
!1040 = !DILocation(line: 974, column: 7, scope: !1038)
!1041 = !DILocation(line: 975, column: 11, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !978, file: !83, line: 975, column: 11)
!1043 = !DILocation(line: 975, column: 17, scope: !1042)
!1044 = !DILocation(line: 975, column: 11, scope: !978)
!1045 = !DILocation(line: 976, column: 30, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1042, file: !83, line: 975, column: 33)
!1047 = !DILocation(line: 976, column: 10, scope: !1046)
!1048 = !DILocation(line: 977, column: 7, scope: !1046)
!1049 = !DILocation(line: 979, column: 11, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !978, file: !83, line: 979, column: 11)
!1051 = !DILocation(line: 979, column: 20, scope: !1050)
!1052 = !DILocation(line: 979, column: 11, scope: !978)
!1053 = !DILocation(line: 980, column: 30, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1050, file: !83, line: 979, column: 28)
!1055 = !DILocation(line: 980, column: 10, scope: !1054)
!1056 = !DILocation(line: 981, column: 30, scope: !1054)
!1057 = !DILocation(line: 981, column: 40, scope: !1054)
!1058 = !DILocation(line: 981, column: 10, scope: !1054)
!1059 = !DILocation(line: 982, column: 7, scope: !1054)
!1060 = !DILocation(line: 984, column: 43, scope: !978)
!1061 = !DILocation(line: 984, column: 54, scope: !978)
!1062 = !DILocation(line: 984, column: 19, scope: !978)
!1063 = !DILocation(line: 984, column: 17, scope: !978)
!1064 = !DILocation(line: 985, column: 11, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !978, file: !83, line: 985, column: 11)
!1066 = !DILocation(line: 985, column: 21, scope: !1065)
!1067 = !DILocation(line: 985, column: 11, scope: !978)
!1068 = !DILocation(line: 986, column: 30, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1065, file: !83, line: 985, column: 29)
!1070 = !DILocation(line: 986, column: 10, scope: !1069)
!1071 = !DILocation(line: 987, column: 30, scope: !1069)
!1072 = !DILocation(line: 987, column: 40, scope: !1069)
!1073 = !DILocation(line: 987, column: 10, scope: !1069)
!1074 = !DILocation(line: 988, column: 15, scope: !1069)
!1075 = !DILocation(line: 988, column: 10, scope: !1069)
!1076 = !DILocation(line: 989, column: 7, scope: !1069)
!1077 = !DILocation(line: 990, column: 10, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1065, file: !83, line: 989, column: 14)
!1079 = !DILocation(line: 993, column: 4, scope: !978)
!1080 = !DILocation(line: 996, column: 18, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !844, file: !83, line: 996, column: 8)
!1082 = !DILocation(line: 996, column: 8, scope: !1081)
!1083 = !DILocation(line: 996, column: 8, scope: !844)
!1084 = !DILocation(line: 997, column: 7, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1081, file: !83, line: 996, column: 41)
!1086 = !DILocation(line: 998, column: 4, scope: !1085)
!1087 = !DILocation(line: 999, column: 14, scope: !844)
!1088 = !DILocation(line: 999, column: 4, scope: !844)
!1089 = !DILocation(line: 1000, column: 17, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !844, file: !83, line: 1000, column: 8)
!1091 = !DILocation(line: 1000, column: 8, scope: !1090)
!1092 = !DILocation(line: 1000, column: 8, scope: !844)
!1093 = !DILocation(line: 1001, column: 21, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1090, file: !83, line: 1000, column: 27)
!1095 = !DILocation(line: 1001, column: 7, scope: !1094)
!1096 = !DILocation(line: 1002, column: 4, scope: !1094)
!1097 = !DILocation(line: 1003, column: 1, scope: !844)
!1098 = distinct !DISubprogram(name: "ParseUid", scope: !83, file: !83, line: 302, type: !108, isLocal: true, isDefinition: true, scopeLine: 305, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!1099 = !DILocalVariable(name: "option", arg: 1, scope: !1098, file: !83, line: 302, type: !110)
!1100 = !DILocation(line: 302, column: 22, scope: !1098)
!1101 = !DILocalVariable(name: "mountInfo", arg: 2, scope: !1098, file: !83, line: 303, type: !111)
!1102 = !DILocation(line: 303, column: 25, scope: !1098)
!1103 = !DILocalVariable(name: "flags", arg: 3, scope: !1098, file: !83, line: 304, type: !141)
!1104 = !DILocation(line: 304, column: 15, scope: !1098)
!1105 = !DILocalVariable(name: "success", scope: !1098, file: !83, line: 306, type: !102)
!1106 = !DILocation(line: 306, column: 9, scope: !1098)
!1107 = !DILocalVariable(name: "idx", scope: !1098, file: !83, line: 307, type: !119)
!1108 = !DILocation(line: 307, column: 17, scope: !1098)
!1109 = !DILocalVariable(name: "optString", scope: !1098, file: !83, line: 308, type: !90)
!1110 = !DILocation(line: 308, column: 10, scope: !1098)
!1111 = !DILocalVariable(name: "uidString", scope: !1098, file: !83, line: 309, type: !90)
!1112 = !DILocation(line: 309, column: 10, scope: !1098)
!1113 = !DILocalVariable(name: "myUid", scope: !1098, file: !83, line: 310, type: !126)
!1114 = !DILocation(line: 310, column: 10, scope: !1098)
!1115 = !DILocation(line: 317, column: 43, scope: !1098)
!1116 = !DILocation(line: 317, column: 16, scope: !1098)
!1117 = !DILocation(line: 317, column: 14, scope: !1098)
!1118 = !DILocation(line: 319, column: 43, scope: !1098)
!1119 = !DILocation(line: 319, column: 16, scope: !1098)
!1120 = !DILocation(line: 319, column: 14, scope: !1098)
!1121 = !DILocation(line: 320, column: 9, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1098, file: !83, line: 320, column: 8)
!1123 = !DILocation(line: 320, column: 8, scope: !1098)
!1124 = !DILocation(line: 321, column: 8, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1122, file: !83, line: 320, column: 20)
!1126 = !DILocation(line: 321, column: 20, scope: !1127)
!1127 = !DILexicalBlockFile(scope: !1125, file: !83, discriminator: 1)
!1128 = !DILocation(line: 321, column: 8, scope: !1127)
!1129 = !DILocation(line: 321, column: 8, scope: !1130)
!1130 = !DILexicalBlockFile(scope: !1125, file: !83, discriminator: 2)
!1131 = !DILocation(line: 321, column: 8, scope: !1132)
!1132 = !DILexicalBlockFile(scope: !1125, file: !83, discriminator: 3)
!1133 = !DILocation(line: 322, column: 7, scope: !1125)
!1134 = !DILocation(line: 329, column: 8, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1098, file: !83, line: 329, column: 7)
!1136 = !DILocation(line: 329, column: 7, scope: !1135)
!1137 = !DILocation(line: 329, column: 28, scope: !1135)
!1138 = !DILocation(line: 329, column: 10, scope: !1135)
!1139 = !DILocation(line: 329, column: 9, scope: !1135)
!1140 = !DILocation(line: 329, column: 11, scope: !1135)
!1141 = !DILocation(line: 329, column: 7, scope: !1098)
!1142 = !DILocation(line: 330, column: 8, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1135, file: !83, line: 329, column: 28)
!1144 = !DILocation(line: 330, column: 12, scope: !1143)
!1145 = !DILocation(line: 331, column: 23, scope: !1143)
!1146 = !DILocation(line: 331, column: 15, scope: !1143)
!1147 = !DILocation(line: 331, column: 13, scope: !1143)
!1148 = !DILocation(line: 332, column: 12, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1143, file: !83, line: 332, column: 10)
!1150 = !DILocation(line: 332, column: 11, scope: !1149)
!1151 = !DILocation(line: 332, column: 16, scope: !1149)
!1152 = !DILocation(line: 332, column: 10, scope: !1143)
!1153 = !DILocation(line: 333, column: 18, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1149, file: !83, line: 332, column: 22)
!1155 = !DILocation(line: 334, column: 7, scope: !1154)
!1156 = !DILocation(line: 335, column: 43, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1149, file: !83, line: 334, column: 14)
!1158 = !DILocation(line: 335, column: 10, scope: !1157)
!1159 = !DILocation(line: 337, column: 4, scope: !1143)
!1160 = !DILocalVariable(name: "pw", scope: !1161, file: !83, line: 338, type: !915)
!1161 = distinct !DILexicalBlock(scope: !1135, file: !83, line: 337, column: 11)
!1162 = !DILocation(line: 338, column: 22, scope: !1161)
!1163 = !DILocation(line: 340, column: 27, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1161, file: !83, line: 340, column: 11)
!1165 = !DILocation(line: 340, column: 18, scope: !1164)
!1166 = !DILocation(line: 340, column: 16, scope: !1164)
!1167 = !DILocation(line: 340, column: 11, scope: !1161)
!1168 = !DILocation(line: 341, column: 43, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1164, file: !83, line: 340, column: 40)
!1170 = !DILocation(line: 341, column: 10, scope: !1169)
!1171 = !DILocation(line: 342, column: 7, scope: !1169)
!1172 = !DILocation(line: 343, column: 18, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1164, file: !83, line: 342, column: 14)
!1174 = !DILocation(line: 343, column: 22, scope: !1173)
!1175 = !DILocation(line: 343, column: 16, scope: !1173)
!1176 = !DILocation(line: 344, column: 18, scope: !1173)
!1177 = !DILocation(line: 346, column: 7, scope: !1161)
!1178 = !DILocation(line: 349, column: 8, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1098, file: !83, line: 349, column: 8)
!1180 = !DILocation(line: 349, column: 8, scope: !1098)
!1181 = !DILocation(line: 350, column: 24, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1179, file: !83, line: 349, column: 17)
!1183 = !DILocation(line: 350, column: 7, scope: !1182)
!1184 = !DILocation(line: 350, column: 18, scope: !1182)
!1185 = !DILocation(line: 350, column: 22, scope: !1182)
!1186 = !DILocation(line: 351, column: 7, scope: !1182)
!1187 = !DILocation(line: 351, column: 18, scope: !1182)
!1188 = !DILocation(line: 351, column: 25, scope: !1182)
!1189 = !DILocation(line: 352, column: 8, scope: !1182)
!1190 = !DILocation(line: 352, column: 62, scope: !1191)
!1191 = !DILexicalBlockFile(scope: !1182, file: !83, discriminator: 1)
!1192 = !DILocation(line: 352, column: 20, scope: !1191)
!1193 = !DILocation(line: 352, column: 8, scope: !1191)
!1194 = !DILocation(line: 352, column: 8, scope: !1195)
!1195 = !DILexicalBlockFile(scope: !1182, file: !83, discriminator: 2)
!1196 = !DILocation(line: 352, column: 8, scope: !1197)
!1197 = !DILexicalBlockFile(scope: !1182, file: !83, discriminator: 3)
!1198 = !DILocation(line: 353, column: 4, scope: !1182)
!1199 = !DILocation(line: 355, column: 9, scope: !1098)
!1200 = !DILocation(line: 355, column: 4, scope: !1098)
!1201 = !DILocation(line: 357, column: 9, scope: !1098)
!1202 = !DILocation(line: 357, column: 4, scope: !1098)
!1203 = !DILocation(line: 358, column: 11, scope: !1098)
!1204 = !DILocation(line: 358, column: 4, scope: !1098)
!1205 = distinct !DISubprogram(name: "ParseGid", scope: !83, file: !83, line: 380, type: !108, isLocal: true, isDefinition: true, scopeLine: 383, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!1206 = !DILocalVariable(name: "option", arg: 1, scope: !1205, file: !83, line: 380, type: !110)
!1207 = !DILocation(line: 380, column: 22, scope: !1205)
!1208 = !DILocalVariable(name: "mountInfo", arg: 2, scope: !1205, file: !83, line: 381, type: !111)
!1209 = !DILocation(line: 381, column: 25, scope: !1205)
!1210 = !DILocalVariable(name: "flags", arg: 3, scope: !1205, file: !83, line: 382, type: !141)
!1211 = !DILocation(line: 382, column: 15, scope: !1205)
!1212 = !DILocalVariable(name: "success", scope: !1205, file: !83, line: 384, type: !102)
!1213 = !DILocation(line: 384, column: 9, scope: !1205)
!1214 = !DILocalVariable(name: "idx", scope: !1205, file: !83, line: 385, type: !119)
!1215 = !DILocation(line: 385, column: 17, scope: !1205)
!1216 = !DILocalVariable(name: "optString", scope: !1205, file: !83, line: 386, type: !90)
!1217 = !DILocation(line: 386, column: 10, scope: !1205)
!1218 = !DILocalVariable(name: "gidString", scope: !1205, file: !83, line: 387, type: !90)
!1219 = !DILocation(line: 387, column: 10, scope: !1205)
!1220 = !DILocalVariable(name: "myGid", scope: !1205, file: !83, line: 388, type: !132)
!1221 = !DILocation(line: 388, column: 10, scope: !1205)
!1222 = !DILocation(line: 395, column: 43, scope: !1205)
!1223 = !DILocation(line: 395, column: 16, scope: !1205)
!1224 = !DILocation(line: 395, column: 14, scope: !1205)
!1225 = !DILocation(line: 397, column: 43, scope: !1205)
!1226 = !DILocation(line: 397, column: 16, scope: !1205)
!1227 = !DILocation(line: 397, column: 14, scope: !1205)
!1228 = !DILocation(line: 398, column: 9, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1205, file: !83, line: 398, column: 8)
!1230 = !DILocation(line: 398, column: 8, scope: !1205)
!1231 = !DILocation(line: 399, column: 8, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1229, file: !83, line: 398, column: 20)
!1233 = !DILocation(line: 399, column: 20, scope: !1234)
!1234 = !DILexicalBlockFile(scope: !1232, file: !83, discriminator: 1)
!1235 = !DILocation(line: 399, column: 8, scope: !1234)
!1236 = !DILocation(line: 399, column: 8, scope: !1237)
!1237 = !DILexicalBlockFile(scope: !1232, file: !83, discriminator: 2)
!1238 = !DILocation(line: 399, column: 8, scope: !1239)
!1239 = !DILexicalBlockFile(scope: !1232, file: !83, discriminator: 3)
!1240 = !DILocation(line: 400, column: 7, scope: !1232)
!1241 = !DILocation(line: 407, column: 8, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1205, file: !83, line: 407, column: 7)
!1243 = !DILocation(line: 407, column: 7, scope: !1242)
!1244 = !DILocation(line: 407, column: 28, scope: !1242)
!1245 = !DILocation(line: 407, column: 10, scope: !1242)
!1246 = !DILocation(line: 407, column: 9, scope: !1242)
!1247 = !DILocation(line: 407, column: 11, scope: !1242)
!1248 = !DILocation(line: 407, column: 7, scope: !1205)
!1249 = !DILocation(line: 408, column: 8, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1242, file: !83, line: 407, column: 28)
!1251 = !DILocation(line: 408, column: 12, scope: !1250)
!1252 = !DILocation(line: 409, column: 23, scope: !1250)
!1253 = !DILocation(line: 409, column: 15, scope: !1250)
!1254 = !DILocation(line: 409, column: 13, scope: !1250)
!1255 = !DILocation(line: 410, column: 12, scope: !1256)
!1256 = distinct !DILexicalBlock(scope: !1250, file: !83, line: 410, column: 10)
!1257 = !DILocation(line: 410, column: 11, scope: !1256)
!1258 = !DILocation(line: 410, column: 16, scope: !1256)
!1259 = !DILocation(line: 410, column: 10, scope: !1250)
!1260 = !DILocation(line: 411, column: 18, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1256, file: !83, line: 410, column: 22)
!1262 = !DILocation(line: 412, column: 7, scope: !1261)
!1263 = !DILocation(line: 413, column: 43, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1256, file: !83, line: 412, column: 14)
!1265 = !DILocation(line: 413, column: 10, scope: !1264)
!1266 = !DILocation(line: 415, column: 4, scope: !1250)
!1267 = !DILocalVariable(name: "gr", scope: !1268, file: !83, line: 416, type: !1269)
!1268 = distinct !DILexicalBlock(scope: !1242, file: !83, line: 415, column: 11)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !133, line: 42, size: 256, align: 64, elements: !1271)
!1271 = !{!1272, !1273, !1274, !1275}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !1270, file: !133, line: 44, baseType: !90, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !1270, file: !133, line: 45, baseType: !90, size: 64, align: 64, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !1270, file: !133, line: 46, baseType: !134, size: 32, align: 32, offset: 128)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !1270, file: !133, line: 47, baseType: !151, size: 64, align: 64, offset: 192)
!1276 = !DILocation(line: 416, column: 21, scope: !1268)
!1277 = !DILocation(line: 418, column: 27, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1268, file: !83, line: 418, column: 11)
!1279 = !DILocation(line: 418, column: 18, scope: !1278)
!1280 = !DILocation(line: 418, column: 16, scope: !1278)
!1281 = !DILocation(line: 418, column: 11, scope: !1268)
!1282 = !DILocation(line: 419, column: 44, scope: !1283)
!1283 = distinct !DILexicalBlock(scope: !1278, file: !83, line: 418, column: 40)
!1284 = !DILocation(line: 419, column: 10, scope: !1283)
!1285 = !DILocation(line: 420, column: 7, scope: !1283)
!1286 = !DILocation(line: 421, column: 18, scope: !1287)
!1287 = distinct !DILexicalBlock(scope: !1278, file: !83, line: 420, column: 14)
!1288 = !DILocation(line: 421, column: 22, scope: !1287)
!1289 = !DILocation(line: 421, column: 16, scope: !1287)
!1290 = !DILocation(line: 422, column: 18, scope: !1287)
!1291 = !DILocation(line: 424, column: 7, scope: !1268)
!1292 = !DILocation(line: 427, column: 8, scope: !1293)
!1293 = distinct !DILexicalBlock(scope: !1205, file: !83, line: 427, column: 8)
!1294 = !DILocation(line: 427, column: 8, scope: !1205)
!1295 = !DILocation(line: 428, column: 24, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1293, file: !83, line: 427, column: 17)
!1297 = !DILocation(line: 428, column: 7, scope: !1296)
!1298 = !DILocation(line: 428, column: 18, scope: !1296)
!1299 = !DILocation(line: 428, column: 22, scope: !1296)
!1300 = !DILocation(line: 429, column: 7, scope: !1296)
!1301 = !DILocation(line: 429, column: 18, scope: !1296)
!1302 = !DILocation(line: 429, column: 25, scope: !1296)
!1303 = !DILocation(line: 430, column: 8, scope: !1296)
!1304 = !DILocation(line: 430, column: 62, scope: !1305)
!1305 = !DILexicalBlockFile(scope: !1296, file: !83, discriminator: 1)
!1306 = !DILocation(line: 430, column: 20, scope: !1305)
!1307 = !DILocation(line: 430, column: 8, scope: !1305)
!1308 = !DILocation(line: 430, column: 8, scope: !1309)
!1309 = !DILexicalBlockFile(scope: !1296, file: !83, discriminator: 2)
!1310 = !DILocation(line: 430, column: 8, scope: !1311)
!1311 = !DILexicalBlockFile(scope: !1296, file: !83, discriminator: 3)
!1312 = !DILocation(line: 431, column: 4, scope: !1296)
!1313 = !DILocation(line: 433, column: 9, scope: !1205)
!1314 = !DILocation(line: 433, column: 4, scope: !1205)
!1315 = !DILocation(line: 435, column: 9, scope: !1205)
!1316 = !DILocation(line: 435, column: 4, scope: !1205)
!1317 = !DILocation(line: 436, column: 11, scope: !1205)
!1318 = !DILocation(line: 436, column: 4, scope: !1205)
!1319 = distinct !DISubprogram(name: "ParseFmask", scope: !83, file: !83, line: 513, type: !108, isLocal: true, isDefinition: true, scopeLine: 516, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!1320 = !DILocalVariable(name: "option", arg: 1, scope: !1319, file: !83, line: 513, type: !110)
!1321 = !DILocation(line: 513, column: 24, scope: !1319)
!1322 = !DILocalVariable(name: "mountInfo", arg: 2, scope: !1319, file: !83, line: 514, type: !111)
!1323 = !DILocation(line: 514, column: 27, scope: !1319)
!1324 = !DILocalVariable(name: "flags", arg: 3, scope: !1319, file: !83, line: 515, type: !141)
!1325 = !DILocation(line: 515, column: 17, scope: !1319)
!1326 = !DILocation(line: 520, column: 18, scope: !1327)
!1327 = distinct !DILexicalBlock(scope: !1319, file: !83, line: 520, column: 8)
!1328 = !DILocation(line: 520, column: 27, scope: !1327)
!1329 = !DILocation(line: 520, column: 38, scope: !1327)
!1330 = !DILocation(line: 520, column: 8, scope: !1327)
!1331 = !DILocation(line: 520, column: 8, scope: !1319)
!1332 = !DILocation(line: 521, column: 8, scope: !1333)
!1333 = distinct !DILexicalBlock(scope: !1327, file: !83, line: 520, column: 46)
!1334 = !DILocation(line: 521, column: 58, scope: !1335)
