; ModuleID = './libRpcChannel_la-rpcChannel.o.i'
source_filename = "./libRpcChannel_la-rpcChannel.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.RpcChannelCallback = type { i8*, i32 (%struct.RpcInData*)*, i8*, i8*, i8*, i64 }
%struct.RpcInData = type { i8*, i8*, i64, i8*, i64, i32, i8*, i8* }
%struct.XDR = type { i32, %struct.xdr_ops*, i8*, i8*, i8*, i32 }
%struct.xdr_ops = type { i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*)*, i32 (%struct.XDR*, i32)*, i32* (%struct.XDR*, i32)*, void (%struct.XDR*)*, i32 (%struct.XDR*, i32*)*, i32 (%struct.XDR*, i32*)* }
%struct.RpcChannelInt = type { %struct._RpcChannel, i8*, %struct._GHashTable*, %struct._GMainContext*, %struct._GSource*, i8*, %struct.RpcChannelCallback, void (%struct._RpcChannel*, i32, i8*)*, i8*, i32, i32 }
%struct._RpcChannel = type { %struct._RpcChannelFuncs*, i8*, %struct._GMainContext*, i8*, i8*, %struct.GStaticMutex, %struct.RpcIn*, i32, i32 }
%struct._RpcChannelFuncs = type { i32 (%struct._RpcChannel*)*, void (%struct._RpcChannel*)*, i32 (%struct._RpcChannel*, i8*, i64, i8*, i8**, i64*)*, void (%struct._RpcChannel*, %struct._GMainContext*, i8*, i8*)*, void (%struct._RpcChannel*)*, i32 (%struct._RpcChannel*)*, void (%struct._RpcChannel*)*, i32 (%struct._RpcChannel*)* }
%struct.GStaticMutex = type { %union._GMutex*, %union.pthread_mutex_t }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !16, globals: !329)
!1 = !DIFile(filename: "libRpcChannel_la-rpcChannel.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line819")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdr_op", file: !4, line: 81, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/rpc/xdr.h", directory: "/home/lichi/Desktop/open-vm-tools/line819")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "XDR_ENCODE", value: 0)
!7 = !DIEnumerator(name: "XDR_DECODE", value: 1)
!8 = !DIEnumerator(name: "XDR_FREE", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RpcChannelType", file: !10, line: 79, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line819")
!11 = !{!12, !13, !14, !15}
!12 = !DIEnumerator(name: "RPCCHANNEL_TYPE_INACTIVE", value: 0)
!13 = !DIEnumerator(name: "RPCCHANNEL_TYPE_BKDOOR", value: 1)
!14 = !DIEnumerator(name: "RPCCHANNEL_TYPE_PRIV_VSOCK", value: 2)
!15 = !DIEnumerator(name: "RPCCHANNEL_TYPE_UNPRIV_VSOCK", value: 3)
!16 = !{!17, !18, !71, !61, !255}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannelInt", file: !20, line: 57, baseType: !21)
!20 = !DIFile(filename: "rpcChannel.c", directory: "/home/lichi/Desktop/open-vm-tools/line819")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcChannelInt", file: !20, line: 43, size: 1728, align: 64, elements: !22)
!22 = !{!23, !136, !139, !144, !145, !220, !221, !247, !252, !253, !254}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "impl", scope: !21, file: !20, line: 44, baseType: !24, size: 832, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !10, line: 48, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !26, line: 64, size: 832, align: 64, elements: !27)
!26 = !DIFile(filename: "rpcChannelInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line819")
!27 = !{!28, !80, !81, !82, !83, !84, !131, !134, !135}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !25, file: !26, line: 65, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannelFuncs", file: !26, line: 56, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannelFuncs", file: !26, line: 45, size: 512, align: 64, elements: !33)
!33 = !{!34, !43, !47, !63, !72, !73, !78, !79}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !32, file: !26, line: 46, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !42}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !39, line: 50, baseType: !40)
!39 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line819")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !39, line: 49, baseType: !41)
!41 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !32, file: !26, line: 47, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !42}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !32, file: !26, line: 48, baseType: !48, size: 64, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!38, !42, !51, !54, !57, !60, !62}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !55, line: 216, baseType: !56)
!55 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line819")
!56 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !59, line: 230, baseType: !53)
!59 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line819")
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !32, file: !26, line: 50, baseType: !64, size: 64, align: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !42, !67, !51, !71}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !69, line: 48, baseType: !70)
!69 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line819")
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !69, line: 48, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !39, line: 77, baseType: !17)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !32, file: !26, line: 52, baseType: !44, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "getType", scope: !32, file: !26, line: 53, baseType: !74, size: 64, align: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !42}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannelType", file: !10, line: 84, baseType: !9)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "onStartErr", scope: !32, file: !26, line: 54, baseType: !44, size: 64, align: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "stopRpcOut", scope: !32, file: !26, line: 55, baseType: !35, size: 64, align: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !25, file: !26, line: 66, baseType: !71, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "mainCtx", scope: !25, file: !26, line: 68, baseType: !67, size: 64, align: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "appName", scope: !25, file: !26, line: 69, baseType: !51, size: 64, align: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "appCtx", scope: !25, file: !26, line: 70, baseType: !71, size: 64, align: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "outLock", scope: !25, file: !26, line: 72, baseType: !85, size: 384, align: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "GStaticMutex", file: !86, line: 140, baseType: !87)
!86 = !DIFile(filename: "/usr/include/glib-2.0/glib/deprecated/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line819")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 133, size: 384, align: 64, elements: !88)
!88 = !{!89, !102}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !87, file: !86, line: 135, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMutex", file: !92, line: 51, baseType: !93)
!92 = !DIFile(filename: "/usr/include/glib-2.0/glib/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line819")
!93 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GMutex", file: !92, line: 58, size: 64, align: 64, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !93, file: !92, line: 61, baseType: !71, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !93, file: !92, line: 62, baseType: !97, size: 64, align: 32)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 64, align: 32, elements: !100)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !39, line: 55, baseType: !99)
!99 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!100 = !{!101}
!101 = !DISubrange(count: 2)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !87, file: !86, line: 138, baseType: !103, size: 320, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !104, line: 128, baseType: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line819")
!105 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !104, line: 90, size: 320, align: 64, elements: !106)
!106 = !{!107, !125, !129}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !105, file: !104, line: 125, baseType: !108, size: 320, align: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !104, line: 92, size: 320, align: 64, elements: !109)
!109 = !{!110, !111, !112, !113, !114, !115, !117, !118}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !108, file: !104, line: 94, baseType: !41, size: 32, align: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !108, file: !104, line: 95, baseType: !99, size: 32, align: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !108, file: !104, line: 96, baseType: !41, size: 32, align: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !108, file: !104, line: 98, baseType: !99, size: 32, align: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !108, file: !104, line: 102, baseType: !41, size: 32, align: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !108, file: !104, line: 104, baseType: !116, size: 16, align: 16, offset: 160)
!116 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !108, file: !104, line: 105, baseType: !116, size: 16, align: 16, offset: 176)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !108, file: !104, line: 106, baseType: !119, size: 128, align: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !104, line: 79, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !104, line: 75, size: 128, align: 64, elements: !121)
!121 = !{!122, !124}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !120, file: !104, line: 77, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !120, file: !104, line: 78, baseType: !123, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !105, file: !104, line: 126, baseType: !126, size: 320, align: 8)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 320, align: 8, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 40)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !105, file: !104, line: 127, baseType: !130, size: 64, align: 64)
!130 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !25, file: !26, line: 74, baseType: !132, size: 64, align: 64, offset: 704)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "RpcIn", file: !26, line: 41, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "inStarted", scope: !25, file: !26, line: 75, baseType: !38, size: 32, align: 32, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "outStarted", scope: !25, file: !26, line: 77, baseType: !38, size: 32, align: 32, offset: 800)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "appName", scope: !21, file: !20, line: 46, baseType: !137, size: 64, align: 64, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !39, line: 46, baseType: !53)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "rpcs", scope: !21, file: !20, line: 47, baseType: !140, size: 64, align: 64, offset: 896)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !142, line: 37, baseType: !143)
!142 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/open-vm-tools/line819")
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !142, line: 37, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mainCtx", scope: !21, file: !20, line: 48, baseType: !67, size: 64, align: 64, offset: 960)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "resetCheck", scope: !21, file: !20, line: 49, baseType: !146, size: 64, align: 64, offset: 1024)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !69, line: 64, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !69, line: 171, size: 768, align: 64, elements: !149)
!149 = !{!150, !151, !171, !200, !201, !202, !203, !204, !205, !213, !214, !215, !216}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !148, file: !69, line: 174, baseType: !71, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !148, file: !69, line: 175, baseType: !152, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !69, line: 77, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !69, line: 196, size: 192, align: 64, elements: !155)
!155 = !{!156, !160, !161}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !154, file: !69, line: 198, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !71}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !154, file: !69, line: 199, baseType: !157, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !154, file: !69, line: 200, baseType: !162, size: 64, align: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !71, !146, !165, !170}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !69, line: 155, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!38, !71}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !148, file: !69, line: 177, baseType: !172, size: 64, align: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !69, line: 130, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !69, line: 214, size: 384, align: 64, elements: !176)
!176 = !{!177, !182, !186, !190, !194, !195}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !175, file: !69, line: 216, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!38, !146, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !175, file: !69, line: 218, baseType: !183, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!38, !146}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !175, file: !69, line: 219, baseType: !187, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!38, !146, !166, !71}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !175, file: !69, line: 222, baseType: !191, size: 64, align: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !146}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !175, file: !69, line: 226, baseType: !166, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !175, file: !69, line: 227, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !69, line: 212, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{null}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !148, file: !69, line: 178, baseType: !98, size: 32, align: 32, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !148, file: !69, line: 180, baseType: !67, size: 64, align: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !148, file: !69, line: 182, baseType: !40, size: 32, align: 32, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !148, file: !69, line: 183, baseType: !98, size: 32, align: 32, offset: 352)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !148, file: !69, line: 184, baseType: !98, size: 32, align: 32, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !148, file: !69, line: 186, baseType: !206, size: 64, align: 64, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !208, line: 37, baseType: !209)
!208 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line819")
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !208, line: 39, size: 128, align: 64, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !209, file: !208, line: 41, baseType: !71, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !209, file: !208, line: 42, baseType: !206, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !148, file: !69, line: 188, baseType: !146, size: 64, align: 64, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !148, file: !69, line: 189, baseType: !146, size: 64, align: 64, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !69, line: 191, baseType: !61, size: 64, align: 64, offset: 640)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !148, file: !69, line: 193, baseType: !217, size: 64, align: 64, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !69, line: 65, baseType: !219)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !69, line: 65, flags: DIFlagFwdDecl)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "appCtx", scope: !21, file: !20, line: 50, baseType: !71, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "resetReg", scope: !21, file: !20, line: 51, baseType: !222, size: 384, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannelCallback", file: !10, line: 115, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcChannelCallback", file: !10, line: 94, size: 384, align: 64, elements: !224)
!224 = !{!225, !226, !243, !244, !245, !246}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !223, file: !10, line: 96, baseType: !51, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !223, file: !10, line: 98, baseType: !227, size: 64, align: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcIn_Callback", file: !10, line: 90, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!38, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcInData", file: !10, line: 77, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcInData", file: !10, line: 51, size: 512, align: 64, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !10, line: 53, baseType: !51, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !233, file: !10, line: 58, baseType: !51, size: 64, align: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "argsSize", scope: !233, file: !10, line: 60, baseType: !54, size: 64, align: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !233, file: !10, line: 65, baseType: !61, size: 64, align: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "resultLen", scope: !233, file: !10, line: 67, baseType: !54, size: 64, align: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "freeResult", scope: !233, file: !10, line: 72, baseType: !38, size: 32, align: 32, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "appCtx", scope: !233, file: !10, line: 74, baseType: !17, size: 64, align: 64, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !233, file: !10, line: 76, baseType: !17, size: 64, align: 64, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !223, file: !10, line: 100, baseType: !71, size: 64, align: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "xdrIn", scope: !223, file: !10, line: 102, baseType: !71, size: 64, align: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "xdrOut", scope: !223, file: !10, line: 109, baseType: !71, size: 64, align: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "xdrInSize", scope: !223, file: !10, line: 114, baseType: !54, size: 64, align: 64, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "resetCb", scope: !21, file: !20, line: 52, baseType: !248, size: 64, align: 64, offset: 1536)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannelResetCb", file: !10, line: 124, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !42, !38, !71}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "resetData", scope: !21, file: !20, line: 53, baseType: !71, size: 64, align: 64, offset: 1600)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "rpcError", scope: !21, file: !20, line: 54, baseType: !38, size: 32, align: 32, offset: 1664)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "rpcErrorCount", scope: !21, file: !20, line: 55, baseType: !98, size: 32, align: 32, offset: 1696)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdrproc_t", file: !4, line: 152, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!259, !261, !17, null}
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool_t", file: !260, line: 37, baseType: !41)
!260 = !DIFile(filename: "/usr/include/rpc/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line819")
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDR", file: !4, line: 109, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "XDR", file: !4, line: 110, size: 384, align: 64, elements: !264)
!264 = !{!265, !266, !325, !326, !327, !328}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "x_op", scope: !263, file: !4, line: 112, baseType: !3, size: 32, align: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "x_ops", scope: !263, file: !4, line: 136, baseType: !267, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdr_ops", file: !4, line: 113, size: 640, align: 64, elements: !269)
!269 = !{!270, !275, !281, !291, !295, !301, !305, !311, !315, !319}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "x_getlong", scope: !268, file: !4, line: 115, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!259, !261, !274}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "x_putlong", scope: !268, file: !4, line: 117, baseType: !276, size: 64, align: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!259, !261, !279}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "x_getbytes", scope: !268, file: !4, line: 119, baseType: !282, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!259, !261, !285, !289}
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !286, line: 116, baseType: !287)
!286 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line819")
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__caddr_t", file: !288, line: 183, baseType: !61)
!288 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line819")
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !286, line: 35, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !288, line: 32, baseType: !99)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "x_putbytes", scope: !268, file: !4, line: 121, baseType: !292, size: 64, align: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!259, !261, !51, !289}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "x_getpostn", scope: !268, file: !4, line: 123, baseType: !296, size: 64, align: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!289, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "x_setpostn", scope: !268, file: !4, line: 125, baseType: !302, size: 64, align: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!259, !261, !289}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "x_inline", scope: !268, file: !4, line: 127, baseType: !306, size: 64, align: 64, offset: 384)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!309, !261, !289}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !286, line: 196, baseType: !41)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "x_destroy", scope: !268, file: !4, line: 129, baseType: !312, size: 64, align: 64, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !261}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "x_getint32", scope: !268, file: !4, line: 131, baseType: !316, size: 64, align: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!259, !261, !309}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "x_putint32", scope: !268, file: !4, line: 133, baseType: !320, size: 64, align: 64, offset: 576)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!259, !261, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "x_public", scope: !263, file: !4, line: 137, baseType: !285, size: 64, align: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "x_private", scope: !263, file: !4, line: 138, baseType: !285, size: 64, align: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "x_base", scope: !263, file: !4, line: 139, baseType: !285, size: 64, align: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "x_handy", scope: !263, file: !4, line: 140, baseType: !289, size: 32, align: 32, offset: 320)
!329 = !{!330, !333, !337, !338}
!330 = distinct !DIGlobalVariable(name: "channelTimeoutAttempts", scope: !331, file: !20, line: 149, type: !41, isLocal: true, isDefinition: true, variable: i32* @RpcChannelCheckReset.channelTimeoutAttempts)
!331 = distinct !DISubprogram(name: "RpcChannelCheckReset", scope: !20, file: !20, line: 147, type: !168, isLocal: true, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!332 = !{}
!333 = distinct !DIGlobalVariable(name: "gRpcHandlers", scope: !0, file: !20, line: 80, type: !334, isLocal: true, isDefinition: true, variable: [1 x %struct.RpcChannelCallback]* @gRpcHandlers)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 384, align: 64, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 1)
!337 = distinct !DIGlobalVariable(name: "gUseBackdoorOnly", scope: !0, file: !20, line: 61, type: !38, isLocal: true, isDefinition: true, variable: i32* @gUseBackdoorOnly)
!338 = distinct !DIGlobalVariable(name: "gVSocketFailed", scope: !0, file: !20, line: 68, type: !38, isLocal: true, isDefinition: true, variable: i32* @gVSocketFailed)
!339 = !{i32 2, !"Dwarf Version", i32 4}
!340 = !{i32 2, !"Debug Info Version", i32 3}
!341 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!342 = distinct !DISubprogram(name: "RpcChannel_BuildXdrCommand", scope: !20, file: !20, line: 321, type: !343, isLocal: false, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!343 = !DISubroutineType(types: !344)
!344 = !{!38, !51, !17, !17, !60, !62}
!345 = !DILocalVariable(name: "cmd", arg: 1, scope: !342, file: !20, line: 321, type: !51)
!346 = !DIExpression()
!347 = !DILocation(line: 321, column: 40, scope: !342)
!348 = !DILocalVariable(name: "xdrProc", arg: 2, scope: !342, file: !20, line: 322, type: !17)
!349 = !DILocation(line: 322, column: 34, scope: !342)
!350 = !DILocalVariable(name: "xdrData", arg: 3, scope: !342, file: !20, line: 323, type: !17)
!351 = !DILocation(line: 323, column: 34, scope: !342)
!352 = !DILocalVariable(name: "result", arg: 4, scope: !342, file: !20, line: 324, type: !60)
!353 = !DILocation(line: 324, column: 35, scope: !342)
!354 = !DILocalVariable(name: "resultLen", arg: 5, scope: !342, file: !20, line: 325, type: !62)
!355 = !DILocation(line: 325, column: 36, scope: !342)
!356 = !DILocalVariable(name: "ret", scope: !342, file: !20, line: 327, type: !58)
!357 = !DILocation(line: 327, column: 9, scope: !342)
!358 = !DILocalVariable(name: "proc", scope: !342, file: !20, line: 328, type: !255)
!359 = !DILocation(line: 328, column: 14, scope: !342)
!360 = !DILocation(line: 328, column: 21, scope: !342)
!361 = !DILocalVariable(name: "xdrs", scope: !342, file: !20, line: 329, type: !262)
!362 = !DILocation(line: 329, column: 8, scope: !342)
!363 = !DILocation(line: 331, column: 8, scope: !364)
!364 = distinct !DILexicalBlock(scope: !342, file: !20, line: 331, column: 8)
!365 = !DILocation(line: 331, column: 29, scope: !364)
!366 = !DILocation(line: 331, column: 8, scope: !342)
!367 = !DILocation(line: 332, column: 7, scope: !368)
!368 = distinct !DILexicalBlock(scope: !364, file: !20, line: 331, column: 37)
!369 = !DILocation(line: 335, column: 33, scope: !370)
!370 = distinct !DILexicalBlock(scope: !342, file: !20, line: 335, column: 8)
!371 = !DILocation(line: 335, column: 45, scope: !370)
!372 = !DILocation(line: 335, column: 38, scope: !370)
!373 = !DILocation(line: 335, column: 9, scope: !374)
!374 = !DILexicalBlockFile(scope: !370, file: !20, discriminator: 1)
!375 = !DILocation(line: 335, column: 9, scope: !370)
!376 = !DILocation(line: 335, column: 8, scope: !342)
!377 = !DILocation(line: 336, column: 7, scope: !378)
!378 = distinct !DILexicalBlock(scope: !370, file: !20, line: 335, column: 52)
!379 = !DILocation(line: 339, column: 9, scope: !380)
!380 = distinct !DILexicalBlock(scope: !342, file: !20, line: 339, column: 8)
!381 = !DILocation(line: 339, column: 8, scope: !342)
!382 = !DILocation(line: 340, column: 7, scope: !383)
!383 = distinct !DILexicalBlock(scope: !380, file: !20, line: 339, column: 42)
!384 = !DILocation(line: 343, column: 9, scope: !385)
!385 = distinct !DILexicalBlock(scope: !342, file: !20, line: 343, column: 8)
!386 = !DILocation(line: 343, column: 21, scope: !385)
!387 = !DILocation(line: 343, column: 8, scope: !342)
!388 = !DILocation(line: 344, column: 7, scope: !389)
!389 = distinct !DILexicalBlock(scope: !385, file: !20, line: 343, column: 34)
!390 = !DILocation(line: 347, column: 14, scope: !342)
!391 = !DILocation(line: 347, column: 5, scope: !342)
!392 = !DILocation(line: 347, column: 12, scope: !342)
!393 = !DILocation(line: 348, column: 19, scope: !342)
!394 = !DILocation(line: 348, column: 26, scope: !342)
!395 = !DILocation(line: 348, column: 16, scope: !342)
!396 = !DILocation(line: 348, column: 5, scope: !342)
!397 = !DILocation(line: 348, column: 15, scope: !342)
!398 = !DILocation(line: 350, column: 8, scope: !342)
!399 = !DILocation(line: 350, column: 4, scope: !342)
!400 = !DILocation(line: 353, column: 27, scope: !342)
!401 = !DILocation(line: 353, column: 26, scope: !342)
!402 = !DILocation(line: 353, column: 4, scope: !342)
!403 = !DILocation(line: 354, column: 11, scope: !342)
!404 = !DILocation(line: 354, column: 4, scope: !342)
!405 = !DILocation(line: 355, column: 1, scope: !342)
!406 = distinct !DISubprogram(name: "RpcChannel_Dispatch", scope: !20, file: !20, line: 369, type: !229, isLocal: false, isDefinition: true, scopeLine: 370, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!407 = !DILocalVariable(name: "data", arg: 1, scope: !406, file: !20, line: 369, type: !231)
!408 = !DILocation(line: 369, column: 32, scope: !406)
!409 = !DILocalVariable(name: "name", scope: !406, file: !20, line: 371, type: !61)
!410 = !DILocation(line: 371, column: 10, scope: !406)
!411 = !DILocalVariable(name: "index", scope: !406, file: !20, line: 372, type: !99)
!412 = !DILocation(line: 372, column: 17, scope: !406)
!413 = !DILocalVariable(name: "nameLen", scope: !406, file: !20, line: 373, type: !54)
!414 = !DILocation(line: 373, column: 11, scope: !406)
!415 = !DILocalVariable(name: "status", scope: !406, file: !20, line: 374, type: !58)
!416 = !DILocation(line: 374, column: 9, scope: !406)
!417 = !DILocalVariable(name: "rpc", scope: !406, file: !20, line: 375, type: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!419 = !DILocation(line: 375, column: 24, scope: !406)
!420 = !DILocalVariable(name: "chan", scope: !406, file: !20, line: 376, type: !18)
!421 = !DILocation(line: 376, column: 19, scope: !406)
!422 = !DILocation(line: 376, column: 26, scope: !406)
!423 = !DILocation(line: 376, column: 32, scope: !406)
!424 = !DILocation(line: 378, column: 40, scope: !406)
!425 = !DILocation(line: 378, column: 46, scope: !406)
!426 = !DILocation(line: 378, column: 11, scope: !406)
!427 = !DILocation(line: 378, column: 9, scope: !406)
!428 = !DILocation(line: 379, column: 8, scope: !429)
!429 = distinct !DILexicalBlock(scope: !406, file: !20, line: 379, column: 8)
!430 = !DILocation(line: 379, column: 13, scope: !429)
!431 = !DILocation(line: 379, column: 8, scope: !406)
!432 = !DILocation(line: 380, column: 7, scope: !433)
!433 = distinct !DILexicalBlock(scope: !429, file: !20, line: 379, column: 21)
!434 = !DILocation(line: 381, column: 38, scope: !433)
!435 = !DILocation(line: 381, column: 16, scope: !433)
!436 = !DILocation(line: 381, column: 14, scope: !433)
!437 = !DILocation(line: 382, column: 7, scope: !433)
!438 = !DILocation(line: 385, column: 8, scope: !439)
!439 = distinct !DILexicalBlock(scope: !406, file: !20, line: 385, column: 8)
!440 = !DILocation(line: 385, column: 14, scope: !439)
!441 = !DILocation(line: 385, column: 19, scope: !439)
!442 = !DILocation(line: 385, column: 8, scope: !406)
!443 = !DILocation(line: 386, column: 33, scope: !444)
!444 = distinct !DILexicalBlock(scope: !439, file: !20, line: 385, column: 27)
!445 = !DILocation(line: 386, column: 39, scope: !444)
!446 = !DILocation(line: 386, column: 45, scope: !444)
!447 = !DILocation(line: 386, column: 13, scope: !444)
!448 = !DILocation(line: 386, column: 11, scope: !444)
!449 = !DILocation(line: 387, column: 4, scope: !444)
!450 = !DILocation(line: 389, column: 8, scope: !451)
!451 = distinct !DILexicalBlock(scope: !406, file: !20, line: 389, column: 8)
!452 = !DILocation(line: 389, column: 12, scope: !451)
!453 = !DILocation(line: 389, column: 8, scope: !406)
!454 = !DILocation(line: 390, column: 79, scope: !455)
!455 = distinct !DILexicalBlock(scope: !451, file: !20, line: 389, column: 20)
!456 = !DILocation(line: 390, column: 7, scope: !455)
!457 = !DILocation(line: 391, column: 38, scope: !455)
!458 = !DILocation(line: 391, column: 16, scope: !455)
!459 = !DILocation(line: 391, column: 14, scope: !455)
!460 = !DILocation(line: 392, column: 7, scope: !455)
!461 = !DILocation(line: 396, column: 21, scope: !406)
!462 = !DILocation(line: 396, column: 14, scope: !406)
!463 = !DILocation(line: 396, column: 12, scope: !406)
!464 = !DILocation(line: 397, column: 17, scope: !406)
!465 = !DILocation(line: 397, column: 4, scope: !406)
!466 = !DILocation(line: 397, column: 10, scope: !406)
!467 = !DILocation(line: 397, column: 15, scope: !406)
!468 = !DILocation(line: 398, column: 17, scope: !406)
!469 = !DILocation(line: 398, column: 23, scope: !406)
!470 = !DILocation(line: 398, column: 30, scope: !406)
!471 = !DILocation(line: 398, column: 28, scope: !406)
!472 = !DILocation(line: 398, column: 4, scope: !406)
!473 = !DILocation(line: 398, column: 10, scope: !406)
!474 = !DILocation(line: 398, column: 15, scope: !406)
!475 = !DILocation(line: 399, column: 22, scope: !406)
!476 = !DILocation(line: 399, column: 4, scope: !406)
!477 = !DILocation(line: 399, column: 10, scope: !406)
!478 = !DILocation(line: 399, column: 19, scope: !406)
!479 = !DILocation(line: 400, column: 19, scope: !406)
!480 = !DILocation(line: 400, column: 25, scope: !406)
!481 = !DILocation(line: 400, column: 4, scope: !406)
!482 = !DILocation(line: 400, column: 10, scope: !406)
!483 = !DILocation(line: 400, column: 17, scope: !406)
!484 = !DILocation(line: 401, column: 23, scope: !406)
!485 = !DILocation(line: 401, column: 28, scope: !406)
!486 = !DILocation(line: 401, column: 4, scope: !406)
!487 = !DILocation(line: 401, column: 10, scope: !406)
!488 = !DILocation(line: 401, column: 21, scope: !406)
!489 = !DILocation(line: 403, column: 8, scope: !490)
!490 = distinct !DILexicalBlock(scope: !406, file: !20, line: 403, column: 8)
!491 = !DILocation(line: 403, column: 13, scope: !490)
!492 = !DILocation(line: 403, column: 19, scope: !490)
!493 = !DILocation(line: 403, column: 26, scope: !490)
!494 = !DILocation(line: 403, column: 29, scope: !495)
!495 = !DILexicalBlockFile(scope: !490, file: !20, discriminator: 1)
!496 = !DILocation(line: 403, column: 34, scope: !495)
!497 = !DILocation(line: 403, column: 41, scope: !495)
!498 = !DILocation(line: 403, column: 8, scope: !495)
!499 = !DILocation(line: 404, column: 37, scope: !500)
!500 = distinct !DILexicalBlock(scope: !490, file: !20, line: 403, column: 50)
!501 = !DILocation(line: 404, column: 43, scope: !500)
!502 = !DILocation(line: 404, column: 16, scope: !500)
!503 = !DILocation(line: 404, column: 14, scope: !500)
!504 = !DILocation(line: 405, column: 4, scope: !500)
!505 = !DILocation(line: 406, column: 16, scope: !506)
!506 = distinct !DILexicalBlock(scope: !490, file: !20, line: 405, column: 11)
!507 = !DILocation(line: 406, column: 21, scope: !506)
!508 = !DILocation(line: 406, column: 30, scope: !506)
!509 = !DILocation(line: 406, column: 14, scope: !506)
!510 = !DILocation(line: 409, column: 4, scope: !406)
!511 = !DILocation(line: 412, column: 4, scope: !406)
!512 = !DILocation(line: 412, column: 10, scope: !406)
!513 = !DILocation(line: 412, column: 15, scope: !406)
!514 = !DILocation(line: 413, column: 9, scope: !406)
!515 = !DILocation(line: 413, column: 4, scope: !406)
!516 = !DILocation(line: 414, column: 11, scope: !406)
!517 = !DILocation(line: 414, column: 4, scope: !406)
!518 = distinct !DISubprogram(name: "RpcChannel_SetRetVals", scope: !20, file: !20, line: 631, type: !519, isLocal: false, isDefinition: true, scopeLine: 634, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!519 = !DISubroutineType(types: !520)
!520 = !{!38, !231, !51, !38}
!521 = !DILocalVariable(name: "data", arg: 1, scope: !518, file: !20, line: 631, type: !231)
!522 = !DILocation(line: 631, column: 34, scope: !518)
!523 = !DILocalVariable(name: "result", arg: 2, scope: !518, file: !20, line: 632, type: !51)
!524 = !DILocation(line: 632, column: 35, scope: !518)
!525 = !DILocalVariable(name: "retVal", arg: 3, scope: !518, file: !20, line: 633, type: !38)
!526 = !DILocation(line: 633, column: 32, scope: !518)
!527 = !DILocation(line: 638, column: 27, scope: !518)
!528 = !DILocation(line: 638, column: 4, scope: !518)
!529 = !DILocation(line: 638, column: 10, scope: !518)
!530 = !DILocation(line: 638, column: 17, scope: !518)
!531 = !DILocation(line: 639, column: 29, scope: !518)
!532 = !DILocation(line: 639, column: 35, scope: !518)
!533 = !DILocation(line: 639, column: 22, scope: !518)
!534 = !DILocation(line: 639, column: 4, scope: !518)
!535 = !DILocation(line: 639, column: 10, scope: !518)
!536 = !DILocation(line: 639, column: 20, scope: !518)
!537 = !DILocation(line: 640, column: 4, scope: !518)
!538 = !DILocation(line: 640, column: 10, scope: !518)
!539 = !DILocation(line: 640, column: 21, scope: !518)
!540 = !DILocation(line: 642, column: 11, scope: !518)
!541 = !DILocation(line: 642, column: 4, scope: !518)
!542 = distinct !DISubprogram(name: "RpcChannelXdrWrapper", scope: !20, file: !20, line: 229, type: !543, isLocal: true, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!543 = !DISubroutineType(types: !544)
!544 = !{!58, !231, !418}
!545 = !DILocalVariable(name: "data", arg: 1, scope: !542, file: !20, line: 229, type: !231)
!546 = !DILocation(line: 229, column: 33, scope: !542)
!547 = !DILocalVariable(name: "rpc", arg: 2, scope: !542, file: !20, line: 230, type: !418)
!548 = !DILocation(line: 230, column: 42, scope: !542)
!549 = !DILocalVariable(name: "ret", scope: !542, file: !20, line: 232, type: !58)
!550 = !DILocation(line: 232, column: 9, scope: !542)
!551 = !DILocalVariable(name: "copy", scope: !542, file: !20, line: 233, type: !232)
!552 = !DILocation(line: 233, column: 14, scope: !542)
!553 = !DILocalVariable(name: "xdrData", scope: !542, file: !20, line: 234, type: !17)
!554 = !DILocation(line: 234, column: 10, scope: !542)
!555 = !DILocation(line: 236, column: 9, scope: !542)
!556 = !DILocation(line: 236, column: 20, scope: !542)
!557 = !DILocation(line: 237, column: 9, scope: !542)
!558 = !DILocation(line: 237, column: 16, scope: !542)
!559 = !DILocation(line: 238, column: 8, scope: !560)
!560 = distinct !DILexicalBlock(scope: !542, file: !20, line: 238, column: 8)
!561 = !DILocation(line: 238, column: 13, scope: !560)
!562 = !DILocation(line: 238, column: 19, scope: !560)
!563 = !DILocation(line: 238, column: 8, scope: !542)
!564 = !DILocation(line: 239, column: 24, scope: !565)
!565 = distinct !DILexicalBlock(scope: !560, file: !20, line: 238, column: 27)
!566 = !DILocation(line: 239, column: 29, scope: !565)
!567 = !DILocation(line: 239, column: 17, scope: !565)
!568 = !DILocation(line: 239, column: 15, scope: !565)
!569 = !DILocation(line: 240, column: 11, scope: !570)
!570 = distinct !DILexicalBlock(scope: !565, file: !20, line: 240, column: 11)
!571 = !DILocation(line: 240, column: 19, scope: !570)
!572 = !DILocation(line: 240, column: 11, scope: !565)
!573 = !DILocation(line: 241, column: 38, scope: !574)
!574 = distinct !DILexicalBlock(scope: !570, file: !20, line: 240, column: 27)
!575 = !DILocation(line: 241, column: 16, scope: !574)
!576 = !DILocation(line: 241, column: 14, scope: !574)
!577 = !DILocation(line: 242, column: 10, scope: !574)
!578 = !DILocation(line: 245, column: 14, scope: !565)
!579 = !DILocation(line: 245, column: 26, scope: !565)
!580 = !DILocation(line: 245, column: 31, scope: !565)
!581 = !DILocation(line: 245, column: 7, scope: !565)
!582 = !DILocation(line: 246, column: 32, scope: !583)
!583 = distinct !DILexicalBlock(scope: !565, file: !20, line: 246, column: 11)
!584 = !DILocation(line: 246, column: 38, scope: !583)
!585 = !DILocation(line: 246, column: 43, scope: !583)
!586 = !DILocation(line: 246, column: 48, scope: !583)
!587 = !DILocation(line: 246, column: 54, scope: !583)
!588 = !DILocation(line: 246, column: 63, scope: !583)
!589 = !DILocation(line: 247, column: 32, scope: !583)
!590 = !DILocation(line: 247, column: 37, scope: !583)
!591 = !DILocation(line: 247, column: 44, scope: !583)
!592 = !DILocation(line: 246, column: 12, scope: !583)
!593 = !DILocation(line: 246, column: 11, scope: !565)
!594 = !DILocation(line: 248, column: 38, scope: !595)
!595 = distinct !DILexicalBlock(scope: !583, file: !20, line: 247, column: 54)
!596 = !DILocation(line: 248, column: 16, scope: !595)
!597 = !DILocation(line: 248, column: 14, scope: !595)
!598 = !DILocation(line: 249, column: 15, scope: !595)
!599 = !DILocation(line: 249, column: 10, scope: !595)
!600 = !DILocation(line: 250, column: 10, scope: !595)
!601 = !DILocation(line: 253, column: 19, scope: !565)
!602 = !DILocation(line: 253, column: 25, scope: !565)
!603 = !DILocation(line: 253, column: 12, scope: !565)
!604 = !DILocation(line: 253, column: 17, scope: !565)
!605 = !DILocation(line: 254, column: 19, scope: !565)
!606 = !DILocation(line: 254, column: 12, scope: !565)
!607 = !DILocation(line: 254, column: 17, scope: !565)
!608 = !DILocation(line: 255, column: 23, scope: !565)
!609 = !DILocation(line: 255, column: 28, scope: !565)
!610 = !DILocation(line: 255, column: 12, scope: !565)
!611 = !DILocation(line: 255, column: 21, scope: !565)
!612 = !DILocation(line: 256, column: 21, scope: !565)
!613 = !DILocation(line: 256, column: 27, scope: !565)
!614 = !DILocation(line: 256, column: 12, scope: !565)
!615 = !DILocation(line: 256, column: 19, scope: !565)
!616 = !DILocation(line: 257, column: 24, scope: !565)
!617 = !DILocation(line: 257, column: 30, scope: !565)
!618 = !DILocation(line: 257, column: 12, scope: !565)
!619 = !DILocation(line: 257, column: 22, scope: !565)
!620 = !DILocation(line: 258, column: 25, scope: !565)
!621 = !DILocation(line: 258, column: 31, scope: !565)
!622 = !DILocation(line: 258, column: 12, scope: !565)
!623 = !DILocation(line: 258, column: 23, scope: !565)
!624 = !DILocation(line: 259, column: 21, scope: !565)
!625 = !DILocation(line: 259, column: 27, scope: !565)
!626 = !DILocation(line: 259, column: 12, scope: !565)
!627 = !DILocation(line: 259, column: 19, scope: !565)
!628 = !DILocation(line: 260, column: 25, scope: !565)
!629 = !DILocation(line: 260, column: 30, scope: !565)
!630 = !DILocation(line: 260, column: 12, scope: !565)
!631 = !DILocation(line: 260, column: 23, scope: !565)
!632 = !DILocation(line: 261, column: 4, scope: !565)
!633 = !DILocation(line: 262, column: 7, scope: !634)
!634 = distinct !DILexicalBlock(scope: !560, file: !20, line: 261, column: 11)
!635 = !DILocation(line: 262, column: 21, scope: !634)
!636 = !DILocation(line: 265, column: 10, scope: !542)
!637 = !DILocation(line: 265, column: 15, scope: !542)
!638 = !DILocation(line: 265, column: 8, scope: !542)
!639 = !DILocation(line: 267, column: 8, scope: !640)
!640 = distinct !DILexicalBlock(scope: !542, file: !20, line: 267, column: 8)
!641 = !DILocation(line: 267, column: 13, scope: !640)
!642 = !DILocation(line: 267, column: 19, scope: !640)
!643 = !DILocation(line: 267, column: 8, scope: !542)
!644 = !DILocation(line: 268, column: 28, scope: !645)
!645 = distinct !DILexicalBlock(scope: !640, file: !20, line: 267, column: 27)
!646 = !DILocation(line: 268, column: 33, scope: !645)
!647 = !DILocation(line: 268, column: 16, scope: !645)
!648 = !DILocation(line: 268, column: 50, scope: !645)
!649 = !DILocation(line: 268, column: 7, scope: !645)
!650 = !DILocation(line: 269, column: 12, scope: !645)
!651 = !DILocation(line: 269, column: 7, scope: !645)
!652 = !DILocation(line: 270, column: 12, scope: !645)
!653 = !DILocation(line: 270, column: 17, scope: !645)
!654 = !DILocation(line: 271, column: 27, scope: !645)
!655 = !DILocation(line: 271, column: 7, scope: !645)
!656 = !DILocation(line: 271, column: 13, scope: !645)
!657 = !DILocation(line: 271, column: 20, scope: !645)
!658 = !DILocation(line: 272, column: 30, scope: !645)
!659 = !DILocation(line: 272, column: 7, scope: !645)
!660 = !DILocation(line: 272, column: 13, scope: !645)
!661 = !DILocation(line: 272, column: 23, scope: !645)
!662 = !DILocation(line: 273, column: 31, scope: !645)
!663 = !DILocation(line: 273, column: 7, scope: !645)
!664 = !DILocation(line: 273, column: 13, scope: !645)
!665 = !DILocation(line: 273, column: 24, scope: !645)
!666 = !DILocation(line: 274, column: 4, scope: !645)
!667 = !DILocation(line: 276, column: 8, scope: !668)
!668 = distinct !DILexicalBlock(scope: !542, file: !20, line: 276, column: 8)
!669 = !DILocation(line: 276, column: 13, scope: !668)
!670 = !DILocation(line: 276, column: 20, scope: !668)
!671 = !DILocation(line: 276, column: 27, scope: !668)
!672 = !DILocation(line: 276, column: 35, scope: !673)
!673 = !DILexicalBlockFile(scope: !668, file: !20, discriminator: 1)
!674 = !DILocation(line: 276, column: 42, scope: !673)
!675 = !DILocation(line: 276, column: 8, scope: !673)
!676 = !DILocalVariable(name: "xdrs", scope: !677, file: !20, line: 277, type: !262)
!677 = distinct !DILexicalBlock(scope: !668, file: !20, line: 276, column: 51)
!678 = !DILocation(line: 277, column: 11, scope: !677)
!679 = !DILocalVariable(name: "xdrProc", scope: !677, file: !20, line: 278, type: !255)
!680 = !DILocation(line: 278, column: 17, scope: !677)
!681 = !DILocation(line: 278, column: 27, scope: !677)
!682 = !DILocation(line: 278, column: 32, scope: !677)
!683 = !DILocation(line: 280, column: 11, scope: !684)
!684 = distinct !DILexicalBlock(scope: !677, file: !20, line: 280, column: 11)
!685 = !DILocation(line: 280, column: 32, scope: !684)
!686 = !DILocation(line: 280, column: 11, scope: !677)
!687 = !DILocation(line: 281, column: 38, scope: !688)
!688 = distinct !DILexicalBlock(scope: !684, file: !20, line: 280, column: 40)
!689 = !DILocation(line: 281, column: 16, scope: !688)
!690 = !DILocation(line: 281, column: 14, scope: !688)
!691 = !DILocation(line: 282, column: 10, scope: !688)
!692 = !DILocation(line: 285, column: 12, scope: !693)
!693 = distinct !DILexicalBlock(scope: !677, file: !20, line: 285, column: 11)
!694 = !DILocation(line: 285, column: 32, scope: !693)
!695 = !DILocation(line: 285, column: 11, scope: !677)
!696 = !DILocation(line: 286, column: 38, scope: !697)
!697 = distinct !DILexicalBlock(scope: !693, file: !20, line: 285, column: 44)
!698 = !DILocation(line: 286, column: 16, scope: !697)
!699 = !DILocation(line: 286, column: 14, scope: !697)
!700 = !DILocation(line: 287, column: 10, scope: !697)
!701 = !DILocation(line: 288, column: 10, scope: !697)
!702 = !DILocation(line: 291, column: 16, scope: !703)
!703 = distinct !DILexicalBlock(scope: !677, file: !20, line: 291, column: 11)
!704 = !DILocation(line: 291, column: 11, scope: !703)
!705 = !DILocation(line: 291, column: 11, scope: !677)
!706 = !DILocation(line: 292, column: 31, scope: !707)
!707 = distinct !DILexicalBlock(scope: !703, file: !20, line: 291, column: 28)
!708 = !DILocation(line: 292, column: 36, scope: !707)
!709 = !DILocation(line: 292, column: 19, scope: !707)
!710 = !DILocation(line: 292, column: 59, scope: !707)
!711 = !DILocation(line: 292, column: 10, scope: !707)
!712 = !DILocation(line: 293, column: 7, scope: !707)
!713 = !DILocation(line: 294, column: 22, scope: !677)
!714 = !DILocation(line: 294, column: 7, scope: !677)
!715 = !DILocation(line: 294, column: 13, scope: !677)
!716 = !DILocation(line: 294, column: 20, scope: !677)
!717 = !DILocation(line: 295, column: 27, scope: !677)
!718 = !DILocation(line: 295, column: 34, scope: !677)
!719 = !DILocation(line: 295, column: 24, scope: !677)
!720 = !DILocation(line: 295, column: 7, scope: !677)
!721 = !DILocation(line: 295, column: 13, scope: !677)
!722 = !DILocation(line: 295, column: 23, scope: !677)
!723 = !DILocation(line: 296, column: 7, scope: !677)
!724 = !DILocation(line: 296, column: 13, scope: !677)
!725 = !DILocation(line: 296, column: 24, scope: !677)
!726 = !DILocation(line: 297, column: 7, scope: !677)
!727 = !DILocation(line: 298, column: 4, scope: !677)
!728 = !DILocation(line: 276, column: 55, scope: !729)
!729 = !DILexicalBlockFile(scope: !668, file: !20, discriminator: 2)
!730 = !DILocation(line: 301, column: 13, scope: !731)
!731 = distinct !DILexicalBlock(scope: !542, file: !20, line: 301, column: 8)
!732 = !DILocation(line: 301, column: 8, scope: !731)
!733 = !DILocation(line: 301, column: 24, scope: !731)
!734 = !DILocation(line: 301, column: 32, scope: !735)
!735 = !DILexicalBlockFile(scope: !731, file: !20, discriminator: 1)
!736 = !DILocation(line: 301, column: 39, scope: !735)
!737 = !DILocation(line: 301, column: 8, scope: !735)
!738 = !DILocation(line: 302, column: 19, scope: !739)
!739 = distinct !DILexicalBlock(scope: !731, file: !20, line: 301, column: 47)
!740 = !DILocation(line: 302, column: 7, scope: !739)
!741 = !DILocation(line: 303, column: 4, scope: !739)
!742 = !DILocation(line: 304, column: 11, scope: !542)
!743 = !DILocation(line: 304, column: 4, scope: !542)
!744 = distinct !DISubprogram(name: "RpcChannel_Setup", scope: !20, file: !20, line: 434, type: !745, isLocal: false, isDefinition: true, scopeLine: 440, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !42, !747, !67, !71, !248, !71}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!749 = !DILocalVariable(name: "chan", arg: 1, scope: !744, file: !20, line: 434, type: !42)
!750 = !DILocation(line: 434, column: 30, scope: !744)
!751 = !DILocalVariable(name: "appName", arg: 2, scope: !744, file: !20, line: 435, type: !747)
!752 = !DILocation(line: 435, column: 31, scope: !744)
!753 = !DILocalVariable(name: "mainCtx", arg: 3, scope: !744, file: !20, line: 436, type: !67)
!754 = !DILocation(line: 436, column: 32, scope: !744)
!755 = !DILocalVariable(name: "appCtx", arg: 4, scope: !744, file: !20, line: 437, type: !71)
!756 = !DILocation(line: 437, column: 27, scope: !744)
!757 = !DILocalVariable(name: "resetCb", arg: 5, scope: !744, file: !20, line: 438, type: !248)
!758 = !DILocation(line: 438, column: 36, scope: !744)
!759 = !DILocalVariable(name: "resetData", arg: 6, scope: !744, file: !20, line: 439, type: !71)
!760 = !DILocation(line: 439, column: 27, scope: !744)
!761 = !DILocalVariable(name: "i", scope: !744, file: !20, line: 441, type: !54)
!762 = !DILocation(line: 441, column: 11, scope: !744)
!763 = !DILocalVariable(name: "cdata", scope: !744, file: !20, line: 442, type: !18)
!764 = !DILocation(line: 442, column: 19, scope: !744)
!765 = !DILocation(line: 442, column: 45, scope: !744)
!766 = !DILocation(line: 442, column: 27, scope: !744)
!767 = !DILocation(line: 444, column: 30, scope: !744)
!768 = !DILocation(line: 444, column: 21, scope: !744)
!769 = !DILocation(line: 444, column: 4, scope: !744)
!770 = !DILocation(line: 444, column: 11, scope: !744)
!771 = !DILocation(line: 444, column: 19, scope: !744)
!772 = !DILocation(line: 445, column: 20, scope: !744)
!773 = !DILocation(line: 445, column: 4, scope: !744)
!774 = !DILocation(line: 445, column: 11, scope: !744)
!775 = !DILocation(line: 445, column: 18, scope: !744)
!776 = !DILocation(line: 446, column: 40, scope: !744)
!777 = !DILocation(line: 446, column: 21, scope: !744)
!778 = !DILocation(line: 446, column: 4, scope: !744)
!779 = !DILocation(line: 446, column: 11, scope: !744)
!780 = !DILocation(line: 446, column: 19, scope: !744)
!781 = !DILocation(line: 447, column: 21, scope: !744)
!782 = !DILocation(line: 447, column: 4, scope: !744)
!783 = !DILocation(line: 447, column: 11, scope: !744)
!784 = !DILocation(line: 447, column: 19, scope: !744)
!785 = !DILocation(line: 448, column: 23, scope: !744)
!786 = !DILocation(line: 448, column: 4, scope: !744)
!787 = !DILocation(line: 448, column: 11, scope: !744)
!788 = !DILocation(line: 448, column: 21, scope: !744)
!789 = !DILocation(line: 450, column: 4, scope: !744)
!790 = !DILocation(line: 450, column: 11, scope: !744)
!791 = !DILocation(line: 450, column: 20, scope: !744)
!792 = !DILocation(line: 450, column: 25, scope: !744)
!793 = !DILocation(line: 451, column: 4, scope: !744)
!794 = !DILocation(line: 451, column: 11, scope: !744)
!795 = !DILocation(line: 451, column: 20, scope: !744)
!796 = !DILocation(line: 451, column: 29, scope: !744)
!797 = !DILocation(line: 452, column: 33, scope: !744)
!798 = !DILocation(line: 452, column: 4, scope: !744)
!799 = !DILocation(line: 452, column: 11, scope: !744)
!800 = !DILocation(line: 452, column: 20, scope: !744)
!801 = !DILocation(line: 452, column: 31, scope: !744)
!802 = !DILocation(line: 455, column: 32, scope: !744)
!803 = !DILocation(line: 455, column: 39, scope: !744)
!804 = !DILocation(line: 455, column: 46, scope: !744)
!805 = !DILocation(line: 455, column: 4, scope: !744)
!806 = !DILocation(line: 457, column: 11, scope: !807)
!807 = distinct !DILexicalBlock(scope: !744, file: !20, line: 457, column: 4)
!808 = !DILocation(line: 457, column: 9, scope: !807)
!809 = !DILocation(line: 457, column: 16, scope: !810)
!810 = !DILexicalBlockFile(scope: !811, file: !20, discriminator: 1)
!811 = distinct !DILexicalBlock(scope: !807, file: !20, line: 457, column: 4)
!812 = !DILocation(line: 457, column: 18, scope: !810)
!813 = !DILocation(line: 457, column: 4, scope: !810)
!814 = !DILocation(line: 458, column: 35, scope: !815)
!815 = distinct !DILexicalBlock(scope: !811, file: !20, line: 457, column: 75)
!816 = !DILocation(line: 458, column: 55, scope: !815)
!817 = !DILocation(line: 458, column: 42, scope: !815)
!818 = !DILocation(line: 458, column: 7, scope: !815)
!819 = !DILocation(line: 459, column: 4, scope: !815)
!820 = !DILocation(line: 457, column: 71, scope: !821)
!821 = !DILexicalBlockFile(scope: !811, file: !20, discriminator: 2)
!822 = !DILocation(line: 457, column: 4, scope: !821)
!823 = distinct !{!823, !824}
!824 = !DILocation(line: 457, column: 4, scope: !744)
!825 = !DILocation(line: 461, column: 8, scope: !826)
!826 = distinct !DILexicalBlock(scope: !744, file: !20, line: 461, column: 8)
!827 = !DILocation(line: 461, column: 14, scope: !826)
!828 = !DILocation(line: 461, column: 20, scope: !826)
!829 = !DILocation(line: 461, column: 27, scope: !826)
!830 = !DILocation(line: 461, column: 30, scope: !831)
!831 = !DILexicalBlockFile(scope: !826, file: !20, discriminator: 1)
!832 = !DILocation(line: 461, column: 36, scope: !831)
!833 = !DILocation(line: 461, column: 43, scope: !831)
!834 = !DILocation(line: 461, column: 49, scope: !831)
!835 = !DILocation(line: 461, column: 8, scope: !831)
!836 = !DILocation(line: 462, column: 7, scope: !837)
!837 = distinct !DILexicalBlock(scope: !826, file: !20, line: 461, column: 58)
!838 = !DILocation(line: 462, column: 13, scope: !837)
!839 = !DILocation(line: 462, column: 20, scope: !837)
!840 = !DILocation(line: 462, column: 26, scope: !837)
!841 = !DILocation(line: 462, column: 32, scope: !837)
!842 = !DILocation(line: 462, column: 41, scope: !837)
!843 = !DILocation(line: 462, column: 50, scope: !837)
!844 = !DILocation(line: 463, column: 4, scope: !837)
!845 = !DILocation(line: 464, column: 42, scope: !846)
!846 = distinct !DILexicalBlock(scope: !826, file: !20, line: 463, column: 11)
!847 = !DILocation(line: 464, column: 23, scope: !846)
!848 = !DILocation(line: 464, column: 7, scope: !846)
!849 = !DILocation(line: 464, column: 13, scope: !846)
!850 = !DILocation(line: 464, column: 21, scope: !846)
!851 = !DILocation(line: 465, column: 34, scope: !846)
!852 = !DILocation(line: 465, column: 64, scope: !846)
!853 = !DILocation(line: 465, column: 18, scope: !846)
!854 = !DILocation(line: 465, column: 7, scope: !846)
!855 = !DILocation(line: 465, column: 13, scope: !846)
!856 = !DILocation(line: 465, column: 16, scope: !846)
!857 = !DILocation(line: 468, column: 1, scope: !744)
!858 = distinct !DISubprogram(name: "RpcChannelReset", scope: !20, file: !20, line: 200, type: !229, isLocal: true, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!859 = !DILocalVariable(name: "data", arg: 1, scope: !858, file: !20, line: 200, type: !231)
!860 = !DILocation(line: 200, column: 28, scope: !858)
!861 = !DILocalVariable(name: "msg", scope: !858, file: !20, line: 202, type: !137)
!862 = !DILocation(line: 202, column: 11, scope: !858)
!863 = !DILocalVariable(name: "chan", scope: !858, file: !20, line: 203, type: !18)
!864 = !DILocation(line: 203, column: 19, scope: !858)
!865 = !DILocation(line: 203, column: 26, scope: !858)
!866 = !DILocation(line: 203, column: 32, scope: !858)
!867 = !DILocation(line: 205, column: 8, scope: !868)
!868 = distinct !DILexicalBlock(scope: !858, file: !20, line: 205, column: 8)
!869 = !DILocation(line: 205, column: 14, scope: !868)
!870 = !DILocation(line: 205, column: 25, scope: !868)
!871 = !DILocation(line: 205, column: 8, scope: !858)
!872 = !DILocation(line: 206, column: 26, scope: !873)
!873 = distinct !DILexicalBlock(scope: !868, file: !20, line: 205, column: 33)
!874 = !DILocation(line: 206, column: 7, scope: !873)
!875 = !DILocation(line: 206, column: 13, scope: !873)
!876 = !DILocation(line: 206, column: 24, scope: !873)
!877 = !DILocation(line: 207, column: 29, scope: !873)
!878 = !DILocation(line: 207, column: 35, scope: !873)
!879 = !DILocation(line: 207, column: 7, scope: !873)
!880 = !DILocation(line: 208, column: 29, scope: !873)
!881 = !DILocation(line: 208, column: 35, scope: !873)
!882 = !DILocation(line: 208, column: 69, scope: !873)
!883 = !DILocation(line: 208, column: 7, scope: !873)
!884 = !DILocation(line: 209, column: 23, scope: !873)
!885 = !DILocation(line: 209, column: 29, scope: !873)
!886 = !DILocation(line: 209, column: 41, scope: !873)
!887 = !DILocation(line: 209, column: 47, scope: !873)
!888 = !DILocation(line: 209, column: 7, scope: !873)
!889 = !DILocation(line: 210, column: 4, scope: !873)
!890 = !DILocation(line: 212, column: 38, scope: !858)
!891 = !DILocation(line: 212, column: 44, scope: !858)
!892 = !DILocation(line: 212, column: 10, scope: !858)
!893 = !DILocation(line: 212, column: 8, scope: !858)
!894 = !DILocation(line: 213, column: 30, scope: !895)
!895 = distinct !DILexicalBlock(scope: !896, file: !20, line: 213, column: 10)
!896 = distinct !DILexicalBlock(scope: !858, file: !20, line: 213, column: 5)
!897 = !DILocation(line: 213, column: 28, scope: !895)
!898 = !DILocation(line: 213, column: 27, scope: !895)
!899 = !DILocation(line: 213, column: 10, scope: !895)
!900 = !DILocation(line: 213, column: 10, scope: !896)
!901 = !DILocation(line: 213, column: 43, scope: !902)
!902 = !DILexicalBlockFile(scope: !903, file: !20, discriminator: 1)
!903 = distinct !DILexicalBlock(scope: !895, file: !20, line: 213, column: 41)
!904 = !DILocation(line: 214, column: 34, scope: !858)
!905 = !DILocation(line: 214, column: 40, scope: !858)
!906 = !DILocation(line: 214, column: 11, scope: !858)
!907 = !DILocation(line: 214, column: 4, scope: !858)
!908 = distinct !DISubprogram(name: "RpcChannel_RegisterCallback", scope: !20, file: !20, line: 480, type: !909, isLocal: false, isDefinition: true, scopeLine: 482, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !42, !418}
!911 = !DILocalVariable(name: "chan", arg: 1, scope: !908, file: !20, line: 480, type: !42)
!912 = !DILocation(line: 480, column: 41, scope: !908)
!913 = !DILocalVariable(name: "rpc", arg: 2, scope: !908, file: !20, line: 481, type: !418)
!914 = !DILocation(line: 481, column: 49, scope: !908)
!915 = !DILocalVariable(name: "cdata", scope: !908, file: !20, line: 483, type: !18)
!916 = !DILocation(line: 483, column: 19, scope: !908)
!917 = !DILocation(line: 483, column: 45, scope: !908)
!918 = !DILocation(line: 483, column: 27, scope: !908)
!919 = !DILocation(line: 487, column: 8, scope: !920)
!920 = distinct !DILexicalBlock(scope: !908, file: !20, line: 487, column: 8)
!921 = !DILocation(line: 487, column: 15, scope: !920)
!922 = !DILocation(line: 487, column: 20, scope: !920)
!923 = !DILocation(line: 487, column: 8, scope: !908)
!924 = !DILocation(line: 488, column: 21, scope: !925)
!925 = distinct !DILexicalBlock(scope: !920, file: !20, line: 487, column: 28)
!926 = !DILocation(line: 488, column: 7, scope: !925)
!927 = !DILocation(line: 488, column: 14, scope: !925)
!928 = !DILocation(line: 488, column: 19, scope: !925)
!929 = !DILocation(line: 489, column: 4, scope: !925)
!930 = !DILocation(line: 490, column: 28, scope: !931)
!931 = distinct !DILexicalBlock(scope: !908, file: !20, line: 490, column: 8)
!932 = !DILocation(line: 490, column: 35, scope: !931)
!933 = !DILocation(line: 490, column: 41, scope: !931)
!934 = !DILocation(line: 490, column: 46, scope: !931)
!935 = !DILocation(line: 490, column: 8, scope: !931)
!936 = !DILocation(line: 490, column: 52, scope: !931)
!937 = !DILocation(line: 490, column: 8, scope: !908)
!938 = !DILocation(line: 491, column: 72, scope: !939)
!939 = distinct !DILexicalBlock(scope: !931, file: !20, line: 490, column: 60)
!940 = !DILocation(line: 491, column: 77, scope: !939)
!941 = !DILocation(line: 491, column: 7, scope: !939)
!942 = !DILocation(line: 493, column: 24, scope: !908)
!943 = !DILocation(line: 493, column: 31, scope: !908)
!944 = !DILocation(line: 493, column: 48, scope: !908)
!945 = !DILocation(line: 493, column: 53, scope: !908)
!946 = !DILocation(line: 493, column: 59, scope: !908)
!947 = !DILocation(line: 493, column: 4, scope: !908)
!948 = !DILocation(line: 494, column: 1, scope: !908)
!949 = distinct !DISubprogram(name: "RpcChannel_UnregisterCallback", scope: !20, file: !20, line: 506, type: !909, isLocal: false, isDefinition: true, scopeLine: 508, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!950 = !DILocalVariable(name: "chan", arg: 1, scope: !949, file: !20, line: 506, type: !42)
!951 = !DILocation(line: 506, column: 43, scope: !949)
!952 = !DILocalVariable(name: "rpc", arg: 2, scope: !949, file: !20, line: 507, type: !418)
!953 = !DILocation(line: 507, column: 51, scope: !949)
!954 = !DILocalVariable(name: "cdata", scope: !949, file: !20, line: 509, type: !18)
!955 = !DILocation(line: 509, column: 19, scope: !949)
!956 = !DILocation(line: 509, column: 45, scope: !949)
!957 = !DILocation(line: 509, column: 27, scope: !949)
!958 = !DILocation(line: 510, column: 8, scope: !959)
!959 = distinct !DILexicalBlock(scope: !949, file: !20, line: 510, column: 8)
!960 = !DILocation(line: 510, column: 15, scope: !959)
!961 = !DILocation(line: 510, column: 20, scope: !959)
!962 = !DILocation(line: 510, column: 8, scope: !949)
!963 = !DILocation(line: 511, column: 27, scope: !964)
!964 = distinct !DILexicalBlock(scope: !959, file: !20, line: 510, column: 28)
!965 = !DILocation(line: 511, column: 34, scope: !964)
!966 = !DILocation(line: 511, column: 40, scope: !964)
!967 = !DILocation(line: 511, column: 45, scope: !964)
!968 = !DILocation(line: 511, column: 7, scope: !964)
!969 = !DILocation(line: 512, column: 4, scope: !964)
!970 = !DILocation(line: 513, column: 1, scope: !949)
!971 = distinct !DISubprogram(name: "RpcChannel_Create", scope: !20, file: !20, line: 558, type: !972, isLocal: false, isDefinition: true, scopeLine: 559, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!972 = !DISubroutineType(types: !973)
!973 = !{!42}
!974 = !DILocalVariable(name: "chan", scope: !971, file: !20, line: 560, type: !18)
!975 = !DILocation(line: 560, column: 19, scope: !971)
!976 = !DILocation(line: 560, column: 45, scope: !971)
!977 = !DILocation(line: 560, column: 27, scope: !971)
!978 = !DILocation(line: 561, column: 12, scope: !971)
!979 = !DILocation(line: 561, column: 18, scope: !971)
!980 = !DILocation(line: 561, column: 4, scope: !971)
!981 = distinct !DISubprogram(name: "RpcChannel_Destroy", scope: !20, file: !20, line: 574, type: !36, isLocal: false, isDefinition: true, scopeLine: 575, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!982 = !DILocalVariable(name: "chan", arg: 1, scope: !981, file: !20, line: 574, type: !42)
!983 = !DILocation(line: 574, column: 32, scope: !981)
!984 = !DILocalVariable(name: "i", scope: !981, file: !20, line: 577, type: !54)
!985 = !DILocation(line: 577, column: 11, scope: !981)
!986 = !DILocalVariable(name: "cdata", scope: !981, file: !20, line: 579, type: !18)
!987 = !DILocation(line: 579, column: 19, scope: !981)
!988 = !DILocation(line: 579, column: 45, scope: !981)
!989 = !DILocation(line: 579, column: 27, scope: !981)
!990 = !DILocation(line: 581, column: 8, scope: !991)
!991 = distinct !DILexicalBlock(scope: !981, file: !20, line: 581, column: 8)
!992 = !DILocation(line: 581, column: 15, scope: !991)
!993 = !DILocation(line: 581, column: 20, scope: !991)
!994 = !DILocation(line: 581, column: 26, scope: !991)
!995 = !DILocation(line: 581, column: 33, scope: !991)
!996 = !DILocation(line: 581, column: 36, scope: !997)
!997 = !DILexicalBlockFile(scope: !991, file: !20, discriminator: 1)
!998 = !DILocation(line: 581, column: 43, scope: !997)
!999 = !DILocation(line: 581, column: 48, scope: !997)
!1000 = !DILocation(line: 581, column: 55, scope: !997)
!1001 = !DILocation(line: 581, column: 64, scope: !997)
!1002 = !DILocation(line: 581, column: 8, scope: !997)
!1003 = !DILocation(line: 582, column: 7, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !991, file: !20, line: 581, column: 73)
!1005 = !DILocation(line: 582, column: 14, scope: !1004)
!1006 = !DILocation(line: 582, column: 19, scope: !1004)
!1007 = !DILocation(line: 582, column: 26, scope: !1004)
!1008 = !DILocation(line: 582, column: 35, scope: !1004)
!1009 = !DILocation(line: 583, column: 4, scope: !1004)
!1010 = !DILocation(line: 586, column: 34, scope: !981)
!1011 = !DILocation(line: 586, column: 41, scope: !981)
!1012 = !DILocation(line: 586, column: 48, scope: !981)
!1013 = !DILocation(line: 586, column: 4, scope: !981)
!1014 = !DILocation(line: 587, column: 11, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !981, file: !20, line: 587, column: 4)
!1016 = !DILocation(line: 587, column: 9, scope: !1015)
!1017 = !DILocation(line: 587, column: 16, scope: !1018)
!1018 = !DILexicalBlockFile(scope: !1019, file: !20, discriminator: 1)
!1019 = distinct !DILexicalBlock(scope: !1015, file: !20, line: 587, column: 4)
!1020 = !DILocation(line: 587, column: 18, scope: !1018)
!1021 = !DILocation(line: 587, column: 4, scope: !1018)
!1022 = !DILocation(line: 588, column: 37, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1019, file: !20, line: 587, column: 75)
!1024 = !DILocation(line: 588, column: 57, scope: !1023)
!1025 = !DILocation(line: 588, column: 44, scope: !1023)
!1026 = !DILocation(line: 588, column: 7, scope: !1023)
!1027 = !DILocation(line: 589, column: 4, scope: !1023)
!1028 = !DILocation(line: 587, column: 71, scope: !1029)
!1029 = !DILexicalBlockFile(scope: !1019, file: !20, discriminator: 2)
!1030 = !DILocation(line: 587, column: 4, scope: !1029)
!1031 = distinct !{!1031, !1032}
!1032 = !DILocation(line: 587, column: 4, scope: !981)
!1033 = !DILocation(line: 591, column: 8, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !981, file: !20, line: 591, column: 8)
!1035 = !DILocation(line: 591, column: 15, scope: !1034)
!1036 = !DILocation(line: 591, column: 20, scope: !1034)
!1037 = !DILocation(line: 591, column: 8, scope: !981)
!1038 = !DILocation(line: 592, column: 28, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1034, file: !20, line: 591, column: 28)
!1040 = !DILocation(line: 592, column: 35, scope: !1039)
!1041 = !DILocation(line: 592, column: 7, scope: !1039)
!1042 = !DILocation(line: 593, column: 7, scope: !1039)
!1043 = !DILocation(line: 593, column: 14, scope: !1039)
!1044 = !DILocation(line: 593, column: 19, scope: !1039)
!1045 = !DILocation(line: 594, column: 4, scope: !1039)
!1046 = !DILocation(line: 596, column: 4, scope: !981)
!1047 = !DILocation(line: 596, column: 11, scope: !981)
!1048 = !DILocation(line: 596, column: 19, scope: !981)
!1049 = !DILocation(line: 597, column: 4, scope: !981)
!1050 = !DILocation(line: 597, column: 11, scope: !981)
!1051 = !DILocation(line: 597, column: 21, scope: !981)
!1052 = !DILocation(line: 598, column: 4, scope: !981)
!1053 = !DILocation(line: 598, column: 11, scope: !981)
!1054 = !DILocation(line: 598, column: 18, scope: !981)
!1055 = !DILocation(line: 600, column: 11, scope: !981)
!1056 = !DILocation(line: 600, column: 18, scope: !981)
!1057 = !DILocation(line: 600, column: 4, scope: !981)
!1058 = !DILocation(line: 601, column: 4, scope: !981)
!1059 = !DILocation(line: 601, column: 11, scope: !981)
!1060 = !DILocation(line: 601, column: 19, scope: !981)
!1061 = !DILocation(line: 603, column: 8, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !981, file: !20, line: 603, column: 8)
!1063 = !DILocation(line: 603, column: 15, scope: !1062)
!1064 = !DILocation(line: 603, column: 23, scope: !1062)
!1065 = !DILocation(line: 603, column: 8, scope: !981)
!1066 = !DILocation(line: 604, column: 28, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1062, file: !20, line: 603, column: 31)
!1068 = !DILocation(line: 604, column: 35, scope: !1067)
!1069 = !DILocation(line: 604, column: 7, scope: !1067)
!1070 = !DILocation(line: 605, column: 7, scope: !1067)
!1071 = !DILocation(line: 605, column: 14, scope: !1067)
!1072 = !DILocation(line: 605, column: 22, scope: !1067)
!1073 = !DILocation(line: 606, column: 4, scope: !1067)
!1074 = !DILocation(line: 608, column: 8, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !981, file: !20, line: 608, column: 8)
!1076 = !DILocation(line: 608, column: 15, scope: !1075)
!1077 = !DILocation(line: 608, column: 26, scope: !1075)
!1078 = !DILocation(line: 608, column: 8, scope: !981)
!1079 = !DILocation(line: 609, column: 24, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1075, file: !20, line: 608, column: 34)
!1081 = !DILocation(line: 609, column: 31, scope: !1080)
!1082 = !DILocation(line: 609, column: 7, scope: !1080)
!1083 = !DILocation(line: 610, column: 7, scope: !1080)
!1084 = !DILocation(line: 610, column: 14, scope: !1080)
!1085 = !DILocation(line: 610, column: 25, scope: !1080)
!1086 = !DILocation(line: 611, column: 4, scope: !1080)
!1087 = !DILocation(line: 614, column: 11, scope: !981)
!1088 = !DILocation(line: 614, column: 4, scope: !981)
!1089 = !DILocation(line: 615, column: 4, scope: !981)
!1090 = distinct !DISubprogram(name: "RpcChannel_SetRetValsF", scope: !20, file: !20, line: 658, type: !1091, isLocal: false, isDefinition: true, scopeLine: 661, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!38, !231, !61, !38}
!1093 = !DILocalVariable(name: "data", arg: 1, scope: !1090, file: !20, line: 658, type: !231)
!1094 = !DILocation(line: 658, column: 35, scope: !1090)
!1095 = !DILocalVariable(name: "result", arg: 2, scope: !1090, file: !20, line: 659, type: !61)
!1096 = !DILocation(line: 659, column: 30, scope: !1090)
!1097 = !DILocalVariable(name: "retVal", arg: 3, scope: !1090, file: !20, line: 660, type: !38)
!1098 = !DILocation(line: 660, column: 33, scope: !1090)
!1099 = !DILocation(line: 664, column: 19, scope: !1090)
!1100 = !DILocation(line: 664, column: 4, scope: !1090)
!1101 = !DILocation(line: 664, column: 10, scope: !1090)
!1102 = !DILocation(line: 664, column: 17, scope: !1090)
!1103 = !DILocation(line: 665, column: 29, scope: !1090)
!1104 = !DILocation(line: 665, column: 35, scope: !1090)
!1105 = !DILocation(line: 665, column: 22, scope: !1090)
!1106 = !DILocation(line: 665, column: 4, scope: !1090)
!1107 = !DILocation(line: 665, column: 10, scope: !1090)
!1108 = !DILocation(line: 665, column: 20, scope: !1090)
!1109 = !DILocation(line: 666, column: 4, scope: !1090)
!1110 = !DILocation(line: 666, column: 10, scope: !1090)
!1111 = !DILocation(line: 666, column: 21, scope: !1090)
!1112 = !DILocation(line: 668, column: 11, scope: !1090)
!1113 = !DILocation(line: 668, column: 4, scope: !1090)
!1114 = distinct !DISubprogram(name: "RpcChannel_SetBackdoorOnly", scope: !20, file: !20, line: 679, type: !198, isLocal: false, isDefinition: true, scopeLine: 680, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!1115 = !DILocation(line: 681, column: 21, scope: !1114)
!1116 = !DILocation(line: 682, column: 4, scope: !1114)
!1117 = !DILocation(line: 683, column: 1, scope: !1114)
!1118 = distinct !DISubprogram(name: "RpcChannel_New", scope: !20, file: !20, line: 694, type: !972, isLocal: false, isDefinition: true, scopeLine: 695, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!1119 = !DILocalVariable(name: "chan", scope: !1118, file: !20, line: 696, type: !42)
!1120 = !DILocation(line: 696, column: 16, scope: !1118)
!1121 = !DILocation(line: 698, column: 12, scope: !1118)
!1122 = !DILocation(line: 698, column: 29, scope: !1118)
!1123 = !DILocation(line: 698, column: 32, scope: !1124)
!1124 = !DILexicalBlockFile(scope: !1118, file: !20, discriminator: 1)
!1125 = !DILocation(line: 698, column: 11, scope: !1124)
!1126 = !DILocation(line: 699, column: 11, scope: !1118)
!1127 = !DILocation(line: 698, column: 11, scope: !1128)
!1128 = !DILexicalBlockFile(scope: !1118, file: !20, discriminator: 2)
!1129 = !DILocation(line: 699, column: 35, scope: !1124)
!1130 = !DILocation(line: 698, column: 11, scope: !1131)
!1131 = !DILexicalBlockFile(scope: !1118, file: !20, discriminator: 3)
!1132 = !DILocation(line: 698, column: 11, scope: !1133)
!1133 = !DILexicalBlockFile(scope: !1118, file: !20, discriminator: 4)
!1134 = !DILocation(line: 698, column: 9, scope: !1133)
!1135 = !DILocation(line: 703, column: 8, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1118, file: !20, line: 703, column: 8)
!1137 = !DILocation(line: 703, column: 8, scope: !1118)
!1138 = !DILocation(line: 704, column: 28, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1136, file: !20, line: 703, column: 14)
!1140 = !DILocation(line: 704, column: 34, scope: !1139)
!1141 = !DILocation(line: 704, column: 7, scope: !1139)
!1142 = !DILocation(line: 705, column: 4, scope: !1139)
!1143 = !DILocation(line: 706, column: 11, scope: !1118)
!1144 = !DILocation(line: 706, column: 4, scope: !1118)
!1145 = distinct !DISubprogram(name: "RpcChannel_Shutdown", scope: !20, file: !20, line: 717, type: !45, isLocal: false, isDefinition: true, scopeLine: 718, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!1146 = !DILocalVariable(name: "chan", arg: 1, scope: !1145, file: !20, line: 717, type: !42)
!1147 = !DILocation(line: 717, column: 33, scope: !1145)
!1148 = !DILocation(line: 719, column: 8, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1145, file: !20, line: 719, column: 8)
!1150 = !DILocation(line: 719, column: 13, scope: !1149)
!1151 = !DILocation(line: 719, column: 8, scope: !1145)
!1152 = !DILocation(line: 720, column: 28, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1149, file: !20, line: 719, column: 21)
!1154 = !DILocation(line: 720, column: 34, scope: !1153)
!1155 = !DILocation(line: 720, column: 7, scope: !1153)
!1156 = !DILocation(line: 721, column: 4, scope: !1153)
!1157 = !DILocation(line: 723, column: 8, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1145, file: !20, line: 723, column: 8)
!1159 = !DILocation(line: 723, column: 13, scope: !1158)
!1160 = !DILocation(line: 723, column: 20, scope: !1158)
!1161 = !DILocation(line: 723, column: 23, scope: !1162)
!1162 = !DILexicalBlockFile(scope: !1158, file: !20, discriminator: 1)
!1163 = !DILocation(line: 723, column: 29, scope: !1162)
!1164 = !DILocation(line: 723, column: 35, scope: !1162)
!1165 = !DILocation(line: 723, column: 43, scope: !1162)
!1166 = !DILocation(line: 723, column: 46, scope: !1167)
!1167 = !DILexicalBlockFile(scope: !1158, file: !20, discriminator: 2)
!1168 = !DILocation(line: 723, column: 52, scope: !1167)
!1169 = !DILocation(line: 723, column: 59, scope: !1167)
!1170 = !DILocation(line: 723, column: 68, scope: !1167)
!1171 = !DILocation(line: 723, column: 8, scope: !1167)
!1172 = !DILocation(line: 725, column: 11, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1174, file: !20, line: 725, column: 11)
!1174 = distinct !DILexicalBlock(scope: !1158, file: !20, line: 723, column: 77)
!1175 = !DILocation(line: 725, column: 17, scope: !1173)
!1176 = !DILocation(line: 725, column: 20, scope: !1173)
!1177 = !DILocation(line: 725, column: 11, scope: !1174)
!1178 = !DILocation(line: 726, column: 14, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1180, file: !20, line: 726, column: 14)
!1180 = distinct !DILexicalBlock(scope: !1173, file: !20, line: 725, column: 28)
!1181 = !DILocation(line: 726, column: 20, scope: !1179)
!1182 = !DILocation(line: 726, column: 14, scope: !1180)
!1183 = !DILocation(line: 727, column: 24, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1179, file: !20, line: 726, column: 31)
!1185 = !DILocation(line: 727, column: 30, scope: !1184)
!1186 = !DILocation(line: 727, column: 13, scope: !1184)
!1187 = !DILocation(line: 728, column: 10, scope: !1184)
!1188 = !DILocation(line: 729, column: 10, scope: !1180)
!1189 = !DILocation(line: 729, column: 16, scope: !1180)
!1190 = !DILocation(line: 729, column: 26, scope: !1180)
!1191 = !DILocation(line: 730, column: 25, scope: !1180)
!1192 = !DILocation(line: 730, column: 31, scope: !1180)
!1193 = !DILocation(line: 730, column: 10, scope: !1180)
!1194 = !DILocation(line: 731, column: 10, scope: !1180)
!1195 = !DILocation(line: 731, column: 16, scope: !1180)
!1196 = !DILocation(line: 731, column: 19, scope: !1180)
!1197 = !DILocation(line: 732, column: 7, scope: !1180)
!1198 = !DILocation(line: 736, column: 11, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1174, file: !20, line: 736, column: 11)
!1200 = !DILocation(line: 736, column: 17, scope: !1199)
!1201 = !DILocation(line: 736, column: 25, scope: !1199)
!1202 = !DILocation(line: 736, column: 11, scope: !1174)
!1203 = !DILocation(line: 737, column: 31, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1199, file: !20, line: 736, column: 33)
!1205 = !DILocation(line: 737, column: 37, scope: !1204)
!1206 = !DILocation(line: 737, column: 10, scope: !1204)
!1207 = !DILocation(line: 738, column: 7, scope: !1204)
!1208 = !DILocation(line: 740, column: 7, scope: !1174)
!1209 = !DILocation(line: 740, column: 13, scope: !1174)
!1210 = !DILocation(line: 740, column: 20, scope: !1174)
!1211 = !DILocation(line: 740, column: 29, scope: !1174)
!1212 = !DILocation(line: 741, column: 4, scope: !1174)
!1213 = !DILocation(line: 742, column: 1, scope: !1145)
!1214 = distinct !DISubprogram(name: "RpcChannel_Start", scope: !20, file: !20, line: 755, type: !36, isLocal: false, isDefinition: true, scopeLine: 756, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!1215 = !DILocalVariable(name: "chan", arg: 1, scope: !1214, file: !20, line: 755, type: !42)
!1216 = !DILocation(line: 755, column: 30, scope: !1214)
!1217 = !DILocalVariable(name: "ok", scope: !1214, file: !20, line: 757, type: !38)
!1218 = !DILocation(line: 757, column: 13, scope: !1214)
!1219 = !DILocalVariable(name: "funcs", scope: !1214, file: !20, line: 758, type: !29)
!1220 = !DILocation(line: 758, column: 27, scope: !1214)
!1221 = !DILocation(line: 760, column: 8, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1214, file: !20, line: 760, column: 8)
!1223 = !DILocation(line: 760, column: 13, scope: !1222)
!1224 = !DILocation(line: 760, column: 20, scope: !1222)
!1225 = !DILocation(line: 760, column: 23, scope: !1226)
!1226 = !DILexicalBlockFile(scope: !1222, file: !20, discriminator: 1)
!1227 = !DILocation(line: 760, column: 29, scope: !1226)
!1228 = !DILocation(line: 760, column: 35, scope: !1226)
!1229 = !DILocation(line: 760, column: 43, scope: !1226)
!1230 = !DILocation(line: 760, column: 46, scope: !1231)
!1231 = !DILexicalBlockFile(scope: !1222, file: !20, discriminator: 2)
!1232 = !DILocation(line: 760, column: 52, scope: !1231)
!1233 = !DILocation(line: 760, column: 59, scope: !1231)
!1234 = !DILocation(line: 760, column: 65, scope: !1231)
!1235 = !DILocation(line: 760, column: 8, scope: !1231)
!1236 = !DILocation(line: 761, column: 7, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1222, file: !20, line: 760, column: 74)
!1238 = !DILocation(line: 764, column: 8, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1214, file: !20, line: 764, column: 8)
!1240 = !DILocation(line: 764, column: 14, scope: !1239)
!1241 = !DILocation(line: 764, column: 8, scope: !1214)
!1242 = !DILocation(line: 769, column: 7, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1239, file: !20, line: 764, column: 26)
!1244 = !DILocation(line: 773, column: 8, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1214, file: !20, line: 773, column: 8)
!1246 = !DILocation(line: 773, column: 14, scope: !1245)
!1247 = !DILocation(line: 773, column: 17, scope: !1245)
!1248 = !DILocation(line: 773, column: 24, scope: !1245)
!1249 = !DILocation(line: 773, column: 28, scope: !1250)
!1250 = !DILexicalBlockFile(scope: !1245, file: !20, discriminator: 1)
!1251 = !DILocation(line: 773, column: 34, scope: !1250)
!1252 = !DILocation(line: 773, column: 8, scope: !1250)
!1253 = !DILocation(line: 774, column: 24, scope: !1254)
!1254 = distinct !DILexicalBlock(scope: !1245, file: !20, line: 773, column: 45)
!1255 = !DILocation(line: 774, column: 30, scope: !1254)
!1256 = !DILocation(line: 774, column: 55, scope: !1254)
!1257 = !DILocation(line: 774, column: 12, scope: !1254)
!1258 = !DILocation(line: 774, column: 10, scope: !1254)
!1259 = !DILocation(line: 775, column: 25, scope: !1254)
!1260 = !DILocation(line: 775, column: 7, scope: !1254)
!1261 = !DILocation(line: 775, column: 13, scope: !1254)
!1262 = !DILocation(line: 775, column: 23, scope: !1254)
!1263 = !DILocation(line: 776, column: 4, scope: !1254)
!1264 = !DILocation(line: 779, column: 12, scope: !1214)
!1265 = !DILocation(line: 779, column: 18, scope: !1214)
!1266 = !DILocation(line: 779, column: 10, scope: !1214)
!1267 = !DILocation(line: 780, column: 9, scope: !1214)
!1268 = !DILocation(line: 780, column: 16, scope: !1214)
!1269 = !DILocation(line: 780, column: 22, scope: !1214)
!1270 = !DILocation(line: 780, column: 7, scope: !1214)
!1271 = !DILocation(line: 782, column: 9, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1214, file: !20, line: 782, column: 8)
!1273 = !DILocation(line: 782, column: 12, scope: !1272)
!1274 = !DILocation(line: 782, column: 15, scope: !1275)
!1275 = !DILexicalBlockFile(scope: !1272, file: !20, discriminator: 1)
!1276 = !DILocation(line: 782, column: 22, scope: !1275)
!1277 = !DILocation(line: 782, column: 33, scope: !1275)
!1278 = !DILocation(line: 782, column: 8, scope: !1275)
!1279 = !DILocation(line: 783, column: 7, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1272, file: !20, line: 782, column: 41)
!1281 = !DILocation(line: 784, column: 7, scope: !1280)
!1282 = !DILocation(line: 784, column: 14, scope: !1280)
!1283 = !DILocation(line: 784, column: 25, scope: !1280)
!1284 = !DILocation(line: 785, column: 37, scope: !1280)
!1285 = !DILocation(line: 785, column: 12, scope: !1280)
!1286 = !DILocation(line: 785, column: 10, scope: !1280)
!1287 = !DILocation(line: 790, column: 7, scope: !1280)
!1288 = !DILocation(line: 791, column: 22, scope: !1280)
!1289 = !DILocation(line: 792, column: 4, scope: !1280)
!1290 = !DILocation(line: 794, column: 11, scope: !1214)
!1291 = !DILocation(line: 794, column: 4, scope: !1214)
!1292 = !DILocation(line: 795, column: 1, scope: !1214)
!1293 = distinct !DISubprogram(name: "RpcChannelError", scope: !20, file: !20, line: 525, type: !1294, isLocal: true, isDefinition: true, scopeLine: 527, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{null, !17, !51}
!1296 = !DILocalVariable(name: "_chan", arg: 1, scope: !1293, file: !20, line: 525, type: !17)
!1297 = !DILocation(line: 525, column: 23, scope: !1293)
!1298 = !DILocalVariable(name: "status", arg: 2, scope: !1293, file: !20, line: 526, type: !51)
!1299 = !DILocation(line: 526, column: 30, scope: !1293)
!1300 = !DILocalVariable(name: "chan", scope: !1293, file: !20, line: 528, type: !18)
!1301 = !DILocation(line: 528, column: 19, scope: !1293)
!1302 = !DILocation(line: 528, column: 26, scope: !1293)
!1303 = !DILocation(line: 529, column: 4, scope: !1293)
!1304 = !DILocation(line: 529, column: 10, scope: !1293)
!1305 = !DILocation(line: 529, column: 19, scope: !1293)
!1306 = !DILocation(line: 534, column: 65, scope: !1293)
!1307 = !DILocation(line: 534, column: 4, scope: !1293)
!1308 = !DILocation(line: 536, column: 8, scope: !1309)
!1309 = distinct !DILexicalBlock(scope: !1293, file: !20, line: 536, column: 8)
!1310 = !DILocation(line: 536, column: 14, scope: !1309)
!1311 = !DILocation(line: 536, column: 25, scope: !1309)
!1312 = !DILocation(line: 536, column: 8, scope: !1293)
!1313 = !DILocation(line: 537, column: 26, scope: !1314)
!1314 = distinct !DILexicalBlock(scope: !1309, file: !20, line: 536, column: 33)
!1315 = !DILocation(line: 537, column: 7, scope: !1314)
!1316 = !DILocation(line: 537, column: 13, scope: !1314)
!1317 = !DILocation(line: 537, column: 24, scope: !1314)
!1318 = !DILocation(line: 538, column: 29, scope: !1314)
!1319 = !DILocation(line: 538, column: 35, scope: !1314)
!1320 = !DILocation(line: 538, column: 69, scope: !1314)
!1321 = !DILocation(line: 538, column: 7, scope: !1314)
!1322 = !DILocation(line: 539, column: 23, scope: !1314)
!1323 = !DILocation(line: 539, column: 29, scope: !1314)
!1324 = !DILocation(line: 539, column: 41, scope: !1314)
!1325 = !DILocation(line: 539, column: 47, scope: !1314)
!1326 = !DILocation(line: 539, column: 7, scope: !1314)
!1327 = !DILocation(line: 540, column: 4, scope: !1314)
!1328 = !DILocation(line: 541, column: 1, scope: !1293)
!1329 = distinct !DISubprogram(name: "RpcChannel_Stop", scope: !20, file: !20, line: 834, type: !45, isLocal: false, isDefinition: true, scopeLine: 835, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!1330 = !DILocalVariable(name: "chan", arg: 1, scope: !1329, file: !20, line: 834, type: !42)
!1331 = !DILocation(line: 834, column: 29, scope: !1329)
!1332 = !DILocation(line: 836, column: 50, scope: !1329)
!1333 = !DILocation(line: 836, column: 56, scope: !1329)
!1334 = !DILocation(line: 836, column: 18, scope: !1329)
!1335 = !DILocation(line: 836, column: 4, scope: !1336)
!1336 = !DILexicalBlockFile(scope: !1329, file: !20, discriminator: 1)
!1337 = !DILocation(line: 837, column: 25, scope: !1329)
!1338 = !DILocation(line: 837, column: 4, scope: !1329)
!1339 = !DILocation(line: 838, column: 52, scope: !1329)
!1340 = !DILocation(line: 838, column: 58, scope: !1329)
!1341 = !DILocation(line: 838, column: 20, scope: !1329)
!1342 = !DILocation(line: 838, column: 4, scope: !1336)
!1343 = !DILocation(line: 839, column: 1, scope: !1329)
!1344 = distinct !DISubprogram(name: "RpcChannelStopNoLock", scope: !20, file: !20, line: 806, type: !45, isLocal: true, isDefinition: true, scopeLine: 807, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !332)
!1345 = !DILocalVariable(name: "chan", arg: 1, scope: !1344, file: !20, line: 806, type: !42)
!1346 = !DILocation(line: 806, column: 34, scope: !1344)
!1347 = !DILocation(line: 808, column: 8, scope: !1348)
!1348 = distinct !DILexicalBlock(scope: !1344, file: !20, line: 808, column: 8)
!1349 = !DILocation(line: 808, column: 13, scope: !1348)
!1350 = !DILocation(line: 808, column: 20, scope: !1348)
!1351 = !DILocation(line: 808, column: 23, scope: !1352)
!1352 = !DILexicalBlockFile(scope: !1348, file: !20, discriminator: 1)
!1353 = !DILocation(line: 808, column: 29, scope: !1352)
!1354 = !DILocation(line: 808, column: 35, scope: !1352)
!1355 = !DILocation(line: 808, column: 43, scope: !1352)
!1356 = !DILocation(line: 808, column: 46, scope: !1357)
!1357 = !DILexicalBlockFile(scope: !1348, file: !20, discriminator: 2)
!1358 = !DILocation(line: 808, column: 52, scope: !1357)
!1359 = !DILocation(line: 808, column: 59, scope: !1357)
!1360 = !DILocation(line: 808, column: 64, scope: !1357)
!1361 = !DILocation(line: 808, column: 8, scope: !1357)
!1362 = !DILocation(line: 809, column: 7, scope: !1363)
!1363 = distinct !DILexicalBlock(scope: !1348, file: !20, line: 808, column: 73)
!1364 = !DILocation(line: 812, column: 4, scope: !1344)
!1365 = !DILocation(line: 812, column: 10, scope: !1344)
!1366 = !DILocation(line: 812, column: 17, scope: !1344)
!1367 = !DILocation(line: 812, column: 22, scope: !1344)
!1368 = !DILocation(line: 815, column: 8, scope: !1369)
!1369 = distinct !DILexicalBlock(scope: !1344, file: !20, line: 815, column: 8)
!1370 = !DILocation(line: 815, column: 14, scope: !1369)
!1371 = !DILocation(line: 815, column: 17, scope: !1369)
!1372 = !DILocation(line: 815, column: 8, scope: !1344)
!1373 = !DILocation(line: 816, column: 11, scope: !1374)
!1374 = distinct !DILexicalBlock(scope: !1375, file: !20, line: 816, column: 11)
!1375 = distinct !DILexicalBlock(scope: !1369, file: !20, line: 815, column: 25)
!1376 = !DILocation(line: 816, column: 17, scope: !1374)
!1377 = !DILocation(line: 816, column: 11, scope: !1375)
!1378 = !DILocation(line: 817, column: 21, scope: !1379)
!1379 = distinct !DILexicalBlock(scope: !1374, file: !20, line: 816, column: 28)
!1380 = !DILocation(line: 817, column: 27, scope: !1379)
!1381 = !DILocation(line: 817, column: 10, scope: !1379)
!1382 = !DILocation(line: 818, column: 7, scope: !1379)
!1383 = !DILocation(line: 819, column: 7, scope: !1375)
!1384 = !DILocation(line: 819, column: 13, scope: !1375)
!1385 = !DILocation(line: 819, column: 23, scope: !1375)
!1386 = !DILocation(line: 820, column: 4, scope: !1375)
!1387 = !DILocation(line: 824, column: 1, scope: !1344)
