; ModuleID = './vmtoolsd-svcSignals.o.i'
source_filename = "./vmtoolsd-svcSignals.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GClosure = type { i32, {}*, i8*, %struct._GClosureNotifyData* }
%struct._GClosureNotifyData = type { i8*, void (i8*, %struct._GClosure*)* }
%struct._GValue = type { i64, [2 x %union.anon] }
%union.anon = type { i64 }
%struct._GCClosure = type { %struct._GClosure, i8* }

@__func__.g_cclosure_user_marshal_POINTER__POINTER_BOOLEAN = private unnamed_addr constant [49 x i8] c"g_cclosure_user_marshal_POINTER__POINTER_BOOLEAN\00", align 1
@.str = private unnamed_addr constant [21 x i8] c"return_value != NULL\00", align 1
@.str.1 = private unnamed_addr constant [20 x i8] c"n_param_values == 3\00", align 1
@__func__.g_cclosure_user_marshal_BOOLEAN__POINTER_STRING_STRING = private unnamed_addr constant [55 x i8] c"g_cclosure_user_marshal_BOOLEAN__POINTER_STRING_STRING\00", align 1
@.str.2 = private unnamed_addr constant [20 x i8] c"n_param_values == 4\00", align 1
@__func__.g_cclosure_user_marshal_UINT__POINTER_POINTER_UINT_UINT_POINTER = private unnamed_addr constant [64 x i8] c"g_cclosure_user_marshal_UINT__POINTER_POINTER_UINT_UINT_POINTER\00", align 1
@.str.3 = private unnamed_addr constant [20 x i8] c"n_param_values == 6\00", align 1

; Function Attrs: nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "vmtoolsd-svcSignals.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1395")
!2 = !{}
!3 = !{!4, !68, !86, !89, !31, !91, !98, !103}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCClosure", file: !6, line: 157, baseType: !7)
!6 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gclosure.h", directory: "/home/lichi/Desktop/open-vm-tools/line1395")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GCClosure", file: !6, line: 216, size: 320, align: 64, elements: !8)
!8 = !{!9, !85}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !7, file: !6, line: 218, baseType: !10, size: 256, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "GClosure", file: !6, line: 74, baseType: !11)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GClosure", file: !6, line: 175, size: 256, align: 64, elements: !12)
!12 = !{!13, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !73, !74}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !11, file: !6, line: 178, baseType: !14, size: 15, align: 32, flags: DIFlagBitField, extraData: i64 0)
!14 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !16, line: 55, baseType: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1395")
!17 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "meta_marshal_nouse", scope: !11, file: !6, line: 181, baseType: !14, size: 1, align: 32, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "n_guards", scope: !11, file: !6, line: 182, baseType: !14, size: 1, align: 32, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "n_fnotifiers", scope: !11, file: !6, line: 183, baseType: !14, size: 2, align: 32, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "n_inotifiers", scope: !11, file: !6, line: 184, baseType: !14, size: 8, align: 32, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "in_inotify", scope: !11, file: !6, line: 185, baseType: !14, size: 1, align: 32, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "floating", scope: !11, file: !6, line: 186, baseType: !14, size: 1, align: 32, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "derivative_flag", scope: !11, file: !6, line: 188, baseType: !14, size: 1, align: 32, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "in_marshal", scope: !11, file: !6, line: 190, baseType: !14, size: 1, align: 32, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "is_invalid", scope: !11, file: !6, line: 191, baseType: !14, size: 1, align: 32, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "marshal", scope: !11, file: !6, line: 193, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{null, !31, !32, !15, !71, !67, !67}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "GValue", file: !34, line: 386, baseType: !35)
!34 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gtype.h", directory: "/home/lichi/Desktop/open-vm-tools/line1395")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GValue", file: !36, line: 106, size: 192, align: 64, elements: !37)
!36 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gvalue.h", directory: "/home/lichi/Desktop/open-vm-tools/line1395")
!37 = !{!38, !43}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "g_type", scope: !35, file: !36, line: 109, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "GType", file: !34, line: 382, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !41, line: 66, baseType: !42)
!41 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line1395")
!42 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !35, file: !36, line: 122, baseType: !44, size: 128, align: 64, offset: 64)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 128, align: 64, elements: !69)
!45 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !35, file: !36, line: 112, size: 64, align: 64, elements: !46)
!46 = !{!47, !50, !51, !54, !56, !58, !60, !63, !66}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "v_int", scope: !45, file: !36, line: 113, baseType: !48, size: 32, align: 32)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !16, line: 49, baseType: !49)
!49 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "v_uint", scope: !45, file: !36, line: 114, baseType: !15, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "v_long", scope: !45, file: !36, line: 115, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !16, line: 48, baseType: !53)
!53 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "v_ulong", scope: !45, file: !36, line: 116, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "gulong", file: !16, line: 54, baseType: !42)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "v_int64", scope: !45, file: !36, line: 117, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !41, line: 51, baseType: !53)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "v_uint64", scope: !45, file: !36, line: 118, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint64", file: !41, line: 52, baseType: !42)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !45, file: !36, line: 119, baseType: !61, size: 32, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfloat", file: !16, line: 57, baseType: !62)
!62 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "v_double", scope: !45, file: !36, line: 120, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "gdouble", file: !16, line: 58, baseType: !65)
!65 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "v_pointer", scope: !45, file: !36, line: 121, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !16, line: 77, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!69 = !{!70}
!70 = !DISubrange(count: 2)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !11, file: !6, line: 199, baseType: !67, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "notifiers", scope: !11, file: !6, line: 201, baseType: !75, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "GClosureNotifyData", file: !6, line: 75, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GClosureNotifyData", file: !6, line: 161, size: 128, align: 64, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !6, line: 163, baseType: !67, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !77, file: !6, line: 164, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "GClosureNotify", file: !6, line: 95, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !67, !31}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !7, file: !6, line: 219, baseType: !67, size: 64, align: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !16, line: 46, baseType: !88)
!88 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMarshalFunc_POINTER__POINTER_BOOLEAN", scope: !93, file: !92, line: 61, baseType: !94)
!92 = !DIFile(filename: "svcSignals.c", directory: "/home/lichi/Desktop/open-vm-tools/line1395")
!93 = distinct !DISubprogram(name: "g_cclosure_user_marshal_POINTER__POINTER_BOOLEAN", scope: !92, file: !92, line: 54, type: !29, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!67, !67, !67, !97, !67}
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !16, line: 50, baseType: !48)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMarshalFunc_BOOLEAN__POINTER_STRING_STRING", scope: !99, file: !92, line: 102, baseType: !100)
!99 = distinct !DISubprogram(name: "g_cclosure_user_marshal_BOOLEAN__POINTER_STRING_STRING", scope: !92, file: !92, line: 95, type: !29, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!97, !67, !67, !67, !67, !67}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMarshalFunc_UINT__POINTER_POINTER_UINT_UINT_POINTER", scope: !104, file: !92, line: 145, baseType: !105)
!104 = distinct !DISubprogram(name: "g_cclosure_user_marshal_UINT__POINTER_POINTER_UINT_UINT_POINTER", scope: !92, file: !92, line: 138, type: !29, isLocal: false, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!15, !67, !67, !67, !15, !15, !67, !67}
!108 = !{i32 2, !"Dwarf Version", i32 4}
!109 = !{i32 2, !"Debug Info Version", i32 3}
!110 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!111 = !DILocalVariable(name: "closure", arg: 1, scope: !93, file: !92, line: 54, type: !31)
!112 = !DIExpression()
!113 = !DILocation(line: 54, column: 61, scope: !93)
!114 = !DILocalVariable(name: "return_value", arg: 2, scope: !93, file: !92, line: 55, type: !32)
!115 = !DILocation(line: 55, column: 59, scope: !93)
!116 = !DILocalVariable(name: "n_param_values", arg: 3, scope: !93, file: !92, line: 56, type: !15)
!117 = !DILocation(line: 56, column: 57, scope: !93)
!118 = !DILocalVariable(name: "param_values", arg: 4, scope: !93, file: !92, line: 57, type: !71)
!119 = !DILocation(line: 57, column: 65, scope: !93)
!120 = !DILocalVariable(name: "invocation_hint", arg: 5, scope: !93, file: !92, line: 58, type: !67)
!121 = !DILocation(line: 58, column: 60, scope: !93)
!122 = !DILocalVariable(name: "marshal_data", arg: 6, scope: !93, file: !92, line: 59, type: !67)
!123 = !DILocation(line: 59, column: 60, scope: !93)
!124 = !DILocalVariable(name: "callback", scope: !93, file: !92, line: 65, type: !91)
!125 = !DILocation(line: 65, column: 41, scope: !93)
!126 = !DILocalVariable(name: "cc", scope: !93, file: !92, line: 66, type: !4)
!127 = !DILocation(line: 66, column: 14, scope: !93)
!128 = !DILocation(line: 66, column: 32, scope: !93)
!129 = !DILocation(line: 66, column: 19, scope: !93)
!130 = !DILocalVariable(name: "data1", scope: !93, file: !92, line: 67, type: !67)
