; ModuleID = './[inter]mcs.o.i'
source_filename = "./[inter]mcs.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._VCHANNEL = type { i16, [8 x i8], i32, %struct.stream, void (%struct.stream*)* }
%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }

@.str = private unnamed_addr constant [26 x i8] c"mcs_send_dpu(), reason=%d\00", align 1
@g_mcs_userid = common global i16 0, align 2
@.str.1 = private unnamed_addr constant [34 x i8] c"mcs_recv(), expected data, got %d\00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"%s()\00", align 1
@__func__.mcs_connect_start = private unnamed_addr constant [18 x i8] c"mcs_connect_start\00", align 1
@__func__.mcs_connect_finalize = private unnamed_addr constant [21 x i8] c"mcs_connect_finalize\00", align 1
@g_num_channels = external global i32, align 4
@g_channels = external global [0 x %struct._VCHANNEL], align 8
@__func__.mcs_send_connect_initial = private unnamed_addr constant [25 x i8] c"mcs_send_connect_initial\00", align 1
@__func__.mcs_recv_connect_response = private unnamed_addr constant [26 x i8] c"mcs_recv_connect_response\00", align 1
@.str.3 = private unnamed_addr constant [39 x i8] c"mcs_recv_connect_response(), result=%d\00", align 1
@__func__.mcs_send_edrq = private unnamed_addr constant [14 x i8] c"mcs_send_edrq\00", align 1
@__func__.mcs_send_aurq = private unnamed_addr constant [14 x i8] c"mcs_send_aurq\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !33, globals: !35)
!1 = !DIFile(filename: "[inter]mcs.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15, !22}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MCS_PDU_TYPE", file: !23, line: 99, size: 32, align: 32, elements: !24)
!23 = !DIFile(filename: "constants.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32}
!25 = !DIEnumerator(name: "MCS_EDRQ", value: 1)
!26 = !DIEnumerator(name: "MCS_DPUM", value: 8)
!27 = !DIEnumerator(name: "MCS_AURQ", value: 10)
!28 = !DIEnumerator(name: "MCS_AUCF", value: 11)
!29 = !DIEnumerator(name: "MCS_CJRQ", value: 14)
!30 = !DIEnumerator(name: "MCS_CJCF", value: 15)
!31 = !DIEnumerator(name: "MCS_SDRQ", value: 25)
!32 = !DIEnumerator(name: "MCS_SDIN", value: 26)
!33 = !{!34}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!35 = !{!36}
!36 = distinct !DIGlobalVariable(name: "g_mcs_userid", scope: !0, file: !37, line: 24, type: !38, isLocal: false, isDefinition: true, variable: i16* @g_mcs_userid)
!37 = !DIFile(filename: "mcs.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !39, line: 41, baseType: !40)
!39 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!40 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!41 = !{i32 2, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!44 = distinct !DISubprogram(name: "mcs_send_dpu", scope: !37, file: !37, line: 256, type: !45, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !47)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !40}
!47 = !{}
!48 = !DILocalVariable(name: "reason", arg: 1, scope: !44, file: !37, line: 256, type: !40)
!49 = !DIExpression()
!50 = !DILocation(line: 256, column: 29, scope: !44)
!51 = !DILocalVariable(name: "s", scope: !44, file: !37, line: 258, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !53, line: 40, baseType: !54)
!53 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !53, line: 25, size: 576, align: 64, elements: !56)
!56 = !{!57, !60, !61, !62, !64, !65, !66, !67, !68}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !55, file: !53, line: 27, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !55, file: !53, line: 28, baseType: !58, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !55, file: !53, line: 29, baseType: !58, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !55, file: !53, line: 30, baseType: !63, size: 32, align: 32, offset: 192)
!63 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !55, file: !53, line: 33, baseType: !58, size: 64, align: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !55, file: !53, line: 34, baseType: !58, size: 64, align: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !55, file: !53, line: 35, baseType: !58, size: 64, align: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !55, file: !53, line: 36, baseType: !58, size: 64, align: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !55, file: !53, line: 37, baseType: !58, size: 64, align: 64, offset: 512)
!69 = !DILocation(line: 258, column: 9, scope: !44)
!70 = !DILocalVariable(name: "contents", scope: !44, file: !37, line: 258, type: !52)
!71 = !DILocation(line: 258, column: 12, scope: !44)
!72 = !DILocation(line: 260, column: 55, scope: !44)
!73 = !DILocation(line: 260, column: 2, scope: !44)
!74 = !DILocation(line: 262, column: 13, scope: !44)
!75 = !DILocation(line: 262, column: 11, scope: !44)
!76 = !DILocation(line: 263, column: 9, scope: !44)
!77 = !DILocation(line: 263, column: 2, scope: !44)
!78 = !DILocation(line: 264, column: 12, scope: !44)
!79 = !DILocation(line: 264, column: 2, scope: !44)
!80 = !DILocation(line: 265, column: 10, scope: !44)
!81 = !DILocation(line: 265, column: 2, scope: !44)
!82 = !DILocation(line: 266, column: 18, scope: !44)
!83 = !DILocation(line: 266, column: 28, scope: !44)
!84 = !DILocation(line: 266, column: 2, scope: !44)
!85 = !DILocation(line: 267, column: 19, scope: !44)
!86 = !DILocation(line: 267, column: 2, scope: !44)
!87 = !DILocation(line: 268, column: 21, scope: !44)
!88 = !DILocation(line: 268, column: 32, scope: !44)
!89 = !DILocation(line: 268, column: 3, scope: !44)
!90 = !DILocation(line: 268, column: 14, scope: !44)
!91 = !DILocation(line: 268, column: 18, scope: !44)
!92 = !DILocation(line: 270, column: 6, scope: !44)
!93 = !DILocation(line: 270, column: 4, scope: !44)
!94 = !DILocation(line: 271, column: 19, scope: !44)
!95 = !DILocation(line: 271, column: 22, scope: !44)
!96 = !DILocation(line: 271, column: 2, scope: !44)
!97 = !DILocation(line: 272, column: 9, scope: !44)
!98 = !DILocation(line: 272, column: 2, scope: !44)
!99 = !DILocation(line: 274, column: 14, scope: !44)
!100 = !DILocation(line: 274, column: 18, scope: !44)
!101 = !DILocation(line: 274, column: 3, scope: !44)
!102 = !DILocation(line: 274, column: 7, scope: !44)
!103 = !DILocation(line: 274, column: 11, scope: !44)
!104 = !DILocation(line: 276, column: 11, scope: !44)
!105 = !DILocation(line: 276, column: 2, scope: !44)
!106 = !DILocation(line: 277, column: 1, scope: !44)
!107 = distinct !DISubprogram(name: "mcs_init", scope: !37, file: !37, line: 281, type: !108, isLocal: false, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !47)
!108 = !DISubroutineType(types: !109)
!109 = !{!52, !110}
!110 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!111 = !DILocalVariable(name: "length", arg: 1, scope: !107, file: !37, line: 281, type: !110)
!112 = !DILocation(line: 281, column: 14, scope: !107)
!113 = !DILocalVariable(name: "s", scope: !107, file: !37, line: 283, type: !52)
!114 = !DILocation(line: 283, column: 9, scope: !107)
!115 = !DILocation(line: 285, column: 15, scope: !107)
!116 = !DILocation(line: 285, column: 22, scope: !107)
!117 = !DILocation(line: 285, column: 6, scope: !107)
!118 = !DILocation(line: 285, column: 4, scope: !107)
!119 = !DILocation(line: 286, column: 20, scope: !120)
!120 = distinct !DILexicalBlock(scope: !107, file: !37, line: 286, column: 2)
!121 = !DILocation(line: 286, column: 24, scope: !120)
!122 = !DILocation(line: 286, column: 5, scope: !120)
!123 = !DILocation(line: 286, column: 9, scope: !120)
!124 = !DILocation(line: 286, column: 17, scope: !120)
!125 = !DILocation(line: 286, column: 28, scope: !120)
!126 = !DILocation(line: 286, column: 32, scope: !120)
!127 = !DILocation(line: 286, column: 34, scope: !120)
!128 = !DILocation(line: 288, column: 9, scope: !107)
!129 = !DILocation(line: 288, column: 2, scope: !107)
!130 = distinct !DISubprogram(name: "mcs_send_to_channel", scope: !37, file: !37, line: 293, type: !131, isLocal: false, isDefinition: true, scopeLine: 294, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !47)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !52, !38}
