; ModuleID = './[inter]licence.o.i'
source_filename = "./[inter]licence.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }
%struct.rc4_key_st = type { i32, i32, [256 x i32] }

@g_licence_issued = global i32 0, align 4
@g_licence_error_result = global i32 0, align 4
@.str = private unnamed_addr constant [51 x i8] c"License error alert from server: No license server\00", align 1
@.str.1 = private unnamed_addr constant [48 x i8] c"License error alert from server: Invalid client\00", align 1
@.str.2 = private unnamed_addr constant [62 x i8] c"License error alert from server: code %u, state transition %u\00", align 1
@.str.3 = private unnamed_addr constant [66 x i8] c"license_process(), processing licensing PDU (message type 0x%02x)\00", align 1
@.str.4 = private unnamed_addr constant [51 x i8] c"license_process(), unhandled license PDU tag 0x%02\00", align 1
@g_licence_sign_key = internal global [16 x i8] zeroinitializer, align 16
@g_licence_key = internal global [16 x i8] zeroinitializer, align 16
@.str.5 = private unnamed_addr constant [71 x i8] c"license_process_request(), sending licensing PDU (message type 0x%02x)\00", align 1
@g_username = external global i8*, align 8
@g_hostname = external global [16 x i8], align 16
@g_rdp_version = external global i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !28, globals: !37)
!1 = !DIFile(filename: "[inter]licence.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15, !22}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_RDP_VERSION", file: !23, line: 52, size: 32, align: 32, elements: !24)
!23 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!24 = !{!25, !26, !27}
!25 = !DIEnumerator(name: "RDP_V4", value: 4)
!26 = !DIEnumerator(name: "RDP_V5", value: 5)
!27 = !DIEnumerator(name: "RDP_V6", value: 6)
!28 = !{!29, !32, !34}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !23, line: 43, baseType: !31)
!31 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !23, line: 41, baseType: !36)
!36 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!37 = !{!38, !42, !43, !49}
!38 = distinct !DIGlobalVariable(name: "g_licence_issued", scope: !0, file: !39, line: 33, type: !40, isLocal: false, isDefinition: true, variable: i32* @g_licence_issued)
!39 = !DIFile(filename: "licence.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !23, line: 28, baseType: !41)
!41 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!42 = distinct !DIGlobalVariable(name: "g_licence_error_result", scope: !0, file: !39, line: 34, type: !40, isLocal: false, isDefinition: true, variable: i32* @g_licence_error_result)
!43 = distinct !DIGlobalVariable(name: "g_licence_sign_key", scope: !0, file: !39, line: 31, type: !44, isLocal: true, isDefinition: true, variable: [16 x i8]* @g_licence_sign_key)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 128, align: 8, elements: !47)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !23, line: 39, baseType: !46)
!46 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!47 = !{!48}
!48 = !DISubrange(count: 16)
!49 = distinct !DIGlobalVariable(name: "g_licence_key", scope: !0, file: !39, line: 30, type: !44, isLocal: true, isDefinition: true, variable: [16 x i8]* @g_licence_key)
!50 = !{i32 2, !"Dwarf Version", i32 4}
!51 = !{i32 2, !"Debug Info Version", i32 3}
!52 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!53 = distinct !DISubprogram(name: "licence_process_error_alert", scope: !39, file: !39, line: 309, type: !54, isLocal: false, isDefinition: true, scopeLine: 310, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !71)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !56}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !57, line: 40, baseType: !58)
!57 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !57, line: 25, size: 576, align: 64, elements: !60)
!60 = !{!61, !63, !64, !65, !66, !67, !68, !69, !70}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !59, file: !57, line: 27, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !59, file: !57, line: 28, baseType: !62, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !59, file: !57, line: 29, baseType: !62, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !59, file: !57, line: 30, baseType: !31, size: 32, align: 32, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !59, file: !57, line: 33, baseType: !62, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !59, file: !57, line: 34, baseType: !62, size: 64, align: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !59, file: !57, line: 35, baseType: !62, size: 64, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !59, file: !57, line: 36, baseType: !62, size: 64, align: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !59, file: !57, line: 37, baseType: !62, size: 64, align: 64, offset: 512)
!71 = !{}
!72 = !DILocalVariable(name: "s", arg: 1, scope: !53, file: !39, line: 309, type: !56)
!73 = !DIExpression()
!74 = !DILocation(line: 309, column: 36, scope: !53)
!75 = !DILocalVariable(name: "error_code", scope: !53, file: !39, line: 311, type: !30)
!76 = !DILocation(line: 311, column: 9, scope: !53)
!77 = !DILocalVariable(name: "state_transition", scope: !53, file: !39, line: 312, type: !30)
!78 = !DILocation(line: 312, column: 9, scope: !53)
!79 = !DILocation(line: 314, column: 30, scope: !80)
!80 = distinct !DILexicalBlock(scope: !53, file: !39, line: 314, column: 2)
!81 = !DILocation(line: 314, column: 34, scope: !80)
!82 = !DILocation(line: 314, column: 17, scope: !80)
!83 = !DILocation(line: 314, column: 15, scope: !80)
!84 = !DILocation(line: 314, column: 39, scope: !80)
!85 = !DILocation(line: 314, column: 43, scope: !80)
!86 = !DILocation(line: 314, column: 45, scope: !80)
!87 = !DILocation(line: 315, column: 36, scope: !88)
!88 = distinct !DILexicalBlock(scope: !53, file: !39, line: 315, column: 2)
!89 = !DILocation(line: 315, column: 40, scope: !88)
!90 = !DILocation(line: 315, column: 23, scope: !88)
!91 = !DILocation(line: 315, column: 21, scope: !88)
!92 = !DILocation(line: 315, column: 45, scope: !88)
!93 = !DILocation(line: 315, column: 49, scope: !88)
!94 = !DILocation(line: 315, column: 51, scope: !88)
!95 = !DILocation(line: 316, column: 3, scope: !53)
!96 = !DILocation(line: 316, column: 7, scope: !53)
!97 = !DILocation(line: 316, column: 9, scope: !53)
!98 = !DILocation(line: 324, column: 6, scope: !99)
!99 = distinct !DILexicalBlock(scope: !53, file: !39, line: 324, column: 6)
!100 = !DILocation(line: 324, column: 17, scope: !99)
!101 = !DILocation(line: 324, column: 6, scope: !53)
!102 = !DILocation(line: 326, column: 20, scope: !103)
!103 = distinct !DILexicalBlock(scope: !99, file: !39, line: 325, column: 2)
!104 = !DILocation(line: 327, column: 3, scope: !103)
!105 = !DILocation(line: 331, column: 10, scope: !53)
!106 = !DILocation(line: 331, column: 2, scope: !53)
!107 = !DILocation(line: 334, column: 4, scope: !108)
!108 = distinct !DILexicalBlock(scope: !53, file: !39, line: 332, column: 2)
!109 = !DILocation(line: 335, column: 4, scope: !108)
!110 = !DILocation(line: 338, column: 4, scope: !108)
!111 = !DILocation(line: 339, column: 4, scope: !108)
!112 = !DILocation(line: 339, column: 4, scope: !113)
!113 = !DILexicalBlockFile(scope: !108, file: !39, discriminator: 1)
!114 = !DILocation(line: 347, column: 11, scope: !108)
!115 = !DILocation(line: 347, column: 23, scope: !108)
!116 = !DILocation(line: 345, column: 4, scope: !108)
!117 = !DILocation(line: 348, column: 4, scope: !108)
!118 = !DILocation(line: 351, column: 25, scope: !53)
!119 = !DILocation(line: 352, column: 1, scope: !53)
!120 = !DILocation(line: 352, column: 1, scope: !121)
!121 = !DILexicalBlockFile(scope: !53, file: !39, discriminator: 1)
!122 = distinct !DISubprogram(name: "licence_process", scope: !39, file: !39, line: 357, type: !54, isLocal: false, isDefinition: true, scopeLine: 358, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !71)
!123 = !DILocalVariable(name: "s", arg: 1, scope: !122, file: !39, line: 357, type: !56)
!124 = !DILocation(line: 357, column: 24, scope: !122)
!125 = !DILocalVariable(name: "tag", scope: !122, file: !39, line: 359, type: !45)
!126 = !DILocation(line: 359, column: 8, scope: !122)
!127 = !DILocation(line: 361, column: 11, scope: !122)
!128 = !DILocation(line: 361, column: 15, scope: !122)
!129 = !DILocation(line: 361, column: 16, scope: !122)
!130 = !DILocation(line: 361, column: 8, scope: !122)
!131 = !DILocation(line: 361, column: 6, scope: !122)
!132 = !DILocation(line: 362, column: 3, scope: !122)
!133 = !DILocation(line: 362, column: 7, scope: !122)
!134 = !DILocation(line: 362, column: 9, scope: !122)
!135 = !DILocation(line: 365, column: 9, scope: !122)
!136 = !DILocation(line: 364, column: 2, scope: !122)
!137 = !DILocation(line: 367, column: 10, scope: !122)
!138 = !DILocation(line: 367, column: 2, scope: !122)
!139 = !DILocation(line: 370, column: 28, scope: !140)
!140 = distinct !DILexicalBlock(scope: !122, file: !39, line: 368, column: 2)
!141 = !DILocation(line: 370, column: 4, scope: !140)
!142 = !DILocation(line: 371, column: 4, scope: !140)
!143 = !DILocation(line: 374, column: 39, scope: !140)
!144 = !DILocation(line: 374, column: 4, scope: !140)
!145 = !DILocation(line: 375, column: 4, scope: !140)
!146 = !DILocation(line: 380, column: 32, scope: !140)
!147 = !DILocation(line: 380, column: 4, scope: !140)
!148 = !DILocation(line: 381, column: 4, scope: !140)
!149 = !DILocation(line: 384, column: 32, scope: !140)
!150 = !DILocation(line: 384, column: 4, scope: !140)
!151 = !DILocation(line: 385, column: 4, scope: !140)
!152 = !DILocation(line: 389, column: 65, scope: !140)
!153 = !DILocation(line: 388, column: 4, scope: !140)
!154 = !DILocation(line: 390, column: 2, scope: !140)
!155 = !DILocation(line: 391, column: 1, scope: !122)
!156 = distinct !DISubprogram(name: "licence_process_request", scope: !39, file: !39, line: 145, type: !54, isLocal: true, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !71)
!157 = !DILocalVariable(name: "s", arg: 1, scope: !156, file: !39, line: 145, type: !56)
!158 = !DILocation(line: 145, column: 32, scope: !156)
!159 = !DILocalVariable(name: "null_data", scope: !156, file: !39, line: 147, type: !160)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 512, align: 8, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 64)
!163 = !DILocation(line: 147, column: 8, scope: !156)
!164 = !DILocalVariable(name: "server_random", scope: !156, file: !39, line: 148, type: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!166 = !DILocation(line: 148, column: 9, scope: !156)
!167 = !DILocalVariable(name: "signature", scope: !156, file: !39, line: 149, type: !44)
!168 = !DILocation(line: 149, column: 8, scope: !156)
!169 = !DILocalVariable(name: "hwid", scope: !156, file: !39, line: 150, type: !170)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, align: 8, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 20)
!173 = !DILocation(line: 150, column: 8, scope: !156)
!174 = !DILocalVariable(name: "licence_data", scope: !156, file: !39, line: 151, type: !165)
!175 = !DILocation(line: 151, column: 9, scope: !156)
!176 = !DILocalVariable(name: "licence_size", scope: !156, file: !39, line: 152, type: !41)
!177 = !DILocation(line: 152, column: 6, scope: !156)
!178 = !DILocalVariable(name: "crypt_key", scope: !156, file: !39, line: 153, type: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "RC4_KEY", file: !180, line: 76, baseType: !181)
!180 = !DIFile(filename: "/usr/include/openssl/rc4.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rc4_key_st", file: !180, line: 73, size: 8256, align: 32, elements: !182)
!182 = !{!183, !184, !185}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !181, file: !180, line: 74, baseType: !31, size: 32, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !181, file: !180, line: 74, baseType: !31, size: 32, align: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !180, line: 75, baseType: !186, size: 8192, align: 32, offset: 64)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8192, align: 32, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 256)
!189 = !DILocation(line: 153, column: 10, scope: !156)
!190 = !DILocation(line: 156, column: 21, scope: !191)
!191 = distinct !DILexicalBlock(scope: !156, file: !39, line: 156, column: 2)
!192 = !DILocation(line: 156, column: 25, scope: !191)
!193 = !DILocation(line: 156, column: 18, scope: !191)
!194 = !DILocation(line: 156, column: 29, scope: !191)
!195 = !DILocation(line: 156, column: 33, scope: !191)
!196 = !DILocation(line: 156, column: 35, scope: !191)
!197 = !DILocation(line: 160, column: 2, scope: !156)
!198 = !DILocation(line: 161, column: 24, scope: !156)
!199 = !DILocation(line: 161, column: 35, scope: !156)
!200 = !DILocation(line: 161, column: 50, scope: !156)
!201 = !DILocation(line: 161, column: 2, scope: !156)
!202 = !DILocation(line: 163, column: 17, scope: !156)
!203 = !DILocation(line: 163, column: 15, scope: !156)
!204 = !DILocation(line: 164, column: 6, scope: !205)
!205 = distinct !DILexicalBlock(scope: !156, file: !39, line: 164, column: 6)
!206 = !DILocation(line: 164, column: 19, scope: !205)
!207 = !DILocation(line: 164, column: 6, scope: !156)
!208 = !DILocation(line: 167, column: 25, scope: !209)
!209 = distinct !DILexicalBlock(scope: !205, file: !39, line: 165, column: 2)
!210 = !DILocation(line: 167, column: 3, scope: !209)
!211 = !DILocation(line: 168, column: 12, scope: !209)
!212 = !DILocation(line: 168, column: 51, scope: !209)
!213 = !DILocation(line: 168, column: 3, scope: !209)
!214 = !DILocation(line: 171, column: 3, scope: !209)
!215 = !DILocation(line: 172, column: 31, scope: !209)
!216 = !DILocation(line: 172, column: 37, scope: !209)
!217 = !DILocation(line: 172, column: 3, scope: !209)
!218 = !DILocation(line: 174, column: 3, scope: !209)
!219 = !DILocation(line: 178, column: 16, scope: !209)
!220 = !DILocation(line: 178, column: 27, scope: !209)
!221 = !DILocation(line: 178, column: 38, scope: !209)
!222 = !DILocation(line: 178, column: 52, scope: !209)
!223 = !DILocation(line: 178, column: 66, scope: !209)
!224 = !DILocation(line: 178, column: 72, scope: !209)
!225 = !DILocation(line: 178, column: 3, scope: !209)
!226 = !DILocation(line: 180, column: 9, scope: !209)
!227 = !DILocation(line: 180, column: 3, scope: !209)
!228 = !DILocation(line: 181, column: 3, scope: !209)
!229 = !DILocation(line: 184, column: 2, scope: !156)
!230 = !DILocation(line: 188, column: 35, scope: !156)
!231 = !DILocation(line: 188, column: 46, scope: !156)
!232 = !DILocation(line: 188, column: 57, scope: !156)
!233 = !DILocation(line: 188, column: 2, scope: !156)
!234 = !DILocation(line: 189, column: 1, scope: !156)
!235 = !DILocation(line: 189, column: 1, scope: !236)
!236 = !DILexicalBlockFile(scope: !156, file: !39, discriminator: 1)
!237 = distinct !DISubprogram(name: "licence_process_platform_challenge", scope: !39, file: !39, line: 243, type: !54, isLocal: true, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !71)
!238 = !DILocalVariable(name: "s", arg: 1, scope: !237, file: !39, line: 243, type: !56)
!239 = !DILocation(line: 243, column: 43, scope: !237)
!240 = !DILocalVariable(name: "in_token", scope: !237, file: !39, line: 245, type: !165)
!241 = !DILocation(line: 245, column: 9, scope: !237)
!242 = !DILocalVariable(name: "in_sig", scope: !237, file: !39, line: 245, type: !165)
!243 = !DILocation(line: 245, column: 26, scope: !237)
!244 = !DILocalVariable(name: "out_token", scope: !237, file: !39, line: 246, type: !245)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 80, align: 8, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 10)
!248 = !DILocation(line: 246, column: 8, scope: !237)
