; ModuleID = './[inter]ctrl.o.i'
source_filename = "./[inter]ctrl.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._ctrl_slave_t = type { %struct._ctrl_slave_t*, %struct._ctrl_slave_t*, i32, [1024 x i8] }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.sockaddr_un = type { i16, [108 x i8] }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.SHAstate_st = type { i32, i32, i32, i32, i32, i32, i32, [16 x i32], i32 }
%struct.fd_set = type { [16 x i64] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@ctrlsock = internal global i32 0, align 4
@_ctrl_is_slave = internal global i32 0, align 4
@.str = private unnamed_addr constant [5 x i8] c"HOME\00", align 1
@ctrlsock_name = internal global [4096 x i8] zeroinitializer, align 16
@.str.1 = private unnamed_addr constant [37 x i8] c"%s/.local/share/rdesktop/ctrl/%s.ctl\00", align 1
@.str.2 = private unnamed_addr constant [30 x i8] c"%s/.local/share/rdesktop/ctrl\00", align 1
@.str.3 = private unnamed_addr constant [40 x i8] c"ctrl_init(), utils_mkdir_p() failed: %s\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !40, globals: !77)
!1 = !DIFile(filename: "[inter]ctrl.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15, !22, !34}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !23, line: 24, size: 32, align: 32, elements: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32, !33}
!25 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!26 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!27 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!28 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!29 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!30 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!31 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!32 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!33 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 52, size: 32, align: 32, elements: !36)
!35 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/socket.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!36 = !{!37, !38, !39}
!37 = !DIEnumerator(name: "SHUT_RD", value: 0)
!38 = !DIEnumerator(name: "SHUT_WR", value: 1)
!39 = !DIEnumerator(name: "SHUT_RDWR", value: 2)
!40 = !{!41, !42, !55, !58, !59, !63, !76}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !44, line: 153, size: 128, align: 16, elements: !45)
!44 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!45 = !{!46, !50}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !43, file: !44, line: 155, baseType: !47, size: 16, align: 16)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !48, line: 28, baseType: !49)
!48 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!49 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !43, file: !44, line: 156, baseType: !51, size: 112, align: 8, offset: 16)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 112, align: 8, elements: !53)
!52 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!53 = !{!54}
!54 = !DISubrange(count: 14)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !56, line: 54, baseType: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!57 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!58 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !61, line: 39, baseType: !62)
!61 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!62 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "_ctrl_slave_t", file: !65, line: 57, baseType: !66)
!65 = !DIFile(filename: "ctrl.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ctrl_slave_t", file: !65, line: 52, size: 8384, align: 64, elements: !67)
!67 = !{!68, !70, !71, !72}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !66, file: !65, line: 54, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !66, file: !65, line: 54, baseType: !69, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !66, file: !65, line: 55, baseType: !58, size: 32, align: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "linebuf", scope: !66, file: !65, line: 56, baseType: !73, size: 8192, align: 8, offset: 160)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8192, align: 8, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 1024)
!76 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!77 = !{!78, !80, !81, !85}
!78 = distinct !DIGlobalVariable(name: "_ctrl_is_slave", scope: !0, file: !65, line: 45, type: !79, isLocal: true, isDefinition: true, variable: i32* @_ctrl_is_slave)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !61, line: 28, baseType: !58)
!80 = distinct !DIGlobalVariable(name: "ctrlsock", scope: !0, file: !65, line: 46, type: !58, isLocal: true, isDefinition: true, variable: i32* @ctrlsock)
!81 = distinct !DIGlobalVariable(name: "ctrlsock_name", scope: !0, file: !65, line: 47, type: !82, isLocal: true, isDefinition: true, variable: [4096 x i8]* @ctrlsock_name)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 32768, align: 8, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 4096)
!85 = distinct !DIGlobalVariable(name: "_ctrl_slaves", scope: !0, file: !65, line: 48, type: !69, isLocal: true, isDefinition: true, variable: %struct._ctrl_slave_t** @_ctrl_slaves)
!86 = !{i32 2, !"Dwarf Version", i32 4}
!87 = !{i32 2, !"Debug Info Version", i32 3}
!88 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!89 = distinct !DISubprogram(name: "ctrl_init", scope: !65, file: !65, line: 252, type: !90, isLocal: false, isDefinition: true, scopeLine: 253, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!90 = !DISubroutineType(types: !91)
!91 = !{!58, !92, !92, !92}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!94 = !{}
!95 = !DILocalVariable(name: "user", arg: 1, scope: !89, file: !65, line: 252, type: !92)
!96 = !DIExpression()
!97 = !DILocation(line: 252, column: 23, scope: !89)
!98 = !DILocalVariable(name: "domain", arg: 2, scope: !89, file: !65, line: 252, type: !92)
!99 = !DILocation(line: 252, column: 41, scope: !89)
!100 = !DILocalVariable(name: "host", arg: 3, scope: !89, file: !65, line: 252, type: !92)
!101 = !DILocation(line: 252, column: 61, scope: !89)
!102 = !DILocalVariable(name: "st", scope: !89, file: !65, line: 254, type: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !104, line: 46, size: 1152, align: 64, elements: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!105 = !{!106, !110, !112, !114, !116, !118, !120, !121, !122, !124, !126, !128, !136, !137, !138}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !103, file: !104, line: 48, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !108, line: 124, baseType: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!109 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !103, file: !104, line: 53, baseType: !111, size: 64, align: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !108, line: 127, baseType: !109)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !103, file: !104, line: 61, baseType: !113, size: 64, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !108, line: 130, baseType: !109)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !103, file: !104, line: 62, baseType: !115, size: 32, align: 32, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !108, line: 129, baseType: !76)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !103, file: !104, line: 64, baseType: !117, size: 32, align: 32, offset: 224)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !108, line: 125, baseType: !76)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !103, file: !104, line: 65, baseType: !119, size: 32, align: 32, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !108, line: 126, baseType: !76)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !103, file: !104, line: 67, baseType: !58, size: 32, align: 32, offset: 288)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !103, file: !104, line: 69, baseType: !107, size: 64, align: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !103, file: !104, line: 74, baseType: !123, size: 64, align: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !108, line: 131, baseType: !57)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !103, file: !104, line: 78, baseType: !125, size: 64, align: 64, offset: 448)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !108, line: 153, baseType: !57)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !103, file: !104, line: 80, baseType: !127, size: 64, align: 64, offset: 512)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !108, line: 158, baseType: !57)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !103, file: !104, line: 91, baseType: !129, size: 128, align: 64, offset: 576)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !130, line: 120, size: 128, align: 64, elements: !131)
!130 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!131 = !{!132, !134}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !129, file: !130, line: 122, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !108, line: 139, baseType: !57)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !129, file: !130, line: 123, baseType: !135, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !108, line: 175, baseType: !57)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !103, file: !104, line: 92, baseType: !129, size: 128, align: 64, offset: 704)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !103, file: !104, line: 93, baseType: !129, size: 128, align: 64, offset: 832)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !103, file: !104, line: 106, baseType: !139, size: 192, align: 64, offset: 960)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 192, align: 64, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 3)
!142 = !DILocation(line: 254, column: 14, scope: !89)
!143 = !DILocalVariable(name: "saun", scope: !89, file: !65, line: 255, type: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !145, line: 29, size: 880, align: 16, elements: !146)
!145 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/un.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !144, file: !145, line: 31, baseType: !47, size: 16, align: 16)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !144, file: !145, line: 32, baseType: !149, size: 864, align: 8, offset: 16)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 864, align: 8, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 108)
!152 = !DILocation(line: 255, column: 21, scope: !89)
!153 = !DILocalVariable(name: "hash", scope: !89, file: !65, line: 256, type: !154)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 328, align: 8, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 41)
!157 = !DILocation(line: 256, column: 7, scope: !89)
!158 = !DILocalVariable(name: "path", scope: !89, file: !65, line: 256, type: !82)
!159 = !DILocation(line: 256, column: 17, scope: !89)
!160 = !DILocalVariable(name: "home", scope: !89, file: !65, line: 257, type: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!162 = !DILocation(line: 257, column: 8, scope: !89)
!163 = !DILocation(line: 260, column: 6, scope: !164)
!164 = distinct !DILexicalBlock(scope: !89, file: !65, line: 260, column: 6)
!165 = !DILocation(line: 260, column: 15, scope: !164)
!166 = !DILocation(line: 260, column: 20, scope: !164)
!167 = !DILocation(line: 260, column: 23, scope: !168)
!168 = !DILexicalBlockFile(scope: !164, file: !65, discriminator: 1)
!169 = !DILocation(line: 260, column: 6, scope: !168)
!170 = !DILocation(line: 261, column: 3, scope: !164)
!171 = !DILocation(line: 263, column: 9, scope: !89)
!172 = !DILocation(line: 263, column: 7, scope: !89)
!173 = !DILocation(line: 264, column: 6, scope: !174)
!174 = distinct !DILexicalBlock(scope: !89, file: !65, line: 264, column: 6)
!175 = !DILocation(line: 264, column: 11, scope: !174)
!176 = !DILocation(line: 264, column: 6, scope: !89)
!177 = !DILocation(line: 266, column: 3, scope: !178)
!178 = distinct !DILexicalBlock(scope: !174, file: !65, line: 265, column: 2)
!179 = !DILocation(line: 270, column: 20, scope: !89)
!180 = !DILocation(line: 270, column: 26, scope: !89)
!181 = !DILocation(line: 270, column: 34, scope: !89)
!182 = !DILocation(line: 270, column: 40, scope: !89)
!183 = !DILocation(line: 270, column: 2, scope: !89)
!184 = !DILocation(line: 271, column: 81, scope: !89)
!185 = !DILocation(line: 271, column: 87, scope: !89)
!186 = !DILocation(line: 271, column: 2, scope: !89)
!187 = !DILocation(line: 272, column: 43, scope: !89)
!188 = !DILocation(line: 275, column: 11, scope: !89)
!189 = !DILocation(line: 275, column: 62, scope: !89)
!190 = !DILocation(line: 275, column: 2, scope: !89)
!191 = !DILocation(line: 276, column: 2, scope: !89)
!192 = !DILocation(line: 276, column: 25, scope: !89)
!193 = !DILocation(line: 277, column: 20, scope: !194)
!194 = distinct !DILexicalBlock(scope: !89, file: !65, line: 277, column: 6)
!195 = !DILocation(line: 277, column: 6, scope: !194)
!196 = !DILocation(line: 277, column: 32, scope: !194)
!197 = !DILocation(line: 277, column: 6, scope: !89)
!198 = !DILocation(line: 279, column: 76, scope: !199)
!199 = distinct !DILexicalBlock(scope: !194, file: !65, line: 278, column: 2)
!200 = !DILocation(line: 279, column: 75, scope: !199)
!201 = !DILocation(line: 279, column: 66, scope: !202)
!202 = !DILexicalBlockFile(scope: !199, file: !65, discriminator: 1)
!203 = !DILocation(line: 279, column: 3, scope: !204)
!204 = !DILexicalBlockFile(scope: !199, file: !65, discriminator: 2)
!205 = !DILocation(line: 280, column: 3, scope: !199)
!206 = !DILocation(line: 284, column: 6, scope: !207)
!207 = distinct !DILexicalBlock(scope: !89, file: !65, line: 284, column: 6)
!208 = !DILocation(line: 284, column: 31, scope: !207)
!209 = !DILocation(line: 284, column: 6, scope: !89)
!210 = !DILocation(line: 287, column: 7, scope: !211)
!211 = distinct !DILexicalBlock(scope: !212, file: !65, line: 287, column: 7)
!212 = distinct !DILexicalBlock(scope: !207, file: !65, line: 285, column: 2)
!213 = !DILocation(line: 287, column: 34, scope: !211)
!214 = !DILocation(line: 287, column: 7, scope: !212)
!215 = !DILocation(line: 289, column: 19, scope: !216)
!216 = distinct !DILexicalBlock(scope: !211, file: !65, line: 288, column: 3)
!217 = !DILocation(line: 290, column: 4, scope: !216)
!218 = !DILocation(line: 294, column: 4, scope: !219)
!219 = distinct !DILexicalBlock(scope: !211, file: !65, line: 293, column: 3)
!220 = !DILocation(line: 296, column: 2, scope: !212)
!221 = !DILocation(line: 299, column: 18, scope: !222)
!222 = distinct !DILexicalBlock(scope: !89, file: !65, line: 299, column: 6)
!223 = !DILocation(line: 299, column: 16, scope: !222)
!224 = !DILocation(line: 299, column: 50, scope: !222)
!225 = !DILocation(line: 299, column: 6, scope: !89)
!226 = !DILocation(line: 301, column: 69, scope: !227)
!227 = distinct !DILexicalBlock(scope: !222, file: !65, line: 300, column: 2)
!228 = !DILocation(line: 301, column: 68, scope: !227)
!229 = !DILocation(line: 301, column: 59, scope: !230)
!230 = !DILexicalBlockFile(scope: !227, file: !65, discriminator: 1)
!231 = !DILocation(line: 301, column: 3, scope: !232)
!232 = !DILexicalBlockFile(scope: !227, file: !65, discriminator: 2)
!233 = !DILocation(line: 302, column: 3, scope: !227)
!234 = !DILocation(line: 306, column: 2, scope: !89)
!235 = !DILocation(line: 307, column: 7, scope: !89)
!236 = !DILocation(line: 307, column: 18, scope: !89)
!237 = !DILocation(line: 308, column: 15, scope: !89)
!238 = !DILocation(line: 308, column: 10, scope: !89)
!239 = !DILocation(line: 308, column: 2, scope: !89)
!240 = !DILocation(line: 309, column: 11, scope: !241)
!241 = distinct !DILexicalBlock(scope: !89, file: !65, line: 309, column: 6)
!242 = !DILocation(line: 309, column: 21, scope: !241)
!243 = !DILocation(line: 309, column: 6, scope: !241)
!244 = !DILocation(line: 309, column: 76, scope: !241)
!245 = !DILocation(line: 309, column: 6, scope: !89)
!246 = !DILocation(line: 311, column: 67, scope: !247)
!247 = distinct !DILexicalBlock(scope: !241, file: !65, line: 310, column: 2)
!248 = !DILocation(line: 311, column: 66, scope: !247)
!249 = !DILocation(line: 311, column: 57, scope: !250)
!250 = !DILexicalBlockFile(scope: !247, file: !65, discriminator: 1)
!251 = !DILocation(line: 311, column: 3, scope: !252)
!252 = !DILexicalBlockFile(scope: !247, file: !65, discriminator: 2)
!253 = !DILocation(line: 312, column: 3, scope: !247)
!254 = !DILocation(line: 315, column: 13, scope: !255)
!255 = distinct !DILexicalBlock(scope: !89, file: !65, line: 315, column: 6)
!256 = !DILocation(line: 315, column: 6, scope: !255)
!257 = !DILocation(line: 315, column: 26, scope: !255)
!258 = !DILocation(line: 315, column: 6, scope: !89)
!259 = !DILocation(line: 317, column: 69, scope: !260)
!260 = distinct !DILexicalBlock(scope: !255, file: !65, line: 316, column: 2)
!261 = !DILocation(line: 317, column: 68, scope: !260)
!262 = !DILocation(line: 317, column: 59, scope: !263)
!263 = !DILexicalBlockFile(scope: !260, file: !65, discriminator: 1)
!264 = !DILocation(line: 317, column: 3, scope: !265)
!265 = !DILexicalBlockFile(scope: !260, file: !65, discriminator: 2)
!266 = !DILocation(line: 318, column: 3, scope: !260)
!267 = !DILocation(line: 322, column: 2, scope: !89)
!268 = !DILocation(line: 324, column: 2, scope: !89)
!269 = !DILocation(line: 325, column: 1, scope: !89)
!270 = distinct !DISubprogram(name: "_ctrl_create_hash", scope: !65, file: !65, line: 210, type: !271, isLocal: true, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !92, !92, !92, !161, !273}
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !274, line: 216, baseType: !109)
!274 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!275 = !DILocalVariable(name: "user", arg: 1, scope: !270, file: !65, line: 210, type: !92)
!276 = !DILocation(line: 210, column: 31, scope: !270)
!277 = !DILocalVariable(name: "domain", arg: 2, scope: !270, file: !65, line: 210, type: !92)
!278 = !DILocation(line: 210, column: 49, scope: !270)
!279 = !DILocalVariable(name: "host", arg: 3, scope: !270, file: !65, line: 210, type: !92)
!280 = !DILocation(line: 210, column: 69, scope: !270)
!281 = !DILocalVariable(name: "hash", arg: 4, scope: !270, file: !65, line: 210, type: !161)
!282 = !DILocation(line: 210, column: 81, scope: !270)
!283 = !DILocalVariable(name: "hsize", arg: 5, scope: !270, file: !65, line: 210, type: !273)
!284 = !DILocation(line: 210, column: 94, scope: !270)
!285 = !DILocalVariable(name: "sha1", scope: !270, file: !65, line: 212, type: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "SHA_CTX", file: !287, line: 105, baseType: !288)
!287 = !DIFile(filename: "/usr/include/openssl/sha.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHAstate_st", file: !287, line: 100, size: 768, align: 32, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !301}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "h0", scope: !288, file: !287, line: 101, baseType: !76, size: 32, align: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !288, file: !287, line: 101, baseType: !76, size: 32, align: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !288, file: !287, line: 101, baseType: !76, size: 32, align: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "h3", scope: !288, file: !287, line: 101, baseType: !76, size: 32, align: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "h4", scope: !288, file: !287, line: 101, baseType: !76, size: 32, align: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Nl", scope: !288, file: !287, line: 102, baseType: !76, size: 32, align: 32, offset: 160)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Nh", scope: !288, file: !287, line: 102, baseType: !76, size: 32, align: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !288, file: !287, line: 103, baseType: !298, size: 512, align: 32, offset: 224)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 512, align: 32, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 16)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !288, file: !287, line: 104, baseType: !76, size: 32, align: 32, offset: 736)
!302 = !DILocation(line: 212, column: 10, scope: !270)
!303 = !DILocalVariable(name: "out", scope: !270, file: !65, line: 213, type: !304)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 160, align: 8, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 20)
!307 = !DILocation(line: 213, column: 8, scope: !270)
!308 = !DILocalVariable(name: "delim", scope: !270, file: !65, line: 213, type: !60)
!309 = !DILocation(line: 213, column: 17, scope: !270)
!310 = !DILocalVariable(name: "version", scope: !270, file: !65, line: 214, type: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !61, line: 41, baseType: !49)
!312 = !DILocation(line: 214, column: 9, scope: !270)
!313 = !DILocalVariable(name: "flags", scope: !270, file: !65, line: 215, type: !314)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !61, line: 43, baseType: !76)
!315 = !DILocation(line: 215, column: 9, scope: !270)
!316 = !DILocation(line: 218, column: 8, scope: !270)
!317 = !DILocation(line: 219, column: 8, scope: !270)
!318 = !DILocation(line: 220, column: 10, scope: !270)
!319 = !DILocation(line: 222, column: 6, scope: !320)
!320 = distinct !DILexicalBlock(scope: !270, file: !65, line: 222, column: 6)
!321 = !DILocation(line: 222, column: 6, scope: !270)
!322 = !DILocation(line: 223, column: 9, scope: !320)
!323 = !DILocation(line: 223, column: 3, scope: !320)
!324 = !DILocation(line: 225, column: 2, scope: !270)
!325 = !DILocation(line: 226, column: 27, scope: !270)
!326 = !DILocation(line: 226, column: 2, scope: !270)
!327 = !DILocation(line: 227, column: 2, scope: !270)
!328 = !DILocation(line: 229, column: 6, scope: !329)
!329 = distinct !DILexicalBlock(scope: !270, file: !65, line: 229, column: 6)
!330 = !DILocation(line: 229, column: 6, scope: !270)
!331 = !DILocation(line: 230, column: 38, scope: !329)
!332 = !DILocation(line: 230, column: 51, scope: !329)
!333 = !DILocation(line: 230, column: 44, scope: !329)
!334 = !DILocation(line: 230, column: 3, scope: !335)
!335 = !DILexicalBlockFile(scope: !329, file: !65, discriminator: 1)
!336 = !DILocation(line: 230, column: 3, scope: !329)
!337 = !DILocation(line: 231, column: 2, scope: !270)
!338 = !DILocation(line: 233, column: 6, scope: !339)
!339 = distinct !DILexicalBlock(scope: !270, file: !65, line: 233, column: 6)
!340 = !DILocation(line: 233, column: 6, scope: !270)
!341 = !DILocation(line: 234, column: 38, scope: !339)
!342 = !DILocation(line: 234, column: 53, scope: !339)
!343 = !DILocation(line: 234, column: 46, scope: !339)
!344 = !DILocation(line: 234, column: 3, scope: !345)
!345 = !DILexicalBlockFile(scope: !339, file: !65, discriminator: 1)
!346 = !DILocation(line: 234, column: 3, scope: !339)
!347 = !DILocation(line: 235, column: 2, scope: !270)
!348 = !DILocation(line: 237, column: 6, scope: !349)
!349 = distinct !DILexicalBlock(scope: !270, file: !65, line: 237, column: 6)
!350 = !DILocation(line: 237, column: 6, scope: !270)
!351 = !DILocation(line: 238, column: 38, scope: !349)
!352 = !DILocation(line: 238, column: 51, scope: !349)
!353 = !DILocation(line: 238, column: 44, scope: !349)
!354 = !DILocation(line: 238, column: 3, scope: !355)
!355 = !DILexicalBlockFile(scope: !349, file: !65, discriminator: 1)
!356 = !DILocation(line: 238, column: 3, scope: !349)
!357 = !DILocation(line: 239, column: 2, scope: !270)
!358 = !DILocation(line: 241, column: 27, scope: !270)
!359 = !DILocation(line: 241, column: 2, scope: !270)
!360 = !DILocation(line: 242, column: 26, scope: !270)
!361 = !DILocation(line: 242, column: 2, scope: !270)
!362 = !DILocation(line: 244, column: 21, scope: !270)
!363 = !DILocation(line: 244, column: 27, scope: !270)
!364 = !DILocation(line: 244, column: 34, scope: !270)
!365 = !DILocation(line: 244, column: 2, scope: !270)
!366 = !DILocation(line: 245, column: 1, scope: !270)
!367 = distinct !DISubprogram(name: "ctrl_cleanup", scope: !65, file: !65, line: 328, type: !368, isLocal: false, isDefinition: true, scopeLine: 329, isOptimized: false, unit: !0, variables: !94)
!368 = !DISubroutineType(types: !369)
!369 = !{null}
!370 = !DILocation(line: 330, column: 6, scope: !371)
!371 = distinct !DILexicalBlock(scope: !367, file: !65, line: 330, column: 6)
!372 = !DILocation(line: 330, column: 6, scope: !367)
!373 = !DILocation(line: 332, column: 9, scope: !374)
!374 = distinct !DILexicalBlock(scope: !371, file: !65, line: 331, column: 2)
!375 = !DILocation(line: 332, column: 3, scope: !374)
!376 = !DILocation(line: 333, column: 3, scope: !374)
!377 = !DILocation(line: 334, column: 2, scope: !374)
!378 = !DILocation(line: 335, column: 1, scope: !367)
!379 = distinct !DISubprogram(name: "ctrl_is_slave", scope: !65, file: !65, line: 338, type: !380, isLocal: false, isDefinition: true, scopeLine: 339, isOptimized: false, unit: !0, variables: !94)
!380 = !DISubroutineType(types: !381)
!381 = !{!79}
!382 = !DILocation(line: 340, column: 9, scope: !379)
!383 = !DILocation(line: 340, column: 2, scope: !379)
!384 = distinct !DISubprogram(name: "ctrl_add_fds", scope: !65, file: !65, line: 345, type: !385, isLocal: false, isDefinition: true, scopeLine: 346, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !387, !388}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !56, line: 75, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 64, size: 1024, align: 64, elements: !391)
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__fds_bits", scope: !390, file: !56, line: 72, baseType: !393, size: 1024, align: 64)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 1024, align: 64, elements: !299)
!394 = !DILocalVariable(name: "n", arg: 1, scope: !384, file: !65, line: 345, type: !387)
!395 = !DILocation(line: 345, column: 19, scope: !384)
!396 = !DILocalVariable(name: "rfds", arg: 2, scope: !384, file: !65, line: 345, type: !388)
!397 = !DILocation(line: 345, column: 31, scope: !384)
!398 = !DILocalVariable(name: "it", scope: !384, file: !65, line: 347, type: !63)
!399 = !DILocation(line: 347, column: 17, scope: !384)
!400 = !DILocation(line: 348, column: 6, scope: !401)
!401 = distinct !DILexicalBlock(scope: !384, file: !65, line: 348, column: 6)
!402 = !DILocation(line: 348, column: 15, scope: !401)
!403 = !DILocation(line: 348, column: 6, scope: !384)
!404 = !DILocation(line: 349, column: 3, scope: !401)
!405 = !DILocation(line: 351, column: 1, scope: !384)
!406 = !DILocation(line: 351, column: 3, scope: !384)
!407 = !DILocation(line: 351, column: 59, scope: !384)
!408 = !DILocation(line: 351, column: 10, scope: !384)
!409 = !DILocation(line: 351, column: 4, scope: !384)
!410 = !DILocation(line: 351, column: 38, scope: !384)
!411 = !DILocation(line: 352, column: 11, scope: !384)
!412 = !DILocation(line: 352, column: 10, scope: !384)
!413 = !DILocation(line: 352, column: 17, scope: !384)
!414 = !DILocation(line: 352, column: 14, scope: !384)
!415 = !DILocation(line: 352, column: 8, scope: !384)
!416 = !DILocation(line: 352, column: 32, scope: !417)
!417 = !DILexicalBlockFile(scope: !384, file: !65, discriminator: 1)
!418 = !DILocation(line: 352, column: 31, scope: !417)
!419 = !DILocation(line: 352, column: 8, scope: !417)
!420 = !DILocation(line: 352, column: 38, scope: !421)
!421 = !DILexicalBlockFile(scope: !384, file: !65, discriminator: 2)
!422 = !DILocation(line: 352, column: 8, scope: !421)
!423 = !DILocation(line: 352, column: 8, scope: !424)
!424 = !DILexicalBlockFile(scope: !384, file: !65, discriminator: 3)
!425 = !DILocation(line: 352, column: 3, scope: !424)
!426 = !DILocation(line: 352, column: 5, scope: !424)
!427 = !DILocation(line: 356, column: 7, scope: !384)
!428 = !DILocation(line: 356, column: 5, scope: !384)
!429 = !DILocation(line: 357, column: 2, scope: !384)
!430 = !DILocation(line: 357, column: 9, scope: !417)
!431 = !DILocation(line: 357, column: 2, scope: !417)
!432 = !DILocation(line: 359, column: 2, scope: !433)
!433 = distinct !DILexicalBlock(scope: !384, file: !65, line: 358, column: 2)
!434 = !DILocation(line: 359, column: 6, scope: !433)
!435 = !DILocation(line: 359, column: 4, scope: !433)
!436 = !DILocation(line: 359, column: 60, scope: !433)
!437 = !DILocation(line: 359, column: 11, scope: !433)
!438 = !DILocation(line: 359, column: 5, scope: !433)
!439 = !DILocation(line: 359, column: 39, scope: !433)
!440 = !DILocation(line: 360, column: 12, scope: !433)
!441 = !DILocation(line: 360, column: 11, scope: !433)
!442 = !DILocation(line: 360, column: 18, scope: !433)
!443 = !DILocation(line: 360, column: 22, scope: !433)
!444 = !DILocation(line: 360, column: 15, scope: !433)
!445 = !DILocation(line: 360, column: 9, scope: !433)
!446 = !DILocation(line: 360, column: 33, scope: !447)
!447 = !DILexicalBlockFile(scope: !433, file: !65, discriminator: 1)
!448 = !DILocation(line: 360, column: 32, scope: !447)
!449 = !DILocation(line: 360, column: 9, scope: !447)
!450 = !DILocation(line: 360, column: 39, scope: !451)
!451 = !DILexicalBlockFile(scope: !433, file: !65, discriminator: 2)
!452 = !DILocation(line: 360, column: 43, scope: !451)
!453 = !DILocation(line: 360, column: 9, scope: !451)
!454 = !DILocation(line: 360, column: 9, scope: !455)
!455 = !DILexicalBlockFile(scope: !433, file: !65, discriminator: 3)
!456 = !DILocation(line: 360, column: 4, scope: !455)
!457 = !DILocation(line: 360, column: 6, scope: !455)
!458 = !DILocation(line: 361, column: 8, scope: !433)
!459 = !DILocation(line: 361, column: 12, scope: !433)
!460 = !DILocation(line: 361, column: 6, scope: !433)
!461 = !DILocation(line: 357, column: 2, scope: !421)
!462 = distinct !{!462, !429}
!463 = !DILocation(line: 363, column: 1, scope: !384)
!464 = distinct !DISubprogram(name: "ctrl_check_fds", scope: !65, file: !65, line: 366, type: !465, isLocal: false, isDefinition: true, scopeLine: 367, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!465 = !DISubroutineType(types: !466)
!466 = !{null, !388, !388}
!467 = !DILocalVariable(name: "rfds", arg: 1, scope: !464, file: !65, line: 366, type: !388)
!468 = !DILocation(line: 366, column: 25, scope: !464)
!469 = !DILocalVariable(name: "wfds", arg: 2, scope: !464, file: !65, line: 366, type: !388)
!470 = !DILocation(line: 366, column: 40, scope: !464)
!471 = !DILocation(line: 368, column: 9, scope: !464)
!472 = !DILocalVariable(name: "ns", scope: !464, file: !65, line: 369, type: !58)
!473 = !DILocation(line: 369, column: 6, scope: !464)
!474 = !DILocalVariable(name: "res", scope: !464, file: !65, line: 369, type: !58)
!475 = !DILocation(line: 369, column: 10, scope: !464)
!476 = !DILocalVariable(name: "offs", scope: !464, file: !65, line: 369, type: !58)
!477 = !DILocation(line: 369, column: 15, scope: !464)
!478 = !DILocalVariable(name: "fsaun", scope: !464, file: !65, line: 370, type: !144)
!479 = !DILocation(line: 370, column: 21, scope: !464)
!480 = !DILocalVariable(name: "fromlen", scope: !464, file: !65, line: 371, type: !481)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !44, line: 33, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !108, line: 189, baseType: !76)
!483 = !DILocation(line: 371, column: 12, scope: !464)
!484 = !DILocalVariable(name: "it", scope: !464, file: !65, line: 372, type: !63)
!485 = !DILocation(line: 372, column: 17, scope: !464)
!486 = !DILocation(line: 374, column: 6, scope: !487)
!487 = distinct !DILexicalBlock(scope: !464, file: !65, line: 374, column: 6)
!488 = !DILocation(line: 374, column: 15, scope: !487)
!489 = !DILocation(line: 374, column: 6, scope: !464)
!490 = !DILocation(line: 375, column: 3, scope: !487)
!491 = !DILocation(line: 377, column: 2, scope: !464)
!492 = !DILocation(line: 380, column: 5, scope: !493)
!493 = distinct !DILexicalBlock(scope: !464, file: !65, line: 380, column: 5)
!494 = !DILocation(line: 380, column: 7, scope: !493)
!495 = !DILocation(line: 380, column: 8, scope: !493)
!496 = !DILocation(line: 380, column: 62, scope: !493)
!497 = !DILocation(line: 380, column: 42, scope: !493)
!498 = !DILocation(line: 380, column: 44, scope: !493)
!499 = !DILocation(line: 380, column: 5, scope: !464)
!500 = !DILocation(line: 382, column: 2, scope: !501)
!501 = distinct !DILexicalBlock(scope: !493, file: !65, line: 381, column: 2)
!502 = !DILocation(line: 382, column: 4, scope: !501)
!503 = !DILocation(line: 382, column: 61, scope: !501)
!504 = !DILocation(line: 382, column: 42, scope: !501)
!505 = !DILocation(line: 382, column: 11, scope: !501)
!506 = !DILocation(line: 382, column: 5, scope: !501)
!507 = !DILocation(line: 382, column: 39, scope: !501)
!508 = !DILocation(line: 383, column: 11, scope: !501)
!509 = !DILocation(line: 384, column: 15, scope: !501)
!510 = !DILocation(line: 384, column: 25, scope: !501)
!511 = !DILocation(line: 384, column: 8, scope: !501)
!512 = !DILocation(line: 384, column: 6, scope: !501)
!513 = !DILocation(line: 385, column: 7, scope: !514)
!514 = distinct !DILexicalBlock(scope: !501, file: !65, line: 385, column: 7)
!515 = !DILocation(line: 385, column: 10, scope: !514)
!516 = !DILocation(line: 385, column: 7, scope: !501)
!517 = !DILocation(line: 388, column: 21, scope: !518)
!518 = distinct !DILexicalBlock(scope: !514, file: !65, line: 386, column: 3)
!519 = !DILocation(line: 388, column: 20, scope: !518)
!520 = !DILocation(line: 388, column: 11, scope: !521)
!521 = !DILexicalBlockFile(scope: !518, file: !65, discriminator: 1)
!522 = !DILocation(line: 387, column: 4, scope: !518)
!523 = !DILocation(line: 389, column: 4, scope: !518)
!524 = !DILocation(line: 392, column: 19, scope: !501)
!525 = !DILocation(line: 392, column: 3, scope: !501)
!526 = !DILocation(line: 393, column: 3, scope: !501)
!527 = !DILocation(line: 397, column: 7, scope: !464)
!528 = !DILocation(line: 397, column: 5, scope: !464)
!529 = !DILocation(line: 398, column: 2, scope: !464)
!530 = !DILocation(line: 398, column: 9, scope: !531)
!531 = !DILexicalBlockFile(scope: !464, file: !65, discriminator: 1)
!532 = !DILocation(line: 398, column: 2, scope: !531)
!533 = !DILocation(line: 400, column: 6, scope: !534)
!534 = distinct !DILexicalBlock(scope: !535, file: !65, line: 400, column: 6)
!535 = distinct !DILexicalBlock(scope: !464, file: !65, line: 399, column: 2)
!536 = !DILocation(line: 400, column: 10, scope: !534)
!537 = !DILocation(line: 400, column: 8, scope: !534)
!538 = !DILocation(line: 400, column: 9, scope: !534)
!539 = !DILocation(line: 400, column: 63, scope: !534)
!540 = !DILocation(line: 400, column: 43, scope: !534)
!541 = !DILocation(line: 400, column: 45, scope: !534)
!542 = !DILocation(line: 400, column: 6, scope: !535)
!543 = !DILocation(line: 402, column: 18, scope: !544)
!544 = distinct !DILexicalBlock(scope: !534, file: !65, line: 401, column: 3)
!545 = !DILocation(line: 402, column: 22, scope: !544)
!546 = !DILocation(line: 402, column: 11, scope: !544)
!547 = !DILocation(line: 402, column: 9, scope: !544)
!548 = !DILocation(line: 403, column: 15, scope: !544)
!549 = !DILocation(line: 403, column: 19, scope: !544)
!550 = !DILocation(line: 403, column: 25, scope: !544)
!551 = !DILocation(line: 403, column: 29, scope: !544)
!552 = !DILocation(line: 403, column: 39, scope: !544)
!553 = !DILocation(line: 403, column: 37, scope: !544)
!554 = !DILocation(line: 403, column: 52, scope: !544)
!555 = !DILocation(line: 403, column: 50, scope: !544)
!556 = !DILocation(line: 403, column: 45, scope: !544)
!557 = !DILocation(line: 403, column: 10, scope: !544)
!558 = !DILocation(line: 403, column: 8, scope: !544)
!559 = !DILocation(line: 404, column: 3, scope: !544)
!560 = !DILocation(line: 404, column: 7, scope: !544)
!561 = !DILocation(line: 404, column: 5, scope: !544)
!562 = !DILocation(line: 404, column: 62, scope: !544)
!563 = !DILocation(line: 404, column: 43, scope: !544)
!564 = !DILocation(line: 404, column: 12, scope: !544)
!565 = !DILocation(line: 404, column: 6, scope: !544)
!566 = !DILocation(line: 404, column: 40, scope: !544)
!567 = !DILocation(line: 407, column: 8, scope: !568)
!568 = distinct !DILexicalBlock(scope: !544, file: !65, line: 407, column: 8)
!569 = !DILocation(line: 407, column: 12, scope: !568)
!570 = !DILocation(line: 407, column: 30, scope: !568)
!571 = !DILocation(line: 407, column: 38, scope: !568)
!572 = !DILocation(line: 408, column: 8, scope: !568)
!573 = !DILocation(line: 408, column: 12, scope: !568)
!574 = !DILocation(line: 408, column: 30, scope: !568)
!575 = !DILocation(line: 407, column: 8, scope: !576)
!576 = !DILexicalBlockFile(scope: !544, file: !65, discriminator: 1)
!577 = !DILocation(line: 410, column: 28, scope: !578)
!578 = distinct !DILexicalBlock(scope: !568, file: !65, line: 409, column: 4)
!579 = !DILocation(line: 410, column: 32, scope: !578)
!580 = !DILocation(line: 410, column: 5, scope: !578)
!581 = !DILocation(line: 411, column: 5, scope: !578)
!582 = !DILocation(line: 414, column: 8, scope: !583)
!583 = distinct !DILexicalBlock(scope: !544, file: !65, line: 414, column: 8)
!584 = !DILocation(line: 414, column: 12, scope: !583)
!585 = !DILocation(line: 414, column: 8, scope: !544)
!586 = !DILocalVariable(name: "p", scope: !587, file: !65, line: 417, type: !161)
!587 = distinct !DILexicalBlock(scope: !583, file: !65, line: 415, column: 4)
!588 = !DILocation(line: 417, column: 11, scope: !587)
!589 = !DILocation(line: 418, column: 21, scope: !590)
!590 = distinct !DILexicalBlock(scope: !587, file: !65, line: 418, column: 9)
!591 = !DILocation(line: 418, column: 25, scope: !590)
!592 = !DILocation(line: 418, column: 14, scope: !590)
!593 = !DILocation(line: 418, column: 12, scope: !590)
!594 = !DILocation(line: 418, column: 41, scope: !590)
!595 = !DILocation(line: 418, column: 9, scope: !587)
!596 = !DILocation(line: 419, column: 6, scope: !590)
!597 = distinct !{!597, !529}
!598 = !DILocation(line: 422, column: 5, scope: !587)
!599 = !DILocation(line: 422, column: 12, scope: !600)
!600 = !DILexicalBlockFile(scope: !587, file: !65, discriminator: 1)
!601 = !DILocation(line: 422, column: 5, scope: !600)
!602 = !DILocation(line: 425, column: 10, scope: !603)
!603 = distinct !DILexicalBlock(scope: !604, file: !65, line: 425, column: 10)
!604 = distinct !DILexicalBlock(scope: !587, file: !65, line: 423, column: 5)
!605 = !DILocation(line: 425, column: 14, scope: !603)
!606 = !DILocation(line: 425, column: 18, scope: !603)
!607 = !DILocation(line: 425, column: 12, scope: !603)
!608 = !DILocation(line: 425, column: 26, scope: !603)
!609 = !DILocation(line: 425, column: 31, scope: !610)
!610 = !DILexicalBlockFile(scope: !603, file: !65, discriminator: 1)
!611 = !DILocation(line: 425, column: 33, scope: !610)
!612 = !DILocation(line: 425, column: 29, scope: !610)
!613 = !DILocation(line: 425, column: 38, scope: !610)
!614 = !DILocation(line: 425, column: 10, scope: !610)
!615 = !DILocation(line: 426, column: 7, scope: !603)
!616 = !DILocation(line: 427, column: 17, scope: !604)
!617 = !DILocation(line: 427, column: 19, scope: !604)
!618 = !DILocation(line: 427, column: 10, scope: !604)
!619 = !DILocation(line: 427, column: 8, scope: !604)
!620 = !DILocation(line: 422, column: 5, scope: !621)
!621 = !DILexicalBlockFile(scope: !587, file: !65, discriminator: 2)
!622 = distinct !{!622, !598}
!623 = !DILocation(line: 431, column: 9, scope: !624)
!624 = distinct !DILexicalBlock(scope: !587, file: !65, line: 431, column: 9)
!625 = !DILocation(line: 431, column: 11, scope: !624)
!626 = !DILocation(line: 431, column: 9, scope: !587)
!627 = !DILocation(line: 432, column: 6, scope: !624)
!628 = !DILocation(line: 435, column: 6, scope: !587)
!629 = !DILocation(line: 435, column: 8, scope: !587)
!630 = !DILocation(line: 436, column: 28, scope: !587)
!631 = !DILocation(line: 436, column: 5, scope: !587)
!632 = !DILocation(line: 437, column: 12, scope: !587)
!633 = !DILocation(line: 437, column: 16, scope: !587)
!634 = !DILocation(line: 437, column: 5, scope: !587)
!635 = !DILocation(line: 438, column: 4, scope: !587)
!636 = !DILocation(line: 442, column: 28, scope: !637)
!637 = distinct !DILexicalBlock(scope: !583, file: !65, line: 440, column: 4)
!638 = !DILocation(line: 442, column: 32, scope: !637)
!639 = !DILocation(line: 442, column: 5, scope: !637)
!640 = !DILocation(line: 443, column: 5, scope: !637)
!641 = !DILocation(line: 445, column: 3, scope: !544)
!642 = !DILocation(line: 446, column: 8, scope: !535)
!643 = !DILocation(line: 446, column: 12, scope: !535)
!644 = !DILocation(line: 446, column: 6, scope: !535)
!645 = !DILocation(line: 398, column: 2, scope: !646)
!646 = !DILexicalBlockFile(scope: !464, file: !65, discriminator: 2)
!647 = !DILocation(line: 448, column: 1, scope: !464)
!648 = distinct !DISubprogram(name: "_ctrl_slave_new", scope: !65, file: !65, line: 61, type: !649, isLocal: true, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !58}
!651 = !DILocalVariable(name: "sock", arg: 1, scope: !648, file: !65, line: 61, type: !58)
!652 = !DILocation(line: 61, column: 21, scope: !648)
!653 = !DILocalVariable(name: "it", scope: !648, file: !65, line: 63, type: !63)
!654 = !DILocation(line: 63, column: 17, scope: !648)
!655 = !DILocalVariable(name: "ns", scope: !648, file: !65, line: 63, type: !63)
!656 = !DILocation(line: 63, column: 22, scope: !648)
!657 = !DILocation(line: 66, column: 25, scope: !648)
!658 = !DILocation(line: 66, column: 7, scope: !648)
!659 = !DILocation(line: 66, column: 5, scope: !648)
!660 = !DILocation(line: 67, column: 9, scope: !648)
!661 = !DILocation(line: 67, column: 2, scope: !648)
!662 = !DILocation(line: 68, column: 13, scope: !648)
!663 = !DILocation(line: 68, column: 2, scope: !648)
!664 = !DILocation(line: 68, column: 6, scope: !648)
!665 = !DILocation(line: 68, column: 11, scope: !648)
!666 = !DILocation(line: 71, column: 7, scope: !648)
!667 = !DILocation(line: 71, column: 5, scope: !648)
!668 = !DILocation(line: 74, column: 2, scope: !648)
!669 = !DILocation(line: 74, column: 9, scope: !670)
!670 = !DILexicalBlockFile(scope: !648, file: !65, discriminator: 1)
!671 = !DILocation(line: 74, column: 12, scope: !670)
!672 = !DILocation(line: 74, column: 15, scope: !673)
!673 = !DILexicalBlockFile(scope: !648, file: !65, discriminator: 2)
!674 = !DILocation(line: 74, column: 19, scope: !673)
!675 = !DILocation(line: 74, column: 12, scope: !673)
!676 = !DILocation(line: 74, column: 2, scope: !677)
!677 = !DILexicalBlockFile(scope: !648, file: !65, discriminator: 3)
!678 = !DILocation(line: 75, column: 8, scope: !648)
!679 = !DILocation(line: 75, column: 12, scope: !648)
!680 = !DILocation(line: 75, column: 6, scope: !648)
!681 = !DILocation(line: 74, column: 2, scope: !682)
!682 = !DILexicalBlockFile(scope: !648, file: !65, discriminator: 4)
!683 = distinct !{!683, !668}
!684 = !DILocation(line: 78, column: 6, scope: !685)
!685 = distinct !DILexicalBlock(scope: !648, file: !65, line: 78, column: 6)
!686 = !DILocation(line: 78, column: 6, scope: !648)
!687 = !DILocation(line: 80, column: 14, scope: !688)
!688 = distinct !DILexicalBlock(scope: !685, file: !65, line: 79, column: 2)
!689 = !DILocation(line: 80, column: 3, scope: !688)
!690 = !DILocation(line: 80, column: 7, scope: !688)
!691 = !DILocation(line: 80, column: 12, scope: !688)
!692 = !DILocation(line: 81, column: 14, scope: !688)
!693 = !DILocation(line: 81, column: 3, scope: !688)
!694 = !DILocation(line: 81, column: 7, scope: !688)
!695 = !DILocation(line: 81, column: 12, scope: !688)
!696 = !DILocation(line: 82, column: 2, scope: !688)
!697 = !DILocation(line: 86, column: 18, scope: !698)
!698 = distinct !DILexicalBlock(scope: !685, file: !65, line: 84, column: 2)
!699 = !DILocation(line: 86, column: 16, scope: !698)
!700 = !DILocation(line: 88, column: 1, scope: !648)
!701 = distinct !DISubprogram(name: "_ctrl_slave_disconnect", scope: !65, file: !65, line: 91, type: !649, isLocal: true, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!702 = !DILocalVariable(name: "sock", arg: 1, scope: !701, file: !65, line: 91, type: !58)
!703 = !DILocation(line: 91, column: 28, scope: !701)
!704 = !DILocalVariable(name: "it", scope: !701, file: !65, line: 93, type: !63)
!705 = !DILocation(line: 93, column: 17, scope: !701)
!706 = !DILocation(line: 95, column: 7, scope: !707)
!707 = distinct !DILexicalBlock(scope: !701, file: !65, line: 95, column: 6)
!708 = !DILocation(line: 95, column: 6, scope: !701)
!709 = !DILocation(line: 96, column: 3, scope: !707)
!710 = !DILocation(line: 98, column: 7, scope: !701)
!711 = !DILocation(line: 98, column: 5, scope: !701)
!712 = !DILocation(line: 101, column: 2, scope: !701)
!713 = !DILocation(line: 101, column: 9, scope: !714)
!714 = !DILexicalBlockFile(scope: !701, file: !65, discriminator: 1)
!715 = !DILocation(line: 101, column: 13, scope: !714)
!716 = !DILocation(line: 101, column: 18, scope: !714)
!717 = !DILocation(line: 101, column: 21, scope: !718)
!718 = !DILexicalBlockFile(scope: !701, file: !65, discriminator: 2)
!719 = !DILocation(line: 101, column: 25, scope: !718)
!720 = !DILocation(line: 101, column: 33, scope: !718)
!721 = !DILocation(line: 101, column: 30, scope: !718)
!722 = !DILocation(line: 101, column: 2, scope: !723)
!723 = !DILexicalBlockFile(scope: !701, file: !65, discriminator: 3)
!724 = !DILocation(line: 102, column: 8, scope: !701)
!725 = !DILocation(line: 102, column: 12, scope: !701)
!726 = !DILocation(line: 102, column: 6, scope: !701)
!727 = !DILocation(line: 101, column: 2, scope: !728)
!728 = !DILexicalBlockFile(scope: !701, file: !65, discriminator: 4)
!729 = distinct !{!729, !712}
!730 = !DILocation(line: 104, column: 6, scope: !731)
!731 = distinct !DILexicalBlock(scope: !701, file: !65, line: 104, column: 6)
!732 = !DILocation(line: 104, column: 10, scope: !731)
!733 = !DILocation(line: 104, column: 18, scope: !731)
!734 = !DILocation(line: 104, column: 15, scope: !731)
!735 = !DILocation(line: 104, column: 6, scope: !701)
!736 = !DILocation(line: 107, column: 12, scope: !737)
!737 = distinct !DILexicalBlock(scope: !731, file: !65, line: 105, column: 2)
!738 = !DILocation(line: 107, column: 3, scope: !737)
!739 = !DILocation(line: 108, column: 9, scope: !737)
!740 = !DILocation(line: 108, column: 3, scope: !737)
!741 = !DILocation(line: 111, column: 7, scope: !742)
!742 = distinct !DILexicalBlock(scope: !737, file: !65, line: 111, column: 7)
!743 = !DILocation(line: 111, column: 13, scope: !742)
!744 = !DILocation(line: 111, column: 10, scope: !742)
!745 = !DILocation(line: 111, column: 7, scope: !737)
!746 = !DILocation(line: 113, column: 8, scope: !747)
!747 = distinct !DILexicalBlock(scope: !748, file: !65, line: 113, column: 8)
!748 = distinct !DILexicalBlock(scope: !742, file: !65, line: 112, column: 3)
!749 = !DILocation(line: 113, column: 12, scope: !747)
!750 = !DILocation(line: 113, column: 8, scope: !748)
!751 = !DILocation(line: 114, column: 20, scope: !747)
!752 = !DILocation(line: 114, column: 24, scope: !747)
!753 = !DILocation(line: 114, column: 18, scope: !747)
!754 = !DILocation(line: 114, column: 5, scope: !747)
!755 = !DILocation(line: 116, column: 18, scope: !747)
!756 = !DILocation(line: 117, column: 3, scope: !748)
!757 = !DILocation(line: 119, column: 7, scope: !758)
!758 = distinct !DILexicalBlock(scope: !737, file: !65, line: 119, column: 7)
!759 = !DILocation(line: 119, column: 11, scope: !758)
!760 = !DILocation(line: 119, column: 7, scope: !737)
!761 = !DILocation(line: 121, column: 23, scope: !762)
!762 = distinct !DILexicalBlock(scope: !758, file: !65, line: 120, column: 3)
!763 = !DILocation(line: 121, column: 27, scope: !762)
!764 = !DILocation(line: 121, column: 5, scope: !762)
!765 = !DILocation(line: 121, column: 9, scope: !762)
!766 = !DILocation(line: 121, column: 16, scope: !762)
!767 = !DILocation(line: 121, column: 21, scope: !762)
!768 = !DILocation(line: 122, column: 8, scope: !769)
!769 = distinct !DILexicalBlock(scope: !762, file: !65, line: 122, column: 8)
!770 = !DILocation(line: 122, column: 12, scope: !769)
!771 = !DILocation(line: 122, column: 8, scope: !762)
!772 = !DILocation(line: 123, column: 24, scope: !769)
!773 = !DILocation(line: 123, column: 28, scope: !769)
!774 = !DILocation(line: 123, column: 6, scope: !769)
!775 = !DILocation(line: 123, column: 10, scope: !769)
!776 = !DILocation(line: 123, column: 17, scope: !769)
!777 = !DILocation(line: 123, column: 22, scope: !769)
!778 = !DILocation(line: 123, column: 5, scope: !769)
!779 = !DILocation(line: 124, column: 3, scope: !762)
!780 = !DILocation(line: 125, column: 12, scope: !781)
!781 = distinct !DILexicalBlock(scope: !758, file: !65, line: 125, column: 12)
!782 = !DILocation(line: 125, column: 16, scope: !781)
!783 = !DILocation(line: 125, column: 12, scope: !758)
!784 = !DILocation(line: 126, column: 5, scope: !781)
!785 = !DILocation(line: 126, column: 9, scope: !781)
!786 = !DILocation(line: 126, column: 16, scope: !781)
!787 = !DILocation(line: 126, column: 21, scope: !781)
!788 = !DILocation(line: 126, column: 4, scope: !781)
!789 = !DILocation(line: 128, column: 9, scope: !737)
!790 = !DILocation(line: 128, column: 3, scope: !737)
!791 = !DILocation(line: 130, column: 2, scope: !737)
!792 = !DILocation(line: 131, column: 1, scope: !701)
!793 = distinct !DISubprogram(name: "_ctrl_dispatch_command", scope: !65, file: !65, line: 149, type: !794, isLocal: true, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!794 = !DISubroutineType(types: !795)
!795 = !{null, !63}
!796 = !DILocalVariable(name: "slave", arg: 1, scope: !793, file: !65, line: 149, type: !63)
!797 = !DILocation(line: 149, column: 40, scope: !793)
!798 = !DILocalVariable(name: "p", scope: !793, file: !65, line: 151, type: !161)
!799 = !DILocation(line: 151, column: 8, scope: !793)
!800 = !DILocalVariable(name: "cmd", scope: !793, file: !65, line: 152, type: !161)
!801 = !DILocation(line: 152, column: 8, scope: !793)
!802 = !DILocalVariable(name: "res", scope: !793, file: !65, line: 153, type: !76)
!803 = !DILocation(line: 153, column: 15, scope: !793)
!804 = !DILocation(line: 156, column: 30, scope: !793)
!805 = !DILocation(line: 156, column: 37, scope: !793)
!806 = !DILocation(line: 156, column: 8, scope: !793)
!807 = !DILocation(line: 156, column: 6, scope: !793)
!808 = !DILocation(line: 157, column: 14, scope: !809)
!809 = distinct !DILexicalBlock(scope: !793, file: !65, line: 157, column: 6)
!810 = !DILocation(line: 157, column: 6, scope: !809)
!811 = !DILocation(line: 157, column: 71, scope: !809)
!812 = !DILocation(line: 157, column: 6, scope: !793)
!813 = !DILocation(line: 160, column: 14, scope: !814)
!814 = distinct !DILexicalBlock(scope: !809, file: !65, line: 158, column: 2)
!815 = !DILocation(line: 160, column: 7, scope: !814)
!816 = !DILocation(line: 160, column: 5, scope: !814)
!817 = !DILocation(line: 161, column: 7, scope: !818)
!818 = distinct !DILexicalBlock(scope: !814, file: !65, line: 161, column: 7)
!819 = !DILocation(line: 161, column: 7, scope: !814)
!820 = !DILocation(line: 162, column: 6, scope: !818)
!821 = !DILocation(line: 162, column: 4, scope: !818)
!822 = !DILocation(line: 164, column: 8, scope: !818)
!823 = !DILocation(line: 164, column: 12, scope: !818)
!824 = !DILocation(line: 164, column: 39, scope: !818)
!825 = !DILocation(line: 164, column: 6, scope: !818)
!826 = !DILocation(line: 166, column: 7, scope: !814)
!827 = !DILocation(line: 168, column: 27, scope: !828)
!828 = distinct !DILexicalBlock(scope: !814, file: !65, line: 168, column: 7)
!829 = !DILocation(line: 168, column: 7, scope: !828)
!830 = !DILocation(line: 168, column: 30, scope: !828)
!831 = !DILocation(line: 168, column: 7, scope: !814)
!832 = !DILocation(line: 169, column: 8, scope: !828)
!833 = !DILocation(line: 169, column: 4, scope: !828)
!834 = !DILocation(line: 170, column: 2, scope: !814)
!835 = !DILocation(line: 173, column: 7, scope: !836)
!836 = distinct !DILexicalBlock(scope: !809, file: !65, line: 172, column: 2)
!837 = !DILocation(line: 175, column: 8, scope: !793)
!838 = !DILocation(line: 175, column: 2, scope: !793)
!839 = !DILocation(line: 177, column: 23, scope: !793)
!840 = !DILocation(line: 177, column: 30, scope: !793)
!841 = !DILocation(line: 177, column: 2, scope: !793)
!842 = !DILocation(line: 178, column: 1, scope: !793)
!843 = distinct !DISubprogram(name: "ctrl_send_command", scope: !65, file: !65, line: 451, type: !844, isLocal: false, isDefinition: true, scopeLine: 452, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!844 = !DISubroutineType(types: !845)
!845 = !{!58, !92, !92}
!846 = !DILocalVariable(name: "cmd", arg: 1, scope: !843, file: !65, line: 451, type: !92)
!847 = !DILocation(line: 451, column: 31, scope: !843)
!848 = !DILocalVariable(name: "arg", arg: 2, scope: !843, file: !65, line: 451, type: !92)
!849 = !DILocation(line: 451, column: 48, scope: !843)
!850 = !DILocalVariable(name: "fp", scope: !843, file: !65, line: 453, type: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64, align: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !853, line: 48, baseType: !854)
!853 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !855, line: 241, size: 1728, align: 64, elements: !856)
!855 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!856 = !{!857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !877, !878, !879, !880, !881, !882, !884, !888, !891, !893, !894, !895, !896, !897, !898, !899}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !854, file: !855, line: 242, baseType: !58, size: 32, align: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !854, file: !855, line: 247, baseType: !161, size: 64, align: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !854, file: !855, line: 248, baseType: !161, size: 64, align: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !854, file: !855, line: 249, baseType: !161, size: 64, align: 64, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !854, file: !855, line: 250, baseType: !161, size: 64, align: 64, offset: 256)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !854, file: !855, line: 251, baseType: !161, size: 64, align: 64, offset: 320)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !854, file: !855, line: 252, baseType: !161, size: 64, align: 64, offset: 384)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !854, file: !855, line: 253, baseType: !161, size: 64, align: 64, offset: 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !854, file: !855, line: 254, baseType: !161, size: 64, align: 64, offset: 512)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !854, file: !855, line: 256, baseType: !161, size: 64, align: 64, offset: 576)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !854, file: !855, line: 257, baseType: !161, size: 64, align: 64, offset: 640)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !854, file: !855, line: 258, baseType: !161, size: 64, align: 64, offset: 704)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !854, file: !855, line: 260, baseType: !870, size: 64, align: 64, offset: 768)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64, align: 64)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !855, line: 156, size: 192, align: 64, elements: !872)
!872 = !{!873, !874, !876}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !871, file: !855, line: 157, baseType: !870, size: 64, align: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !871, file: !855, line: 158, baseType: !875, size: 64, align: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64, align: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !871, file: !855, line: 162, baseType: !58, size: 32, align: 32, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !854, file: !855, line: 262, baseType: !875, size: 64, align: 64, offset: 832)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !854, file: !855, line: 264, baseType: !58, size: 32, align: 32, offset: 896)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !854, file: !855, line: 268, baseType: !58, size: 32, align: 32, offset: 928)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !854, file: !855, line: 270, baseType: !123, size: 64, align: 64, offset: 960)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !854, file: !855, line: 274, baseType: !49, size: 16, align: 16, offset: 1024)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !854, file: !855, line: 275, baseType: !883, size: 8, align: 8, offset: 1040)
!883 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !854, file: !855, line: 276, baseType: !885, size: 8, align: 8, offset: 1048)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8, align: 8, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 1)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !854, file: !855, line: 280, baseType: !889, size: 64, align: 64, offset: 1088)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64, align: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !855, line: 150, baseType: null)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !854, file: !855, line: 289, baseType: !892, size: 64, align: 64, offset: 1152)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !108, line: 132, baseType: !57)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !854, file: !855, line: 297, baseType: !41, size: 64, align: 64, offset: 1216)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !854, file: !855, line: 298, baseType: !41, size: 64, align: 64, offset: 1280)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !854, file: !855, line: 299, baseType: !41, size: 64, align: 64, offset: 1344)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !854, file: !855, line: 300, baseType: !41, size: 64, align: 64, offset: 1408)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !854, file: !855, line: 302, baseType: !273, size: 64, align: 64, offset: 1472)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !854, file: !855, line: 303, baseType: !58, size: 32, align: 32, offset: 1536)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !854, file: !855, line: 305, baseType: !900, size: 160, align: 8, offset: 1568)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 160, align: 8, elements: !305)
!901 = !DILocation(line: 453, column: 8, scope: !843)
!902 = !DILocalVariable(name: "saun", scope: !843, file: !65, line: 454, type: !144)
!903 = !DILocation(line: 454, column: 21, scope: !843)
!904 = !DILocalVariable(name: "s", scope: !843, file: !65, line: 455, type: !58)
!905 = !DILocation(line: 455, column: 6, scope: !843)
!906 = !DILocalVariable(name: "len", scope: !843, file: !65, line: 455, type: !58)
!907 = !DILocation(line: 455, column: 9, scope: !843)
!908 = !DILocalVariable(name: "index", scope: !843, file: !65, line: 455, type: !58)
!909 = !DILocation(line: 455, column: 14, scope: !843)
!910 = !DILocalVariable(name: "ret", scope: !843, file: !65, line: 455, type: !58)
!911 = !DILocation(line: 455, column: 21, scope: !843)
!912 = !DILocalVariable(name: "data", scope: !843, file: !65, line: 456, type: !73)
!913 = !DILocation(line: 456, column: 7, scope: !843)
!914 = !DILocalVariable(name: "tmp", scope: !843, file: !65, line: 456, type: !73)
!915 = !DILocation(line: 456, column: 19, scope: !843)
!916 = !DILocalVariable(name: "result", scope: !843, file: !65, line: 457, type: !917)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 256, align: 8, elements: !918)
!918 = !{!919}
!919 = !DISubrange(count: 32)
!920 = !DILocation(line: 457, column: 7, scope: !843)
!921 = !DILocalVariable(name: "c", scope: !843, file: !65, line: 457, type: !52)
!922 = !DILocation(line: 457, column: 19, scope: !843)
!923 = !DILocalVariable(name: "escaped", scope: !843, file: !65, line: 457, type: !161)
!924 = !DILocation(line: 457, column: 23, scope: !843)
!925 = !DILocation(line: 459, column: 10, scope: !843)
!926 = !DILocation(line: 461, column: 7, scope: !927)
!927 = distinct !DILexicalBlock(scope: !843, file: !65, line: 461, column: 6)
!928 = !DILocation(line: 461, column: 6, scope: !843)
!929 = !DILocation(line: 462, column: 3, scope: !927)
!930 = !DILocation(line: 464, column: 11, scope: !931)
!931 = distinct !DILexicalBlock(scope: !843, file: !65, line: 464, column: 6)
!932 = !DILocation(line: 464, column: 9, scope: !931)
!933 = !DILocation(line: 464, column: 43, scope: !931)
!934 = !DILocation(line: 464, column: 6, scope: !843)
!935 = !DILocation(line: 466, column: 77, scope: !936)
!936 = distinct !DILexicalBlock(scope: !931, file: !65, line: 465, column: 2)
!937 = !DILocation(line: 466, column: 76, scope: !936)
!938 = !DILocation(line: 466, column: 67, scope: !939)
!939 = !DILexicalBlockFile(scope: !936, file: !65, discriminator: 1)
!940 = !DILocation(line: 466, column: 3, scope: !941)
!941 = !DILexicalBlockFile(scope: !936, file: !65, discriminator: 2)
!942 = !DILocation(line: 467, column: 3, scope: !936)
!943 = !DILocation(line: 470, column: 2, scope: !843)
!944 = !DILocation(line: 471, column: 7, scope: !843)
!945 = !DILocation(line: 471, column: 18, scope: !843)
!946 = !DILocation(line: 472, column: 14, scope: !843)
!947 = !DILocation(line: 472, column: 9, scope: !843)
!948 = !DILocation(line: 472, column: 2, scope: !843)
!949 = !DILocation(line: 473, column: 46, scope: !843)
!950 = !DILocation(line: 473, column: 41, scope: !843)
!951 = !DILocation(line: 473, column: 34, scope: !843)
!952 = !DILocation(line: 473, column: 32, scope: !843)
!953 = !DILocation(line: 473, column: 8, scope: !843)
!954 = !DILocation(line: 473, column: 6, scope: !843)
!955 = !DILocation(line: 475, column: 14, scope: !956)
!956 = distinct !DILexicalBlock(scope: !843, file: !65, line: 475, column: 6)
!957 = !DILocation(line: 475, column: 17, scope: !956)
!958 = !DILocation(line: 475, column: 44, scope: !956)
!959 = !DILocation(line: 475, column: 6, scope: !956)
!960 = !DILocation(line: 475, column: 49, scope: !956)
!961 = !DILocation(line: 475, column: 6, scope: !843)
!962 = !DILocation(line: 477, column: 78, scope: !963)
