; ModuleID = './[inter]channels.o.i'
source_filename = "./[inter]channels.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._VCHANNEL = type { i16, [8 x i8], i32, %struct.stream, void (%struct.stream*)* }
%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }

@g_rdp_version = external global i32, align 4
@g_num_channels = common global i32 0, align 4
@.str = private unnamed_addr constant [62 x i8] c"channel_register(), channel table full, increase MAX_CHANNELS\00", align 1
@g_channels = common global [6 x %struct._VCHANNEL] zeroinitializer, align 16
@g_encryption = external global i32, align 4
@.str.1 = private unnamed_addr constant [42 x i8] c"channel_send(), channel = %d, length = %d\00", align 1
@.str.2 = private unnamed_addr constant [53 x i8] c"channel_send(), sending %d bytes with FLAG_FIRST set\00", align 1
@.str.3 = private unnamed_addr constant [49 x i8] c"channel_send(), sending %d bytes with flags 0x%x\00", align 1

; Function Attrs: nounwind uwtable
define %struct._VCHANNEL* @channel_register(i8*, i32, void (%struct.stream*)*) #0 !dbg !77 {
  %4 = alloca %struct._VCHANNEL*, align 8
  %5 = alloca i8*, align 8
  %6 = alloca i32, align 4
  %7 = alloca void (%struct.stream*)*, align 8
  %8 = alloca %struct._VCHANNEL*, align 8
  store i8* %0, i8** %5, align 8
  call void @llvm.dbg.declare(metadata i8** %5, metadata !83, metadata !84), !dbg !85
  store i32 %1, i32* %6, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !28, globals: !35)
!1 = !DIFile(filename: "[inter]channels.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !9, !21}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_RDP_VERSION", file: !4, line: 52, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "RDP_V4", value: 4)
!7 = !DIEnumerator(name: "RDP_V5", value: 5)
!8 = !DIEnumerator(name: "RDP_V6", value: 6)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !10, line: 46, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20}
!12 = !DIEnumerator(name: "GUI", value: 0)
!13 = !DIEnumerator(name: "Keyboard", value: 1)
!14 = !DIEnumerator(name: "Clipboard", value: 2)
!15 = !DIEnumerator(name: "Sound", value: 3)
!16 = !DIEnumerator(name: "Protocol", value: 4)
!17 = !DIEnumerator(name: "Graphics", value: 5)
!18 = !DIEnumerator(name: "Core", value: 6)
!19 = !DIEnumerator(name: "SmartCard", value: 7)
!20 = !DIEnumerator(name: "Disk", value: 8)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !10, line: 37, size: 32, align: 32, elements: !22)
!22 = !{!23, !24, !25, !26, !27}
!23 = !DIEnumerator(name: "Debug", value: 0)
!24 = !DIEnumerator(name: "Verbose", value: 1)
!25 = !DIEnumerator(name: "Warning", value: 2)
!26 = !DIEnumerator(name: "Error", value: 3)
!27 = !DIEnumerator(name: "Notice", value: 4)
!28 = !{!29, !32}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !4, line: 43, baseType: !31)
!31 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !4, line: 39, baseType: !34)
!34 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!35 = !{!36, !73}
!36 = distinct !DIGlobalVariable(name: "g_channels", scope: !0, file: !37, line: 32, type: !38, isLocal: false, isDefinition: true, variable: [6 x %struct._VCHANNEL]* @g_channels)
!37 = !DIFile(filename: "channels.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 4608, align: 64, elements: !71)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "VCHANNEL", file: !4, line: 169, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VCHANNEL", file: !4, line: 161, size: 768, align: 64, elements: !41)
!41 = !{!42, !45, !50, !51, !65}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_id", scope: !40, file: !4, line: 163, baseType: !43, size: 16, align: 16)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !4, line: 41, baseType: !44)
!44 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !4, line: 164, baseType: !46, size: 64, align: 8, offset: 16)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 64, align: 8, elements: !48)
!47 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!48 = !{!49}
!49 = !DISubrange(count: 8)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !40, file: !4, line: 165, baseType: !30, size: 32, align: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !40, file: !4, line: 166, baseType: !52, size: 576, align: 64, offset: 128)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !53, line: 25, size: 576, align: 64, elements: !54)
!53 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!54 = !{!55, !57, !58, !59, !60, !61, !62, !63, !64}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !52, file: !53, line: 27, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !52, file: !53, line: 28, baseType: !56, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !52, file: !53, line: 29, baseType: !56, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !52, file: !53, line: 30, baseType: !31, size: 32, align: 32, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !52, file: !53, line: 33, baseType: !56, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !52, file: !53, line: 34, baseType: !56, size: 64, align: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !52, file: !53, line: 35, baseType: !56, size: 64, align: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !52, file: !53, line: 36, baseType: !56, size: 64, align: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !52, file: !53, line: 37, baseType: !56, size: 64, align: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !40, file: !4, line: 167, baseType: !66, size: 64, align: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !69}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !53, line: 40, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!71 = !{!72}
!72 = !DISubrange(count: 6)
!73 = distinct !DIGlobalVariable(name: "g_num_channels", scope: !0, file: !37, line: 33, type: !31, isLocal: false, isDefinition: true, variable: i32* @g_num_channels)
!74 = !{i32 2, !"Dwarf Version", i32 4}
!75 = !{i32 2, !"Debug Info Version", i32 3}
!76 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!77 = distinct !DISubprogram(name: "channel_register", scope: !37, file: !37, line: 46, type: !78, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !82)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !81, !30, !66}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!82 = !{}
!83 = !DILocalVariable(name: "name", arg: 1, scope: !77, file: !37, line: 46, type: !81)
!84 = !DIExpression()
!85 = !DILocation(line: 46, column: 24, scope: !77)
!86 = !DILocalVariable(name: "flags", arg: 2, scope: !77, file: !37, line: 46, type: !30)
!87 = !DILocation(line: 46, column: 37, scope: !77)
!88 = !DILocalVariable(name: "callback", arg: 3, scope: !77, file: !37, line: 46, type: !66)
!89 = !DILocation(line: 46, column: 51, scope: !77)
!90 = !DILocalVariable(name: "channel", scope: !77, file: !37, line: 48, type: !80)
!91 = !DILocation(line: 48, column: 12, scope: !77)
!92 = !DILocation(line: 50, column: 6, scope: !93)
!93 = distinct !DILexicalBlock(scope: !77, file: !37, line: 50, column: 6)
!94 = !DILocation(line: 50, column: 20, scope: !93)
!95 = !DILocation(line: 50, column: 6, scope: !77)
!96 = !DILocation(line: 51, column: 3, scope: !93)
!97 = !DILocation(line: 53, column: 6, scope: !98)
!98 = distinct !DILexicalBlock(scope: !77, file: !37, line: 53, column: 6)
!99 = !DILocation(line: 53, column: 21, scope: !98)
!100 = !DILocation(line: 53, column: 6, scope: !77)
!101 = !DILocation(line: 55, column: 3, scope: !102)
!102 = distinct !DILexicalBlock(scope: !98, file: !37, line: 54, column: 2)
!103 = !DILocation(line: 57, column: 3, scope: !102)
!104 = !DILocation(line: 60, column: 24, scope: !77)
!105 = !DILocation(line: 60, column: 13, scope: !77)
!106 = !DILocation(line: 60, column: 10, scope: !77)
!107 = !DILocation(line: 61, column: 31, scope: !77)
!108 = !DILocation(line: 61, column: 29, scope: !77)
!109 = !DILocation(line: 61, column: 20, scope: !77)
!110 = !DILocation(line: 61, column: 2, scope: !77)
!111 = !DILocation(line: 61, column: 11, scope: !77)
!112 = !DILocation(line: 61, column: 18, scope: !77)
!113 = !DILocation(line: 62, column: 10, scope: !77)
!114 = !DILocation(line: 62, column: 19, scope: !77)
!115 = !DILocation(line: 62, column: 25, scope: !77)
!116 = !DILocation(line: 62, column: 2, scope: !77)
!117 = !DILocation(line: 63, column: 19, scope: !77)
!118 = !DILocation(line: 63, column: 2, scope: !77)
!119 = !DILocation(line: 63, column: 11, scope: !77)
!120 = !DILocation(line: 63, column: 17, scope: !77)
!121 = !DILocation(line: 64, column: 21, scope: !77)
!122 = !DILocation(line: 64, column: 2, scope: !77)
!123 = !DILocation(line: 64, column: 11, scope: !77)
!124 = !DILocation(line: 64, column: 19, scope: !77)
!125 = !DILocation(line: 65, column: 16, scope: !77)
!126 = !DILocation(line: 66, column: 9, scope: !77)
!127 = !DILocation(line: 66, column: 2, scope: !77)
!128 = !DILocation(line: 67, column: 1, scope: !77)
