; ModuleID = './[inter]parallel.o.i'
source_filename = "./[inter]parallel.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.rdpdr_device_info = type { i32, i32, [8 x i8], i8*, i8* }
%struct._DEVICE_FNS = type { i32 (i32, i32, i32, i32, i32, i8*, i32*)*, i32 (i32)*, i32 (i32, i8*, i32, i32, i32*)*, i32 (i32, i8*, i32, i32, i32*)*, i32 (i32, i32, %struct.stream*, %struct.stream*)* }
%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }
%struct.rdpdr_parallel_device_info = type { i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8* }

@g_rdpdr_device = external global [0 x %struct.rdpdr_device_info], align 8
@.str = private unnamed_addr constant [34 x i8] c"parallel_enum_devices(), %s to %s\00", align 1
@parallel_fns = global %struct._DEVICE_FNS { i32 (i32, i32, i32, i32, i32, i8*, i32*)* @parallel_create, i32 (i32)* @parallel_close, i32 (i32, i8*, i32, i32, i32*)* @parallel_read, i32 (i32, i8*, i32, i32, i32*)* @parallel_write, i32 (i32, i32, %struct.stream*, %struct.stream*)* @parallel_device_control }, align 8
@.str.1 = private unnamed_addr constant [35 x i8] c"parallel_create(), open failed: %s\00", align 1
@.str.2 = private unnamed_addr constant [36 x i8] c"parallel_create(), fcntl failed: %s\00", align 1
@.str.3 = private unnamed_addr constant [35 x i8] c"parellel_write(), ioctl failed: %s\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22, globals: !50)
!1 = !DIFile(filename: "[inter]parallel.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !{!23, !48, !49}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARALLEL_DEVICE", file: !25, line: 275, baseType: !26)
!25 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rdpdr_parallel_device_info", file: !25, line: 262, size: 512, align: 64, elements: !27)
!27 = !{!28, !31, !32, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !26, file: !25, line: 264, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "printer", scope: !26, file: !25, line: 264, baseType: !29, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "queue_in_size", scope: !26, file: !25, line: 265, baseType: !33, size: 32, align: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !25, line: 43, baseType: !34)
!34 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "queue_out_size", scope: !26, file: !25, line: 266, baseType: !33, size: 32, align: 32, offset: 160)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "wait_mask", scope: !26, file: !25, line: 267, baseType: !33, size: 32, align: 32, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "read_interval_timeout", scope: !26, file: !25, line: 268, baseType: !33, size: 32, align: 32, offset: 224)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "read_total_timeout_multiplier", scope: !26, file: !25, line: 269, baseType: !33, size: 32, align: 32, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "read_total_timeout_constant", scope: !26, file: !25, line: 270, baseType: !33, size: 32, align: 32, offset: 288)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "write_total_timeout_multiplier", scope: !26, file: !25, line: 271, baseType: !33, size: 32, align: 32, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "write_total_timeout_constant", scope: !26, file: !25, line: 272, baseType: !33, size: 32, align: 32, offset: 352)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "posix_wait_mask", scope: !26, file: !25, line: 272, baseType: !33, size: 32, align: 32, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "bloblen", scope: !26, file: !25, line: 272, baseType: !33, size: 32, align: 32, offset: 416)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !26, file: !25, line: 273, baseType: !45, size: 64, align: 64, offset: 448)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !25, line: 39, baseType: !47)
!47 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!49 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!50 = !{!51}
!51 = distinct !DIGlobalVariable(name: "parallel_fns", scope: !0, file: !52, line: 195, type: !53, isLocal: false, isDefinition: true, variable: %struct._DEVICE_FNS* @parallel_fns)
!52 = !DIFile(filename: "parallel.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEVICE_FNS", file: !25, line: 223, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DEVICE_FNS", file: !25, line: 211, size: 320, align: 64, elements: !55)
!55 = !{!56, !63, !67, !72, !73}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !54, file: !25, line: 213, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !33, !33, !33, !33, !33, !29, !61}
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_NTSTATUS", file: !25, line: 208, baseType: !33)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_NTHANDLE", file: !25, line: 209, baseType: !33)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !54, file: !25, line: 216, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!60, !62}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !54, file: !25, line: 217, baseType: !68, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!60, !62, !45, !33, !33, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !54, file: !25, line: 219, baseType: !68, size: 64, align: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "device_control", scope: !54, file: !25, line: 221, baseType: !74, size: 64, align: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!60, !62, !33, !77, !77}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !78, line: 40, baseType: !79)
!78 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !78, line: 25, size: 576, align: 64, elements: !81)
!81 = !{!82, !84, !85, !86, !87, !88, !89, !90, !91}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !80, file: !78, line: 27, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !80, file: !78, line: 28, baseType: !83, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !80, file: !78, line: 29, baseType: !83, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !80, file: !78, line: 30, baseType: !34, size: 32, align: 32, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !80, file: !78, line: 33, baseType: !83, size: 64, align: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !80, file: !78, line: 34, baseType: !83, size: 64, align: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !80, file: !78, line: 35, baseType: !83, size: 64, align: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !80, file: !78, line: 36, baseType: !83, size: 64, align: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !80, file: !78, line: 37, baseType: !83, size: 64, align: 64, offset: 512)
!92 = !{i32 2, !"Dwarf Version", i32 4}
!93 = !{i32 2, !"Debug Info Version", i32 3}
!94 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!95 = distinct !DISubprogram(name: "parallel_enum_devices", scope: !52, file: !52, line: 42, type: !96, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
!96 = !DISubroutineType(types: !97)
!97 = !{!49, !71, !29}
!98 = !{}
!99 = !DILocalVariable(name: "id", arg: 1, scope: !95, file: !52, line: 42, type: !71)
!100 = !DIExpression()
!101 = !DILocation(line: 42, column: 32, scope: !95)
!102 = !DILocalVariable(name: "optarg", arg: 2, scope: !95, file: !52, line: 42, type: !29)
!103 = !DILocation(line: 42, column: 42, scope: !95)
!104 = !DILocalVariable(name: "ppar_info", scope: !95, file: !52, line: 44, type: !23)
!105 = !DILocation(line: 44, column: 19, scope: !95)
!106 = !DILocalVariable(name: "pos", scope: !95, file: !52, line: 46, type: !29)
!107 = !DILocation(line: 46, column: 8, scope: !95)
!108 = !DILocation(line: 46, column: 14, scope: !95)
!109 = !DILocalVariable(name: "pos2", scope: !95, file: !52, line: 47, type: !29)
!110 = !DILocation(line: 47, column: 8, scope: !95)
!111 = !DILocalVariable(name: "count", scope: !95, file: !52, line: 48, type: !49)
!112 = !DILocation(line: 48, column: 6, scope: !95)
!113 = !DILocation(line: 51, column: 8, scope: !95)
!114 = !DILocation(line: 52, column: 2, scope: !95)
!115 = !DILocation(line: 52, column: 25, scope: !116)
!116 = !DILexicalBlockFile(scope: !95, file: !52, discriminator: 1)
!117 = !DILocation(line: 52, column: 16, scope: !116)
!118 = !DILocation(line: 52, column: 14, scope: !116)
!119 = !DILocation(line: 52, column: 39, scope: !116)
!120 = !DILocation(line: 52, column: 43, scope: !121)
!121 = !DILexicalBlockFile(scope: !95, file: !52, discriminator: 2)
!122 = !DILocation(line: 52, column: 42, scope: !121)
!123 = !DILocation(line: 52, column: 46, scope: !121)
!124 = !DILocation(line: 52, column: 2, scope: !125)
!125 = !DILexicalBlockFile(scope: !95, file: !52, discriminator: 3)
!126 = !DILocation(line: 54, column: 35, scope: !127)
!127 = distinct !DILexicalBlock(scope: !95, file: !52, line: 53, column: 2)
!128 = !DILocation(line: 54, column: 15, scope: !127)
!129 = !DILocation(line: 54, column: 13, scope: !127)
!130 = !DILocation(line: 56, column: 19, scope: !127)
!131 = !DILocation(line: 56, column: 10, scope: !127)
!132 = !DILocation(line: 56, column: 8, scope: !127)
!133 = !DILocation(line: 57, column: 26, scope: !127)
!134 = !DILocation(line: 57, column: 25, scope: !127)
!135 = !DILocation(line: 57, column: 10, scope: !127)
!136 = !DILocation(line: 57, column: 30, scope: !127)
!137 = !DILocation(line: 57, column: 36, scope: !127)
!138 = !DILocation(line: 57, column: 3, scope: !127)
!139 = !DILocation(line: 59, column: 31, scope: !127)
!140 = !DILocation(line: 59, column: 30, scope: !127)
!141 = !DILocation(line: 59, column: 15, scope: !127)
!142 = !DILocation(line: 59, column: 35, scope: !127)
!143 = !DILocation(line: 59, column: 3, scope: !127)
!144 = !DILocation(line: 61, column: 51, scope: !127)
!145 = !DILocation(line: 61, column: 44, scope: !127)
!146 = !DILocation(line: 61, column: 57, scope: !127)
!147 = !DILocation(line: 61, column: 36, scope: !148)
!148 = !DILexicalBlockFile(scope: !127, file: !52, discriminator: 1)
!149 = !DILocation(line: 61, column: 19, scope: !127)
!150 = !DILocation(line: 61, column: 18, scope: !127)
!151 = !DILocation(line: 61, column: 3, scope: !127)
!152 = !DILocation(line: 61, column: 23, scope: !127)
!153 = !DILocation(line: 61, column: 34, scope: !127)
!154 = !DILocation(line: 62, column: 26, scope: !127)
!155 = !DILocation(line: 62, column: 25, scope: !127)
!156 = !DILocation(line: 62, column: 10, scope: !127)
!157 = !DILocation(line: 62, column: 30, scope: !127)
