; ModuleID = './[inter]dvc.o.i'
source_filename = "./[inter]dvc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.dvc_channel_t = type { i32, i32, void (%struct.stream*)* }
%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }
%struct._VCHANNEL = type { i16, [8 x i8], i32, %struct.stream, void (%struct.stream*)* }
%union.dvc_hdr_t = type { i8 }
%struct.anon = type { i8 }

@channels = internal global [20 x %struct.dvc_channel_t] zeroinitializer, align 16
@.str = private unnamed_addr constant [56 x i8] c"dvc_send(), Trying to send data on invalid channel '%s'\00", align 1
@dvc_channel = internal global %struct._VCHANNEL* null, align 8
@.str.1 = private unnamed_addr constant [8 x i8] c"drdynvc\00", align 1
@.str.2 = private unnamed_addr constant [58 x i8] c"dvc_channels_add(), channel with name '%s' already exists\00", align 1
@.str.3 = private unnamed_addr constant [70 x i8] c"dvc_channels_add(), Added hash=%x, channel_id=%d, name=%s, handler=%p\00", align 1
@.str.4 = private unnamed_addr constant [85 x i8] c"dvc_channels_add(), Failed to add channel, maximum number of channels are being used\00", align 1
@.str.5 = private unnamed_addr constant [47 x i8] c"dvc_process_pdu(), Unhandled command type 0x%x\00", align 1
@.str.6 = private unnamed_addr constant [43 x i8] c"dvc_process_caps(), server supports dvc %d\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22, globals: !31)
!1 = !DIFile(filename: "[inter]dvc.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !{!23, !26, !27, !30}
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !24, line: 43, baseType: !25)
!24 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!25 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !24, line: 41, baseType: !29)
!29 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!31 = !{!32, !66}
!32 = distinct !DIGlobalVariable(name: "dvc_channel", scope: !0, file: !33, line: 52, type: !34, isLocal: true, isDefinition: true, variable: %struct._VCHANNEL** @dvc_channel)
!33 = !DIFile(filename: "dvc.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "VCHANNEL", file: !24, line: 169, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VCHANNEL", file: !24, line: 161, size: 768, align: 64, elements: !37)
!37 = !{!38, !39, !44, !45, !60}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_id", scope: !36, file: !24, line: 163, baseType: !28, size: 16, align: 16)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !36, file: !24, line: 164, baseType: !40, size: 64, align: 8, offset: 16)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 64, align: 8, elements: !42)
!41 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!42 = !{!43}
!43 = !DISubrange(count: 8)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !24, line: 165, baseType: !23, size: 32, align: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !36, file: !24, line: 166, baseType: !46, size: 576, align: 64, offset: 128)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !47, line: 25, size: 576, align: 64, elements: !48)
!47 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!48 = !{!49, !52, !53, !54, !55, !56, !57, !58, !59}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !46, file: !47, line: 27, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !46, file: !47, line: 28, baseType: !50, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !46, file: !47, line: 29, baseType: !50, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !47, line: 30, baseType: !25, size: 32, align: 32, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !46, file: !47, line: 33, baseType: !50, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !46, file: !47, line: 34, baseType: !50, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !46, file: !47, line: 35, baseType: !50, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !46, file: !47, line: 36, baseType: !50, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !46, file: !47, line: 37, baseType: !50, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !36, file: !24, line: 167, baseType: !61, size: 64, align: 64, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !64}
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !47, line: 40, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!66 = distinct !DIGlobalVariable(name: "channels", scope: !0, file: !33, line: 53, type: !67, isLocal: true, isDefinition: true, variable: [20 x %struct.dvc_channel_t]* @channels)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 2560, align: 64, elements: !76)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "dvc_channel_t", file: !33, line: 50, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dvc_channel_t", file: !33, line: 45, size: 128, align: 64, elements: !70)
!70 = !{!71, !72, !73}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !69, file: !33, line: 47, baseType: !23, size: 32, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "channel_id", scope: !69, file: !33, line: 48, baseType: !23, size: 32, align: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !69, file: !33, line: 49, baseType: !74, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "dvc_channel_process_fn", file: !75, line: 338, baseType: !61)
!75 = !DIFile(filename: "proto.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!76 = !{!77}
!77 = !DISubrange(count: 20)
!78 = !{i32 2, !"Dwarf Version", i32 4}
!79 = !{i32 2, !"Debug Info Version", i32 3}
!80 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!81 = distinct !DISubprogram(name: "dvc_channels_is_available", scope: !33, file: !33, line: 177, type: !82, isLocal: false, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !88)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !86}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !24, line: 28, baseType: !85)
!85 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!88 = !{}
!89 = !DILocalVariable(name: "name", arg: 1, scope: !81, file: !33, line: 177, type: !86)
!90 = !DIExpression()
!91 = !DILocation(line: 177, column: 39, scope: !81)
!92 = !DILocalVariable(name: "i", scope: !81, file: !33, line: 179, type: !85)
!93 = !DILocation(line: 179, column: 6, scope: !81)
!94 = !DILocalVariable(name: "hash", scope: !81, file: !33, line: 180, type: !23)
!95 = !DILocation(line: 180, column: 9, scope: !81)
!96 = !DILocation(line: 181, column: 25, scope: !81)
!97 = !DILocation(line: 181, column: 9, scope: !81)
!98 = !DILocation(line: 181, column: 7, scope: !81)
!99 = !DILocation(line: 183, column: 9, scope: !100)
!100 = distinct !DILexicalBlock(scope: !81, file: !33, line: 183, column: 2)
!101 = !DILocation(line: 183, column: 7, scope: !100)
!102 = !DILocation(line: 183, column: 14, scope: !103)
!103 = !DILexicalBlockFile(scope: !104, file: !33, discriminator: 1)
!104 = distinct !DILexicalBlock(scope: !100, file: !33, line: 183, column: 2)
!105 = !DILocation(line: 183, column: 16, scope: !103)
!106 = !DILocation(line: 183, column: 2, scope: !103)
!107 = !DILocation(line: 185, column: 16, scope: !108)
!108 = distinct !DILexicalBlock(scope: !109, file: !33, line: 185, column: 7)
!109 = distinct !DILexicalBlock(scope: !104, file: !33, line: 184, column: 2)
!110 = !DILocation(line: 185, column: 7, scope: !108)
!111 = !DILocation(line: 185, column: 19, scope: !108)
!112 = !DILocation(line: 185, column: 27, scope: !108)
!113 = !DILocation(line: 185, column: 24, scope: !108)
!114 = !DILocation(line: 185, column: 7, scope: !109)
!115 = !DILocation(line: 187, column: 21, scope: !116)
!116 = distinct !DILexicalBlock(scope: !108, file: !33, line: 186, column: 3)
!117 = !DILocation(line: 187, column: 12, scope: !116)
!118 = !DILocation(line: 187, column: 24, scope: !116)
!119 = !DILocation(line: 187, column: 35, scope: !116)
!120 = !DILocation(line: 187, column: 4, scope: !116)
!121 = !DILocation(line: 189, column: 2, scope: !109)
!122 = !DILocation(line: 183, column: 23, scope: !123)
!123 = !DILexicalBlockFile(scope: !104, file: !33, discriminator: 2)
!124 = !DILocation(line: 183, column: 2, scope: !123)
!125 = distinct !{!125, !126}
!126 = !DILocation(line: 183, column: 2, scope: !81)
!127 = !DILocation(line: 191, column: 2, scope: !81)
!128 = !DILocation(line: 192, column: 1, scope: !81)
!129 = distinct !DISubprogram(name: "dvc_channels_register", scope: !33, file: !33, line: 195, type: !130, isLocal: false, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !88)
!130 = !DISubroutineType(types: !131)
!131 = !{!84, !86, !74}
!132 = !DILocalVariable(name: "name", arg: 1, scope: !129, file: !33, line: 195, type: !86)
!133 = !DILocation(line: 195, column: 35, scope: !129)
!134 = !DILocalVariable(name: "handler", arg: 2, scope: !129, file: !33, line: 195, type: !74)
!135 = !DILocation(line: 195, column: 64, scope: !129)
!136 = !DILocation(line: 197, column: 26, scope: !129)
!137 = !DILocation(line: 197, column: 32, scope: !129)
!138 = !DILocation(line: 197, column: 9, scope: !129)
!139 = !DILocation(line: 197, column: 2, scope: !129)
!140 = distinct !DISubprogram(name: "dvc_channels_add", scope: !33, file: !33, line: 123, type: !141, isLocal: true, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !88)
!141 = !DISubroutineType(types: !142)
!142 = !{!84, !86, !74, !23}
!143 = !DILocalVariable(name: "name", arg: 1, scope: !140, file: !33, line: 123, type: !86)
!144 = !DILocation(line: 123, column: 30, scope: !140)
!145 = !DILocalVariable(name: "handler", arg: 2, scope: !140, file: !33, line: 123, type: !74)
!146 = !DILocation(line: 123, column: 59, scope: !140)
!147 = !DILocalVariable(name: "channel_id", arg: 3, scope: !140, file: !33, line: 123, type: !23)
!148 = !DILocation(line: 123, column: 75, scope: !140)
!149 = !DILocalVariable(name: "i", scope: !140, file: !33, line: 125, type: !85)
!150 = !DILocation(line: 125, column: 6, scope: !140)
!151 = !DILocalVariable(name: "hash", scope: !140, file: !33, line: 126, type: !23)
!152 = !DILocation(line: 126, column: 9, scope: !140)
!153 = !DILocation(line: 128, column: 26, scope: !154)
!154 = distinct !DILexicalBlock(scope: !140, file: !33, line: 128, column: 6)
!155 = !DILocation(line: 128, column: 6, scope: !154)
!156 = !DILocation(line: 128, column: 32, scope: !154)
!157 = !DILocation(line: 128, column: 6, scope: !140)
!158 = !DILocation(line: 131, column: 10, scope: !159)
!159 = distinct !DILexicalBlock(scope: !154, file: !33, line: 129, column: 2)
!160 = !DILocation(line: 130, column: 3, scope: !159)
!161 = !DILocation(line: 132, column: 3, scope: !159)
!162 = !DILocation(line: 135, column: 9, scope: !163)
!163 = distinct !DILexicalBlock(scope: !140, file: !33, line: 135, column: 2)
!164 = !DILocation(line: 135, column: 7, scope: !163)
!165 = !DILocation(line: 135, column: 14, scope: !166)
!166 = !DILexicalBlockFile(scope: !167, file: !33, discriminator: 1)
!167 = distinct !DILexicalBlock(scope: !163, file: !33, line: 135, column: 2)
!168 = !DILocation(line: 135, column: 16, scope: !166)
!169 = !DILocation(line: 135, column: 2, scope: !166)
!170 = !DILocation(line: 137, column: 16, scope: !171)
!171 = distinct !DILexicalBlock(scope: !172, file: !33, line: 137, column: 7)
!172 = distinct !DILexicalBlock(scope: !167, file: !33, line: 136, column: 2)
!173 = !DILocation(line: 137, column: 7, scope: !171)
!174 = !DILocation(line: 137, column: 19, scope: !171)
!175 = !DILocation(line: 137, column: 24, scope: !171)
!176 = !DILocation(line: 137, column: 7, scope: !172)
!177 = !DILocation(line: 139, column: 27, scope: !178)
!178 = distinct !DILexicalBlock(scope: !171, file: !33, line: 138, column: 3)
!179 = !DILocation(line: 139, column: 11, scope: !178)
!180 = !DILocation(line: 139, column: 9, scope: !178)
!181 = !DILocation(line: 140, column: 23, scope: !178)
!182 = !DILocation(line: 140, column: 13, scope: !178)
!183 = !DILocation(line: 140, column: 4, scope: !178)
!184 = !DILocation(line: 140, column: 16, scope: !178)
!185 = !DILocation(line: 140, column: 21, scope: !178)
!186 = !DILocation(line: 141, column: 26, scope: !178)
!187 = !DILocation(line: 141, column: 13, scope: !178)
!188 = !DILocation(line: 141, column: 4, scope: !178)
!189 = !DILocation(line: 141, column: 16, scope: !178)
!190 = !DILocation(line: 141, column: 24, scope: !178)
!191 = !DILocation(line: 142, column: 29, scope: !178)
!192 = !DILocation(line: 142, column: 13, scope: !178)
!193 = !DILocation(line: 142, column: 4, scope: !178)
!194 = !DILocation(line: 142, column: 16, scope: !178)
!195 = !DILocation(line: 142, column: 27, scope: !178)
!196 = !DILocation(line: 145, column: 11, scope: !178)
!197 = !DILocation(line: 145, column: 17, scope: !178)
!198 = !DILocation(line: 145, column: 29, scope: !178)
!199 = !DILocation(line: 145, column: 35, scope: !178)
!200 = !DILocation(line: 143, column: 4, scope: !178)
!201 = !DILocation(line: 146, column: 4, scope: !178)
!202 = !DILocation(line: 148, column: 2, scope: !172)
!203 = !DILocation(line: 135, column: 23, scope: !204)
!204 = !DILexicalBlockFile(scope: !167, file: !33, discriminator: 2)
!205 = !DILocation(line: 135, column: 2, scope: !204)
!206 = distinct !{!206, !207}
!207 = !DILocation(line: 135, column: 2, scope: !140)
!208 = !DILocation(line: 150, column: 2, scope: !140)
!209 = !DILocation(line: 151, column: 2, scope: !140)
!210 = !DILocation(line: 152, column: 1, scope: !140)
!211 = distinct !DISubprogram(name: "dvc_send", scope: !33, file: !33, line: 241, type: !212, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !88)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !86, !64}
!214 = !DILocalVariable(name: "name", arg: 1, scope: !211, file: !33, line: 241, type: !86)
!215 = !DILocation(line: 241, column: 22, scope: !211)
!216 = !DILocalVariable(name: "s", arg: 2, scope: !211, file: !33, line: 241, type: !64)
!217 = !DILocation(line: 241, column: 35, scope: !211)
!218 = !DILocalVariable(name: "ls", scope: !211, file: !33, line: 243, type: !64)
!219 = !DILocation(line: 243, column: 9, scope: !211)
!220 = !DILocalVariable(name: "hdr", scope: !211, file: !33, line: 244, type: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "dvc_hdr_t", file: !33, line: 43, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "dvc_hdr_t", file: !33, line: 36, size: 8, align: 8, elements: !223)
!223 = !{!224, !226}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !222, file: !33, line: 37, baseType: !225, size: 8, align: 8)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !24, line: 39, baseType: !51)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !222, file: !33, line: 42, baseType: !227, size: 8, align: 8)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !222, file: !33, line: 38, size: 8, align: 8, elements: !228)
!228 = !{!229, !230, !231}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "cbid", scope: !227, file: !33, line: 39, baseType: !225, size: 2, align: 8, flags: DIFlagBitField, extraData: i64 0)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !227, file: !33, line: 40, baseType: !225, size: 2, align: 8, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !227, file: !33, line: 41, baseType: !225, size: 4, align: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!232 = !DILocation(line: 244, column: 12, scope: !211)
!233 = !DILocalVariable(name: "channel_id", scope: !211, file: !33, line: 245, type: !23)
!234 = !DILocation(line: 245, column: 9, scope: !211)
!235 = !DILocation(line: 247, column: 35, scope: !211)
!236 = !DILocation(line: 247, column: 15, scope: !211)
!237 = !DILocation(line: 247, column: 13, scope: !211)
!238 = !DILocation(line: 248, column: 6, scope: !239)
!239 = distinct !DILexicalBlock(scope: !211, file: !33, line: 248, column: 6)
!240 = !DILocation(line: 248, column: 17, scope: !239)
!241 = !DILocation(line: 248, column: 6, scope: !211)
!242 = !DILocation(line: 251, column: 10, scope: !243)
!243 = distinct !DILexicalBlock(scope: !239, file: !33, line: 249, column: 2)
!244 = !DILocation(line: 250, column: 3, scope: !243)
!245 = !DILocation(line: 252, column: 3, scope: !243)
!246 = !DILocation(line: 257, column: 6, scope: !211)
!247 = !DILocation(line: 257, column: 10, scope: !211)
!248 = !DILocation(line: 257, column: 14, scope: !211)
!249 = !DILocation(line: 258, column: 6, scope: !211)
!250 = !DILocation(line: 258, column: 10, scope: !211)
!251 = !DILocation(line: 258, column: 15, scope: !211)
!252 = !DILocation(line: 259, column: 6, scope: !211)
!253 = !DILocation(line: 259, column: 10, scope: !211)
!254 = !DILocation(line: 259, column: 13, scope: !211)
!255 = !DILocation(line: 261, column: 28, scope: !211)
!256 = !DILocation(line: 261, column: 42, scope: !211)
!257 = !DILocation(line: 261, column: 46, scope: !211)
!258 = !DILocation(line: 261, column: 53, scope: !211)
!259 = !DILocation(line: 261, column: 57, scope: !211)
!260 = !DILocation(line: 261, column: 50, scope: !211)
!261 = !DILocation(line: 261, column: 7, scope: !211)
!262 = !DILocation(line: 261, column: 5, scope: !211)
!263 = !DILocation(line: 263, column: 12, scope: !264)
!264 = distinct !DILexicalBlock(scope: !211, file: !33, line: 263, column: 2)
!265 = !DILocation(line: 263, column: 17, scope: !264)
!266 = !DILocation(line: 263, column: 20, scope: !264)
!267 = !DILocation(line: 263, column: 24, scope: !264)
!268 = !DILocation(line: 263, column: 32, scope: !264)
!269 = !DILocation(line: 263, column: 37, scope: !264)
!270 = !DILocation(line: 263, column: 45, scope: !264)
!271 = !DILocation(line: 263, column: 50, scope: !264)
!272 = !DILocation(line: 263, column: 41, scope: !264)
!273 = !DILocation(line: 263, column: 4, scope: !264)
!274 = !DILocation(line: 263, column: 72, scope: !264)
!275 = !DILocation(line: 263, column: 77, scope: !264)
!276 = !DILocation(line: 263, column: 85, scope: !264)
!277 = !DILocation(line: 263, column: 90, scope: !264)
!278 = !DILocation(line: 263, column: 81, scope: !264)
!279 = !DILocation(line: 263, column: 59, scope: !264)
!280 = !DILocation(line: 263, column: 64, scope: !264)
!281 = !DILocation(line: 263, column: 66, scope: !264)
!282 = !DILocation(line: 265, column: 15, scope: !211)
!283 = !DILocation(line: 265, column: 20, scope: !211)
!284 = !DILocation(line: 265, column: 3, scope: !211)
!285 = !DILocation(line: 265, column: 8, scope: !211)
!286 = !DILocation(line: 265, column: 12, scope: !211)
!287 = !DILocation(line: 267, column: 15, scope: !211)
!288 = !DILocation(line: 267, column: 19, scope: !211)
!289 = !DILocation(line: 267, column: 2, scope: !211)
!290 = !DILocation(line: 268, column: 1, scope: !211)
!291 = !DILocation(line: 268, column: 1, scope: !292)
!292 = !DILexicalBlockFile(scope: !211, file: !33, discriminator: 1)
!293 = distinct !DISubprogram(name: "dvc_channels_get_id", scope: !33, file: !33, line: 89, type: !294, isLocal: true, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !88)
!294 = !DISubroutineType(types: !295)
!295 = !{!23, !86}
!296 = !DILocalVariable(name: "name", arg: 1, scope: !293, file: !33, line: 89, type: !86)
