; ModuleID = './[inter]tcp.o.i'
source_filename = "./[inter]tcp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !63, globals: !91)
!1 = !DIFile(filename: "[inter]tcp.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15, !22, !34}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !23, line: 24, size: 32, align: 32, elements: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32, !33}
!25 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!26 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!27 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!28 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!29 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!30 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!31 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!32 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!33 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 40, size: 32, align: 32, elements: !36)
!35 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62}
!37 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!38 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!39 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!40 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!41 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!42 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!43 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!44 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!45 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!46 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!47 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!48 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!49 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!50 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!51 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!52 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!53 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!54 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!55 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!56 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!57 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!58 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!59 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!60 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!61 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!62 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!63 = !{!64, !65, !69, !71, !75, !87, !90}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !67, line: 39, baseType: !68)
!67 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!68 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !67, line: 41, baseType: !70)
!70 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !35, line: 30, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !73, line: 51, baseType: !74)
!73 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!74 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !77, line: 153, size: 128, align: 16, elements: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!78 = !{!79, !82}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !76, file: !77, line: 155, baseType: !80, size: 16, align: 16)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !81, line: 28, baseType: !70)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !76, file: !77, line: 156, baseType: !83, size: 112, align: 8, offset: 16)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 112, align: 8, elements: !85)
!84 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!85 = !{!86}
!86 = !DISubrange(count: 14)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !88, line: 54, baseType: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!89 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!90 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!91 = !{!92, !109, !110, !131, !139, !140, !141, !145, !1837, !1839, !1840, !1841}
!92 = distinct !DIGlobalVariable(name: "g_server_address", scope: !0, file: !93, line: 64, type: !94, isLocal: false, isDefinition: true, variable: %struct.sockaddr_in** @g_server_address)
!93 = !DIFile(filename: "tcp.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !35, line: 239, size: 128, align: 32, elements: !96)
!96 = !{!97, !98, !101, !105}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !95, file: !35, line: 241, baseType: !80, size: 16, align: 16)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !95, file: !35, line: 242, baseType: !99, size: 16, align: 16, offset: 16)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !35, line: 119, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !73, line: 49, baseType: !70)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !95, file: !35, line: 243, baseType: !102, size: 32, align: 32, offset: 32)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !35, line: 31, size: 32, align: 32, elements: !103)
!103 = !{!104}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !102, file: !35, line: 33, baseType: !71, size: 32, align: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !95, file: !35, line: 246, baseType: !106, size: 64, align: 8, offset: 64)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 64, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 8)
!109 = distinct !DIGlobalVariable(name: "g_tcp_port_rdp", scope: !0, file: !93, line: 75, type: !90, isLocal: false, isDefinition: true, variable: i32* @g_tcp_port_rdp)
!110 = distinct !DIGlobalVariable(name: "cur_stream_id", scope: !111, file: !93, line: 105, type: !90, isLocal: true, isDefinition: true, variable: i32* @tcp_init.cur_stream_id)
!111 = distinct !DISubprogram(name: "tcp_init", scope: !93, file: !93, line: 103, type: !112, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !130)
!112 = !DISubroutineType(types: !113)
!113 = !{!114, !129}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !115, line: 40, baseType: !116)
!115 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !115, line: 25, size: 576, align: 64, elements: !118)
!118 = !{!119, !121, !122, !123, !124, !125, !126, !127, !128}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !117, file: !115, line: 27, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !117, file: !115, line: 28, baseType: !120, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !115, line: 29, baseType: !120, size: 64, align: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !117, file: !115, line: 30, baseType: !74, size: 32, align: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !117, file: !115, line: 33, baseType: !120, size: 64, align: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !117, file: !115, line: 34, baseType: !120, size: 64, align: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !117, file: !115, line: 35, baseType: !120, size: 64, align: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !117, file: !115, line: 36, baseType: !120, size: 64, align: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !117, file: !115, line: 37, baseType: !120, size: 64, align: 64, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !67, line: 43, baseType: !74)
!130 = !{}
!131 = distinct !DIGlobalVariable(name: "ipaddr", scope: !132, file: !93, line: 646, type: !136, isLocal: true, isDefinition: true, variable: [32 x i8]* @tcp_get_address.ipaddr)
!132 = distinct !DISubprogram(name: "tcp_get_address", scope: !93, file: !93, line: 644, type: !133, isLocal: false, isDefinition: true, scopeLine: 645, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !130)
!133 = !DISubroutineType(types: !134)
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 256, align: 8, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 32)
!139 = distinct !DIGlobalVariable(name: "g_sock", scope: !0, file: !93, line: 71, type: !90, isLocal: true, isDefinition: true, variable: i32* @g_sock)
!140 = distinct !DIGlobalVariable(name: "g_in", scope: !0, file: !93, line: 73, type: !117, isLocal: true, isDefinition: true, variable: %struct.stream* @g_in)
!141 = distinct !DIGlobalVariable(name: "g_out", scope: !0, file: !93, line: 74, type: !142, isLocal: true, isDefinition: true, variable: [1 x %struct.stream]* @g_out)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 576, align: 64, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 1)
!145 = distinct !DIGlobalVariable(name: "g_ssl", scope: !0, file: !93, line: 69, type: !146, isLocal: true, isDefinition: true, variable: %struct.ssl_st** @g_ssl)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !148, line: 178, baseType: !149)
!148 = !DIFile(filename: "/usr/include/openssl/ossl_typ.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !150, line: 1422, size: 6592, align: 64, elements: !151)
!150 = !DIFile(filename: "/usr/include/openssl/ssl.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!151 = !{!152, !153, !154, !1367, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1497, !1652, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1777, !1778, !1779, !1780, !1781, !1782, !1785, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1805, !1810, !1811, !1818, !1819, !1820, !1821, !1822, !1823, !1830, !1831, !1832, !1833, !1834, !1835, !1836}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !149, file: !150, line: 1427, baseType: !90, size: 32, align: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !149, file: !150, line: 1429, baseType: !90, size: 32, align: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !149, file: !150, line: 1431, baseType: !155, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_METHOD", file: !150, line: 374, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_method_st", file: !150, line: 438, size: 1856, align: 64, elements: !159)
!159 = !{!160, !161, !165, !169, !170, !171, !172, !176, !177, !183, !184, !185, !186, !191, !195, !199, !200, !204, !1322, !1326, !1330, !1334, !1338, !1342, !1348, !1352, !1355, !1356, !1363}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !158, file: !150, line: 439, baseType: !90, size: 32, align: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_new", scope: !158, file: !150, line: 440, baseType: !162, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!90, !146}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_clear", scope: !158, file: !150, line: 441, baseType: !166, size: 64, align: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !146}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_free", scope: !158, file: !150, line: 442, baseType: !166, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_accept", scope: !158, file: !150, line: 443, baseType: !162, size: 64, align: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_connect", scope: !158, file: !150, line: 444, baseType: !162, size: 64, align: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_read", scope: !158, file: !150, line: 445, baseType: !173, size: 64, align: 64, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!90, !146, !64, !90}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_peek", scope: !158, file: !150, line: 446, baseType: !173, size: 64, align: 64, offset: 448)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_write", scope: !158, file: !150, line: 447, baseType: !178, size: 64, align: 64, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!90, !146, !181, !90}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_shutdown", scope: !158, file: !150, line: 448, baseType: !162, size: 64, align: 64, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_renegotiate", scope: !158, file: !150, line: 449, baseType: !162, size: 64, align: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_renegotiate_check", scope: !158, file: !150, line: 450, baseType: !162, size: 64, align: 64, offset: 704)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_get_message", scope: !158, file: !150, line: 451, baseType: !187, size: 64, align: 64, offset: 768)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!89, !146, !90, !90, !90, !89, !190}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_read_bytes", scope: !158, file: !150, line: 453, baseType: !192, size: 64, align: 64, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!90, !146, !90, !120, !90, !90}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_write_bytes", scope: !158, file: !150, line: 455, baseType: !196, size: 64, align: 64, offset: 896)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!90, !146, !90, !181, !90}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_dispatch_alert", scope: !158, file: !150, line: 456, baseType: !162, size: 64, align: 64, offset: 960)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_ctrl", scope: !158, file: !150, line: 457, baseType: !201, size: 64, align: 64, offset: 1024)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!89, !146, !90, !89, !64}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_ctx_ctrl", scope: !158, file: !150, line: 458, baseType: !205, size: 64, align: 64, offset: 1088)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!89, !208, !90, !89, !64}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !148, line: 179, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !150, line: 925, size: 6400, align: 64, elements: !211)
!211 = !{!212, !213, !231, !232, !935, !940, !941, !1002, !1003, !1004, !1005, !1012, !1017, !1021, !1035, !1036, !1040, !1041, !1047, !1048, !1053, !1057, !1061, !1062, !1122, !1123, !1124, !1125, !1130, !1136, !1141, !1142, !1143, !1144, !1147, !1148, !1152, !1153, !1154, !1155, !1156, !1157, !1162, !1163, !1164, !1165, !1166, !1170, !1171, !1175, !1176, !1177, !1247, !1251, !1252, !1256, !1257, !1258, !1262, !1266, !1267, !1270, !1271, !1294, !1299, !1300, !1305, !1306, !1311, !1315, !1316, !1317, !1318, !1319, !1320, !1321}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !210, file: !150, line: 926, baseType: !155, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_list", scope: !210, file: !150, line: 927, baseType: !214, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_SSL_CIPHER", file: !150, line: 380, size: 256, align: 64, elements: !216)
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !215, file: !150, line: 380, baseType: !218, size: 256, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "_STACK", file: !219, line: 72, baseType: !220)
!219 = !DIFile(filename: "/usr/include/openssl/stack.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !219, line: 66, size: 256, align: 64, elements: !221)
!221 = !{!222, !223, !225, !226, !227}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !220, file: !219, line: 67, baseType: !90, size: 32, align: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !220, file: !219, line: 68, baseType: !224, size: 64, align: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !220, file: !219, line: 69, baseType: !90, size: 32, align: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "num_alloc", scope: !220, file: !219, line: 70, baseType: !90, size: 32, align: 32, offset: 160)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !220, file: !219, line: 71, baseType: !228, size: 64, align: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!90, !181, !181}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_list_by_id", scope: !210, file: !150, line: 929, baseType: !214, size: 64, align: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "cert_store", scope: !210, file: !150, line: 930, baseType: !233, size: 64, align: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_store_st", file: !235, line: 186, size: 1152, align: 64, elements: !236)
!235 = !DIFile(filename: "/usr/include/openssl/x509_vfy.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!236 = !{!237, !238, !243, !248, !275, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !234, file: !235, line: 188, baseType: !90, size: 32, align: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "objs", scope: !234, file: !235, line: 189, baseType: !239, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_OBJECT", file: !235, line: 137, size: 256, align: 64, elements: !241)
!241 = !{!242}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !240, file: !235, line: 137, baseType: !218, size: 256, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "get_cert_methods", scope: !234, file: !235, line: 191, baseType: !244, size: 64, align: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_LOOKUP", file: !235, line: 136, size: 256, align: 64, elements: !246)
!246 = !{!247}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !245, file: !235, line: 136, baseType: !218, size: 256, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !234, file: !235, line: 192, baseType: !249, size: 64, align: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_VERIFY_PARAM", file: !235, line: 177, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_VERIFY_PARAM_st", file: !235, line: 167, size: 512, align: 64, elements: !252)
!252 = !{!253, !254, !259, !261, !262, !263, !264, !265, !271}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !251, file: !235, line: 168, baseType: !135, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "check_time", scope: !251, file: !235, line: 169, baseType: !255, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !256, line: 75, baseType: !257)
!256 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !258, line: 139, baseType: !89)
!258 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!259 = !DIDerivedType(tag: DW_TAG_member, name: "inh_flags", scope: !251, file: !235, line: 170, baseType: !260, size: 64, align: 64, offset: 128)
!260 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !251, file: !235, line: 171, baseType: !260, size: 64, align: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !251, file: !235, line: 172, baseType: !90, size: 32, align: 32, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !251, file: !235, line: 173, baseType: !90, size: 32, align: 32, offset: 288)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !251, file: !235, line: 174, baseType: !90, size: 32, align: 32, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "policies", scope: !251, file: !235, line: 175, baseType: !266, size: 64, align: 64, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ASN1_OBJECT", file: !268, line: 801, size: 256, align: 64, elements: !269)
!268 = !DIFile(filename: "/usr/include/openssl/asn1.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !267, file: !268, line: 801, baseType: !218, size: 256, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !251, file: !235, line: 176, baseType: !272, size: 64, align: 64, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_VERIFY_PARAM_ID", file: !235, line: 159, baseType: !274)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_VERIFY_PARAM_ID_st", file: !235, line: 159, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "verify", scope: !234, file: !235, line: 195, baseType: !276, size: 64, align: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!90, !279}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_STORE_CTX", file: !148, line: 162, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_store_ctx_st", file: !235, line: 236, size: 1984, align: 64, elements: !282)
!282 = !{!283, !286, !287, !794, !799, !804, !805, !806, !807, !811, !816, !820, !821, !888, !892, !896, !897, !901, !905, !906, !907, !908, !909, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !281, file: !235, line: 237, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_STORE", file: !148, line: 161, baseType: !234)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "current_method", scope: !281, file: !235, line: 239, baseType: !90, size: 32, align: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !281, file: !235, line: 242, baseType: !288, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !148, line: 154, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !291, line: 270, size: 1472, align: 64, elements: !292)
!291 = !DIFile(filename: "/usr/include/openssl/x509.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!292 = !{!293, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !754, !758, !763, !765, !776, !780}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "cert_info", scope: !290, file: !291, line: 271, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CINF", file: !291, line: 254, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_cinf_st", file: !291, line: 242, size: 832, align: 64, elements: !297)
!297 = !{!298, !307, !308, !390, !414, !423, !424, !713, !714, !715, !720}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !296, file: !291, line: 243, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !148, line: 83, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !268, line: 247, size: 192, align: 64, elements: !302)
!302 = !{!303, !304, !305, !306}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !301, file: !268, line: 248, baseType: !90, size: 32, align: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !301, file: !268, line: 249, baseType: !90, size: 32, align: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !301, file: !268, line: 250, baseType: !120, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !301, file: !268, line: 256, baseType: !89, size: 64, align: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !296, file: !291, line: 244, baseType: !299, size: 64, align: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !296, file: !291, line: 245, baseType: !309, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !148, line: 155, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !291, line: 143, size: 128, align: 64, elements: !312)
!312 = !{!313, !328}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !311, file: !291, line: 144, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !148, line: 103, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !268, line: 218, size: 320, align: 64, elements: !317)
!317 = !{!318, !321, !322, !323, !324, !327}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sn", scope: !316, file: !268, line: 219, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ln", scope: !316, file: !268, line: 219, baseType: !319, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "nid", scope: !316, file: !268, line: 220, baseType: !90, size: 32, align: 32, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !316, file: !268, line: 221, baseType: !90, size: 32, align: 32, offset: 160)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !316, file: !268, line: 222, baseType: !325, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !316, file: !268, line: 223, baseType: !90, size: 32, align: 32, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !311, file: !291, line: 145, baseType: !329, size: 64, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !268, line: 561, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !268, line: 532, size: 128, align: 64, elements: !332)
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !331, file: !268, line: 533, baseType: !90, size: 32, align: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !331, file: !268, line: 560, baseType: !335, size: 64, align: 64, offset: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !331, file: !268, line: 534, size: 64, align: 64, elements: !336)
!336 = !{!337, !338, !340, !343, !344, !345, !348, !351, !354, !357, !360, !363, !366, !369, !372, !375, !378, !381, !384, !385, !386}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !335, file: !268, line: 535, baseType: !135, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !335, file: !268, line: 536, baseType: !339, size: 32, align: 32)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !148, line: 99, baseType: !90)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !335, file: !268, line: 537, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !148, line: 98, baseType: !301)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !335, file: !268, line: 538, baseType: !314, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !335, file: !268, line: 539, baseType: !299, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !335, file: !268, line: 540, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !148, line: 84, baseType: !301)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !335, file: !268, line: 541, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !148, line: 85, baseType: !301)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !335, file: !268, line: 542, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !148, line: 86, baseType: !301)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !335, file: !268, line: 543, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !148, line: 87, baseType: !301)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !335, file: !268, line: 544, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !148, line: 88, baseType: !301)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !335, file: !268, line: 545, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !148, line: 89, baseType: !301)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !335, file: !268, line: 546, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !148, line: 90, baseType: !301)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !335, file: !268, line: 547, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !148, line: 92, baseType: !301)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !335, file: !268, line: 548, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !148, line: 91, baseType: !301)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !335, file: !268, line: 549, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !148, line: 93, baseType: !301)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !335, file: !268, line: 550, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !148, line: 95, baseType: !301)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !335, file: !268, line: 551, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !148, line: 96, baseType: !301)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !335, file: !268, line: 552, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !148, line: 97, baseType: !301)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !335, file: !268, line: 557, baseType: !341, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !335, file: !268, line: 558, baseType: !341, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !335, file: !268, line: 559, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !268, line: 307, baseType: !389)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !268, line: 307, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !296, file: !291, line: 246, baseType: !391, size: 64, align: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !148, line: 159, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !291, line: 179, size: 320, align: 64, elements: !394)
!394 = !{!395, !400, !401, !412, !413}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !393, file: !291, line: 180, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_NAME_ENTRY", file: !291, line: 175, size: 256, align: 64, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !397, file: !291, line: 175, baseType: !218, size: 256, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !393, file: !291, line: 181, baseType: !90, size: 32, align: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !393, file: !291, line: 183, baseType: !402, size: 64, align: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUF_MEM", file: !148, line: 127, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_mem_st", file: !405, line: 77, size: 192, align: 64, elements: !406)
!405 = !DIFile(filename: "/usr/include/openssl/buffer.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!406 = !{!407, !410, !411}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !404, file: !405, line: 78, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !409, line: 216, baseType: !260)
!409 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!410 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !404, file: !405, line: 79, baseType: !135, size: 64, align: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !404, file: !405, line: 80, baseType: !408, size: 64, align: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "canon_enc", scope: !393, file: !291, line: 188, baseType: !120, size: 64, align: 64, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "canon_enclen", scope: !393, file: !291, line: 189, baseType: !90, size: 32, align: 32, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "validity", scope: !296, file: !291, line: 247, baseType: !415, size: 64, align: 64, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_VAL", file: !291, line: 155, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_val_st", file: !291, line: 152, size: 128, align: 64, elements: !418)
!418 = !{!419, !422}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "notBefore", scope: !417, file: !291, line: 153, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TIME", file: !148, line: 94, baseType: !301)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "notAfter", scope: !417, file: !291, line: 154, baseType: !420, size: 64, align: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "subject", scope: !296, file: !291, line: 248, baseType: !391, size: 64, align: 64, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !296, file: !291, line: 249, baseType: !425, size: 64, align: 64, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_PUBKEY", file: !148, line: 160, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_pubkey_st", file: !291, line: 157, size: 192, align: 64, elements: !428)
!428 = !{!429, !430, !431}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "algor", scope: !427, file: !291, line: 158, baseType: !309, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "public_key", scope: !427, file: !291, line: 159, baseType: !349, size: 64, align: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !427, file: !291, line: 160, baseType: !432, size: 64, align: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !148, line: 133, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !435, line: 129, size: 448, align: 64, elements: !436)
!435 = !DIFile(filename: "/usr/include/openssl/evp.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!436 = !{!437, !438, !439, !440, !445, !449, !707, !708}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !434, file: !435, line: 130, baseType: !90, size: 32, align: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "save_type", scope: !434, file: !435, line: 131, baseType: !90, size: 32, align: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !434, file: !435, line: 132, baseType: !90, size: 32, align: 32, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ameth", scope: !434, file: !435, line: 133, baseType: !441, size: 64, align: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY_ASN1_METHOD", file: !148, line: 135, baseType: !444)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_asn1_method_st", file: !148, line: 135, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !434, file: !435, line: 134, baseType: !446, size: 64, align: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENGINE", file: !148, line: 177, baseType: !448)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "engine_st", file: !148, line: 177, flags: DIFlagFwdDecl)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !434, file: !435, line: 149, baseType: !450, size: 64, align: 64, offset: 256)
!450 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !434, file: !435, line: 135, size: 64, align: 64, elements: !451)
!451 = !{!452, !453, !583, !651, !704}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !450, file: !435, line: 136, baseType: !135, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "rsa", scope: !450, file: !435, line: 138, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rsa_st", file: !456, line: 132, size: 1344, align: 64, elements: !457)
!456 = !DIFile(filename: "/usr/include/openssl/rsa.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!457 = !{!458, !459, !460, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !572, !573, !574, !575, !576, !577, !578, !582}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !455, file: !456, line: 137, baseType: !90, size: 32, align: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !455, file: !456, line: 138, baseType: !89, size: 64, align: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !455, file: !456, line: 139, baseType: !461, size: 64, align: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "RSA_METHOD", file: !148, line: 147, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rsa_meth_st", file: !456, line: 85, size: 896, align: 64, elements: !465)
!465 = !{!466, !467, !473, !474, !475, !476, !496, !513, !517, !518, !519, !520, !527, !531}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !464, file: !456, line: 86, baseType: !319, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_pub_enc", scope: !464, file: !456, line: 87, baseType: !468, size: 64, align: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!90, !90, !325, !120, !471, !90}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "RSA", file: !148, line: 146, baseType: !455)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_pub_dec", scope: !464, file: !456, line: 89, baseType: !468, size: 64, align: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_priv_enc", scope: !464, file: !456, line: 91, baseType: !468, size: 64, align: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_priv_dec", scope: !464, file: !456, line: 93, baseType: !468, size: 64, align: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_mod_exp", scope: !464, file: !456, line: 96, baseType: !477, size: 64, align: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!90, !480, !491, !471, !493}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIGNUM", file: !148, line: 120, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_st", file: !483, line: 313, size: 192, align: 64, elements: !484)
!483 = !DIFile(filename: "/usr/include/openssl/bn.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!484 = !{!485, !487, !488, !489, !490}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !482, file: !483, line: 314, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !482, file: !483, line: 316, baseType: !90, size: 32, align: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !482, file: !483, line: 318, baseType: !90, size: 32, align: 32, offset: 96)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "neg", scope: !482, file: !483, line: 319, baseType: !90, size: 32, align: 32, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !482, file: !483, line: 320, baseType: !90, size: 32, align: 32, offset: 160)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_CTX", file: !148, line: 121, baseType: !495)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_ctx", file: !148, line: 121, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "bn_mod_exp", scope: !464, file: !456, line: 98, baseType: !497, size: 64, align: 64, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!90, !480, !491, !491, !491, !493, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_MONT_CTX", file: !148, line: 123, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_mont_ctx_st", file: !483, line: 324, size: 832, align: 64, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !512}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !502, file: !483, line: 325, baseType: !90, size: 32, align: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "RR", scope: !502, file: !483, line: 326, baseType: !481, size: 192, align: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !502, file: !483, line: 327, baseType: !481, size: 192, align: 64, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Ni", scope: !502, file: !483, line: 328, baseType: !481, size: 192, align: 64, offset: 448)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "n0", scope: !502, file: !483, line: 330, baseType: !509, size: 128, align: 64, offset: 640)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 128, align: 64, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 2)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !502, file: !483, line: 333, baseType: !90, size: 32, align: 32, offset: 768)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !464, file: !456, line: 101, baseType: !514, size: 64, align: 64, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64, align: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!90, !471}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !464, file: !456, line: 103, baseType: !514, size: 64, align: 64, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !464, file: !456, line: 105, baseType: !90, size: 32, align: 32, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !464, file: !456, line: 107, baseType: !135, size: 64, align: 64, offset: 640)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_sign", scope: !464, file: !456, line: 116, baseType: !521, size: 64, align: 64, offset: 704)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!90, !90, !325, !74, !120, !524, !525}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_verify", scope: !464, file: !456, line: 120, baseType: !528, size: 64, align: 64, offset: 768)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!90, !90, !325, !74, !325, !74, !525}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_keygen", scope: !464, file: !456, line: 129, baseType: !532, size: 64, align: 64, offset: 832)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!90, !471, !90, !480, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_GENCB", file: !148, line: 125, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_gencb_st", file: !483, line: 349, size: 192, align: 64, elements: !538)
!538 = !{!539, !540, !541}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ver", scope: !537, file: !483, line: 350, baseType: !74, size: 32, align: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !537, file: !483, line: 351, baseType: !64, size: 64, align: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !537, file: !483, line: 357, baseType: !542, size: 64, align: 64, offset: 128)
!542 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !537, file: !483, line: 352, size: 64, align: 64, elements: !543)
!543 = !{!544, !548}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "cb_1", scope: !542, file: !483, line: 354, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !90, !90, !64}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "cb_2", scope: !542, file: !483, line: 356, baseType: !549, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!90, !90, !90, !535}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !455, file: !456, line: 141, baseType: !446, size: 64, align: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !455, file: !456, line: 142, baseType: !480, size: 64, align: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !455, file: !456, line: 143, baseType: !480, size: 64, align: 64, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !455, file: !456, line: 144, baseType: !480, size: 64, align: 64, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !455, file: !456, line: 145, baseType: !480, size: 64, align: 64, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !455, file: !456, line: 146, baseType: !480, size: 64, align: 64, offset: 512)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "dmp1", scope: !455, file: !456, line: 147, baseType: !480, size: 64, align: 64, offset: 576)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "dmq1", scope: !455, file: !456, line: 148, baseType: !480, size: 64, align: 64, offset: 640)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "iqmp", scope: !455, file: !456, line: 149, baseType: !480, size: 64, align: 64, offset: 704)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !455, file: !456, line: 151, baseType: !562, size: 128, align: 64, offset: 768)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_EX_DATA", file: !148, line: 195, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_ex_data_st", file: !564, line: 292, size: 128, align: 64, elements: !565)
!564 = !DIFile(filename: "/usr/include/openssl/crypto.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!565 = !{!566, !571}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !563, file: !564, line: 293, baseType: !567, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64, align: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_void", file: !564, line: 297, size: 256, align: 64, elements: !569)
!569 = !{!570}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !568, file: !564, line: 297, baseType: !218, size: 256, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !563, file: !564, line: 295, baseType: !90, size: 32, align: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !455, file: !456, line: 152, baseType: !90, size: 32, align: 32, offset: 896)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !455, file: !456, line: 153, baseType: !90, size: 32, align: 32, offset: 928)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_method_mod_n", scope: !455, file: !456, line: 155, baseType: !500, size: 64, align: 64, offset: 960)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_method_mod_p", scope: !455, file: !456, line: 156, baseType: !500, size: 64, align: 64, offset: 1024)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_method_mod_q", scope: !455, file: !456, line: 157, baseType: !500, size: 64, align: 64, offset: 1088)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "bignum_data", scope: !455, file: !456, line: 162, baseType: !135, size: 64, align: 64, offset: 1152)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "blinding", scope: !455, file: !456, line: 163, baseType: !579, size: 64, align: 64, offset: 1216)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_BLINDING", file: !148, line: 122, baseType: !581)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "bn_blinding_st", file: !148, line: 122, flags: DIFlagFwdDecl)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "mt_blinding", scope: !455, file: !456, line: 164, baseType: !579, size: 64, align: 64, offset: 1280)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dsa", scope: !450, file: !435, line: 141, baseType: !584, size: 64, align: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dsa_st", file: !586, line: 155, size: 1088, align: 64, elements: !587)
!586 = !DIFile(filename: "/usr/include/openssl/dsa.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !650}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !585, file: !586, line: 160, baseType: !90, size: 32, align: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !585, file: !586, line: 161, baseType: !89, size: 64, align: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "write_params", scope: !585, file: !586, line: 162, baseType: !90, size: 32, align: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !585, file: !586, line: 163, baseType: !480, size: 64, align: 64, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !585, file: !586, line: 164, baseType: !480, size: 64, align: 64, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !585, file: !586, line: 165, baseType: !480, size: 64, align: 64, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pub_key", scope: !585, file: !586, line: 166, baseType: !480, size: 64, align: 64, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "priv_key", scope: !585, file: !586, line: 167, baseType: !480, size: 64, align: 64, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "kinv", scope: !585, file: !586, line: 168, baseType: !480, size: 64, align: 64, offset: 512)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !585, file: !586, line: 169, baseType: !480, size: 64, align: 64, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !585, file: !586, line: 170, baseType: !90, size: 32, align: 32, offset: 640)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "method_mont_p", scope: !585, file: !586, line: 172, baseType: !500, size: 64, align: 64, offset: 704)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !585, file: !586, line: 173, baseType: !90, size: 32, align: 32, offset: 768)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !585, file: !586, line: 174, baseType: !562, size: 128, align: 64, offset: 832)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !585, file: !586, line: 175, baseType: !603, size: 64, align: 64, offset: 960)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSA_METHOD", file: !148, line: 144, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dsa_method", file: !586, line: 129, size: 768, align: 64, elements: !607)
!607 = !{!608, !609, !621, !626, !630, !634, !638, !642, !643, !644, !645, !649}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !606, file: !586, line: 130, baseType: !319, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_do_sign", scope: !606, file: !586, line: 131, baseType: !610, size: 64, align: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64, align: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!613, !325, !90, !619}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSA_SIG", file: !586, line: 127, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DSA_SIG_st", file: !586, line: 124, size: 128, align: 64, elements: !616)
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !615, file: !586, line: 125, baseType: !480, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !615, file: !586, line: 126, baseType: !480, size: 64, align: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSA", file: !148, line: 143, baseType: !585)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_sign_setup", scope: !606, file: !586, line: 132, baseType: !622, size: 64, align: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!90, !619, !493, !625, !625}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_do_verify", scope: !606, file: !586, line: 134, baseType: !627, size: 64, align: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!90, !325, !90, !613, !619}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_mod_exp", scope: !606, file: !586, line: 136, baseType: !631, size: 64, align: 64, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64, align: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!90, !619, !480, !480, !480, !480, !480, !480, !493, !500}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "bn_mod_exp", scope: !606, file: !586, line: 140, baseType: !635, size: 64, align: 64, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!90, !619, !480, !480, !491, !491, !493, !500}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !606, file: !586, line: 142, baseType: !639, size: 64, align: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!90, !619}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !606, file: !586, line: 143, baseType: !639, size: 64, align: 64, offset: 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !606, file: !586, line: 144, baseType: !90, size: 32, align: 32, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !606, file: !586, line: 145, baseType: !135, size: 64, align: 64, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_paramgen", scope: !606, file: !586, line: 147, baseType: !646, size: 64, align: 64, offset: 640)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, align: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!90, !619, !90, !325, !90, !190, !486, !535}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_keygen", scope: !606, file: !586, line: 152, baseType: !639, size: 64, align: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !585, file: !586, line: 177, baseType: !446, size: 64, align: 64, offset: 1024)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "dh", scope: !450, file: !435, line: 144, baseType: !652, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64, align: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dh_st", file: !654, line: 135, size: 1152, align: 64, elements: !655)
!654 = !DIFile(filename: "/usr/include/openssl/dh.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !703}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !653, file: !654, line: 140, baseType: !90, size: 32, align: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !653, file: !654, line: 141, baseType: !90, size: 32, align: 32, offset: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !653, file: !654, line: 142, baseType: !480, size: 64, align: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !653, file: !654, line: 143, baseType: !480, size: 64, align: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !653, file: !654, line: 144, baseType: !89, size: 64, align: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "pub_key", scope: !653, file: !654, line: 145, baseType: !480, size: 64, align: 64, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "priv_key", scope: !653, file: !654, line: 146, baseType: !480, size: 64, align: 64, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !653, file: !654, line: 147, baseType: !90, size: 32, align: 32, offset: 384)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "method_mont_p", scope: !653, file: !654, line: 148, baseType: !500, size: 64, align: 64, offset: 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !653, file: !654, line: 150, baseType: !480, size: 64, align: 64, offset: 512)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !653, file: !654, line: 151, baseType: !480, size: 64, align: 64, offset: 576)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !653, file: !654, line: 152, baseType: !120, size: 64, align: 64, offset: 640)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "seedlen", scope: !653, file: !654, line: 153, baseType: !90, size: 32, align: 32, offset: 704)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !653, file: !654, line: 154, baseType: !480, size: 64, align: 64, offset: 768)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !653, file: !654, line: 155, baseType: !90, size: 32, align: 32, offset: 832)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !653, file: !654, line: 156, baseType: !562, size: 128, align: 64, offset: 896)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !653, file: !654, line: 157, baseType: !673, size: 64, align: 64, offset: 1024)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "DH_METHOD", file: !148, line: 141, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dh_method", file: !654, line: 117, size: 576, align: 64, elements: !677)
!677 = !{!678, !679, !685, !689, !695, !696, !697, !698, !699}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !676, file: !654, line: 118, baseType: !319, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "generate_key", scope: !676, file: !654, line: 120, baseType: !680, size: 64, align: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64, align: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!90, !683}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "DH", file: !148, line: 140, baseType: !653)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "compute_key", scope: !676, file: !654, line: 121, baseType: !686, size: 64, align: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64, align: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!90, !120, !491, !683}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "bn_mod_exp", scope: !676, file: !654, line: 123, baseType: !690, size: 64, align: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!90, !693, !480, !491, !491, !491, !493, !500}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !684)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !676, file: !654, line: 126, baseType: !680, size: 64, align: 64, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !676, file: !654, line: 127, baseType: !680, size: 64, align: 64, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !676, file: !654, line: 128, baseType: !90, size: 32, align: 32, offset: 384)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !676, file: !654, line: 129, baseType: !135, size: 64, align: 64, offset: 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "generate_params", scope: !676, file: !654, line: 131, baseType: !700, size: 64, align: 64, offset: 512)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64, align: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!90, !683, !90, !90, !535}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !653, file: !654, line: 158, baseType: !446, size: 64, align: 64, offset: 1088)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ec", scope: !450, file: !435, line: 147, baseType: !705, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64, align: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "ec_key_st", file: !435, line: 147, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "save_parameters", scope: !434, file: !435, line: 150, baseType: !90, size: 32, align: 32, offset: 320)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !434, file: !435, line: 151, baseType: !709, size: 64, align: 64, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ATTRIBUTE", file: !291, line: 223, size: 256, align: 64, elements: !711)
!711 = !{!712}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !710, file: !291, line: 223, baseType: !218, size: 256, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "issuerUID", scope: !296, file: !291, line: 250, baseType: !349, size: 64, align: 64, offset: 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "subjectUID", scope: !296, file: !291, line: 251, baseType: !349, size: 64, align: 64, offset: 512)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !296, file: !291, line: 252, baseType: !716, size: 64, align: 64, offset: 576)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64, align: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_EXTENSION", file: !291, line: 204, size: 256, align: 64, elements: !718)
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !717, file: !291, line: 204, baseType: !218, size: 256, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !296, file: !291, line: 253, baseType: !721, size: 192, align: 64, offset: 640)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENCODING", file: !268, line: 269, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ENCODING_st", file: !268, line: 265, size: 192, align: 64, elements: !723)
!723 = !{!724, !725, !726}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !722, file: !268, line: 266, baseType: !120, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !722, file: !268, line: 267, baseType: !89, size: 64, align: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !722, file: !268, line: 268, baseType: !90, size: 32, align: 32, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "sig_alg", scope: !290, file: !291, line: 272, baseType: !309, size: 64, align: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !290, file: !291, line: 273, baseType: !349, size: 64, align: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !290, file: !291, line: 274, baseType: !90, size: 32, align: 32, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !290, file: !291, line: 275, baseType: !90, size: 32, align: 32, offset: 224)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 276, baseType: !135, size: 64, align: 64, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !290, file: !291, line: 277, baseType: !562, size: 128, align: 64, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ex_pathlen", scope: !290, file: !291, line: 279, baseType: !89, size: 64, align: 64, offset: 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ex_pcpathlen", scope: !290, file: !291, line: 280, baseType: !89, size: 64, align: 64, offset: 512)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ex_flags", scope: !290, file: !291, line: 281, baseType: !260, size: 64, align: 64, offset: 576)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ex_kusage", scope: !290, file: !291, line: 282, baseType: !260, size: 64, align: 64, offset: 640)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ex_xkusage", scope: !290, file: !291, line: 283, baseType: !260, size: 64, align: 64, offset: 704)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ex_nscert", scope: !290, file: !291, line: 284, baseType: !260, size: 64, align: 64, offset: 768)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "skid", scope: !290, file: !291, line: 285, baseType: !352, size: 64, align: 64, offset: 832)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "akid", scope: !290, file: !291, line: 286, baseType: !741, size: 64, align: 64, offset: 896)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64, align: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "AUTHORITY_KEYID", file: !148, line: 186, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AUTHORITY_KEYID_st", file: !744, line: 262, size: 192, align: 64, elements: !745)
!744 = !DIFile(filename: "/usr/include/openssl/x509v3.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!745 = !{!746, !747, !753}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "keyid", scope: !743, file: !744, line: 263, baseType: !352, size: 64, align: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !743, file: !744, line: 264, baseType: !748, size: 64, align: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64, align: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "GENERAL_NAMES", file: !744, line: 209, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_GENERAL_NAME", file: !744, line: 220, size: 256, align: 64, elements: !751)
!751 = !{!752}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !750, file: !744, line: 220, baseType: !218, size: 256, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !743, file: !744, line: 265, baseType: !299, size: 64, align: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "policy_cache", scope: !290, file: !291, line: 287, baseType: !755, size: 64, align: 64, offset: 960)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_CACHE", file: !148, line: 184, baseType: !757)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_CACHE_st", file: !148, line: 184, flags: DIFlagFwdDecl)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "crldp", scope: !290, file: !291, line: 288, baseType: !759, size: 64, align: 64, offset: 1024)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64, align: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_DIST_POINT", file: !744, line: 259, size: 256, align: 64, elements: !761)
!761 = !{!762}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !760, file: !744, line: 259, baseType: !218, size: 256, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "altname", scope: !290, file: !291, line: 289, baseType: !764, size: 64, align: 64, offset: 1088)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64, align: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !290, file: !291, line: 290, baseType: !766, size: 64, align: 64, offset: 1152)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64, align: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "NAME_CONSTRAINTS", file: !148, line: 189, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NAME_CONSTRAINTS_st", file: !744, line: 332, size: 128, align: 64, elements: !769)
!769 = !{!770, !775}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "permittedSubtrees", scope: !768, file: !744, line: 333, baseType: !771, size: 64, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64, align: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_GENERAL_SUBTREE", file: !744, line: 330, size: 256, align: 64, elements: !773)
!773 = !{!774}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !772, file: !744, line: 330, baseType: !218, size: 256, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "excludedSubtrees", scope: !768, file: !744, line: 334, baseType: !771, size: 64, align: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "sha1_hash", scope: !290, file: !291, line: 296, baseType: !777, size: 160, align: 8, offset: 1216)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 160, align: 8, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 20)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !290, file: !291, line: 298, baseType: !781, size: 64, align: 64, offset: 1408)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64, align: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CERT_AUX", file: !291, line: 268, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_cert_aux_st", file: !291, line: 262, size: 320, align: 64, elements: !784)
!784 = !{!785, !786, !787, !788, !789}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !783, file: !291, line: 263, baseType: !266, size: 64, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "reject", scope: !783, file: !291, line: 264, baseType: !266, size: 64, align: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !783, file: !291, line: 265, baseType: !382, size: 64, align: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "keyid", scope: !783, file: !291, line: 266, baseType: !352, size: 64, align: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !783, file: !291, line: 267, baseType: !790, size: 64, align: 64, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64, align: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !268, line: 170, size: 256, align: 64, elements: !792)
!792 = !{!793}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !791, file: !268, line: 170, baseType: !218, size: 256, align: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "untrusted", scope: !281, file: !235, line: 244, baseType: !795, size: 64, align: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64, align: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !291, line: 301, size: 256, align: 64, elements: !797)
!797 = !{!798}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !796, file: !291, line: 301, baseType: !218, size: 256, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "crls", scope: !281, file: !235, line: 246, baseType: !800, size: 64, align: 64, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64, align: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_CRL", file: !291, line: 476, size: 256, align: 64, elements: !802)
!802 = !{!803}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !801, file: !291, line: 476, baseType: !218, size: 256, align: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !281, file: !235, line: 247, baseType: !249, size: 64, align: 64, offset: 320)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "other_ctx", scope: !281, file: !235, line: 249, baseType: !64, size: 64, align: 64, offset: 384)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "verify", scope: !281, file: !235, line: 252, baseType: !276, size: 64, align: 64, offset: 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "verify_cb", scope: !281, file: !235, line: 254, baseType: !808, size: 64, align: 64, offset: 512)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64, align: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!90, !90, !279}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "get_issuer", scope: !281, file: !235, line: 256, baseType: !812, size: 64, align: 64, offset: 576)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64, align: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!90, !815, !279, !288}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "check_issued", scope: !281, file: !235, line: 258, baseType: !817, size: 64, align: 64, offset: 640)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64, align: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!90, !279, !288, !288}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "check_revocation", scope: !281, file: !235, line: 260, baseType: !276, size: 64, align: 64, offset: 704)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "get_crl", scope: !281, file: !235, line: 262, baseType: !822, size: 64, align: 64, offset: 768)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64, align: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!90, !279, !825, !288}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64, align: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !148, line: 156, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !291, line: 452, size: 960, align: 64, elements: !829)
!829 = !{!830, !847, !848, !849, !850, !851, !852, !874, !875, !876, !877, !878, !879, !882, !887}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !828, file: !291, line: 454, baseType: !831, size: 64, align: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64, align: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL_INFO", file: !291, line: 450, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_info_st", file: !291, line: 441, size: 640, align: 64, elements: !834)
!834 = !{!835, !836, !837, !838, !839, !840, !845, !846}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !833, file: !291, line: 442, baseType: !299, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "sig_alg", scope: !833, file: !291, line: 443, baseType: !309, size: 64, align: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !833, file: !291, line: 444, baseType: !391, size: 64, align: 64, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "lastUpdate", scope: !833, file: !291, line: 445, baseType: !420, size: 64, align: 64, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "nextUpdate", scope: !833, file: !291, line: 446, baseType: !420, size: 64, align: 64, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "revoked", scope: !833, file: !291, line: 447, baseType: !841, size: 64, align: 64, offset: 320)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64, align: 64)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_REVOKED", file: !291, line: 438, size: 256, align: 64, elements: !843)
!843 = !{!844}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !842, file: !291, line: 438, baseType: !218, size: 256, align: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !833, file: !291, line: 448, baseType: !716, size: 64, align: 64, offset: 384)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !833, file: !291, line: 449, baseType: !721, size: 192, align: 64, offset: 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "sig_alg", scope: !828, file: !291, line: 455, baseType: !309, size: 64, align: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !828, file: !291, line: 456, baseType: !349, size: 64, align: 64, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !828, file: !291, line: 457, baseType: !90, size: 32, align: 32, offset: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !828, file: !291, line: 458, baseType: !90, size: 32, align: 32, offset: 224)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "akid", scope: !828, file: !291, line: 460, baseType: !741, size: 64, align: 64, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "idp", scope: !828, file: !291, line: 461, baseType: !853, size: 64, align: 64, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64, align: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISSUING_DIST_POINT", file: !148, line: 188, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ISSUING_DIST_POINT_st", file: !744, line: 356, size: 256, align: 64, elements: !856)
!856 = !{!857, !869, !870, !871, !872, !873}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "distpoint", scope: !855, file: !744, line: 357, baseType: !858, size: 64, align: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64, align: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIST_POINT_NAME", file: !744, line: 234, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DIST_POINT_NAME_st", file: !744, line: 226, size: 192, align: 64, elements: !861)
!861 = !{!862, !863, !868}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !860, file: !744, line: 227, baseType: !90, size: 32, align: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !860, file: !744, line: 231, baseType: !864, size: 64, align: 64, offset: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !860, file: !744, line: 228, size: 64, align: 64, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "fullname", scope: !864, file: !744, line: 229, baseType: !748, size: 64, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "relativename", scope: !864, file: !744, line: 230, baseType: !396, size: 64, align: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "dpname", scope: !860, file: !744, line: 233, baseType: !391, size: 64, align: 64, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "onlyuser", scope: !855, file: !744, line: 358, baseType: !90, size: 32, align: 32, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "onlyCA", scope: !855, file: !744, line: 359, baseType: !90, size: 32, align: 32, offset: 96)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "onlysomereasons", scope: !855, file: !744, line: 360, baseType: !349, size: 64, align: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "indirectCRL", scope: !855, file: !744, line: 361, baseType: !90, size: 32, align: 32, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "onlyattr", scope: !855, file: !744, line: 362, baseType: !90, size: 32, align: 32, offset: 224)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "idp_flags", scope: !828, file: !291, line: 463, baseType: !90, size: 32, align: 32, offset: 384)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "idp_reasons", scope: !828, file: !291, line: 464, baseType: !90, size: 32, align: 32, offset: 416)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "crl_number", scope: !828, file: !291, line: 466, baseType: !299, size: 64, align: 64, offset: 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "base_crl_number", scope: !828, file: !291, line: 467, baseType: !299, size: 64, align: 64, offset: 512)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "sha1_hash", scope: !828, file: !291, line: 469, baseType: !777, size: 160, align: 8, offset: 576)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "issuers", scope: !828, file: !291, line: 471, baseType: !880, size: 64, align: 64, offset: 768)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64, align: 64)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_GENERAL_NAMES", file: !291, line: 471, flags: DIFlagFwdDecl)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !828, file: !291, line: 472, baseType: !883, size: 64, align: 64, offset: 832)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64, align: 64)
!884 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL_METHOD", file: !148, line: 157, baseType: !886)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_crl_method_st", file: !148, line: 157, flags: DIFlagFwdDecl)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "meth_data", scope: !828, file: !291, line: 473, baseType: !64, size: 64, align: 64, offset: 896)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "check_crl", scope: !281, file: !235, line: 264, baseType: !889, size: 64, align: 64, offset: 832)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64, align: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!90, !279, !826}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "cert_crl", scope: !281, file: !235, line: 266, baseType: !893, size: 64, align: 64, offset: 896)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64, align: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!90, !279, !826, !288}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "check_policy", scope: !281, file: !235, line: 267, baseType: !276, size: 64, align: 64, offset: 960)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_certs", scope: !281, file: !235, line: 268, baseType: !898, size: 64, align: 64, offset: 1024)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!795, !279, !391}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_crls", scope: !281, file: !235, line: 269, baseType: !902, size: 64, align: 64, offset: 1088)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!800, !279, !391}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !281, file: !235, line: 270, baseType: !276, size: 64, align: 64, offset: 1152)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !281, file: !235, line: 273, baseType: !90, size: 32, align: 32, offset: 1216)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "last_untrusted", scope: !281, file: !235, line: 275, baseType: !90, size: 32, align: 32, offset: 1248)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !281, file: !235, line: 277, baseType: !795, size: 64, align: 64, offset: 1280)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !281, file: !235, line: 279, baseType: !910, size: 64, align: 64, offset: 1344)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_TREE", file: !148, line: 183, baseType: !912)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_TREE_st", file: !148, line: 183, flags: DIFlagFwdDecl)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_policy", scope: !281, file: !235, line: 281, baseType: !90, size: 32, align: 32, offset: 1408)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "error_depth", scope: !281, file: !235, line: 283, baseType: !90, size: 32, align: 32, offset: 1440)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !281, file: !235, line: 284, baseType: !90, size: 32, align: 32, offset: 1472)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "current_cert", scope: !281, file: !235, line: 285, baseType: !288, size: 64, align: 64, offset: 1536)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "current_issuer", scope: !281, file: !235, line: 287, baseType: !288, size: 64, align: 64, offset: 1600)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "current_crl", scope: !281, file: !235, line: 289, baseType: !826, size: 64, align: 64, offset: 1664)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "current_crl_score", scope: !281, file: !235, line: 291, baseType: !90, size: 32, align: 32, offset: 1728)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "current_reasons", scope: !281, file: !235, line: 293, baseType: !74, size: 32, align: 32, offset: 1760)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !281, file: !235, line: 295, baseType: !279, size: 64, align: 64, offset: 1792)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !281, file: !235, line: 296, baseType: !562, size: 128, align: 64, offset: 1856)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "verify_cb", scope: !234, file: !235, line: 197, baseType: !808, size: 64, align: 64, offset: 320)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "get_issuer", scope: !234, file: !235, line: 199, baseType: !812, size: 64, align: 64, offset: 384)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "check_issued", scope: !234, file: !235, line: 201, baseType: !817, size: 64, align: 64, offset: 448)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "check_revocation", scope: !234, file: !235, line: 203, baseType: !276, size: 64, align: 64, offset: 512)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "get_crl", scope: !234, file: !235, line: 205, baseType: !822, size: 64, align: 64, offset: 576)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "check_crl", scope: !234, file: !235, line: 207, baseType: !889, size: 64, align: 64, offset: 640)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "cert_crl", scope: !234, file: !235, line: 209, baseType: !893, size: 64, align: 64, offset: 704)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_certs", scope: !234, file: !235, line: 210, baseType: !898, size: 64, align: 64, offset: 768)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_crls", scope: !234, file: !235, line: 211, baseType: !902, size: 64, align: 64, offset: 832)
