; ModuleID = './[inter]disk.o.i'
source_filename = "./[inter]disk.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.rdpdr_device_info = type { i32, i32, [8 x i8], i8*, i8* }
%struct.fileinfo = type { i32, i32, i32, [4096 x i8], %struct.__dirstream*, %struct.dirent*, [4096 x i8], i32, %struct.notify_data, i32 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.notify_data = type { i64, i64, i64, i32 }
%struct._DEVICE_FNS = type { i32 (i32, i32, i32, i32, i32, i8*, i32*)*, i32 (i32)*, i32 (i32, i8*, i32, i32, i32*)*, i32 (i32, i8*, i32, i32, i32*)*, i32 (i32, i32, %struct.stream*, %struct.stream*)* }
%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }
%struct.FsInfoType = type { [4096 x i8], [4096 x i8], i64, [4096 x i8] }
%struct.rdpdr_disk_device_info = type { [4096 x i8] }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.utimbuf = type { i64, i64 }
%struct.statvfs = type { i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, [6 x i32] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22, globals: !44)
!1 = !DIFile(filename: "[inter]disk.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !{!23, !33, !34, !35, !36, !38, !43}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "DISK_DEVICE", file: !25, line: 240, baseType: !26)
!25 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rdpdr_disk_device_info", file: !25, line: 236, size: 32768, align: 8, elements: !27)
!27 = !{!28}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !26, file: !25, line: 238, baseType: !29, size: 32768, align: 8)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 32768, align: 8, elements: !31)
!30 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!31 = !{!32}
!32 = !DISubrange(count: 4096)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !25, line: 43, baseType: !37)
!37 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !39, line: 75, baseType: !40)
!39 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !41, line: 139, baseType: !42)
!41 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!42 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!43 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!44 = !{!45, !49, !91, !133, !141}
!45 = distinct !DIGlobalVariable(name: "g_notify_stamp", scope: !0, file: !46, line: 148, type: !47, isLocal: false, isDefinition: true, variable: i32* @g_notify_stamp)
!46 = !DIFile(filename: "disk.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !25, line: 28, baseType: !48)
!48 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!49 = distinct !DIGlobalVariable(name: "disk_fns", scope: !0, file: !46, line: 1439, type: !50, isLocal: false, isDefinition: true, variable: %struct._DEVICE_FNS* @disk_fns)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEVICE_FNS", file: !25, line: 223, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DEVICE_FNS", file: !25, line: 211, size: 320, align: 64, elements: !52)
!52 = !{!53, !60, !64, !71, !72}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !51, file: !25, line: 213, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !36, !36, !36, !36, !36, !33, !58}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_NTSTATUS", file: !25, line: 208, baseType: !36)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_NTHANDLE", file: !25, line: 209, baseType: !36)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !51, file: !25, line: 216, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!57, !59}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !51, file: !25, line: 217, baseType: !65, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!57, !59, !68, !36, !36, !35}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !25, line: 39, baseType: !70)
!70 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !51, file: !25, line: 219, baseType: !65, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "device_control", scope: !51, file: !25, line: 221, baseType: !73, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!57, !59, !36, !76, !76}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !77, line: 40, baseType: !78)
!77 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !77, line: 25, size: 576, align: 64, elements: !80)
!80 = !{!81, !83, !84, !85, !86, !87, !88, !89, !90}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !79, file: !77, line: 27, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !79, file: !77, line: 28, baseType: !82, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !79, file: !77, line: 29, baseType: !82, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !79, file: !77, line: 30, baseType: !37, size: 32, align: 32, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !79, file: !77, line: 33, baseType: !82, size: 64, align: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !79, file: !77, line: 34, baseType: !82, size: 64, align: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !79, file: !77, line: 35, baseType: !82, size: 64, align: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !79, file: !77, line: 36, baseType: !82, size: 64, align: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !79, file: !77, line: 37, baseType: !82, size: 64, align: 64, offset: 512)
!91 = distinct !DIGlobalVariable(name: "g_fileinfo", scope: !0, file: !46, line: 147, type: !92, isLocal: false, isDefinition: true, variable: [256 x %struct.fileinfo]* @g_fileinfo)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 16941056, align: 64, elements: !120)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILEINFO", file: !25, line: 307, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fileinfo", file: !25, line: 296, size: 66176, align: 64, elements: !95)
!95 = !{!96, !97, !98, !99, !100, !105, !122, !123, !124, !132}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "device_id", scope: !94, file: !25, line: 298, baseType: !36, size: 32, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "flags_and_attributes", scope: !94, file: !25, line: 298, baseType: !36, size: 32, align: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "accessmask", scope: !94, file: !25, line: 298, baseType: !36, size: 32, align: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !94, file: !25, line: 299, baseType: !29, size: 32768, align: 8, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pdir", scope: !94, file: !25, line: 300, baseType: !101, size: 64, align: 64, offset: 32896)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !103, line: 127, baseType: !104)
!103 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !103, line: 127, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "pdirent", scope: !94, file: !25, line: 301, baseType: !106, size: 64, align: 64, offset: 32960)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !108, line: 22, size: 2240, align: 64, elements: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!109 = !{!110, !113, !115, !117, !118}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !107, file: !108, line: 25, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !41, line: 127, baseType: !112)
!112 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !107, file: !108, line: 26, baseType: !114, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !41, line: 131, baseType: !42)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !107, file: !108, line: 31, baseType: !116, size: 16, align: 16, offset: 128)
!116 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !107, file: !108, line: 32, baseType: !70, size: 8, align: 8, offset: 144)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !107, file: !108, line: 33, baseType: !119, size: 2048, align: 8, offset: 152)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 2048, align: 8, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !94, file: !25, line: 302, baseType: !29, size: 32768, align: 8, offset: 33024)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "delete_on_close", scope: !94, file: !25, line: 303, baseType: !47, size: 32, align: 32, offset: 65792)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !94, file: !25, line: 304, baseType: !125, size: 256, align: 64, offset: 65856)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "NOTIFY", file: !25, line: 294, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "notify_data", file: !25, line: 287, size: 256, align: 64, elements: !127)
!127 = !{!128, !129, !130, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "modify_time", scope: !126, file: !25, line: 289, baseType: !38, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "status_time", scope: !126, file: !25, line: 290, baseType: !38, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "total_time", scope: !126, file: !25, line: 291, baseType: !38, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "num_entries", scope: !126, file: !25, line: 292, baseType: !37, size: 32, align: 32, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "info_class", scope: !94, file: !25, line: 305, baseType: !36, size: 32, align: 32, offset: 66112)
!133 = distinct !DIGlobalVariable(name: "zero", scope: !134, file: !46, line: 209, type: !140, isLocal: true, isDefinition: true, variable: i8* @ftruncate_growable.zero)
!134 = distinct !DISubprogram(name: "ftruncate_growable", scope: !46, file: !46, line: 205, type: !135, isLocal: true, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!135 = !DISubroutineType(types: !136)
!136 = !{!48, !48, !137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !138, line: 86, baseType: !114)
!138 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!139 = !{}
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!141 = distinct !DIGlobalVariable(name: "info", scope: !142, file: !46, line: 1064, type: !146, isLocal: true, isDefinition: true, variable: %struct.FsInfoType* @FsVolumeInfo.info)
!142 = distinct !DISubprogram(name: "FsVolumeInfo", scope: !46, file: !46, line: 1061, type: !143, isLocal: true, isDefinition: true, scopeLine: 1062, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !33}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "FsInfoType", file: !46, line: 156, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 150, size: 98368, align: 64, elements: !148)
!148 = !{!149, !150, !151, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !46, line: 152, baseType: !29, size: 32768, align: 8)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !147, file: !46, line: 153, baseType: !29, size: 32768, align: 8, offset: 32768)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !147, file: !46, line: 154, baseType: !112, size: 64, align: 64, offset: 65536)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !46, line: 155, baseType: !29, size: 32768, align: 8, offset: 65600)
!153 = !{i32 2, !"Dwarf Version", i32 4}
!154 = !{i32 2, !"Debug Info Version", i32 3}
!155 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!156 = distinct !DISubprogram(name: "disk_enum_devices", scope: !46, file: !46, line: 317, type: !157, isLocal: false, isDefinition: true, scopeLine: 318, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!157 = !DISubroutineType(types: !158)
!158 = !{!48, !35, !33}
!159 = !DILocalVariable(name: "id", arg: 1, scope: !156, file: !46, line: 317, type: !35)
!160 = !DIExpression()
!161 = !DILocation(line: 317, column: 28, scope: !156)
!162 = !DILocalVariable(name: "optarg", arg: 2, scope: !156, file: !46, line: 317, type: !33)
!163 = !DILocation(line: 317, column: 38, scope: !156)
!164 = !DILocalVariable(name: "pos", scope: !156, file: !46, line: 319, type: !33)
!165 = !DILocation(line: 319, column: 8, scope: !156)
!166 = !DILocation(line: 319, column: 14, scope: !156)
!167 = !DILocalVariable(name: "pos2", scope: !156, file: !46, line: 320, type: !33)
!168 = !DILocation(line: 320, column: 8, scope: !156)
!169 = !DILocalVariable(name: "count", scope: !156, file: !46, line: 321, type: !48)
!170 = !DILocation(line: 321, column: 6, scope: !156)
!171 = !DILocalVariable(name: "pdisk_data", scope: !156, file: !46, line: 322, type: !23)
!172 = !DILocation(line: 322, column: 15, scope: !156)
!173 = !DILocation(line: 325, column: 8, scope: !156)
!174 = !DILocation(line: 326, column: 2, scope: !156)
!175 = !DILocation(line: 326, column: 25, scope: !176)
!176 = !DILexicalBlockFile(scope: !156, file: !46, discriminator: 1)
!177 = !DILocation(line: 326, column: 16, scope: !176)
!178 = !DILocation(line: 326, column: 14, scope: !176)
!179 = !DILocation(line: 326, column: 39, scope: !176)
!180 = !DILocation(line: 326, column: 43, scope: !181)
!181 = !DILexicalBlockFile(scope: !156, file: !46, discriminator: 2)
!182 = !DILocation(line: 326, column: 42, scope: !181)
!183 = !DILocation(line: 326, column: 46, scope: !181)
!184 = !DILocation(line: 326, column: 2, scope: !185)
!185 = !DILexicalBlockFile(scope: !156, file: !46, discriminator: 3)
!186 = !DILocation(line: 328, column: 19, scope: !187)
!187 = distinct !DILexicalBlock(scope: !156, file: !46, line: 327, column: 2)
!188 = !DILocation(line: 328, column: 10, scope: !187)
!189 = !DILocation(line: 328, column: 8, scope: !187)
!190 = !DILocation(line: 330, column: 32, scope: !187)
!191 = !DILocation(line: 330, column: 16, scope: !187)
!192 = !DILocation(line: 330, column: 14, scope: !187)
!193 = !DILocation(line: 331, column: 10, scope: !187)
!194 = !DILocation(line: 331, column: 3, scope: !187)
!195 = !DILocation(line: 332, column: 11, scope: !187)
!196 = !DILocation(line: 332, column: 23, scope: !187)
!197 = !DILocation(line: 332, column: 29, scope: !187)
!198 = !DILocation(line: 332, column: 3, scope: !187)
!199 = !DILocation(line: 333, column: 27, scope: !187)
!200 = !DILocation(line: 333, column: 26, scope: !187)
!201 = !DILocation(line: 333, column: 11, scope: !187)
!202 = !DILocation(line: 333, column: 31, scope: !187)
!203 = !DILocation(line: 333, column: 37, scope: !187)
!204 = !DILocation(line: 333, column: 3, scope: !187)
!205 = !DILocation(line: 335, column: 60, scope: !187)
!206 = !DILocation(line: 335, column: 53, scope: !187)
!207 = !DILocation(line: 335, column: 66, scope: !187)
!208 = !DILocation(line: 335, column: 45, scope: !209)
!209 = !DILexicalBlockFile(scope: !187, file: !46, discriminator: 1)
!210 = !DILocation(line: 335, column: 19, scope: !187)
!211 = !DILocation(line: 335, column: 18, scope: !187)
!212 = !DILocation(line: 335, column: 3, scope: !187)
!213 = !DILocation(line: 335, column: 23, scope: !187)
!214 = !DILocation(line: 335, column: 34, scope: !187)
!215 = !DILocation(line: 336, column: 26, scope: !187)
!216 = !DILocation(line: 336, column: 25, scope: !187)
!217 = !DILocation(line: 336, column: 10, scope: !187)
!218 = !DILocation(line: 336, column: 30, scope: !187)
!219 = !DILocation(line: 336, column: 42, scope: !187)
!220 = !DILocation(line: 336, column: 3, scope: !187)
!221 = !DILocation(line: 337, column: 19, scope: !187)
!222 = !DILocation(line: 337, column: 18, scope: !187)
!223 = !DILocation(line: 337, column: 3, scope: !187)
!224 = !DILocation(line: 337, column: 23, scope: !187)
!225 = !DILocation(line: 337, column: 35, scope: !187)
!226 = !DILocation(line: 338, column: 47, scope: !187)
!227 = !DILocation(line: 338, column: 38, scope: !187)
!228 = !DILocation(line: 338, column: 19, scope: !187)
!229 = !DILocation(line: 338, column: 18, scope: !187)
!230 = !DILocation(line: 338, column: 3, scope: !187)
!231 = !DILocation(line: 338, column: 23, scope: !187)
!232 = !DILocation(line: 338, column: 36, scope: !187)
!233 = !DILocation(line: 340, column: 8, scope: !187)
!234 = !DILocation(line: 341, column: 5, scope: !187)
!235 = !DILocation(line: 341, column: 8, scope: !187)
!236 = !DILocation(line: 343, column: 12, scope: !187)
!237 = !DILocation(line: 343, column: 10, scope: !187)
!238 = !DILocation(line: 326, column: 2, scope: !239)
!239 = !DILexicalBlockFile(scope: !156, file: !46, discriminator: 4)
!240 = distinct !{!240, !174}
!241 = !DILocation(line: 345, column: 9, scope: !156)
!242 = !DILocation(line: 345, column: 2, scope: !156)
!243 = distinct !DISubprogram(name: "disk_query_information", scope: !46, file: !46, line: 654, type: !244, isLocal: false, isDefinition: true, scopeLine: 655, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!244 = !DISubroutineType(types: !245)
!245 = !{!57, !59, !36, !76}
!246 = !DILocalVariable(name: "handle", arg: 1, scope: !243, file: !46, line: 654, type: !59)
!247 = !DILocation(line: 654, column: 36, scope: !243)
!248 = !DILocalVariable(name: "info_class", arg: 2, scope: !243, file: !46, line: 654, type: !36)
!249 = !DILocation(line: 654, column: 51, scope: !243)
!250 = !DILocalVariable(name: "out", arg: 3, scope: !243, file: !46, line: 654, type: !76)
!251 = !DILocation(line: 654, column: 70, scope: !243)
!252 = !DILocalVariable(name: "file_attributes", scope: !243, file: !46, line: 656, type: !36)
!253 = !DILocation(line: 656, column: 9, scope: !243)
!254 = !DILocalVariable(name: "ft_high", scope: !243, file: !46, line: 656, type: !36)
!255 = !DILocation(line: 656, column: 26, scope: !243)
!256 = !DILocalVariable(name: "ft_low", scope: !243, file: !46, line: 656, type: !36)
!257 = !DILocation(line: 656, column: 35, scope: !243)
!258 = !DILocalVariable(name: "filestat", scope: !243, file: !46, line: 657, type: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !260, line: 46, size: 1152, align: 64, elements: !261)
!260 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!261 = !{!262, !264, !265, !267, !269, !271, !273, !274, !275, !276, !278, !280, !286, !287, !288}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !259, file: !260, line: 48, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !41, line: 124, baseType: !112)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !259, file: !260, line: 53, baseType: !111, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !259, file: !260, line: 61, baseType: !266, size: 64, align: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !41, line: 130, baseType: !112)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !259, file: !260, line: 62, baseType: !268, size: 32, align: 32, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !41, line: 129, baseType: !37)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !259, file: !260, line: 64, baseType: !270, size: 32, align: 32, offset: 224)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !41, line: 125, baseType: !37)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !259, file: !260, line: 65, baseType: !272, size: 32, align: 32, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !41, line: 126, baseType: !37)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !259, file: !260, line: 67, baseType: !48, size: 32, align: 32, offset: 288)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !259, file: !260, line: 69, baseType: !263, size: 64, align: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !259, file: !260, line: 74, baseType: !114, size: 64, align: 64, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !259, file: !260, line: 78, baseType: !277, size: 64, align: 64, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !41, line: 153, baseType: !42)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !259, file: !260, line: 80, baseType: !279, size: 64, align: 64, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !41, line: 158, baseType: !42)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !259, file: !260, line: 91, baseType: !281, size: 128, align: 64, offset: 576)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !39, line: 120, size: 128, align: 64, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !281, file: !39, line: 122, baseType: !40, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !281, file: !39, line: 123, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !41, line: 175, baseType: !42)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !259, file: !260, line: 92, baseType: !281, size: 128, align: 64, offset: 704)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !259, file: !260, line: 93, baseType: !281, size: 128, align: 64, offset: 832)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !259, file: !260, line: 106, baseType: !289, size: 192, align: 64, offset: 960)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 192, align: 64, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 3)
!292 = !DILocation(line: 657, column: 14, scope: !243)
!293 = !DILocalVariable(name: "path", scope: !243, file: !46, line: 658, type: !33)
!294 = !DILocation(line: 658, column: 8, scope: !243)
!295 = !DILocalVariable(name: "filename", scope: !243, file: !46, line: 658, type: !33)
!296 = !DILocation(line: 658, column: 15, scope: !243)
!297 = !DILocation(line: 660, column: 78, scope: !243)
!298 = !DILocation(line: 661, column: 9, scope: !243)
!299 = !DILocation(line: 660, column: 2, scope: !243)
!300 = !DILocation(line: 663, column: 20, scope: !243)
!301 = !DILocation(line: 663, column: 9, scope: !243)
!302 = !DILocation(line: 663, column: 28, scope: !243)
!303 = !DILocation(line: 663, column: 7, scope: !243)
!304 = !DILocation(line: 666, column: 12, scope: !305)
!305 = distinct !DILexicalBlock(scope: !243, file: !46, line: 666, column: 6)
!306 = !DILocation(line: 666, column: 6, scope: !305)
!307 = !DILocation(line: 666, column: 31, scope: !305)
!308 = !DILocation(line: 666, column: 6, scope: !243)
!309 = !DILocation(line: 668, column: 80, scope: !310)
!310 = distinct !DILexicalBlock(scope: !305, file: !46, line: 667, column: 2)
!311 = !DILocation(line: 668, column: 79, scope: !310)
!312 = !DILocation(line: 668, column: 70, scope: !313)
!313 = !DILexicalBlockFile(scope: !310, file: !46, discriminator: 1)
!314 = !DILocation(line: 668, column: 3, scope: !315)
!315 = !DILexicalBlockFile(scope: !310, file: !46, discriminator: 2)
!316 = !DILocation(line: 669, column: 6, scope: !310)
!317 = !DILocation(line: 669, column: 12, scope: !310)
!318 = !DILocation(line: 669, column: 13, scope: !310)
!319 = !DILocation(line: 669, column: 17, scope: !310)
!320 = !DILocation(line: 670, column: 3, scope: !310)
!321 = !DILocation(line: 674, column: 18, scope: !243)
!322 = !DILocation(line: 675, column: 14, scope: !323)
!323 = distinct !DILexicalBlock(scope: !243, file: !46, line: 675, column: 5)
!324 = !DILocation(line: 675, column: 8, scope: !323)
!325 = !DILocation(line: 675, column: 19, scope: !323)
!326 = !DILocation(line: 675, column: 5, scope: !243)
!327 = !DILocation(line: 676, column: 19, scope: !323)
!328 = !DILocation(line: 676, column: 3, scope: !323)
!329 = !DILocation(line: 678, column: 21, scope: !243)
!330 = !DILocation(line: 678, column: 13, scope: !243)
!331 = !DILocation(line: 678, column: 11, scope: !243)
!332 = !DILocation(line: 679, column: 6, scope: !333)
!333 = distinct !DILexicalBlock(scope: !243, file: !46, line: 679, column: 6)
!334 = !DILocation(line: 679, column: 6, scope: !243)
!335 = !DILocation(line: 680, column: 12, scope: !333)
!336 = !DILocation(line: 680, column: 3, scope: !333)
!337 = !DILocation(line: 682, column: 6, scope: !338)
!338 = distinct !DILexicalBlock(scope: !243, file: !46, line: 682, column: 6)
!339 = !DILocation(line: 682, column: 15, scope: !338)
!340 = !DILocation(line: 682, column: 18, scope: !341)
!341 = !DILexicalBlockFile(scope: !338, file: !46, discriminator: 1)
!342 = !DILocation(line: 682, column: 30, scope: !341)
!343 = !DILocation(line: 682, column: 6, scope: !341)
!344 = !DILocation(line: 683, column: 19, scope: !338)
!345 = !DILocation(line: 683, column: 3, scope: !338)
!346 = !DILocation(line: 685, column: 7, scope: !347)
!347 = distinct !DILexicalBlock(scope: !243, file: !46, line: 685, column: 6)
!348 = !DILocation(line: 685, column: 6, scope: !243)
!349 = !DILocation(line: 686, column: 19, scope: !347)
!350 = !DILocation(line: 686, column: 3, scope: !347)
!351 = !DILocation(line: 688, column: 17, scope: !352)
!352 = distinct !DILexicalBlock(scope: !243, file: !46, line: 688, column: 6)
!353 = !DILocation(line: 688, column: 25, scope: !352)
!354 = !DILocation(line: 688, column: 6, scope: !243)
!355 = !DILocation(line: 689, column: 19, scope: !352)
!356 = !DILocation(line: 689, column: 3, scope: !352)
!357 = !DILocation(line: 692, column: 10, scope: !243)
!358 = !DILocation(line: 692, column: 2, scope: !243)
!359 = !DILocation(line: 695, column: 35, scope: !360)
!360 = distinct !DILexicalBlock(scope: !243, file: !46, line: 693, column: 2)
!361 = !DILocation(line: 695, column: 4, scope: !362)
!362 = !DILexicalBlockFile(scope: !360, file: !46, discriminator: 1)
!363 = !DILocation(line: 697, column: 30, scope: !364)
!364 = distinct !DILexicalBlock(scope: !360, file: !46, line: 697, column: 4)
!365 = !DILocation(line: 697, column: 19, scope: !364)
!366 = !DILocation(line: 697, column: 25, scope: !364)
!367 = !DILocation(line: 697, column: 6, scope: !364)
!368 = !DILocation(line: 697, column: 28, scope: !364)
!369 = !DILocation(line: 697, column: 39, scope: !364)
!370 = !DILocation(line: 697, column: 45, scope: !364)
!371 = !DILocation(line: 697, column: 47, scope: !364)
!372 = !DILocation(line: 698, column: 30, scope: !373)
!373 = distinct !DILexicalBlock(scope: !360, file: !46, line: 698, column: 4)
!374 = !DILocation(line: 698, column: 19, scope: !373)
!375 = !DILocation(line: 698, column: 25, scope: !373)
!376 = !DILocation(line: 698, column: 6, scope: !373)
!377 = !DILocation(line: 698, column: 28, scope: !373)
!378 = !DILocation(line: 698, column: 40, scope: !373)
!379 = !DILocation(line: 698, column: 46, scope: !373)
!380 = !DILocation(line: 698, column: 48, scope: !373)
!381 = !DILocation(line: 700, column: 43, scope: !360)
!382 = !DILocation(line: 700, column: 51, scope: !360)
!383 = !DILocation(line: 700, column: 4, scope: !360)
!384 = !DILocation(line: 701, column: 30, scope: !385)
!385 = distinct !DILexicalBlock(scope: !360, file: !46, line: 701, column: 4)
!386 = !DILocation(line: 701, column: 19, scope: !385)
!387 = !DILocation(line: 701, column: 25, scope: !385)
!388 = !DILocation(line: 701, column: 6, scope: !385)
!389 = !DILocation(line: 701, column: 28, scope: !385)
!390 = !DILocation(line: 701, column: 39, scope: !385)
!391 = !DILocation(line: 701, column: 45, scope: !385)
!392 = !DILocation(line: 701, column: 47, scope: !385)
!393 = !DILocation(line: 702, column: 30, scope: !394)
!394 = distinct !DILexicalBlock(scope: !360, file: !46, line: 702, column: 4)
!395 = !DILocation(line: 702, column: 19, scope: !394)
!396 = !DILocation(line: 702, column: 25, scope: !394)
!397 = !DILocation(line: 702, column: 6, scope: !394)
!398 = !DILocation(line: 702, column: 28, scope: !394)
!399 = !DILocation(line: 702, column: 40, scope: !394)
!400 = !DILocation(line: 702, column: 46, scope: !394)
!401 = !DILocation(line: 702, column: 48, scope: !394)
!402 = !DILocation(line: 704, column: 43, scope: !360)
!403 = !DILocation(line: 704, column: 51, scope: !360)
!404 = !DILocation(line: 704, column: 4, scope: !360)
!405 = !DILocation(line: 705, column: 30, scope: !406)
!406 = distinct !DILexicalBlock(scope: !360, file: !46, line: 705, column: 4)
!407 = !DILocation(line: 705, column: 19, scope: !406)
!408 = !DILocation(line: 705, column: 25, scope: !406)
!409 = !DILocation(line: 705, column: 6, scope: !406)
!410 = !DILocation(line: 705, column: 28, scope: !406)
!411 = !DILocation(line: 705, column: 39, scope: !406)
!412 = !DILocation(line: 705, column: 45, scope: !406)
!413 = !DILocation(line: 705, column: 47, scope: !406)
!414 = !DILocation(line: 706, column: 30, scope: !415)
!415 = distinct !DILexicalBlock(scope: !360, file: !46, line: 706, column: 4)
!416 = !DILocation(line: 706, column: 19, scope: !415)
!417 = !DILocation(line: 706, column: 25, scope: !415)
!418 = !DILocation(line: 706, column: 6, scope: !415)
!419 = !DILocation(line: 706, column: 28, scope: !415)
!420 = !DILocation(line: 706, column: 40, scope: !415)
!421 = !DILocation(line: 706, column: 46, scope: !415)
!422 = !DILocation(line: 706, column: 48, scope: !415)
!423 = !DILocation(line: 708, column: 43, scope: !360)
!424 = !DILocation(line: 708, column: 51, scope: !360)
!425 = !DILocation(line: 708, column: 4, scope: !360)
!426 = !DILocation(line: 709, column: 30, scope: !427)
!427 = distinct !DILexicalBlock(scope: !360, file: !46, line: 709, column: 4)
!428 = !DILocation(line: 709, column: 19, scope: !427)
!429 = !DILocation(line: 709, column: 25, scope: !427)
!430 = !DILocation(line: 709, column: 6, scope: !427)
!431 = !DILocation(line: 709, column: 28, scope: !427)
!432 = !DILocation(line: 709, column: 39, scope: !427)
!433 = !DILocation(line: 709, column: 45, scope: !427)
!434 = !DILocation(line: 709, column: 47, scope: !427)
!435 = !DILocation(line: 710, column: 30, scope: !436)
!436 = distinct !DILexicalBlock(scope: !360, file: !46, line: 710, column: 4)
!437 = !DILocation(line: 710, column: 19, scope: !436)
!438 = !DILocation(line: 710, column: 25, scope: !436)
!439 = !DILocation(line: 710, column: 6, scope: !436)
!440 = !DILocation(line: 710, column: 28, scope: !436)
!441 = !DILocation(line: 710, column: 40, scope: !436)
!442 = !DILocation(line: 710, column: 46, scope: !436)
!443 = !DILocation(line: 710, column: 48, scope: !436)
!444 = !DILocation(line: 712, column: 30, scope: !445)
!445 = distinct !DILexicalBlock(scope: !360, file: !46, line: 712, column: 4)
!446 = !DILocation(line: 712, column: 19, scope: !445)
!447 = !DILocation(line: 712, column: 25, scope: !445)
!448 = !DILocation(line: 712, column: 6, scope: !445)
!449 = !DILocation(line: 712, column: 28, scope: !445)
!450 = !DILocation(line: 712, column: 48, scope: !445)
!451 = !DILocation(line: 712, column: 54, scope: !445)
!452 = !DILocation(line: 712, column: 56, scope: !445)
!453 = !DILocation(line: 713, column: 4, scope: !360)
!454 = !DILocation(line: 717, column: 42, scope: !455)
!455 = distinct !DILexicalBlock(scope: !456, file: !46, line: 717, column: 6)
!456 = distinct !DILexicalBlock(scope: !360, file: !46, line: 717, column: 4)
!457 = !DILocation(line: 717, column: 51, scope: !455)
!458 = !DILocation(line: 717, column: 32, scope: !455)
!459 = !DILocation(line: 717, column: 21, scope: !455)
!460 = !DILocation(line: 717, column: 27, scope: !455)
!461 = !DILocation(line: 717, column: 8, scope: !455)
!462 = !DILocation(line: 717, column: 30, scope: !455)
!463 = !DILocation(line: 717, column: 66, scope: !455)
!464 = !DILocation(line: 717, column: 72, scope: !455)
!465 = !DILocation(line: 717, column: 74, scope: !455)
!466 = !DILocation(line: 717, column: 120, scope: !467)
!467 = distinct !DILexicalBlock(scope: !456, file: !46, line: 717, column: 83)
!468 = !DILocation(line: 717, column: 129, scope: !467)
!469 = !DILocation(line: 717, column: 136, scope: !467)
!470 = !DILocation(line: 717, column: 109, scope: !467)
!471 = !DILocation(line: 717, column: 98, scope: !467)
!472 = !DILocation(line: 717, column: 104, scope: !467)
!473 = !DILocation(line: 717, column: 85, scope: !467)
!474 = !DILocation(line: 717, column: 107, scope: !467)
!475 = !DILocation(line: 717, column: 151, scope: !467)
!476 = !DILocation(line: 717, column: 157, scope: !467)
!477 = !DILocation(line: 717, column: 159, scope: !467)
!478 = !DILocation(line: 718, column: 42, scope: !479)
!479 = distinct !DILexicalBlock(scope: !480, file: !46, line: 718, column: 6)
!480 = distinct !DILexicalBlock(scope: !360, file: !46, line: 718, column: 4)
!481 = !DILocation(line: 718, column: 51, scope: !479)
!482 = !DILocation(line: 718, column: 32, scope: !479)
!483 = !DILocation(line: 718, column: 21, scope: !479)
!484 = !DILocation(line: 718, column: 27, scope: !479)
!485 = !DILocation(line: 718, column: 8, scope: !479)
!486 = !DILocation(line: 718, column: 30, scope: !479)
!487 = !DILocation(line: 718, column: 66, scope: !479)
!488 = !DILocation(line: 718, column: 72, scope: !479)
!489 = !DILocation(line: 718, column: 74, scope: !479)
!490 = !DILocation(line: 718, column: 120, scope: !491)
!491 = distinct !DILexicalBlock(scope: !480, file: !46, line: 718, column: 83)
!492 = !DILocation(line: 718, column: 129, scope: !491)
!493 = !DILocation(line: 718, column: 136, scope: !491)
!494 = !DILocation(line: 718, column: 109, scope: !491)
!495 = !DILocation(line: 718, column: 98, scope: !491)
!496 = !DILocation(line: 718, column: 104, scope: !491)
!497 = !DILocation(line: 718, column: 85, scope: !491)
!498 = !DILocation(line: 718, column: 107, scope: !491)
!499 = !DILocation(line: 718, column: 151, scope: !491)
!500 = !DILocation(line: 718, column: 157, scope: !491)
!501 = !DILocation(line: 718, column: 159, scope: !491)
!502 = !DILocation(line: 720, column: 39, scope: !503)
!503 = distinct !DILexicalBlock(scope: !360, file: !46, line: 720, column: 4)
!504 = !DILocation(line: 720, column: 30, scope: !503)
!505 = !DILocation(line: 720, column: 19, scope: !503)
!506 = !DILocation(line: 720, column: 25, scope: !503)
!507 = !DILocation(line: 720, column: 6, scope: !503)
!508 = !DILocation(line: 720, column: 28, scope: !503)
!509 = !DILocation(line: 720, column: 50, scope: !503)
!510 = !DILocation(line: 720, column: 56, scope: !503)
!511 = !DILocation(line: 720, column: 58, scope: !503)
!512 = !DILocation(line: 721, column: 7, scope: !360)
!513 = !DILocation(line: 721, column: 13, scope: !360)
!514 = !DILocation(line: 721, column: 14, scope: !360)
!515 = !DILocation(line: 721, column: 18, scope: !360)
!516 = !DILocation(line: 722, column: 12, scope: !360)
!517 = !DILocation(line: 722, column: 6, scope: !360)
!518 = !DILocation(line: 722, column: 17, scope: !360)
!519 = !DILocation(line: 722, column: 3, scope: !360)
!520 = !DILocation(line: 722, column: 7, scope: !360)
!521 = !DILocation(line: 722, column: 13, scope: !360)
!522 = !DILocation(line: 722, column: 14, scope: !360)
!523 = !DILocation(line: 722, column: 18, scope: !360)
!524 = !DILocation(line: 723, column: 4, scope: !360)
!525 = !DILocation(line: 727, column: 30, scope: !526)
!526 = distinct !DILexicalBlock(scope: !360, file: !46, line: 727, column: 4)
!527 = !DILocation(line: 727, column: 19, scope: !526)
!528 = !DILocation(line: 727, column: 25, scope: !526)
!529 = !DILocation(line: 727, column: 6, scope: !526)
!530 = !DILocation(line: 727, column: 28, scope: !526)
!531 = !DILocation(line: 727, column: 48, scope: !526)
!532 = !DILocation(line: 727, column: 54, scope: !526)
!533 = !DILocation(line: 727, column: 56, scope: !526)
!534 = !DILocation(line: 728, column: 19, scope: !535)
!535 = distinct !DILexicalBlock(scope: !360, file: !46, line: 728, column: 4)
!536 = !DILocation(line: 728, column: 25, scope: !535)
!537 = !DILocation(line: 728, column: 6, scope: !535)
!538 = !DILocation(line: 728, column: 28, scope: !535)
!539 = !DILocation(line: 728, column: 34, scope: !535)
!540 = !DILocation(line: 728, column: 40, scope: !535)
!541 = !DILocation(line: 728, column: 42, scope: !535)
!542 = !DILocation(line: 729, column: 4, scope: !360)
!543 = !DILocation(line: 734, column: 11, scope: !360)
!544 = !DILocation(line: 732, column: 4, scope: !360)
!545 = !DILocation(line: 735, column: 4, scope: !360)
!546 = !DILocation(line: 737, column: 2, scope: !243)
!547 = !DILocation(line: 738, column: 1, scope: !243)
!548 = distinct !DISubprogram(name: "seconds_since_1970_to_filetime", scope: !46, file: !46, line: 176, type: !549, isLocal: true, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !38, !35, !35}
!551 = !DILocalVariable(name: "seconds", arg: 1, scope: !548, file: !46, line: 176, type: !38)
!552 = !DILocation(line: 176, column: 39, scope: !548)
!553 = !DILocalVariable(name: "high", arg: 2, scope: !548, file: !46, line: 176, type: !35)
!554 = !DILocation(line: 176, column: 57, scope: !548)
!555 = !DILocalVariable(name: "low", arg: 3, scope: !548, file: !46, line: 176, type: !35)
!556 = !DILocation(line: 176, column: 72, scope: !548)
!557 = !DILocalVariable(name: "ticks", scope: !548, file: !46, line: 178, type: !43)
!558 = !DILocation(line: 178, column: 21, scope: !548)
!559 = !DILocation(line: 180, column: 11, scope: !548)
!560 = !DILocation(line: 180, column: 19, scope: !548)
!561 = !DILocation(line: 180, column: 36, scope: !548)
!562 = !DILocation(line: 180, column: 8, scope: !548)
!563 = !DILocation(line: 181, column: 18, scope: !548)
!564 = !DILocation(line: 181, column: 9, scope: !548)
!565 = !DILocation(line: 181, column: 3, scope: !548)
!566 = !DILocation(line: 181, column: 7, scope: !548)
!567 = !DILocation(line: 182, column: 20, scope: !548)
!568 = !DILocation(line: 182, column: 26, scope: !548)
!569 = !DILocation(line: 182, column: 10, scope: !548)
!570 = !DILocation(line: 182, column: 3, scope: !548)
!571 = !DILocation(line: 182, column: 8, scope: !548)
!572 = !DILocation(line: 183, column: 1, scope: !548)
!573 = distinct !DISubprogram(name: "get_create_time", scope: !46, file: !46, line: 161, type: !574, isLocal: true, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!574 = !DISubroutineType(types: !575)
!575 = !{!38, !576}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!577 = !DILocalVariable(name: "filestat", arg: 1, scope: !573, file: !46, line: 161, type: !576)
!578 = !DILocation(line: 161, column: 30, scope: !573)
!579 = !DILocalVariable(name: "ret", scope: !573, file: !46, line: 163, type: !38)
!580 = !DILocation(line: 163, column: 9, scope: !573)
!581 = !DILocalVariable(name: "ret1", scope: !573, file: !46, line: 163, type: !38)
!582 = !DILocation(line: 163, column: 14, scope: !573)
!583 = !DILocation(line: 165, column: 7, scope: !573)
!584 = !DILocation(line: 165, column: 15, scope: !573)
!585 = !DILocation(line: 165, column: 22, scope: !573)
!586 = !DILocation(line: 165, column: 8, scope: !573)
!587 = !DILocation(line: 165, column: 7, scope: !588)
!588 = !DILexicalBlockFile(scope: !573, file: !46, discriminator: 1)
!589 = !DILocation(line: 165, column: 15, scope: !588)
!590 = !DILocation(line: 165, column: 8, scope: !588)
!591 = !DILocation(line: 165, column: 7, scope: !592)
!592 = !DILexicalBlockFile(scope: !573, file: !46, discriminator: 2)
!593 = !DILocation(line: 165, column: 15, scope: !592)
!594 = !DILocation(line: 165, column: 8, scope: !592)
!595 = !DILocation(line: 165, column: 8, scope: !596)
!596 = !DILexicalBlockFile(scope: !573, file: !46, discriminator: 3)
!597 = !DILocation(line: 165, column: 6, scope: !596)
!598 = !DILocation(line: 166, column: 8, scope: !573)
!599 = !DILocation(line: 166, column: 16, scope: !573)
!600 = !DILocation(line: 166, column: 9, scope: !573)
!601 = !DILocation(line: 166, column: 8, scope: !588)
!602 = !DILocation(line: 166, column: 9, scope: !588)
!603 = !DILocation(line: 166, column: 8, scope: !592)
!604 = !DILocation(line: 166, column: 16, scope: !592)
!605 = !DILocation(line: 166, column: 9, scope: !592)
!606 = !DILocation(line: 166, column: 9, scope: !596)
!607 = !DILocation(line: 166, column: 7, scope: !596)
!608 = !DILocation(line: 168, column: 6, scope: !609)
!609 = distinct !DILexicalBlock(scope: !573, file: !46, line: 168, column: 6)
!610 = !DILocation(line: 168, column: 11, scope: !609)
!611 = !DILocation(line: 168, column: 6, scope: !573)
!612 = !DILocation(line: 169, column: 10, scope: !609)
!613 = !DILocation(line: 169, column: 3, scope: !609)
!614 = !DILocation(line: 171, column: 9, scope: !573)
!615 = !DILocation(line: 171, column: 2, scope: !573)
!616 = !DILocation(line: 172, column: 1, scope: !573)
!617 = distinct !DISubprogram(name: "disk_set_information", scope: !46, file: !46, line: 742, type: !74, isLocal: false, isDefinition: true, scopeLine: 743, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!618 = !DILocalVariable(name: "handle", arg: 1, scope: !617, file: !46, line: 742, type: !59)
!619 = !DILocation(line: 742, column: 34, scope: !617)
!620 = !DILocalVariable(name: "info_class", arg: 2, scope: !617, file: !46, line: 742, type: !36)
!621 = !DILocation(line: 742, column: 49, scope: !617)
!622 = !DILocalVariable(name: "in", arg: 3, scope: !617, file: !46, line: 742, type: !76)
!623 = !DILocation(line: 742, column: 68, scope: !617)
!624 = !DILocalVariable(name: "out", arg: 4, scope: !617, file: !46, line: 742, type: !76)
!625 = !DILocation(line: 742, column: 79, scope: !617)
!626 = !DILocation(line: 744, column: 9, scope: !617)
!627 = !DILocalVariable(name: "length", scope: !617, file: !46, line: 745, type: !36)
!628 = !DILocation(line: 745, column: 9, scope: !617)
!629 = !DILocalVariable(name: "file_attributes", scope: !617, file: !46, line: 745, type: !36)
!630 = !DILocation(line: 745, column: 17, scope: !617)
!631 = !DILocalVariable(name: "ft_high", scope: !617, file: !46, line: 745, type: !36)
!632 = !DILocation(line: 745, column: 34, scope: !617)
!633 = !DILocalVariable(name: "ft_low", scope: !617, file: !46, line: 745, type: !36)
!634 = !DILocation(line: 745, column: 43, scope: !617)
!635 = !DILocalVariable(name: "newname", scope: !617, file: !46, line: 746, type: !33)
!636 = !DILocation(line: 746, column: 8, scope: !617)
!637 = !DILocalVariable(name: "fullpath", scope: !617, file: !46, line: 746, type: !29)
!638 = !DILocation(line: 746, column: 17, scope: !617)
!639 = !DILocalVariable(name: "pfinfo", scope: !617, file: !46, line: 747, type: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!641 = !DILocation(line: 747, column: 19, scope: !617)
!642 = !DILocalVariable(name: "mode", scope: !617, file: !46, line: 748, type: !48)
!643 = !DILocation(line: 748, column: 6, scope: !617)
!644 = !DILocalVariable(name: "filestat", scope: !617, file: !46, line: 749, type: !259)
!645 = !DILocation(line: 749, column: 14, scope: !617)
!646 = !DILocalVariable(name: "write_time", scope: !617, file: !46, line: 750, type: !38)
!647 = !DILocation(line: 750, column: 9, scope: !617)
!648 = !DILocalVariable(name: "change_time", scope: !617, file: !46, line: 750, type: !38)
!649 = !DILocation(line: 750, column: 21, scope: !617)
!650 = !DILocalVariable(name: "access_time", scope: !617, file: !46, line: 750, type: !38)
!651 = !DILocation(line: 750, column: 34, scope: !617)
!652 = !DILocalVariable(name: "mod_time", scope: !617, file: !46, line: 750, type: !38)
!653 = !DILocation(line: 750, column: 47, scope: !617)
!654 = !DILocalVariable(name: "tvs", scope: !617, file: !46, line: 751, type: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utimbuf", file: !656, line: 37, size: 128, align: 64, elements: !657)
!656 = !DIFile(filename: "/usr/include/utime.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "actime", scope: !655, file: !656, line: 39, baseType: !40, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "modtime", scope: !655, file: !656, line: 40, baseType: !40, size: 64, align: 64, offset: 64)
!660 = !DILocation(line: 751, column: 17, scope: !617)
!661 = !DILocalVariable(name: "stat_fs", scope: !617, file: !46, line: 752, type: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statvfs", file: !663, line: 29, size: 896, align: 64, elements: !664)
!663 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/statvfs.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!664 = !{!665, !666, !667, !669, !670, !671, !673, !674, !675, !676, !677, !678}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "f_bsize", scope: !662, file: !663, line: 31, baseType: !112, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "f_frsize", scope: !662, file: !663, line: 32, baseType: !112, size: 64, align: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "f_blocks", scope: !662, file: !663, line: 34, baseType: !668, size: 64, align: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsblkcnt_t", file: !41, line: 162, baseType: !112)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "f_bfree", scope: !662, file: !663, line: 35, baseType: !668, size: 64, align: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "f_bavail", scope: !662, file: !663, line: 36, baseType: !668, size: 64, align: 64, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "f_files", scope: !662, file: !663, line: 37, baseType: !672, size: 64, align: 64, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsfilcnt_t", file: !41, line: 166, baseType: !112)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "f_ffree", scope: !662, file: !663, line: 38, baseType: !672, size: 64, align: 64, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "f_favail", scope: !662, file: !663, line: 39, baseType: !672, size: 64, align: 64, offset: 448)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "f_fsid", scope: !662, file: !663, line: 48, baseType: !112, size: 64, align: 64, offset: 512)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "f_flag", scope: !662, file: !663, line: 52, baseType: !112, size: 64, align: 64, offset: 576)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "f_namemax", scope: !662, file: !663, line: 53, baseType: !112, size: 64, align: 64, offset: 640)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "__f_spare", scope: !662, file: !663, line: 54, baseType: !679, size: 192, align: 32, offset: 704)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 192, align: 32, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 6)
!682 = !DILocation(line: 752, column: 17, scope: !617)
!683 = !DILocation(line: 754, column: 81, scope: !617)
!684 = !DILocation(line: 755, column: 9, scope: !617)
!685 = !DILocation(line: 754, column: 2, scope: !617)
!686 = !DILocation(line: 757, column: 24, scope: !617)
!687 = !DILocation(line: 757, column: 13, scope: !617)
!688 = !DILocation(line: 757, column: 9, scope: !617)
!689 = !DILocation(line: 758, column: 17, scope: !617)
!690 = !DILocation(line: 759, column: 10, scope: !617)
!691 = !DILocation(line: 761, column: 10, scope: !617)
!692 = !DILocation(line: 761, column: 2, scope: !617)
!693 = !DILocation(line: 764, column: 43, scope: !694)
!694 = distinct !DILexicalBlock(scope: !617, file: !46, line: 762, column: 2)
!695 = !DILocation(line: 764, column: 29, scope: !694)
!696 = !DILocation(line: 764, column: 15, scope: !694)
!697 = !DILocation(line: 766, column: 5, scope: !694)
!698 = !DILocation(line: 766, column: 10, scope: !694)
!699 = !DILocation(line: 766, column: 12, scope: !694)
!700 = !DILocation(line: 767, column: 5, scope: !694)
!701 = !DILocation(line: 767, column: 10, scope: !694)
!702 = !DILocation(line: 767, column: 12, scope: !694)
!703 = !DILocation(line: 770, column: 28, scope: !704)
!704 = distinct !DILexicalBlock(scope: !694, file: !46, line: 770, column: 4)
!705 = !DILocation(line: 770, column: 33, scope: !704)
!706 = !DILocation(line: 770, column: 15, scope: !704)
!707 = !DILocation(line: 770, column: 13, scope: !704)
!708 = !DILocation(line: 770, column: 38, scope: !704)
!709 = !DILocation(line: 770, column: 43, scope: !704)
!710 = !DILocation(line: 770, column: 45, scope: !704)
!711 = !DILocation(line: 771, column: 29, scope: !712)
!712 = distinct !DILexicalBlock(scope: !694, file: !46, line: 771, column: 4)
!713 = !DILocation(line: 771, column: 34, scope: !712)
!714 = !DILocation(line: 771, column: 16, scope: !712)
!715 = !DILocation(line: 771, column: 14, scope: !712)
!716 = !DILocation(line: 771, column: 39, scope: !712)
!717 = !DILocation(line: 771, column: 44, scope: !712)
!718 = !DILocation(line: 771, column: 46, scope: !712)
!719 = !DILocation(line: 774, column: 28, scope: !720)
!720 = distinct !DILexicalBlock(scope: !694, file: !46, line: 774, column: 4)
!721 = !DILocation(line: 774, column: 33, scope: !720)
!722 = !DILocation(line: 774, column: 15, scope: !720)
!723 = !DILocation(line: 774, column: 13, scope: !720)
!724 = !DILocation(line: 774, column: 38, scope: !720)
!725 = !DILocation(line: 774, column: 43, scope: !720)
!726 = !DILocation(line: 774, column: 45, scope: !720)
!727 = !DILocation(line: 775, column: 29, scope: !728)
!728 = distinct !DILexicalBlock(scope: !694, file: !46, line: 775, column: 4)
!729 = !DILocation(line: 775, column: 34, scope: !728)
!730 = !DILocation(line: 775, column: 16, scope: !728)
!731 = !DILocation(line: 775, column: 14, scope: !728)
!732 = !DILocation(line: 775, column: 39, scope: !728)
!733 = !DILocation(line: 775, column: 44, scope: !728)
!734 = !DILocation(line: 775, column: 46, scope: !728)
!735 = !DILocation(line: 776, column: 8, scope: !736)
!736 = distinct !DILexicalBlock(scope: !694, file: !46, line: 776, column: 8)
!737 = !DILocation(line: 776, column: 15, scope: !736)
!738 = !DILocation(line: 776, column: 18, scope: !739)
!739 = !DILexicalBlockFile(scope: !736, file: !46, discriminator: 1)
!740 = !DILocation(line: 776, column: 8, scope: !739)
!741 = !DILocation(line: 777, column: 44, scope: !736)
!742 = !DILocation(line: 777, column: 53, scope: !736)
!743 = !DILocation(line: 777, column: 19, scope: !736)
!744 = !DILocation(line: 777, column: 17, scope: !736)
!745 = !DILocation(line: 777, column: 5, scope: !736)
!746 = !DILocation(line: 780, column: 28, scope: !747)
!747 = distinct !DILexicalBlock(scope: !694, file: !46, line: 780, column: 4)
!748 = !DILocation(line: 780, column: 33, scope: !747)
!749 = !DILocation(line: 780, column: 15, scope: !747)
!750 = !DILocation(line: 780, column: 13, scope: !747)
!751 = !DILocation(line: 780, column: 38, scope: !747)
!752 = !DILocation(line: 780, column: 43, scope: !747)
!753 = !DILocation(line: 780, column: 45, scope: !747)
!754 = !DILocation(line: 781, column: 29, scope: !755)
!755 = distinct !DILexicalBlock(scope: !694, file: !46, line: 781, column: 4)
!756 = !DILocation(line: 781, column: 34, scope: !755)
!757 = !DILocation(line: 781, column: 16, scope: !755)
!758 = !DILocation(line: 781, column: 14, scope: !755)
!759 = !DILocation(line: 781, column: 39, scope: !755)
!760 = !DILocation(line: 781, column: 44, scope: !755)
!761 = !DILocation(line: 781, column: 46, scope: !755)
!762 = !DILocation(line: 782, column: 8, scope: !763)
!763 = distinct !DILexicalBlock(scope: !694, file: !46, line: 782, column: 8)
!764 = !DILocation(line: 782, column: 15, scope: !763)
!765 = !DILocation(line: 782, column: 18, scope: !766)
!766 = !DILexicalBlockFile(scope: !763, file: !46, discriminator: 1)
!767 = !DILocation(line: 782, column: 8, scope: !766)
!768 = !DILocation(line: 783, column: 43, scope: !763)
!769 = !DILocation(line: 783, column: 52, scope: !763)
!770 = !DILocation(line: 783, column: 18, scope: !763)
!771 = !DILocation(line: 783, column: 16, scope: !763)
!772 = !DILocation(line: 783, column: 5, scope: !763)
!773 = !DILocation(line: 786, column: 28, scope: !774)
!774 = distinct !DILexicalBlock(scope: !694, file: !46, line: 786, column: 4)
!775 = !DILocation(line: 786, column: 33, scope: !774)
!776 = !DILocation(line: 786, column: 15, scope: !774)
!777 = !DILocation(line: 786, column: 13, scope: !774)
!778 = !DILocation(line: 786, column: 38, scope: !774)
!779 = !DILocation(line: 786, column: 43, scope: !774)
!780 = !DILocation(line: 786, column: 45, scope: !774)
!781 = !DILocation(line: 787, column: 29, scope: !782)
!782 = distinct !DILexicalBlock(scope: !694, file: !46, line: 787, column: 4)
!783 = !DILocation(line: 787, column: 34, scope: !782)
!784 = !DILocation(line: 787, column: 16, scope: !782)
!785 = !DILocation(line: 787, column: 14, scope: !782)
!786 = !DILocation(line: 787, column: 39, scope: !782)
!787 = !DILocation(line: 787, column: 44, scope: !782)
!788 = !DILocation(line: 787, column: 46, scope: !782)
!789 = !DILocation(line: 788, column: 8, scope: !790)
!790 = distinct !DILexicalBlock(scope: !694, file: !46, line: 788, column: 8)
!791 = !DILocation(line: 788, column: 15, scope: !790)
!792 = !DILocation(line: 788, column: 18, scope: !793)
!793 = !DILexicalBlockFile(scope: !790, file: !46, discriminator: 1)
!794 = !DILocation(line: 788, column: 8, scope: !793)
!795 = !DILocation(line: 789, column: 44, scope: !790)
!796 = !DILocation(line: 789, column: 53, scope: !790)
!797 = !DILocation(line: 789, column: 19, scope: !790)
!798 = !DILocation(line: 789, column: 17, scope: !790)
!799 = !DILocation(line: 789, column: 5, scope: !790)
!800 = !DILocation(line: 791, column: 37, scope: !801)
!801 = distinct !DILexicalBlock(scope: !694, file: !46, line: 791, column: 4)
!802 = !DILocation(line: 791, column: 42, scope: !801)
!803 = !DILocation(line: 791, column: 24, scope: !801)
!804 = !DILocation(line: 791, column: 22, scope: !801)
!805 = !DILocation(line: 791, column: 47, scope: !801)
!806 = !DILocation(line: 791, column: 52, scope: !801)
!807 = !DILocation(line: 791, column: 54, scope: !801)
!808 = !DILocation(line: 793, column: 14, scope: !809)
!809 = distinct !DILexicalBlock(scope: !694, file: !46, line: 793, column: 8)
!810 = !DILocation(line: 793, column: 8, scope: !809)
!811 = !DILocation(line: 793, column: 8, scope: !694)
!812 = !DILocation(line: 794, column: 5, scope: !809)
!813 = !DILocation(line: 796, column: 26, scope: !694)
!814 = !DILocation(line: 796, column: 34, scope: !694)
!815 = !DILocation(line: 796, column: 8, scope: !694)
!816 = !DILocation(line: 796, column: 16, scope: !694)
!817 = !DILocation(line: 797, column: 25, scope: !694)
!818 = !DILocation(line: 797, column: 33, scope: !694)
!819 = !DILocation(line: 797, column: 8, scope: !694)
!820 = !DILocation(line: 797, column: 15, scope: !694)
!821 = !DILocation(line: 798, column: 8, scope: !822)
!822 = distinct !DILexicalBlock(scope: !694, file: !46, line: 798, column: 8)
!823 = !DILocation(line: 798, column: 8, scope: !694)
!824 = !DILocation(line: 799, column: 18, scope: !822)
!825 = !DILocation(line: 799, column: 9, scope: !822)
!826 = !DILocation(line: 799, column: 16, scope: !822)
!827 = !DILocation(line: 799, column: 5, scope: !822)
!828 = !DILocation(line: 802, column: 8, scope: !829)
!829 = distinct !DILexicalBlock(scope: !694, file: !46, line: 802, column: 8)
!830 = !DILocation(line: 802, column: 19, scope: !829)
!831 = !DILocation(line: 802, column: 22, scope: !832)
!832 = !DILexicalBlockFile(scope: !829, file: !46, discriminator: 1)
!833 = !DILocation(line: 802, column: 8, scope: !832)
!834 = !DILocation(line: 803, column: 15, scope: !829)
!835 = !DILocation(line: 803, column: 16, scope: !829)
!836 = !DILocation(line: 803, column: 15, scope: !832)
!837 = !DILocation(line: 803, column: 16, scope: !832)
!838 = !DILocation(line: 803, column: 15, scope: !839)
!839 = !DILexicalBlockFile(scope: !829, file: !46, discriminator: 2)
!840 = !DILocation(line: 803, column: 16, scope: !839)
!841 = !DILocation(line: 803, column: 16, scope: !842)
!842 = !DILexicalBlockFile(scope: !829, file: !46, discriminator: 3)
!843 = !DILocation(line: 803, column: 14, scope: !842)
!844 = !DILocation(line: 803, column: 5, scope: !842)
!845 = !DILocation(line: 805, column: 16, scope: !829)
!846 = !DILocation(line: 805, column: 29, scope: !832)
!847 = !DILocation(line: 805, column: 16, scope: !832)
!848 = !DILocation(line: 805, column: 42, scope: !839)
!849 = !DILocation(line: 805, column: 16, scope: !839)
!850 = !DILocation(line: 805, column: 16, scope: !842)
!851 = !DILocation(line: 805, column: 14, scope: !842)
!852 = !DILocation(line: 807, column: 8, scope: !853)
!853 = distinct !DILexicalBlock(scope: !694, file: !46, line: 807, column: 8)
!854 = !DILocation(line: 807, column: 8, scope: !694)
!855 = !DILocation(line: 808, column: 19, scope: !853)
!856 = !DILocation(line: 808, column: 9, scope: !853)
!857 = !DILocation(line: 808, column: 17, scope: !853)
!858 = !DILocation(line: 808, column: 5, scope: !853)
!859 = !DILocation(line: 811, column: 8, scope: !860)
!860 = distinct !DILexicalBlock(scope: !694, file: !46, line: 811, column: 8)
!861 = !DILocation(line: 811, column: 20, scope: !860)
!862 = !DILocation(line: 811, column: 23, scope: !863)
!863 = !DILexicalBlockFile(scope: !860, file: !46, discriminator: 1)
!864 = !DILocation(line: 811, column: 34, scope: !863)
!865 = !DILocation(line: 811, column: 37, scope: !866)
!866 = !DILexicalBlockFile(scope: !860, file: !46, discriminator: 2)
!867 = !DILocation(line: 811, column: 8, scope: !866)
!868 = !DILocation(line: 815, column: 23, scope: !869)
!869 = distinct !DILexicalBlock(scope: !860, file: !46, line: 812, column: 4)
!870 = !DILocation(line: 815, column: 12, scope: !869)
!871 = !DILocation(line: 815, column: 43, scope: !869)
!872 = !DILocation(line: 815, column: 32, scope: !873)
!873 = !DILexicalBlockFile(scope: !869, file: !46, discriminator: 1)
!874 = !DILocation(line: 813, column: 5, scope: !869)
!875 = !DILocation(line: 816, column: 15, scope: !876)
!876 = distinct !DILexicalBlock(scope: !869, file: !46, line: 816, column: 9)
!877 = !DILocation(line: 816, column: 23, scope: !876)
!878 = !DILocation(line: 816, column: 9, scope: !876)
!879 = !DILocation(line: 816, column: 35, scope: !876)
!880 = !DILocation(line: 816, column: 39, scope: !881)
!881 = !DILexicalBlockFile(scope: !876, file: !46, discriminator: 1)
!882 = !DILocation(line: 816, column: 38, scope: !881)
!883 = !DILocation(line: 816, column: 43, scope: !881)
!884 = !DILocation(line: 816, column: 9, scope: !881)
!885 = !DILocation(line: 817, column: 6, scope: !876)
!886 = !DILocation(line: 818, column: 4, scope: !869)
!887 = !DILocation(line: 820, column: 9, scope: !888)
!888 = distinct !DILexicalBlock(scope: !694, file: !46, line: 820, column: 8)
!889 = !DILocation(line: 820, column: 8, scope: !694)
!890 = !DILocation(line: 821, column: 5, scope: !888)
!891 = !DILocation(line: 823, column: 20, scope: !694)
!892 = !DILocation(line: 823, column: 9, scope: !694)
!893 = !DILocation(line: 825, column: 8, scope: !894)
!894 = distinct !DILexicalBlock(scope: !694, file: !46, line: 825, column: 8)
!895 = !DILocation(line: 825, column: 24, scope: !894)
!896 = !DILocation(line: 825, column: 8, scope: !694)
!897 = !DILocation(line: 826, column: 10, scope: !894)
!898 = !DILocation(line: 826, column: 5, scope: !894)
!899 = !DILocation(line: 828, column: 10, scope: !894)
!900 = !DILocation(line: 830, column: 9, scope: !694)
!901 = !DILocation(line: 832, column: 67, scope: !694)
!902 = !DILocation(line: 832, column: 4, scope: !694)
!903 = !DILocation(line: 834, column: 15, scope: !904)
!904 = distinct !DILexicalBlock(scope: !694, file: !46, line: 834, column: 8)
!905 = !DILocation(line: 834, column: 23, scope: !904)
!906 = !DILocation(line: 834, column: 8, scope: !904)
!907 = !DILocation(line: 834, column: 8, scope: !694)
!908 = !DILocation(line: 835, column: 5, scope: !904)
!909 = !DILocation(line: 837, column: 4, scope: !694)
!910 = !DILocation(line: 841, column: 5, scope: !694)
!911 = !DILocation(line: 841, column: 10, scope: !694)
!912 = !DILocation(line: 841, column: 12, scope: !694)
!913 = !DILocation(line: 842, column: 5, scope: !694)
!914 = !DILocation(line: 842, column: 10, scope: !694)
!915 = !DILocation(line: 842, column: 12, scope: !694)
!916 = !DILocation(line: 843, column: 28, scope: !917)
!917 = distinct !DILexicalBlock(scope: !694, file: !46, line: 843, column: 4)
!918 = !DILocation(line: 843, column: 33, scope: !917)
!919 = !DILocation(line: 843, column: 15, scope: !917)
!920 = !DILocation(line: 843, column: 13, scope: !917)
!921 = !DILocation(line: 843, column: 38, scope: !917)
!922 = !DILocation(line: 843, column: 43, scope: !917)
!923 = !DILocation(line: 843, column: 45, scope: !917)
!924 = !DILocation(line: 845, column: 8, scope: !925)
!925 = distinct !DILexicalBlock(scope: !694, file: !46, line: 845, column: 8)
!926 = !DILocation(line: 845, column: 15, scope: !925)
!927 = !DILocation(line: 845, column: 19, scope: !928)
!928 = !DILexicalBlockFile(scope: !925, file: !46, discriminator: 1)
!929 = !DILocation(line: 845, column: 26, scope: !928)
!930 = !DILocation(line: 845, column: 31, scope: !928)
!931 = !DILocation(line: 845, column: 8, scope: !928)
!932 = !DILocation(line: 846, column: 5, scope: !925)
!933 = !DILocation(line: 848, column: 18, scope: !694)
!934 = !DILocation(line: 848, column: 22, scope: !694)
!935 = !DILocation(line: 848, column: 4, scope: !694)
!936 = !DILocation(line: 849, column: 8, scope: !937)
!937 = distinct !DILexicalBlock(scope: !694, file: !46, line: 849, column: 8)
!938 = !DILocation(line: 849, column: 16, scope: !937)
!939 = !DILocation(line: 849, column: 8, scope: !694)
!940 = !DILocation(line: 850, column: 5, scope: !937)
!941 = !DILocation(line: 852, column: 29, scope: !694)
!942 = !DILocation(line: 852, column: 4, scope: !694)
!943 = !DILocation(line: 854, column: 12, scope: !694)
!944 = !DILocation(line: 854, column: 45, scope: !694)
!945 = !DILocation(line: 854, column: 53, scope: !694)
!946 = !DILocation(line: 854, column: 30, scope: !694)
!947 = !DILocation(line: 854, column: 64, scope: !694)
!948 = !DILocation(line: 855, column: 5, scope: !694)
!949 = !DILocation(line: 854, column: 4, scope: !694)
!950 = !DILocation(line: 857, column: 9, scope: !694)
!951 = !DILocation(line: 857, column: 4, scope: !694)
!952 = !DILocation(line: 859, column: 15, scope: !953)
!953 = distinct !DILexicalBlock(scope: !694, file: !46, line: 859, column: 8)
!954 = !DILocation(line: 859, column: 23, scope: !953)
!955 = !DILocation(line: 859, column: 29, scope: !953)
!956 = !DILocation(line: 859, column: 8, scope: !953)
!957 = !DILocation(line: 859, column: 39, scope: !953)
!958 = !DILocation(line: 859, column: 8, scope: !694)
!959 = !DILocation(line: 862, column: 22, scope: !960)
!960 = distinct !DILexicalBlock(scope: !953, file: !46, line: 860, column: 4)
!961 = !DILocation(line: 862, column: 21, scope: !960)
!962 = !DILocation(line: 862, column: 12, scope: !963)
!963 = !DILexicalBlockFile(scope: !960, file: !46, discriminator: 1)
!964 = !DILocation(line: 861, column: 5, scope: !960)
!965 = !DILocation(line: 863, column: 5, scope: !960)
!966 = !DILocation(line: 865, column: 4, scope: !694)
!967 = !DILocation(line: 883, column: 5, scope: !694)
!968 = !DILocation(line: 883, column: 10, scope: !694)
!969 = !DILocation(line: 883, column: 12, scope: !694)
!970 = !DILocation(line: 884, column: 5, scope: !694)
!971 = !DILocation(line: 884, column: 10, scope: !694)
!972 = !DILocation(line: 884, column: 12, scope: !694)
!973 = !DILocation(line: 887, column: 9, scope: !974)
!974 = distinct !DILexicalBlock(scope: !694, file: !46, line: 887, column: 8)
!975 = !DILocation(line: 887, column: 17, scope: !974)
!976 = !DILocation(line: 887, column: 28, scope: !974)
!977 = !DILocation(line: 887, column: 8, scope: !694)
!978 = !DILocation(line: 899, column: 9, scope: !979)
!979 = distinct !DILexicalBlock(scope: !980, file: !46, line: 899, column: 9)
!980 = distinct !DILexicalBlock(scope: !974, file: !46, line: 889, column: 4)
!981 = !DILocation(line: 899, column: 17, scope: !979)
!982 = !DILocation(line: 899, column: 9, scope: !980)
!983 = !DILocalVariable(name: "dp", scope: !984, file: !46, line: 901, type: !101)
!984 = distinct !DILexicalBlock(scope: !979, file: !46, line: 900, column: 5)
!985 = !DILocation(line: 901, column: 11, scope: !984)
!986 = !DILocation(line: 901, column: 24, scope: !984)
!987 = !DILocation(line: 901, column: 32, scope: !984)
!988 = !DILocation(line: 901, column: 16, scope: !984)
!989 = !DILocalVariable(name: "dir", scope: !984, file: !46, line: 902, type: !106)
!990 = !DILocation(line: 902, column: 21, scope: !984)
!991 = !DILocation(line: 904, column: 6, scope: !984)
!992 = !DILocation(line: 904, column: 28, scope: !993)
!993 = !DILexicalBlockFile(scope: !984, file: !46, discriminator: 1)
!994 = !DILocation(line: 904, column: 20, scope: !993)
!995 = !DILocation(line: 904, column: 18, scope: !993)
!996 = !DILocation(line: 904, column: 33, scope: !993)
!997 = !DILocation(line: 904, column: 6, scope: !993)
!998 = !DILocation(line: 906, column: 18, scope: !999)
!999 = distinct !DILexicalBlock(scope: !1000, file: !46, line: 906, column: 11)
!1000 = distinct !DILexicalBlock(scope: !984, file: !46, line: 905, column: 6)
!1001 = !DILocation(line: 906, column: 23, scope: !999)
!1002 = !DILocation(line: 906, column: 11, scope: !999)
!1003 = !DILocation(line: 906, column: 36, scope: !999)
!1004 = !DILocation(line: 907, column: 11, scope: !999)
!1005 = !DILocation(line: 907, column: 21, scope: !1006)
!1006 = !DILexicalBlockFile(scope: !999, file: !46, discriminator: 1)
!1007 = !DILocation(line: 907, column: 26, scope: !1006)
!1008 = !DILocation(line: 907, column: 14, scope: !1006)
!1009 = !DILocation(line: 907, column: 40, scope: !1006)
!1010 = !DILocation(line: 906, column: 11, scope: !1011)
!1011 = !DILexicalBlockFile(scope: !1000, file: !46, discriminator: 1)
!1012 = !DILocation(line: 909, column: 17, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !999, file: !46, line: 908, column: 7)
!1014 = !DILocation(line: 909, column: 8, scope: !1013)
!1015 = !DILocation(line: 910, column: 8, scope: !1013)
!1016 = !DILocation(line: 904, column: 6, scope: !1017)
!1017 = !DILexicalBlockFile(scope: !984, file: !46, discriminator: 2)
!1018 = distinct !{!1018, !991}
!1019 = !DILocation(line: 913, column: 15, scope: !984)
!1020 = !DILocation(line: 913, column: 6, scope: !984)
!1021 = !DILocation(line: 914, column: 5, scope: !984)
!1022 = !DILocation(line: 916, column: 5, scope: !980)
!1023 = !DILocation(line: 916, column: 13, scope: !980)
!1024 = !DILocation(line: 916, column: 29, scope: !980)
!1025 = !DILocation(line: 917, column: 4, scope: !980)
!1026 = !DILocation(line: 919, column: 4, scope: !694)
!1027 = !DILocation(line: 929, column: 5, scope: !694)
!1028 = !DILocation(line: 929, column: 10, scope: !694)
!1029 = !DILocation(line: 929, column: 12, scope: !694)
!1030 = !DILocation(line: 930, column: 28, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !694, file: !46, line: 930, column: 4)
!1032 = !DILocation(line: 930, column: 33, scope: !1031)
!1033 = !DILocation(line: 930, column: 15, scope: !1031)
!1034 = !DILocation(line: 930, column: 13, scope: !1031)
!1035 = !DILocation(line: 930, column: 38, scope: !1031)
!1036 = !DILocation(line: 930, column: 43, scope: !1031)
!1037 = !DILocation(line: 930, column: 45, scope: !1031)
!1038 = !DILocation(line: 933, column: 17, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !694, file: !46, line: 933, column: 8)
!1040 = !DILocation(line: 933, column: 25, scope: !1039)
!1041 = !DILocation(line: 933, column: 9, scope: !1039)
!1042 = !DILocation(line: 933, column: 41, scope: !1039)
!1043 = !DILocation(line: 933, column: 8, scope: !694)
!1044 = !DILocation(line: 934, column: 17, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1039, file: !46, line: 934, column: 9)
!1046 = !DILocation(line: 934, column: 35, scope: !1045)
!1047 = !DILocation(line: 934, column: 25, scope: !1045)
!1048 = !DILocation(line: 934, column: 45, scope: !1045)
!1049 = !DILocation(line: 934, column: 43, scope: !1045)
!1050 = !DILocation(line: 934, column: 9, scope: !1039)
!1051 = !DILocation(line: 935, column: 6, scope: !1045)
!1052 = !DILocation(line: 934, column: 45, scope: !1053)
!1053 = !DILexicalBlockFile(scope: !1045, file: !46, discriminator: 1)
!1054 = !DILocation(line: 937, column: 27, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !694, file: !46, line: 937, column: 8)
!1056 = !DILocation(line: 937, column: 35, scope: !1055)
!1057 = !DILocation(line: 937, column: 8, scope: !1055)
!1058 = !DILocation(line: 937, column: 43, scope: !1055)
!1059 = !DILocation(line: 937, column: 8, scope: !694)
!1060 = !DILocation(line: 939, column: 5, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1055, file: !46, line: 938, column: 4)
!1062 = !DILocation(line: 942, column: 4, scope: !694)
!1063 = !DILocation(line: 946, column: 11, scope: !694)
!1064 = !DILocation(line: 944, column: 4, scope: !694)
!1065 = !DILocation(line: 947, column: 4, scope: !694)
!1066 = !DILocation(line: 949, column: 2, scope: !617)
!1067 = !DILocation(line: 950, column: 1, scope: !617)
!1068 = distinct !DISubprogram(name: "convert_1970_to_filetime", scope: !46, file: !46, line: 187, type: !1069, isLocal: true, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!38, !36, !36}
!1071 = !DILocalVariable(name: "high", arg: 1, scope: !1068, file: !46, line: 187, type: !36)
!1072 = !DILocation(line: 187, column: 33, scope: !1068)
!1073 = !DILocalVariable(name: "low", arg: 2, scope: !1068, file: !46, line: 187, type: !36)
!1074 = !DILocation(line: 187, column: 46, scope: !1068)
!1075 = !DILocalVariable(name: "ticks", scope: !1068, file: !46, line: 189, type: !43)
!1076 = !DILocation(line: 189, column: 21, scope: !1068)
!1077 = !DILocalVariable(name: "val", scope: !1068, file: !46, line: 190, type: !38)
!1078 = !DILocation(line: 190, column: 9, scope: !1068)
!1079 = !DILocation(line: 192, column: 10, scope: !1068)
!1080 = !DILocation(line: 192, column: 39, scope: !1068)
!1081 = !DILocation(line: 192, column: 18, scope: !1068)
!1082 = !DILocation(line: 192, column: 45, scope: !1068)
!1083 = !DILocation(line: 192, column: 14, scope: !1068)
!1084 = !DILocation(line: 192, column: 8, scope: !1068)
!1085 = !DILocation(line: 193, column: 8, scope: !1068)
!1086 = !DILocation(line: 194, column: 8, scope: !1068)
!1087 = !DILocation(line: 196, column: 17, scope: !1068)
!1088 = !DILocation(line: 196, column: 6, scope: !1068)
!1089 = !DILocation(line: 197, column: 10, scope: !1068)
!1090 = !DILocation(line: 197, column: 2, scope: !1068)
!1091 = !DILocalVariable(name: "fd", arg: 1, scope: !134, file: !46, line: 205, type: !48)
!1092 = !DILocation(line: 205, column: 24, scope: !134)
!1093 = !DILocalVariable(name: "length", arg: 2, scope: !134, file: !46, line: 205, type: !137)
!1094 = !DILocation(line: 205, column: 34, scope: !134)
!1095 = !DILocalVariable(name: "ret", scope: !134, file: !46, line: 207, type: !48)
!1096 = !DILocation(line: 207, column: 6, scope: !134)
!1097 = !DILocalVariable(name: "pos", scope: !134, file: !46, line: 208, type: !137)
!1098 = !DILocation(line: 208, column: 8, scope: !134)
!1099 = !DILocation(line: 212, column: 23, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !134, file: !46, line: 212, column: 6)
!1101 = !DILocation(line: 212, column: 27, scope: !1100)
!1102 = !DILocation(line: 212, column: 13, scope: !1100)
!1103 = !DILocation(line: 212, column: 11, scope: !1100)
!1104 = !DILocation(line: 212, column: 36, scope: !1100)
!1105 = !DILocation(line: 212, column: 6, scope: !134)
!1106 = !DILocation(line: 214, column: 10, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1100, file: !46, line: 213, column: 2)
!1108 = !DILocation(line: 214, column: 3, scope: !1107)
!1109 = !DILocation(line: 223, column: 19, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !134, file: !46, line: 223, column: 6)
!1111 = !DILocation(line: 223, column: 13, scope: !1110)
!1112 = !DILocation(line: 223, column: 11, scope: !1110)
!1113 = !DILocation(line: 223, column: 36, scope: !1110)
!1114 = !DILocation(line: 223, column: 6, scope: !134)
!1115 = !DILocation(line: 225, column: 77, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1110, file: !46, line: 224, column: 2)
!1117 = !DILocation(line: 225, column: 76, scope: !1116)
!1118 = !DILocation(line: 225, column: 67, scope: !1119)
!1119 = !DILexicalBlockFile(scope: !1116, file: !46, discriminator: 1)
!1120 = !DILocation(line: 225, column: 3, scope: !1121)
!1121 = !DILexicalBlockFile(scope: !1116, file: !46, discriminator: 2)
!1122 = !DILocation(line: 226, column: 3, scope: !1116)
!1123 = !DILocation(line: 230, column: 12, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !134, file: !46, line: 230, column: 6)
!1125 = !DILocation(line: 230, column: 16, scope: !1124)
!1126 = !DILocation(line: 230, column: 6, scope: !1124)
!1127 = !DILocation(line: 230, column: 33, scope: !1124)
!1128 = !DILocation(line: 230, column: 6, scope: !134)
!1129 = !DILocation(line: 232, column: 77, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1124, file: !46, line: 231, column: 2)
!1131 = !DILocation(line: 232, column: 76, scope: !1130)
!1132 = !DILocation(line: 232, column: 67, scope: !1133)
!1133 = !DILexicalBlockFile(scope: !1130, file: !46, discriminator: 1)
!1134 = !DILocation(line: 232, column: 3, scope: !1135)
!1135 = !DILexicalBlockFile(scope: !1130, file: !46, discriminator: 2)
!1136 = !DILocation(line: 233, column: 3, scope: !1130)
!1137 = !DILocation(line: 237, column: 12, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !134, file: !46, line: 237, column: 6)
!1139 = !DILocation(line: 237, column: 6, scope: !1138)
!1140 = !DILocation(line: 237, column: 26, scope: !1138)
!1141 = !DILocation(line: 237, column: 6, scope: !134)
!1142 = !DILocation(line: 239, column: 77, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1138, file: !46, line: 238, column: 2)
!1144 = !DILocation(line: 239, column: 76, scope: !1143)
!1145 = !DILocation(line: 239, column: 67, scope: !1146)
!1146 = !DILexicalBlockFile(scope: !1143, file: !46, discriminator: 1)
!1147 = !DILocation(line: 239, column: 3, scope: !1148)
!1148 = !DILexicalBlockFile(scope: !1143, file: !46, discriminator: 2)
!1149 = !DILocation(line: 240, column: 3, scope: !1143)
!1150 = !DILocation(line: 244, column: 16, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !134, file: !46, line: 244, column: 6)
!1152 = !DILocation(line: 244, column: 20, scope: !1151)
!1153 = !DILocation(line: 244, column: 6, scope: !1151)
!1154 = !DILocation(line: 244, column: 28, scope: !1151)
!1155 = !DILocation(line: 244, column: 6, scope: !134)
!1156 = !DILocation(line: 247, column: 20, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1151, file: !46, line: 245, column: 2)
!1158 = !DILocation(line: 247, column: 19, scope: !1157)
!1159 = !DILocation(line: 247, column: 10, scope: !1160)
!1160 = !DILexicalBlockFile(scope: !1157, file: !46, discriminator: 1)
!1161 = !DILocation(line: 246, column: 3, scope: !1157)
!1162 = !DILocation(line: 248, column: 3, scope: !1157)
!1163 = !DILocation(line: 252, column: 12, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !134, file: !46, line: 252, column: 6)
!1165 = !DILocation(line: 252, column: 16, scope: !1164)
!1166 = !DILocation(line: 252, column: 6, scope: !1164)
!1167 = !DILocation(line: 252, column: 30, scope: !1164)
!1168 = !DILocation(line: 252, column: 6, scope: !134)
!1169 = !DILocation(line: 254, column: 77, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1164, file: !46, line: 253, column: 2)
!1171 = !DILocation(line: 254, column: 76, scope: !1170)
!1172 = !DILocation(line: 254, column: 67, scope: !1173)
!1173 = !DILexicalBlockFile(scope: !1170, file: !46, discriminator: 1)
!1174 = !DILocation(line: 254, column: 3, scope: !1175)
!1175 = !DILexicalBlockFile(scope: !1170, file: !46, discriminator: 2)
!1176 = !DILocation(line: 255, column: 3, scope: !1170)
!1177 = !DILocation(line: 258, column: 2, scope: !134)
!1178 = !DILocation(line: 259, column: 1, scope: !134)
!1179 = distinct !DISubprogram(name: "disk_check_notify", scope: !46, file: !46, line: 953, type: !62, isLocal: false, isDefinition: true, scopeLine: 954, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!1180 = !DILocalVariable(name: "handle", arg: 1, scope: !1179, file: !46, line: 953, type: !59)
!1181 = !DILocation(line: 953, column: 31, scope: !1179)
!1182 = !DILocalVariable(name: "pfinfo", scope: !1179, file: !46, line: 955, type: !640)
!1183 = !DILocation(line: 955, column: 19, scope: !1179)
!1184 = !DILocalVariable(name: "status", scope: !1179, file: !46, line: 956, type: !57)
!1185 = !DILocation(line: 956, column: 14, scope: !1179)
!1186 = !DILocalVariable(name: "notify", scope: !1179, file: !46, line: 957, type: !125)
!1187 = !DILocation(line: 957, column: 9, scope: !1179)
!1188 = !DILocation(line: 959, column: 56, scope: !1179)
!1189 = !DILocation(line: 959, column: 2, scope: !1179)
!1190 = !DILocation(line: 961, column: 24, scope: !1179)
!1191 = !DILocation(line: 961, column: 13, scope: !1179)
!1192 = !DILocation(line: 961, column: 9, scope: !1179)
!1193 = !DILocation(line: 962, column: 7, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1179, file: !46, line: 962, column: 6)
!1195 = !DILocation(line: 962, column: 15, scope: !1194)
!1196 = !DILocation(line: 962, column: 6, scope: !1179)
!1197 = !DILocation(line: 963, column: 3, scope: !1194)
!1198 = !DILocation(line: 967, column: 22, scope: !1179)
!1199 = !DILocation(line: 967, column: 30, scope: !1179)
!1200 = !DILocation(line: 967, column: 38, scope: !1179)
!1201 = !DILocation(line: 967, column: 11, scope: !1179)
!1202 = !DILocation(line: 967, column: 9, scope: !1179)
!1203 = !DILocation(line: 969, column: 6, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1179, file: !46, line: 969, column: 6)
!1205 = !DILocation(line: 969, column: 13, scope: !1204)
!1206 = !DILocation(line: 969, column: 6, scope: !1179)
!1207 = !DILocation(line: 970, column: 10, scope: !1204)
!1208 = !DILocation(line: 970, column: 3, scope: !1204)
!1209 = !DILocation(line: 972, column: 14, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1179, file: !46, line: 972, column: 6)
!1211 = !DILocation(line: 972, column: 22, scope: !1210)
!1212 = !DILocation(line: 972, column: 13, scope: !1210)
!1213 = !DILocation(line: 972, column: 30, scope: !1210)
!1214 = !DILocation(line: 972, column: 6, scope: !1210)
!1215 = !DILocation(line: 972, column: 6, scope: !1179)
!1216 = !DILocation(line: 975, column: 11, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1210, file: !46, line: 973, column: 2)
!1218 = !DILocation(line: 975, column: 19, scope: !1217)
!1219 = !DILocation(line: 975, column: 3, scope: !1217)
!1220 = !DILocation(line: 976, column: 10, scope: !1217)
!1221 = !DILocation(line: 977, column: 2, scope: !1217)
!1222 = !DILocation(line: 979, column: 9, scope: !1179)
!1223 = !DILocation(line: 979, column: 2, scope: !1179)
!1224 = !DILocation(line: 982, column: 1, scope: !1179)
!1225 = distinct !DISubprogram(name: "NotifyInfo", scope: !46, file: !46, line: 1011, type: !1226, isLocal: true, isDefinition: true, scopeLine: 1012, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!57, !59, !36, !1228}
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!1229 = !DILocalVariable(name: "handle", arg: 1, scope: !1225, file: !46, line: 1011, type: !59)
!1230 = !DILocation(line: 1011, column: 24, scope: !1225)
!1231 = !DILocalVariable(name: "info_class", arg: 2, scope: !1225, file: !46, line: 1011, type: !36)
!1232 = !DILocation(line: 1011, column: 39, scope: !1225)
!1233 = !DILocalVariable(name: "p", arg: 3, scope: !1225, file: !46, line: 1011, type: !1228)
!1234 = !DILocation(line: 1011, column: 60, scope: !1225)
!1235 = !DILocation(line: 1013, column: 9, scope: !1225)
!1236 = !DILocalVariable(name: "pfinfo", scope: !1225, file: !46, line: 1014, type: !640)
!1237 = !DILocation(line: 1014, column: 19, scope: !1225)
!1238 = !DILocalVariable(name: "filestat", scope: !1225, file: !46, line: 1015, type: !259)
!1239 = !DILocation(line: 1015, column: 14, scope: !1225)
!1240 = !DILocalVariable(name: "dp", scope: !1225, file: !46, line: 1016, type: !106)
!1241 = !DILocation(line: 1016, column: 17, scope: !1225)
!1242 = !DILocalVariable(name: "fullname", scope: !1225, file: !46, line: 1017, type: !33)
!1243 = !DILocation(line: 1017, column: 8, scope: !1225)
!1244 = !DILocalVariable(name: "dpr", scope: !1225, file: !46, line: 1018, type: !101)
!1245 = !DILocation(line: 1018, column: 7, scope: !1225)
!1246 = !DILocation(line: 1020, column: 24, scope: !1225)
!1247 = !DILocation(line: 1020, column: 13, scope: !1225)
!1248 = !DILocation(line: 1020, column: 9, scope: !1225)
!1249 = !DILocation(line: 1021, column: 12, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1225, file: !46, line: 1021, column: 6)
!1251 = !DILocation(line: 1021, column: 6, scope: !1250)
!1252 = !DILocation(line: 1021, column: 31, scope: !1250)
!1253 = !DILocation(line: 1021, column: 6, scope: !1225)
!1254 = !DILocation(line: 1023, column: 67, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1250, file: !46, line: 1022, column: 2)
!1256 = !DILocation(line: 1023, column: 66, scope: !1255)
!1257 = !DILocation(line: 1023, column: 57, scope: !1258)
!1258 = !DILexicalBlockFile(scope: !1255, file: !46, discriminator: 1)
!1259 = !DILocation(line: 1023, column: 3, scope: !1260)
!1260 = !DILexicalBlockFile(scope: !1255, file: !46, discriminator: 2)
!1261 = !DILocation(line: 1024, column: 3, scope: !1255)
!1262 = !DILocation(line: 1026, column: 27, scope: !1225)
!1263 = !DILocation(line: 1026, column: 35, scope: !1225)
!1264 = !DILocation(line: 1026, column: 2, scope: !1225)
!1265 = !DILocation(line: 1026, column: 5, scope: !1225)
!1266 = !DILocation(line: 1026, column: 17, scope: !1225)
!1267 = !DILocation(line: 1027, column: 27, scope: !1225)
!1268 = !DILocation(line: 1027, column: 35, scope: !1225)
!1269 = !DILocation(line: 1027, column: 2, scope: !1225)
!1270 = !DILocation(line: 1027, column: 5, scope: !1225)
!1271 = !DILocation(line: 1027, column: 17, scope: !1225)
!1272 = !DILocation(line: 1028, column: 2, scope: !1225)
!1273 = !DILocation(line: 1028, column: 5, scope: !1225)
!1274 = !DILocation(line: 1028, column: 17, scope: !1225)
!1275 = !DILocation(line: 1029, column: 2, scope: !1225)
!1276 = !DILocation(line: 1029, column: 5, scope: !1225)
!1277 = !DILocation(line: 1029, column: 16, scope: !1225)
!1278 = !DILocation(line: 1032, column: 16, scope: !1225)
!1279 = !DILocation(line: 1032, column: 24, scope: !1225)
!1280 = !DILocation(line: 1032, column: 8, scope: !1225)
!1281 = !DILocation(line: 1032, column: 6, scope: !1225)
!1282 = !DILocation(line: 1033, column: 7, scope: !1283)
!1283 = distinct !DILexicalBlock(scope: !1225, file: !46, line: 1033, column: 6)
!1284 = !DILocation(line: 1033, column: 6, scope: !1225)
!1285 = !DILocation(line: 1035, column: 69, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1283, file: !46, line: 1034, column: 2)
!1287 = !DILocation(line: 1035, column: 68, scope: !1286)
!1288 = !DILocation(line: 1035, column: 59, scope: !1289)
!1289 = !DILexicalBlockFile(scope: !1286, file: !46, discriminator: 1)
!1290 = !DILocation(line: 1035, column: 3, scope: !1291)
!1291 = !DILexicalBlockFile(scope: !1286, file: !46, discriminator: 2)
!1292 = !DILocation(line: 1036, column: 3, scope: !1286)
!1293 = !DILocation(line: 1040, column: 2, scope: !1225)
!1294 = !DILocation(line: 1040, column: 23, scope: !1295)
!1295 = !DILexicalBlockFile(scope: !1225, file: !46, discriminator: 1)
!1296 = !DILocation(line: 1040, column: 15, scope: !1295)
!1297 = !DILocation(line: 1040, column: 13, scope: !1295)
!1298 = !DILocation(line: 1040, column: 2, scope: !1295)
!1299 = !DILocation(line: 1042, column: 15, scope: !1300)
!1300 = distinct !DILexicalBlock(scope: !1301, file: !46, line: 1042, column: 7)
!1301 = distinct !DILexicalBlock(scope: !1225, file: !46, line: 1041, column: 2)
!1302 = !DILocation(line: 1042, column: 19, scope: !1300)
!1303 = !DILocation(line: 1042, column: 8, scope: !1300)
!1304 = !DILocation(line: 1042, column: 32, scope: !1300)
!1305 = !DILocation(line: 1042, column: 43, scope: !1306)
!1306 = !DILexicalBlockFile(scope: !1300, file: !46, discriminator: 1)
!1307 = !DILocation(line: 1042, column: 47, scope: !1306)
!1308 = !DILocation(line: 1042, column: 36, scope: !1306)
!1309 = !DILocation(line: 1042, column: 7, scope: !1306)
!1310 = !DILocation(line: 1043, column: 4, scope: !1300)
!1311 = distinct !{!1311, !1293}
!1312 = !DILocation(line: 1044, column: 3, scope: !1301)
!1313 = !DILocation(line: 1044, column: 6, scope: !1301)
!1314 = !DILocation(line: 1044, column: 17, scope: !1301)
!1315 = !DILocation(line: 1045, column: 38, scope: !1301)
!1316 = !DILocation(line: 1045, column: 46, scope: !1301)
!1317 = !DILocation(line: 1045, column: 31, scope: !1301)
!1318 = !DILocation(line: 1045, column: 61, scope: !1301)
!1319 = !DILocation(line: 1045, column: 65, scope: !1301)
!1320 = !DILocation(line: 1045, column: 54, scope: !1321)
!1321 = !DILexicalBlockFile(scope: !1301, file: !46, discriminator: 1)
!1322 = !DILocation(line: 1045, column: 52, scope: !1301)
!1323 = !DILocation(line: 1045, column: 73, scope: !1301)
!1324 = !DILocation(line: 1045, column: 23, scope: !1325)
!1325 = !DILexicalBlockFile(scope: !1301, file: !46, discriminator: 2)
!1326 = !DILocation(line: 1045, column: 12, scope: !1301)
!1327 = !DILocation(line: 1046, column: 11, scope: !1301)
!1328 = !DILocation(line: 1046, column: 30, scope: !1301)
!1329 = !DILocation(line: 1046, column: 38, scope: !1301)
!1330 = !DILocation(line: 1046, column: 44, scope: !1301)
!1331 = !DILocation(line: 1046, column: 48, scope: !1301)
!1332 = !DILocation(line: 1046, column: 3, scope: !1301)
!1333 = !DILocation(line: 1048, column: 13, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !1301, file: !46, line: 1048, column: 7)
!1335 = !DILocation(line: 1048, column: 8, scope: !1334)
!1336 = !DILocation(line: 1048, column: 7, scope: !1301)
!1337 = !DILocation(line: 1050, column: 30, scope: !1338)
!1338 = distinct !DILexicalBlock(scope: !1334, file: !46, line: 1049, column: 3)
!1339 = !DILocation(line: 1050, column: 38, scope: !1338)
!1340 = !DILocation(line: 1050, column: 50, scope: !1338)
!1341 = !DILocation(line: 1050, column: 58, scope: !1338)
!1342 = !DILocation(line: 1050, column: 39, scope: !1338)
!1343 = !DILocation(line: 1050, column: 4, scope: !1338)
!1344 = !DILocation(line: 1050, column: 7, scope: !1338)
!1345 = !DILocation(line: 1050, column: 18, scope: !1338)
!1346 = !DILocation(line: 1051, column: 3, scope: !1338)
!1347 = !DILocation(line: 1053, column: 9, scope: !1301)
!1348 = !DILocation(line: 1053, column: 3, scope: !1301)
!1349 = !DILocation(line: 1040, column: 2, scope: !1350)
!1350 = !DILexicalBlockFile(scope: !1225, file: !46, discriminator: 2)
!1351 = !DILocation(line: 1055, column: 11, scope: !1225)
!1352 = !DILocation(line: 1055, column: 2, scope: !1225)
!1353 = !DILocation(line: 1057, column: 2, scope: !1225)
!1354 = !DILocation(line: 1058, column: 1, scope: !1225)
!1355 = distinct !DISubprogram(name: "disk_create_notify", scope: !46, file: !46, line: 985, type: !1356, isLocal: false, isDefinition: true, scopeLine: 986, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!57, !59, !36}
!1358 = !DILocalVariable(name: "handle", arg: 1, scope: !1355, file: !46, line: 985, type: !59)
!1359 = !DILocation(line: 985, column: 32, scope: !1355)
!1360 = !DILocalVariable(name: "info_class", arg: 2, scope: !1355, file: !46, line: 985, type: !36)
!1361 = !DILocation(line: 985, column: 47, scope: !1355)
!1362 = !DILocalVariable(name: "pfinfo", scope: !1355, file: !46, line: 987, type: !640)
!1363 = !DILocation(line: 987, column: 19, scope: !1355)
!1364 = !DILocalVariable(name: "ret", scope: !1355, file: !46, line: 988, type: !57)
!1365 = !DILocation(line: 988, column: 14, scope: !1355)
!1366 = !DILocation(line: 990, column: 74, scope: !1355)
!1367 = !DILocation(line: 990, column: 82, scope: !1355)
!1368 = !DILocation(line: 990, column: 2, scope: !1355)
!1369 = !DILocation(line: 992, column: 24, scope: !1355)
!1370 = !DILocation(line: 992, column: 13, scope: !1355)
!1371 = !DILocation(line: 992, column: 9, scope: !1355)
!1372 = !DILocation(line: 993, column: 23, scope: !1355)
!1373 = !DILocation(line: 993, column: 2, scope: !1355)
!1374 = !DILocation(line: 993, column: 10, scope: !1355)
!1375 = !DILocation(line: 993, column: 21, scope: !1355)
!1376 = !DILocation(line: 995, column: 19, scope: !1355)
!1377 = !DILocation(line: 995, column: 27, scope: !1355)
!1378 = !DILocation(line: 995, column: 40, scope: !1355)
!1379 = !DILocation(line: 995, column: 48, scope: !1355)
!1380 = !DILocation(line: 995, column: 8, scope: !1355)
!1381 = !DILocation(line: 995, column: 6, scope: !1355)
!1382 = !DILocation(line: 997, column: 6, scope: !1383)
!1383 = distinct !DILexicalBlock(scope: !1355, file: !46, line: 997, column: 6)
!1384 = !DILocation(line: 997, column: 17, scope: !1383)
!1385 = !DILocation(line: 997, column: 6, scope: !1355)
!1386 = !DILocation(line: 999, column: 7, scope: !1387)
!1387 = distinct !DILexicalBlock(scope: !1388, file: !46, line: 999, column: 7)
!1388 = distinct !DILexicalBlock(scope: !1383, file: !46, line: 998, column: 2)
!1389 = !DILocation(line: 999, column: 11, scope: !1387)
!1390 = !DILocation(line: 999, column: 7, scope: !1388)
!1391 = !DILocation(line: 1000, column: 4, scope: !1387)
!1392 = !DILocation(line: 1001, column: 2, scope: !1388)
!1393 = !DILocation(line: 1006, column: 9, scope: !1355)
!1394 = !DILocation(line: 1006, column: 2, scope: !1355)
!1395 = !DILocation(line: 1008, column: 1, scope: !1355)
!1396 = distinct !DISubprogram(name: "disk_query_volume_information", scope: !46, file: !46, line: 1129, type: !244, isLocal: false, isDefinition: true, scopeLine: 1130, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!1397 = !DILocalVariable(name: "handle", arg: 1, scope: !1396, file: !46, line: 1129, type: !59)
!1398 = !DILocation(line: 1129, column: 43, scope: !1396)
!1399 = !DILocalVariable(name: "info_class", arg: 2, scope: !1396, file: !46, line: 1129, type: !36)
!1400 = !DILocation(line: 1129, column: 58, scope: !1396)
!1401 = !DILocalVariable(name: "out", arg: 3, scope: !1396, file: !46, line: 1129, type: !76)
!1402 = !DILocation(line: 1129, column: 77, scope: !1396)
!1403 = !DILocalVariable(name: "stat_fs", scope: !1396, file: !46, line: 1131, type: !662)
!1404 = !DILocation(line: 1131, column: 17, scope: !1396)
!1405 = !DILocalVariable(name: "pfinfo", scope: !1396, file: !46, line: 1132, type: !640)
!1406 = !DILocation(line: 1132, column: 19, scope: !1396)
!1407 = !DILocalVariable(name: "fsinfo", scope: !1396, file: !46, line: 1133, type: !145)
!1408 = !DILocation(line: 1133, column: 14, scope: !1396)
!1409 = !DILocalVariable(name: "stmp", scope: !1396, file: !46, line: 1134, type: !79)
!1410 = !DILocation(line: 1134, column: 16, scope: !1396)
!1411 = !DILocation(line: 1136, column: 2, scope: !1396)
!1412 = !DILocation(line: 1137, column: 2, scope: !1396)
!1413 = !DILocation(line: 1139, column: 85, scope: !1396)
!1414 = !DILocation(line: 1140, column: 9, scope: !1396)
!1415 = !DILocation(line: 1139, column: 2, scope: !1396)
!1416 = !DILocation(line: 1142, column: 24, scope: !1396)
!1417 = !DILocation(line: 1142, column: 13, scope: !1396)
!1418 = !DILocation(line: 1142, column: 9, scope: !1396)
!1419 = !DILocation(line: 1144, column: 15, scope: !1420)
!1420 = distinct !DILexicalBlock(scope: !1396, file: !46, line: 1144, column: 6)
!1421 = !DILocation(line: 1144, column: 23, scope: !1420)
!1422 = !DILocation(line: 1144, column: 7, scope: !1420)
!1423 = !DILocation(line: 1144, column: 39, scope: !1420)
!1424 = !DILocation(line: 1144, column: 6, scope: !1396)
!1425 = !DILocation(line: 1147, column: 20, scope: !1426)
!1426 = distinct !DILexicalBlock(scope: !1420, file: !46, line: 1145, column: 2)
!1427 = !DILocation(line: 1147, column: 19, scope: !1426)
!1428 = !DILocation(line: 1147, column: 10, scope: !1429)
!1429 = !DILexicalBlockFile(scope: !1426, file: !46, discriminator: 1)
!1430 = !DILocation(line: 1146, column: 3, scope: !1426)
!1431 = !DILocation(line: 1148, column: 3, scope: !1426)
!1432 = !DILocation(line: 1151, column: 24, scope: !1396)
!1433 = !DILocation(line: 1151, column: 32, scope: !1396)
!1434 = !DILocation(line: 1151, column: 11, scope: !1396)
!1435 = !DILocation(line: 1151, column: 9, scope: !1396)
!1436 = !DILocation(line: 1153, column: 10, scope: !1396)
!1437 = !DILocation(line: 1153, column: 2, scope: !1396)
!1438 = !DILocation(line: 1156, column: 4, scope: !1439)
!1439 = distinct !DILexicalBlock(scope: !1396, file: !46, line: 1154, column: 2)
!1440 = !DILocation(line: 1157, column: 22, scope: !1439)
!1441 = !DILocation(line: 1157, column: 30, scope: !1439)
!1442 = !DILocation(line: 1157, column: 4, scope: !1439)
!1443 = !DILocation(line: 1158, column: 28, scope: !1439)
!1444 = !DILocation(line: 1158, column: 13, scope: !1439)
!1445 = !DILocation(line: 1158, column: 17, scope: !1439)
!1446 = !DILocation(line: 1160, column: 19, scope: !1447)
!1447 = distinct !DILexicalBlock(scope: !1439, file: !46, line: 1160, column: 4)
!1448 = !DILocation(line: 1160, column: 25, scope: !1447)
!1449 = !DILocation(line: 1160, column: 6, scope: !1447)
!1450 = !DILocation(line: 1160, column: 28, scope: !1447)
!1451 = !DILocation(line: 1160, column: 34, scope: !1447)
!1452 = !DILocation(line: 1160, column: 40, scope: !1447)
!1453 = !DILocation(line: 1160, column: 42, scope: !1447)
!1454 = !DILocation(line: 1161, column: 19, scope: !1455)
!1455 = distinct !DILexicalBlock(scope: !1439, file: !46, line: 1161, column: 4)
!1456 = !DILocation(line: 1161, column: 25, scope: !1455)
!1457 = !DILocation(line: 1161, column: 6, scope: !1455)
!1458 = !DILocation(line: 1161, column: 28, scope: !1455)
!1459 = !DILocation(line: 1161, column: 34, scope: !1455)
!1460 = !DILocation(line: 1161, column: 40, scope: !1455)
!1461 = !DILocation(line: 1161, column: 42, scope: !1455)
!1462 = !DILocation(line: 1162, column: 30, scope: !1463)
!1463 = distinct !DILexicalBlock(scope: !1439, file: !46, line: 1162, column: 4)
!1464 = !DILocation(line: 1162, column: 38, scope: !1463)
!1465 = !DILocation(line: 1162, column: 19, scope: !1463)
!1466 = !DILocation(line: 1162, column: 25, scope: !1463)
!1467 = !DILocation(line: 1162, column: 6, scope: !1463)
