; ModuleID = './[inter]rdp5.o.i'
source_filename = "./[inter]rdp5.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._RDPCOMP = type { i32, [65536 x i8], %struct.stream }
%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }

@g_mppc_dict = external global %struct._RDPCOMP, align 8
@process_ts_fp_updates.assembled = internal global [15 x %struct.stream*] zeroinitializer, align 16
@g_next_packet = external global i8*, align 8
@.str = private unnamed_addr constant [61 x i8] c"process_ts_fp_update_pdu(), error while decompressing packet\00", align 1
@.str.1 = private unnamed_addr constant [53 x i8] c"process_ts_fp_updates_by_code(), unhandled opcode %d\00", align 1

; Function Attrs: nounwind uwtable
define void @process_ts_fp_updates(%struct.stream*) #0 !dbg !39 {
  %2 = alloca %struct.stream*, align 8
  %3 = alloca i16, align 2
  %4 = alloca i8, align 1
  %5 = alloca i8, align 1
  %6 = alloca i8, align 1
  %7 = alloca i8, align 1
  %8 = alloca i8, align 1
  %9 = alloca i8*, align 8
  %10 = alloca i32, align 4
  %11 = alloca i32, align 4
  %12 = alloca %struct.stream*, align 8
  %13 = alloca %struct.stream*, align 8
  store %struct.stream* %0, %struct.stream** %2, align 8
  call void @llvm.dbg.declare(metadata %struct.stream** %2, metadata !65, metadata !66), !dbg !67
  call void @llvm.dbg.declare(metadata i16* %3, metadata !68, metadata !66), !dbg !69

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !27, globals: !37)
!1 = !DIFile(filename: "[inter]rdp5.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15, !22}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RDP_SYSTEM_POINTER_TYPE", file: !23, line: 272, size: 32, align: 32, elements: !24)
!23 = !DIFile(filename: "constants.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!24 = !{!25, !26}
!25 = !DIEnumerator(name: "SYSPTR_NULL", value: 0)
!26 = !DIEnumerator(name: "SYSPTR_DEFAULT", value: 32512)
!27 = !{!28, !32, !35, !36}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !30, line: 41, baseType: !31)
!30 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!31 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !30, line: 39, baseType: !34)
!34 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!37 = !{!38}
!38 = distinct !DIGlobalVariable(name: "assembled", scope: !39, file: !40, line: 88, type: !59, isLocal: true, isDefinition: true, variable: [15 x %struct.stream*]* @process_ts_fp_updates.assembled)
!39 = distinct !DISubprogram(name: "process_ts_fp_updates", scope: !40, file: !40, line: 78, type: !41, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !58)
!40 = !DIFile(filename: "rdp5.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!41 = !DISubroutineType(types: !42)
!42 = !{null, !43}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !44, line: 40, baseType: !45)
!44 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !44, line: 25, size: 576, align: 64, elements: !47)
!47 = !{!48, !49, !50, !51, !53, !54, !55, !56, !57}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !46, file: !44, line: 27, baseType: !35, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !46, file: !44, line: 28, baseType: !35, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !46, file: !44, line: 29, baseType: !35, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !44, line: 30, baseType: !52, size: 32, align: 32, offset: 192)
!52 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !46, file: !44, line: 33, baseType: !35, size: 64, align: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !46, file: !44, line: 34, baseType: !35, size: 64, align: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !46, file: !44, line: 35, baseType: !35, size: 64, align: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !46, file: !44, line: 36, baseType: !35, size: 64, align: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !46, file: !44, line: 37, baseType: !35, size: 64, align: 64, offset: 512)
!58 = !{}
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 960, align: 64, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 15)
!62 = !{i32 2, !"Dwarf Version", i32 4}
!63 = !{i32 2, !"Debug Info Version", i32 3}
!64 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!65 = !DILocalVariable(name: "s", arg: 1, scope: !39, file: !40, line: 78, type: !43)
!66 = !DIExpression()
!67 = !DILocation(line: 78, column: 30, scope: !39)
!68 = !DILocalVariable(name: "length", scope: !39, file: !40, line: 80, type: !29)
!69 = !DILocation(line: 80, column: 9, scope: !39)
!70 = !DILocalVariable(name: "hdr", scope: !39, file: !40, line: 81, type: !33)
!71 = !DILocation(line: 81, column: 8, scope: !39)
!72 = !DILocalVariable(name: "code", scope: !39, file: !40, line: 81, type: !33)
!73 = !DILocation(line: 81, column: 13, scope: !39)
!74 = !DILocalVariable(name: "frag", scope: !39, file: !40, line: 81, type: !33)
!75 = !DILocation(line: 81, column: 19, scope: !39)
!76 = !DILocalVariable(name: "comp", scope: !39, file: !40, line: 81, type: !33)
!77 = !DILocation(line: 81, column: 25, scope: !39)
!78 = !DILocalVariable(name: "ctype", scope: !39, file: !40, line: 81, type: !33)
!79 = !DILocation(line: 81, column: 31, scope: !39)
!80 = !DILocalVariable(name: "next", scope: !39, file: !40, line: 82, type: !32)
!81 = !DILocation(line: 82, column: 9, scope: !39)
!82 = !DILocalVariable(name: "roff", scope: !39, file: !40, line: 84, type: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !30, line: 43, baseType: !52)
!84 = !DILocation(line: 84, column: 9, scope: !39)
!85 = !DILocalVariable(name: "rlen", scope: !39, file: !40, line: 84, type: !83)
!86 = !DILocation(line: 84, column: 15, scope: !39)
!87 = !DILocalVariable(name: "ns", scope: !39, file: !40, line: 85, type: !45)
!88 = !DILocation(line: 85, column: 17, scope: !39)
!89 = !DILocalVariable(name: "ts", scope: !39, file: !40, line: 86, type: !45)
!90 = !DILocation(line: 86, column: 17, scope: !39)
!91 = !DILocation(line: 90, column: 2, scope: !39)
!92 = !DILocation(line: 91, column: 2, scope: !39)
!93 = !DILocation(line: 91, column: 9, scope: !94)
!94 = !DILexicalBlockFile(scope: !39, file: !40, discriminator: 1)
!95 = !DILocation(line: 91, column: 12, scope: !94)
!96 = !DILocation(line: 91, column: 16, scope: !94)
!97 = !DILocation(line: 91, column: 19, scope: !94)
!98 = !DILocation(line: 91, column: 14, scope: !94)
!99 = !DILocation(line: 91, column: 2, scope: !94)
!100 = !DILocation(line: 94, column: 12, scope: !101)
!101 = distinct !DILexicalBlock(scope: !39, file: !40, line: 92, column: 2)
!102 = !DILocation(line: 94, column: 16, scope: !101)
!103 = !DILocation(line: 94, column: 17, scope: !101)
!104 = !DILocation(line: 94, column: 9, scope: !101)
!105 = !DILocation(line: 94, column: 7, scope: !101)
!106 = !DILocation(line: 95, column: 10, scope: !101)
!107 = !DILocation(line: 95, column: 14, scope: !101)
!108 = !DILocation(line: 95, column: 8, scope: !101)
!109 = !DILocation(line: 96, column: 10, scope: !101)
!110 = !DILocation(line: 96, column: 14, scope: !101)
!111 = !DILocation(line: 96, column: 8, scope: !101)
!112 = !DILocation(line: 97, column: 10, scope: !101)
!113 = !DILocation(line: 97, column: 14, scope: !101)
!114 = !DILocation(line: 97, column: 8, scope: !101)
!115 = !DILocation(line: 99, column: 7, scope: !116)
!116 = distinct !DILexicalBlock(scope: !101, file: !40, line: 99, column: 7)
!117 = !DILocation(line: 99, column: 12, scope: !116)
!118 = !DILocation(line: 99, column: 7, scope: !101)
!119 = !DILocation(line: 100, column: 15, scope: !116)
!120 = !DILocation(line: 100, column: 19, scope: !116)
!121 = !DILocation(line: 100, column: 20, scope: !116)
!122 = !DILocation(line: 100, column: 12, scope: !116)
!123 = !DILocation(line: 100, column: 10, scope: !116)
