; ModuleID = './[inter]seamless.o.i'
source_filename = "./[inter]seamless.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._VCHANNEL = type { i16, [8 x i8], i32, %struct.stream, void (%struct.stream*)* }
%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }
%struct.timeval = type { i64, i64 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@g_seamless_rdp = external global i32, align 4
@seamless_serial = internal global i32 0, align 4
@.str = private unnamed_addr constant [8 x i8] c"seamrdp\00", align 1
@seamless_channel = internal global %struct._VCHANNEL* null, align 8
@seamless_rest = internal global i8* null, align 8
@.str.1 = private unnamed_addr constant [5 x i8] c"SYNC\00", align 1
@.str.2 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.3 = private unnamed_addr constant [6 x i8] c"STATE\00", align 1
@.str.4 = private unnamed_addr constant [19 x i8] c"0x%08lx,0x%x,0x%lx\00", align 1
@.str.5 = private unnamed_addr constant [9 x i8] c"POSITION\00", align 1
@.str.6 = private unnamed_addr constant [26 x i8] c"0x%08lx,%d,%d,%d,%d,0x%lx\00", align 1
@seamless_select_timeout.ourtimeout = private unnamed_addr constant %struct.timeval { i64 0, i64 200000 }, align 8
@.str.7 = private unnamed_addr constant [8 x i8] c"ZCHANGE\00", align 1
@.str.8 = private unnamed_addr constant [22 x i8] c"0x%08lx,0x%08lx,0x%lx\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22, globals: !27)
!1 = !DIFile(filename: "[inter]seamless.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !{!23, !24, !25}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!24 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!27 = !{!28, !65, !66, !70}
!28 = distinct !DIGlobalVariable(name: "seamless_channel", scope: !0, file: !29, line: 27, type: !30, isLocal: true, isDefinition: true, variable: %struct._VCHANNEL** @seamless_channel)
!29 = !DIFile(filename: "seamless.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "VCHANNEL", file: !32, line: 169, baseType: !33)
!32 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VCHANNEL", file: !32, line: 161, size: 768, align: 64, elements: !34)
!34 = !{!35, !38, !42, !44, !59}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_id", scope: !33, file: !32, line: 163, baseType: !36, size: 16, align: 16)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !32, line: 41, baseType: !37)
!37 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !33, file: !32, line: 164, baseType: !39, size: 64, align: 8, offset: 16)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, align: 8, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 8)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !33, file: !32, line: 165, baseType: !43, size: 32, align: 32, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !32, line: 43, baseType: !24)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !33, file: !32, line: 166, baseType: !45, size: 576, align: 64, offset: 128)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !46, line: 25, size: 576, align: 64, elements: !47)
!46 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!47 = !{!48, !51, !52, !53, !54, !55, !56, !57, !58}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !45, file: !46, line: 27, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !45, file: !46, line: 28, baseType: !49, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !45, file: !46, line: 29, baseType: !49, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !45, file: !46, line: 30, baseType: !24, size: 32, align: 32, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !45, file: !46, line: 33, baseType: !49, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !45, file: !46, line: 34, baseType: !49, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !45, file: !46, line: 35, baseType: !49, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !45, file: !46, line: 36, baseType: !49, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !45, file: !46, line: 37, baseType: !49, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !33, file: !32, line: 167, baseType: !60, size: 64, align: 64, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !63}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !46, line: 40, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!65 = distinct !DIGlobalVariable(name: "seamless_serial", scope: !0, file: !29, line: 28, type: !24, isLocal: true, isDefinition: true, variable: i32* @seamless_serial)
!66 = distinct !DIGlobalVariable(name: "icon_buf", scope: !0, file: !29, line: 30, type: !67, isLocal: true, isDefinition: true, variable: [1024 x i8]* @icon_buf)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8192, align: 8, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 1024)
!70 = distinct !DIGlobalVariable(name: "seamless_rest", scope: !0, file: !29, line: 29, type: !25, isLocal: true, isDefinition: true, variable: i8** @seamless_rest)
!71 = !{i32 2, !"Dwarf Version", i32 4}
!72 = !{i32 2, !"Debug Info Version", i32 3}
!73 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!74 = distinct !DISubprogram(name: "seamless_init", scope: !29, file: !29, line: 385, type: !75, isLocal: false, isDefinition: true, scopeLine: 386, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !79)
!75 = !DISubroutineType(types: !76)
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !32, line: 28, baseType: !78)
!78 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!79 = !{}
!80 = !DILocation(line: 387, column: 7, scope: !81)
!81 = distinct !DILexicalBlock(scope: !74, file: !29, line: 387, column: 6)
!82 = !DILocation(line: 387, column: 6, scope: !74)
!83 = !DILocation(line: 388, column: 3, scope: !81)
!84 = !DILocation(line: 390, column: 18, scope: !74)
!85 = !DILocation(line: 393, column: 3, scope: !74)
!86 = !DILocation(line: 392, column: 19, scope: !74)
!87 = !DILocation(line: 395, column: 10, scope: !74)
!88 = !DILocation(line: 395, column: 27, scope: !74)
!89 = !DILocation(line: 395, column: 2, scope: !74)
!90 = !DILocation(line: 396, column: 1, scope: !74)
!91 = distinct !DISubprogram(name: "seamless_process", scope: !29, file: !29, line: 369, type: !61, isLocal: true, isDefinition: true, scopeLine: 370, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !79)
!92 = !DILocalVariable(name: "s", arg: 1, scope: !91, file: !29, line: 369, type: !63)
!93 = !DIExpression()
!94 = !DILocation(line: 369, column: 25, scope: !91)
!95 = !DILocalVariable(name: "pkglen", scope: !91, file: !29, line: 371, type: !24)
!96 = !DILocation(line: 371, column: 15, scope: !91)
!97 = !DILocalVariable(name: "buf", scope: !91, file: !29, line: 372, type: !25)
!98 = !DILocation(line: 372, column: 8, scope: !91)
!99 = !DILocation(line: 374, column: 11, scope: !91)
!100 = !DILocation(line: 374, column: 14, scope: !91)
!101 = !DILocation(line: 374, column: 20, scope: !91)
!102 = !DILocation(line: 374, column: 23, scope: !91)
!103 = !DILocation(line: 374, column: 18, scope: !91)
!104 = !DILocation(line: 374, column: 9, scope: !91)
!105 = !DILocation(line: 376, column: 16, scope: !91)
!106 = !DILocation(line: 376, column: 23, scope: !91)
!107 = !DILocation(line: 376, column: 8, scope: !91)
!108 = !DILocation(line: 376, column: 6, scope: !91)
!109 = !DILocation(line: 377, column: 12, scope: !110)
!110 = distinct !DILexicalBlock(scope: !91, file: !29, line: 377, column: 2)
!111 = !DILocation(line: 377, column: 25, scope: !110)
!112 = !DILocation(line: 377, column: 28, scope: !110)
!113 = !DILocation(line: 377, column: 30, scope: !110)
!114 = !DILocation(line: 377, column: 37, scope: !110)
!115 = !DILocation(line: 377, column: 41, scope: !110)
!116 = !DILocation(line: 377, column: 4, scope: !110)
!117 = !DILocation(line: 377, column: 50, scope: !110)
!118 = !DILocation(line: 377, column: 57, scope: !110)
!119 = !DILocation(line: 377, column: 61, scope: !110)
!120 = !DILocation(line: 377, column: 46, scope: !110)
!121 = !DILocation(line: 377, column: 65, scope: !110)
!122 = !DILocation(line: 378, column: 19, scope: !91)
!123 = !DILocation(line: 378, column: 2, scope: !91)
!124 = !DILocation(line: 380, column: 8, scope: !91)
!125 = !DILocation(line: 380, column: 2, scope: !91)
!126 = !DILocation(line: 381, column: 1, scope: !91)
!127 = distinct !DISubprogram(name: "seamless_reset_state", scope: !29, file: !29, line: 399, type: !128, isLocal: false, isDefinition: true, scopeLine: 400, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !79)
!128 = !DISubroutineType(types: !129)
!129 = !{null}
!130 = !DILocation(line: 401, column: 6, scope: !131)
!131 = distinct !DILexicalBlock(scope: !127, file: !29, line: 401, column: 6)
!132 = !DILocation(line: 401, column: 20, scope: !131)
!133 = !DILocation(line: 401, column: 6, scope: !127)
!134 = !DILocation(line: 403, column: 9, scope: !135)
!135 = distinct !DILexicalBlock(scope: !131, file: !29, line: 402, column: 2)
!136 = !DILocation(line: 403, column: 3, scope: !135)
!137 = !DILocation(line: 404, column: 17, scope: !135)
!138 = !DILocation(line: 405, column: 2, scope: !135)
!139 = !DILocation(line: 406, column: 1, scope: !127)
!140 = distinct !DISubprogram(name: "seamless_send_sync", scope: !29, file: !29, line: 448, type: !141, isLocal: false, isDefinition: true, scopeLine: 449, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !79)
!141 = !DISubroutineType(types: !142)
!142 = !{!24}
!143 = !DILocation(line: 450, column: 7, scope: !144)
!144 = distinct !DILexicalBlock(scope: !140, file: !29, line: 450, column: 6)
!145 = !DILocation(line: 450, column: 6, scope: !140)
!146 = !DILocation(line: 451, column: 3, scope: !144)
!147 = !DILocation(line: 453, column: 9, scope: !140)
!148 = !DILocation(line: 453, column: 2, scope: !140)
!149 = !DILocation(line: 454, column: 1, scope: !140)
!150 = distinct !DISubprogram(name: "seamless_send", scope: !29, file: !29, line: 409, type: !151, isLocal: true, isDefinition: true, scopeLine: 410, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !79)
!151 = !DISubroutineType(types: !152)
!152 = !{!24, !153, !153, null}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!155 = !DILocalVariable(name: "command", arg: 1, scope: !150, file: !29, line: 409, type: !153)
!156 = !DILocation(line: 409, column: 27, scope: !150)
!157 = !DILocalVariable(name: "format", arg: 2, scope: !150, file: !29, line: 409, type: !153)
!158 = !DILocation(line: 409, column: 48, scope: !150)
!159 = !DILocalVariable(name: "s", scope: !150, file: !29, line: 411, type: !63)
!160 = !DILocation(line: 411, column: 9, scope: !150)
!161 = !DILocalVariable(name: "len", scope: !150, file: !29, line: 412, type: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !163, line: 216, baseType: !164)
!163 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!164 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!165 = !DILocation(line: 412, column: 9, scope: !150)
!166 = !DILocalVariable(name: "argp", scope: !150, file: !29, line: 413, type: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !168, line: 79, baseType: !169)
!168 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !170, line: 40, baseType: !171)
!170 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 413, baseType: !172)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 192, align: 64, elements: !179)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 413, size: 192, align: 64, elements: !174)
!174 = !{!175, !176, !177, !178}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !173, file: !1, line: 413, baseType: !24, size: 32, align: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !173, file: !1, line: 413, baseType: !24, size: 32, align: 32, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !173, file: !1, line: 413, baseType: !23, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !173, file: !1, line: 413, baseType: !23, size: 64, align: 64, offset: 128)
!179 = !{!180}
!180 = !DISubrange(count: 1)
!181 = !DILocation(line: 413, column: 10, scope: !150)
!182 = !DILocalVariable(name: "escaped", scope: !150, file: !29, line: 414, type: !25)
!183 = !DILocation(line: 414, column: 8, scope: !150)
!184 = !DILocalVariable(name: "buf", scope: !150, file: !29, line: 414, type: !185)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8200, align: 8, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 1025)
!188 = !DILocation(line: 414, column: 17, scope: !150)
!189 = !DILocation(line: 416, column: 17, scope: !150)
!190 = !DILocation(line: 416, column: 49, scope: !150)
!191 = !DILocation(line: 416, column: 58, scope: !150)
!192 = !DILocation(line: 416, column: 8, scope: !150)
!193 = !DILocation(line: 416, column: 6, scope: !150)
!194 = !DILocation(line: 418, column: 1, scope: !150)
!195 = !DILocation(line: 418, column: 5, scope: !150)
!196 = !DILocation(line: 418, column: 2, scope: !150)
!197 = !DILocation(line: 418, column: 2, scope: !198)
!198 = !DILexicalBlockFile(scope: !150, file: !29, discriminator: 1)
!199 = !DILocation(line: 418, column: 18, scope: !200)
!200 = !DILexicalBlockFile(scope: !150, file: !29, discriminator: 2)
!201 = !DILocation(line: 418, column: 2, scope: !202)
!202 = !DILexicalBlockFile(scope: !150, file: !29, discriminator: 3)
!203 = !DILocation(line: 420, column: 1, scope: !150)
!204 = !DILocation(line: 421, column: 19, scope: !150)
!205 = !DILocation(line: 421, column: 25, scope: !150)
!206 = !DILocation(line: 421, column: 23, scope: !150)
!207 = !DILocation(line: 421, column: 44, scope: !150)
!208 = !DILocation(line: 421, column: 42, scope: !150)
!209 = !DILocation(line: 421, column: 48, scope: !150)
!210 = !DILocation(line: 421, column: 53, scope: !150)
!211 = !DILocation(line: 421, column: 61, scope: !150)
!212 = !DILocation(line: 421, column: 9, scope: !150)
!213 = !DILocation(line: 421, column: 6, scope: !150)
!214 = !DILocation(line: 422, column: 1, scope: !150)
!215 = !DILocation(line: 424, column: 1, scope: !150)
!216 = !DILocation(line: 424, column: 5, scope: !150)
!217 = !DILocation(line: 424, column: 2, scope: !150)
!218 = !DILocation(line: 424, column: 2, scope: !198)
!219 = !DILocation(line: 424, column: 18, scope: !200)
!220 = !DILocation(line: 424, column: 2, scope: !202)
!221 = !DILocation(line: 426, column: 32, scope: !150)
!222 = !DILocation(line: 426, column: 12, scope: !150)
!223 = !DILocation(line: 426, column: 10, scope: !150)
!224 = !DILocation(line: 427, column: 17, scope: !150)
!225 = !DILocation(line: 427, column: 41, scope: !150)
!226 = !DILocation(line: 427, column: 8, scope: !150)
!227 = !DILocation(line: 427, column: 6, scope: !150)
!228 = !DILocation(line: 428, column: 7, scope: !150)
!229 = !DILocation(line: 428, column: 2, scope: !150)
!230 = !DILocation(line: 429, column: 1, scope: !150)
!231 = !DILocation(line: 429, column: 5, scope: !150)
!232 = !DILocation(line: 429, column: 2, scope: !150)
!233 = !DILocation(line: 429, column: 2, scope: !198)
!234 = !DILocation(line: 429, column: 18, scope: !200)
!235 = !DILocation(line: 429, column: 2, scope: !202)
!236 = !DILocation(line: 431, column: 6, scope: !150)
!237 = !DILocation(line: 431, column: 2, scope: !150)
!238 = !DILocation(line: 431, column: 11, scope: !150)
!239 = !DILocation(line: 432, column: 6, scope: !150)
!240 = !DILocation(line: 432, column: 10, scope: !150)
!241 = !DILocation(line: 432, column: 2, scope: !150)
!242 = !DILocation(line: 432, column: 15, scope: !150)
!243 = !DILocation(line: 434, column: 5, scope: !150)
!244 = !DILocation(line: 436, column: 19, scope: !150)
!245 = !DILocation(line: 436, column: 37, scope: !150)
!246 = !DILocation(line: 436, column: 6, scope: !150)
!247 = !DILocation(line: 436, column: 4, scope: !150)
!248 = !DILocation(line: 437, column: 12, scope: !249)
!249 = distinct !DILexicalBlock(scope: !150, file: !29, line: 437, column: 2)
!250 = !DILocation(line: 437, column: 16, scope: !249)
!251 = !DILocation(line: 437, column: 4, scope: !249)
!252 = !DILocation(line: 437, column: 22, scope: !249)
!253 = !DILocation(line: 437, column: 38, scope: !249)
!254 = !DILocation(line: 437, column: 29, scope: !249)
!255 = !DILocation(line: 437, column: 33, scope: !249)
!256 = !DILocation(line: 437, column: 35, scope: !249)
!257 = !DILocation(line: 437, column: 57, scope: !150)
!258 = !DILocation(line: 437, column: 61, scope: !150)
!259 = !DILocation(line: 437, column: 46, scope: !150)
!260 = !DILocation(line: 437, column: 50, scope: !150)
!261 = !DILocation(line: 437, column: 54, scope: !150)
!262 = !DILocation(line: 439, column: 55, scope: !150)
!263 = !DILocation(line: 439, column: 2, scope: !150)
!264 = !DILocation(line: 441, column: 15, scope: !150)
!265 = !DILocation(line: 441, column: 18, scope: !150)
!266 = !DILocation(line: 441, column: 2, scope: !150)
!267 = !DILocation(line: 443, column: 24, scope: !150)
!268 = !DILocation(line: 443, column: 2, scope: !150)
!269 = distinct !DISubprogram(name: "seamless_send_state", scope: !29, file: !29, line: 458, type: !270, isLocal: false, isDefinition: true, scopeLine: 459, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !79)
!270 = !DISubroutineType(types: !271)
!271 = !{!24, !164, !24, !164}
!272 = !DILocalVariable(name: "id", arg: 1, scope: !269, file: !29, line: 458, type: !164)
!273 = !DILocation(line: 458, column: 35, scope: !269)
!274 = !DILocalVariable(name: "state", arg: 2, scope: !269, file: !29, line: 458, type: !24)
!275 = !DILocation(line: 458, column: 52, scope: !269)
!276 = !DILocalVariable(name: "flags", arg: 3, scope: !269, file: !29, line: 458, type: !164)
!277 = !DILocation(line: 458, column: 73, scope: !269)
!278 = !DILocation(line: 460, column: 7, scope: !279)
!279 = distinct !DILexicalBlock(scope: !269, file: !29, line: 460, column: 6)
!280 = !DILocation(line: 460, column: 6, scope: !269)
!281 = !DILocation(line: 461, column: 3, scope: !279)
!282 = !DILocation(line: 463, column: 54, scope: !269)
!283 = !DILocation(line: 463, column: 58, scope: !269)
!284 = !DILocation(line: 463, column: 65, scope: !269)
!285 = !DILocation(line: 463, column: 9, scope: !269)
!286 = !DILocation(line: 463, column: 2, scope: !269)
!287 = !DILocation(line: 464, column: 1, scope: !269)
!288 = distinct !DISubprogram(name: "seamless_send_position", scope: !29, file: !29, line: 468, type: !289, isLocal: false, isDefinition: true, scopeLine: 469, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !79)
!289 = !DISubroutineType(types: !290)
!290 = !{!24, !164, !78, !78, !78, !78, !164}
!291 = !DILocalVariable(name: "id", arg: 1, scope: !288, file: !29, line: 468, type: !164)
!292 = !DILocation(line: 468, column: 38, scope: !288)
!293 = !DILocalVariable(name: "x", arg: 2, scope: !288, file: !29, line: 468, type: !78)
!294 = !DILocation(line: 468, column: 46, scope: !288)
!295 = !DILocalVariable(name: "y", arg: 3, scope: !288, file: !29, line: 468, type: !78)
!296 = !DILocation(line: 468, column: 53, scope: !288)
!297 = !DILocalVariable(name: "width", arg: 4, scope: !288, file: !29, line: 468, type: !78)
!298 = !DILocation(line: 468, column: 60, scope: !288)
!299 = !DILocalVariable(name: "height", arg: 5, scope: !288, file: !29, line: 468, type: !78)
!300 = !DILocation(line: 468, column: 71, scope: !288)
!301 = !DILocalVariable(name: "flags", arg: 6, scope: !288, file: !29, line: 468, type: !164)
!302 = !DILocation(line: 468, column: 93, scope: !288)
!303 = !DILocation(line: 470, column: 64, scope: !288)
!304 = !DILocation(line: 470, column: 68, scope: !288)
!305 = !DILocation(line: 470, column: 71, scope: !288)
!306 = !DILocation(line: 470, column: 74, scope: !288)
!307 = !DILocation(line: 470, column: 81, scope: !288)
!308 = !DILocation(line: 471, column: 9, scope: !288)
!309 = !DILocation(line: 470, column: 9, scope: !288)
!310 = !DILocation(line: 470, column: 2, scope: !288)
!311 = distinct !DISubprogram(name: "seamless_select_timeout", scope: !29, file: !29, line: 477, type: !312, isLocal: false, isDefinition: true, scopeLine: 478, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !79)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !314}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !316, line: 30, size: 128, align: 64, elements: !317)
!316 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!317 = !{!318, !322}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !315, file: !316, line: 32, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !320, line: 139, baseType: !321)
!320 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!321 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !315, file: !316, line: 33, baseType: !323, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !320, line: 141, baseType: !321)
!324 = !DILocalVariable(name: "tv", arg: 1, scope: !311, file: !29, line: 477, type: !314)
!325 = !DILocation(line: 477, column: 41, scope: !311)
!326 = !DILocalVariable(name: "ourtimeout", scope: !311, file: !29, line: 479, type: !315)
!327 = !DILocation(line: 479, column: 17, scope: !311)
!328 = !DILocation(line: 481, column: 6, scope: !329)
!329 = distinct !DILexicalBlock(scope: !311, file: !29, line: 481, column: 6)
!330 = !DILocation(line: 481, column: 6, scope: !311)
!331 = !DILocation(line: 483, column: 9, scope: !332)
!332 = distinct !DILexicalBlock(scope: !333, file: !29, line: 483, column: 6)
!333 = distinct !DILexicalBlock(scope: !329, file: !29, line: 482, column: 2)
!334 = !DILocation(line: 483, column: 6, scope: !332)
!335 = !DILocation(line: 483, column: 16, scope: !332)
!336 = !DILocation(line: 483, column: 6, scope: !333)
!337 = !DILocation(line: 483, column: 9, scope: !338)
!338 = !DILexicalBlockFile(scope: !332, file: !29, discriminator: 1)
!339 = !DILocation(line: 483, column: 6, scope: !338)
!340 = !DILocation(line: 483, column: 7, scope: !338)
!341 = !DILocation(line: 483, column: 9, scope: !342)
!342 = !DILexicalBlockFile(scope: !332, file: !29, discriminator: 2)
!343 = !DILocation(line: 483, column: 6, scope: !342)
!344 = !DILocation(line: 485, column: 28, scope: !345)
!345 = distinct !DILexicalBlock(scope: !332, file: !29, line: 484, column: 3)
!346 = !DILocation(line: 485, column: 4, scope: !345)
!347 = !DILocation(line: 485, column: 8, scope: !345)
!348 = !DILocation(line: 485, column: 15, scope: !345)
!349 = !DILocation(line: 486, column: 29, scope: !345)
!350 = !DILocation(line: 486, column: 4, scope: !345)
!351 = !DILocation(line: 486, column: 8, scope: !345)
!352 = !DILocation(line: 486, column: 16, scope: !345)
!353 = !DILocation(line: 487, column: 3, scope: !345)
!354 = !DILocation(line: 488, column: 2, scope: !333)
!355 = !DILocation(line: 489, column: 1, scope: !311)
!356 = distinct !DISubprogram(name: "seamless_send_zchange", scope: !29, file: !29, line: 493, type: !357, isLocal: false, isDefinition: true, scopeLine: 494, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !79)
!357 = !DISubroutineType(types: !358)
!358 = !{!24, !164, !164, !164}
!359 = !DILocalVariable(name: "id", arg: 1, scope: !356, file: !29, line: 493, type: !164)
!360 = !DILocation(line: 493, column: 37, scope: !356)
!361 = !DILocalVariable(name: "below", arg: 2, scope: !356, file: !29, line: 493, type: !164)
!362 = !DILocation(line: 493, column: 55, scope: !356)
!363 = !DILocalVariable(name: "flags", arg: 3, scope: !356, file: !29, line: 493, type: !164)
!364 = !DILocation(line: 493, column: 76, scope: !356)
!365 = !DILocation(line: 495, column: 7, scope: !366)
!366 = distinct !DILexicalBlock(scope: !356, file: !29, line: 495, column: 6)
!367 = !DILocation(line: 495, column: 6, scope: !356)
!368 = !DILocation(line: 496, column: 3, scope: !366)
!369 = !DILocation(line: 498, column: 59, scope: !356)
!370 = !DILocation(line: 498, column: 63, scope: !356)
!371 = !DILocation(line: 498, column: 70, scope: !356)
!372 = !DILocation(line: 498, column: 9, scope: !356)
!373 = !DILocation(line: 498, column: 2, scope: !356)
!374 = !DILocation(line: 499, column: 1, scope: !356)
!375 = distinct !DISubprogram(name: "seamless_send_focus", scope: !29, file: !29, line: 504, type: !376, isLocal: false, isDefinition: true, scopeLine: 505, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !79)
!376 = !DISubroutineType(types: !377)
!377 = !{!24, !164, !164}
!378 = !DILocalVariable(name: "id", arg: 1, scope: !375, file: !29, line: 504, type: !164)
!379 = !DILocation(line: 504, column: 35, scope: !375)
!380 = !DILocalVariable(name: "flags", arg: 2, scope: !375, file: !29, line: 504, type: !164)
