; ModuleID = './[inter]rdpsnd_dsp.o.i'
source_filename = "./[inter]rdpsnd_dsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }
%struct._RD_WAVEFORMATEX = type { i16, i16, i32, i32, i16, i16, i16, [256 x i8] }
%struct.audio_driver = type { void (i32*, %struct.fd_set*, %struct.fd_set*, %struct.timeval*)*, void (%struct.fd_set*, %struct.fd_set*)*, i32 ()*, void ()*, i32 (%struct._RD_WAVEFORMATEX*)*, i32 (%struct._RD_WAVEFORMATEX*)*, void (i16, i16)*, i32 ()*, void ()*, i32 (%struct._RD_WAVEFORMATEX*)*, i32 (%struct._RD_WAVEFORMATEX*)*, void (i16, i16)*, i8*, i8*, i32, i32, %struct.audio_driver* }
%struct.fd_set = type { [16 x i64] }
%struct.timeval = type { i64, i64 }

@softvol_left = internal global i16 -1, align 2
@softvol_right = internal global i16 -1, align 2
@.str = private unnamed_addr constant [47 x i8] c"rdpsnd_dsp_softvol_set(), left: %u, right: %u\0A\00", align 1
@.str.1 = private unnamed_addr constant [77 x i8] c"rdpsnd_dsp_softvol(), using softvol with factors left: %d, right: %d (%d/%d)\00", align 1
@.str.2 = private unnamed_addr constant [49 x i8] c"rdpsnd_dsp_swapbytes(), badly aligned sound data\00", align 1
@resample_to_srate = internal global i32 44100, align 4
@resample_to_bitspersample = internal global i16 16, align 2
@resample_to_channels = internal global i16 2, align 2

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22, globals: !27)
!1 = !DIFile(filename: "[inter]rdpsnd_dsp.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !{!23, !24, !26}
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!27 = !{!28, !132, !133, !134, !135, !136}
!28 = distinct !DIGlobalVariable(name: "out", scope: !29, file: !30, line: 398, type: !36, isLocal: true, isDefinition: true, variable: %struct.stream* @rdpsnd_dsp_process.out)
!29 = distinct !DISubprogram(name: "rdpsnd_dsp_process", scope: !30, file: !30, line: 395, type: !31, isLocal: false, isDefinition: true, scopeLine: 397, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !131)
!30 = !DIFile(filename: "rdpsnd_dsp.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!31 = !DISubroutineType(types: !32)
!32 = !{!33, !24, !42, !48, !95}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !34, line: 40, baseType: !35)
!34 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !34, line: 25, size: 576, align: 64, elements: !37)
!37 = !{!38, !39, !40, !41, !43, !44, !45, !46, !47}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !36, file: !34, line: 27, baseType: !24, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !36, file: !34, line: 28, baseType: !24, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !36, file: !34, line: 29, baseType: !24, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !34, line: 30, baseType: !42, size: 32, align: 32, offset: 192)
!42 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !36, file: !34, line: 33, baseType: !24, size: 64, align: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !36, file: !34, line: 34, baseType: !24, size: 64, align: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !36, file: !34, line: 35, baseType: !24, size: 64, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !36, file: !34, line: 36, baseType: !24, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !36, file: !34, line: 37, baseType: !24, size: 64, align: 64, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "audio_driver", file: !50, line: 30, size: 1024, align: 64, elements: !51)
!50 = !DIFile(filename: "rdpsnd.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!51 = !{!52, !77, !81, !87, !91, !114, !115, !119, !120, !121, !122, !123, !124, !127, !128, !129, !130}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "add_fds", scope: !49, file: !50, line: 32, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !56, !57, !57, !68}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !59, line: 75, baseType: !60)
!59 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 64, size: 1024, align: 64, elements: !61)
!61 = !{!62}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__fds_bits", scope: !60, file: !59, line: 72, baseType: !63, size: 1024, align: 64)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 1024, align: 64, elements: !66)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !59, line: 54, baseType: !65)
!65 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!66 = !{!67}
!67 = !DISubrange(count: 16)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !70, line: 30, size: 128, align: 64, elements: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!71 = !{!72, !75}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !69, file: !70, line: 32, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !74, line: 139, baseType: !65)
!74 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !69, file: !70, line: 33, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !74, line: 141, baseType: !65)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "check_fds", scope: !49, file: !50, line: 33, baseType: !78, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !57, !57}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "wave_out_open", scope: !49, file: !50, line: 35, baseType: !82, size: 64, align: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !86, line: 28, baseType: !23)
!86 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!87 = !DIDerivedType(tag: DW_TAG_member, name: "wave_out_close", scope: !49, file: !50, line: 36, baseType: !88, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{null}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "wave_out_format_supported", scope: !49, file: !50, line: 37, baseType: !92, size: 64, align: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!85, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_WAVEFORMATEX", file: !86, line: 197, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RD_WAVEFORMATEX", file: !86, line: 187, size: 2208, align: 32, elements: !98)
!98 = !{!99, !102, !103, !105, !106, !107, !108, !109}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "wFormatTag", scope: !97, file: !86, line: 189, baseType: !100, size: 16, align: 16)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !86, line: 41, baseType: !101)
!101 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "nChannels", scope: !97, file: !86, line: 190, baseType: !100, size: 16, align: 16, offset: 16)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "nSamplesPerSec", scope: !97, file: !86, line: 191, baseType: !104, size: 32, align: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !86, line: 43, baseType: !42)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "nAvgBytesPerSec", scope: !97, file: !86, line: 192, baseType: !104, size: 32, align: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "nBlockAlign", scope: !97, file: !86, line: 193, baseType: !100, size: 16, align: 16, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "wBitsPerSample", scope: !97, file: !86, line: 194, baseType: !100, size: 16, align: 16, offset: 112)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "cbSize", scope: !97, file: !86, line: 195, baseType: !100, size: 16, align: 16, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !97, file: !86, line: 196, baseType: !110, size: 2048, align: 8, offset: 144)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 2048, align: 8, elements: !112)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !86, line: 39, baseType: !25)
!112 = !{!113}
!113 = !DISubrange(count: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "wave_out_set_format", scope: !49, file: !50, line: 38, baseType: !92, size: 64, align: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "wave_out_volume", scope: !49, file: !50, line: 39, baseType: !116, size: 64, align: 64, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !100, !100}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "wave_in_open", scope: !49, file: !50, line: 41, baseType: !82, size: 64, align: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wave_in_close", scope: !49, file: !50, line: 42, baseType: !88, size: 64, align: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "wave_in_format_supported", scope: !49, file: !50, line: 43, baseType: !92, size: 64, align: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "wave_in_set_format", scope: !49, file: !50, line: 44, baseType: !92, size: 64, align: 64, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "wave_in_volume", scope: !49, file: !50, line: 45, baseType: !116, size: 64, align: 64, offset: 704)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !49, file: !50, line: 47, baseType: !125, size: 64, align: 64, offset: 768)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !49, file: !50, line: 48, baseType: !125, size: 64, align: 64, offset: 832)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "need_byteswap_on_be", scope: !49, file: !50, line: 49, baseType: !23, size: 32, align: 32, offset: 896)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "need_resampling", scope: !49, file: !50, line: 50, baseType: !23, size: 32, align: 32, offset: 928)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !49, file: !50, line: 51, baseType: !48, size: 64, align: 64, offset: 960)
!131 = !{}
!132 = distinct !DIGlobalVariable(name: "softvol_left", scope: !0, file: !30, line: 35, type: !100, isLocal: true, isDefinition: true, variable: i16* @softvol_left)
!133 = distinct !DIGlobalVariable(name: "softvol_right", scope: !0, file: !30, line: 36, type: !100, isLocal: true, isDefinition: true, variable: i16* @softvol_right)
!134 = distinct !DIGlobalVariable(name: "resample_to_srate", scope: !0, file: !30, line: 37, type: !104, isLocal: true, isDefinition: true, variable: i32* @resample_to_srate)
!135 = distinct !DIGlobalVariable(name: "resample_to_bitspersample", scope: !0, file: !30, line: 38, type: !100, isLocal: true, isDefinition: true, variable: i16* @resample_to_bitspersample)
!136 = distinct !DIGlobalVariable(name: "resample_to_channels", scope: !0, file: !30, line: 39, type: !100, isLocal: true, isDefinition: true, variable: i16* @resample_to_channels)
!137 = !{i32 2, !"Dwarf Version", i32 4}
!138 = !{i32 2, !"Debug Info Version", i32 3}
!139 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!140 = distinct !DISubprogram(name: "rdpsnd_dsp_softvol_set", scope: !30, file: !30, line: 45, type: !117, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !131)
!141 = !DILocalVariable(name: "left", arg: 1, scope: !140, file: !30, line: 45, type: !100)
!142 = !DIExpression()
!143 = !DILocation(line: 45, column: 31, scope: !140)
!144 = !DILocalVariable(name: "right", arg: 2, scope: !140, file: !30, line: 45, type: !100)
!145 = !DILocation(line: 45, column: 44, scope: !140)
!146 = !DILocation(line: 47, column: 17, scope: !140)
!147 = !DILocation(line: 47, column: 15, scope: !140)
!148 = !DILocation(line: 48, column: 18, scope: !140)
!149 = !DILocation(line: 48, column: 16, scope: !140)
!150 = !DILocation(line: 49, column: 74, scope: !140)
!151 = !DILocation(line: 49, column: 80, scope: !140)
!152 = !DILocation(line: 49, column: 2, scope: !140)
!153 = !DILocation(line: 50, column: 1, scope: !140)
!154 = distinct !DISubprogram(name: "rdpsnd_dsp_softvol", scope: !30, file: !30, line: 53, type: !155, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !131)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !24, !42, !95}
!157 = !DILocalVariable(name: "buffer", arg: 1, scope: !154, file: !30, line: 53, type: !24)
!158 = !DILocation(line: 53, column: 35, scope: !154)
!159 = !DILocalVariable(name: "size", arg: 2, scope: !154, file: !30, line: 53, type: !42)
!160 = !DILocation(line: 53, column: 56, scope: !154)
!161 = !DILocalVariable(name: "format", arg: 3, scope: !154, file: !30, line: 53, type: !95)
!162 = !DILocation(line: 53, column: 80, scope: !154)
!163 = !DILocalVariable(name: "factor_left", scope: !154, file: !30, line: 55, type: !42)
!164 = !DILocation(line: 55, column: 15, scope: !154)
!165 = !DILocalVariable(name: "factor_right", scope: !154, file: !30, line: 55, type: !42)
!166 = !DILocation(line: 55, column: 28, scope: !154)
!167 = !DILocalVariable(name: "posin", scope: !154, file: !30, line: 56, type: !24)
!168 = !DILocation(line: 56, column: 17, scope: !154)
!169 = !DILocation(line: 56, column: 25, scope: !154)
!170 = !DILocalVariable(name: "posout", scope: !154, file: !30, line: 57, type: !24)
!171 = !DILocation(line: 57, column: 17, scope: !154)
!172 = !DILocation(line: 57, column: 26, scope: !154)
!173 = !DILocation(line: 59, column: 7, scope: !174)
!174 = distinct !DILexicalBlock(scope: !154, file: !30, line: 59, column: 6)
!175 = !DILocation(line: 59, column: 20, scope: !174)
!176 = !DILocation(line: 59, column: 30, scope: !174)
!177 = !DILocation(line: 59, column: 34, scope: !178)
!178 = !DILexicalBlockFile(scope: !174, file: !30, discriminator: 1)
!179 = !DILocation(line: 59, column: 48, scope: !178)
