; ModuleID = './[inter]xclip.o.i'
source_filename = "./[inter]xclip.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._XDisplay = type opaque
%struct.XSelectionRequestEvent = type { i32, i64, i32, %struct._XDisplay*, i64, i64, i64, i64, i64, i64 }
%struct.XSelectionEvent = type { i32, i64, i32, %struct._XDisplay*, i64, i64, i64, i64, i64 }
%struct.XWindowAttributes = type { i32, i32, i32, i32, i32, i32, %struct.Visual*, i64, i32, i32, i32, i32, i64, i64, i32, i64, i32, i32, i64, i64, i64, i32, %struct.Screen* }
%struct.Visual = type { %struct._XExtData*, i64, i32, i64, i64, i64, i32, i32 }
%struct._XExtData = type { i32, %struct._XExtData*, i32 (%struct._XExtData*)*, i8* }
%struct.Screen = type { %struct._XExtData*, %struct._XDisplay*, i64, i32, i32, i32, i32, i32, %struct.Depth*, i32, %struct.Visual*, %struct._XGC*, i64, i64, i64, i32, i32, i32, i32, i64 }
%struct.Depth = type { i32, i32, %struct.Visual* }
%struct._XGC = type opaque
%union._XEvent = type { [24 x i64] }
%struct.XPropertyEvent = type { i32, i64, i32, %struct._XDisplay*, i64, i64, i64, i32 }

!307 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!308 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!309 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!310 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!311 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!312 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!313 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!314 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!315 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!316 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!317 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!318 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!319 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!320 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!321 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!322 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!323 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!324 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!325 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!326 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!327 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!328 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!329 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!330 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!331 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!332 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!333 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!334 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!335 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!336 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!337 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!338 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!339 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!340 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!341 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!342 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!343 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!344 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!345 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!346 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!347 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!348 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!349 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!350 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!351 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!352 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!353 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!354 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!355 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!356 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!357 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!358 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!359 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!360 = !{!361, !364, !368, !371, !391, !507, !510, !509, !512, !513, !370, !514}
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atom", file: !362, line: 74, baseType: !363)
!362 = !DIFile(filename: "/usr/include/X11/X.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!363 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !366, line: 39, baseType: !367)
!366 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!367 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !366, line: 43, baseType: !370)
!370 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "_XPrivDisplay", file: !372, line: 550, baseType: !373)
!372 = !DIFile(filename: "/usr/include/X11/Xlib.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 493, size: 2368, align: 64, elements: !375)
!375 = !{!376, !393, !396, !397, !398, !399, !400, !401, !403, !404, !405, !406, !412, !413, !414, !415, !416, !417, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !441, !445, !446, !447, !448, !499, !500, !501, !502, !503, !504, !505, !506}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !374, file: !372, line: 498, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExtData", file: !372, line: 155, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_XExtData", file: !372, line: 148, size: 256, align: 64, elements: !380)
!380 = !{!381, !383, !385, !389}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !379, file: !372, line: 149, baseType: !382, size: 32, align: 32)
!382 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !379, file: !372, line: 150, baseType: !384, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "free_private", scope: !379, file: !372, line: 151, baseType: !386, size: 64, align: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!382, !384}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !379, file: !372, line: 154, baseType: !390, size: 64, align: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPointer", file: !372, line: 80, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "private1", scope: !374, file: !372, line: 499, baseType: !394, size: 64, align: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XPrivate", file: !372, line: 490, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !374, file: !372, line: 500, baseType: !382, size: 32, align: 32, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "private2", scope: !374, file: !372, line: 501, baseType: !382, size: 32, align: 32, offset: 160)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "proto_major_version", scope: !374, file: !372, line: 502, baseType: !382, size: 32, align: 32, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "proto_minor_version", scope: !374, file: !372, line: 503, baseType: !382, size: 32, align: 32, offset: 224)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !374, file: !372, line: 504, baseType: !391, size: 64, align: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "private3", scope: !374, file: !372, line: 505, baseType: !402, size: 64, align: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "XID", file: !362, line: 66, baseType: !363)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "private4", scope: !374, file: !372, line: 506, baseType: !402, size: 64, align: 64, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "private5", scope: !374, file: !372, line: 507, baseType: !402, size: 64, align: 64, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "private6", scope: !374, file: !372, line: 508, baseType: !382, size: 32, align: 32, offset: 512)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "resource_alloc", scope: !374, file: !372, line: 509, baseType: !407, size: 64, align: 64, offset: 576)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!402, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XDisplay", file: !372, line: 255, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "byte_order", scope: !374, file: !372, line: 512, baseType: !382, size: 32, align: 32, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_unit", scope: !374, file: !372, line: 513, baseType: !382, size: 32, align: 32, offset: 672)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_pad", scope: !374, file: !372, line: 514, baseType: !382, size: 32, align: 32, offset: 704)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_bit_order", scope: !374, file: !372, line: 515, baseType: !382, size: 32, align: 32, offset: 736)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "nformats", scope: !374, file: !372, line: 516, baseType: !382, size: 32, align: 32, offset: 768)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pixmap_format", scope: !374, file: !372, line: 517, baseType: !418, size: 64, align: 64, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScreenFormat", file: !372, line: 285, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 280, size: 192, align: 64, elements: !421)
!421 = !{!422, !423, !424, !425}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !420, file: !372, line: 281, baseType: !377, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !420, file: !372, line: 282, baseType: !382, size: 32, align: 32, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_pixel", scope: !420, file: !372, line: 283, baseType: !382, size: 32, align: 32, offset: 96)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "scanline_pad", scope: !420, file: !372, line: 284, baseType: !382, size: 32, align: 32, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "private8", scope: !374, file: !372, line: 518, baseType: !382, size: 32, align: 32, offset: 896)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !374, file: !372, line: 519, baseType: !382, size: 32, align: 32, offset: 928)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "private9", scope: !374, file: !372, line: 520, baseType: !394, size: 64, align: 64, offset: 960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "private10", scope: !374, file: !372, line: 520, baseType: !394, size: 64, align: 64, offset: 1024)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "qlen", scope: !374, file: !372, line: 521, baseType: !382, size: 32, align: 32, offset: 1088)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "last_request_read", scope: !374, file: !372, line: 522, baseType: !363, size: 64, align: 64, offset: 1152)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !374, file: !372, line: 523, baseType: !363, size: 64, align: 64, offset: 1216)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "private11", scope: !374, file: !372, line: 524, baseType: !390, size: 64, align: 64, offset: 1280)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "private12", scope: !374, file: !372, line: 525, baseType: !390, size: 64, align: 64, offset: 1344)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "private13", scope: !374, file: !372, line: 526, baseType: !390, size: 64, align: 64, offset: 1408)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "private14", scope: !374, file: !372, line: 527, baseType: !390, size: 64, align: 64, offset: 1472)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "max_request_size", scope: !374, file: !372, line: 528, baseType: !370, size: 32, align: 32, offset: 1536)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !374, file: !372, line: 529, baseType: !439, size: 64, align: 64, offset: 1600)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XrmHashBucketRec", file: !372, line: 491, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "private15", scope: !374, file: !372, line: 530, baseType: !442, size: 64, align: 64, offset: 1664)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!382, !410}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "display_name", scope: !374, file: !372, line: 533, baseType: !391, size: 64, align: 64, offset: 1728)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "default_screen", scope: !374, file: !372, line: 534, baseType: !382, size: 32, align: 32, offset: 1792)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "nscreens", scope: !374, file: !372, line: 535, baseType: !382, size: 32, align: 32, offset: 1824)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "screens", scope: !374, file: !372, line: 536, baseType: !449, size: 64, align: 64, offset: 1856)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "Screen", file: !372, line: 275, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 257, size: 1024, align: 64, elements: !452)
!452 = !{!453, !454, !455, !457, !458, !459, !460, !461, !462, !483, !484, !485, !489, !491, !492, !493, !494, !495, !496, !497}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !451, file: !372, line: 258, baseType: !377, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !451, file: !372, line: 259, baseType: !410, size: 64, align: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !451, file: !372, line: 260, baseType: !456, size: 64, align: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "Window", file: !362, line: 96, baseType: !402)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !451, file: !372, line: 261, baseType: !382, size: 32, align: 32, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !451, file: !372, line: 261, baseType: !382, size: 32, align: 32, offset: 224)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "mwidth", scope: !451, file: !372, line: 262, baseType: !382, size: 32, align: 32, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "mheight", scope: !451, file: !372, line: 262, baseType: !382, size: 32, align: 32, offset: 288)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ndepths", scope: !451, file: !372, line: 263, baseType: !382, size: 32, align: 32, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "depths", scope: !451, file: !372, line: 264, baseType: !463, size: 64, align: 64, offset: 384)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "Depth", file: !372, line: 247, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 243, size: 128, align: 64, elements: !466)
!466 = !{!467, !468, !469}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !465, file: !372, line: 244, baseType: !382, size: 32, align: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "nvisuals", scope: !465, file: !372, line: 245, baseType: !382, size: 32, align: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "visuals", scope: !465, file: !372, line: 246, baseType: !470, size: 64, align: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "Visual", file: !372, line: 238, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 227, size: 448, align: 64, elements: !473)
!473 = !{!474, !475, !477, !478, !479, !480, !481, !482}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !472, file: !372, line: 228, baseType: !377, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "visualid", scope: !472, file: !372, line: 229, baseType: !476, size: 64, align: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "VisualID", file: !362, line: 76, baseType: !363)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !472, file: !372, line: 233, baseType: !382, size: 32, align: 32, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !472, file: !372, line: 235, baseType: !363, size: 64, align: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !472, file: !372, line: 235, baseType: !363, size: 64, align: 64, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !472, file: !372, line: 235, baseType: !363, size: 64, align: 64, offset: 320)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !472, file: !372, line: 236, baseType: !382, size: 32, align: 32, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "map_entries", scope: !472, file: !372, line: 237, baseType: !382, size: 32, align: 32, offset: 416)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "root_depth", scope: !451, file: !372, line: 265, baseType: !382, size: 32, align: 32, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "root_visual", scope: !451, file: !372, line: 266, baseType: !470, size: 64, align: 64, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "default_gc", scope: !451, file: !372, line: 267, baseType: !486, size: 64, align: 64, offset: 576)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "GC", file: !372, line: 222, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XGC", file: !372, line: 214, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !451, file: !372, line: 268, baseType: !490, size: 64, align: 64, offset: 640)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colormap", file: !362, line: 104, baseType: !402)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "white_pixel", scope: !451, file: !372, line: 269, baseType: !363, size: 64, align: 64, offset: 704)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "black_pixel", scope: !451, file: !372, line: 270, baseType: !363, size: 64, align: 64, offset: 768)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "max_maps", scope: !451, file: !372, line: 271, baseType: !382, size: 32, align: 32, offset: 832)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "min_maps", scope: !451, file: !372, line: 271, baseType: !382, size: 32, align: 32, offset: 864)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "backing_store", scope: !451, file: !372, line: 272, baseType: !382, size: 32, align: 32, offset: 896)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "save_unders", scope: !451, file: !372, line: 273, baseType: !382, size: 32, align: 32, offset: 928)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "root_input_mask", scope: !451, file: !372, line: 274, baseType: !498, size: 64, align: 64, offset: 960)
!498 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "motion_buffer", scope: !374, file: !372, line: 537, baseType: !363, size: 64, align: 64, offset: 1920)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "private16", scope: !374, file: !372, line: 538, baseType: !363, size: 64, align: 64, offset: 1984)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "min_keycode", scope: !374, file: !372, line: 539, baseType: !382, size: 32, align: 32, offset: 2048)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "max_keycode", scope: !374, file: !372, line: 540, baseType: !382, size: 32, align: 32, offset: 2080)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "private17", scope: !374, file: !372, line: 541, baseType: !390, size: 64, align: 64, offset: 2112)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "private18", scope: !374, file: !372, line: 542, baseType: !390, size: 64, align: 64, offset: 2176)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "private19", scope: !374, file: !372, line: 543, baseType: !382, size: 32, align: 32, offset: 2240)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "xdefaults", scope: !374, file: !372, line: 544, baseType: !391, size: 64, align: 64, offset: 2304)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "libiconv_t", file: !508, line: 46, baseType: !509)
!508 = !DIFile(filename: "/usr/local/include/iconv.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !511, line: 216, baseType: !363)
!511 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !366, line: 41, baseType: !516)
!516 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!517 = !{!518, !520, !521, !522, !523, !524, !525, !526, !528, !529, !530, !531, !532, !534, !535, !536, !537, !538, !539, !540, !556, !557, !558, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572}
!518 = distinct !DIGlobalVariable(name: "clipboard_atom", scope: !0, file: !519, line: 60, type: !361, isLocal: true, isDefinition: true, variable: i64* @clipboard_atom)
!519 = !DIFile(filename: "xclip.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!520 = distinct !DIGlobalVariable(name: "primary_atom", scope: !0, file: !519, line: 60, type: !361, isLocal: true, isDefinition: true, variable: i64* @primary_atom)
!521 = distinct !DIGlobalVariable(name: "targets_atom", scope: !0, file: !519, line: 62, type: !361, isLocal: true, isDefinition: true, variable: i64* @targets_atom)
!522 = distinct !DIGlobalVariable(name: "timestamp_atom", scope: !0, file: !519, line: 64, type: !361, isLocal: true, isDefinition: true, variable: i64* @timestamp_atom)
!523 = distinct !DIGlobalVariable(name: "rdesktop_clipboard_target_atom", scope: !0, file: !519, line: 68, type: !361, isLocal: true, isDefinition: true, variable: i64* @rdesktop_clipboard_target_atom)
!524 = distinct !DIGlobalVariable(name: "rdesktop_primary_timestamp_target_atom", scope: !0, file: !519, line: 72, type: !361, isLocal: true, isDefinition: true, variable: i64* @rdesktop_primary_timestamp_target_atom)
!525 = distinct !DIGlobalVariable(name: "rdesktop_clipboard_timestamp_target_atom", scope: !0, file: !519, line: 72, type: !361, isLocal: true, isDefinition: true, variable: i64* @rdesktop_clipboard_timestamp_target_atom)
!526 = distinct !DIGlobalVariable(name: "primary_timestamp", scope: !0, file: !519, line: 74, type: !527, isLocal: true, isDefinition: true, variable: i64* @primary_timestamp)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time", file: !362, line: 77, baseType: !363)
!528 = distinct !DIGlobalVariable(name: "clipboard_timestamp", scope: !0, file: !519, line: 74, type: !527, isLocal: true, isDefinition: true, variable: i64* @clipboard_timestamp)
!529 = distinct !DIGlobalVariable(name: "rdesktop_clipboard_formats_atom", scope: !0, file: !519, line: 77, type: !361, isLocal: true, isDefinition: true, variable: i64* @rdesktop_clipboard_formats_atom)
!530 = distinct !DIGlobalVariable(name: "rdesktop_native_atom", scope: !0, file: !519, line: 81, type: !361, isLocal: true, isDefinition: true, variable: i64* @rdesktop_native_atom)
!531 = distinct !DIGlobalVariable(name: "rdesktop_selection_notify_atom", scope: !0, file: !519, line: 88, type: !361, isLocal: true, isDefinition: true, variable: i64* @rdesktop_selection_notify_atom)
!532 = distinct !DIGlobalVariable(name: "probing_selections", scope: !0, file: !519, line: 92, type: !533, isLocal: true, isDefinition: true, variable: i32* @probing_selections)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !366, line: 28, baseType: !382)
!534 = distinct !DIGlobalVariable(name: "rdesktop_primary_owner_atom", scope: !0, file: !519, line: 95, type: !361, isLocal: true, isDefinition: true, variable: i64* @rdesktop_primary_owner_atom)
!535 = distinct !DIGlobalVariable(name: "rdesktop_clipboard_owner_atom", scope: !0, file: !519, line: 95, type: !361, isLocal: true, isDefinition: true, variable: i64* @rdesktop_clipboard_owner_atom)
!536 = distinct !DIGlobalVariable(name: "format_string_atom", scope: !0, file: !519, line: 96, type: !361, isLocal: true, isDefinition: true, variable: i64* @format_string_atom)
!537 = distinct !DIGlobalVariable(name: "format_utf8_string_atom", scope: !0, file: !519, line: 96, type: !361, isLocal: true, isDefinition: true, variable: i64* @format_utf8_string_atom)
!538 = distinct !DIGlobalVariable(name: "format_unicode_atom", scope: !0, file: !519, line: 96, type: !361, isLocal: true, isDefinition: true, variable: i64* @format_unicode_atom)
!539 = distinct !DIGlobalVariable(name: "incr_atom", scope: !0, file: !519, line: 98, type: !361, isLocal: true, isDefinition: true, variable: i64* @incr_atom)
!540 = distinct !DIGlobalVariable(name: "selection_request", scope: !0, file: !519, line: 103, type: !541, isLocal: true, isDefinition: true, variable: %struct.XSelectionRequestEvent* @selection_request)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSelectionRequestEvent", file: !372, line: 868, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 857, size: 640, align: 64, elements: !543)
!543 = !{!544, !545, !546, !547, !550, !551, !552, !553, !554, !555}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !542, file: !372, line: 858, baseType: !382, size: 32, align: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !542, file: !372, line: 859, baseType: !363, size: 64, align: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !542, file: !372, line: 860, baseType: !382, size: 32, align: 32, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !542, file: !372, line: 861, baseType: !548, size: 64, align: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "Display", file: !372, line: 487, baseType: !411)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !542, file: !372, line: 862, baseType: !456, size: 64, align: 64, offset: 256)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "requestor", scope: !542, file: !372, line: 863, baseType: !456, size: 64, align: 64, offset: 320)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !542, file: !372, line: 864, baseType: !361, size: 64, align: 64, offset: 384)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !542, file: !372, line: 865, baseType: !361, size: 64, align: 64, offset: 448)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "property", scope: !542, file: !372, line: 866, baseType: !361, size: 64, align: 64, offset: 512)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !542, file: !372, line: 867, baseType: !527, size: 64, align: 64, offset: 576)
!556 = distinct !DIGlobalVariable(name: "has_selection_request", scope: !0, file: !519, line: 105, type: !533, isLocal: true, isDefinition: true, variable: i32* @has_selection_request)
!557 = distinct !DIGlobalVariable(name: "rdp_clipboard_request_format", scope: !0, file: !519, line: 111, type: !382, isLocal: true, isDefinition: true, variable: i32* @rdp_clipboard_request_format)
!558 = distinct !DIGlobalVariable(name: "targets", scope: !0, file: !519, line: 113, type: !559, isLocal: true, isDefinition: true, variable: [8 x i64]* @targets)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 512, align: 64, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 8)
!562 = distinct !DIGlobalVariable(name: "num_targets", scope: !0, file: !519, line: 114, type: !382, isLocal: true, isDefinition: true, variable: i32* @num_targets)
!563 = distinct !DIGlobalVariable(name: "rdesktop_is_selection_owner", scope: !0, file: !519, line: 117, type: !533, isLocal: true, isDefinition: true, variable: i32* @rdesktop_is_selection_owner)
!564 = distinct !DIGlobalVariable(name: "acquire_time", scope: !0, file: !519, line: 119, type: !527, isLocal: true, isDefinition: true, variable: i64* @acquire_time)
!565 = distinct !DIGlobalVariable(name: "formats_data", scope: !0, file: !519, line: 83, type: !364, isLocal: true, isDefinition: true, variable: i8** @formats_data)
!566 = distinct !DIGlobalVariable(name: "formats_data_length", scope: !0, file: !519, line: 84, type: !369, isLocal: true, isDefinition: true, variable: i32* @formats_data_length)
!567 = distinct !DIGlobalVariable(name: "reprobe_selections", scope: !0, file: !519, line: 92, type: !533, isLocal: true, isDefinition: true, variable: i32* @reprobe_selections)
!568 = distinct !DIGlobalVariable(name: "g_waiting_for_INCR", scope: !0, file: !519, line: 122, type: !382, isLocal: true, isDefinition: true, variable: i32* @g_waiting_for_INCR)
!569 = distinct !DIGlobalVariable(name: "g_clip_buflen", scope: !0, file: !519, line: 128, type: !369, isLocal: true, isDefinition: true, variable: i32* @g_clip_buflen)
!570 = distinct !DIGlobalVariable(name: "g_clip_buffer", scope: !0, file: !519, line: 126, type: !364, isLocal: true, isDefinition: true, variable: i8** @g_clip_buffer)
!571 = distinct !DIGlobalVariable(name: "g_incr_target", scope: !0, file: !519, line: 124, type: !361, isLocal: true, isDefinition: true, variable: i64* @g_incr_target)
!572 = distinct !DIGlobalVariable(name: "auto_mode", scope: !0, file: !519, line: 58, type: !533, isLocal: true, isDefinition: true, variable: i32* @auto_mode)
!573 = !{i32 2, !"Dwarf Version", i32 4}
!574 = !{i32 2, !"Debug Info Version", i32 3}
!575 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!576 = distinct !DISubprogram(name: "xclip_handle_SelectionNotify", scope: !519, file: !519, line: 507, type: !577, isLocal: false, isDefinition: true, scopeLine: 508, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !592)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !579}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSelectionEvent", file: !372, line: 880, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 870, size: 576, align: 64, elements: !582)
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590, !591}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !581, file: !372, line: 871, baseType: !382, size: 32, align: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !581, file: !372, line: 872, baseType: !363, size: 64, align: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !581, file: !372, line: 873, baseType: !382, size: 32, align: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !581, file: !372, line: 874, baseType: !548, size: 64, align: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "requestor", scope: !581, file: !372, line: 875, baseType: !456, size: 64, align: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !581, file: !372, line: 876, baseType: !361, size: 64, align: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !581, file: !372, line: 877, baseType: !361, size: 64, align: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "property", scope: !581, file: !372, line: 878, baseType: !361, size: 64, align: 64, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !581, file: !372, line: 879, baseType: !527, size: 64, align: 64, offset: 512)
!592 = !{}
!593 = !DILocalVariable(name: "event", arg: 1, scope: !576, file: !519, line: 507, type: !579)
!594 = !DIExpression()
!595 = !DILocation(line: 507, column: 48, scope: !576)
!596 = !DILocalVariable(name: "i", scope: !576, file: !519, line: 509, type: !363)
!597 = !DILocation(line: 509, column: 16, scope: !576)
!598 = !DILocalVariable(name: "nitems", scope: !576, file: !519, line: 509, type: !363)
!599 = !DILocation(line: 509, column: 19, scope: !576)
!600 = !DILocalVariable(name: "bytes_left", scope: !576, file: !519, line: 509, type: !363)
!601 = !DILocation(line: 509, column: 27, scope: !576)
!602 = !DILocalVariable(name: "wa", scope: !576, file: !519, line: 510, type: !603)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "XWindowAttributes", file: !372, line: 334, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 308, size: 1088, align: 64, elements: !605)
!605 = !{!606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !604, file: !372, line: 309, baseType: !382, size: 32, align: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !604, file: !372, line: 309, baseType: !382, size: 32, align: 32, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !604, file: !372, line: 310, baseType: !382, size: 32, align: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !604, file: !372, line: 310, baseType: !382, size: 32, align: 32, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !604, file: !372, line: 311, baseType: !382, size: 32, align: 32, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !604, file: !372, line: 312, baseType: !382, size: 32, align: 32, offset: 160)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "visual", scope: !604, file: !372, line: 313, baseType: !470, size: 64, align: 64, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !604, file: !372, line: 314, baseType: !456, size: 64, align: 64, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !604, file: !372, line: 318, baseType: !382, size: 32, align: 32, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "bit_gravity", scope: !604, file: !372, line: 320, baseType: !382, size: 32, align: 32, offset: 352)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "win_gravity", scope: !604, file: !372, line: 321, baseType: !382, size: 32, align: 32, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "backing_store", scope: !604, file: !372, line: 322, baseType: !382, size: 32, align: 32, offset: 416)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "backing_planes", scope: !604, file: !372, line: 323, baseType: !363, size: 64, align: 64, offset: 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "backing_pixel", scope: !604, file: !372, line: 324, baseType: !363, size: 64, align: 64, offset: 512)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "save_under", scope: !604, file: !372, line: 325, baseType: !382, size: 32, align: 32, offset: 576)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !604, file: !372, line: 326, baseType: !490, size: 64, align: 64, offset: 640)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "map_installed", scope: !604, file: !372, line: 327, baseType: !382, size: 32, align: 32, offset: 704)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "map_state", scope: !604, file: !372, line: 328, baseType: !382, size: 32, align: 32, offset: 736)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "all_event_masks", scope: !604, file: !372, line: 329, baseType: !498, size: 64, align: 64, offset: 768)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "your_event_mask", scope: !604, file: !372, line: 330, baseType: !498, size: 64, align: 64, offset: 832)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "do_not_propagate_mask", scope: !604, file: !372, line: 331, baseType: !498, size: 64, align: 64, offset: 896)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !604, file: !372, line: 332, baseType: !382, size: 32, align: 32, offset: 960)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !604, file: !372, line: 333, baseType: !449, size: 64, align: 64, offset: 1024)
!629 = !DILocation(line: 510, column: 20, scope: !576)
!630 = !DILocalVariable(name: "type", scope: !576, file: !519, line: 511, type: !361)
!631 = !DILocation(line: 511, column: 7, scope: !576)
!632 = !DILocalVariable(name: "supported_targets", scope: !576, file: !519, line: 512, type: !633)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!634 = !DILocation(line: 512, column: 8, scope: !576)
!635 = !DILocalVariable(name: "res", scope: !576, file: !519, line: 513, type: !382)
!636 = !DILocation(line: 513, column: 6, scope: !576)
!637 = !DILocalVariable(name: "format", scope: !576, file: !519, line: 513, type: !382)
!638 = !DILocation(line: 513, column: 11, scope: !576)
!639 = !DILocalVariable(name: "data", scope: !576, file: !519, line: 514, type: !364)
!640 = !DILocation(line: 514, column: 9, scope: !576)
!641 = !DILocation(line: 516, column: 6, scope: !642)
!642 = distinct !DILexicalBlock(scope: !576, file: !519, line: 516, column: 6)
!643 = !DILocation(line: 516, column: 13, scope: !642)
!644 = !DILocation(line: 516, column: 22, scope: !642)
!645 = !DILocation(line: 516, column: 6, scope: !576)
!646 = !DILocation(line: 517, column: 1, scope: !642)
!647 = !DILocation(line: 518, column: 3, scope: !576)
!648 = !DILocation(line: 747, column: 6, scope: !649)
!649 = distinct !DILexicalBlock(scope: !576, file: !519, line: 747, column: 6)
!650 = !DILocation(line: 747, column: 6, scope: !576)
!651 = !DILocation(line: 748, column: 9, scope: !649)
!652 = !DILocation(line: 748, column: 3, scope: !649)
!653 = !DILocation(line: 750, column: 2, scope: !576)
!654 = !DILocation(line: 753, column: 2, scope: !576)
!655 = !DILocation(line: 754, column: 6, scope: !656)
!656 = distinct !DILexicalBlock(scope: !576, file: !519, line: 754, column: 6)
!657 = !DILocation(line: 754, column: 6, scope: !576)
!658 = !DILocation(line: 756, column: 3, scope: !659)
!659 = distinct !DILexicalBlock(scope: !656, file: !519, line: 755, column: 2)
!660 = !DILocation(line: 758, column: 22, scope: !659)
!661 = !DILocation(line: 758, column: 31, scope: !659)
!662 = !DILocation(line: 764, column: 3, scope: !659)
!663 = !DILocation(line: 765, column: 2, scope: !659)
!664 = !DILocation(line: 768, column: 3, scope: !665)
!665 = distinct !DILexicalBlock(scope: !656, file: !519, line: 767, column: 2)
!666 = !DILocation(line: 770, column: 2, scope: !576)
!667 = distinct !DISubprogram(name: "xclip_handle_SelectionRequest", scope: !519, file: !519, line: 778, type: !668, isLocal: false, isDefinition: true, scopeLine: 779, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !592)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!671 = !DILocalVariable(name: "event", arg: 1, scope: !667, file: !519, line: 778, type: !670)
!672 = !DILocation(line: 778, column: 56, scope: !667)
!673 = !DILocalVariable(name: "nitems", scope: !667, file: !519, line: 780, type: !363)
!674 = !DILocation(line: 780, column: 16, scope: !667)
!675 = !DILocalVariable(name: "bytes_left", scope: !667, file: !519, line: 780, type: !363)
!676 = !DILocation(line: 780, column: 24, scope: !667)
!677 = !DILocalVariable(name: "prop_return", scope: !667, file: !519, line: 781, type: !513)
!678 = !DILocation(line: 781, column: 17, scope: !667)
!679 = !DILocalVariable(name: "format", scope: !667, file: !519, line: 782, type: !382)
!680 = !DILocation(line: 782, column: 6, scope: !667)
!681 = !DILocalVariable(name: "res", scope: !667, file: !519, line: 782, type: !382)
!682 = !DILocation(line: 782, column: 14, scope: !667)
!683 = !DILocalVariable(name: "type", scope: !667, file: !519, line: 783, type: !361)
!684 = !DILocation(line: 783, column: 7, scope: !667)
!685 = !DILocation(line: 787, column: 22, scope: !667)
!686 = !DILocation(line: 787, column: 33, scope: !667)
!687 = !DILocation(line: 787, column: 40, scope: !667)
!688 = !DILocation(line: 787, column: 9, scope: !667)
!689 = !DILocation(line: 787, column: 65, scope: !667)
!690 = !DILocation(line: 787, column: 76, scope: !667)
!691 = !DILocation(line: 787, column: 83, scope: !667)
!692 = !DILocation(line: 787, column: 52, scope: !693)
!693 = !DILexicalBlockFile(scope: !667, file: !519, discriminator: 1)
!694 = !DILocation(line: 788, column: 22, scope: !667)
!695 = !DILocation(line: 788, column: 33, scope: !667)
!696 = !DILocation(line: 788, column: 40, scope: !667)
!697 = !DILocation(line: 788, column: 9, scope: !667)
!698 = !DILocation(line: 785, column: 2, scope: !667)
!699 = !DILocation(line: 790, column: 6, scope: !700)
!700 = distinct !DILexicalBlock(scope: !667, file: !519, line: 790, column: 6)
!701 = !DILocation(line: 790, column: 13, scope: !700)
!702 = !DILocation(line: 790, column: 23, scope: !700)
!703 = !DILocation(line: 790, column: 20, scope: !700)
!704 = !DILocation(line: 790, column: 6, scope: !667)
!705 = !DILocation(line: 792, column: 27, scope: !706)
!706 = distinct !DILexicalBlock(scope: !700, file: !519, line: 791, column: 2)
!707 = !DILocation(line: 792, column: 67, scope: !706)
!708 = !DILocation(line: 792, column: 3, scope: !706)
!709 = !DILocation(line: 793, column: 3, scope: !706)
!710 = !DILocation(line: 795, column: 11, scope: !711)
!711 = distinct !DILexicalBlock(scope: !700, file: !519, line: 795, column: 11)
!712 = !DILocation(line: 795, column: 18, scope: !711)
!713 = !DILocation(line: 795, column: 28, scope: !711)
!714 = !DILocation(line: 795, column: 25, scope: !711)
!715 = !DILocation(line: 795, column: 11, scope: !700)
!716 = !DILocation(line: 797, column: 27, scope: !717)
!717 = distinct !DILexicalBlock(scope: !711, file: !519, line: 796, column: 2)
!718 = !DILocation(line: 797, column: 3, scope: !717)
!719 = !DILocation(line: 798, column: 3, scope: !717)
!720 = !DILocation(line: 800, column: 11, scope: !721)
!721 = distinct !DILexicalBlock(scope: !711, file: !519, line: 800, column: 11)
!722 = !DILocation(line: 800, column: 18, scope: !721)
!723 = !DILocation(line: 800, column: 28, scope: !721)
!724 = !DILocation(line: 800, column: 25, scope: !721)
!725 = !DILocation(line: 800, column: 11, scope: !711)
!726 = !DILocation(line: 802, column: 27, scope: !727)
!727 = distinct !DILexicalBlock(scope: !721, file: !519, line: 801, column: 2)
!728 = !DILocation(line: 802, column: 47, scope: !727)
!729 = !DILocation(line: 802, column: 61, scope: !727)
!730 = !DILocation(line: 802, column: 3, scope: !727)
!731 = !DILocation(line: 803, column: 2, scope: !727)
!732 = !DILocation(line: 809, column: 7, scope: !733)
!733 = distinct !DILexicalBlock(scope: !734, file: !519, line: 809, column: 7)
!734 = distinct !DILexicalBlock(scope: !721, file: !519, line: 805, column: 2)
!735 = !DILocation(line: 809, column: 7, scope: !734)
!736 = !DILocation(line: 811, column: 4, scope: !737)
!737 = distinct !DILexicalBlock(scope: !733, file: !519, line: 810, column: 3)
!738 = !DILocation(line: 813, column: 27, scope: !737)
!739 = !DILocation(line: 813, column: 4, scope: !737)
!740 = !DILocation(line: 814, column: 4, scope: !737)
!741 = !DILocation(line: 816, column: 7, scope: !742)
!742 = distinct !DILexicalBlock(scope: !734, file: !519, line: 816, column: 7)
!743 = !DILocation(line: 816, column: 14, scope: !742)
!744 = !DILocation(line: 816, column: 24, scope: !742)
!745 = !DILocation(line: 816, column: 21, scope: !742)
!746 = !DILocation(line: 816, column: 7, scope: !734)
!747 = !DILocation(line: 820, column: 29, scope: !748)
!748 = distinct !DILexicalBlock(scope: !742, file: !519, line: 817, column: 3)
!749 = !DILocation(line: 820, column: 40, scope: !748)
!750 = !DILocation(line: 820, column: 47, scope: !748)
!751 = !DILocation(line: 821, column: 8, scope: !748)
!752 = !DILocation(line: 821, column: 15, scope: !748)
!753 = !DILocation(line: 820, column: 10, scope: !748)
!754 = !DILocation(line: 820, column: 8, scope: !748)
!755 = !DILocation(line: 824, column: 8, scope: !756)
!756 = distinct !DILexicalBlock(scope: !748, file: !519, line: 824, column: 8)
!757 = !DILocation(line: 824, column: 12, scope: !756)
!758 = !DILocation(line: 824, column: 22, scope: !756)
!759 = !DILocation(line: 824, column: 27, scope: !760)
!760 = !DILexicalBlockFile(scope: !756, file: !519, discriminator: 1)
!761 = !DILocation(line: 824, column: 8, scope: !760)
!762 = !DILocation(line: 826, column: 5, scope: !763)
!763 = distinct !DILexicalBlock(scope: !756, file: !519, line: 825, column: 4)
!764 = !DILocation(line: 828, column: 28, scope: !763)
!765 = !DILocation(line: 828, column: 5, scope: !763)
!766 = !DILocation(line: 829, column: 5, scope: !763)
!767 = !DILocation(line: 832, column: 25, scope: !748)
!768 = !DILocation(line: 832, column: 13, scope: !748)
!769 = !DILocation(line: 832, column: 11, scope: !748)
!770 = !DILocation(line: 833, column: 10, scope: !748)
!771 = !DILocation(line: 833, column: 4, scope: !748)
!772 = !DILocation(line: 834, column: 3, scope: !748)
!773 = !DILocation(line: 835, column: 12, scope: !774)
!774 = distinct !DILexicalBlock(scope: !742, file: !519, line: 835, column: 12)
!775 = !DILocation(line: 835, column: 19, scope: !774)
!776 = !DILocation(line: 835, column: 29, scope: !774)
!777 = !DILocation(line: 835, column: 26, scope: !774)
!778 = !DILocation(line: 835, column: 48, scope: !774)
!779 = !DILocation(line: 835, column: 51, scope: !780)
!780 = !DILexicalBlockFile(scope: !774, file: !519, discriminator: 1)
!781 = !DILocation(line: 835, column: 58, scope: !780)
!782 = !DILocation(line: 835, column: 65, scope: !780)
!783 = !DILocation(line: 835, column: 12, scope: !780)
!784 = !DILocation(line: 838, column: 11, scope: !785)
!785 = distinct !DILexicalBlock(scope: !774, file: !519, line: 836, column: 3)
!786 = !DILocation(line: 839, column: 3, scope: !785)
!787 = !DILocation(line: 840, column: 12, scope: !788)
!788 = distinct !DILexicalBlock(scope: !774, file: !519, line: 840, column: 12)
!789 = !DILocation(line: 840, column: 19, scope: !788)
!790 = !DILocation(line: 840, column: 29, scope: !788)
!791 = !DILocation(line: 840, column: 26, scope: !788)
!792 = !DILocation(line: 840, column: 12, scope: !774)
!793 = !DILocation(line: 843, column: 11, scope: !794)
!794 = distinct !DILexicalBlock(scope: !788, file: !519, line: 841, column: 3)
!795 = !DILocation(line: 850, column: 3, scope: !794)
!796 = !DILocation(line: 851, column: 12, scope: !797)
!797 = distinct !DILexicalBlock(scope: !788, file: !519, line: 851, column: 12)
!798 = !DILocation(line: 851, column: 19, scope: !797)
!799 = !DILocation(line: 851, column: 29, scope: !797)
!800 = !DILocation(line: 851, column: 26, scope: !797)
!801 = !DILocation(line: 851, column: 12, scope: !788)
!802 = !DILocation(line: 854, column: 11, scope: !803)
!803 = distinct !DILexicalBlock(scope: !797, file: !519, line: 852, column: 3)
!804 = !DILocation(line: 855, column: 3, scope: !803)
!805 = !DILocation(line: 860, column: 24, scope: !806)
!806 = distinct !DILexicalBlock(scope: !797, file: !519, line: 857, column: 3)
!807 = !DILocation(line: 860, column: 35, scope: !806)
!808 = !DILocation(line: 860, column: 42, scope: !806)
!809 = !DILocation(line: 860, column: 11, scope: !806)
!810 = !DILocation(line: 858, column: 4, scope: !806)
!811 = !DILocation(line: 861, column: 27, scope: !806)
!812 = !DILocation(line: 861, column: 4, scope: !806)
!813 = !DILocation(line: 862, column: 4, scope: !806)
!814 = !DILocation(line: 865, column: 29, scope: !734)
!815 = !DILocation(line: 865, column: 3, scope: !734)
!816 = !DILocation(line: 866, column: 24, scope: !734)
!817 = !DILocation(line: 866, column: 23, scope: !734)
!818 = !DILocation(line: 867, column: 25, scope: !734)
!819 = !DILocation(line: 868, column: 3, scope: !734)
!820 = !DILocation(line: 870, column: 1, scope: !667)
!821 = distinct !DISubprogram(name: "xclip_provide_selection", scope: !519, file: !519, line: 218, type: !822, isLocal: true, isDefinition: true, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !592)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !670, !361, !370, !364, !369}
!824 = !DILocalVariable(name: "req", arg: 1, scope: !821, file: !519, line: 218, type: !670)
!825 = !DILocation(line: 218, column: 50, scope: !821)
!826 = !DILocalVariable(name: "type", arg: 2, scope: !821, file: !519, line: 218, type: !361)
!827 = !DILocation(line: 218, column: 60, scope: !821)
!828 = !DILocalVariable(name: "format", arg: 3, scope: !821, file: !519, line: 218, type: !370)
!829 = !DILocation(line: 218, column: 79, scope: !821)
!830 = !DILocalVariable(name: "data", arg: 4, scope: !821, file: !519, line: 218, type: !364)
!831 = !DILocation(line: 218, column: 95, scope: !821)
!832 = !DILocalVariable(name: "length", arg: 5, scope: !821, file: !519, line: 219, type: !369)
!833 = !DILocation(line: 219, column: 11, scope: !821)
!834 = !DILocalVariable(name: "xev", scope: !821, file: !519, line: 221, type: !835)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "XEvent", file: !372, line: 1009, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_XEvent", file: !372, line: 973, size: 1536, align: 64, elements: !837)
!837 = !{!838, !839, !848, !867, !886, !905, !926, !937, !951, !968, !979, !989, !1005, !1015, !1026, !1037, !1047, !1061, !1078, !1090, !1101, !1119, !1130, !1141, !1153, !1164, !1165, !1166, !1178, !1205, !1217, !1228, !1241, !1251, !1263}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !836, file: !372, line: 974, baseType: !382, size: 32, align: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "xany", scope: !836, file: !372, line: 975, baseType: !840, size: 320, align: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "XAnyEvent", file: !372, line: 940, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 934, size: 320, align: 64, elements: !842)
!842 = !{!843, !844, !845, !846, !847}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !841, file: !372, line: 935, baseType: !382, size: 32, align: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !841, file: !372, line: 936, baseType: !363, size: 64, align: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !841, file: !372, line: 937, baseType: !382, size: 32, align: 32, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !841, file: !372, line: 938, baseType: !548, size: 64, align: 64, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !841, file: !372, line: 939, baseType: !456, size: 64, align: 64, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "xkey", scope: !836, file: !372, line: 976, baseType: !849, size: 768, align: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "XKeyEvent", file: !372, line: 571, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 557, size: 768, align: 64, elements: !851)
!851 = !{!852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !850, file: !372, line: 558, baseType: !382, size: 32, align: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !850, file: !372, line: 559, baseType: !363, size: 64, align: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !850, file: !372, line: 560, baseType: !382, size: 32, align: 32, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !850, file: !372, line: 561, baseType: !548, size: 64, align: 64, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !850, file: !372, line: 562, baseType: !456, size: 64, align: 64, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !850, file: !372, line: 563, baseType: !456, size: 64, align: 64, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !850, file: !372, line: 564, baseType: !456, size: 64, align: 64, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !850, file: !372, line: 565, baseType: !527, size: 64, align: 64, offset: 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !850, file: !372, line: 566, baseType: !382, size: 32, align: 32, offset: 512)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !850, file: !372, line: 566, baseType: !382, size: 32, align: 32, offset: 544)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !850, file: !372, line: 567, baseType: !382, size: 32, align: 32, offset: 576)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !850, file: !372, line: 567, baseType: !382, size: 32, align: 32, offset: 608)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !850, file: !372, line: 568, baseType: !370, size: 32, align: 32, offset: 640)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !850, file: !372, line: 569, baseType: !370, size: 32, align: 32, offset: 672)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !850, file: !372, line: 570, baseType: !382, size: 32, align: 32, offset: 704)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "xbutton", scope: !836, file: !372, line: 977, baseType: !868, size: 768, align: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "XButtonEvent", file: !372, line: 589, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 575, size: 768, align: 64, elements: !870)
!870 = !{!871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !869, file: !372, line: 576, baseType: !382, size: 32, align: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !869, file: !372, line: 577, baseType: !363, size: 64, align: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !869, file: !372, line: 578, baseType: !382, size: 32, align: 32, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !869, file: !372, line: 579, baseType: !548, size: 64, align: 64, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !869, file: !372, line: 580, baseType: !456, size: 64, align: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !869, file: !372, line: 581, baseType: !456, size: 64, align: 64, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !869, file: !372, line: 582, baseType: !456, size: 64, align: 64, offset: 384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !869, file: !372, line: 583, baseType: !527, size: 64, align: 64, offset: 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !869, file: !372, line: 584, baseType: !382, size: 32, align: 32, offset: 512)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !869, file: !372, line: 584, baseType: !382, size: 32, align: 32, offset: 544)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !869, file: !372, line: 585, baseType: !382, size: 32, align: 32, offset: 576)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !869, file: !372, line: 585, baseType: !382, size: 32, align: 32, offset: 608)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !869, file: !372, line: 586, baseType: !370, size: 32, align: 32, offset: 640)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !869, file: !372, line: 587, baseType: !370, size: 32, align: 32, offset: 672)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !869, file: !372, line: 588, baseType: !382, size: 32, align: 32, offset: 704)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "xmotion", scope: !836, file: !372, line: 978, baseType: !887, size: 768, align: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMotionEvent", file: !372, line: 607, baseType: !888)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 593, size: 768, align: 64, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !888, file: !372, line: 594, baseType: !382, size: 32, align: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !888, file: !372, line: 595, baseType: !363, size: 64, align: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !888, file: !372, line: 596, baseType: !382, size: 32, align: 32, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !888, file: !372, line: 597, baseType: !548, size: 64, align: 64, offset: 192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !888, file: !372, line: 598, baseType: !456, size: 64, align: 64, offset: 256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !888, file: !372, line: 599, baseType: !456, size: 64, align: 64, offset: 320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !888, file: !372, line: 600, baseType: !456, size: 64, align: 64, offset: 384)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !888, file: !372, line: 601, baseType: !527, size: 64, align: 64, offset: 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !888, file: !372, line: 602, baseType: !382, size: 32, align: 32, offset: 512)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !888, file: !372, line: 602, baseType: !382, size: 32, align: 32, offset: 544)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !888, file: !372, line: 603, baseType: !382, size: 32, align: 32, offset: 576)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !888, file: !372, line: 603, baseType: !382, size: 32, align: 32, offset: 608)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !888, file: !372, line: 604, baseType: !370, size: 32, align: 32, offset: 640)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "is_hint", scope: !888, file: !372, line: 605, baseType: !392, size: 8, align: 8, offset: 672)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !888, file: !372, line: 606, baseType: !382, size: 32, align: 32, offset: 704)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "xcrossing", scope: !836, file: !372, line: 979, baseType: !906, size: 832, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCrossingEvent", file: !372, line: 630, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 610, size: 832, align: 64, elements: !908)
!908 = !{!909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !907, file: !372, line: 611, baseType: !382, size: 32, align: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !907, file: !372, line: 612, baseType: !363, size: 64, align: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !907, file: !372, line: 613, baseType: !382, size: 32, align: 32, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !907, file: !372, line: 614, baseType: !548, size: 64, align: 64, offset: 192)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !907, file: !372, line: 615, baseType: !456, size: 64, align: 64, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !907, file: !372, line: 616, baseType: !456, size: 64, align: 64, offset: 320)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !907, file: !372, line: 617, baseType: !456, size: 64, align: 64, offset: 384)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !907, file: !372, line: 618, baseType: !527, size: 64, align: 64, offset: 448)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !907, file: !372, line: 619, baseType: !382, size: 32, align: 32, offset: 512)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !907, file: !372, line: 619, baseType: !382, size: 32, align: 32, offset: 544)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !907, file: !372, line: 620, baseType: !382, size: 32, align: 32, offset: 576)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !907, file: !372, line: 620, baseType: !382, size: 32, align: 32, offset: 608)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !907, file: !372, line: 621, baseType: !382, size: 32, align: 32, offset: 640)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !907, file: !372, line: 622, baseType: !382, size: 32, align: 32, offset: 672)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !907, file: !372, line: 627, baseType: !382, size: 32, align: 32, offset: 704)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "focus", scope: !907, file: !372, line: 628, baseType: !382, size: 32, align: 32, offset: 736)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !907, file: !372, line: 629, baseType: !370, size: 32, align: 32, offset: 768)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "xfocus", scope: !836, file: !372, line: 980, baseType: !927, size: 384, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "XFocusChangeEvent", file: !372, line: 648, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 634, size: 384, align: 64, elements: !929)
!929 = !{!930, !931, !932, !933, !934, !935, !936}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !928, file: !372, line: 635, baseType: !382, size: 32, align: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !928, file: !372, line: 636, baseType: !363, size: 64, align: 64, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !928, file: !372, line: 637, baseType: !382, size: 32, align: 32, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !928, file: !372, line: 638, baseType: !548, size: 64, align: 64, offset: 192)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !928, file: !372, line: 639, baseType: !456, size: 64, align: 64, offset: 256)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !928, file: !372, line: 640, baseType: !382, size: 32, align: 32, offset: 320)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !928, file: !372, line: 642, baseType: !382, size: 32, align: 32, offset: 352)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "xexpose", scope: !836, file: !372, line: 981, baseType: !938, size: 512, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExposeEvent", file: !372, line: 671, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 662, size: 512, align: 64, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949, !950}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !939, file: !372, line: 663, baseType: !382, size: 32, align: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !939, file: !372, line: 664, baseType: !363, size: 64, align: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !939, file: !372, line: 665, baseType: !382, size: 32, align: 32, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !939, file: !372, line: 666, baseType: !548, size: 64, align: 64, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !939, file: !372, line: 667, baseType: !456, size: 64, align: 64, offset: 256)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !939, file: !372, line: 668, baseType: !382, size: 32, align: 32, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !939, file: !372, line: 668, baseType: !382, size: 32, align: 32, offset: 352)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !939, file: !372, line: 669, baseType: !382, size: 32, align: 32, offset: 384)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !939, file: !372, line: 669, baseType: !382, size: 32, align: 32, offset: 416)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !939, file: !372, line: 670, baseType: !382, size: 32, align: 32, offset: 448)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "xgraphicsexpose", scope: !836, file: !372, line: 982, baseType: !952, size: 576, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGraphicsExposeEvent", file: !372, line: 684, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 673, size: 576, align: 64, elements: !954)
!954 = !{!955, !956, !957, !958, !959, !961, !962, !963, !964, !965, !966, !967}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !953, file: !372, line: 674, baseType: !382, size: 32, align: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !953, file: !372, line: 675, baseType: !363, size: 64, align: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !953, file: !372, line: 676, baseType: !382, size: 32, align: 32, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !953, file: !372, line: 677, baseType: !548, size: 64, align: 64, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "drawable", scope: !953, file: !372, line: 678, baseType: !960, size: 64, align: 64, offset: 256)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drawable", file: !362, line: 97, baseType: !402)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !953, file: !372, line: 679, baseType: !382, size: 32, align: 32, offset: 320)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !953, file: !372, line: 679, baseType: !382, size: 32, align: 32, offset: 352)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !953, file: !372, line: 680, baseType: !382, size: 32, align: 32, offset: 384)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !953, file: !372, line: 680, baseType: !382, size: 32, align: 32, offset: 416)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !953, file: !372, line: 681, baseType: !382, size: 32, align: 32, offset: 448)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "major_code", scope: !953, file: !372, line: 682, baseType: !382, size: 32, align: 32, offset: 480)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !953, file: !372, line: 683, baseType: !382, size: 32, align: 32, offset: 512)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "xnoexpose", scope: !836, file: !372, line: 983, baseType: !969, size: 384, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "XNoExposeEvent", file: !372, line: 694, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 686, size: 384, align: 64, elements: !971)
!971 = !{!972, !973, !974, !975, !976, !977, !978}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !970, file: !372, line: 687, baseType: !382, size: 32, align: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !970, file: !372, line: 688, baseType: !363, size: 64, align: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !970, file: !372, line: 689, baseType: !382, size: 32, align: 32, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !970, file: !372, line: 690, baseType: !548, size: 64, align: 64, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "drawable", scope: !970, file: !372, line: 691, baseType: !960, size: 64, align: 64, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "major_code", scope: !970, file: !372, line: 692, baseType: !382, size: 32, align: 32, offset: 320)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !970, file: !372, line: 693, baseType: !382, size: 32, align: 32, offset: 352)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "xvisibility", scope: !836, file: !372, line: 984, baseType: !980, size: 384, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "XVisibilityEvent", file: !372, line: 703, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 696, size: 384, align: 64, elements: !982)
!982 = !{!983, !984, !985, !986, !987, !988}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !981, file: !372, line: 697, baseType: !382, size: 32, align: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !981, file: !372, line: 698, baseType: !363, size: 64, align: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !981, file: !372, line: 699, baseType: !382, size: 32, align: 32, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !981, file: !372, line: 700, baseType: !548, size: 64, align: 64, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !981, file: !372, line: 701, baseType: !456, size: 64, align: 64, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !981, file: !372, line: 702, baseType: !382, size: 32, align: 32, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "xcreatewindow", scope: !836, file: !372, line: 985, baseType: !990, size: 576, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCreateWindowEvent", file: !372, line: 716, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 705, size: 576, align: 64, elements: !992)
!992 = !{!993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !991, file: !372, line: 706, baseType: !382, size: 32, align: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !991, file: !372, line: 707, baseType: !363, size: 64, align: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !991, file: !372, line: 708, baseType: !382, size: 32, align: 32, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !991, file: !372, line: 709, baseType: !548, size: 64, align: 64, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !991, file: !372, line: 710, baseType: !456, size: 64, align: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !991, file: !372, line: 711, baseType: !456, size: 64, align: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !991, file: !372, line: 712, baseType: !382, size: 32, align: 32, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !991, file: !372, line: 712, baseType: !382, size: 32, align: 32, offset: 416)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !991, file: !372, line: 713, baseType: !382, size: 32, align: 32, offset: 448)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !991, file: !372, line: 713, baseType: !382, size: 32, align: 32, offset: 480)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !991, file: !372, line: 714, baseType: !382, size: 32, align: 32, offset: 512)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !991, file: !372, line: 715, baseType: !382, size: 32, align: 32, offset: 544)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "xdestroywindow", scope: !836, file: !372, line: 986, baseType: !1006, size: 384, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDestroyWindowEvent", file: !372, line: 725, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 718, size: 384, align: 64, elements: !1008)
!1008 = !{!1009, !1010, !1011, !1012, !1013, !1014}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1007, file: !372, line: 719, baseType: !382, size: 32, align: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1007, file: !372, line: 720, baseType: !363, size: 64, align: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1007, file: !372, line: 721, baseType: !382, size: 32, align: 32, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1007, file: !372, line: 722, baseType: !548, size: 64, align: 64, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !1007, file: !372, line: 723, baseType: !456, size: 64, align: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1007, file: !372, line: 724, baseType: !456, size: 64, align: 64, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "xunmap", scope: !836, file: !372, line: 987, baseType: !1016, size: 448, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "XUnmapEvent", file: !372, line: 735, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 727, size: 448, align: 64, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1024, !1025}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1017, file: !372, line: 728, baseType: !382, size: 32, align: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1017, file: !372, line: 729, baseType: !363, size: 64, align: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1017, file: !372, line: 730, baseType: !382, size: 32, align: 32, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1017, file: !372, line: 731, baseType: !548, size: 64, align: 64, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !1017, file: !372, line: 732, baseType: !456, size: 64, align: 64, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1017, file: !372, line: 733, baseType: !456, size: 64, align: 64, offset: 320)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "from_configure", scope: !1017, file: !372, line: 734, baseType: !382, size: 32, align: 32, offset: 384)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "xmap", scope: !836, file: !372, line: 988, baseType: !1027, size: 448, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMapEvent", file: !372, line: 745, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 737, size: 448, align: 64, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1033, !1034, !1035, !1036}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1028, file: !372, line: 738, baseType: !382, size: 32, align: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1028, file: !372, line: 739, baseType: !363, size: 64, align: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1028, file: !372, line: 740, baseType: !382, size: 32, align: 32, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1028, file: !372, line: 741, baseType: !548, size: 64, align: 64, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !1028, file: !372, line: 742, baseType: !456, size: 64, align: 64, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1028, file: !372, line: 743, baseType: !456, size: 64, align: 64, offset: 320)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !1028, file: !372, line: 744, baseType: !382, size: 32, align: 32, offset: 384)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "xmaprequest", scope: !836, file: !372, line: 989, baseType: !1038, size: 384, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMapRequestEvent", file: !372, line: 754, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 747, size: 384, align: 64, elements: !1040)
!1040 = !{!1041, !1042, !1043, !1044, !1045, !1046}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1039, file: !372, line: 748, baseType: !382, size: 32, align: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1039, file: !372, line: 749, baseType: !363, size: 64, align: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1039, file: !372, line: 750, baseType: !382, size: 32, align: 32, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1039, file: !372, line: 751, baseType: !548, size: 64, align: 64, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1039, file: !372, line: 752, baseType: !456, size: 64, align: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1039, file: !372, line: 753, baseType: !456, size: 64, align: 64, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "xreparent", scope: !836, file: !372, line: 990, baseType: !1048, size: 576, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "XReparentEvent", file: !372, line: 766, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 756, size: 576, align: 64, elements: !1050)
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1049, file: !372, line: 757, baseType: !382, size: 32, align: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1049, file: !372, line: 758, baseType: !363, size: 64, align: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1049, file: !372, line: 759, baseType: !382, size: 32, align: 32, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1049, file: !372, line: 760, baseType: !548, size: 64, align: 64, offset: 192)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !1049, file: !372, line: 761, baseType: !456, size: 64, align: 64, offset: 256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1049, file: !372, line: 762, baseType: !456, size: 64, align: 64, offset: 320)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1049, file: !372, line: 763, baseType: !456, size: 64, align: 64, offset: 384)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1049, file: !372, line: 764, baseType: !382, size: 32, align: 32, offset: 448)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1049, file: !372, line: 764, baseType: !382, size: 32, align: 32, offset: 480)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !1049, file: !372, line: 765, baseType: !382, size: 32, align: 32, offset: 512)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "xconfigure", scope: !836, file: !372, line: 991, baseType: !1062, size: 704, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "XConfigureEvent", file: !372, line: 780, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 768, size: 704, align: 64, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1063, file: !372, line: 769, baseType: !382, size: 32, align: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1063, file: !372, line: 770, baseType: !363, size: 64, align: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1063, file: !372, line: 771, baseType: !382, size: 32, align: 32, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1063, file: !372, line: 772, baseType: !548, size: 64, align: 64, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !1063, file: !372, line: 773, baseType: !456, size: 64, align: 64, offset: 256)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1063, file: !372, line: 774, baseType: !456, size: 64, align: 64, offset: 320)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1063, file: !372, line: 775, baseType: !382, size: 32, align: 32, offset: 384)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1063, file: !372, line: 775, baseType: !382, size: 32, align: 32, offset: 416)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1063, file: !372, line: 776, baseType: !382, size: 32, align: 32, offset: 448)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1063, file: !372, line: 776, baseType: !382, size: 32, align: 32, offset: 480)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !1063, file: !372, line: 777, baseType: !382, size: 32, align: 32, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "above", scope: !1063, file: !372, line: 778, baseType: !456, size: 64, align: 64, offset: 576)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !1063, file: !372, line: 779, baseType: !382, size: 32, align: 32, offset: 640)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "xgravity", scope: !836, file: !372, line: 992, baseType: !1079, size: 448, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGravityEvent", file: !372, line: 790, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 782, size: 448, align: 64, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1080, file: !372, line: 783, baseType: !382, size: 32, align: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1080, file: !372, line: 784, baseType: !363, size: 64, align: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1080, file: !372, line: 785, baseType: !382, size: 32, align: 32, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1080, file: !372, line: 786, baseType: !548, size: 64, align: 64, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !1080, file: !372, line: 787, baseType: !456, size: 64, align: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1080, file: !372, line: 788, baseType: !456, size: 64, align: 64, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1080, file: !372, line: 789, baseType: !382, size: 32, align: 32, offset: 384)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1080, file: !372, line: 789, baseType: !382, size: 32, align: 32, offset: 416)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "xresizerequest", scope: !836, file: !372, line: 993, baseType: !1091, size: 384, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "XResizeRequestEvent", file: !372, line: 799, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 792, size: 384, align: 64, elements: !1093)
!1093 = !{!1094, !1095, !1096, !1097, !1098, !1099, !1100}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1092, file: !372, line: 793, baseType: !382, size: 32, align: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1092, file: !372, line: 794, baseType: !363, size: 64, align: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1092, file: !372, line: 795, baseType: !382, size: 32, align: 32, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1092, file: !372, line: 796, baseType: !548, size: 64, align: 64, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1092, file: !372, line: 797, baseType: !456, size: 64, align: 64, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1092, file: !372, line: 798, baseType: !382, size: 32, align: 32, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1092, file: !372, line: 798, baseType: !382, size: 32, align: 32, offset: 352)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "xconfigurerequest", scope: !836, file: !372, line: 994, baseType: !1102, size: 768, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "XConfigureRequestEvent", file: !372, line: 814, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 801, size: 768, align: 64, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1103, file: !372, line: 802, baseType: !382, size: 32, align: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1103, file: !372, line: 803, baseType: !363, size: 64, align: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1103, file: !372, line: 804, baseType: !382, size: 32, align: 32, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1103, file: !372, line: 805, baseType: !548, size: 64, align: 64, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1103, file: !372, line: 806, baseType: !456, size: 64, align: 64, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1103, file: !372, line: 807, baseType: !456, size: 64, align: 64, offset: 320)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1103, file: !372, line: 808, baseType: !382, size: 32, align: 32, offset: 384)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1103, file: !372, line: 808, baseType: !382, size: 32, align: 32, offset: 416)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1103, file: !372, line: 809, baseType: !382, size: 32, align: 32, offset: 448)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1103, file: !372, line: 809, baseType: !382, size: 32, align: 32, offset: 480)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !1103, file: !372, line: 810, baseType: !382, size: 32, align: 32, offset: 512)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "above", scope: !1103, file: !372, line: 811, baseType: !456, size: 64, align: 64, offset: 576)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !1103, file: !372, line: 812, baseType: !382, size: 32, align: 32, offset: 640)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "value_mask", scope: !1103, file: !372, line: 813, baseType: !363, size: 64, align: 64, offset: 704)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "xcirculate", scope: !836, file: !372, line: 995, baseType: !1120, size: 448, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCirculateEvent", file: !372, line: 824, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 816, size: 448, align: 64, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1127, !1128, !1129}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1121, file: !372, line: 817, baseType: !382, size: 32, align: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1121, file: !372, line: 818, baseType: !363, size: 64, align: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1121, file: !372, line: 819, baseType: !382, size: 32, align: 32, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1121, file: !372, line: 820, baseType: !548, size: 64, align: 64, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !1121, file: !372, line: 821, baseType: !456, size: 64, align: 64, offset: 256)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1121, file: !372, line: 822, baseType: !456, size: 64, align: 64, offset: 320)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "place", scope: !1121, file: !372, line: 823, baseType: !382, size: 32, align: 32, offset: 384)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "xcirculaterequest", scope: !836, file: !372, line: 996, baseType: !1131, size: 448, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCirculateRequestEvent", file: !372, line: 834, baseType: !1132)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 826, size: 448, align: 64, elements: !1133)
!1133 = !{!1134, !1135, !1136, !1137, !1138, !1139, !1140}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1132, file: !372, line: 827, baseType: !382, size: 32, align: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1132, file: !372, line: 828, baseType: !363, size: 64, align: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1132, file: !372, line: 829, baseType: !382, size: 32, align: 32, offset: 128)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1132, file: !372, line: 830, baseType: !548, size: 64, align: 64, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1132, file: !372, line: 831, baseType: !456, size: 64, align: 64, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1132, file: !372, line: 832, baseType: !456, size: 64, align: 64, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "place", scope: !1132, file: !372, line: 833, baseType: !382, size: 32, align: 32, offset: 384)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "xproperty", scope: !836, file: !372, line: 997, baseType: !1142, size: 512, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPropertyEvent", file: !372, line: 845, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 836, size: 512, align: 64, elements: !1144)
!1144 = !{!1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1143, file: !372, line: 837, baseType: !382, size: 32, align: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1143, file: !372, line: 838, baseType: !363, size: 64, align: 64, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1143, file: !372, line: 839, baseType: !382, size: 32, align: 32, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1143, file: !372, line: 840, baseType: !548, size: 64, align: 64, offset: 192)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1143, file: !372, line: 841, baseType: !456, size: 64, align: 64, offset: 256)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !1143, file: !372, line: 842, baseType: !361, size: 64, align: 64, offset: 320)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1143, file: !372, line: 843, baseType: !527, size: 64, align: 64, offset: 384)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1143, file: !372, line: 844, baseType: !382, size: 32, align: 32, offset: 448)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "xselectionclear", scope: !836, file: !372, line: 998, baseType: !1154, size: 448, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSelectionClearEvent", file: !372, line: 855, baseType: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 847, size: 448, align: 64, elements: !1156)
!1156 = !{!1157, !1158, !1159, !1160, !1161, !1162, !1163}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1155, file: !372, line: 848, baseType: !382, size: 32, align: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1155, file: !372, line: 849, baseType: !363, size: 64, align: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1155, file: !372, line: 850, baseType: !382, size: 32, align: 32, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1155, file: !372, line: 851, baseType: !548, size: 64, align: 64, offset: 192)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1155, file: !372, line: 852, baseType: !456, size: 64, align: 64, offset: 256)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !1155, file: !372, line: 853, baseType: !361, size: 64, align: 64, offset: 320)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1155, file: !372, line: 854, baseType: !527, size: 64, align: 64, offset: 384)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "xselectionrequest", scope: !836, file: !372, line: 999, baseType: !541, size: 640, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "xselection", scope: !836, file: !372, line: 1000, baseType: !580, size: 576, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "xcolormap", scope: !836, file: !372, line: 1001, baseType: !1167, size: 448, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "XColormapEvent", file: !372, line: 895, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 882, size: 448, align: 64, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1168, file: !372, line: 883, baseType: !382, size: 32, align: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1168, file: !372, line: 884, baseType: !363, size: 64, align: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1168, file: !372, line: 885, baseType: !382, size: 32, align: 32, offset: 128)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1168, file: !372, line: 886, baseType: !548, size: 64, align: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1168, file: !372, line: 887, baseType: !456, size: 64, align: 64, offset: 256)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !1168, file: !372, line: 888, baseType: !490, size: 64, align: 64, offset: 320)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "new", scope: !1168, file: !372, line: 892, baseType: !382, size: 32, align: 32, offset: 384)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1168, file: !372, line: 894, baseType: !382, size: 32, align: 32, offset: 416)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "xclient", scope: !836, file: !372, line: 1002, baseType: !1179, size: 768, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "XClientMessageEvent", file: !372, line: 910, baseType: !1180)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 897, size: 768, align: 64, elements: !1181)
!1181 = !{!1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1180, file: !372, line: 898, baseType: !382, size: 32, align: 32)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !1180, file: !372, line: 899, baseType: !363, size: 64, align: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !1180, file: !372, line: 900, baseType: !382, size: 32, align: 32, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !1180, file: !372, line: 901, baseType: !548, size: 64, align: 64, offset: 192)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1180, file: !372, line: 902, baseType: !456, size: 64, align: 64, offset: 256)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "message_type", scope: !1180, file: !372, line: 903, baseType: !361, size: 64, align: 64, offset: 320)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1180, file: !372, line: 904, baseType: !382, size: 32, align: 32, offset: 384)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1180, file: !372, line: 909, baseType: !1190, size: 320, align: 64, offset: 448)
!1190 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1180, file: !372, line: 905, size: 320, align: 64, elements: !1191)
!1191 = !{!1192, !1196, !1201}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1190, file: !372, line: 906, baseType: !1193, size: 160, align: 8)
!1193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 160, align: 8, elements: !1194)
!1194 = !{!1195}
!1195 = !DISubrange(count: 20)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !1190, file: !372, line: 907, baseType: !1197, size: 160, align: 16)
