; ModuleID = './[inter]rdpedisp.o.i'
source_filename = "./[inter]rdpedisp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.timeval = type { i64, i64 }
%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }

@.str = private unnamed_addr constant [40 x i8] c"Microsoft::Windows::RDS::DisplayControl\00", align 1
@.str.1 = private unnamed_addr constant [60 x i8] c"rdpedisp_send_monitor_layout_pdu(), width = %d, height = %d\00", align 1
@g_dpi = external global i32, align 4
@.str.2 = private unnamed_addr constant [40 x i8] c"rdpedisp_process_pdu(), Got PDU type %d\00", align 1
@.str.3 = private unnamed_addr constant [46 x i8] c"rdpedisp_process_pdu(), Unhandled PDU type %d\00", align 1
@.str.4 = private unnamed_addr constant [78 x i8] c"rdpedisp_process_caps_pdu(), Max supported monitor area (square pixels) is %d\00", align 1
@g_pending_resize_defer = external global i32, align 4
@g_pending_resize_defer_timer = external global %struct.timeval, align 8

; Function Attrs: nounwind uwtable
define i32 @rdpedisp_is_available() #0 !dbg !37 {
  %1 = call i32 @dvc_channels_is_available(i8* getelementptr inbounds ([40 x i8], [40 x i8]* @.str, i32 0, i32 0)), !dbg !44
  ret i32 %1, !dbg !45
}

declare i32 @dvc_channels_is_available(i8*) #1

; Function Attrs: nounwind uwtable
define void @rdpedisp_set_session_size(i32, i32) #0 !dbg !46 {
  %3 = alloca i32, align 4
  %4 = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !29)
!1 = !DIFile(filename: "[inter]rdpedisp.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15, !22}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RDP_DESKTOP_ORIENTATION", file: !23, line: 699, size: 32, align: 32, elements: !24)
!23 = !DIFile(filename: "constants.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!24 = !{!25, !26, !27, !28}
!25 = !DIEnumerator(name: "ORIENTATION_LANDSCAPE", value: 0)
!26 = !DIEnumerator(name: "ORIENTATION_PORTRAIT", value: 90)
!27 = !DIEnumerator(name: "ORIENTATION_LANDSCAPE_FLIPPED", value: 180)
!28 = !DIEnumerator(name: "ORIENTATION_PORTRAIT_FLIPPED", value: 270)
!29 = !{!30}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !32, line: 43, baseType: !33)
!32 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!33 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!34 = !{i32 2, !"Dwarf Version", i32 4}
!35 = !{i32 2, !"Debug Info Version", i32 3}
!36 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!37 = distinct !DISubprogram(name: "rdpedisp_is_available", scope: !38, file: !38, line: 136, type: !39, isLocal: false, isDefinition: true, scopeLine: 137, isOptimized: false, unit: !0, variables: !43)
!38 = !DIFile(filename: "rdpedisp.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!39 = !DISubroutineType(types: !40)
!40 = !{!41}
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !32, line: 28, baseType: !42)
!42 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!43 = !{}
!44 = !DILocation(line: 138, column: 9, scope: !37)
!45 = !DILocation(line: 138, column: 2, scope: !37)
!46 = distinct !DISubprogram(name: "rdpedisp_set_session_size", scope: !38, file: !38, line: 142, type: !47, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !43)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !31, !31}
!49 = !DILocalVariable(name: "width", arg: 1, scope: !46, file: !38, line: 142, type: !31)
!50 = !DIExpression()
!51 = !DILocation(line: 142, column: 34, scope: !46)
!52 = !DILocalVariable(name: "height", arg: 2, scope: !46, file: !38, line: 142, type: !31)
!53 = !DILocation(line: 142, column: 48, scope: !46)
!54 = !DILocation(line: 144, column: 6, scope: !55)
!55 = distinct !DILexicalBlock(scope: !46, file: !38, line: 144, column: 6)
!56 = !DILocation(line: 144, column: 30, scope: !55)
!57 = !DILocation(line: 144, column: 6, scope: !46)
!58 = !DILocation(line: 145, column: 3, scope: !55)
!59 = !DILocation(line: 148, column: 2, scope: !46)
!60 = !DILocation(line: 150, column: 35, scope: !46)
!61 = !DILocation(line: 150, column: 42, scope: !46)
!62 = !DILocation(line: 150, column: 2, scope: !46)
!63 = !DILocation(line: 151, column: 1, scope: !46)
!64 = !DILocation(line: 151, column: 1, scope: !65)
!65 = !DILexicalBlockFile(scope: !46, file: !38, discriminator: 1)
!66 = distinct !DISubprogram(name: "rdpedisp_send_monitor_layout_pdu", scope: !38, file: !38, line: 85, type: !47, isLocal: true, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !43)
!67 = !DILocalVariable(name: "width", arg: 1, scope: !66, file: !38, line: 85, type: !31)
!68 = !DILocation(line: 85, column: 41, scope: !66)
!69 = !DILocalVariable(name: "height", arg: 2, scope: !66, file: !38, line: 85, type: !31)
!70 = !DILocation(line: 85, column: 55, scope: !66)
!71 = !DILocalVariable(name: "s", scope: !66, file: !38, line: 87, type: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !73, line: 25, size: 576, align: 64, elements: !74)
!73 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!74 = !{!75, !78, !79, !80, !81, !82, !83, !84, !85}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !72, file: !73, line: 27, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !72, file: !73, line: 28, baseType: !76, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !72, file: !73, line: 29, baseType: !76, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !72, file: !73, line: 30, baseType: !33, size: 32, align: 32, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !72, file: !73, line: 33, baseType: !76, size: 64, align: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !72, file: !73, line: 34, baseType: !76, size: 64, align: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !72, file: !73, line: 35, baseType: !76, size: 64, align: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !72, file: !73, line: 36, baseType: !76, size: 64, align: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !72, file: !73, line: 37, baseType: !76, size: 64, align: 64, offset: 512)
!86 = !DILocation(line: 87, column: 16, scope: !66)
!87 = !DILocalVariable(name: "physwidth", scope: !66, file: !38, line: 88, type: !31)
!88 = !DILocation(line: 88, column: 9, scope: !66)
!89 = !DILocalVariable(name: "physheight", scope: !66, file: !38, line: 88, type: !31)
!90 = !DILocation(line: 88, column: 20, scope: !66)
!91 = !DILocalVariable(name: "desktopscale", scope: !66, file: !38, line: 88, type: !31)
!92 = !DILocation(line: 88, column: 32, scope: !66)
!93 = !DILocalVariable(name: "devicescale", scope: !66, file: !38, line: 88, type: !31)
!94 = !DILocation(line: 88, column: 46, scope: !66)
!95 = !DILocation(line: 90, column: 2, scope: !66)
!96 = !DILocation(line: 92, column: 89, scope: !66)
!97 = !DILocation(line: 93, column: 9, scope: !66)
!98 = !DILocation(line: 92, column: 2, scope: !66)
!99 = !DILocation(line: 95, column: 2, scope: !66)
!100 = !DILocation(line: 97, column: 22, scope: !101)
!101 = distinct !DILexicalBlock(scope: !66, file: !38, line: 97, column: 2)
!102 = !DILocation(line: 97, column: 4, scope: !101)
!103 = !DILocation(line: 97, column: 25, scope: !101)
!104 = !DILocation(line: 97, column: 37, scope: !101)
!105 = !DILocation(line: 97, column: 39, scope: !101)
!106 = !DILocation(line: 98, column: 22, scope: !107)
!107 = distinct !DILexicalBlock(scope: !66, file: !38, line: 98, column: 2)
!108 = !DILocation(line: 98, column: 4, scope: !107)
!109 = !DILocation(line: 98, column: 25, scope: !107)
!110 = !DILocation(line: 98, column: 36, scope: !107)
!111 = !DILocation(line: 98, column: 38, scope: !107)
!112 = !DILocation(line: 100, column: 22, scope: !113)
!113 = distinct !DILexicalBlock(scope: !66, file: !38, line: 100, column: 2)
!114 = !DILocation(line: 100, column: 4, scope: !113)
!115 = !DILocation(line: 100, column: 25, scope: !113)
!116 = !DILocation(line: 100, column: 38, scope: !113)
!117 = !DILocation(line: 100, column: 40, scope: !113)
!118 = !DILocation(line: 101, column: 22, scope: !119)
!119 = distinct !DILexicalBlock(scope: !66, file: !38, line: 101, column: 2)
!120 = !DILocation(line: 101, column: 4, scope: !119)
!121 = !DILocation(line: 101, column: 25, scope: !119)
!122 = !DILocation(line: 101, column: 36, scope: !119)
!123 = !DILocation(line: 101, column: 38, scope: !119)
!124 = !DILocation(line: 102, column: 22, scope: !125)
!125 = distinct !DILexicalBlock(scope: !66, file: !38, line: 102, column: 2)
!126 = !DILocation(line: 102, column: 4, scope: !125)
!127 = !DILocation(line: 102, column: 25, scope: !125)
!128 = !DILocation(line: 102, column: 36, scope: !125)
!129 = !DILocation(line: 102, column: 38, scope: !125)
!130 = !DILocation(line: 103, column: 27, scope: !131)
!131 = distinct !DILexicalBlock(scope: !66, file: !38, line: 103, column: 2)
!132 = !DILocation(line: 103, column: 22, scope: !131)
!133 = !DILocation(line: 103, column: 4, scope: !131)
!134 = !DILocation(line: 103, column: 25, scope: !131)
!135 = !DILocation(line: 103, column: 40, scope: !131)
!136 = !DILocation(line: 103, column: 42, scope: !131)
!137 = !DILocation(line: 104, column: 27, scope: !138)
!138 = distinct !DILexicalBlock(scope: !66, file: !38, line: 104, column: 2)
!139 = !DILocation(line: 104, column: 22, scope: !138)
!140 = !DILocation(line: 104, column: 4, scope: !138)
!141 = !DILocation(line: 104, column: 25, scope: !138)
!142 = !DILocation(line: 104, column: 41, scope: !138)
!143 = !DILocation(line: 104, column: 43, scope: !138)
!144 = !DILocation(line: 106, column: 36, scope: !66)
!145 = !DILocation(line: 106, column: 43, scope: !66)
!146 = !DILocation(line: 106, column: 51, scope: !66)
!147 = !DILocation(line: 106, column: 2, scope: !66)
!148 = !DILocation(line: 109, column: 27, scope: !149)
!149 = distinct !DILexicalBlock(scope: !66, file: !38, line: 109, column: 2)
!150 = !DILocation(line: 109, column: 22, scope: !149)
!151 = !DILocation(line: 109, column: 4, scope: !149)
