; ModuleID = './[inter]stream.o.i'
source_filename = "./[inter]stream.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }

@_out_utf16s.icv_local_to_utf16 = internal global i8* null, align 8
@.str = private unnamed_addr constant [38 x i8] c"out_utf16s(), iconv(2) fail, errno %d\00", align 1
@.str.1 = private unnamed_addr constant [9 x i8] c"UTF-16LE\00", align 1
@g_codepage = external global [16 x i8], align 16
@.str.2 = private unnamed_addr constant [48 x i8] c"locale_to_utf16(), iconv_open[%s -> %s] fail %p\00", align 1

; Function Attrs: nounwind uwtable
define void @s_realloc(%struct.stream*, i32) #0 !dbg !65 {
  %3 = alloca %struct.stream*, align 8
  %4 = alloca i32, align 4
  %5 = alloca i8*, align 8
  store %struct.stream* %0, %struct.stream** %3, align 8
  call void @llvm.dbg.declare(metadata %struct.stream** %3, metadata !68, metadata !69), !dbg !70
  store i32 %1, i32* %4, align 4
  call void @llvm.dbg.declare(metadata i32* %4, metadata !71, metadata !69), !dbg !72
  call void @llvm.dbg.declare(metadata i8** %5, metadata !73, metadata !69), !dbg !74
  %6 = load %struct.stream*, %struct.stream** %3, align 8, !dbg !75
  %7 = getelementptr inbounds %struct.stream, %struct.stream* %6, i32 0, i32 3, !dbg !77
  %8 = load i32, i32* %7, align 8, !dbg !77
  %9 = load i32, i32* %4, align 4, !dbg !78
  %10 = icmp uge i32 %8, %9, !dbg !79

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22, globals: !38)
!1 = !DIFile(filename: "[inter]stream.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !{!23, !27, !28, !31, !33, !34, !36}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !25, line: 41, baseType: !26)
!25 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!26 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !29, line: 216, baseType: !30)
!29 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!30 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "libiconv_t", file: !37, line: 46, baseType: !27)
!37 = !DIFile(filename: "/usr/local/include/iconv.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!38 = !{!39}
!39 = distinct !DIGlobalVariable(name: "icv_local_to_utf16", scope: !40, file: !41, line: 86, type: !36, isLocal: true, isDefinition: true, variable: i8** @_out_utf16s.icv_local_to_utf16)
!40 = distinct !DISubprogram(name: "_out_utf16s", scope: !41, file: !41, line: 84, type: !42, isLocal: true, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !61)
!41 = !DIFile(filename: "stream.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!42 = !DISubroutineType(types: !43)
!43 = !{!28, !44, !28, !59}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !45, line: 40, baseType: !46)
!45 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !45, line: 25, size: 576, align: 64, elements: !48)
!48 = !{!49, !50, !51, !52, !54, !55, !56, !57, !58}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !47, file: !45, line: 27, baseType: !34, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !47, file: !45, line: 28, baseType: !34, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !47, file: !45, line: 29, baseType: !34, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !47, file: !45, line: 30, baseType: !53, size: 32, align: 32, offset: 192)
!53 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !47, file: !45, line: 33, baseType: !34, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !47, file: !45, line: 34, baseType: !34, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !47, file: !45, line: 35, baseType: !34, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !47, file: !45, line: 36, baseType: !34, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !47, file: !45, line: 37, baseType: !34, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!61 = !{}
!62 = !{i32 2, !"Dwarf Version", i32 4}
!63 = !{i32 2, !"Debug Info Version", i32 3}
!64 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!65 = distinct !DISubprogram(name: "s_realloc", scope: !41, file: !41, line: 29, type: !66, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !61)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !44, !53}
!68 = !DILocalVariable(name: "s", arg: 1, scope: !65, file: !41, line: 29, type: !44)
!69 = !DIExpression()
!70 = !DILocation(line: 29, column: 18, scope: !65)
!71 = !DILocalVariable(name: "size", arg: 2, scope: !65, file: !41, line: 29, type: !53)
!72 = !DILocation(line: 29, column: 34, scope: !65)
!73 = !DILocalVariable(name: "data", scope: !65, file: !41, line: 31, type: !34)
!74 = !DILocation(line: 31, column: 23, scope: !65)
!75 = !DILocation(line: 33, column: 12, scope: !76)
!76 = distinct !DILexicalBlock(scope: !65, file: !41, line: 33, column: 12)
!77 = !DILocation(line: 33, column: 15, scope: !76)
!78 = !DILocation(line: 33, column: 23, scope: !76)
!79 = !DILocation(line: 33, column: 20, scope: !76)
!80 = !DILocation(line: 33, column: 12, scope: !65)
!81 = !DILocation(line: 34, column: 16, scope: !76)
!82 = !DILocation(line: 36, column: 15, scope: !65)
!83 = !DILocation(line: 36, column: 18, scope: !65)
!84 = !DILocation(line: 36, column: 13, scope: !65)
!85 = !DILocation(line: 37, column: 18, scope: !65)
!86 = !DILocation(line: 37, column: 8, scope: !65)
!87 = !DILocation(line: 37, column: 11, scope: !65)
!88 = !DILocation(line: 37, column: 16, scope: !65)
!89 = !DILocation(line: 38, column: 27, scope: !65)
!90 = !DILocation(line: 38, column: 33, scope: !65)
!91 = !DILocation(line: 38, column: 18, scope: !65)
!92 = !DILocation(line: 38, column: 8, scope: !65)
!93 = !DILocation(line: 38, column: 11, scope: !65)
!94 = !DILocation(line: 38, column: 16, scope: !65)
!95 = !DILocation(line: 39, column: 15, scope: !65)
!96 = !DILocation(line: 39, column: 18, scope: !65)
!97 = !DILocation(line: 39, column: 26, scope: !65)
!98 = !DILocation(line: 39, column: 29, scope: !65)
!99 = !DILocation(line: 39, column: 33, scope: !65)
!100 = !DILocation(line: 39, column: 31, scope: !65)
!101 = !DILocation(line: 39, column: 23, scope: !65)
!102 = !DILocation(line: 39, column: 8, scope: !65)
!103 = !DILocation(line: 39, column: 11, scope: !65)
!104 = !DILocation(line: 39, column: 13, scope: !65)
!105 = !DILocation(line: 40, column: 17, scope: !65)
!106 = !DILocation(line: 40, column: 20, scope: !65)
!107 = !DILocation(line: 40, column: 28, scope: !65)
!108 = !DILocation(line: 40, column: 31, scope: !65)
!109 = !DILocation(line: 40, column: 37, scope: !65)
!110 = !DILocation(line: 40, column: 35, scope: !65)
!111 = !DILocation(line: 40, column: 25, scope: !65)
!112 = !DILocation(line: 40, column: 8, scope: !65)
!113 = !DILocation(line: 40, column: 11, scope: !65)
!114 = !DILocation(line: 40, column: 15, scope: !65)
!115 = !DILocation(line: 41, column: 21, scope: !65)
!116 = !DILocation(line: 41, column: 24, scope: !65)
!117 = !DILocation(line: 41, column: 32, scope: !65)
!118 = !DILocation(line: 41, column: 35, scope: !65)
!119 = !DILocation(line: 41, column: 45, scope: !65)
!120 = !DILocation(line: 41, column: 43, scope: !65)
!121 = !DILocation(line: 41, column: 29, scope: !65)
!122 = !DILocation(line: 41, column: 8, scope: !65)
!123 = !DILocation(line: 41, column: 11, scope: !65)
!124 = !DILocation(line: 41, column: 19, scope: !65)
!125 = !DILocation(line: 42, column: 21, scope: !65)
!126 = !DILocation(line: 42, column: 24, scope: !65)
!127 = !DILocation(line: 42, column: 32, scope: !65)
!128 = !DILocation(line: 42, column: 35, scope: !65)
