; ModuleID = './[inter]lspci.o.i'
source_filename = "./[inter]lspci.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._VCHANNEL = type { i16, [8 x i8], i32, %struct.stream, void (%struct.stream*)* }
%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }
%struct._pci_device = type { i16, i16, i16, i16, i16, i8, i8 }

@.str = private unnamed_addr constant [6 x i8] c"lspci\00", align 1
@lspci_channel = internal global %struct._VCHANNEL* null, align 8
@lspci_process.rest = internal global i8* null, align 8
@.str.1 = private unnamed_addr constant [3 x i8] c"-m\00", align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"-n\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"-v\00", align 1
@.str.4 = private unnamed_addr constant [6 x i8] c"LSPCI\00", align 1
@current_device = internal global %struct._pci_device zeroinitializer, align 2
@.str.5 = private unnamed_addr constant [3 x i8] c".\0A\00", align 1
@.str.6 = private unnamed_addr constant [40 x i8] c"lspci_process_line(), invalid line '%s'\00", align 1
@.str.7 = private unnamed_addr constant [7 x i8] c"Class:\00", align 1
@.str.8 = private unnamed_addr constant [3 x i8] c" \09\00", align 1
@.str.9 = private unnamed_addr constant [8 x i8] c"Vendor:\00", align 1
@.str.10 = private unnamed_addr constant [8 x i8] c"Device:\00", align 1
@.str.11 = private unnamed_addr constant [9 x i8] c"SVendor:\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22, globals: !26)
!1 = !DIFile(filename: "[inter]lspci.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!26 = !{!27, !65, !68}
!27 = distinct !DIGlobalVariable(name: "lspci_channel", scope: !0, file: !28, line: 24, type: !29, isLocal: true, isDefinition: true, variable: %struct._VCHANNEL** @lspci_channel)
!28 = !DIFile(filename: "lspci.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "VCHANNEL", file: !31, line: 169, baseType: !32)
!31 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VCHANNEL", file: !31, line: 161, size: 768, align: 64, elements: !33)
!33 = !{!34, !37, !41, !44, !59}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_id", scope: !32, file: !31, line: 163, baseType: !35, size: 16, align: 16)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !31, line: 41, baseType: !36)
!36 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !32, file: !31, line: 164, baseType: !38, size: 64, align: 8, offset: 16)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 64, align: 8, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 8)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !32, file: !31, line: 165, baseType: !42, size: 32, align: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !31, line: 43, baseType: !43)
!43 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !32, file: !31, line: 166, baseType: !45, size: 576, align: 64, offset: 128)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !46, line: 25, size: 576, align: 64, elements: !47)
!46 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!47 = !{!48, !51, !52, !53, !54, !55, !56, !57, !58}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !45, file: !46, line: 27, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !45, file: !46, line: 28, baseType: !49, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !45, file: !46, line: 29, baseType: !49, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !45, file: !46, line: 30, baseType: !43, size: 32, align: 32, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !45, file: !46, line: 33, baseType: !49, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !45, file: !46, line: 34, baseType: !49, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !45, file: !46, line: 35, baseType: !49, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !45, file: !46, line: 36, baseType: !49, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !45, file: !46, line: 37, baseType: !49, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !32, file: !31, line: 167, baseType: !60, size: 64, align: 64, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !63}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !46, line: 40, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!65 = distinct !DIGlobalVariable(name: "rest", scope: !66, file: !28, line: 135, type: !24, isLocal: true, isDefinition: true, variable: i8** @lspci_process.rest)
!66 = distinct !DISubprogram(name: "lspci_process", scope: !28, file: !28, line: 132, type: !61, isLocal: true, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !67)
!67 = !{}
!68 = distinct !DIGlobalVariable(name: "current_device", scope: !0, file: !28, line: 37, type: !69, isLocal: true, isDefinition: true, variable: %struct._pci_device* @current_device)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "pci_device", file: !28, line: 35, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_pci_device", file: !28, line: 26, size: 96, align: 16, elements: !71)
!71 = !{!72, !73, !74, !75, !76, !77, !79}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "klass", scope: !70, file: !28, line: 28, baseType: !35, size: 16, align: 16)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !70, file: !28, line: 29, baseType: !35, size: 16, align: 16, offset: 16)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !70, file: !28, line: 30, baseType: !35, size: 16, align: 16, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "subvendor", scope: !70, file: !28, line: 31, baseType: !35, size: 16, align: 16, offset: 48)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "subdevice", scope: !70, file: !28, line: 32, baseType: !35, size: 16, align: 16, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !70, file: !28, line: 33, baseType: !78, size: 8, align: 8, offset: 80)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !31, line: 39, baseType: !50)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "progif", scope: !70, file: !28, line: 34, baseType: !78, size: 8, align: 8, offset: 88)
!80 = !{i32 2, !"Dwarf Version", i32 4}
!81 = !{i32 2, !"Debug Info Version", i32 3}
!82 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!83 = distinct !DISubprogram(name: "lspci_init", scope: !28, file: !28, line: 148, type: !84, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !67)
!84 = !DISubroutineType(types: !85)
!85 = !{!86}
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !31, line: 28, baseType: !87)
!87 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!88 = !DILocation(line: 151, column: 3, scope: !83)
!89 = !DILocation(line: 150, column: 16, scope: !83)
!90 = !DILocation(line: 153, column: 10, scope: !83)
!91 = !DILocation(line: 153, column: 24, scope: !83)
!92 = !DILocation(line: 153, column: 2, scope: !83)
!93 = !DILocalVariable(name: "s", arg: 1, scope: !66, file: !28, line: 132, type: !63)
!94 = !DIExpression()
!95 = !DILocation(line: 132, column: 22, scope: !66)
!96 = !DILocalVariable(name: "pkglen", scope: !66, file: !28, line: 134, type: !43)
!97 = !DILocation(line: 134, column: 15, scope: !66)
!98 = !DILocalVariable(name: "buf", scope: !66, file: !28, line: 136, type: !24)
!99 = !DILocation(line: 136, column: 8, scope: !66)
!100 = !DILocation(line: 138, column: 11, scope: !66)
!101 = !DILocation(line: 138, column: 14, scope: !66)
!102 = !DILocation(line: 138, column: 20, scope: !66)
!103 = !DILocation(line: 138, column: 23, scope: !66)
!104 = !DILocation(line: 138, column: 18, scope: !66)
!105 = !DILocation(line: 138, column: 9, scope: !66)
!106 = !DILocation(line: 140, column: 16, scope: !66)
!107 = !DILocation(line: 140, column: 23, scope: !66)
!108 = !DILocation(line: 140, column: 8, scope: !66)
!109 = !DILocation(line: 140, column: 6, scope: !66)
!110 = !DILocation(line: 141, column: 12, scope: !111)
!111 = distinct !DILexicalBlock(scope: !66, file: !28, line: 141, column: 2)
!112 = !DILocation(line: 141, column: 25, scope: !111)
!113 = !DILocation(line: 141, column: 28, scope: !111)
!114 = !DILocation(line: 141, column: 30, scope: !111)
!115 = !DILocation(line: 141, column: 37, scope: !111)
!116 = !DILocation(line: 141, column: 41, scope: !111)
!117 = !DILocation(line: 141, column: 4, scope: !111)
!118 = !DILocation(line: 141, column: 50, scope: !111)
!119 = !DILocation(line: 141, column: 57, scope: !111)
!120 = !DILocation(line: 141, column: 61, scope: !111)
!121 = !DILocation(line: 141, column: 46, scope: !111)
!122 = !DILocation(line: 141, column: 65, scope: !111)
!123 = !DILocation(line: 142, column: 19, scope: !66)
!124 = !DILocation(line: 142, column: 2, scope: !66)
!125 = !DILocation(line: 143, column: 8, scope: !66)
!126 = !DILocation(line: 143, column: 2, scope: !66)
!127 = !DILocation(line: 144, column: 1, scope: !66)
!128 = distinct !DISubprogram(name: "lspci_process_line", scope: !28, file: !28, line: 110, type: !129, isLocal: true, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !67)
!129 = !DISubroutineType(types: !130)
!130 = !{!86, !131, !23}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!133 = !DILocalVariable(name: "line", arg: 1, scope: !128, file: !28, line: 110, type: !131)
!134 = !DILocation(line: 110, column: 32, scope: !128)
!135 = !DILocalVariable(name: "data", arg: 2, scope: !128, file: !28, line: 110, type: !23)
!136 = !DILocation(line: 110, column: 44, scope: !128)
!137 = !DILocation(line: 112, column: 9, scope: !128)
!138 = !DILocalVariable(name: "lspci_command", scope: !128, file: !28, line: 113, type: !139)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 320, align: 64, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 5)
