; ModuleID = './[inter]cliprdr.o.i'
source_filename = "./[inter]cliprdr.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._VCHANNEL = type { i16, [8 x i8], i32, %struct.stream, void (%struct.stream*)* }
%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }

@.str = private unnamed_addr constant [57 x i8] c"cliprdr_send_simple_native_format_announce() format 0x%x\00", align 1
@.str.1 = private unnamed_addr constant [38 x i8] c"cliprdr_send_native_format_announce()\00", align 1
@last_formats = internal global i8* null, align 8
@last_formats_length = internal global i32 0, align 4
@.str.2 = private unnamed_addr constant [41 x i8] c"cliprdr_send_data_request(), format 0x%x\00", align 1
@.str.3 = private unnamed_addr constant [37 x i8] c"cliprdr_send_data(), length %d bytes\00", align 1
@.str.4 = private unnamed_addr constant [8 x i8] c"cliprdr\00", align 1
@cliprdr_channel = internal global %struct._VCHANNEL* null, align 8
@.str.5 = private unnamed_addr constant [53 x i8] c"cliprdr_send_packet(), type=%d, status=%d, length=%d\00", align 1
@.str.6 = private unnamed_addr constant [49 x i8] c"cliprdr_process(), type=%d, status=%d, length=%d\00", align 1
@.str.7 = private unnamed_addr constant [45 x i8] c"cliprdr_process(), unhandled error (type=%d)\00", align 1
@.str.8 = private unnamed_addr constant [44 x i8] c"cliprdr_process(), unhandled packet type %d\00", align 1

; Function Attrs: nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22, globals: !31)
!1 = !DIFile(filename: "[inter]cliprdr.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !{!23, !24, !28}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !26, line: 41, baseType: !27)
!26 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!27 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !26, line: 43, baseType: !30)
!30 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!31 = !{!32, !66, !69}
!32 = distinct !DIGlobalVariable(name: "cliprdr_channel", scope: !0, file: !33, line: 34, type: !34, isLocal: true, isDefinition: true, variable: %struct._VCHANNEL** @cliprdr_channel)
!33 = !DIFile(filename: "cliprdr.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "VCHANNEL", file: !26, line: 169, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VCHANNEL", file: !26, line: 161, size: 768, align: 64, elements: !37)
!37 = !{!38, !39, !44, !45, !60}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_id", scope: !36, file: !26, line: 163, baseType: !25, size: 16, align: 16)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !36, file: !26, line: 164, baseType: !40, size: 64, align: 8, offset: 16)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 64, align: 8, elements: !42)
!41 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!42 = !{!43}
!43 = !DISubrange(count: 8)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !26, line: 165, baseType: !29, size: 32, align: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !36, file: !26, line: 166, baseType: !46, size: 576, align: 64, offset: 128)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !47, line: 25, size: 576, align: 64, elements: !48)
!47 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!48 = !{!49, !52, !53, !54, !55, !56, !57, !58, !59}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !46, file: !47, line: 27, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !46, file: !47, line: 28, baseType: !50, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !46, file: !47, line: 29, baseType: !50, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !46, file: !47, line: 30, baseType: !30, size: 32, align: 32, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !46, file: !47, line: 33, baseType: !50, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !46, file: !47, line: 34, baseType: !50, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !46, file: !47, line: 35, baseType: !50, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !46, file: !47, line: 36, baseType: !50, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !46, file: !47, line: 37, baseType: !50, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !36, file: !26, line: 167, baseType: !61, size: 64, align: 64, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !64}
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !47, line: 40, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!66 = distinct !DIGlobalVariable(name: "last_formats", scope: !0, file: !33, line: 36, type: !67, isLocal: true, isDefinition: true, variable: i8** @last_formats)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !26, line: 39, baseType: !51)
!69 = distinct !DIGlobalVariable(name: "last_formats_length", scope: !0, file: !33, line: 37, type: !29, isLocal: true, isDefinition: true, variable: i32* @last_formats_length)
!70 = !{i32 2, !"Dwarf Version", i32 4}
!71 = !{i32 2, !"Debug Info Version", i32 3}
!72 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!73 = distinct !DISubprogram(name: "cliprdr_send_simple_native_format_announce", scope: !33, file: !33, line: 63, type: !74, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !76)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !29}
!76 = !{}
!77 = !DILocalVariable(name: "format", arg: 1, scope: !73, file: !33, line: 63, type: !29)
!78 = !DIExpression()
!79 = !DILocation(line: 63, column: 51, scope: !73)
!80 = !DILocalVariable(name: "buffer", scope: !73, file: !33, line: 65, type: !81)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 288, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 36)
!84 = !DILocation(line: 65, column: 8, scope: !73)
!85 = !DILocation(line: 68, column: 9, scope: !73)
!86 = !DILocation(line: 67, column: 2, scope: !73)
!87 = !DILocation(line: 70, column: 17, scope: !73)
!88 = !DILocation(line: 70, column: 25, scope: !73)
!89 = !DILocation(line: 70, column: 2, scope: !73)
!90 = !DILocation(line: 71, column: 9, scope: !73)
!91 = !DILocation(line: 71, column: 16, scope: !73)
!92 = !DILocation(line: 71, column: 2, scope: !73)
!93 = !DILocation(line: 72, column: 38, scope: !73)
!94 = !DILocation(line: 72, column: 2, scope: !73)
!95 = !DILocation(line: 73, column: 1, scope: !73)
!96 = distinct !DISubprogram(name: "cliprdr_send_native_format_announce", scope: !33, file: !33, line: 80, type: !97, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !76)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !67, !29}
!99 = !DILocalVariable(name: "formats_data", arg: 1, scope: !96, file: !33, line: 80, type: !67)
!100 = !DILocation(line: 80, column: 45, scope: !96)
!101 = !DILocalVariable(name: "formats_data_length", arg: 2, scope: !96, file: !33, line: 80, type: !29)
!102 = !DILocation(line: 80, column: 66, scope: !96)
!103 = !DILocation(line: 82, column: 2, scope: !96)
!104 = !DILocation(line: 84, column: 28, scope: !96)
!105 = !DILocation(line: 85, column: 8, scope: !96)
!106 = !DILocation(line: 84, column: 2, scope: !96)
!107 = !DILocation(line: 87, column: 6, scope: !108)
!108 = distinct !DILexicalBlock(scope: !96, file: !33, line: 87, column: 6)
!109 = !DILocation(line: 87, column: 22, scope: !108)
!110 = !DILocation(line: 87, column: 19, scope: !108)
!111 = !DILocation(line: 87, column: 6, scope: !96)
!112 = !DILocation(line: 89, column: 7, scope: !113)
!113 = distinct !DILexicalBlock(scope: !114, file: !33, line: 89, column: 7)
!114 = distinct !DILexicalBlock(scope: !108, file: !33, line: 88, column: 2)
!115 = !DILocation(line: 89, column: 7, scope: !114)
!116 = !DILocation(line: 90, column: 10, scope: !113)
!117 = !DILocation(line: 90, column: 4, scope: !113)
!118 = !DILocation(line: 92, column: 26, scope: !114)
!119 = !DILocation(line: 92, column: 18, scope: !114)
