; ModuleID = './[inter]iso.o.i'
source_filename = "./[inter]iso.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }

@.str = private unnamed_addr constant [42 x i8] c"iso_recv(), expected ISO_PDU_DT, got 0x%x\00", align 1
@g_negotiate_rdp_protocol = internal global i32 1, align 4
@.str.1 = private unnamed_addr constant [34 x i8] c"Connecting to server using NLA...\00", align 1
@.str.2 = private unnamed_addr constant [34 x i8] c"Connecting to server using SSL...\00", align 1
@.str.3 = private unnamed_addr constant [45 x i8] c"iso_connect(), expected ISO_PDU_CC, got 0x%x\00", align 1
@g_rdp_version = external global i32, align 4
@.str.4 = private unnamed_addr constant [48 x i8] c"SSL with user authentication required by server\00", align 1
@.str.5 = private unnamed_addr constant [26 x i8] c"SSL not allowed by server\00", align 1
@.str.6 = private unnamed_addr constant [46 x i8] c"no valid authentication certificate on server\00", align 1
@.str.7 = private unnamed_addr constant [31 x i8] c"inconsistent negotiation flags\00", align 1
@.str.8 = private unnamed_addr constant [23 x i8] c"SSL required by server\00", align 1
@.str.9 = private unnamed_addr constant [27 x i8] c"CredSSP required by server\00", align 1
@.str.10 = private unnamed_addr constant [15 x i8] c"unknown reason\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !46, globals: !54)
!1 = !DIFile(filename: "[inter]iso.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !11, !23, !30, !35, !41}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ISO_PDU_CODE", file: !4, line: 64, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "constants.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "ISO_PDU_CR", value: 224)
!7 = !DIEnumerator(name: "ISO_PDU_CC", value: 208)
!8 = !DIEnumerator(name: "ISO_PDU_DR", value: 128)
!9 = !DIEnumerator(name: "ISO_PDU_DT", value: 240)
!10 = !DIEnumerator(name: "ISO_PDU_ER", value: 112)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !12, line: 46, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22}
!14 = !DIEnumerator(name: "GUI", value: 0)
!15 = !DIEnumerator(name: "Keyboard", value: 1)
!16 = !DIEnumerator(name: "Clipboard", value: 2)
!17 = !DIEnumerator(name: "Sound", value: 3)
!18 = !DIEnumerator(name: "Protocol", value: 4)
!19 = !DIEnumerator(name: "Graphics", value: 5)
!20 = !DIEnumerator(name: "Core", value: 6)
!21 = !DIEnumerator(name: "SmartCard", value: 7)
!22 = !DIEnumerator(name: "Disk", value: 8)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !12, line: 37, size: 32, align: 32, elements: !24)
!24 = !{!25, !26, !27, !28, !29}
!25 = !DIEnumerator(name: "Debug", value: 0)
!26 = !DIEnumerator(name: "Verbose", value: 1)
!27 = !DIEnumerator(name: "Warning", value: 2)
!28 = !DIEnumerator(name: "Error", value: 3)
!29 = !DIEnumerator(name: "Notice", value: 4)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RDP_NEG_REQ_CODE", file: !4, line: 81, size: 32, align: 32, elements: !31)
!31 = !{!32, !33, !34}
!32 = !DIEnumerator(name: "PROTOCOL_RDP", value: 0)
!33 = !DIEnumerator(name: "PROTOCOL_SSL", value: 1)
!34 = !DIEnumerator(name: "PROTOCOL_HYBRID", value: 2)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_RDP_VERSION", file: !36, line: 52, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!37 = !{!38, !39, !40}
!38 = !DIEnumerator(name: "RDP_V4", value: 4)
!39 = !DIEnumerator(name: "RDP_V5", value: 5)
!40 = !DIEnumerator(name: "RDP_V6", value: 6)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RDP_NEG_TYPE_CODE", file: !4, line: 74, size: 32, align: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "RDP_NEG_REQ", value: 1)
!44 = !DIEnumerator(name: "RDP_NEG_RSP", value: 2)
!45 = !DIEnumerator(name: "RDP_NEG_FAILURE", value: 3)
!46 = !{!47, !48, !51}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !36, line: 43, baseType: !50)
!50 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !36, line: 41, baseType: !53)
!53 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!54 = !{!55}
!55 = distinct !DIGlobalVariable(name: "g_negotiate_rdp_protocol", scope: !0, file: !56, line: 29, type: !57, isLocal: true, isDefinition: true, variable: i32* @g_negotiate_rdp_protocol)
!56 = !DIFile(filename: "iso.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !36, line: 28, baseType: !58)
!58 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!59 = !{i32 2, !"Dwarf Version", i32 4}
!60 = !{i32 2, !"Debug Info Version", i32 3}
!61 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!62 = distinct !DISubprogram(name: "iso_init", scope: !56, file: !56, line: 162, type: !63, isLocal: false, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !58}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !66, line: 40, baseType: !67)
!66 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !66, line: 25, size: 576, align: 64, elements: !69)
!69 = !{!70, !73, !74, !75, !76, !77, !78, !79, !80}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !68, file: !66, line: 27, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !68, file: !66, line: 28, baseType: !71, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !68, file: !66, line: 29, baseType: !71, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !68, file: !66, line: 30, baseType: !50, size: 32, align: 32, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !68, file: !66, line: 33, baseType: !71, size: 64, align: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !68, file: !66, line: 34, baseType: !71, size: 64, align: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !68, file: !66, line: 35, baseType: !71, size: 64, align: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !68, file: !66, line: 36, baseType: !71, size: 64, align: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !68, file: !66, line: 37, baseType: !71, size: 64, align: 64, offset: 512)
!81 = !{}
!82 = !DILocalVariable(name: "length", arg: 1, scope: !62, file: !56, line: 162, type: !58)
!83 = !DIExpression()
!84 = !DILocation(line: 162, column: 14, scope: !62)
!85 = !DILocalVariable(name: "s", scope: !62, file: !56, line: 164, type: !65)
!86 = !DILocation(line: 164, column: 9, scope: !62)
!87 = !DILocation(line: 166, column: 15, scope: !62)
!88 = !DILocation(line: 166, column: 22, scope: !62)
!89 = !DILocation(line: 166, column: 6, scope: !62)
!90 = !DILocation(line: 166, column: 4, scope: !62)
!91 = !DILocation(line: 167, column: 20, scope: !92)
!92 = distinct !DILexicalBlock(scope: !62, file: !56, line: 167, column: 2)
!93 = !DILocation(line: 167, column: 24, scope: !92)
!94 = !DILocation(line: 167, column: 5, scope: !92)
!95 = !DILocation(line: 167, column: 9, scope: !92)
!96 = !DILocation(line: 167, column: 17, scope: !92)
!97 = !DILocation(line: 167, column: 28, scope: !92)
!98 = !DILocation(line: 167, column: 32, scope: !92)
!99 = !DILocation(line: 167, column: 34, scope: !92)
!100 = !DILocation(line: 169, column: 9, scope: !62)
!101 = !DILocation(line: 169, column: 2, scope: !62)
!102 = distinct !DISubprogram(name: "iso_send", scope: !56, file: !56, line: 174, type: !103, isLocal: false, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !65}
!105 = !DILocalVariable(name: "s", arg: 1, scope: !102, file: !56, line: 174, type: !65)
!106 = !DILocation(line: 174, column: 17, scope: !102)
!107 = !DILocalVariable(name: "length", scope: !102, file: !56, line: 176, type: !52)
!108 = !DILocation(line: 176, column: 9, scope: !102)
!109 = !DILocation(line: 178, column: 12, scope: !102)
!110 = !DILocation(line: 178, column: 16, scope: !102)
!111 = !DILocation(line: 178, column: 3, scope: !102)
!112 = !DILocation(line: 178, column: 7, scope: !102)
!113 = !DILocation(line: 178, column: 9, scope: !102)
!114 = !DILocation(line: 179, column: 11, scope: !102)
!115 = !DILocation(line: 179, column: 14, scope: !102)
!116 = !DILocation(line: 179, column: 20, scope: !102)
!117 = !DILocation(line: 179, column: 23, scope: !102)
!118 = !DILocation(line: 179, column: 18, scope: !102)
!119 = !DILocation(line: 179, column: 9, scope: !102)
!120 = !DILocation(line: 181, column: 5, scope: !102)
!121 = !DILocation(line: 181, column: 9, scope: !102)
!122 = !DILocation(line: 181, column: 10, scope: !102)
!123 = !DILocation(line: 181, column: 14, scope: !102)
!124 = !DILocation(line: 182, column: 5, scope: !102)
!125 = !DILocation(line: 182, column: 9, scope: !102)
!126 = !DILocation(line: 182, column: 10, scope: !102)
!127 = !DILocation(line: 182, column: 14, scope: !102)
!128 = !DILocation(line: 183, column: 20, scope: !129)
!129 = distinct !DILexicalBlock(scope: !102, file: !56, line: 183, column: 2)
!130 = !DILocation(line: 183, column: 19, scope: !129)
!131 = !DILocation(line: 183, column: 28, scope: !129)
!132 = !DILocation(line: 183, column: 34, scope: !129)
!133 = !DILocation(line: 183, column: 18, scope: !129)
!134 = !DILocation(line: 183, column: 7, scope: !129)
!135 = !DILocation(line: 183, column: 11, scope: !129)
!136 = !DILocation(line: 183, column: 12, scope: !129)
!137 = !DILocation(line: 183, column: 16, scope: !129)
!138 = !DILocation(line: 183, column: 57, scope: !129)
!139 = !DILocation(line: 183, column: 56, scope: !129)
!140 = !DILocation(line: 183, column: 65, scope: !129)
!141 = !DILocation(line: 183, column: 45, scope: !129)
!142 = !DILocation(line: 183, column: 49, scope: !129)
!143 = !DILocation(line: 183, column: 50, scope: !129)
!144 = !DILocation(line: 183, column: 54, scope: !129)
!145 = !DILocation(line: 185, column: 5, scope: !102)
!146 = !DILocation(line: 185, column: 9, scope: !102)
!147 = !DILocation(line: 185, column: 10, scope: !102)
