; ModuleID = './[inter]cache.o.i'
source_filename = "./[inter]cache.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.bmpcache_entry = type { i8*, i16, i16 }
%struct._FONTGLYPH = type { i16, i16, i16, i16, i8* }
%struct._DATABLOB = type { i8*, i32 }
%struct._BRUSHDATA = type { i32, i32, i8* }

@g_bmpcache = internal global [3 x [2560 x %struct.bmpcache_entry]] zeroinitializer, align 16
@g_bmpcache_lru = internal global [3 x i32] [i32 -1, i32 -1, i32 -1], align 4
@g_bmpcache_mru = internal global [3 x i32] [i32 -1, i32 -1, i32 -1], align 4
@g_bmpcache_count = internal global [3 x i32] zeroinitializer, align 4
@.str = private unnamed_addr constant [88 x i8] c"cache_rebuild_bmpcache_linked_list(), %d in bitmap cache linked list, %d in ui cache...\00", align 1
@g_pstcache_fd = external global [0 x i32], align 4
@.str.1 = private unnamed_addr constant [44 x i8] c"cache_bump_bitmap(), id=%d, idx=%d, bump=%d\00", align 1
@.str.2 = private unnamed_addr constant [51 x i8] c"cache_evict_bitmap(), id=%d idx=%d n_idx=%d bmp=%p\00", align 1
@g_volatile_bc = internal global [3 x i8*] zeroinitializer, align 16
@.str.3 = private unnamed_addr constant [34 x i8] c"cache_get_bitmap(), id=%d, idx=%d\00", align 1
@.str.4 = private unnamed_addr constant [43 x i8] c"cache_put_bitmap(), failed, id=%d, idx=%d\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22, globals: !24)
!1 = !DIFile(filename: "[inter]cache.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!24 = !{!25, !40, !43, !46, !61, !69, !75, !80, !94, !95}
!25 = distinct !DIGlobalVariable(name: "g_bmpcache", scope: !0, file: !26, line: 48, type: !27, isLocal: true, isDefinition: true, variable: [3 x [2560 x %struct.bmpcache_entry]]* @g_bmpcache)
!26 = !DIFile(filename: "cache.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 983040, align: 64, elements: !37)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bmpcache_entry", file: !26, line: 41, size: 128, align: 64, elements: !29)
!29 = !{!30, !33, !36}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !28, file: !26, line: 43, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_HBITMAP", file: !32, line: 46, baseType: !23)
!32 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!33 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !28, file: !26, line: 44, baseType: !34, size: 16, align: 16, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "sint16", file: !32, line: 42, baseType: !35)
!35 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !28, file: !26, line: 45, baseType: !34, size: 16, align: 16, offset: 80)
!37 = !{!38, !39}
!38 = !DISubrange(count: 3)
!39 = !DISubrange(count: 2560)
!40 = distinct !DIGlobalVariable(name: "g_volatile_bc", scope: !0, file: !26, line: 49, type: !41, isLocal: true, isDefinition: true, variable: [3 x i8*]* @g_volatile_bc)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 192, align: 64, elements: !42)
!42 = !{!38}
!43 = distinct !DIGlobalVariable(name: "g_bmpcache_count", scope: !0, file: !26, line: 54, type: !44, isLocal: true, isDefinition: true, variable: [3 x i32]* @g_bmpcache_count)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 96, align: 32, elements: !42)
!45 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!46 = distinct !DIGlobalVariable(name: "g_fontcache", scope: !0, file: !26, line: 279, type: !47, isLocal: true, isDefinition: true, variable: [12 x [256 x %struct._FONTGLYPH]]* @g_fontcache)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 393216, align: 64, elements: !58)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "FONTGLYPH", file: !32, line: 130, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FONTGLYPH", file: !32, line: 121, size: 128, align: 64, elements: !50)
!50 = !{!51, !52, !53, !56, !57}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !49, file: !32, line: 123, baseType: !34, size: 16, align: 16)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "baseline", scope: !49, file: !32, line: 124, baseType: !34, size: 16, align: 16, offset: 16)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !49, file: !32, line: 125, baseType: !54, size: 16, align: 16, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !32, line: 41, baseType: !55)
!55 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !49, file: !32, line: 126, baseType: !54, size: 16, align: 16, offset: 48)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "pixmap", scope: !49, file: !32, line: 127, baseType: !31, size: 64, align: 64, offset: 64)
!58 = !{!59, !60}
!59 = !DISubrange(count: 12)
!60 = !DISubrange(count: 256)
!61 = distinct !DIGlobalVariable(name: "g_textcache", scope: !0, file: !26, line: 325, type: !62, isLocal: true, isDefinition: true, variable: [256 x %struct._DATABLOB]* @g_textcache)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 32768, align: 64, elements: !68)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "DATABLOB", file: !32, line: 138, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DATABLOB", file: !32, line: 132, size: 128, align: 64, elements: !65)
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !64, file: !32, line: 134, baseType: !23, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !64, file: !32, line: 135, baseType: !45, size: 32, align: 32, offset: 64)
!68 = !{!60}
!69 = distinct !DIGlobalVariable(name: "g_deskcache", scope: !0, file: !26, line: 353, type: !70, isLocal: true, isDefinition: true, variable: [921600 x i8]* @g_deskcache)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 7372800, align: 8, elements: !73)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !32, line: 39, baseType: !72)
!72 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!73 = !{!74}
!74 = !DISubrange(count: 921600)
!75 = distinct !DIGlobalVariable(name: "g_cursorcache", scope: !0, file: !26, line: 400, type: !76, isLocal: true, isDefinition: true, variable: [32 x i8*]* @g_cursorcache)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 2048, align: 64, elements: !78)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_HCURSOR", file: !32, line: 49, baseType: !23)
!78 = !{!79}
!79 = !DISubrange(count: 32)
!80 = distinct !DIGlobalVariable(name: "g_brushcache", scope: !0, file: !26, line: 441, type: !81, isLocal: true, isDefinition: true, variable: [2 x [64 x %struct._BRUSHDATA]]* @g_brushcache)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 16384, align: 64, elements: !91)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "BRUSHDATA", file: !32, line: 109, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_BRUSHDATA", file: !32, line: 103, size: 128, align: 64, elements: !84)
!84 = !{!85, !88, !89}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "colour_code", scope: !83, file: !32, line: 105, baseType: !86, size: 32, align: 32)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !32, line: 43, baseType: !87)
!87 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !83, file: !32, line: 106, baseType: !86, size: 32, align: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !83, file: !32, line: 107, baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!91 = !{!92, !93}
!92 = !DISubrange(count: 2)
!93 = !DISubrange(count: 64)
!94 = distinct !DIGlobalVariable(name: "g_bmpcache_lru", scope: !0, file: !26, line: 51, type: !44, isLocal: true, isDefinition: true, variable: [3 x i32]* @g_bmpcache_lru)
!95 = distinct !DIGlobalVariable(name: "g_bmpcache_mru", scope: !0, file: !26, line: 52, type: !44, isLocal: true, isDefinition: true, variable: [3 x i32]* @g_bmpcache_mru)
!96 = !{i32 2, !"Dwarf Version", i32 4}
!97 = !{i32 2, !"Debug Info Version", i32 3}
!98 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!99 = distinct !DISubprogram(name: "cache_rebuild_bmpcache_linked_list", scope: !26, file: !26, line: 58, type: !100, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !71, !102, !45}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!103 = !{}
!104 = !DILocalVariable(name: "id", arg: 1, scope: !99, file: !26, line: 58, type: !71)
!105 = !DIExpression()
!106 = !DILocation(line: 58, column: 42, scope: !99)
!107 = !DILocalVariable(name: "idx", arg: 2, scope: !99, file: !26, line: 58, type: !102)
!108 = !DILocation(line: 58, column: 55, scope: !99)
!109 = !DILocalVariable(name: "count", arg: 3, scope: !99, file: !26, line: 58, type: !45)
!110 = !DILocation(line: 58, column: 64, scope: !99)
!111 = !DILocalVariable(name: "n", scope: !99, file: !26, line: 60, type: !45)
!112 = !DILocation(line: 60, column: 6, scope: !99)
!113 = !DILocation(line: 60, column: 10, scope: !99)
!114 = !DILocalVariable(name: "c", scope: !99, file: !26, line: 60, type: !45)
!115 = !DILocation(line: 60, column: 17, scope: !99)
!116 = !DILocalVariable(name: "n_idx", scope: !99, file: !26, line: 61, type: !34)
!117 = !DILocation(line: 61, column: 9, scope: !99)
!118 = !DILocation(line: 64, column: 2, scope: !99)
!119 = !DILocation(line: 64, column: 9, scope: !120)
!120 = !DILexicalBlockFile(scope: !99, file: !26, discriminator: 1)
!121 = !DILocation(line: 64, column: 13, scope: !120)
!122 = !DILocation(line: 64, column: 18, scope: !120)
!123 = !DILocation(line: 64, column: 40, scope: !124)
!124 = !DILexicalBlockFile(scope: !99, file: !26, discriminator: 2)
!125 = !DILocation(line: 64, column: 36, scope: !124)
!126 = !DILocation(line: 64, column: 21, scope: !124)
!127 = !DILocation(line: 64, column: 32, scope: !124)
!128 = !DILocation(line: 64, column: 44, scope: !124)
!129 = !DILocation(line: 64, column: 51, scope: !124)
!130 = !DILocation(line: 64, column: 2, scope: !131)
!131 = !DILexicalBlockFile(scope: !99, file: !26, discriminator: 3)
!132 = !DILocation(line: 64, column: 2, scope: !133)
!133 = !DILexicalBlockFile(scope: !99, file: !26, discriminator: 4)
!134 = distinct !{!134, !118}
!135 = !DILocation(line: 65, column: 6, scope: !136)
!136 = distinct !DILexicalBlock(scope: !99, file: !26, line: 65, column: 6)
!137 = !DILocation(line: 65, column: 8, scope: !136)
!138 = !DILocation(line: 65, column: 6, scope: !99)
!139 = !DILocation(line: 67, column: 39, scope: !140)
!140 = distinct !DILexicalBlock(scope: !136, file: !26, line: 66, column: 2)
!141 = !DILocation(line: 67, column: 24, scope: !140)
!142 = !DILocation(line: 67, column: 43, scope: !140)
!143 = !DILocation(line: 67, column: 18, scope: !140)
!144 = !DILocation(line: 67, column: 3, scope: !140)
!145 = !DILocation(line: 67, column: 22, scope: !140)
!146 = !DILocation(line: 68, column: 3, scope: !140)
!147 = !DILocation(line: 71, column: 27, scope: !99)
!148 = !DILocation(line: 71, column: 23, scope: !99)
!149 = !DILocation(line: 71, column: 17, scope: !99)
!150 = !DILocation(line: 71, column: 2, scope: !99)
!151 = !DILocation(line: 71, column: 21, scope: !99)
