; ModuleID = './[inter]serial.o.i'
source_filename = "./[inter]serial.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.rdpdr_device_info = type { i32, i32, [8 x i8], i8*, i8* }
%struct._DEVICE_FNS = type { i32 (i32, i32, i32, i32, i32, i8*, i32*)*, i32 (i32)*, i32 (i32, i8*, i32, i32, i32*)*, i32 (i32, i8*, i32, i32, i32*)*, i32 (i32, i32, %struct.stream*, %struct.stream*)* }
%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.rdpdr_serial_device_info = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, i8, i8, [6 x i8], %struct.termios*, %struct.termios*, i32, i32, i32, i32, i32 }
%struct.termios = type { i32, i32, i32, i32, i8, [32 x i8], i32, i32 }

@g_rdpdr_device = external global [0 x %struct.rdpdr_device_info], align 8
@.str = private unnamed_addr constant [32 x i8] c"serial_enum_devices(), %s to %s\00", align 1
@.str.1 = private unnamed_addr constant [29 x i8] c"serial_get_event(), %d bytes\00", align 1
@.str.2 = private unnamed_addr constant [42 x i8] c"serial_get_event(), SERIAL_EV_RLSD is set\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22, globals: !83)
!1 = !DIFile(filename: "[inter]serial.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !{!23, !57, !81, !82}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERIAL_DEVICE", file: !25, line: 260, baseType: !26)
!25 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rdpdr_serial_device_info", file: !25, line: 242, size: 960, align: 64, elements: !27)
!27 = !{!28, !30, !31, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !50, !51, !52, !56, !75, !76, !77, !78, !79, !80}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "dtr", scope: !26, file: !25, line: 244, baseType: !29, size: 32, align: 32)
!29 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "rts", scope: !26, file: !25, line: 245, baseType: !29, size: 32, align: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !26, file: !25, line: 246, baseType: !32, size: 32, align: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !25, line: 43, baseType: !33)
!33 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "xonoff", scope: !26, file: !25, line: 246, baseType: !32, size: 32, align: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "onlimit", scope: !26, file: !25, line: 246, baseType: !32, size: 32, align: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "offlimit", scope: !26, file: !25, line: 246, baseType: !32, size: 32, align: 32, offset: 160)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "baud_rate", scope: !26, file: !25, line: 247, baseType: !32, size: 32, align: 32, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "queue_in_size", scope: !26, file: !25, line: 248, baseType: !32, size: 32, align: 32, offset: 224)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "queue_out_size", scope: !26, file: !25, line: 249, baseType: !32, size: 32, align: 32, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "wait_mask", scope: !26, file: !25, line: 250, baseType: !32, size: 32, align: 32, offset: 288)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "read_interval_timeout", scope: !26, file: !25, line: 251, baseType: !32, size: 32, align: 32, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "read_total_timeout_multiplier", scope: !26, file: !25, line: 252, baseType: !32, size: 32, align: 32, offset: 352)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "read_total_timeout_constant", scope: !26, file: !25, line: 253, baseType: !32, size: 32, align: 32, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "write_total_timeout_multiplier", scope: !26, file: !25, line: 254, baseType: !32, size: 32, align: 32, offset: 416)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "write_total_timeout_constant", scope: !26, file: !25, line: 254, baseType: !32, size: 32, align: 32, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "posix_wait_mask", scope: !26, file: !25, line: 254, baseType: !32, size: 32, align: 32, offset: 480)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !26, file: !25, line: 255, baseType: !48, size: 8, align: 8, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !25, line: 39, baseType: !49)
!49 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !26, file: !25, line: 255, baseType: !48, size: 8, align: 8, offset: 520)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !26, file: !25, line: 255, baseType: !48, size: 8, align: 8, offset: 528)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !26, file: !25, line: 256, baseType: !53, size: 48, align: 8, offset: 536)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 48, align: 8, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 6)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ptermios", scope: !26, file: !25, line: 257, baseType: !57, size: 64, align: 64, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "termios", file: !59, line: 28, size: 480, align: 32, elements: !60)
!59 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/termios.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!60 = !{!61, !63, !64, !65, !66, !68, !72, !74}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "c_iflag", scope: !58, file: !59, line: 30, baseType: !62, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcflag_t", file: !59, line: 25, baseType: !33)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "c_oflag", scope: !58, file: !59, line: 31, baseType: !62, size: 32, align: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "c_cflag", scope: !58, file: !59, line: 32, baseType: !62, size: 32, align: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "c_lflag", scope: !58, file: !59, line: 33, baseType: !62, size: 32, align: 32, offset: 96)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "c_line", scope: !58, file: !59, line: 34, baseType: !67, size: 8, align: 8, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "cc_t", file: !59, line: 23, baseType: !49)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "c_cc", scope: !58, file: !59, line: 35, baseType: !69, size: 256, align: 8, offset: 136)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 256, align: 8, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "c_ispeed", scope: !58, file: !59, line: 36, baseType: !73, size: 32, align: 32, offset: 416)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "speed_t", file: !59, line: 24, baseType: !33)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "c_ospeed", scope: !58, file: !59, line: 37, baseType: !73, size: 32, align: 32, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "pold_termios", scope: !26, file: !25, line: 257, baseType: !57, size: 64, align: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "event_txempty", scope: !26, file: !25, line: 258, baseType: !29, size: 32, align: 32, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "event_cts", scope: !26, file: !25, line: 258, baseType: !29, size: 32, align: 32, offset: 800)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "event_dsr", scope: !26, file: !25, line: 258, baseType: !29, size: 32, align: 32, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "event_rlsd", scope: !26, file: !25, line: 258, baseType: !29, size: 32, align: 32, offset: 864)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "event_pending", scope: !26, file: !25, line: 258, baseType: !29, size: 32, align: 32, offset: 896)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!83 = !{!84}
!84 = distinct !DIGlobalVariable(name: "serial_fns", scope: !0, file: !85, line: 1085, type: !86, isLocal: false, isDefinition: true, variable: %struct._DEVICE_FNS* @serial_fns)
!85 = !DIFile(filename: "serial.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEVICE_FNS", file: !25, line: 223, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DEVICE_FNS", file: !25, line: 211, size: 320, align: 64, elements: !88)
!88 = !{!89, !98, !102, !107, !108}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !87, file: !25, line: 213, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!93, !32, !32, !32, !32, !32, !94, !96}
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_NTSTATUS", file: !25, line: 208, baseType: !32)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_NTHANDLE", file: !25, line: 209, baseType: !32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !87, file: !25, line: 216, baseType: !99, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!93, !97}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !87, file: !25, line: 217, baseType: !103, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!93, !97, !106, !32, !32, !82}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !87, file: !25, line: 219, baseType: !103, size: 64, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "device_control", scope: !87, file: !25, line: 221, baseType: !109, size: 64, align: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!93, !97, !32, !112, !112}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !113, line: 40, baseType: !114)
!113 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !113, line: 25, size: 576, align: 64, elements: !116)
!116 = !{!117, !119, !120, !121, !122, !123, !124, !125, !126}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !115, file: !113, line: 27, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !115, file: !113, line: 28, baseType: !118, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !115, file: !113, line: 29, baseType: !118, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !115, file: !113, line: 30, baseType: !33, size: 32, align: 32, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !115, file: !113, line: 33, baseType: !118, size: 64, align: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !115, file: !113, line: 34, baseType: !118, size: 64, align: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !115, file: !113, line: 35, baseType: !118, size: 64, align: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !115, file: !113, line: 36, baseType: !118, size: 64, align: 64, offset: 448)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !115, file: !113, line: 37, baseType: !118, size: 64, align: 64, offset: 512)
!127 = !{i32 2, !"Dwarf Version", i32 4}
!128 = !{i32 2, !"Debug Info Version", i32 3}
!129 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!130 = distinct !DISubprogram(name: "serial_enum_devices", scope: !85, file: !85, line: 510, type: !131, isLocal: false, isDefinition: true, scopeLine: 511, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!131 = !DISubroutineType(types: !132)
!132 = !{!29, !82, !94}
!133 = !{}
!134 = !DILocalVariable(name: "id", arg: 1, scope: !130, file: !85, line: 510, type: !82)
!135 = !DIExpression()
!136 = !DILocation(line: 510, column: 30, scope: !130)
!137 = !DILocalVariable(name: "optarg", arg: 2, scope: !130, file: !85, line: 510, type: !94)
!138 = !DILocation(line: 510, column: 40, scope: !130)
!139 = !DILocalVariable(name: "pser_inf", scope: !130, file: !85, line: 512, type: !23)
!140 = !DILocation(line: 512, column: 17, scope: !130)
!141 = !DILocalVariable(name: "pos", scope: !130, file: !85, line: 514, type: !94)
!142 = !DILocation(line: 514, column: 8, scope: !130)
!143 = !DILocation(line: 514, column: 14, scope: !130)
!144 = !DILocalVariable(name: "pos2", scope: !130, file: !85, line: 515, type: !94)
!145 = !DILocation(line: 515, column: 8, scope: !130)
!146 = !DILocalVariable(name: "count", scope: !130, file: !85, line: 516, type: !29)
!147 = !DILocation(line: 516, column: 6, scope: !130)
!148 = !DILocation(line: 519, column: 8, scope: !130)
!149 = !DILocation(line: 520, column: 2, scope: !130)
!150 = !DILocation(line: 520, column: 25, scope: !151)
!151 = !DILexicalBlockFile(scope: !130, file: !85, discriminator: 1)
!152 = !DILocation(line: 520, column: 16, scope: !151)
!153 = !DILocation(line: 520, column: 14, scope: !151)
!154 = !DILocation(line: 520, column: 39, scope: !151)
!155 = !DILocation(line: 520, column: 43, scope: !156)
!156 = !DILexicalBlockFile(scope: !130, file: !85, discriminator: 2)
!157 = !DILocation(line: 520, column: 42, scope: !156)
!158 = !DILocation(line: 520, column: 46, scope: !156)
!159 = !DILocation(line: 520, column: 2, scope: !160)
!160 = !DILexicalBlockFile(scope: !130, file: !85, discriminator: 3)
!161 = !DILocation(line: 523, column: 32, scope: !162)
!162 = distinct !DILexicalBlock(scope: !130, file: !85, line: 521, column: 2)
!163 = !DILocation(line: 523, column: 14, scope: !162)
!164 = !DILocation(line: 523, column: 12, scope: !162)
!165 = !DILocation(line: 524, column: 43, scope: !162)
!166 = !DILocation(line: 524, column: 24, scope: !162)
!167 = !DILocation(line: 524, column: 3, scope: !162)
!168 = !DILocation(line: 524, column: 13, scope: !162)
!169 = !DILocation(line: 524, column: 22, scope: !162)
!170 = !DILocation(line: 525, column: 10, scope: !162)
!171 = !DILocation(line: 525, column: 20, scope: !162)
!172 = !DILocation(line: 525, column: 3, scope: !162)
!173 = !DILocation(line: 526, column: 47, scope: !162)
!174 = !DILocation(line: 526, column: 28, scope: !162)
!175 = !DILocation(line: 526, column: 3, scope: !162)
!176 = !DILocation(line: 526, column: 13, scope: !162)
!177 = !DILocation(line: 526, column: 26, scope: !162)
!178 = !DILocation(line: 527, column: 10, scope: !162)
!179 = !DILocation(line: 527, column: 20, scope: !162)
!180 = !DILocation(line: 527, column: 3, scope: !162)
!181 = !DILocation(line: 529, column: 19, scope: !162)
!182 = !DILocation(line: 529, column: 10, scope: !162)
!183 = !DILocation(line: 529, column: 8, scope: !162)
!184 = !DILocation(line: 530, column: 26, scope: !162)
!185 = !DILocation(line: 530, column: 25, scope: !162)
!186 = !DILocation(line: 530, column: 10, scope: !162)
!187 = !DILocation(line: 530, column: 30, scope: !162)
!188 = !DILocation(line: 530, column: 36, scope: !162)
!189 = !DILocation(line: 530, column: 3, scope: !162)
!190 = !DILocation(line: 532, column: 31, scope: !162)
!191 = !DILocation(line: 532, column: 30, scope: !162)
