; ModuleID = './[inter]orders.o.i'
source_filename = "./[inter]orders.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._RDP_ORDER_STATE = type { i8, %struct._BOUNDS, %struct._DESTBLT_ORDER, %struct._PATBLT_ORDER, %struct._SCREENBLT_ORDER, %struct._LINE_ORDER, %struct._RECT_ORDER, %struct._DESKSAVE_ORDER, %struct._MEMBLT_ORDER, %struct._TRIBLT_ORDER, %struct._POLYGON_ORDER, %struct._POLYGON2_ORDER, %struct._POLYLINE_ORDER, %struct._ELLIPSE_ORDER, %struct._ELLIPSE2_ORDER, %struct._TEXT2_ORDER }
%struct._BOUNDS = type { i16, i16, i16, i16 }
%struct._DESTBLT_ORDER = type { i16, i16, i16, i16, i8 }
%struct._PATBLT_ORDER = type { i16, i16, i16, i16, i8, i32, i32, %struct._BRUSH }
%struct._BRUSH = type { i8, i8, i8, [8 x i8], %struct._BRUSHDATA* }
%struct._BRUSHDATA = type { i32, i32, i8* }
%struct._SCREENBLT_ORDER = type { i16, i16, i16, i16, i8, i16, i16 }
%struct._LINE_ORDER = type { i16, i16, i16, i16, i16, i32, i8, %struct._PEN }
%struct._PEN = type { i8, i8, i32 }
%struct._RECT_ORDER = type { i16, i16, i16, i16, i32 }
%struct._DESKSAVE_ORDER = type { i32, i16, i16, i16, i16, i8 }
%struct._MEMBLT_ORDER = type { i8, i8, i16, i16, i16, i16, i8, i16, i16, i16 }
%struct._TRIBLT_ORDER = type { i8, i8, i16, i16, i16, i16, i8, i16, i16, i32, i32, %struct._BRUSH, i16, i16 }
%struct._POLYGON_ORDER = type { i16, i16, i8, i8, i32, i8, i8, [256 x i8] }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !45, globals: !71)
!1 = !DIFile(filename: "[inter]orders.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15, !22, !39}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RDP_ORDER_TYPE", file: !23, line: 29, size: 32, align: 32, elements: !24)
!23 = !DIFile(filename: "orders.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!25 = !DIEnumerator(name: "RDP_ORDER_DESTBLT", value: 0)
!26 = !DIEnumerator(name: "RDP_ORDER_PATBLT", value: 1)
!27 = !DIEnumerator(name: "RDP_ORDER_SCREENBLT", value: 2)
!28 = !DIEnumerator(name: "RDP_ORDER_LINE", value: 9)
!29 = !DIEnumerator(name: "RDP_ORDER_RECT", value: 10)
!30 = !DIEnumerator(name: "RDP_ORDER_DESKSAVE", value: 11)
!31 = !DIEnumerator(name: "RDP_ORDER_MEMBLT", value: 13)
!32 = !DIEnumerator(name: "RDP_ORDER_TRIBLT", value: 14)
!33 = !DIEnumerator(name: "RDP_ORDER_POLYGON", value: 20)
!34 = !DIEnumerator(name: "RDP_ORDER_POLYGON2", value: 21)
!35 = !DIEnumerator(name: "RDP_ORDER_POLYLINE", value: 22)
!36 = !DIEnumerator(name: "RDP_ORDER_ELLIPSE", value: 25)
!37 = !DIEnumerator(name: "RDP_ORDER_ELLIPSE2", value: 26)
!38 = !DIEnumerator(name: "RDP_ORDER_TEXT2", value: 27)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_RDP_VERSION", file: !40, line: 52, size: 32, align: 32, elements: !41)
!40 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!41 = !{!42, !43, !44}
!42 = !DIEnumerator(name: "RDP_V4", value: 4)
!43 = !DIEnumerator(name: "RDP_V5", value: 5)
!44 = !DIEnumerator(name: "RDP_V6", value: 6)
!45 = !{!46, !49, !51, !54, !61, !62, !65}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !40, line: 41, baseType: !48)
!48 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "sint16", file: !40, line: 42, baseType: !50)
!50 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !40, line: 39, baseType: !53)
!53 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOURENTRY", file: !40, line: 73, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_COLOURENTRY", file: !40, line: 66, size: 24, align: 8, elements: !57)
!57 = !{!58, !59, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !56, file: !40, line: 68, baseType: !52, size: 8, align: 8)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !56, file: !40, line: 69, baseType: !52, size: 8, align: 8, offset: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !56, file: !40, line: 70, baseType: !52, size: 8, align: 8, offset: 16)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !40, line: 43, baseType: !64)
!64 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_POINT", file: !40, line: 64, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RD_POINT", file: !40, line: 60, size: 32, align: 16, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !67, file: !40, line: 62, baseType: !49, size: 16, align: 16)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !67, file: !40, line: 62, baseType: !49, size: 16, align: 16, offset: 16)
!71 = !{!72}
!72 = distinct !DIGlobalVariable(name: "g_order_state", scope: !0, file: !73, line: 24, type: !74, isLocal: true, isDefinition: true, variable: %struct._RDP_ORDER_STATE* @g_order_state)
!73 = !DIFile(filename: "orders.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDP_ORDER_STATE", file: !23, line: 290, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RDP_ORDER_STATE", file: !23, line: 269, size: 11648, align: 64, elements: !76)
!76 = !{!77, !78, !86, !95, !125, !136, !154, !163, !173, !187, !205, !220, !234, !245, !256, !269}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "order_type", scope: !75, file: !23, line: 271, baseType: !52, size: 8, align: 8)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !75, file: !23, line: 272, baseType: !79, size: 64, align: 16, offset: 16)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOUNDS", file: !40, line: 91, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_BOUNDS", file: !40, line: 83, size: 64, align: 16, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !80, file: !40, line: 85, baseType: !49, size: 16, align: 16)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !80, file: !40, line: 86, baseType: !49, size: 16, align: 16, offset: 16)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !80, file: !40, line: 87, baseType: !49, size: 16, align: 16, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !80, file: !40, line: 88, baseType: !49, size: 16, align: 16, offset: 48)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "destblt", scope: !75, file: !23, line: 274, baseType: !87, size: 80, align: 16, offset: 80)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTBLT_ORDER", file: !23, line: 67, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DESTBLT_ORDER", file: !23, line: 58, size: 80, align: 16, elements: !89)
!89 = !{!90, !91, !92, !93, !94}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !88, file: !23, line: 60, baseType: !49, size: 16, align: 16)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !88, file: !23, line: 61, baseType: !49, size: 16, align: 16, offset: 16)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !88, file: !23, line: 62, baseType: !49, size: 16, align: 16, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "cy", scope: !88, file: !23, line: 63, baseType: !49, size: 16, align: 16, offset: 48)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !88, file: !23, line: 64, baseType: !52, size: 8, align: 8, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "patblt", scope: !75, file: !23, line: 275, baseType: !96, size: 384, align: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "PATBLT_ORDER", file: !23, line: 81, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PATBLT_ORDER", file: !23, line: 69, size: 384, align: 64, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !97, file: !23, line: 71, baseType: !49, size: 16, align: 16)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !97, file: !23, line: 72, baseType: !49, size: 16, align: 16, offset: 16)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !97, file: !23, line: 73, baseType: !49, size: 16, align: 16, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "cy", scope: !97, file: !23, line: 74, baseType: !49, size: 16, align: 16, offset: 48)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !97, file: !23, line: 75, baseType: !52, size: 8, align: 8, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "bgcolour", scope: !97, file: !23, line: 76, baseType: !63, size: 32, align: 32, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "fgcolour", scope: !97, file: !23, line: 77, baseType: !63, size: 32, align: 32, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !97, file: !23, line: 78, baseType: !107, size: 192, align: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "BRUSH", file: !40, line: 119, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_BRUSH", file: !40, line: 111, size: 192, align: 64, elements: !109)
!109 = !{!110, !111, !112, !113, !117}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "xorigin", scope: !108, file: !40, line: 113, baseType: !52, size: 8, align: 8)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "yorigin", scope: !108, file: !40, line: 114, baseType: !52, size: 8, align: 8, offset: 8)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !108, file: !40, line: 115, baseType: !52, size: 8, align: 8, offset: 16)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !108, file: !40, line: 116, baseType: !114, size: 64, align: 8, offset: 24)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 64, align: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 8)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "bd", scope: !108, file: !40, line: 117, baseType: !118, size: 64, align: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "BRUSHDATA", file: !40, line: 109, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_BRUSHDATA", file: !40, line: 103, size: 128, align: 64, elements: !121)
!121 = !{!122, !123, !124}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "colour_code", scope: !120, file: !40, line: 105, baseType: !63, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !120, file: !40, line: 106, baseType: !63, size: 32, align: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !120, file: !40, line: 107, baseType: !51, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "screenblt", scope: !75, file: !23, line: 276, baseType: !126, size: 112, align: 16, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCREENBLT_ORDER", file: !23, line: 94, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SCREENBLT_ORDER", file: !23, line: 83, size: 112, align: 16, elements: !128)
!128 = !{!129, !130, !131, !132, !133, !134, !135}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !127, file: !23, line: 85, baseType: !49, size: 16, align: 16)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !127, file: !23, line: 86, baseType: !49, size: 16, align: 16, offset: 16)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !127, file: !23, line: 87, baseType: !49, size: 16, align: 16, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "cy", scope: !127, file: !23, line: 88, baseType: !49, size: 16, align: 16, offset: 48)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !127, file: !23, line: 89, baseType: !52, size: 8, align: 8, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "srcx", scope: !127, file: !23, line: 90, baseType: !49, size: 16, align: 16, offset: 80)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "srcy", scope: !127, file: !23, line: 91, baseType: !49, size: 16, align: 16, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !75, file: !23, line: 277, baseType: !137, size: 224, align: 32, offset: 704)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINE_ORDER", file: !23, line: 108, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LINE_ORDER", file: !23, line: 96, size: 224, align: 32, elements: !139)
!139 = !{!140, !141, !142, !143, !144, !145, !146, !147}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mixmode", scope: !138, file: !23, line: 98, baseType: !47, size: 16, align: 16)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "startx", scope: !138, file: !23, line: 99, baseType: !49, size: 16, align: 16, offset: 16)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "starty", scope: !138, file: !23, line: 100, baseType: !49, size: 16, align: 16, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "endx", scope: !138, file: !23, line: 101, baseType: !49, size: 16, align: 16, offset: 48)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "endy", scope: !138, file: !23, line: 102, baseType: !49, size: 16, align: 16, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "bgcolour", scope: !138, file: !23, line: 103, baseType: !63, size: 32, align: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !138, file: !23, line: 104, baseType: !52, size: 8, align: 8, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !138, file: !23, line: 105, baseType: !148, size: 64, align: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "PEN", file: !40, line: 100, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PEN", file: !40, line: 93, size: 64, align: 32, elements: !150)
!150 = !{!151, !152, !153}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !149, file: !40, line: 95, baseType: !52, size: 8, align: 8)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !149, file: !40, line: 96, baseType: !52, size: 8, align: 8, offset: 8)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !149, file: !40, line: 97, baseType: !63, size: 32, align: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !75, file: !23, line: 278, baseType: !155, size: 96, align: 32, offset: 928)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "RECT_ORDER", file: !23, line: 119, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RECT_ORDER", file: !23, line: 110, size: 96, align: 32, elements: !157)
!157 = !{!158, !159, !160, !161, !162}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !156, file: !23, line: 112, baseType: !49, size: 16, align: 16)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !156, file: !23, line: 113, baseType: !49, size: 16, align: 16, offset: 16)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !156, file: !23, line: 114, baseType: !49, size: 16, align: 16, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "cy", scope: !156, file: !23, line: 115, baseType: !49, size: 16, align: 16, offset: 48)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !156, file: !23, line: 116, baseType: !63, size: 32, align: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "desksave", scope: !75, file: !23, line: 279, baseType: !164, size: 128, align: 32, offset: 1024)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESKSAVE_ORDER", file: !23, line: 131, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DESKSAVE_ORDER", file: !23, line: 121, size: 128, align: 32, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !172}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !165, file: !23, line: 123, baseType: !63, size: 32, align: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !165, file: !23, line: 124, baseType: !49, size: 16, align: 16, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !165, file: !23, line: 125, baseType: !49, size: 16, align: 16, offset: 48)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !165, file: !23, line: 126, baseType: !49, size: 16, align: 16, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !165, file: !23, line: 127, baseType: !49, size: 16, align: 16, offset: 80)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !165, file: !23, line: 128, baseType: !52, size: 8, align: 8, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "memblt", scope: !75, file: !23, line: 280, baseType: !174, size: 144, align: 16, offset: 1152)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEMBLT_ORDER", file: !23, line: 167, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MEMBLT_ORDER", file: !23, line: 153, size: 144, align: 16, elements: !176)
!176 = !{!177, !178, !179, !180, !181, !182, !183, !184, !185, !186}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "colour_table", scope: !175, file: !23, line: 155, baseType: !52, size: 8, align: 8)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "cache_id", scope: !175, file: !23, line: 156, baseType: !52, size: 8, align: 8, offset: 8)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !175, file: !23, line: 157, baseType: !49, size: 16, align: 16, offset: 16)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !175, file: !23, line: 158, baseType: !49, size: 16, align: 16, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !175, file: !23, line: 159, baseType: !49, size: 16, align: 16, offset: 48)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "cy", scope: !175, file: !23, line: 160, baseType: !49, size: 16, align: 16, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !175, file: !23, line: 161, baseType: !52, size: 8, align: 8, offset: 80)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "srcx", scope: !175, file: !23, line: 162, baseType: !49, size: 16, align: 16, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "srcy", scope: !175, file: !23, line: 163, baseType: !49, size: 16, align: 16, offset: 112)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "cache_idx", scope: !175, file: !23, line: 164, baseType: !47, size: 16, align: 16, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "triblt", scope: !75, file: !23, line: 281, baseType: !188, size: 448, align: 64, offset: 1344)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRIBLT_ORDER", file: !23, line: 151, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TRIBLT_ORDER", file: !23, line: 133, size: 448, align: 64, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "colour_table", scope: !189, file: !23, line: 135, baseType: !52, size: 8, align: 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "cache_id", scope: !189, file: !23, line: 136, baseType: !52, size: 8, align: 8, offset: 8)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !189, file: !23, line: 137, baseType: !49, size: 16, align: 16, offset: 16)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !189, file: !23, line: 138, baseType: !49, size: 16, align: 16, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !189, file: !23, line: 139, baseType: !49, size: 16, align: 16, offset: 48)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cy", scope: !189, file: !23, line: 140, baseType: !49, size: 16, align: 16, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !189, file: !23, line: 141, baseType: !52, size: 8, align: 8, offset: 80)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "srcx", scope: !189, file: !23, line: 142, baseType: !49, size: 16, align: 16, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "srcy", scope: !189, file: !23, line: 143, baseType: !49, size: 16, align: 16, offset: 112)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "bgcolour", scope: !189, file: !23, line: 144, baseType: !63, size: 32, align: 32, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fgcolour", scope: !189, file: !23, line: 145, baseType: !63, size: 32, align: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !189, file: !23, line: 146, baseType: !107, size: 192, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "cache_idx", scope: !189, file: !23, line: 147, baseType: !47, size: 16, align: 16, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "unknown", scope: !189, file: !23, line: 148, baseType: !47, size: 16, align: 16, offset: 400)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "polygon", scope: !75, file: !23, line: 282, baseType: !206, size: 2176, align: 32, offset: 1792)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "POLYGON_ORDER", file: !23, line: 183, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_POLYGON_ORDER", file: !23, line: 171, size: 2176, align: 32, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !207, file: !23, line: 173, baseType: !49, size: 16, align: 16)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !207, file: !23, line: 174, baseType: !49, size: 16, align: 16, offset: 16)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !207, file: !23, line: 175, baseType: !52, size: 8, align: 8, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "fillmode", scope: !207, file: !23, line: 176, baseType: !52, size: 8, align: 8, offset: 40)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "fgcolour", scope: !207, file: !23, line: 177, baseType: !63, size: 32, align: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "npoints", scope: !207, file: !23, line: 178, baseType: !52, size: 8, align: 8, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "datasize", scope: !207, file: !23, line: 179, baseType: !52, size: 8, align: 8, offset: 104)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !23, line: 180, baseType: !217, size: 2048, align: 8, offset: 112)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 2048, align: 8, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "polygon2", scope: !75, file: !23, line: 283, baseType: !221, size: 2432, align: 64, offset: 3968)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "POLYGON2_ORDER", file: !23, line: 199, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_POLYGON2_ORDER", file: !23, line: 185, size: 2432, align: 64, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232, !233}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !222, file: !23, line: 187, baseType: !49, size: 16, align: 16)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !222, file: !23, line: 188, baseType: !49, size: 16, align: 16, offset: 16)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !222, file: !23, line: 189, baseType: !52, size: 8, align: 8, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "fillmode", scope: !222, file: !23, line: 190, baseType: !52, size: 8, align: 8, offset: 40)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bgcolour", scope: !222, file: !23, line: 191, baseType: !63, size: 32, align: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "fgcolour", scope: !222, file: !23, line: 192, baseType: !63, size: 32, align: 32, offset: 96)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !222, file: !23, line: 193, baseType: !107, size: 192, align: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "npoints", scope: !222, file: !23, line: 194, baseType: !52, size: 8, align: 8, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "datasize", scope: !222, file: !23, line: 195, baseType: !52, size: 8, align: 8, offset: 328)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !222, file: !23, line: 196, baseType: !217, size: 2048, align: 8, offset: 336)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "polyline", scope: !75, file: !23, line: 284, baseType: !235, size: 2176, align: 32, offset: 6400)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "POLYLINE_ORDER", file: !23, line: 212, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_POLYLINE_ORDER", file: !23, line: 201, size: 2176, align: 32, elements: !237)
!237 = !{!238, !239, !240, !241, !242, !243, !244}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !236, file: !23, line: 203, baseType: !49, size: 16, align: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !236, file: !23, line: 204, baseType: !49, size: 16, align: 16, offset: 16)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !236, file: !23, line: 205, baseType: !52, size: 8, align: 8, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fgcolour", scope: !236, file: !23, line: 206, baseType: !63, size: 32, align: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !236, file: !23, line: 207, baseType: !52, size: 8, align: 8, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "datasize", scope: !236, file: !23, line: 208, baseType: !52, size: 8, align: 8, offset: 104)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !236, file: !23, line: 209, baseType: !217, size: 2048, align: 8, offset: 112)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse", scope: !75, file: !23, line: 285, baseType: !246, size: 128, align: 32, offset: 8576)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "ELLIPSE_ORDER", file: !23, line: 225, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ELLIPSE_ORDER", file: !23, line: 214, size: 128, align: 32, elements: !248)
!248 = !{!249, !250, !251, !252, !253, !254, !255}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !247, file: !23, line: 216, baseType: !49, size: 16, align: 16)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !247, file: !23, line: 217, baseType: !49, size: 16, align: 16, offset: 16)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !247, file: !23, line: 218, baseType: !49, size: 16, align: 16, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !247, file: !23, line: 219, baseType: !49, size: 16, align: 16, offset: 48)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !247, file: !23, line: 220, baseType: !52, size: 8, align: 8, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "fillmode", scope: !247, file: !23, line: 221, baseType: !52, size: 8, align: 8, offset: 72)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fgcolour", scope: !247, file: !23, line: 222, baseType: !63, size: 32, align: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse2", scope: !75, file: !23, line: 286, baseType: !257, size: 384, align: 64, offset: 8704)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "ELLIPSE2_ORDER", file: !23, line: 240, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ELLIPSE2_ORDER", file: !23, line: 227, size: 384, align: 64, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !268}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !258, file: !23, line: 229, baseType: !49, size: 16, align: 16)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !258, file: !23, line: 230, baseType: !49, size: 16, align: 16, offset: 16)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !258, file: !23, line: 231, baseType: !49, size: 16, align: 16, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !258, file: !23, line: 232, baseType: !49, size: 16, align: 16, offset: 48)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !258, file: !23, line: 233, baseType: !52, size: 8, align: 8, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "fillmode", scope: !258, file: !23, line: 234, baseType: !52, size: 8, align: 8, offset: 72)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !258, file: !23, line: 235, baseType: !107, size: 192, align: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "bgcolour", scope: !258, file: !23, line: 236, baseType: !63, size: 32, align: 32, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "fgcolour", scope: !258, file: !23, line: 237, baseType: !63, size: 32, align: 32, offset: 352)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "text2", scope: !75, file: !23, line: 287, baseType: !270, size: 2560, align: 64, offset: 9088)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT2_ORDER", file: !23, line: 267, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TEXT2_ORDER", file: !23, line: 244, size: 2560, align: 64, elements: !272)
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !271, file: !23, line: 246, baseType: !52, size: 8, align: 8)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !271, file: !23, line: 247, baseType: !52, size: 8, align: 8, offset: 8)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !271, file: !23, line: 248, baseType: !52, size: 8, align: 8, offset: 16)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "mixmode", scope: !271, file: !23, line: 249, baseType: !52, size: 8, align: 8, offset: 24)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "bgcolour", scope: !271, file: !23, line: 250, baseType: !63, size: 32, align: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "fgcolour", scope: !271, file: !23, line: 251, baseType: !63, size: 32, align: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "clipleft", scope: !271, file: !23, line: 252, baseType: !49, size: 16, align: 16, offset: 96)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "cliptop", scope: !271, file: !23, line: 253, baseType: !49, size: 16, align: 16, offset: 112)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "clipright", scope: !271, file: !23, line: 254, baseType: !49, size: 16, align: 16, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "clipbottom", scope: !271, file: !23, line: 255, baseType: !49, size: 16, align: 16, offset: 144)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "boxleft", scope: !271, file: !23, line: 256, baseType: !49, size: 16, align: 16, offset: 160)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "boxtop", scope: !271, file: !23, line: 257, baseType: !49, size: 16, align: 16, offset: 176)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "boxright", scope: !271, file: !23, line: 258, baseType: !49, size: 16, align: 16, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "boxbottom", scope: !271, file: !23, line: 259, baseType: !49, size: 16, align: 16, offset: 208)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !271, file: !23, line: 260, baseType: !107, size: 192, align: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !271, file: !23, line: 261, baseType: !49, size: 16, align: 16, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !271, file: !23, line: 262, baseType: !49, size: 16, align: 16, offset: 464)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !271, file: !23, line: 263, baseType: !52, size: 8, align: 8, offset: 480)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !271, file: !23, line: 264, baseType: !217, size: 2048, align: 8, offset: 488)
!292 = !{i32 2, !"Dwarf Version", i32 4}
!293 = !{i32 2, !"Debug Info Version", i32 3}
!294 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!295 = distinct !DISubprogram(name: "process_orders", scope: !73, file: !73, line: 1309, type: !296, isLocal: false, isDefinition: true, scopeLine: 1310, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !298, !47}
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !299, line: 40, baseType: !300)
!299 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !299, line: 25, size: 576, align: 64, elements: !302)
!302 = !{!303, !305, !306, !307, !308, !309, !310, !311, !312}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !301, file: !299, line: 27, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !301, file: !299, line: 28, baseType: !304, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !301, file: !299, line: 29, baseType: !304, size: 64, align: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !301, file: !299, line: 30, baseType: !64, size: 32, align: 32, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !301, file: !299, line: 33, baseType: !304, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !301, file: !299, line: 34, baseType: !304, size: 64, align: 64, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !301, file: !299, line: 35, baseType: !304, size: 64, align: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !301, file: !299, line: 36, baseType: !304, size: 64, align: 64, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !301, file: !299, line: 37, baseType: !304, size: 64, align: 64, offset: 512)
!313 = !{}
!314 = !DILocalVariable(name: "s", arg: 1, scope: !295, file: !73, line: 1309, type: !298)
!315 = !DIExpression()
!316 = !DILocation(line: 1309, column: 23, scope: !295)
!317 = !DILocalVariable(name: "num_orders", arg: 2, scope: !295, file: !73, line: 1309, type: !47)
!318 = !DILocation(line: 1309, column: 33, scope: !295)
!319 = !DILocalVariable(name: "os", scope: !295, file: !73, line: 1311, type: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!321 = !DILocation(line: 1311, column: 19, scope: !295)
!322 = !DILocalVariable(name: "present", scope: !295, file: !73, line: 1312, type: !63)
!323 = !DILocation(line: 1312, column: 9, scope: !295)
!324 = !DILocalVariable(name: "order_flags", scope: !295, file: !73, line: 1313, type: !52)
!325 = !DILocation(line: 1313, column: 8, scope: !295)
!326 = !DILocalVariable(name: "size", scope: !295, file: !73, line: 1314, type: !327)
!327 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!328 = !DILocation(line: 1314, column: 6, scope: !295)
!329 = !DILocalVariable(name: "processed", scope: !295, file: !73, line: 1314, type: !327)
!330 = !DILocation(line: 1314, column: 12, scope: !295)
!331 = !DILocalVariable(name: "delta", scope: !295, file: !73, line: 1315, type: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !40, line: 28, baseType: !327)
!333 = !DILocation(line: 1315, column: 10, scope: !295)
!334 = !DILocation(line: 1317, column: 2, scope: !295)
!335 = !DILocation(line: 1317, column: 9, scope: !336)
!336 = !DILexicalBlockFile(scope: !295, file: !73, discriminator: 1)
!337 = !DILocation(line: 1317, column: 21, scope: !336)
!338 = !DILocation(line: 1317, column: 19, scope: !336)
!339 = !DILocation(line: 1317, column: 2, scope: !336)
!340 = !DILocation(line: 1319, column: 20, scope: !341)
!341 = distinct !DILexicalBlock(scope: !295, file: !73, line: 1318, column: 2)
!342 = !DILocation(line: 1319, column: 24, scope: !341)
!343 = !DILocation(line: 1319, column: 25, scope: !341)
!344 = !DILocation(line: 1319, column: 17, scope: !341)
!345 = !DILocation(line: 1319, column: 15, scope: !341)
!346 = !DILocation(line: 1321, column: 9, scope: !347)
!347 = distinct !DILexicalBlock(scope: !341, file: !73, line: 1321, column: 7)
!348 = !DILocation(line: 1321, column: 21, scope: !347)
!349 = !DILocation(line: 1321, column: 7, scope: !341)
!350 = !DILocation(line: 1323, column: 4, scope: !351)
!351 = distinct !DILexicalBlock(scope: !347, file: !73, line: 1322, column: 3)
!352 = !DILocation(line: 1324, column: 4, scope: !351)
!353 = !DILocation(line: 1327, column: 7, scope: !354)
!354 = distinct !DILexicalBlock(scope: !341, file: !73, line: 1327, column: 7)
!355 = !DILocation(line: 1327, column: 19, scope: !354)
!356 = !DILocation(line: 1327, column: 7, scope: !341)
!357 = !DILocation(line: 1329, column: 28, scope: !358)
!358 = distinct !DILexicalBlock(scope: !354, file: !73, line: 1328, column: 3)
!359 = !DILocation(line: 1329, column: 4, scope: !358)
!360 = !DILocation(line: 1330, column: 3, scope: !358)
!361 = !DILocation(line: 1333, column: 8, scope: !362)
!362 = distinct !DILexicalBlock(scope: !363, file: !73, line: 1333, column: 8)
!363 = distinct !DILexicalBlock(scope: !354, file: !73, line: 1332, column: 3)
!364 = !DILocation(line: 1333, column: 20, scope: !362)
!365 = !DILocation(line: 1333, column: 8, scope: !363)
!366 = !DILocation(line: 1335, column: 25, scope: !367)
!367 = distinct !DILexicalBlock(scope: !362, file: !73, line: 1334, column: 4)
!368 = !DILocation(line: 1335, column: 29, scope: !367)
!369 = !DILocation(line: 1335, column: 30, scope: !367)
!370 = !DILocation(line: 1335, column: 22, scope: !367)
!371 = !DILocation(line: 1335, column: 5, scope: !367)
!372 = !DILocation(line: 1335, column: 9, scope: !367)
!373 = !DILocation(line: 1335, column: 20, scope: !367)
!374 = !DILocation(line: 1336, column: 4, scope: !367)
!375 = !DILocation(line: 1338, column: 12, scope: !363)
!376 = !DILocation(line: 1338, column: 16, scope: !363)
!377 = !DILocation(line: 1338, column: 4, scope: !363)
!378 = !DILocation(line: 1342, column: 11, scope: !379)
!379 = distinct !DILexicalBlock(scope: !363, file: !73, line: 1339, column: 4)
!380 = !DILocation(line: 1343, column: 6, scope: !379)
!381 = !DILocation(line: 1350, column: 11, scope: !379)
!382 = !DILocation(line: 1351, column: 6, scope: !379)
!383 = !DILocation(line: 1354, column: 11, scope: !379)
!384 = !DILocation(line: 1355, column: 4, scope: !379)
!385 = !DILocation(line: 1357, column: 19, scope: !363)
!386 = !DILocation(line: 1357, column: 32, scope: !363)
!387 = !DILocation(line: 1357, column: 45, scope: !363)
!388 = !DILocation(line: 1357, column: 4, scope: !363)
!389 = !DILocation(line: 1359, column: 8, scope: !390)
!390 = distinct !DILexicalBlock(scope: !363, file: !73, line: 1359, column: 8)
!391 = !DILocation(line: 1359, column: 20, scope: !390)
!392 = !DILocation(line: 1359, column: 8, scope: !363)
!393 = !DILocation(line: 1361, column: 11, scope: !394)
!394 = distinct !DILexicalBlock(scope: !395, file: !73, line: 1361, column: 9)
!395 = distinct !DILexicalBlock(scope: !390, file: !73, line: 1360, column: 4)
!396 = !DILocation(line: 1361, column: 23, scope: !394)
!397 = !DILocation(line: 1361, column: 9, scope: !395)
!398 = !DILocation(line: 1362, column: 23, scope: !394)
!399 = !DILocation(line: 1362, column: 27, scope: !394)
!400 = !DILocation(line: 1362, column: 31, scope: !394)
!401 = !DILocation(line: 1362, column: 6, scope: !394)
!402 = !DILocation(line: 1364, column: 17, scope: !395)
!403 = !DILocation(line: 1364, column: 21, scope: !395)
!404 = !DILocation(line: 1364, column: 28, scope: !395)
!405 = !DILocation(line: 1365, column: 10, scope: !395)
!406 = !DILocation(line: 1365, column: 14, scope: !395)
!407 = !DILocation(line: 1365, column: 21, scope: !395)
!408 = !DILocation(line: 1366, column: 10, scope: !395)
!409 = !DILocation(line: 1366, column: 14, scope: !395)
!410 = !DILocation(line: 1366, column: 21, scope: !395)
!411 = !DILocation(line: 1367, column: 10, scope: !395)
!412 = !DILocation(line: 1367, column: 14, scope: !395)
!413 = !DILocation(line: 1367, column: 21, scope: !395)
!414 = !DILocation(line: 1366, column: 27, scope: !395)
!415 = !DILocation(line: 1367, column: 26, scope: !395)
!416 = !DILocation(line: 1368, column: 10, scope: !395)
!417 = !DILocation(line: 1368, column: 14, scope: !395)
!418 = !DILocation(line: 1368, column: 21, scope: !395)
!419 = !DILocation(line: 1368, column: 30, scope: !395)
!420 = !DILocation(line: 1368, column: 34, scope: !395)
!421 = !DILocation(line: 1368, column: 41, scope: !395)
!422 = !DILocation(line: 1368, column: 28, scope: !395)
!423 = !DILocation(line: 1368, column: 45, scope: !395)
!424 = !DILocation(line: 1364, column: 5, scope: !395)
!425 = !DILocation(line: 1369, column: 4, scope: !395)
!426 = !DILocation(line: 1371, column: 12, scope: !363)
!427 = !DILocation(line: 1371, column: 24, scope: !363)
!428 = !DILocation(line: 1371, column: 10, scope: !363)
!429 = !DILocation(line: 1373, column: 12, scope: !363)
!430 = !DILocation(line: 1373, column: 16, scope: !363)
!431 = !DILocation(line: 1373, column: 4, scope: !363)
!432 = !DILocation(line: 1376, column: 22, scope: !433)
!433 = distinct !DILexicalBlock(scope: !363, file: !73, line: 1374, column: 4)
!434 = !DILocation(line: 1376, column: 26, scope: !433)
!435 = !DILocation(line: 1376, column: 30, scope: !433)
!436 = !DILocation(line: 1376, column: 39, scope: !433)
!437 = !DILocation(line: 1376, column: 48, scope: !433)
!438 = !DILocation(line: 1376, column: 6, scope: !433)
!439 = !DILocation(line: 1377, column: 6, scope: !433)
!440 = !DILocation(line: 1380, column: 21, scope: !433)
!441 = !DILocation(line: 1380, column: 25, scope: !433)
!442 = !DILocation(line: 1380, column: 29, scope: !433)
!443 = !DILocation(line: 1380, column: 37, scope: !433)
!444 = !DILocation(line: 1380, column: 46, scope: !433)
!445 = !DILocation(line: 1380, column: 6, scope: !433)
!446 = !DILocation(line: 1381, column: 6, scope: !433)
!447 = !DILocation(line: 1384, column: 24, scope: !433)
!448 = !DILocation(line: 1384, column: 28, scope: !433)
!449 = !DILocation(line: 1384, column: 32, scope: !433)
!450 = !DILocation(line: 1384, column: 43, scope: !433)
!451 = !DILocation(line: 1384, column: 52, scope: !433)
!452 = !DILocation(line: 1384, column: 6, scope: !433)
!453 = !DILocation(line: 1385, column: 6, scope: !433)
!454 = !DILocation(line: 1388, column: 19, scope: !433)
!455 = !DILocation(line: 1388, column: 23, scope: !433)
!456 = !DILocation(line: 1388, column: 27, scope: !433)
!457 = !DILocation(line: 1388, column: 33, scope: !433)
!458 = !DILocation(line: 1388, column: 42, scope: !433)
!459 = !DILocation(line: 1388, column: 6, scope: !433)
!460 = !DILocation(line: 1389, column: 6, scope: !433)
!461 = !DILocation(line: 1392, column: 19, scope: !433)
!462 = !DILocation(line: 1392, column: 23, scope: !433)
!463 = !DILocation(line: 1392, column: 27, scope: !433)
!464 = !DILocation(line: 1392, column: 33, scope: !433)
!465 = !DILocation(line: 1392, column: 42, scope: !433)
!466 = !DILocation(line: 1392, column: 6, scope: !433)
!467 = !DILocation(line: 1393, column: 6, scope: !433)
!468 = !DILocation(line: 1396, column: 23, scope: !433)
!469 = !DILocation(line: 1396, column: 27, scope: !433)
!470 = !DILocation(line: 1396, column: 31, scope: !433)
!471 = !DILocation(line: 1396, column: 41, scope: !433)
!472 = !DILocation(line: 1396, column: 50, scope: !433)
!473 = !DILocation(line: 1396, column: 6, scope: !433)
!474 = !DILocation(line: 1397, column: 6, scope: !433)
!475 = !DILocation(line: 1400, column: 21, scope: !433)
!476 = !DILocation(line: 1400, column: 25, scope: !433)
!477 = !DILocation(line: 1400, column: 29, scope: !433)
!478 = !DILocation(line: 1400, column: 37, scope: !433)
!479 = !DILocation(line: 1400, column: 46, scope: !433)
!480 = !DILocation(line: 1400, column: 6, scope: !433)
!481 = !DILocation(line: 1401, column: 6, scope: !433)
!482 = !DILocation(line: 1404, column: 21, scope: !433)
!483 = !DILocation(line: 1404, column: 25, scope: !433)
!484 = !DILocation(line: 1404, column: 29, scope: !433)
!485 = !DILocation(line: 1404, column: 37, scope: !433)
!486 = !DILocation(line: 1404, column: 46, scope: !433)
!487 = !DILocation(line: 1404, column: 6, scope: !433)
!488 = !DILocation(line: 1405, column: 6, scope: !433)
!489 = !DILocation(line: 1408, column: 22, scope: !433)
!490 = !DILocation(line: 1408, column: 26, scope: !433)
!491 = !DILocation(line: 1408, column: 30, scope: !433)
!492 = !DILocation(line: 1408, column: 39, scope: !433)
!493 = !DILocation(line: 1408, column: 48, scope: !433)
!494 = !DILocation(line: 1408, column: 6, scope: !433)
!495 = !DILocation(line: 1409, column: 6, scope: !433)
!496 = !DILocation(line: 1412, column: 23, scope: !433)
!497 = !DILocation(line: 1412, column: 27, scope: !433)
!498 = !DILocation(line: 1412, column: 31, scope: !433)
!499 = !DILocation(line: 1412, column: 41, scope: !433)
!500 = !DILocation(line: 1412, column: 50, scope: !433)
!501 = !DILocation(line: 1412, column: 6, scope: !433)
!502 = !DILocation(line: 1413, column: 6, scope: !433)
!503 = !DILocation(line: 1416, column: 23, scope: !433)
!504 = !DILocation(line: 1416, column: 27, scope: !433)
!505 = !DILocation(line: 1416, column: 31, scope: !433)
!506 = !DILocation(line: 1416, column: 41, scope: !433)
!507 = !DILocation(line: 1416, column: 50, scope: !433)
!508 = !DILocation(line: 1416, column: 6, scope: !433)
!509 = !DILocation(line: 1417, column: 6, scope: !433)
!510 = !DILocation(line: 1420, column: 22, scope: !433)
!511 = !DILocation(line: 1420, column: 26, scope: !433)
!512 = !DILocation(line: 1420, column: 30, scope: !433)
!513 = !DILocation(line: 1420, column: 39, scope: !433)
!514 = !DILocation(line: 1420, column: 48, scope: !433)
!515 = !DILocation(line: 1420, column: 6, scope: !433)
!516 = !DILocation(line: 1421, column: 6, scope: !433)
!517 = !DILocation(line: 1424, column: 23, scope: !433)
!518 = !DILocation(line: 1424, column: 27, scope: !433)
!519 = !DILocation(line: 1424, column: 31, scope: !433)
!520 = !DILocation(line: 1424, column: 41, scope: !433)
!521 = !DILocation(line: 1424, column: 50, scope: !433)
!522 = !DILocation(line: 1424, column: 6, scope: !433)
!523 = !DILocation(line: 1425, column: 6, scope: !433)
!524 = !DILocation(line: 1428, column: 20, scope: !433)
!525 = !DILocation(line: 1428, column: 24, scope: !433)
!526 = !DILocation(line: 1428, column: 28, scope: !433)
!527 = !DILocation(line: 1428, column: 35, scope: !433)
!528 = !DILocation(line: 1428, column: 44, scope: !433)
!529 = !DILocation(line: 1428, column: 6, scope: !433)
!530 = !DILocation(line: 1429, column: 6, scope: !433)
!531 = !DILocation(line: 1434, column: 13, scope: !433)
!532 = !DILocation(line: 1434, column: 17, scope: !433)
!533 = !DILocation(line: 1432, column: 6, scope: !433)
!534 = !DILocation(line: 1435, column: 6, scope: !433)
!535 = !DILocation(line: 1438, column: 8, scope: !536)
!536 = distinct !DILexicalBlock(scope: !363, file: !73, line: 1438, column: 8)
!537 = !DILocation(line: 1438, column: 20, scope: !536)
!538 = !DILocation(line: 1438, column: 8, scope: !363)
!539 = !DILocation(line: 1439, column: 5, scope: !536)
!540 = !DILocation(line: 1442, column: 12, scope: !341)
!541 = !DILocation(line: 1317, column: 2, scope: !542)
!542 = !DILexicalBlockFile(scope: !295, file: !73, discriminator: 2)
!543 = distinct !{!543, !334}
!544 = !DILocation(line: 1451, column: 1, scope: !295)
!545 = distinct !DISubprogram(name: "process_secondary_order", scope: !73, file: !73, line: 1253, type: !546, isLocal: true, isDefinition: true, scopeLine: 1254, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !298}
!548 = !DILocalVariable(name: "s", arg: 1, scope: !545, file: !73, line: 1253, type: !298)
!549 = !DILocation(line: 1253, column: 32, scope: !545)
!550 = !DILocalVariable(name: "length", scope: !545, file: !73, line: 1258, type: !47)
!551 = !DILocation(line: 1258, column: 9, scope: !545)
!552 = !DILocalVariable(name: "flags", scope: !545, file: !73, line: 1259, type: !47)
!553 = !DILocation(line: 1259, column: 9, scope: !545)
!554 = !DILocalVariable(name: "type", scope: !545, file: !73, line: 1260, type: !52)
!555 = !DILocation(line: 1260, column: 8, scope: !545)
!556 = !DILocalVariable(name: "next_order", scope: !545, file: !73, line: 1261, type: !51)
!557 = !DILocation(line: 1261, column: 9, scope: !545)
!558 = !DILocation(line: 1263, column: 26, scope: !559)
!559 = distinct !DILexicalBlock(scope: !545, file: !73, line: 1263, column: 2)
!560 = !DILocation(line: 1263, column: 30, scope: !559)
!561 = !DILocation(line: 1263, column: 13, scope: !559)
!562 = !DILocation(line: 1263, column: 11, scope: !559)
!563 = !DILocation(line: 1263, column: 35, scope: !559)
!564 = !DILocation(line: 1263, column: 39, scope: !559)
!565 = !DILocation(line: 1263, column: 41, scope: !559)
!566 = !DILocation(line: 1264, column: 25, scope: !567)
!567 = distinct !DILexicalBlock(scope: !545, file: !73, line: 1264, column: 2)
!568 = !DILocation(line: 1264, column: 29, scope: !567)
!569 = !DILocation(line: 1264, column: 12, scope: !567)
!570 = !DILocation(line: 1264, column: 10, scope: !567)
!571 = !DILocation(line: 1264, column: 34, scope: !567)
!572 = !DILocation(line: 1264, column: 38, scope: !567)
!573 = !DILocation(line: 1264, column: 40, scope: !567)
!574 = !DILocation(line: 1265, column: 12, scope: !545)
!575 = !DILocation(line: 1265, column: 16, scope: !545)
!576 = !DILocation(line: 1265, column: 17, scope: !545)
!577 = !DILocation(line: 1265, column: 9, scope: !545)
!578 = !DILocation(line: 1265, column: 7, scope: !545)
!579 = !DILocation(line: 1267, column: 15, scope: !545)
!580 = !DILocation(line: 1267, column: 18, scope: !545)
!581 = !DILocation(line: 1267, column: 31, scope: !545)
!582 = !DILocation(line: 1267, column: 22, scope: !545)
!583 = !DILocation(line: 1267, column: 20, scope: !545)
!584 = !DILocation(line: 1267, column: 38, scope: !545)
!585 = !DILocation(line: 1267, column: 13, scope: !545)
!586 = !DILocation(line: 1269, column: 10, scope: !545)
!587 = !DILocation(line: 1269, column: 2, scope: !545)
!588 = !DILocation(line: 1272, column: 25, scope: !589)
!589 = distinct !DILexicalBlock(scope: !545, file: !73, line: 1270, column: 2)
!590 = !DILocation(line: 1272, column: 4, scope: !589)
!591 = !DILocation(line: 1273, column: 4, scope: !589)
!592 = !DILocation(line: 1276, column: 21, scope: !589)
!593 = !DILocation(line: 1276, column: 4, scope: !589)
!594 = !DILocation(line: 1277, column: 4, scope: !589)
!595 = !DILocation(line: 1280, column: 21, scope: !589)
!596 = !DILocation(line: 1280, column: 4, scope: !589)
!597 = !DILocation(line: 1281, column: 4, scope: !589)
!598 = !DILocation(line: 1284, column: 22, scope: !589)
!599 = !DILocation(line: 1284, column: 4, scope: !589)
!600 = !DILocation(line: 1285, column: 4, scope: !589)
!601 = !DILocation(line: 1288, column: 22, scope: !589)
!602 = !DILocation(line: 1288, column: 25, scope: !589)
!603 = !DILocation(line: 1288, column: 4, scope: !589)
!604 = !DILocation(line: 1289, column: 4, scope: !589)
!605 = !DILocation(line: 1292, column: 22, scope: !589)
!606 = !DILocation(line: 1292, column: 25, scope: !589)
!607 = !DILocation(line: 1292, column: 4, scope: !589)
!608 = !DILocation(line: 1293, column: 4, scope: !589)
!609 = !DILocation(line: 1296, column: 23, scope: !589)
!610 = !DILocation(line: 1296, column: 26, scope: !589)
!611 = !DILocation(line: 1296, column: 4, scope: !589)
!612 = !DILocation(line: 1297, column: 4, scope: !589)
!613 = !DILocation(line: 1301, column: 70, scope: !589)
!614 = !DILocation(line: 1300, column: 4, scope: !589)
!615 = !DILocation(line: 1302, column: 2, scope: !589)
!616 = !DILocation(line: 1304, column: 9, scope: !545)
!617 = !DILocation(line: 1304, column: 2, scope: !545)
!618 = !DILocation(line: 1304, column: 5, scope: !545)
!619 = !DILocation(line: 1304, column: 7, scope: !545)
!620 = !DILocation(line: 1305, column: 1, scope: !545)
!621 = distinct !DISubprogram(name: "rdp_in_present", scope: !73, file: !73, line: 29, type: !622, isLocal: true, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !298, !62, !52, !327}
!624 = !DILocalVariable(name: "s", arg: 1, scope: !621, file: !73, line: 29, type: !298)
!625 = !DILocation(line: 29, column: 23, scope: !621)
!626 = !DILocalVariable(name: "present", arg: 2, scope: !621, file: !73, line: 29, type: !62)
!627 = !DILocation(line: 29, column: 35, scope: !621)
!628 = !DILocalVariable(name: "flags", arg: 3, scope: !621, file: !73, line: 29, type: !52)
!629 = !DILocation(line: 29, column: 50, scope: !621)
!630 = !DILocalVariable(name: "size", arg: 4, scope: !621, file: !73, line: 29, type: !327)
!631 = !DILocation(line: 29, column: 61, scope: !621)
!632 = !DILocalVariable(name: "bits", scope: !621, file: !73, line: 31, type: !52)
!633 = !DILocation(line: 31, column: 8, scope: !621)
!634 = !DILocalVariable(name: "i", scope: !621, file: !73, line: 32, type: !327)
!635 = !DILocation(line: 32, column: 6, scope: !621)
!636 = !DILocation(line: 34, column: 6, scope: !637)
!637 = distinct !DILexicalBlock(scope: !621, file: !73, line: 34, column: 6)
!638 = !DILocation(line: 34, column: 12, scope: !637)
!639 = !DILocation(line: 34, column: 6, scope: !621)
!640 = !DILocation(line: 36, column: 7, scope: !641)
!641 = distinct !DILexicalBlock(scope: !637, file: !73, line: 35, column: 2)
!642 = !DILocation(line: 37, column: 2, scope: !641)
!643 = !DILocation(line: 39, column: 6, scope: !644)
!644 = distinct !DILexicalBlock(scope: !621, file: !73, line: 39, column: 6)
!645 = !DILocation(line: 39, column: 12, scope: !644)
!646 = !DILocation(line: 39, column: 6, scope: !621)
!647 = !DILocation(line: 41, column: 7, scope: !648)
!648 = distinct !DILexicalBlock(scope: !649, file: !73, line: 41, column: 7)
!649 = distinct !DILexicalBlock(scope: !644, file: !73, line: 40, column: 2)
!650 = !DILocation(line: 41, column: 12, scope: !648)
!651 = !DILocation(line: 41, column: 7, scope: !649)
!652 = !DILocation(line: 42, column: 9, scope: !648)
!653 = !DILocation(line: 42, column: 4, scope: !648)
!654 = !DILocation(line: 44, column: 9, scope: !648)
!655 = !DILocation(line: 45, column: 2, scope: !649)
!656 = !DILocation(line: 47, column: 3, scope: !621)
!657 = !DILocation(line: 47, column: 11, scope: !621)
!658 = !DILocation(line: 48, column: 9, scope: !659)
!659 = distinct !DILexicalBlock(scope: !621, file: !73, line: 48, column: 2)
!660 = !DILocation(line: 48, column: 7, scope: !659)
!661 = !DILocation(line: 48, column: 14, scope: !662)
!662 = !DILexicalBlockFile(scope: !663, file: !73, discriminator: 1)
!663 = distinct !DILexicalBlock(scope: !659, file: !73, line: 48, column: 2)
!664 = !DILocation(line: 48, column: 18, scope: !662)
!665 = !DILocation(line: 48, column: 16, scope: !662)
!666 = !DILocation(line: 48, column: 2, scope: !662)
!667 = !DILocation(line: 50, column: 13, scope: !668)
!668 = distinct !DILexicalBlock(scope: !663, file: !73, line: 49, column: 2)
!669 = !DILocation(line: 50, column: 17, scope: !668)
!670 = !DILocation(line: 50, column: 18, scope: !668)
!671 = !DILocation(line: 50, column: 10, scope: !668)
!672 = !DILocation(line: 50, column: 8, scope: !668)
!673 = !DILocation(line: 51, column: 15, scope: !668)
!674 = !DILocation(line: 51, column: 24, scope: !668)
!675 = !DILocation(line: 51, column: 26, scope: !668)
!676 = !DILocation(line: 51, column: 20, scope: !668)
!677 = !DILocation(line: 51, column: 4, scope: !668)
!678 = !DILocation(line: 51, column: 12, scope: !668)
!679 = !DILocation(line: 52, column: 2, scope: !668)
!680 = !DILocation(line: 48, column: 25, scope: !681)
!681 = !DILexicalBlockFile(scope: !663, file: !73, discriminator: 2)
!682 = !DILocation(line: 48, column: 2, scope: !681)
!683 = distinct !{!683, !684}
!684 = !DILocation(line: 48, column: 2, scope: !621)
!685 = !DILocation(line: 53, column: 1, scope: !621)
!686 = distinct !DISubprogram(name: "rdp_parse_bounds", scope: !73, file: !73, line: 105, type: !687, isLocal: true, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!687 = !DISubroutineType(types: !688)
!688 = !{!332, !298, !689}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!690 = !DILocalVariable(name: "s", arg: 1, scope: !686, file: !73, line: 105, type: !298)
!691 = !DILocation(line: 105, column: 25, scope: !686)
!692 = !DILocalVariable(name: "bounds", arg: 2, scope: !686, file: !73, line: 105, type: !689)
!693 = !DILocation(line: 105, column: 37, scope: !686)
!694 = !DILocalVariable(name: "present", scope: !686, file: !73, line: 107, type: !52)
!695 = !DILocation(line: 107, column: 8, scope: !686)
!696 = !DILocation(line: 109, column: 15, scope: !686)
!697 = !DILocation(line: 109, column: 19, scope: !686)
!698 = !DILocation(line: 109, column: 20, scope: !686)
!699 = !DILocation(line: 109, column: 12, scope: !686)
!700 = !DILocation(line: 109, column: 10, scope: !686)
!701 = !DILocation(line: 111, column: 6, scope: !702)
!702 = distinct !DILexicalBlock(scope: !686, file: !73, line: 111, column: 6)
!703 = !DILocation(line: 111, column: 14, scope: !702)
!704 = !DILocation(line: 111, column: 6, scope: !686)
!705 = !DILocation(line: 112, column: 16, scope: !702)
!706 = !DILocation(line: 112, column: 20, scope: !702)
!707 = !DILocation(line: 112, column: 28, scope: !702)
!708 = !DILocation(line: 112, column: 3, scope: !702)
!709 = !DILocation(line: 113, column: 11, scope: !710)
!710 = distinct !DILexicalBlock(scope: !702, file: !73, line: 113, column: 11)
!711 = !DILocation(line: 113, column: 19, scope: !710)
!712 = !DILocation(line: 113, column: 11, scope: !702)
!713 = !DILocation(line: 114, column: 16, scope: !710)
!714 = !DILocation(line: 114, column: 20, scope: !710)
!715 = !DILocation(line: 114, column: 28, scope: !710)
!716 = !DILocation(line: 114, column: 3, scope: !710)
!717 = !DILocation(line: 116, column: 6, scope: !718)
!718 = distinct !DILexicalBlock(scope: !686, file: !73, line: 116, column: 6)
!719 = !DILocation(line: 116, column: 14, scope: !718)
!720 = !DILocation(line: 116, column: 6, scope: !686)
!721 = !DILocation(line: 117, column: 16, scope: !718)
!722 = !DILocation(line: 117, column: 20, scope: !718)
!723 = !DILocation(line: 117, column: 28, scope: !718)
!724 = !DILocation(line: 117, column: 3, scope: !718)
!725 = !DILocation(line: 118, column: 11, scope: !726)
!726 = distinct !DILexicalBlock(scope: !718, file: !73, line: 118, column: 11)
!727 = !DILocation(line: 118, column: 19, scope: !726)
!728 = !DILocation(line: 118, column: 11, scope: !718)
!729 = !DILocation(line: 119, column: 16, scope: !726)
!730 = !DILocation(line: 119, column: 20, scope: !726)
!731 = !DILocation(line: 119, column: 28, scope: !726)
!732 = !DILocation(line: 119, column: 3, scope: !726)
!733 = !DILocation(line: 121, column: 6, scope: !734)
!734 = distinct !DILexicalBlock(scope: !686, file: !73, line: 121, column: 6)
!735 = !DILocation(line: 121, column: 14, scope: !734)
!736 = !DILocation(line: 121, column: 6, scope: !686)
!737 = !DILocation(line: 122, column: 16, scope: !734)
!738 = !DILocation(line: 122, column: 20, scope: !734)
!739 = !DILocation(line: 122, column: 28, scope: !734)
!740 = !DILocation(line: 122, column: 3, scope: !734)
!741 = !DILocation(line: 123, column: 11, scope: !742)
!742 = distinct !DILexicalBlock(scope: !734, file: !73, line: 123, column: 11)
!743 = !DILocation(line: 123, column: 19, scope: !742)
!744 = !DILocation(line: 123, column: 11, scope: !734)
!745 = !DILocation(line: 124, column: 16, scope: !742)
!746 = !DILocation(line: 124, column: 20, scope: !742)
!747 = !DILocation(line: 124, column: 28, scope: !742)
!748 = !DILocation(line: 124, column: 3, scope: !742)
!749 = !DILocation(line: 126, column: 6, scope: !750)
!750 = distinct !DILexicalBlock(scope: !686, file: !73, line: 126, column: 6)
!751 = !DILocation(line: 126, column: 14, scope: !750)
!752 = !DILocation(line: 126, column: 6, scope: !686)
!753 = !DILocation(line: 127, column: 16, scope: !750)
!754 = !DILocation(line: 127, column: 20, scope: !750)
!755 = !DILocation(line: 127, column: 28, scope: !750)
!756 = !DILocation(line: 127, column: 3, scope: !750)
!757 = !DILocation(line: 128, column: 11, scope: !758)
!758 = distinct !DILexicalBlock(scope: !750, file: !73, line: 128, column: 11)
!759 = !DILocation(line: 128, column: 19, scope: !758)
!760 = !DILocation(line: 128, column: 11, scope: !750)
!761 = !DILocation(line: 129, column: 16, scope: !758)
!762 = !DILocation(line: 129, column: 20, scope: !758)
!763 = !DILocation(line: 129, column: 28, scope: !758)
!764 = !DILocation(line: 129, column: 3, scope: !758)
!765 = !DILocation(line: 131, column: 11, scope: !686)
!766 = !DILocation(line: 131, column: 15, scope: !686)
!767 = !DILocation(line: 131, column: 21, scope: !686)
!768 = !DILocation(line: 131, column: 25, scope: !686)
!769 = !DILocation(line: 131, column: 17, scope: !686)
!770 = !DILocation(line: 131, column: 2, scope: !686)
!771 = distinct !DISubprogram(name: "process_destblt", scope: !73, file: !73, line: 202, type: !772, isLocal: true, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !298, !774, !63, !332}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!775 = !DILocalVariable(name: "s", arg: 1, scope: !771, file: !73, line: 202, type: !298)
!776 = !DILocation(line: 202, column: 24, scope: !771)
!777 = !DILocalVariable(name: "os", arg: 2, scope: !771, file: !73, line: 202, type: !774)
!778 = !DILocation(line: 202, column: 43, scope: !771)
!779 = !DILocalVariable(name: "present", arg: 3, scope: !771, file: !73, line: 202, type: !63)
!780 = !DILocation(line: 202, column: 54, scope: !771)
!781 = !DILocalVariable(name: "delta", arg: 4, scope: !771, file: !73, line: 202, type: !332)
!782 = !DILocation(line: 202, column: 71, scope: !771)
!783 = !DILocation(line: 204, column: 6, scope: !784)
!784 = distinct !DILexicalBlock(scope: !771, file: !73, line: 204, column: 6)
!785 = !DILocation(line: 204, column: 14, scope: !784)
!786 = !DILocation(line: 204, column: 6, scope: !771)
!787 = !DILocation(line: 205, column: 16, scope: !784)
!788 = !DILocation(line: 205, column: 20, scope: !784)
!789 = !DILocation(line: 205, column: 24, scope: !784)
!790 = !DILocation(line: 205, column: 27, scope: !784)
!791 = !DILocation(line: 205, column: 3, scope: !784)
!792 = !DILocation(line: 207, column: 6, scope: !793)
!793 = distinct !DILexicalBlock(scope: !771, file: !73, line: 207, column: 6)
!794 = !DILocation(line: 207, column: 14, scope: !793)
!795 = !DILocation(line: 207, column: 6, scope: !771)
!796 = !DILocation(line: 208, column: 16, scope: !793)
!797 = !DILocation(line: 208, column: 20, scope: !793)
!798 = !DILocation(line: 208, column: 24, scope: !793)
!799 = !DILocation(line: 208, column: 27, scope: !793)
!800 = !DILocation(line: 208, column: 3, scope: !793)
!801 = !DILocation(line: 210, column: 6, scope: !802)
!802 = distinct !DILexicalBlock(scope: !771, file: !73, line: 210, column: 6)
!803 = !DILocation(line: 210, column: 14, scope: !802)
!804 = !DILocation(line: 210, column: 6, scope: !771)
!805 = !DILocation(line: 211, column: 16, scope: !802)
!806 = !DILocation(line: 211, column: 20, scope: !802)
!807 = !DILocation(line: 211, column: 24, scope: !802)
!808 = !DILocation(line: 211, column: 28, scope: !802)
!809 = !DILocation(line: 211, column: 3, scope: !802)
!810 = !DILocation(line: 213, column: 6, scope: !811)
!811 = distinct !DILexicalBlock(scope: !771, file: !73, line: 213, column: 6)
!812 = !DILocation(line: 213, column: 14, scope: !811)
!813 = !DILocation(line: 213, column: 6, scope: !771)
!814 = !DILocation(line: 214, column: 16, scope: !811)
!815 = !DILocation(line: 214, column: 20, scope: !811)
!816 = !DILocation(line: 214, column: 24, scope: !811)
!817 = !DILocation(line: 214, column: 28, scope: !811)
!818 = !DILocation(line: 214, column: 3, scope: !811)
!819 = !DILocation(line: 216, column: 6, scope: !820)
!820 = distinct !DILexicalBlock(scope: !771, file: !73, line: 216, column: 6)
!821 = !DILocation(line: 216, column: 14, scope: !820)
!822 = !DILocation(line: 216, column: 6, scope: !771)
!823 = !DILocation(line: 217, column: 19, scope: !820)
!824 = !DILocation(line: 217, column: 23, scope: !820)
!825 = !DILocation(line: 217, column: 24, scope: !820)
!826 = !DILocation(line: 217, column: 16, scope: !820)
!827 = !DILocation(line: 217, column: 3, scope: !820)
!828 = !DILocation(line: 217, column: 7, scope: !820)
!829 = !DILocation(line: 217, column: 14, scope: !820)
!830 = !DILocation(line: 220, column: 9, scope: !771)
!831 = !DILocation(line: 220, column: 13, scope: !771)
!832 = !DILocation(line: 220, column: 21, scope: !771)
!833 = !DILocation(line: 220, column: 25, scope: !771)
!834 = !DILocation(line: 220, column: 28, scope: !771)
!835 = !DILocation(line: 220, column: 32, scope: !771)
!836 = !DILocation(line: 220, column: 35, scope: !771)
!837 = !DILocation(line: 220, column: 39, scope: !771)
!838 = !DILocation(line: 220, column: 43, scope: !771)
!839 = !DILocation(line: 220, column: 47, scope: !771)
!840 = !DILocation(line: 219, column: 2, scope: !771)
!841 = !DILocation(line: 222, column: 14, scope: !771)
!842 = !DILocation(line: 222, column: 18, scope: !771)
!843 = !DILocation(line: 222, column: 25, scope: !771)
!844 = !DILocation(line: 222, column: 13, scope: !771)
!845 = !DILocation(line: 222, column: 33, scope: !771)
!846 = !DILocation(line: 222, column: 37, scope: !771)
!847 = !DILocation(line: 222, column: 40, scope: !771)
!848 = !DILocation(line: 222, column: 44, scope: !771)
!849 = !DILocation(line: 222, column: 47, scope: !771)
!850 = !DILocation(line: 222, column: 51, scope: !771)
!851 = !DILocation(line: 222, column: 55, scope: !771)
!852 = !DILocation(line: 222, column: 59, scope: !771)
!853 = !DILocation(line: 222, column: 2, scope: !771)
!854 = !DILocation(line: 223, column: 1, scope: !771)
!855 = distinct !DISubprogram(name: "process_patblt", scope: !73, file: !73, line: 227, type: !856, isLocal: true, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!856 = !DISubroutineType(types: !857)
!857 = !{null, !298, !858, !63, !332}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!859 = !DILocalVariable(name: "s", arg: 1, scope: !855, file: !73, line: 227, type: !298)
!860 = !DILocation(line: 227, column: 23, scope: !855)
!861 = !DILocalVariable(name: "os", arg: 2, scope: !855, file: !73, line: 227, type: !858)
!862 = !DILocation(line: 227, column: 41, scope: !855)
!863 = !DILocalVariable(name: "present", arg: 3, scope: !855, file: !73, line: 227, type: !63)
!864 = !DILocation(line: 227, column: 52, scope: !855)
!865 = !DILocalVariable(name: "delta", arg: 4, scope: !855, file: !73, line: 227, type: !332)
!866 = !DILocation(line: 227, column: 69, scope: !855)
!867 = !DILocalVariable(name: "brush", scope: !855, file: !73, line: 229, type: !107)
!868 = !DILocation(line: 229, column: 8, scope: !855)
!869 = !DILocation(line: 231, column: 6, scope: !870)
!870 = distinct !DILexicalBlock(scope: !855, file: !73, line: 231, column: 6)
!871 = !DILocation(line: 231, column: 14, scope: !870)
!872 = !DILocation(line: 231, column: 6, scope: !855)
!873 = !DILocation(line: 232, column: 16, scope: !870)
!874 = !DILocation(line: 232, column: 20, scope: !870)
!875 = !DILocation(line: 232, column: 24, scope: !870)
!876 = !DILocation(line: 232, column: 27, scope: !870)
!877 = !DILocation(line: 232, column: 3, scope: !870)
!878 = !DILocation(line: 234, column: 6, scope: !879)
!879 = distinct !DILexicalBlock(scope: !855, file: !73, line: 234, column: 6)
!880 = !DILocation(line: 234, column: 14, scope: !879)
!881 = !DILocation(line: 234, column: 6, scope: !855)
!882 = !DILocation(line: 235, column: 16, scope: !879)
!883 = !DILocation(line: 235, column: 20, scope: !879)
!884 = !DILocation(line: 235, column: 24, scope: !879)
!885 = !DILocation(line: 235, column: 27, scope: !879)
!886 = !DILocation(line: 235, column: 3, scope: !879)
!887 = !DILocation(line: 237, column: 6, scope: !888)
!888 = distinct !DILexicalBlock(scope: !855, file: !73, line: 237, column: 6)
!889 = !DILocation(line: 237, column: 14, scope: !888)
!890 = !DILocation(line: 237, column: 6, scope: !855)
!891 = !DILocation(line: 238, column: 16, scope: !888)
!892 = !DILocation(line: 238, column: 20, scope: !888)
!893 = !DILocation(line: 238, column: 24, scope: !888)
!894 = !DILocation(line: 238, column: 28, scope: !888)
!895 = !DILocation(line: 238, column: 3, scope: !888)
!896 = !DILocation(line: 240, column: 6, scope: !897)
!897 = distinct !DILexicalBlock(scope: !855, file: !73, line: 240, column: 6)
!898 = !DILocation(line: 240, column: 14, scope: !897)
!899 = !DILocation(line: 240, column: 6, scope: !855)
!900 = !DILocation(line: 241, column: 16, scope: !897)
!901 = !DILocation(line: 241, column: 20, scope: !897)
!902 = !DILocation(line: 241, column: 24, scope: !897)
!903 = !DILocation(line: 241, column: 28, scope: !897)
!904 = !DILocation(line: 241, column: 3, scope: !897)
!905 = !DILocation(line: 243, column: 6, scope: !906)
!906 = distinct !DILexicalBlock(scope: !855, file: !73, line: 243, column: 6)
!907 = !DILocation(line: 243, column: 14, scope: !906)
!908 = !DILocation(line: 243, column: 6, scope: !855)
!909 = !DILocation(line: 244, column: 19, scope: !906)
!910 = !DILocation(line: 244, column: 23, scope: !906)
!911 = !DILocation(line: 244, column: 24, scope: !906)
!912 = !DILocation(line: 244, column: 16, scope: !906)
!913 = !DILocation(line: 244, column: 3, scope: !906)
!914 = !DILocation(line: 244, column: 7, scope: !906)
!915 = !DILocation(line: 244, column: 14, scope: !906)
!916 = !DILocation(line: 246, column: 6, scope: !917)
!917 = distinct !DILexicalBlock(scope: !855, file: !73, line: 246, column: 6)
!918 = !DILocation(line: 246, column: 14, scope: !917)
!919 = !DILocation(line: 246, column: 6, scope: !855)
!920 = !DILocation(line: 247, column: 17, scope: !917)
!921 = !DILocation(line: 247, column: 21, scope: !917)
!922 = !DILocation(line: 247, column: 25, scope: !917)
!923 = !DILocation(line: 247, column: 3, scope: !917)
!924 = !DILocation(line: 249, column: 6, scope: !925)
!925 = distinct !DILexicalBlock(scope: !855, file: !73, line: 249, column: 6)
!926 = !DILocation(line: 249, column: 14, scope: !925)
!927 = !DILocation(line: 249, column: 6, scope: !855)
!928 = !DILocation(line: 250, column: 17, scope: !925)
!929 = !DILocation(line: 250, column: 21, scope: !925)
!930 = !DILocation(line: 250, column: 25, scope: !925)
!931 = !DILocation(line: 250, column: 3, scope: !925)
!932 = !DILocation(line: 252, column: 18, scope: !855)
!933 = !DILocation(line: 252, column: 22, scope: !855)
!934 = !DILocation(line: 252, column: 26, scope: !855)
!935 = !DILocation(line: 252, column: 33, scope: !855)
!936 = !DILocation(line: 252, column: 41, scope: !855)
!937 = !DILocation(line: 252, column: 2, scope: !855)
!938 = !DILocation(line: 256, column: 9, scope: !855)
!939 = !DILocation(line: 256, column: 13, scope: !855)
!940 = !DILocation(line: 256, column: 21, scope: !855)
!941 = !DILocation(line: 256, column: 25, scope: !855)
!942 = !DILocation(line: 256, column: 28, scope: !855)
!943 = !DILocation(line: 256, column: 32, scope: !855)
!944 = !DILocation(line: 256, column: 35, scope: !855)
!945 = !DILocation(line: 256, column: 39, scope: !855)
!946 = !DILocation(line: 256, column: 43, scope: !855)
!947 = !DILocation(line: 256, column: 47, scope: !855)
!948 = !DILocation(line: 256, column: 51, scope: !855)
!949 = !DILocation(line: 256, column: 55, scope: !855)
!950 = !DILocation(line: 256, column: 61, scope: !855)
!951 = !DILocation(line: 256, column: 68, scope: !855)
!952 = !DILocation(line: 256, column: 72, scope: !855)
!953 = !DILocation(line: 257, column: 9, scope: !855)
!954 = !DILocation(line: 257, column: 13, scope: !855)
!955 = !DILocation(line: 254, column: 2, scope: !855)
!956 = !DILocation(line: 259, column: 23, scope: !855)
!957 = !DILocation(line: 259, column: 27, scope: !855)
!958 = !DILocation(line: 259, column: 2, scope: !855)
!959 = !DILocation(line: 261, column: 14, scope: !855)
!960 = !DILocation(line: 261, column: 18, scope: !855)
!961 = !DILocation(line: 261, column: 25, scope: !855)
!962 = !DILocation(line: 261, column: 36, scope: !855)
!963 = !DILocation(line: 261, column: 40, scope: !855)
!964 = !DILocation(line: 261, column: 47, scope: !855)
!965 = !DILocation(line: 261, column: 55, scope: !855)
!966 = !DILocation(line: 261, column: 32, scope: !855)
!967 = !DILocation(line: 261, column: 12, scope: !855)
!968 = !DILocation(line: 261, column: 63, scope: !855)
!969 = !DILocation(line: 261, column: 67, scope: !855)
!970 = !DILocation(line: 261, column: 70, scope: !855)
!971 = !DILocation(line: 261, column: 74, scope: !855)
!972 = !DILocation(line: 261, column: 77, scope: !855)
!973 = !DILocation(line: 261, column: 81, scope: !855)
!974 = !DILocation(line: 261, column: 85, scope: !855)
!975 = !DILocation(line: 261, column: 89, scope: !855)
!976 = !DILocation(line: 262, column: 13, scope: !855)
!977 = !DILocation(line: 262, column: 17, scope: !855)
!978 = !DILocation(line: 262, column: 27, scope: !855)
!979 = !DILocation(line: 262, column: 31, scope: !855)
!980 = !DILocation(line: 261, column: 2, scope: !855)
!981 = !DILocation(line: 263, column: 1, scope: !855)
!982 = distinct !DISubprogram(name: "process_screenblt", scope: !73, file: !73, line: 267, type: !983, isLocal: true, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!983 = !DISubroutineType(types: !984)
!984 = !{null, !298, !985, !63, !332}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!986 = !DILocalVariable(name: "s", arg: 1, scope: !982, file: !73, line: 267, type: !298)
!987 = !DILocation(line: 267, column: 26, scope: !982)
!988 = !DILocalVariable(name: "os", arg: 2, scope: !982, file: !73, line: 267, type: !985)
!989 = !DILocation(line: 267, column: 47, scope: !982)
!990 = !DILocalVariable(name: "present", arg: 3, scope: !982, file: !73, line: 267, type: !63)
!991 = !DILocation(line: 267, column: 58, scope: !982)
!992 = !DILocalVariable(name: "delta", arg: 4, scope: !982, file: !73, line: 267, type: !332)
!993 = !DILocation(line: 267, column: 75, scope: !982)
!994 = !DILocation(line: 269, column: 6, scope: !995)
!995 = distinct !DILexicalBlock(scope: !982, file: !73, line: 269, column: 6)
!996 = !DILocation(line: 269, column: 14, scope: !995)
!997 = !DILocation(line: 269, column: 6, scope: !982)
!998 = !DILocation(line: 270, column: 16, scope: !995)
!999 = !DILocation(line: 270, column: 20, scope: !995)
!1000 = !DILocation(line: 270, column: 24, scope: !995)
!1001 = !DILocation(line: 270, column: 27, scope: !995)
!1002 = !DILocation(line: 270, column: 3, scope: !995)
!1003 = !DILocation(line: 272, column: 6, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !982, file: !73, line: 272, column: 6)
!1005 = !DILocation(line: 272, column: 14, scope: !1004)
!1006 = !DILocation(line: 272, column: 6, scope: !982)
!1007 = !DILocation(line: 273, column: 16, scope: !1004)
!1008 = !DILocation(line: 273, column: 20, scope: !1004)
!1009 = !DILocation(line: 273, column: 24, scope: !1004)
!1010 = !DILocation(line: 273, column: 27, scope: !1004)
!1011 = !DILocation(line: 273, column: 3, scope: !1004)
!1012 = !DILocation(line: 275, column: 6, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !982, file: !73, line: 275, column: 6)
!1014 = !DILocation(line: 275, column: 14, scope: !1013)
!1015 = !DILocation(line: 275, column: 6, scope: !982)
!1016 = !DILocation(line: 276, column: 16, scope: !1013)
!1017 = !DILocation(line: 276, column: 20, scope: !1013)
!1018 = !DILocation(line: 276, column: 24, scope: !1013)
!1019 = !DILocation(line: 276, column: 28, scope: !1013)
!1020 = !DILocation(line: 276, column: 3, scope: !1013)
!1021 = !DILocation(line: 278, column: 6, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !982, file: !73, line: 278, column: 6)
!1023 = !DILocation(line: 278, column: 14, scope: !1022)
!1024 = !DILocation(line: 278, column: 6, scope: !982)
!1025 = !DILocation(line: 279, column: 16, scope: !1022)
!1026 = !DILocation(line: 279, column: 20, scope: !1022)
!1027 = !DILocation(line: 279, column: 24, scope: !1022)
!1028 = !DILocation(line: 279, column: 28, scope: !1022)
!1029 = !DILocation(line: 279, column: 3, scope: !1022)
!1030 = !DILocation(line: 281, column: 6, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !982, file: !73, line: 281, column: 6)
!1032 = !DILocation(line: 281, column: 14, scope: !1031)
!1033 = !DILocation(line: 281, column: 6, scope: !982)
!1034 = !DILocation(line: 282, column: 19, scope: !1031)
!1035 = !DILocation(line: 282, column: 23, scope: !1031)
!1036 = !DILocation(line: 282, column: 24, scope: !1031)
!1037 = !DILocation(line: 282, column: 16, scope: !1031)
!1038 = !DILocation(line: 282, column: 3, scope: !1031)
!1039 = !DILocation(line: 282, column: 7, scope: !1031)
!1040 = !DILocation(line: 282, column: 14, scope: !1031)
!1041 = !DILocation(line: 284, column: 6, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !982, file: !73, line: 284, column: 6)
!1043 = !DILocation(line: 284, column: 14, scope: !1042)
!1044 = !DILocation(line: 284, column: 6, scope: !982)
!1045 = !DILocation(line: 285, column: 16, scope: !1042)
!1046 = !DILocation(line: 285, column: 20, scope: !1042)
!1047 = !DILocation(line: 285, column: 24, scope: !1042)
!1048 = !DILocation(line: 285, column: 30, scope: !1042)
!1049 = !DILocation(line: 285, column: 3, scope: !1042)
!1050 = !DILocation(line: 287, column: 6, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !982, file: !73, line: 287, column: 6)
!1052 = !DILocation(line: 287, column: 14, scope: !1051)
!1053 = !DILocation(line: 287, column: 6, scope: !982)
!1054 = !DILocation(line: 288, column: 16, scope: !1051)
!1055 = !DILocation(line: 288, column: 20, scope: !1051)
!1056 = !DILocation(line: 288, column: 24, scope: !1051)
!1057 = !DILocation(line: 288, column: 30, scope: !1051)
!1058 = !DILocation(line: 288, column: 3, scope: !1051)
!1059 = !DILocation(line: 292, column: 9, scope: !982)
!1060 = !DILocation(line: 292, column: 13, scope: !982)
!1061 = !DILocation(line: 292, column: 21, scope: !982)
!1062 = !DILocation(line: 292, column: 25, scope: !982)
!1063 = !DILocation(line: 292, column: 28, scope: !982)
!1064 = !DILocation(line: 292, column: 32, scope: !982)
!1065 = !DILocation(line: 292, column: 35, scope: !982)
!1066 = !DILocation(line: 292, column: 39, scope: !982)
!1067 = !DILocation(line: 292, column: 43, scope: !982)
!1068 = !DILocation(line: 292, column: 47, scope: !982)
!1069 = !DILocation(line: 292, column: 51, scope: !982)
!1070 = !DILocation(line: 292, column: 55, scope: !982)
!1071 = !DILocation(line: 292, column: 61, scope: !982)
!1072 = !DILocation(line: 292, column: 65, scope: !982)
!1073 = !DILocation(line: 290, column: 2, scope: !982)
!1074 = !DILocation(line: 294, column: 16, scope: !982)
!1075 = !DILocation(line: 294, column: 20, scope: !982)
!1076 = !DILocation(line: 294, column: 27, scope: !982)
!1077 = !DILocation(line: 294, column: 15, scope: !982)
!1078 = !DILocation(line: 294, column: 35, scope: !982)
!1079 = !DILocation(line: 294, column: 39, scope: !982)
!1080 = !DILocation(line: 294, column: 42, scope: !982)
!1081 = !DILocation(line: 294, column: 46, scope: !982)
!1082 = !DILocation(line: 294, column: 49, scope: !982)
!1083 = !DILocation(line: 294, column: 53, scope: !982)
!1084 = !DILocation(line: 294, column: 57, scope: !982)
!1085 = !DILocation(line: 294, column: 61, scope: !982)
!1086 = !DILocation(line: 294, column: 65, scope: !982)
!1087 = !DILocation(line: 294, column: 69, scope: !982)
!1088 = !DILocation(line: 294, column: 75, scope: !982)
!1089 = !DILocation(line: 294, column: 79, scope: !982)
!1090 = !DILocation(line: 294, column: 2, scope: !982)
!1091 = !DILocation(line: 295, column: 1, scope: !982)
!1092 = distinct !DISubprogram(name: "process_line", scope: !73, file: !73, line: 299, type: !1093, isLocal: true, isDefinition: true, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{null, !298, !1095, !63, !332}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!1096 = !DILocalVariable(name: "s", arg: 1, scope: !1092, file: !73, line: 299, type: !298)
!1097 = !DILocation(line: 299, column: 21, scope: !1092)
!1098 = !DILocalVariable(name: "os", arg: 2, scope: !1092, file: !73, line: 299, type: !1095)
!1099 = !DILocation(line: 299, column: 37, scope: !1092)
!1100 = !DILocalVariable(name: "present", arg: 3, scope: !1092, file: !73, line: 299, type: !63)
!1101 = !DILocation(line: 299, column: 48, scope: !1092)
!1102 = !DILocalVariable(name: "delta", arg: 4, scope: !1092, file: !73, line: 299, type: !332)
!1103 = !DILocation(line: 299, column: 65, scope: !1092)
!1104 = !DILocation(line: 301, column: 6, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1092, file: !73, line: 301, column: 6)
!1106 = !DILocation(line: 301, column: 14, scope: !1105)
!1107 = !DILocation(line: 301, column: 6, scope: !1092)
!1108 = !DILocation(line: 302, column: 32, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1105, file: !73, line: 302, column: 3)
!1110 = !DILocation(line: 302, column: 36, scope: !1109)
!1111 = !DILocation(line: 302, column: 19, scope: !1109)
!1112 = !DILocation(line: 302, column: 5, scope: !1109)
!1113 = !DILocation(line: 302, column: 9, scope: !1109)
!1114 = !DILocation(line: 302, column: 17, scope: !1109)
!1115 = !DILocation(line: 302, column: 41, scope: !1109)
!1116 = !DILocation(line: 302, column: 45, scope: !1109)
!1117 = !DILocation(line: 302, column: 47, scope: !1109)
!1118 = !DILocation(line: 302, column: 53, scope: !1109)
!1119 = !DILocation(line: 304, column: 6, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1092, file: !73, line: 304, column: 6)
!1121 = !DILocation(line: 304, column: 14, scope: !1120)
!1122 = !DILocation(line: 304, column: 6, scope: !1092)
!1123 = !DILocation(line: 305, column: 16, scope: !1120)
!1124 = !DILocation(line: 305, column: 20, scope: !1120)
!1125 = !DILocation(line: 305, column: 24, scope: !1120)
!1126 = !DILocation(line: 305, column: 32, scope: !1120)
!1127 = !DILocation(line: 305, column: 3, scope: !1120)
!1128 = !DILocation(line: 307, column: 6, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1092, file: !73, line: 307, column: 6)
!1130 = !DILocation(line: 307, column: 14, scope: !1129)
!1131 = !DILocation(line: 307, column: 6, scope: !1092)
!1132 = !DILocation(line: 308, column: 16, scope: !1129)
!1133 = !DILocation(line: 308, column: 20, scope: !1129)
!1134 = !DILocation(line: 308, column: 24, scope: !1129)
!1135 = !DILocation(line: 308, column: 32, scope: !1129)
!1136 = !DILocation(line: 308, column: 3, scope: !1129)
!1137 = !DILocation(line: 310, column: 6, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1092, file: !73, line: 310, column: 6)
!1139 = !DILocation(line: 310, column: 14, scope: !1138)
!1140 = !DILocation(line: 310, column: 6, scope: !1092)
!1141 = !DILocation(line: 311, column: 16, scope: !1138)
!1142 = !DILocation(line: 311, column: 20, scope: !1138)
!1143 = !DILocation(line: 311, column: 24, scope: !1138)
!1144 = !DILocation(line: 311, column: 30, scope: !1138)
!1145 = !DILocation(line: 311, column: 3, scope: !1138)
!1146 = !DILocation(line: 313, column: 6, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1092, file: !73, line: 313, column: 6)
!1148 = !DILocation(line: 313, column: 14, scope: !1147)
!1149 = !DILocation(line: 313, column: 6, scope: !1092)
!1150 = !DILocation(line: 314, column: 16, scope: !1147)
!1151 = !DILocation(line: 314, column: 20, scope: !1147)
!1152 = !DILocation(line: 314, column: 24, scope: !1147)
!1153 = !DILocation(line: 314, column: 30, scope: !1147)
!1154 = !DILocation(line: 314, column: 3, scope: !1147)
!1155 = !DILocation(line: 316, column: 6, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1092, file: !73, line: 316, column: 6)
!1157 = !DILocation(line: 316, column: 14, scope: !1156)
!1158 = !DILocation(line: 316, column: 6, scope: !1092)
!1159 = !DILocation(line: 317, column: 17, scope: !1156)
!1160 = !DILocation(line: 317, column: 21, scope: !1156)
!1161 = !DILocation(line: 317, column: 25, scope: !1156)
!1162 = !DILocation(line: 317, column: 3, scope: !1156)
!1163 = !DILocation(line: 319, column: 6, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1092, file: !73, line: 319, column: 6)
!1165 = !DILocation(line: 319, column: 14, scope: !1164)
!1166 = !DILocation(line: 319, column: 6, scope: !1092)
!1167 = !DILocation(line: 320, column: 19, scope: !1164)
!1168 = !DILocation(line: 320, column: 23, scope: !1164)
!1169 = !DILocation(line: 320, column: 24, scope: !1164)
!1170 = !DILocation(line: 320, column: 16, scope: !1164)
!1171 = !DILocation(line: 320, column: 3, scope: !1164)
!1172 = !DILocation(line: 320, column: 7, scope: !1164)
!1173 = !DILocation(line: 320, column: 14, scope: !1164)
!1174 = !DILocation(line: 322, column: 16, scope: !1092)
!1175 = !DILocation(line: 322, column: 20, scope: !1092)
!1176 = !DILocation(line: 322, column: 24, scope: !1092)
!1177 = !DILocation(line: 322, column: 29, scope: !1092)
!1178 = !DILocation(line: 322, column: 37, scope: !1092)
!1179 = !DILocation(line: 322, column: 2, scope: !1092)
!1180 = !DILocation(line: 325, column: 9, scope: !1092)
!1181 = !DILocation(line: 325, column: 13, scope: !1092)
!1182 = !DILocation(line: 325, column: 21, scope: !1092)
!1183 = !DILocation(line: 325, column: 25, scope: !1092)
!1184 = !DILocation(line: 325, column: 33, scope: !1092)
!1185 = !DILocation(line: 325, column: 37, scope: !1092)
!1186 = !DILocation(line: 325, column: 45, scope: !1092)
!1187 = !DILocation(line: 325, column: 49, scope: !1092)
!1188 = !DILocation(line: 325, column: 55, scope: !1092)
!1189 = !DILocation(line: 325, column: 59, scope: !1092)
!1190 = !DILocation(line: 325, column: 65, scope: !1092)
!1191 = !DILocation(line: 325, column: 69, scope: !1092)
!1192 = !DILocation(line: 325, column: 73, scope: !1092)
!1193 = !DILocation(line: 324, column: 2, scope: !1092)
!1194 = !DILocation(line: 327, column: 6, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1092, file: !73, line: 327, column: 6)
!1196 = !DILocation(line: 327, column: 10, scope: !1195)
!1197 = !DILocation(line: 327, column: 17, scope: !1195)
!1198 = !DILocation(line: 327, column: 24, scope: !1195)
!1199 = !DILocation(line: 327, column: 27, scope: !1200)
!1200 = !DILexicalBlockFile(scope: !1195, file: !73, discriminator: 1)
!1201 = !DILocation(line: 327, column: 31, scope: !1200)
!1202 = !DILocation(line: 327, column: 38, scope: !1200)
!1203 = !DILocation(line: 327, column: 6, scope: !1200)
!1204 = !DILocation(line: 329, column: 60, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1195, file: !73, line: 328, column: 2)
!1206 = !DILocation(line: 329, column: 64, scope: !1205)
!1207 = !DILocation(line: 329, column: 3, scope: !1205)
!1208 = !DILocation(line: 330, column: 3, scope: !1205)
!1209 = !DILocation(line: 333, column: 10, scope: !1092)
!1210 = !DILocation(line: 333, column: 14, scope: !1092)
!1211 = !DILocation(line: 333, column: 21, scope: !1092)
!1212 = !DILocation(line: 333, column: 26, scope: !1092)
!1213 = !DILocation(line: 333, column: 30, scope: !1092)
!1214 = !DILocation(line: 333, column: 38, scope: !1092)
!1215 = !DILocation(line: 333, column: 42, scope: !1092)
!1216 = !DILocation(line: 333, column: 50, scope: !1092)
!1217 = !DILocation(line: 333, column: 54, scope: !1092)
!1218 = !DILocation(line: 333, column: 60, scope: !1092)
!1219 = !DILocation(line: 333, column: 64, scope: !1092)
!1220 = !DILocation(line: 333, column: 71, scope: !1092)
!1221 = !DILocation(line: 333, column: 75, scope: !1092)
!1222 = !DILocation(line: 333, column: 2, scope: !1092)
!1223 = !DILocation(line: 334, column: 1, scope: !1092)
!1224 = !DILocation(line: 334, column: 1, scope: !1225)
!1225 = !DILexicalBlockFile(scope: !1092, file: !73, discriminator: 1)
!1226 = distinct !DISubprogram(name: "process_rect", scope: !73, file: !73, line: 338, type: !1227, isLocal: true, isDefinition: true, scopeLine: 339, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{null, !298, !1229, !63, !332}
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!1230 = !DILocalVariable(name: "s", arg: 1, scope: !1226, file: !73, line: 338, type: !298)
!1231 = !DILocation(line: 338, column: 21, scope: !1226)
!1232 = !DILocalVariable(name: "os", arg: 2, scope: !1226, file: !73, line: 338, type: !1229)
!1233 = !DILocation(line: 338, column: 37, scope: !1226)
!1234 = !DILocalVariable(name: "present", arg: 3, scope: !1226, file: !73, line: 338, type: !63)
!1235 = !DILocation(line: 338, column: 48, scope: !1226)
!1236 = !DILocalVariable(name: "delta", arg: 4, scope: !1226, file: !73, line: 338, type: !332)
!1237 = !DILocation(line: 338, column: 65, scope: !1226)
!1238 = !DILocalVariable(name: "i", scope: !1226, file: !73, line: 340, type: !63)
!1239 = !DILocation(line: 340, column: 9, scope: !1226)
!1240 = !DILocation(line: 341, column: 6, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1226, file: !73, line: 341, column: 6)
!1242 = !DILocation(line: 341, column: 14, scope: !1241)
!1243 = !DILocation(line: 341, column: 6, scope: !1226)
!1244 = !DILocation(line: 342, column: 16, scope: !1241)
!1245 = !DILocation(line: 342, column: 20, scope: !1241)
!1246 = !DILocation(line: 342, column: 24, scope: !1241)
!1247 = !DILocation(line: 342, column: 27, scope: !1241)
!1248 = !DILocation(line: 342, column: 3, scope: !1241)
!1249 = !DILocation(line: 344, column: 6, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1226, file: !73, line: 344, column: 6)
!1251 = !DILocation(line: 344, column: 14, scope: !1250)
!1252 = !DILocation(line: 344, column: 6, scope: !1226)
!1253 = !DILocation(line: 345, column: 16, scope: !1250)
!1254 = !DILocation(line: 345, column: 20, scope: !1250)
!1255 = !DILocation(line: 345, column: 24, scope: !1250)
!1256 = !DILocation(line: 345, column: 27, scope: !1250)
!1257 = !DILocation(line: 345, column: 3, scope: !1250)
!1258 = !DILocation(line: 347, column: 6, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1226, file: !73, line: 347, column: 6)
!1260 = !DILocation(line: 347, column: 14, scope: !1259)
!1261 = !DILocation(line: 347, column: 6, scope: !1226)
!1262 = !DILocation(line: 348, column: 16, scope: !1259)
!1263 = !DILocation(line: 348, column: 20, scope: !1259)
!1264 = !DILocation(line: 348, column: 24, scope: !1259)
!1265 = !DILocation(line: 348, column: 28, scope: !1259)
!1266 = !DILocation(line: 348, column: 3, scope: !1259)
!1267 = !DILocation(line: 350, column: 6, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1226, file: !73, line: 350, column: 6)
!1269 = !DILocation(line: 350, column: 14, scope: !1268)
!1270 = !DILocation(line: 350, column: 6, scope: !1226)
!1271 = !DILocation(line: 351, column: 16, scope: !1268)
!1272 = !DILocation(line: 351, column: 20, scope: !1268)
!1273 = !DILocation(line: 351, column: 24, scope: !1268)
!1274 = !DILocation(line: 351, column: 28, scope: !1268)
!1275 = !DILocation(line: 351, column: 3, scope: !1268)
!1276 = !DILocation(line: 353, column: 6, scope: !1277)
!1277 = distinct !DILexicalBlock(scope: !1226, file: !73, line: 353, column: 6)
!1278 = !DILocation(line: 353, column: 14, scope: !1277)
!1279 = !DILocation(line: 353, column: 6, scope: !1226)
!1280 = !DILocation(line: 355, column: 10, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !1277, file: !73, line: 354, column: 2)
!1282 = !DILocation(line: 355, column: 14, scope: !1281)
!1283 = !DILocation(line: 355, column: 15, scope: !1281)
!1284 = !DILocation(line: 355, column: 7, scope: !1281)
!1285 = !DILocation(line: 355, column: 5, scope: !1281)
!1286 = !DILocation(line: 356, column: 17, scope: !1281)
!1287 = !DILocation(line: 356, column: 21, scope: !1281)
!1288 = !DILocation(line: 356, column: 28, scope: !1281)
!1289 = !DILocation(line: 356, column: 44, scope: !1281)
!1290 = !DILocation(line: 356, column: 42, scope: !1281)
!1291 = !DILocation(line: 356, column: 3, scope: !1281)
!1292 = !DILocation(line: 356, column: 7, scope: !1281)
!1293 = !DILocation(line: 356, column: 14, scope: !1281)
!1294 = !DILocation(line: 357, column: 2, scope: !1281)
!1295 = !DILocation(line: 359, column: 6, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1226, file: !73, line: 359, column: 6)
!1297 = !DILocation(line: 359, column: 14, scope: !1296)
!1298 = !DILocation(line: 359, column: 6, scope: !1226)
!1299 = !DILocation(line: 361, column: 10, scope: !1300)
!1300 = distinct !DILexicalBlock(scope: !1296, file: !73, line: 360, column: 2)
!1301 = !DILocation(line: 361, column: 14, scope: !1300)
!1302 = !DILocation(line: 361, column: 15, scope: !1300)
!1303 = !DILocation(line: 361, column: 7, scope: !1300)
!1304 = !DILocation(line: 361, column: 5, scope: !1300)
!1305 = !DILocation(line: 362, column: 17, scope: !1300)
!1306 = !DILocation(line: 362, column: 21, scope: !1300)
!1307 = !DILocation(line: 362, column: 28, scope: !1300)
!1308 = !DILocation(line: 362, column: 45, scope: !1300)
!1309 = !DILocation(line: 362, column: 47, scope: !1300)
!1310 = !DILocation(line: 362, column: 42, scope: !1300)
!1311 = !DILocation(line: 362, column: 3, scope: !1300)
!1312 = !DILocation(line: 362, column: 7, scope: !1300)
!1313 = !DILocation(line: 362, column: 14, scope: !1300)
!1314 = !DILocation(line: 363, column: 2, scope: !1300)
!1315 = !DILocation(line: 365, column: 6, scope: !1316)
!1316 = distinct !DILexicalBlock(scope: !1226, file: !73, line: 365, column: 6)
!1317 = !DILocation(line: 365, column: 14, scope: !1316)
!1318 = !DILocation(line: 365, column: 6, scope: !1226)
!1319 = !DILocation(line: 367, column: 10, scope: !1320)
!1320 = distinct !DILexicalBlock(scope: !1316, file: !73, line: 366, column: 2)
!1321 = !DILocation(line: 367, column: 14, scope: !1320)
!1322 = !DILocation(line: 367, column: 15, scope: !1320)
!1323 = !DILocation(line: 367, column: 7, scope: !1320)
!1324 = !DILocation(line: 367, column: 5, scope: !1320)
!1325 = !DILocation(line: 368, column: 17, scope: !1320)
!1326 = !DILocation(line: 368, column: 21, scope: !1320)
!1327 = !DILocation(line: 368, column: 28, scope: !1320)
!1328 = !DILocation(line: 368, column: 45, scope: !1320)
!1329 = !DILocation(line: 368, column: 47, scope: !1320)
!1330 = !DILocation(line: 368, column: 42, scope: !1320)
!1331 = !DILocation(line: 368, column: 3, scope: !1320)
!1332 = !DILocation(line: 368, column: 7, scope: !1320)
!1333 = !DILocation(line: 368, column: 14, scope: !1320)
!1334 = !DILocation(line: 369, column: 2, scope: !1320)
!1335 = !DILocation(line: 372, column: 9, scope: !1226)
!1336 = !DILocation(line: 372, column: 13, scope: !1226)
!1337 = !DILocation(line: 372, column: 16, scope: !1226)
!1338 = !DILocation(line: 372, column: 20, scope: !1226)
!1339 = !DILocation(line: 372, column: 23, scope: !1226)
!1340 = !DILocation(line: 372, column: 27, scope: !1226)
!1341 = !DILocation(line: 372, column: 31, scope: !1226)
!1342 = !DILocation(line: 372, column: 35, scope: !1226)
!1343 = !DILocation(line: 372, column: 39, scope: !1226)
!1344 = !DILocation(line: 372, column: 43, scope: !1226)
!1345 = !DILocation(line: 371, column: 2, scope: !1226)
!1346 = !DILocation(line: 374, column: 10, scope: !1226)
!1347 = !DILocation(line: 374, column: 14, scope: !1226)
!1348 = !DILocation(line: 374, column: 17, scope: !1226)
!1349 = !DILocation(line: 374, column: 21, scope: !1226)
!1350 = !DILocation(line: 374, column: 24, scope: !1226)
!1351 = !DILocation(line: 374, column: 28, scope: !1226)
!1352 = !DILocation(line: 374, column: 32, scope: !1226)
!1353 = !DILocation(line: 374, column: 36, scope: !1226)
!1354 = !DILocation(line: 374, column: 40, scope: !1226)
!1355 = !DILocation(line: 374, column: 44, scope: !1226)
!1356 = !DILocation(line: 374, column: 2, scope: !1226)
!1357 = !DILocation(line: 375, column: 1, scope: !1226)
!1358 = distinct !DISubprogram(name: "process_desksave", scope: !73, file: !73, line: 379, type: !1359, isLocal: true, isDefinition: true, scopeLine: 380, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !313)
!1359 = !DISubroutineType(types: !1360)
!1360 = !{null, !298, !1361, !63, !332}
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!1362 = !DILocalVariable(name: "s", arg: 1, scope: !1358, file: !73, line: 379, type: !298)
!1363 = !DILocation(line: 379, column: 25, scope: !1358)
