; ModuleID = './[inter]asn.o.i'
source_filename = "./[inter]asn.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }

@.str = private unnamed_addr constant [44 x i8] c"ber_parse_header(), expected tag %d, got %d\00", align 1

; Function Attrs: nounwind uwtable
define i32 @ber_parse_header(%struct.stream*, i32, i32*) #0 !dbg !25 {
  %4 = alloca i32, align 4
  %5 = alloca %struct.stream*, align 8
  %6 = alloca i32, align 4
  %7 = alloca i32*, align 8
  %8 = alloca i32, align 4
  %9 = alloca i32, align 4
  store %struct.stream* %0, %struct.stream** %5, align 8
  call void @llvm.dbg.declare(metadata %struct.stream** %5, metadata !51, metadata !52), !dbg !53
  store i32 %1, i32* %6, align 4
  call void @llvm.dbg.declare(metadata i32* %6, metadata !54, metadata !52), !dbg !55
  store i32* %2, i32** %7, align 8
  call void @llvm.dbg.declare(metadata i32** %7, metadata !56, metadata !52), !dbg !57
  call void @llvm.dbg.declare(metadata i32* %8, metadata !58, metadata !52), !dbg !59
  call void @llvm.dbg.declare(metadata i32* %9, metadata !60, metadata !52), !dbg !61
  %10 = load i32, i32* %6, align 4, !dbg !62
  %11 = icmp sgt i32 %10, 255, !dbg !64
  br i1 %11, label %12, label %28, !dbg !65

; <label>:12:                                     ; preds = %3
  %13 = load %struct.stream*, %struct.stream** %5, align 8, !dbg !66

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "[inter]asn.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !{i32 2, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!25 = distinct !DISubprogram(name: "ber_parse_header", scope: !26, file: !26, line: 25, type: !27, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !50)
!26 = !DIFile(filename: "asn.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!27 = !DISubroutineType(types: !28)
!28 = !{!29, !32, !31, !49}
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !30, line: 28, baseType: !31)
!30 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!31 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !33, line: 40, baseType: !34)
!33 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !33, line: 25, size: 576, align: 64, elements: !36)
!36 = !{!37, !40, !41, !42, !44, !45, !46, !47, !48}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !35, file: !33, line: 27, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !35, file: !33, line: 28, baseType: !38, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !35, file: !33, line: 29, baseType: !38, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !35, file: !33, line: 30, baseType: !43, size: 32, align: 32, offset: 192)
!43 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !35, file: !33, line: 33, baseType: !38, size: 64, align: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !35, file: !33, line: 34, baseType: !38, size: 64, align: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !35, file: !33, line: 35, baseType: !38, size: 64, align: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !35, file: !33, line: 36, baseType: !38, size: 64, align: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !35, file: !33, line: 37, baseType: !38, size: 64, align: 64, offset: 512)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!50 = !{}
!51 = !DILocalVariable(name: "s", arg: 1, scope: !25, file: !26, line: 25, type: !32)
!52 = !DIExpression()
!53 = !DILocation(line: 25, column: 25, scope: !25)
!54 = !DILocalVariable(name: "tagval", arg: 2, scope: !25, file: !26, line: 25, type: !31)
!55 = !DILocation(line: 25, column: 32, scope: !25)
!56 = !DILocalVariable(name: "length", arg: 3, scope: !25, file: !26, line: 25, type: !49)
!57 = !DILocation(line: 25, column: 45, scope: !25)
!58 = !DILocalVariable(name: "tag", scope: !25, file: !26, line: 27, type: !31)
!59 = !DILocation(line: 27, column: 6, scope: !25)
!60 = !DILocalVariable(name: "len", scope: !25, file: !26, line: 27, type: !31)
!61 = !DILocation(line: 27, column: 11, scope: !25)
!62 = !DILocation(line: 29, column: 6, scope: !63)
!63 = distinct !DILexicalBlock(scope: !25, file: !26, line: 29, column: 6)
!64 = !DILocation(line: 29, column: 13, scope: !63)
!65 = !DILocation(line: 29, column: 6, scope: !25)
!66 = !DILocation(line: 31, column: 14, scope: !67)
!67 = distinct !DILexicalBlock(scope: !68, file: !26, line: 31, column: 3)
!68 = distinct !DILexicalBlock(scope: !63, file: !26, line: 30, column: 2)
!69 = !DILocation(line: 31, column: 18, scope: !67)
!70 = !DILocation(line: 31, column: 19, scope: !67)
!71 = !DILocation(line: 31, column: 11, scope: !67)
!72 = !DILocation(line: 31, column: 9, scope: !67)
!73 = !DILocation(line: 31, column: 32, scope: !67)
!74 = !DILocation(line: 31, column: 37, scope: !67)
!75 = !DILocation(line: 31, column: 48, scope: !67)
!76 = !DILocation(line: 31, column: 52, scope: !67)
!77 = !DILocation(line: 31, column: 53, scope: !67)
!78 = !DILocation(line: 31, column: 45, scope: !67)
!79 = !DILocation(line: 31, column: 43, scope: !67)
!80 = !DILocation(line: 31, column: 28, scope: !67)
!81 = !DILocation(line: 32, column: 2, scope: !68)
!82 = !DILocation(line: 35, column: 12, scope: !83)
!83 = distinct !DILexicalBlock(scope: !63, file: !26, line: 34, column: 2)
!84 = !DILocation(line: 35, column: 16, scope: !83)
!85 = !DILocation(line: 35, column: 17, scope: !83)
!86 = !DILocation(line: 35, column: 9, scope: !83)
!87 = !DILocation(line: 35, column: 7, scope: !83)
!88 = !DILocation(line: 38, column: 6, scope: !89)
!89 = distinct !DILexicalBlock(scope: !25, file: !26, line: 38, column: 6)
!90 = !DILocation(line: 38, column: 13, scope: !89)
!91 = !DILocation(line: 38, column: 10, scope: !89)
!92 = !DILocation(line: 38, column: 6, scope: !25)
!93 = !DILocation(line: 40, column: 70, scope: !94)
!94 = distinct !DILexicalBlock(scope: !89, file: !26, line: 39, column: 2)
!95 = !DILocation(line: 40, column: 78, scope: !94)
!96 = !DILocation(line: 40, column: 3, scope: !94)
!97 = !DILocation(line: 41, column: 3, scope: !94)
!98 = !DILocation(line: 44, column: 11, scope: !25)
!99 = !DILocation(line: 44, column: 15, scope: !25)
!100 = !DILocation(line: 44, column: 16, scope: !25)
!101 = !DILocation(line: 44, column: 8, scope: !25)
!102 = !DILocation(line: 44, column: 6, scope: !25)
!103 = !DILocation(line: 46, column: 6, scope: !104)
!104 = distinct !DILexicalBlock(scope: !25, file: !26, line: 46, column: 6)
!105 = !DILocation(line: 46, column: 10, scope: !104)
!106 = !DILocation(line: 46, column: 6, scope: !25)
!107 = !DILocation(line: 48, column: 7, scope: !108)
!108 = distinct !DILexicalBlock(scope: !104, file: !26, line: 47, column: 2)
!109 = !DILocation(line: 49, column: 4, scope: !108)
!110 = !DILocation(line: 49, column: 11, scope: !108)
!111 = !DILocation(line: 50, column: 3, scope: !108)
!112 = !DILocation(line: 50, column: 13, scope: !113)
!113 = !DILexicalBlockFile(scope: !108, file: !26, discriminator: 1)
!114 = !DILocation(line: 50, column: 3, scope: !113)
!115 = !DILocation(line: 51, column: 17, scope: !108)
!116 = !DILocation(line: 51, column: 16, scope: !108)
