; ModuleID = './[inter]ewmhints.o.i'
source_filename = "./[inter]ewmhints.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._XDisplay = type opaque
%struct.anon = type { %struct._XExtData*, %struct._XPrivate*, i32, i32, i32, i32, i8*, i64, i64, i64, i32, i64 (%struct._XDisplay*)*, i32, i32, i32, i32, i32, %struct.ScreenFormat*, i32, i32, %struct._XPrivate*, %struct._XPrivate*, i32, i64, i64, i8*, i8*, i8*, i8*, i32, %struct._XrmHashBucketRec*, i32 (%struct._XDisplay*)*, i8*, i32, i32, %struct.Screen*, i64, i64, i32, i32, i8*, i8*, i32, i8* }
%struct._XExtData = type { i32, %struct._XExtData*, i32 (%struct._XExtData*)*, i8* }
%struct.ScreenFormat = type { %struct._XExtData*, i32, i32, i32 }
%struct._XPrivate = type opaque
%struct._XrmHashBucketRec = type opaque
%struct.Screen = type { %struct._XExtData*, %struct._XDisplay*, i64, i32, i32, i32, i32, i32, %struct.Depth*, i32, %struct.Visual*, %struct._XGC*, i64, i64, i64, i32, i32, i32, i32, i64 }
%struct.Depth = type { i32, i32, %struct.Visual* }
%struct.Visual = type { %struct._XExtData*, i64, i32, i64, i64, i64, i32, i32 }
%struct._XGC = type opaque
%union._XEvent = type { [24 x i64] }
%struct.XClientMessageEvent = type { i32, i64, i32, %struct._XDisplay*, i64, i64, i32, %union.anon }
%union.anon = type { [5 x i64] }

@g_display = external global %struct._XDisplay*, align 8
@.str = private unnamed_addr constant [14 x i8] c"_NET_WORKAREA\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22, globals: !171)
!1 = !DIFile(filename: "[inter]ewmhints.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !{!23, !162, !163, !164, !166, !167, !170}
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "_XPrivDisplay", file: !24, line: 550, baseType: !25)
!24 = !DIFile(filename: "/usr/include/X11/Xlib.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 493, size: 2368, align: 64, elements: !27)
!27 = !{!28, !45, !48, !49, !50, !51, !52, !53, !57, !58, !59, !60, !66, !67, !68, !69, !70, !71, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !93, !96, !100, !101, !102, !103, !154, !155, !156, !157, !158, !159, !160, !161}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !26, file: !24, line: 498, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExtData", file: !24, line: 155, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_XExtData", file: !24, line: 148, size: 256, align: 64, elements: !32)
!32 = !{!33, !35, !37, !41}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !31, file: !24, line: 149, baseType: !34, size: 32, align: 32)
!34 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !24, line: 150, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "free_private", scope: !31, file: !24, line: 151, baseType: !38, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!34, !36}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !31, file: !24, line: 154, baseType: !42, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPointer", file: !24, line: 80, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "private1", scope: !26, file: !24, line: 499, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XPrivate", file: !24, line: 490, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !26, file: !24, line: 500, baseType: !34, size: 32, align: 32, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "private2", scope: !26, file: !24, line: 501, baseType: !34, size: 32, align: 32, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "proto_major_version", scope: !26, file: !24, line: 502, baseType: !34, size: 32, align: 32, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "proto_minor_version", scope: !26, file: !24, line: 503, baseType: !34, size: 32, align: 32, offset: 224)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !26, file: !24, line: 504, baseType: !43, size: 64, align: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "private3", scope: !26, file: !24, line: 505, baseType: !54, size: 64, align: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "XID", file: !55, line: 66, baseType: !56)
!55 = !DIFile(filename: "/usr/include/X11/X.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!56 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "private4", scope: !26, file: !24, line: 506, baseType: !54, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "private5", scope: !26, file: !24, line: 507, baseType: !54, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "private6", scope: !26, file: !24, line: 508, baseType: !34, size: 32, align: 32, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "resource_alloc", scope: !26, file: !24, line: 509, baseType: !61, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!54, !64}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XDisplay", file: !24, line: 255, flags: DIFlagFwdDecl)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "byte_order", scope: !26, file: !24, line: 512, baseType: !34, size: 32, align: 32, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_unit", scope: !26, file: !24, line: 513, baseType: !34, size: 32, align: 32, offset: 672)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_pad", scope: !26, file: !24, line: 514, baseType: !34, size: 32, align: 32, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_bit_order", scope: !26, file: !24, line: 515, baseType: !34, size: 32, align: 32, offset: 736)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "nformats", scope: !26, file: !24, line: 516, baseType: !34, size: 32, align: 32, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "pixmap_format", scope: !26, file: !24, line: 517, baseType: !72, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScreenFormat", file: !24, line: 285, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 280, size: 192, align: 64, elements: !75)
!75 = !{!76, !77, !78, !79}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !74, file: !24, line: 281, baseType: !29, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !74, file: !24, line: 282, baseType: !34, size: 32, align: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_pixel", scope: !74, file: !24, line: 283, baseType: !34, size: 32, align: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "scanline_pad", scope: !74, file: !24, line: 284, baseType: !34, size: 32, align: 32, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "private8", scope: !26, file: !24, line: 518, baseType: !34, size: 32, align: 32, offset: 896)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !26, file: !24, line: 519, baseType: !34, size: 32, align: 32, offset: 928)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "private9", scope: !26, file: !24, line: 520, baseType: !46, size: 64, align: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "private10", scope: !26, file: !24, line: 520, baseType: !46, size: 64, align: 64, offset: 1024)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "qlen", scope: !26, file: !24, line: 521, baseType: !34, size: 32, align: 32, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "last_request_read", scope: !26, file: !24, line: 522, baseType: !56, size: 64, align: 64, offset: 1152)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !26, file: !24, line: 523, baseType: !56, size: 64, align: 64, offset: 1216)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "private11", scope: !26, file: !24, line: 524, baseType: !42, size: 64, align: 64, offset: 1280)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "private12", scope: !26, file: !24, line: 525, baseType: !42, size: 64, align: 64, offset: 1344)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "private13", scope: !26, file: !24, line: 526, baseType: !42, size: 64, align: 64, offset: 1408)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "private14", scope: !26, file: !24, line: 527, baseType: !42, size: 64, align: 64, offset: 1472)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "max_request_size", scope: !26, file: !24, line: 528, baseType: !92, size: 32, align: 32, offset: 1536)
!92 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !26, file: !24, line: 529, baseType: !94, size: 64, align: 64, offset: 1600)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XrmHashBucketRec", file: !24, line: 491, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "private15", scope: !26, file: !24, line: 530, baseType: !97, size: 64, align: 64, offset: 1664)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!34, !64}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "display_name", scope: !26, file: !24, line: 533, baseType: !43, size: 64, align: 64, offset: 1728)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "default_screen", scope: !26, file: !24, line: 534, baseType: !34, size: 32, align: 32, offset: 1792)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "nscreens", scope: !26, file: !24, line: 535, baseType: !34, size: 32, align: 32, offset: 1824)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "screens", scope: !26, file: !24, line: 536, baseType: !104, size: 64, align: 64, offset: 1856)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "Screen", file: !24, line: 275, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 257, size: 1024, align: 64, elements: !107)
!107 = !{!108, !109, !110, !112, !113, !114, !115, !116, !117, !138, !139, !140, !144, !146, !147, !148, !149, !150, !151, !152}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !106, file: !24, line: 258, baseType: !29, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !106, file: !24, line: 259, baseType: !64, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !106, file: !24, line: 260, baseType: !111, size: 64, align: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "Window", file: !55, line: 96, baseType: !54)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !106, file: !24, line: 261, baseType: !34, size: 32, align: 32, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !106, file: !24, line: 261, baseType: !34, size: 32, align: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "mwidth", scope: !106, file: !24, line: 262, baseType: !34, size: 32, align: 32, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "mheight", scope: !106, file: !24, line: 262, baseType: !34, size: 32, align: 32, offset: 288)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ndepths", scope: !106, file: !24, line: 263, baseType: !34, size: 32, align: 32, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "depths", scope: !106, file: !24, line: 264, baseType: !118, size: 64, align: 64, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "Depth", file: !24, line: 247, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 243, size: 128, align: 64, elements: !121)
!121 = !{!122, !123, !124}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !120, file: !24, line: 244, baseType: !34, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nvisuals", scope: !120, file: !24, line: 245, baseType: !34, size: 32, align: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "visuals", scope: !120, file: !24, line: 246, baseType: !125, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "Visual", file: !24, line: 238, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 227, size: 448, align: 64, elements: !128)
!128 = !{!129, !130, !132, !133, !134, !135, !136, !137}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !127, file: !24, line: 228, baseType: !29, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "visualid", scope: !127, file: !24, line: 229, baseType: !131, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "VisualID", file: !55, line: 76, baseType: !56)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !127, file: !24, line: 233, baseType: !34, size: 32, align: 32, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !127, file: !24, line: 235, baseType: !56, size: 64, align: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !127, file: !24, line: 235, baseType: !56, size: 64, align: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !127, file: !24, line: 235, baseType: !56, size: 64, align: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !127, file: !24, line: 236, baseType: !34, size: 32, align: 32, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "map_entries", scope: !127, file: !24, line: 237, baseType: !34, size: 32, align: 32, offset: 416)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "root_depth", scope: !106, file: !24, line: 265, baseType: !34, size: 32, align: 32, offset: 448)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "root_visual", scope: !106, file: !24, line: 266, baseType: !125, size: 64, align: 64, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "default_gc", scope: !106, file: !24, line: 267, baseType: !141, size: 64, align: 64, offset: 576)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "GC", file: !24, line: 222, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XGC", file: !24, line: 214, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !106, file: !24, line: 268, baseType: !145, size: 64, align: 64, offset: 640)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colormap", file: !55, line: 104, baseType: !54)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "white_pixel", scope: !106, file: !24, line: 269, baseType: !56, size: 64, align: 64, offset: 704)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "black_pixel", scope: !106, file: !24, line: 270, baseType: !56, size: 64, align: 64, offset: 768)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "max_maps", scope: !106, file: !24, line: 271, baseType: !34, size: 32, align: 32, offset: 832)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "min_maps", scope: !106, file: !24, line: 271, baseType: !34, size: 32, align: 32, offset: 864)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "backing_store", scope: !106, file: !24, line: 272, baseType: !34, size: 32, align: 32, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "save_unders", scope: !106, file: !24, line: 273, baseType: !34, size: 32, align: 32, offset: 928)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "root_input_mask", scope: !106, file: !24, line: 274, baseType: !153, size: 64, align: 64, offset: 960)
!153 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "motion_buffer", scope: !26, file: !24, line: 537, baseType: !56, size: 64, align: 64, offset: 1920)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "private16", scope: !26, file: !24, line: 538, baseType: !56, size: 64, align: 64, offset: 1984)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "min_keycode", scope: !26, file: !24, line: 539, baseType: !34, size: 32, align: 32, offset: 2048)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "max_keycode", scope: !26, file: !24, line: 540, baseType: !34, size: 32, align: 32, offset: 2080)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "private17", scope: !26, file: !24, line: 541, baseType: !42, size: 64, align: 64, offset: 2112)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "private18", scope: !26, file: !24, line: 542, baseType: !42, size: 64, align: 64, offset: 2176)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "private19", scope: !26, file: !24, line: 543, baseType: !34, size: 32, align: 32, offset: 2240)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "xdefaults", scope: !26, file: !24, line: 544, baseType: !43, size: 64, align: 64, offset: 2304)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atom", file: !55, line: 74, baseType: !56)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !169, line: 43, baseType: !92)
!169 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!171 = !{!172, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186}
!172 = distinct !DIGlobalVariable(name: "g_net_wm_state_maximized_vert_atom", scope: !0, file: !173, line: 36, type: !166, isLocal: true, isDefinition: true, variable: i64* @g_net_wm_state_maximized_vert_atom)
!173 = !DIFile(filename: "ewmhints.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!174 = distinct !DIGlobalVariable(name: "g_net_wm_state_maximized_horz_atom", scope: !0, file: !173, line: 36, type: !166, isLocal: true, isDefinition: true, variable: i64* @g_net_wm_state_maximized_horz_atom)
!175 = distinct !DIGlobalVariable(name: "g_net_wm_state_hidden_atom", scope: !0, file: !173, line: 37, type: !166, isLocal: true, isDefinition: true, variable: i64* @g_net_wm_state_hidden_atom)
!176 = distinct !DIGlobalVariable(name: "g_net_wm_name_atom", scope: !0, file: !173, line: 37, type: !166, isLocal: true, isDefinition: true, variable: i64* @g_net_wm_name_atom)
!177 = distinct !DIGlobalVariable(name: "g_utf8_string_atom", scope: !0, file: !173, line: 37, type: !166, isLocal: true, isDefinition: true, variable: i64* @g_utf8_string_atom)
!178 = distinct !DIGlobalVariable(name: "g_net_wm_state_skip_taskbar_atom", scope: !0, file: !173, line: 38, type: !166, isLocal: true, isDefinition: true, variable: i64* @g_net_wm_state_skip_taskbar_atom)
!179 = distinct !DIGlobalVariable(name: "g_net_wm_state_skip_pager_atom", scope: !0, file: !173, line: 38, type: !166, isLocal: true, isDefinition: true, variable: i64* @g_net_wm_state_skip_pager_atom)
!180 = distinct !DIGlobalVariable(name: "g_net_wm_state_modal_atom", scope: !0, file: !173, line: 39, type: !166, isLocal: true, isDefinition: true, variable: i64* @g_net_wm_state_modal_atom)
!181 = distinct !DIGlobalVariable(name: "g_net_wm_icon_atom", scope: !0, file: !173, line: 39, type: !166, isLocal: true, isDefinition: true, variable: i64* @g_net_wm_icon_atom)
!182 = distinct !DIGlobalVariable(name: "g_net_wm_state_above_atom", scope: !0, file: !173, line: 39, type: !166, isLocal: true, isDefinition: true, variable: i64* @g_net_wm_state_above_atom)
!183 = distinct !DIGlobalVariable(name: "g_net_wm_pid_atom", scope: !0, file: !173, line: 39, type: !166, isLocal: true, isDefinition: true, variable: i64* @g_net_wm_pid_atom)
!184 = distinct !DIGlobalVariable(name: "g_net_wm_state_atom", scope: !0, file: !173, line: 41, type: !166, isLocal: false, isDefinition: true, variable: i64* @g_net_wm_state_atom)
!185 = distinct !DIGlobalVariable(name: "g_net_wm_desktop_atom", scope: !0, file: !173, line: 41, type: !166, isLocal: false, isDefinition: true, variable: i64* @g_net_wm_desktop_atom)
!186 = distinct !DIGlobalVariable(name: "g_net_wm_ping_atom", scope: !0, file: !173, line: 41, type: !166, isLocal: false, isDefinition: true, variable: i64* @g_net_wm_ping_atom)
!187 = !{i32 2, !"Dwarf Version", i32 4}
!188 = !{i32 2, !"Debug Info Version", i32 3}
!189 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!190 = distinct !DISubprogram(name: "get_current_workarea", scope: !173, file: !173, line: 134, type: !191, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !193)
!191 = !DISubroutineType(types: !192)
!192 = !{!34, !167, !167, !167, !167}
!193 = !{}
!194 = !DILocalVariable(name: "x", arg: 1, scope: !190, file: !173, line: 134, type: !167)
!195 = !DIExpression()
!196 = !DILocation(line: 134, column: 31, scope: !190)
!197 = !DILocalVariable(name: "y", arg: 2, scope: !190, file: !173, line: 134, type: !167)
!198 = !DILocation(line: 134, column: 43, scope: !190)
!199 = !DILocalVariable(name: "width", arg: 3, scope: !190, file: !173, line: 134, type: !167)
!200 = !DILocation(line: 134, column: 55, scope: !190)
!201 = !DILocalVariable(name: "height", arg: 4, scope: !190, file: !173, line: 134, type: !167)
!202 = !DILocation(line: 134, column: 71, scope: !190)
!203 = !DILocalVariable(name: "current_desktop", scope: !190, file: !173, line: 136, type: !34)
!204 = !DILocation(line: 136, column: 6, scope: !190)
!205 = !DILocalVariable(name: "nitems_return", scope: !190, file: !173, line: 137, type: !56)
!206 = !DILocation(line: 137, column: 16, scope: !190)
!207 = !DILocalVariable(name: "prop_return", scope: !190, file: !173, line: 138, type: !164)
!208 = !DILocation(line: 138, column: 17, scope: !190)
!209 = !DILocalVariable(name: "return_words", scope: !190, file: !173, line: 139, type: !162)
!210 = !DILocation(line: 139, column: 8, scope: !190)
!211 = !DILocalVariable(name: "net_workarea_x_offset", scope: !190, file: !173, line: 140, type: !212)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!213 = !DILocation(line: 140, column: 15, scope: !190)
!214 = !DILocalVariable(name: "net_workarea_y_offset", scope: !190, file: !173, line: 141, type: !212)
!215 = !DILocation(line: 141, column: 15, scope: !190)
!216 = !DILocalVariable(name: "net_workarea_width_offset", scope: !190, file: !173, line: 142, type: !212)
!217 = !DILocation(line: 142, column: 15, scope: !190)
!218 = !DILocalVariable(name: "net_workarea_height_offset", scope: !190, file: !173, line: 143, type: !212)
!219 = !DILocation(line: 143, column: 15, scope: !190)
!220 = !DILocalVariable(name: "max_prop_length", scope: !190, file: !173, line: 144, type: !212)
!221 = !DILocation(line: 144, column: 15, scope: !190)
!222 = !DILocation(line: 147, column: 6, scope: !223)
!223 = distinct !DILexicalBlock(scope: !190, file: !173, line: 146, column: 6)
!224 = !DILocation(line: 147, column: 9, scope: !223)
!225 = !DILocation(line: 147, column: 28, scope: !223)
!226 = !DILocation(line: 146, column: 6, scope: !223)
!227 = !DILocation(line: 148, column: 24, scope: !223)
!228 = !DILocation(line: 146, column: 6, scope: !190)
!229 = !DILocation(line: 149, column: 3, scope: !223)
!230 = !DILocation(line: 151, column: 6, scope: !231)
!231 = distinct !DILexicalBlock(scope: !190, file: !173, line: 151, column: 6)
!232 = !DILocation(line: 151, column: 20, scope: !231)
!233 = !DILocation(line: 151, column: 6, scope: !190)
!234 = !DILocation(line: 153, column: 3, scope: !235)
!235 = distinct !DILexicalBlock(scope: !231, file: !173, line: 152, column: 2)
!236 = !DILocation(line: 154, column: 3, scope: !235)
!237 = !DILocation(line: 157, column: 20, scope: !190)
!238 = !DILocation(line: 157, column: 18, scope: !190)
!239 = !DILocation(line: 159, column: 6, scope: !240)
!240 = distinct !DILexicalBlock(scope: !190, file: !173, line: 159, column: 6)
!241 = !DILocation(line: 159, column: 22, scope: !240)
!242 = !DILocation(line: 159, column: 6, scope: !190)
!243 = !DILocation(line: 160, column: 3, scope: !240)
!244 = !DILocation(line: 162, column: 26, scope: !190)
!245 = !DILocation(line: 162, column: 17, scope: !190)
!246 = !DILocation(line: 162, column: 15, scope: !190)
!247 = !DILocation(line: 164, column: 20, scope: !190)
!248 = !DILocation(line: 164, column: 36, scope: !190)
!249 = !DILocation(line: 164, column: 40, scope: !190)
!250 = !DILocation(line: 164, column: 7, scope: !190)
!251 = !DILocation(line: 164, column: 3, scope: !190)
!252 = !DILocation(line: 164, column: 5, scope: !190)
!253 = !DILocation(line: 165, column: 20, scope: !190)
!254 = !DILocation(line: 165, column: 36, scope: !190)
!255 = !DILocation(line: 165, column: 40, scope: !190)
!256 = !DILocation(line: 165, column: 7, scope: !190)
!257 = !DILocation(line: 165, column: 3, scope: !190)
!258 = !DILocation(line: 165, column: 5, scope: !190)
!259 = !DILocation(line: 166, column: 24, scope: !190)
!260 = !DILocation(line: 166, column: 40, scope: !190)
!261 = !DILocation(line: 166, column: 44, scope: !190)
!262 = !DILocation(line: 166, column: 11, scope: !190)
!263 = !DILocation(line: 166, column: 3, scope: !190)
!264 = !DILocation(line: 166, column: 9, scope: !190)
!265 = !DILocation(line: 167, column: 25, scope: !190)
!266 = !DILocation(line: 167, column: 41, scope: !190)
!267 = !DILocation(line: 167, column: 45, scope: !190)
!268 = !DILocation(line: 167, column: 12, scope: !190)
!269 = !DILocation(line: 167, column: 3, scope: !190)
!270 = !DILocation(line: 167, column: 10, scope: !190)
!271 = !DILocation(line: 169, column: 8, scope: !190)
!272 = !DILocation(line: 169, column: 2, scope: !190)
!273 = !DILocation(line: 171, column: 2, scope: !190)
!274 = !DILocation(line: 173, column: 1, scope: !190)
!275 = distinct !DISubprogram(name: "get_property_value", scope: !173, file: !173, line: 48, type: !276, isLocal: true, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !193)
!276 = !DISubroutineType(types: !277)
!277 = !{!34, !111, !43, !153, !163, !278, !34}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!279 = !DILocalVariable(name: "wnd", arg: 1, scope: !275, file: !173, line: 48, type: !111)
!280 = !DILocation(line: 48, column: 27, scope: !275)
!281 = !DILocalVariable(name: "propname", arg: 2, scope: !275, file: !173, line: 48, type: !43)
!282 = !DILocation(line: 48, column: 38, scope: !275)
!283 = !DILocalVariable(name: "max_length", arg: 3, scope: !275, file: !173, line: 48, type: !153)
!284 = !DILocation(line: 48, column: 53, scope: !275)
!285 = !DILocalVariable(name: "nitems_return", arg: 4, scope: !275, file: !173, line: 49, type: !163)
!286 = !DILocation(line: 49, column: 21, scope: !275)
!287 = !DILocalVariable(name: "prop_return", arg: 5, scope: !275, file: !173, line: 49, type: !278)
!288 = !DILocation(line: 49, column: 52, scope: !275)
!289 = !DILocalVariable(name: "nowarn", arg: 6, scope: !275, file: !173, line: 49, type: !34)
!290 = !DILocation(line: 49, column: 69, scope: !275)
!291 = !DILocalVariable(name: "result", scope: !275, file: !173, line: 51, type: !34)
!292 = !DILocation(line: 51, column: 6, scope: !275)
!293 = !DILocalVariable(name: "property", scope: !275, file: !173, line: 52, type: !166)
!294 = !DILocation(line: 52, column: 7, scope: !275)
!295 = !DILocalVariable(name: "actual_type_return", scope: !275, file: !173, line: 53, type: !166)
!296 = !DILocation(line: 53, column: 7, scope: !275)
!297 = !DILocalVariable(name: "actual_format_return", scope: !275, file: !173, line: 54, type: !34)
!298 = !DILocation(line: 54, column: 6, scope: !275)
!299 = !DILocalVariable(name: "bytes_after_return", scope: !275, file: !173, line: 55, type: !56)
!300 = !DILocation(line: 55, column: 16, scope: !275)
!301 = !DILocation(line: 57, column: 25, scope: !275)
!302 = !DILocation(line: 57, column: 36, scope: !275)
!303 = !DILocation(line: 57, column: 13, scope: !275)
!304 = !DILocation(line: 57, column: 11, scope: !275)
!305 = !DILocation(line: 58, column: 6, scope: !306)
!306 = distinct !DILexicalBlock(scope: !275, file: !173, line: 58, column: 6)
!307 = !DILocation(line: 58, column: 15, scope: !306)
!308 = !DILocation(line: 58, column: 6, scope: !275)
!309 = !DILocation(line: 60, column: 72, scope: !310)
!310 = distinct !DILexicalBlock(scope: !306, file: !173, line: 59, column: 2)
!311 = !DILocation(line: 60, column: 3, scope: !310)
!312 = !DILocation(line: 61, column: 3, scope: !310)
!313 = !DILocation(line: 64, column: 30, scope: !275)
!314 = !DILocation(line: 64, column: 41, scope: !275)
!315 = !DILocation(line: 64, column: 46, scope: !275)
!316 = !DILocation(line: 65, column: 9, scope: !275)
!317 = !DILocation(line: 70, column: 9, scope: !275)
!318 = !DILocation(line: 70, column: 45, scope: !275)
!319 = !DILocation(line: 64, column: 11, scope: !275)
!320 = !DILocation(line: 64, column: 9, scope: !275)
!321 = !DILocation(line: 72, column: 6, scope: !322)
!322 = distinct !DILexicalBlock(scope: !275, file: !173, line: 72, column: 6)
!323 = !DILocation(line: 72, column: 13, scope: !322)
!324 = !DILocation(line: 72, column: 6, scope: !275)
!325 = !DILocation(line: 74, column: 3, scope: !326)
!326 = distinct !DILexicalBlock(scope: !322, file: !173, line: 73, column: 2)
!327 = !DILocation(line: 75, column: 3, scope: !326)
!328 = !DILocation(line: 78, column: 6, scope: !329)
!329 = distinct !DILexicalBlock(scope: !275, file: !173, line: 78, column: 6)
!330 = !DILocation(line: 78, column: 25, scope: !329)
!331 = !DILocation(line: 78, column: 32, scope: !329)
!332 = !DILocation(line: 78, column: 35, scope: !333)
!333 = !DILexicalBlockFile(scope: !329, file: !173, discriminator: 1)
!334 = !DILocation(line: 78, column: 56, scope: !333)
!335 = !DILocation(line: 78, column: 6, scope: !333)
!336 = !DILocation(line: 80, column: 8, scope: !337)
!337 = distinct !DILexicalBlock(scope: !338, file: !173, line: 80, column: 7)
!338 = distinct !DILexicalBlock(scope: !329, file: !173, line: 79, column: 2)
!339 = !DILocation(line: 80, column: 7, scope: !338)
!340 = !DILocation(line: 82, column: 11, scope: !337)
!341 = !DILocation(line: 81, column: 4, scope: !337)
!342 = !DILocation(line: 83, column: 3, scope: !338)
!343 = !DILocation(line: 86, column: 6, scope: !344)
!344 = distinct !DILexicalBlock(scope: !275, file: !173, line: 86, column: 6)
!345 = !DILocation(line: 86, column: 6, scope: !275)
!346 = !DILocation(line: 88, column: 75, scope: !347)
!347 = distinct !DILexicalBlock(scope: !344, file: !173, line: 87, column: 2)
!348 = !DILocation(line: 88, column: 3, scope: !347)
!349 = !DILocation(line: 89, column: 3, scope: !347)
!350 = !DILocation(line: 92, column: 6, scope: !351)
!351 = distinct !DILexicalBlock(scope: !275, file: !173, line: 92, column: 6)
!352 = !DILocation(line: 92, column: 27, scope: !351)
!353 = !DILocation(line: 92, column: 6, scope: !275)
!354 = !DILocation(line: 94, column: 72, scope: !355)
!355 = distinct !DILexicalBlock(scope: !351, file: !173, line: 93, column: 2)
!356 = !DILocation(line: 94, column: 3, scope: !355)
!357 = !DILocation(line: 95, column: 3, scope: !355)
!358 = !DILocation(line: 98, column: 2, scope: !275)
!359 = !DILocation(line: 99, column: 1, scope: !275)
!360 = distinct !DISubprogram(name: "get_current_desktop", scope: !173, file: !173, line: 106, type: !361, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !193)
!361 = !DISubroutineType(types: !362)
!362 = !{!34}
!363 = !DILocalVariable(name: "nitems_return", scope: !360, file: !173, line: 108, type: !56)
!364 = !DILocation(line: 108, column: 16, scope: !360)
!365 = !DILocalVariable(name: "prop_return", scope: !360, file: !173, line: 109, type: !164)
!366 = !DILocation(line: 109, column: 17, scope: !360)
!367 = !DILocalVariable(name: "current_desktop", scope: !360, file: !173, line: 110, type: !34)
!368 = !DILocation(line: 110, column: 6, scope: !360)
!369 = !DILocation(line: 113, column: 6, scope: !370)
!370 = distinct !DILexicalBlock(scope: !360, file: !173, line: 112, column: 6)
!371 = !DILocation(line: 113, column: 9, scope: !370)
!372 = !DILocation(line: 113, column: 28, scope: !370)
!373 = !DILocation(line: 112, column: 6, scope: !370)
!374 = !DILocation(line: 114, column: 24, scope: !370)
!375 = !DILocation(line: 112, column: 6, scope: !360)
!376 = !DILocation(line: 115, column: 3, scope: !370)
!377 = !DILocation(line: 117, column: 6, scope: !378)
!378 = distinct !DILexicalBlock(scope: !360, file: !173, line: 117, column: 6)
!379 = !DILocation(line: 117, column: 20, scope: !378)
!380 = !DILocation(line: 117, column: 6, scope: !360)
!381 = !DILocation(line: 119, column: 3, scope: !382)
!382 = distinct !DILexicalBlock(scope: !378, file: !173, line: 118, column: 2)
!383 = !DILocation(line: 120, column: 3, scope: !382)
!384 = !DILocation(line: 123, column: 21, scope: !360)
!385 = !DILocation(line: 123, column: 20, scope: !360)
!386 = !DILocation(line: 123, column: 18, scope: !360)
!387 = !DILocation(line: 124, column: 8, scope: !360)
!388 = !DILocation(line: 124, column: 2, scope: !360)
!389 = !DILocation(line: 125, column: 9, scope: !360)
!390 = !DILocation(line: 125, column: 2, scope: !360)
!391 = !DILocation(line: 126, column: 1, scope: !360)
!392 = distinct !DISubprogram(name: "ewmh_init", scope: !173, file: !173, line: 178, type: !393, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !193)
!393 = !DISubroutineType(types: !394)
!394 = !{null}
!395 = !DILocation(line: 182, column: 15, scope: !392)
!396 = !DILocation(line: 182, column: 3, scope: !392)
!397 = !DILocation(line: 181, column: 37, scope: !392)
!398 = !DILocation(line: 184, column: 15, scope: !392)
!399 = !DILocation(line: 184, column: 3, scope: !392)
!400 = !DILocation(line: 183, column: 37, scope: !392)
!401 = !DILocation(line: 185, column: 43, scope: !392)
!402 = !DILocation(line: 185, column: 31, scope: !392)
!403 = !DILocation(line: 185, column: 29, scope: !392)
!404 = !DILocation(line: 187, column: 15, scope: !392)
!405 = !DILocation(line: 187, column: 3, scope: !392)
!406 = !DILocation(line: 186, column: 35, scope: !392)
!407 = !DILocation(line: 188, column: 47, scope: !392)
!408 = !DILocation(line: 188, column: 35, scope: !392)
!409 = !DILocation(line: 188, column: 33, scope: !392)
!410 = !DILocation(line: 189, column: 42, scope: !392)
!411 = !DILocation(line: 189, column: 30, scope: !392)
!412 = !DILocation(line: 189, column: 28, scope: !392)
!413 = !DILocation(line: 190, column: 42, scope: !392)
!414 = !DILocation(line: 190, column: 30, scope: !392)
!415 = !DILocation(line: 190, column: 28, scope: !392)
!416 = !DILocation(line: 191, column: 36, scope: !392)
!417 = !DILocation(line: 191, column: 24, scope: !392)
!418 = !DILocation(line: 191, column: 22, scope: !392)
!419 = !DILocation(line: 192, column: 38, scope: !392)
!420 = !DILocation(line: 192, column: 26, scope: !392)
!421 = !DILocation(line: 192, column: 24, scope: !392)
!422 = !DILocation(line: 193, column: 35, scope: !392)
!423 = !DILocation(line: 193, column: 23, scope: !392)
!424 = !DILocation(line: 193, column: 21, scope: !392)
!425 = !DILocation(line: 194, column: 35, scope: !392)
!426 = !DILocation(line: 194, column: 23, scope: !392)
!427 = !DILocation(line: 194, column: 21, scope: !392)
!428 = !DILocation(line: 195, column: 34, scope: !392)
!429 = !DILocation(line: 195, column: 22, scope: !392)
!430 = !DILocation(line: 195, column: 20, scope: !392)
!431 = !DILocation(line: 196, column: 35, scope: !392)
!432 = !DILocation(line: 196, column: 23, scope: !392)
!433 = !DILocation(line: 196, column: 21, scope: !392)
!434 = !DILocation(line: 197, column: 35, scope: !392)
!435 = !DILocation(line: 197, column: 23, scope: !392)
!436 = !DILocation(line: 197, column: 21, scope: !392)
!437 = !DILocation(line: 198, column: 1, scope: !392)
!438 = distinct !DISubprogram(name: "ewmh_get_window_state", scope: !173, file: !173, line: 206, type: !439, isLocal: false, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !193)
!439 = !DISubroutineType(types: !440)
!440 = !{!34, !111}
!441 = !DILocalVariable(name: "w", arg: 1, scope: !438, file: !173, line: 206, type: !111)
!442 = !DILocation(line: 206, column: 30, scope: !438)
!443 = !DILocalVariable(name: "nitems_return", scope: !438, file: !173, line: 208, type: !56)
!444 = !DILocation(line: 208, column: 16, scope: !438)
!445 = !DILocalVariable(name: "prop_return", scope: !438, file: !173, line: 209, type: !164)
!446 = !DILocation(line: 209, column: 17, scope: !438)
!447 = !DILocalVariable(name: "return_words", scope: !438, file: !173, line: 210, type: !163)
!448 = !DILocation(line: 210, column: 17, scope: !438)
!449 = !DILocalVariable(name: "item", scope: !438, file: !173, line: 211, type: !56)
!450 = !DILocation(line: 211, column: 16, scope: !438)
!451 = !DILocalVariable(name: "maximized_vert", scope: !438, file: !173, line: 212, type: !452)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !169, line: 28, baseType: !34)
!453 = !DILocation(line: 212, column: 10, scope: !438)
!454 = !DILocalVariable(name: "maximized_horz", scope: !438, file: !173, line: 212, type: !452)
!455 = !DILocation(line: 212, column: 26, scope: !438)
!456 = !DILocalVariable(name: "hidden", scope: !438, file: !173, line: 212, type: !452)
!457 = !DILocation(line: 212, column: 42, scope: !438)
!458 = !DILocation(line: 214, column: 43, scope: !438)
!459 = !DILocation(line: 214, column: 34, scope: !438)
!460 = !DILocation(line: 214, column: 17, scope: !438)
!461 = !DILocation(line: 216, column: 25, scope: !462)
!462 = distinct !DILexicalBlock(scope: !438, file: !173, line: 216, column: 6)
!463 = !DILocation(line: 216, column: 6, scope: !462)
!464 = !DILocation(line: 216, column: 82, scope: !462)
!465 = !DILocation(line: 216, column: 6, scope: !438)
!466 = !DILocation(line: 217, column: 3, scope: !462)
!467 = !DILocation(line: 219, column: 35, scope: !438)
!468 = !DILocation(line: 219, column: 17, scope: !438)
!469 = !DILocation(line: 219, column: 15, scope: !438)
!470 = !DILocation(line: 221, column: 12, scope: !471)
!471 = distinct !DILexicalBlock(scope: !438, file: !173, line: 221, column: 2)
!472 = !DILocation(line: 221, column: 7, scope: !471)
!473 = !DILocation(line: 221, column: 17, scope: !474)
!474 = !DILexicalBlockFile(scope: !475, file: !173, discriminator: 1)
!475 = distinct !DILexicalBlock(scope: !471, file: !173, line: 221, column: 2)
!476 = !DILocation(line: 221, column: 24, scope: !474)
!477 = !DILocation(line: 221, column: 22, scope: !474)
!478 = !DILocation(line: 221, column: 2, scope: !474)
!479 = !DILocation(line: 223, column: 20, scope: !480)
!480 = distinct !DILexicalBlock(scope: !481, file: !173, line: 223, column: 7)
!481 = distinct !DILexicalBlock(scope: !475, file: !173, line: 222, column: 2)
!482 = !DILocation(line: 223, column: 7, scope: !480)
!483 = !DILocation(line: 223, column: 29, scope: !480)
!484 = !DILocation(line: 223, column: 26, scope: !480)
!485 = !DILocation(line: 223, column: 7, scope: !481)
!486 = !DILocation(line: 224, column: 19, scope: !480)
!487 = !DILocation(line: 224, column: 4, scope: !480)
!488 = !DILocation(line: 225, column: 20, scope: !489)
!489 = distinct !DILexicalBlock(scope: !481, file: !173, line: 225, column: 7)
!490 = !DILocation(line: 225, column: 7, scope: !489)
!491 = !DILocation(line: 225, column: 29, scope: !489)
!492 = !DILocation(line: 225, column: 26, scope: !489)
!493 = !DILocation(line: 225, column: 7, scope: !481)
!494 = !DILocation(line: 226, column: 19, scope: !489)
!495 = !DILocation(line: 226, column: 4, scope: !489)
!496 = !DILocation(line: 227, column: 20, scope: !497)
!497 = distinct !DILexicalBlock(scope: !481, file: !173, line: 227, column: 7)
!498 = !DILocation(line: 227, column: 7, scope: !497)
!499 = !DILocation(line: 227, column: 29, scope: !497)
!500 = !DILocation(line: 227, column: 26, scope: !497)
!501 = !DILocation(line: 227, column: 7, scope: !481)
!502 = !DILocation(line: 228, column: 11, scope: !497)
!503 = !DILocation(line: 228, column: 4, scope: !497)
!504 = !DILocation(line: 229, column: 2, scope: !481)
!505 = !DILocation(line: 221, column: 43, scope: !506)
!506 = !DILexicalBlockFile(scope: !475, file: !173, discriminator: 2)
!507 = !DILocation(line: 221, column: 2, scope: !506)
!508 = distinct !{!508, !509}
!509 = !DILocation(line: 221, column: 2, scope: !438)
!510 = !DILocation(line: 231, column: 8, scope: !438)
!511 = !DILocation(line: 231, column: 2, scope: !438)
!512 = !DILocation(line: 234, column: 6, scope: !513)
!513 = distinct !DILexicalBlock(scope: !438, file: !173, line: 234, column: 6)
!514 = !DILocation(line: 234, column: 6, scope: !438)
!515 = !DILocation(line: 235, column: 3, scope: !513)
!516 = !DILocation(line: 236, column: 11, scope: !517)
!517 = distinct !DILexicalBlock(scope: !513, file: !173, line: 236, column: 11)
!518 = !DILocation(line: 236, column: 26, scope: !517)
!519 = !DILocation(line: 236, column: 29, scope: !520)
!520 = !DILexicalBlockFile(scope: !517, file: !173, discriminator: 1)
!521 = !DILocation(line: 236, column: 11, scope: !520)
!522 = !DILocation(line: 237, column: 3, scope: !517)
!523 = !DILocation(line: 239, column: 3, scope: !517)
!524 = !DILocation(line: 240, column: 1, scope: !438)
!525 = distinct !DISubprogram(name: "ewmh_change_state", scope: !173, file: !173, line: 336, type: !526, isLocal: false, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !193)
!526 = !DISubroutineType(types: !527)
!527 = !{!34, !111, !34}
!528 = !DILocalVariable(name: "wnd", arg: 1, scope: !525, file: !173, line: 336, type: !111)
!529 = !DILocation(line: 336, column: 26, scope: !525)
!530 = !DILocalVariable(name: "state", arg: 2, scope: !525, file: !173, line: 336, type: !34)
!531 = !DILocation(line: 336, column: 35, scope: !525)
!532 = !DILocation(line: 341, column: 6, scope: !533)
!533 = distinct !DILexicalBlock(scope: !525, file: !173, line: 341, column: 6)
!534 = !DILocation(line: 341, column: 12, scope: !533)
!535 = !DILocation(line: 341, column: 6, scope: !525)
!536 = !DILocation(line: 344, column: 8, scope: !537)
!537 = distinct !DILexicalBlock(scope: !538, file: !173, line: 343, column: 7)
!538 = distinct !DILexicalBlock(scope: !533, file: !173, line: 342, column: 2)
!539 = !DILocation(line: 344, column: 16, scope: !537)
!540 = !DILocation(line: 345, column: 8, scope: !537)
!541 = !DILocation(line: 343, column: 7, scope: !537)
!542 = !DILocation(line: 345, column: 44, scope: !537)
!543 = !DILocation(line: 343, column: 7, scope: !538)
!544 = !DILocation(line: 346, column: 4, scope: !537)
!545 = !DILocation(line: 347, column: 2, scope: !538)
!546 = !DILocation(line: 351, column: 8, scope: !547)
!547 = distinct !DILexicalBlock(scope: !548, file: !173, line: 350, column: 7)
!548 = distinct !DILexicalBlock(scope: !533, file: !173, line: 349, column: 2)
!549 = !DILocation(line: 351, column: 16, scope: !547)
!550 = !DILocation(line: 352, column: 8, scope: !547)
!551 = !DILocation(line: 350, column: 7, scope: !547)
!552 = !DILocation(line: 352, column: 44, scope: !547)
!553 = !DILocation(line: 350, column: 7, scope: !548)
!554 = !DILocation(line: 353, column: 4, scope: !547)
!555 = !DILocation(line: 356, column: 2, scope: !525)
!556 = !DILocation(line: 357, column: 1, scope: !525)
!557 = distinct !DISubprogram(name: "ewmh_modify_state", scope: !173, file: !173, line: 243, type: !558, isLocal: true, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !193)
!558 = !DISubroutineType(types: !559)
!559 = !{!34, !111, !34, !166, !166}
!560 = !DILocalVariable(name: "wnd", arg: 1, scope: !557, file: !173, line: 243, type: !111)
!561 = !DILocation(line: 243, column: 26, scope: !557)
!562 = !DILocalVariable(name: "add", arg: 2, scope: !557, file: !173, line: 243, type: !34)
!563 = !DILocation(line: 243, column: 35, scope: !557)
!564 = !DILocalVariable(name: "atom1", arg: 3, scope: !557, file: !173, line: 243, type: !166)
!565 = !DILocation(line: 243, column: 45, scope: !557)
!566 = !DILocalVariable(name: "atom2", arg: 4, scope: !557, file: !173, line: 243, type: !166)
!567 = !DILocation(line: 243, column: 57, scope: !557)
!568 = !DILocalVariable(name: "status", scope: !557, file: !173, line: 245, type: !34)
!569 = !DILocation(line: 245, column: 8, scope: !557)
!570 = !DILocalVariable(name: "xevent", scope: !557, file: !173, line: 246, type: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "XEvent", file: !24, line: 1009, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_XEvent", file: !24, line: 973, size: 1536, align: 64, elements: !573)
!573 = !{!574, !575, !586, !606, !625, !644, !665, !676, !690, !707, !718, !728, !744, !754, !765, !776, !786, !800, !817, !829, !840, !858, !869, !880, !892, !903, !917, !930, !942, !969, !981, !992, !1005, !1015, !1028}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !572, file: !24, line: 974, baseType: !34, size: 32, align: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "xany", scope: !572, file: !24, line: 975, baseType: !576, size: 320, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "XAnyEvent", file: !24, line: 940, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 934, size: 320, align: 64, elements: !578)
!578 = !{!579, !580, !581, !582, !585}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !577, file: !24, line: 935, baseType: !34, size: 32, align: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !577, file: !24, line: 936, baseType: !56, size: 64, align: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !577, file: !24, line: 937, baseType: !34, size: 32, align: 32, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !577, file: !24, line: 938, baseType: !583, size: 64, align: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, align: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "Display", file: !24, line: 487, baseType: !65)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !577, file: !24, line: 939, baseType: !111, size: 64, align: 64, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "xkey", scope: !572, file: !24, line: 976, baseType: !587, size: 768, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "XKeyEvent", file: !24, line: 571, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 557, size: 768, align: 64, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !599, !600, !601, !602, !603, !604, !605}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !588, file: !24, line: 558, baseType: !34, size: 32, align: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !588, file: !24, line: 559, baseType: !56, size: 64, align: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !588, file: !24, line: 560, baseType: !34, size: 32, align: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !588, file: !24, line: 561, baseType: !583, size: 64, align: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !588, file: !24, line: 562, baseType: !111, size: 64, align: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !588, file: !24, line: 563, baseType: !111, size: 64, align: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !588, file: !24, line: 564, baseType: !111, size: 64, align: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !588, file: !24, line: 565, baseType: !598, size: 64, align: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time", file: !55, line: 77, baseType: !56)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !588, file: !24, line: 566, baseType: !34, size: 32, align: 32, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !588, file: !24, line: 566, baseType: !34, size: 32, align: 32, offset: 544)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !588, file: !24, line: 567, baseType: !34, size: 32, align: 32, offset: 576)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !588, file: !24, line: 567, baseType: !34, size: 32, align: 32, offset: 608)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !588, file: !24, line: 568, baseType: !92, size: 32, align: 32, offset: 640)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !588, file: !24, line: 569, baseType: !92, size: 32, align: 32, offset: 672)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !588, file: !24, line: 570, baseType: !34, size: 32, align: 32, offset: 704)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "xbutton", scope: !572, file: !24, line: 977, baseType: !607, size: 768, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "XButtonEvent", file: !24, line: 589, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 575, size: 768, align: 64, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !608, file: !24, line: 576, baseType: !34, size: 32, align: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !608, file: !24, line: 577, baseType: !56, size: 64, align: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !608, file: !24, line: 578, baseType: !34, size: 32, align: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !608, file: !24, line: 579, baseType: !583, size: 64, align: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !608, file: !24, line: 580, baseType: !111, size: 64, align: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !608, file: !24, line: 581, baseType: !111, size: 64, align: 64, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !608, file: !24, line: 582, baseType: !111, size: 64, align: 64, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !608, file: !24, line: 583, baseType: !598, size: 64, align: 64, offset: 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !608, file: !24, line: 584, baseType: !34, size: 32, align: 32, offset: 512)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !608, file: !24, line: 584, baseType: !34, size: 32, align: 32, offset: 544)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !608, file: !24, line: 585, baseType: !34, size: 32, align: 32, offset: 576)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !608, file: !24, line: 585, baseType: !34, size: 32, align: 32, offset: 608)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !608, file: !24, line: 586, baseType: !92, size: 32, align: 32, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !608, file: !24, line: 587, baseType: !92, size: 32, align: 32, offset: 672)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !608, file: !24, line: 588, baseType: !34, size: 32, align: 32, offset: 704)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "xmotion", scope: !572, file: !24, line: 978, baseType: !626, size: 768, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMotionEvent", file: !24, line: 607, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 593, size: 768, align: 64, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !627, file: !24, line: 594, baseType: !34, size: 32, align: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !627, file: !24, line: 595, baseType: !56, size: 64, align: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !627, file: !24, line: 596, baseType: !34, size: 32, align: 32, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !627, file: !24, line: 597, baseType: !583, size: 64, align: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !627, file: !24, line: 598, baseType: !111, size: 64, align: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !627, file: !24, line: 599, baseType: !111, size: 64, align: 64, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !627, file: !24, line: 600, baseType: !111, size: 64, align: 64, offset: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !627, file: !24, line: 601, baseType: !598, size: 64, align: 64, offset: 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !627, file: !24, line: 602, baseType: !34, size: 32, align: 32, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !627, file: !24, line: 602, baseType: !34, size: 32, align: 32, offset: 544)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !627, file: !24, line: 603, baseType: !34, size: 32, align: 32, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !627, file: !24, line: 603, baseType: !34, size: 32, align: 32, offset: 608)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !627, file: !24, line: 604, baseType: !92, size: 32, align: 32, offset: 640)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "is_hint", scope: !627, file: !24, line: 605, baseType: !44, size: 8, align: 8, offset: 672)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !627, file: !24, line: 606, baseType: !34, size: 32, align: 32, offset: 704)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "xcrossing", scope: !572, file: !24, line: 979, baseType: !645, size: 832, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCrossingEvent", file: !24, line: 630, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 610, size: 832, align: 64, elements: !647)
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !646, file: !24, line: 611, baseType: !34, size: 32, align: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !646, file: !24, line: 612, baseType: !56, size: 64, align: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !646, file: !24, line: 613, baseType: !34, size: 32, align: 32, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !646, file: !24, line: 614, baseType: !583, size: 64, align: 64, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !646, file: !24, line: 615, baseType: !111, size: 64, align: 64, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !646, file: !24, line: 616, baseType: !111, size: 64, align: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !646, file: !24, line: 617, baseType: !111, size: 64, align: 64, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !646, file: !24, line: 618, baseType: !598, size: 64, align: 64, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !646, file: !24, line: 619, baseType: !34, size: 32, align: 32, offset: 512)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !646, file: !24, line: 619, baseType: !34, size: 32, align: 32, offset: 544)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !646, file: !24, line: 620, baseType: !34, size: 32, align: 32, offset: 576)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !646, file: !24, line: 620, baseType: !34, size: 32, align: 32, offset: 608)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !646, file: !24, line: 621, baseType: !34, size: 32, align: 32, offset: 640)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !646, file: !24, line: 622, baseType: !34, size: 32, align: 32, offset: 672)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !646, file: !24, line: 627, baseType: !34, size: 32, align: 32, offset: 704)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "focus", scope: !646, file: !24, line: 628, baseType: !34, size: 32, align: 32, offset: 736)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !646, file: !24, line: 629, baseType: !92, size: 32, align: 32, offset: 768)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "xfocus", scope: !572, file: !24, line: 980, baseType: !666, size: 384, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "XFocusChangeEvent", file: !24, line: 648, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 634, size: 384, align: 64, elements: !668)
!668 = !{!669, !670, !671, !672, !673, !674, !675}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !667, file: !24, line: 635, baseType: !34, size: 32, align: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !667, file: !24, line: 636, baseType: !56, size: 64, align: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !667, file: !24, line: 637, baseType: !34, size: 32, align: 32, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !667, file: !24, line: 638, baseType: !583, size: 64, align: 64, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !667, file: !24, line: 639, baseType: !111, size: 64, align: 64, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !667, file: !24, line: 640, baseType: !34, size: 32, align: 32, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !667, file: !24, line: 642, baseType: !34, size: 32, align: 32, offset: 352)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "xexpose", scope: !572, file: !24, line: 981, baseType: !677, size: 512, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExposeEvent", file: !24, line: 671, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 662, size: 512, align: 64, elements: !679)
!679 = !{!680, !681, !682, !683, !684, !685, !686, !687, !688, !689}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !678, file: !24, line: 663, baseType: !34, size: 32, align: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !678, file: !24, line: 664, baseType: !56, size: 64, align: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !678, file: !24, line: 665, baseType: !34, size: 32, align: 32, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !678, file: !24, line: 666, baseType: !583, size: 64, align: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !678, file: !24, line: 667, baseType: !111, size: 64, align: 64, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !678, file: !24, line: 668, baseType: !34, size: 32, align: 32, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !678, file: !24, line: 668, baseType: !34, size: 32, align: 32, offset: 352)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !678, file: !24, line: 669, baseType: !34, size: 32, align: 32, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !678, file: !24, line: 669, baseType: !34, size: 32, align: 32, offset: 416)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !678, file: !24, line: 670, baseType: !34, size: 32, align: 32, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "xgraphicsexpose", scope: !572, file: !24, line: 982, baseType: !691, size: 576, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGraphicsExposeEvent", file: !24, line: 684, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 673, size: 576, align: 64, elements: !693)
!693 = !{!694, !695, !696, !697, !698, !700, !701, !702, !703, !704, !705, !706}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !692, file: !24, line: 674, baseType: !34, size: 32, align: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !692, file: !24, line: 675, baseType: !56, size: 64, align: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !692, file: !24, line: 676, baseType: !34, size: 32, align: 32, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !692, file: !24, line: 677, baseType: !583, size: 64, align: 64, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "drawable", scope: !692, file: !24, line: 678, baseType: !699, size: 64, align: 64, offset: 256)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "Drawable", file: !55, line: 97, baseType: !54)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !692, file: !24, line: 679, baseType: !34, size: 32, align: 32, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !692, file: !24, line: 679, baseType: !34, size: 32, align: 32, offset: 352)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !692, file: !24, line: 680, baseType: !34, size: 32, align: 32, offset: 384)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !692, file: !24, line: 680, baseType: !34, size: 32, align: 32, offset: 416)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !692, file: !24, line: 681, baseType: !34, size: 32, align: 32, offset: 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "major_code", scope: !692, file: !24, line: 682, baseType: !34, size: 32, align: 32, offset: 480)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !692, file: !24, line: 683, baseType: !34, size: 32, align: 32, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "xnoexpose", scope: !572, file: !24, line: 983, baseType: !708, size: 384, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "XNoExposeEvent", file: !24, line: 694, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 686, size: 384, align: 64, elements: !710)
!710 = !{!711, !712, !713, !714, !715, !716, !717}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !709, file: !24, line: 687, baseType: !34, size: 32, align: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !709, file: !24, line: 688, baseType: !56, size: 64, align: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !709, file: !24, line: 689, baseType: !34, size: 32, align: 32, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !709, file: !24, line: 690, baseType: !583, size: 64, align: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "drawable", scope: !709, file: !24, line: 691, baseType: !699, size: 64, align: 64, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "major_code", scope: !709, file: !24, line: 692, baseType: !34, size: 32, align: 32, offset: 320)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !709, file: !24, line: 693, baseType: !34, size: 32, align: 32, offset: 352)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "xvisibility", scope: !572, file: !24, line: 984, baseType: !719, size: 384, align: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "XVisibilityEvent", file: !24, line: 703, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 696, size: 384, align: 64, elements: !721)
!721 = !{!722, !723, !724, !725, !726, !727}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !720, file: !24, line: 697, baseType: !34, size: 32, align: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !720, file: !24, line: 698, baseType: !56, size: 64, align: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !720, file: !24, line: 699, baseType: !34, size: 32, align: 32, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !720, file: !24, line: 700, baseType: !583, size: 64, align: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !720, file: !24, line: 701, baseType: !111, size: 64, align: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !720, file: !24, line: 702, baseType: !34, size: 32, align: 32, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "xcreatewindow", scope: !572, file: !24, line: 985, baseType: !729, size: 576, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCreateWindowEvent", file: !24, line: 716, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 705, size: 576, align: 64, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !730, file: !24, line: 706, baseType: !34, size: 32, align: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !730, file: !24, line: 707, baseType: !56, size: 64, align: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !730, file: !24, line: 708, baseType: !34, size: 32, align: 32, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !730, file: !24, line: 709, baseType: !583, size: 64, align: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !730, file: !24, line: 710, baseType: !111, size: 64, align: 64, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !730, file: !24, line: 711, baseType: !111, size: 64, align: 64, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !730, file: !24, line: 712, baseType: !34, size: 32, align: 32, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !730, file: !24, line: 712, baseType: !34, size: 32, align: 32, offset: 416)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !730, file: !24, line: 713, baseType: !34, size: 32, align: 32, offset: 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !730, file: !24, line: 713, baseType: !34, size: 32, align: 32, offset: 480)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !730, file: !24, line: 714, baseType: !34, size: 32, align: 32, offset: 512)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !730, file: !24, line: 715, baseType: !34, size: 32, align: 32, offset: 544)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "xdestroywindow", scope: !572, file: !24, line: 986, baseType: !745, size: 384, align: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDestroyWindowEvent", file: !24, line: 725, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 718, size: 384, align: 64, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !746, file: !24, line: 719, baseType: !34, size: 32, align: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !746, file: !24, line: 720, baseType: !56, size: 64, align: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !746, file: !24, line: 721, baseType: !34, size: 32, align: 32, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !746, file: !24, line: 722, baseType: !583, size: 64, align: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !746, file: !24, line: 723, baseType: !111, size: 64, align: 64, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !746, file: !24, line: 724, baseType: !111, size: 64, align: 64, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "xunmap", scope: !572, file: !24, line: 987, baseType: !755, size: 448, align: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "XUnmapEvent", file: !24, line: 735, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 727, size: 448, align: 64, elements: !757)
!757 = !{!758, !759, !760, !761, !762, !763, !764}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !756, file: !24, line: 728, baseType: !34, size: 32, align: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !756, file: !24, line: 729, baseType: !56, size: 64, align: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !756, file: !24, line: 730, baseType: !34, size: 32, align: 32, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !756, file: !24, line: 731, baseType: !583, size: 64, align: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !756, file: !24, line: 732, baseType: !111, size: 64, align: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !756, file: !24, line: 733, baseType: !111, size: 64, align: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "from_configure", scope: !756, file: !24, line: 734, baseType: !34, size: 32, align: 32, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "xmap", scope: !572, file: !24, line: 988, baseType: !766, size: 448, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMapEvent", file: !24, line: 745, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 737, size: 448, align: 64, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774, !775}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !767, file: !24, line: 738, baseType: !34, size: 32, align: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !767, file: !24, line: 739, baseType: !56, size: 64, align: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !767, file: !24, line: 740, baseType: !34, size: 32, align: 32, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !767, file: !24, line: 741, baseType: !583, size: 64, align: 64, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !767, file: !24, line: 742, baseType: !111, size: 64, align: 64, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !767, file: !24, line: 743, baseType: !111, size: 64, align: 64, offset: 320)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !767, file: !24, line: 744, baseType: !34, size: 32, align: 32, offset: 384)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "xmaprequest", scope: !572, file: !24, line: 989, baseType: !777, size: 384, align: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMapRequestEvent", file: !24, line: 754, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 747, size: 384, align: 64, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !778, file: !24, line: 748, baseType: !34, size: 32, align: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !778, file: !24, line: 749, baseType: !56, size: 64, align: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !778, file: !24, line: 750, baseType: !34, size: 32, align: 32, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !778, file: !24, line: 751, baseType: !583, size: 64, align: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !778, file: !24, line: 752, baseType: !111, size: 64, align: 64, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !778, file: !24, line: 753, baseType: !111, size: 64, align: 64, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "xreparent", scope: !572, file: !24, line: 990, baseType: !787, size: 576, align: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "XReparentEvent", file: !24, line: 766, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 756, size: 576, align: 64, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798, !799}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !788, file: !24, line: 757, baseType: !34, size: 32, align: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !788, file: !24, line: 758, baseType: !56, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !788, file: !24, line: 759, baseType: !34, size: 32, align: 32, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !788, file: !24, line: 760, baseType: !583, size: 64, align: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !788, file: !24, line: 761, baseType: !111, size: 64, align: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !788, file: !24, line: 762, baseType: !111, size: 64, align: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !788, file: !24, line: 763, baseType: !111, size: 64, align: 64, offset: 384)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !788, file: !24, line: 764, baseType: !34, size: 32, align: 32, offset: 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !788, file: !24, line: 764, baseType: !34, size: 32, align: 32, offset: 480)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !788, file: !24, line: 765, baseType: !34, size: 32, align: 32, offset: 512)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "xconfigure", scope: !572, file: !24, line: 991, baseType: !801, size: 704, align: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "XConfigureEvent", file: !24, line: 780, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 768, size: 704, align: 64, elements: !803)
!803 = !{!804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !802, file: !24, line: 769, baseType: !34, size: 32, align: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !802, file: !24, line: 770, baseType: !56, size: 64, align: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !802, file: !24, line: 771, baseType: !34, size: 32, align: 32, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !802, file: !24, line: 772, baseType: !583, size: 64, align: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !802, file: !24, line: 773, baseType: !111, size: 64, align: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !802, file: !24, line: 774, baseType: !111, size: 64, align: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !802, file: !24, line: 775, baseType: !34, size: 32, align: 32, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !802, file: !24, line: 775, baseType: !34, size: 32, align: 32, offset: 416)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !802, file: !24, line: 776, baseType: !34, size: 32, align: 32, offset: 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !802, file: !24, line: 776, baseType: !34, size: 32, align: 32, offset: 480)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !802, file: !24, line: 777, baseType: !34, size: 32, align: 32, offset: 512)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "above", scope: !802, file: !24, line: 778, baseType: !111, size: 64, align: 64, offset: 576)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "override_redirect", scope: !802, file: !24, line: 779, baseType: !34, size: 32, align: 32, offset: 640)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "xgravity", scope: !572, file: !24, line: 992, baseType: !818, size: 448, align: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "XGravityEvent", file: !24, line: 790, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 782, size: 448, align: 64, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !819, file: !24, line: 783, baseType: !34, size: 32, align: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !819, file: !24, line: 784, baseType: !56, size: 64, align: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !819, file: !24, line: 785, baseType: !34, size: 32, align: 32, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !819, file: !24, line: 786, baseType: !583, size: 64, align: 64, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !819, file: !24, line: 787, baseType: !111, size: 64, align: 64, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !819, file: !24, line: 788, baseType: !111, size: 64, align: 64, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !819, file: !24, line: 789, baseType: !34, size: 32, align: 32, offset: 384)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !819, file: !24, line: 789, baseType: !34, size: 32, align: 32, offset: 416)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "xresizerequest", scope: !572, file: !24, line: 993, baseType: !830, size: 384, align: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "XResizeRequestEvent", file: !24, line: 799, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 792, size: 384, align: 64, elements: !832)
!832 = !{!833, !834, !835, !836, !837, !838, !839}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !831, file: !24, line: 793, baseType: !34, size: 32, align: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !831, file: !24, line: 794, baseType: !56, size: 64, align: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !831, file: !24, line: 795, baseType: !34, size: 32, align: 32, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !831, file: !24, line: 796, baseType: !583, size: 64, align: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !831, file: !24, line: 797, baseType: !111, size: 64, align: 64, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !831, file: !24, line: 798, baseType: !34, size: 32, align: 32, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !831, file: !24, line: 798, baseType: !34, size: 32, align: 32, offset: 352)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "xconfigurerequest", scope: !572, file: !24, line: 994, baseType: !841, size: 768, align: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "XConfigureRequestEvent", file: !24, line: 814, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 801, size: 768, align: 64, elements: !843)
!843 = !{!844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !842, file: !24, line: 802, baseType: !34, size: 32, align: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !842, file: !24, line: 803, baseType: !56, size: 64, align: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !842, file: !24, line: 804, baseType: !34, size: 32, align: 32, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !842, file: !24, line: 805, baseType: !583, size: 64, align: 64, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !842, file: !24, line: 806, baseType: !111, size: 64, align: 64, offset: 256)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !842, file: !24, line: 807, baseType: !111, size: 64, align: 64, offset: 320)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !842, file: !24, line: 808, baseType: !34, size: 32, align: 32, offset: 384)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !842, file: !24, line: 808, baseType: !34, size: 32, align: 32, offset: 416)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !842, file: !24, line: 809, baseType: !34, size: 32, align: 32, offset: 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !842, file: !24, line: 809, baseType: !34, size: 32, align: 32, offset: 480)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !842, file: !24, line: 810, baseType: !34, size: 32, align: 32, offset: 512)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "above", scope: !842, file: !24, line: 811, baseType: !111, size: 64, align: 64, offset: 576)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !842, file: !24, line: 812, baseType: !34, size: 32, align: 32, offset: 640)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "value_mask", scope: !842, file: !24, line: 813, baseType: !56, size: 64, align: 64, offset: 704)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "xcirculate", scope: !572, file: !24, line: 995, baseType: !859, size: 448, align: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCirculateEvent", file: !24, line: 824, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 816, size: 448, align: 64, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !860, file: !24, line: 817, baseType: !34, size: 32, align: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !860, file: !24, line: 818, baseType: !56, size: 64, align: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !860, file: !24, line: 819, baseType: !34, size: 32, align: 32, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !860, file: !24, line: 820, baseType: !583, size: 64, align: 64, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !860, file: !24, line: 821, baseType: !111, size: 64, align: 64, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !860, file: !24, line: 822, baseType: !111, size: 64, align: 64, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "place", scope: !860, file: !24, line: 823, baseType: !34, size: 32, align: 32, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "xcirculaterequest", scope: !572, file: !24, line: 996, baseType: !870, size: 448, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "XCirculateRequestEvent", file: !24, line: 834, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 826, size: 448, align: 64, elements: !872)
!872 = !{!873, !874, !875, !876, !877, !878, !879}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !871, file: !24, line: 827, baseType: !34, size: 32, align: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !871, file: !24, line: 828, baseType: !56, size: 64, align: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !871, file: !24, line: 829, baseType: !34, size: 32, align: 32, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !871, file: !24, line: 830, baseType: !583, size: 64, align: 64, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !871, file: !24, line: 831, baseType: !111, size: 64, align: 64, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !871, file: !24, line: 832, baseType: !111, size: 64, align: 64, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "place", scope: !871, file: !24, line: 833, baseType: !34, size: 32, align: 32, offset: 384)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "xproperty", scope: !572, file: !24, line: 997, baseType: !881, size: 512, align: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPropertyEvent", file: !24, line: 845, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 836, size: 512, align: 64, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !882, file: !24, line: 837, baseType: !34, size: 32, align: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !882, file: !24, line: 838, baseType: !56, size: 64, align: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !882, file: !24, line: 839, baseType: !34, size: 32, align: 32, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !882, file: !24, line: 840, baseType: !583, size: 64, align: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !882, file: !24, line: 841, baseType: !111, size: 64, align: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "atom", scope: !882, file: !24, line: 842, baseType: !166, size: 64, align: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !882, file: !24, line: 843, baseType: !598, size: 64, align: 64, offset: 384)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !882, file: !24, line: 844, baseType: !34, size: 32, align: 32, offset: 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "xselectionclear", scope: !572, file: !24, line: 998, baseType: !893, size: 448, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSelectionClearEvent", file: !24, line: 855, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 847, size: 448, align: 64, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !894, file: !24, line: 848, baseType: !34, size: 32, align: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !894, file: !24, line: 849, baseType: !56, size: 64, align: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !894, file: !24, line: 850, baseType: !34, size: 32, align: 32, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !894, file: !24, line: 851, baseType: !583, size: 64, align: 64, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !894, file: !24, line: 852, baseType: !111, size: 64, align: 64, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !894, file: !24, line: 853, baseType: !166, size: 64, align: 64, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !894, file: !24, line: 854, baseType: !598, size: 64, align: 64, offset: 384)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "xselectionrequest", scope: !572, file: !24, line: 999, baseType: !904, size: 640, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSelectionRequestEvent", file: !24, line: 868, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 857, size: 640, align: 64, elements: !906)
!906 = !{!907, !908, !909, !910, !911, !912, !913, !914, !915, !916}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !905, file: !24, line: 858, baseType: !34, size: 32, align: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !905, file: !24, line: 859, baseType: !56, size: 64, align: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !905, file: !24, line: 860, baseType: !34, size: 32, align: 32, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !905, file: !24, line: 861, baseType: !583, size: 64, align: 64, offset: 192)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !905, file: !24, line: 862, baseType: !111, size: 64, align: 64, offset: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "requestor", scope: !905, file: !24, line: 863, baseType: !111, size: 64, align: 64, offset: 320)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !905, file: !24, line: 864, baseType: !166, size: 64, align: 64, offset: 384)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !905, file: !24, line: 865, baseType: !166, size: 64, align: 64, offset: 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "property", scope: !905, file: !24, line: 866, baseType: !166, size: 64, align: 64, offset: 512)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !905, file: !24, line: 867, baseType: !598, size: 64, align: 64, offset: 576)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "xselection", scope: !572, file: !24, line: 1000, baseType: !918, size: 576, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSelectionEvent", file: !24, line: 880, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 870, size: 576, align: 64, elements: !920)
!920 = !{!921, !922, !923, !924, !925, !926, !927, !928, !929}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !919, file: !24, line: 871, baseType: !34, size: 32, align: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !919, file: !24, line: 872, baseType: !56, size: 64, align: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !919, file: !24, line: 873, baseType: !34, size: 32, align: 32, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !919, file: !24, line: 874, baseType: !583, size: 64, align: 64, offset: 192)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "requestor", scope: !919, file: !24, line: 875, baseType: !111, size: 64, align: 64, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "selection", scope: !919, file: !24, line: 876, baseType: !166, size: 64, align: 64, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !919, file: !24, line: 877, baseType: !166, size: 64, align: 64, offset: 384)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "property", scope: !919, file: !24, line: 878, baseType: !166, size: 64, align: 64, offset: 448)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !919, file: !24, line: 879, baseType: !598, size: 64, align: 64, offset: 512)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "xcolormap", scope: !572, file: !24, line: 1001, baseType: !931, size: 448, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "XColormapEvent", file: !24, line: 895, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 882, size: 448, align: 64, elements: !933)
!933 = !{!934, !935, !936, !937, !938, !939, !940, !941}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !932, file: !24, line: 883, baseType: !34, size: 32, align: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !932, file: !24, line: 884, baseType: !56, size: 64, align: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !932, file: !24, line: 885, baseType: !34, size: 32, align: 32, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !932, file: !24, line: 886, baseType: !583, size: 64, align: 64, offset: 192)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !932, file: !24, line: 887, baseType: !111, size: 64, align: 64, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !932, file: !24, line: 888, baseType: !145, size: 64, align: 64, offset: 320)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "new", scope: !932, file: !24, line: 892, baseType: !34, size: 32, align: 32, offset: 384)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !932, file: !24, line: 894, baseType: !34, size: 32, align: 32, offset: 416)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "xclient", scope: !572, file: !24, line: 1002, baseType: !943, size: 768, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "XClientMessageEvent", file: !24, line: 910, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 897, size: 768, align: 64, elements: !945)
!945 = !{!946, !947, !948, !949, !950, !951, !952, !953}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !944, file: !24, line: 898, baseType: !34, size: 32, align: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !944, file: !24, line: 899, baseType: !56, size: 64, align: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !944, file: !24, line: 900, baseType: !34, size: 32, align: 32, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !944, file: !24, line: 901, baseType: !583, size: 64, align: 64, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !944, file: !24, line: 902, baseType: !111, size: 64, align: 64, offset: 256)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "message_type", scope: !944, file: !24, line: 903, baseType: !166, size: 64, align: 64, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !944, file: !24, line: 904, baseType: !34, size: 32, align: 32, offset: 384)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !944, file: !24, line: 909, baseType: !954, size: 320, align: 64, offset: 448)
!954 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !944, file: !24, line: 905, size: 320, align: 64, elements: !955)
!955 = !{!956, !960, !965}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !954, file: !24, line: 906, baseType: !957, size: 160, align: 8)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, align: 8, elements: !958)
!958 = !{!959}
!959 = !DISubrange(count: 20)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !954, file: !24, line: 907, baseType: !961, size: 160, align: 16)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 160, align: 16, elements: !963)
!962 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!963 = !{!964}
!964 = !DISubrange(count: 10)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !954, file: !24, line: 908, baseType: !966, size: 320, align: 64)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 320, align: 64, elements: !967)
!967 = !{!968}
!968 = !DISubrange(count: 5)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "xmapping", scope: !572, file: !24, line: 1003, baseType: !970, size: 448, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMappingEvent", file: !24, line: 922, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 912, size: 448, align: 64, elements: !972)
!972 = !{!973, !974, !975, !976, !977, !978, !979, !980}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !971, file: !24, line: 913, baseType: !34, size: 32, align: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !971, file: !24, line: 914, baseType: !56, size: 64, align: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !971, file: !24, line: 915, baseType: !34, size: 32, align: 32, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !971, file: !24, line: 916, baseType: !583, size: 64, align: 64, offset: 192)
