; ModuleID = './[inter]mppc.o.i'
source_filename = "./[inter]mppc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._RDPCOMP = type { i32, [65536 x i8], %struct.stream }
%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }

@g_mppc_dict = common global %struct._RDPCOMP zeroinitializer, align 8

; Function Attrs: nounwind uwtable
define i32 @mppc_expand(i8*, i32, i8 zeroext, i32*, i32*) #0 !dbg !37 {
  %6 = alloca i32, align 4
  %7 = alloca i8*, align 8
  %8 = alloca i32, align 4
  %9 = alloca i8, align 1
  %10 = alloca i32*, align 8
  %11 = alloca i32*, align 8
  %12 = alloca i32, align 4
  %13 = alloca i32, align 4
  %14 = alloca i32, align 4
  %15 = alloca i32, align 4
  %16 = alloca i32, align 4
  %17 = alloca i32, align 4
  %18 = alloca i32, align 4
  %19 = alloca i32, align 4
  %20 = alloca i32, align 4
  %21 = alloca i32, align 4
  %22 = alloca i8*, align 8
  store i8* %0, i8** %7, align 8
  call void @llvm.dbg.declare(metadata i8** %7, metadata !43, metadata !44), !dbg !45
  store i32 %1, i32* %8, align 4
  call void @llvm.dbg.declare(metadata i32* %8, metadata !46, metadata !44), !dbg !47
  store i8 %2, i8* %9, align 1
  call void @llvm.dbg.declare(metadata i8* %9, metadata !48, metadata !44), !dbg !49
  store i32* %3, i32** %10, align 8
  call void @llvm.dbg.declare(metadata i32** %10, metadata !50, metadata !44), !dbg !51
  store i32* %4, i32** %11, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !9)
!1 = !DIFile(filename: "[inter]mppc.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{}
!3 = !{!4, !7}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !5, line: 43, baseType: !6)
!5 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!6 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !5, line: 39, baseType: !8)
!8 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!9 = !{!10}
!10 = distinct !DIGlobalVariable(name: "g_mppc_dict", scope: !0, file: !11, line: 55, type: !12, isLocal: false, isDefinition: true, variable: %struct._RDPCOMP* @g_mppc_dict)
!11 = !DIFile(filename: "mppc.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDPCOMP", file: !5, line: 205, baseType: !13)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RDPCOMP", file: !5, line: 199, size: 524928, align: 64, elements: !14)
!14 = !{!15, !16, !20}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "roff", scope: !13, file: !5, line: 201, baseType: !4, size: 32, align: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !13, file: !5, line: 202, baseType: !17, size: 524288, align: 8, offset: 32)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 524288, align: 8, elements: !18)
!18 = !{!19}
!19 = !DISubrange(count: 65536)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !13, file: !5, line: 203, baseType: !21, size: 576, align: 64, offset: 524352)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !22, line: 25, size: 576, align: 64, elements: !23)
!22 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!23 = !{!24, !26, !27, !28, !29, !30, !31, !32, !33}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !21, file: !22, line: 27, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !21, file: !22, line: 28, baseType: !25, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !21, file: !22, line: 29, baseType: !25, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !21, file: !22, line: 30, baseType: !6, size: 32, align: 32, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !21, file: !22, line: 33, baseType: !25, size: 64, align: 64, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !21, file: !22, line: 34, baseType: !25, size: 64, align: 64, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !21, file: !22, line: 35, baseType: !25, size: 64, align: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !21, file: !22, line: 36, baseType: !25, size: 64, align: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !21, file: !22, line: 37, baseType: !25, size: 64, align: 64, offset: 512)
!34 = !{i32 2, !"Dwarf Version", i32 4}
!35 = !{i32 2, !"Debug Info Version", i32 3}
!36 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!37 = distinct !DISubprogram(name: "mppc_expand", scope: !11, file: !11, line: 58, type: !38, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !41, !4, !7, !42, !42}
!40 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!43 = !DILocalVariable(name: "data", arg: 1, scope: !37, file: !11, line: 58, type: !41)
!44 = !DIExpression()
!45 = !DILocation(line: 58, column: 21, scope: !37)
!46 = !DILocalVariable(name: "clen", arg: 2, scope: !37, file: !11, line: 58, type: !4)
!47 = !DILocation(line: 58, column: 34, scope: !37)
!48 = !DILocalVariable(name: "ctype", arg: 3, scope: !37, file: !11, line: 58, type: !7)
!49 = !DILocation(line: 58, column: 46, scope: !37)
!50 = !DILocalVariable(name: "roff", arg: 4, scope: !37, file: !11, line: 58, type: !42)
!51 = !DILocation(line: 58, column: 62, scope: !37)
!52 = !DILocalVariable(name: "rlen", arg: 5, scope: !37, file: !11, line: 58, type: !42)
!53 = !DILocation(line: 58, column: 77, scope: !37)
!54 = !DILocalVariable(name: "k", scope: !37, file: !11, line: 60, type: !40)
!55 = !DILocation(line: 60, column: 6, scope: !37)
!56 = !DILocalVariable(name: "walker_len", scope: !37, file: !11, line: 60, type: !40)
!57 = !DILocation(line: 60, column: 9, scope: !37)
!58 = !DILocalVariable(name: "walker", scope: !37, file: !11, line: 60, type: !40)
!59 = !DILocation(line: 60, column: 25, scope: !37)
!60 = !DILocalVariable(name: "i", scope: !37, file: !11, line: 61, type: !4)
!61 = !DILocation(line: 61, column: 9, scope: !37)
!62 = !DILocalVariable(name: "next_offset", scope: !37, file: !11, line: 62, type: !40)
!63 = !DILocation(line: 62, column: 6, scope: !37)
!64 = !DILocalVariable(name: "match_off", scope: !37, file: !11, line: 62, type: !40)
!65 = !DILocation(line: 62, column: 19, scope: !37)
!66 = !DILocalVariable(name: "match_len", scope: !37, file: !11, line: 63, type: !40)
!67 = !DILocation(line: 63, column: 6, scope: !37)
!68 = !DILocalVariable(name: "old_offset", scope: !37, file: !11, line: 64, type: !40)
!69 = !DILocation(line: 64, column: 6, scope: !37)
!70 = !DILocalVariable(name: "match_bits", scope: !37, file: !11, line: 64, type: !40)
!71 = !DILocation(line: 64, column: 18, scope: !37)
!72 = !DILocalVariable(name: "big", scope: !37, file: !11, line: 65, type: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !5, line: 28, baseType: !40)
!74 = !DILocation(line: 65, column: 10, scope: !37)
!75 = !DILocation(line: 65, column: 16, scope: !37)
!76 = !DILocation(line: 65, column: 22, scope: !37)
!77 = !DILocalVariable(name: "dict", scope: !37, file: !11, line: 67, type: !41)
!78 = !DILocation(line: 67, column: 9, scope: !37)
!79 = !DILocation(line: 69, column: 7, scope: !80)
!80 = distinct !DILexicalBlock(scope: !37, file: !11, line: 69, column: 6)
!81 = !DILocation(line: 69, column: 13, scope: !80)
!82 = !DILocation(line: 69, column: 21, scope: !80)
!83 = !DILocation(line: 69, column: 6, scope: !37)
!84 = !DILocation(line: 71, column: 4, scope: !85)
!85 = distinct !DILexicalBlock(scope: !80, file: !11, line: 70, column: 2)
!86 = !DILocation(line: 71, column: 9, scope: !85)
!87 = !DILocation(line: 72, column: 11, scope: !85)
!88 = !DILocation(line: 72, column: 4, scope: !85)
!89 = !DILocation(line: 72, column: 9, scope: !85)
!90 = !DILocation(line: 73, column: 3, scope: !85)
!91 = !DILocation(line: 76, column: 7, scope: !92)
