; ModuleID = './[inter]printer.o.i'
source_filename = "./[inter]printer.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.rdpdr_device_info = type { i32, i32, [8 x i8], i8*, i8* }
%struct._DEVICE_FNS = type { i32 (i32, i32, i32, i32, i32, i8*, i32*)*, i32 (i32)*, i32 (i32, i8*, i32, i32, i32*)*, i32 (i32, i8*, i32, i32, i32*)*, i32 (i32, i32, %struct.stream*, %struct.stream*)* }
%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }
%struct.rdpdr_printer_info = type { %struct._IO_FILE*, i8*, i8*, i32, i8*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@g_rdpdr_device = external global [0 x %struct.rdpdr_device_info], align 8
@.str = private unnamed_addr constant [4 x i8] c"PRN\00", align 1
@.str.1 = private unnamed_addr constant [10 x i8] c"mydeskjet\00", align 1
@.str.2 = private unnamed_addr constant [25 x i8] c"MS Publisher Imagesetter\00", align 1
@.str.3 = private unnamed_addr constant [43 x i8] c"printer_enum_devices(), %s to %s driver %s\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22, globals: !103)
!1 = !DIFile(filename: "[inter]printer.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !{!23, !39, !79}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "PRINTER", file: !25, line: 285, baseType: !26)
!25 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rdpdr_printer_info", file: !25, line: 277, size: 384, align: 64, elements: !27)
!27 = !{!28, !92, !93, !94, !97, !101}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "printer_fp", scope: !26, file: !25, line: 279, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !31, line: 48, baseType: !32)
!31 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !33, line: 241, size: 1728, align: 64, elements: !34)
!33 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!34 = !{!35, !37, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !58, !59, !60, !61, !65, !67, !69, !73, !76, !78, !80, !81, !82, !83, !87, !88}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !32, file: !33, line: 242, baseType: !36, size: 32, align: 32)
!36 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !32, file: !33, line: 247, baseType: !38, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !32, file: !33, line: 248, baseType: !38, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !32, file: !33, line: 249, baseType: !38, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !32, file: !33, line: 250, baseType: !38, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !32, file: !33, line: 251, baseType: !38, size: 64, align: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !32, file: !33, line: 252, baseType: !38, size: 64, align: 64, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !32, file: !33, line: 253, baseType: !38, size: 64, align: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !32, file: !33, line: 254, baseType: !38, size: 64, align: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !32, file: !33, line: 256, baseType: !38, size: 64, align: 64, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !32, file: !33, line: 257, baseType: !38, size: 64, align: 64, offset: 640)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !32, file: !33, line: 258, baseType: !38, size: 64, align: 64, offset: 704)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !32, file: !33, line: 260, baseType: !51, size: 64, align: 64, offset: 768)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !33, line: 156, size: 192, align: 64, elements: !53)
!53 = !{!54, !55, !57}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !52, file: !33, line: 157, baseType: !51, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !52, file: !33, line: 158, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !52, file: !33, line: 162, baseType: !36, size: 32, align: 32, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !32, file: !33, line: 262, baseType: !56, size: 64, align: 64, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !32, file: !33, line: 264, baseType: !36, size: 32, align: 32, offset: 896)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !32, file: !33, line: 268, baseType: !36, size: 32, align: 32, offset: 928)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !32, file: !33, line: 270, baseType: !62, size: 64, align: 64, offset: 960)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !63, line: 131, baseType: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!64 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !32, file: !33, line: 274, baseType: !66, size: 16, align: 16, offset: 1024)
!66 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !32, file: !33, line: 275, baseType: !68, size: 8, align: 8, offset: 1040)
!68 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !32, file: !33, line: 276, baseType: !70, size: 8, align: 8, offset: 1048)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8, align: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !32, file: !33, line: 280, baseType: !74, size: 64, align: 64, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !33, line: 150, baseType: null)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !32, file: !33, line: 289, baseType: !77, size: 64, align: 64, offset: 1152)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !63, line: 132, baseType: !64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !32, file: !33, line: 297, baseType: !79, size: 64, align: 64, offset: 1216)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !32, file: !33, line: 298, baseType: !79, size: 64, align: 64, offset: 1280)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !32, file: !33, line: 299, baseType: !79, size: 64, align: 64, offset: 1344)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !32, file: !33, line: 300, baseType: !79, size: 64, align: 64, offset: 1408)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !32, file: !33, line: 302, baseType: !84, size: 64, align: 64, offset: 1472)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !85, line: 216, baseType: !86)
!85 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!86 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !32, file: !33, line: 303, baseType: !36, size: 32, align: 32, offset: 1536)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !32, file: !33, line: 305, baseType: !89, size: 160, align: 8, offset: 1568)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 160, align: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 20)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !26, file: !25, line: 280, baseType: !38, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "printer", scope: !26, file: !25, line: 280, baseType: !38, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "bloblen", scope: !26, file: !25, line: 281, baseType: !95, size: 32, align: 32, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !25, line: 43, baseType: !96)
!96 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !26, file: !25, line: 282, baseType: !98, size: 64, align: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !25, line: 39, baseType: !100)
!100 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "default_printer", scope: !26, file: !25, line: 283, baseType: !102, size: 32, align: 32, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !25, line: 28, baseType: !36)
!103 = !{!104}
!104 = distinct !DIGlobalVariable(name: "printer_fns", scope: !0, file: !105, line: 163, type: !106, isLocal: false, isDefinition: true, variable: %struct._DEVICE_FNS* @printer_fns)
!105 = !DIFile(filename: "printer.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEVICE_FNS", file: !25, line: 223, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DEVICE_FNS", file: !25, line: 211, size: 320, align: 64, elements: !108)
!108 = !{!109, !116, !120, !125, !126}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !107, file: !25, line: 213, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !95, !95, !95, !95, !95, !38, !114}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_NTSTATUS", file: !25, line: 208, baseType: !95)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_NTHANDLE", file: !25, line: 209, baseType: !95)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !107, file: !25, line: 216, baseType: !117, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!113, !115}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !107, file: !25, line: 217, baseType: !121, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!113, !115, !98, !95, !95, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !107, file: !25, line: 219, baseType: !121, size: 64, align: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "device_control", scope: !107, file: !25, line: 221, baseType: !127, size: 64, align: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!113, !115, !95, !130, !130}
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !131, line: 40, baseType: !132)
!131 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !131, line: 25, size: 576, align: 64, elements: !134)
!134 = !{!135, !137, !138, !139, !140, !141, !142, !143, !144}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !133, file: !131, line: 27, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !133, file: !131, line: 28, baseType: !136, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !133, file: !131, line: 29, baseType: !136, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !133, file: !131, line: 30, baseType: !96, size: 32, align: 32, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !133, file: !131, line: 33, baseType: !136, size: 64, align: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !133, file: !131, line: 34, baseType: !136, size: 64, align: 64, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !133, file: !131, line: 35, baseType: !136, size: 64, align: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !133, file: !131, line: 36, baseType: !136, size: 64, align: 64, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !133, file: !131, line: 37, baseType: !136, size: 64, align: 64, offset: 512)
!145 = !{i32 2, !"Dwarf Version", i32 4}
!146 = !{i32 2, !"Debug Info Version", i32 3}
!147 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!148 = distinct !DISubprogram(name: "printer_enum_devices", scope: !105, file: !105, line: 37, type: !149, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !151)
!149 = !DISubroutineType(types: !150)
!150 = !{!36, !124, !38}
!151 = !{}
!152 = !DILocalVariable(name: "id", arg: 1, scope: !148, file: !105, line: 37, type: !124)
!153 = !DIExpression()
!154 = !DILocation(line: 37, column: 31, scope: !148)
!155 = !DILocalVariable(name: "optarg", arg: 2, scope: !148, file: !105, line: 37, type: !38)
!156 = !DILocation(line: 37, column: 41, scope: !148)
!157 = !DILocalVariable(name: "pprinter_data", scope: !148, file: !105, line: 39, type: !23)
!158 = !DILocation(line: 39, column: 11, scope: !148)
!159 = !DILocalVariable(name: "pos", scope: !148, file: !105, line: 41, type: !38)
!160 = !DILocation(line: 41, column: 8, scope: !148)
!161 = !DILocation(line: 41, column: 14, scope: !148)
!162 = !DILocalVariable(name: "pos2", scope: !148, file: !105, line: 42, type: !38)
!163 = !DILocation(line: 42, column: 8, scope: !148)
!164 = !DILocalVariable(name: "count", scope: !148, file: !105, line: 43, type: !84)
!165 = !DILocation(line: 43, column: 9, scope: !148)
!166 = !DILocalVariable(name: "already", scope: !148, file: !105, line: 44, type: !36)
!167 = !DILocation(line: 44, column: 6, scope: !148)
!168 = !DILocation(line: 48, column: 2, scope: !148)
!169 = !DILocation(line: 48, column: 9, scope: !170)
!170 = !DILexicalBlockFile(scope: !148, file: !105, discriminator: 1)
!171 = !DILocation(line: 48, column: 18, scope: !170)
!172 = !DILocation(line: 48, column: 17, scope: !170)
!173 = !DILocation(line: 48, column: 15, scope: !170)
!174 = !DILocation(line: 48, column: 2, scope: !170)
!175 = !DILocation(line: 50, column: 22, scope: !176)
!176 = distinct !DILexicalBlock(scope: !177, file: !105, line: 50, column: 7)
!177 = distinct !DILexicalBlock(scope: !148, file: !105, line: 49, column: 2)
!178 = !DILocation(line: 50, column: 7, scope: !176)
!179 = !DILocation(line: 50, column: 29, scope: !176)
!180 = !DILocation(line: 50, column: 41, scope: !176)
!181 = !DILocation(line: 50, column: 7, scope: !177)
!182 = !DILocation(line: 51, column: 11, scope: !176)
!183 = !DILocation(line: 51, column: 4, scope: !176)
!184 = !DILocation(line: 52, column: 8, scope: !177)
!185 = !DILocation(line: 48, column: 2, scope: !186)
!186 = !DILexicalBlockFile(scope: !148, file: !105, discriminator: 2)
!187 = distinct !{!187, !168}
!188 = !DILocation(line: 55, column: 8, scope: !148)
!189 = !DILocation(line: 57, column: 7, scope: !190)
!190 = distinct !DILexicalBlock(scope: !148, file: !105, line: 57, column: 6)
!191 = !DILocation(line: 57, column: 6, scope: !190)
!192 = !DILocation(line: 57, column: 14, scope: !190)
!193 = !DILocation(line: 57, column: 6, scope: !148)
!194 = !DILocation(line: 58, column: 9, scope: !190)
!195 = !DILocation(line: 58, column: 3, scope: !190)
!196 = !DILocation(line: 60, column: 2, scope: !148)
!197 = !DILocation(line: 60, column: 25, scope: !170)
!198 = !DILocation(line: 60, column: 16, scope: !170)
!199 = !DILocation(line: 60, column: 14, scope: !170)
!200 = !DILocation(line: 60, column: 39, scope: !170)
!201 = !DILocation(line: 60, column: 43, scope: !186)
!202 = !DILocation(line: 60, column: 42, scope: !186)
!203 = !DILocation(line: 60, column: 46, scope: !186)
!204 = !DILocation(line: 60, column: 2, scope: !205)
!205 = !DILexicalBlockFile(scope: !148, file: !105, discriminator: 3)
!206 = !DILocation(line: 62, column: 31, scope: !207)
!207 = distinct !DILexicalBlock(scope: !148, file: !105, line: 61, column: 2)
!208 = !DILocation(line: 62, column: 19, scope: !207)
