; ModuleID = './[inter]rdpdr.o.i'
source_filename = "./[inter]rdpdr.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.rdpdr_device_info = type { i32, i32, [8 x i8], i8*, i8* }
%struct._VCHANNEL = type { i16, [8 x i8], i32, %struct.stream, void (%struct.stream*)* }
%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }
%struct.async_iorequest = type { i32, i32, i32, i32, i32, i32, i32, i32, i64, i64, i8*, %struct._DEVICE_FNS*, %struct.async_iorequest* }
%struct._DEVICE_FNS = type { i32 (i32, i32, i32, i32, i32, i8*, i32*)*, i32 (i32)*, i32 (i32, i8*, i32, i32, i32*)*, i32 (i32, i8*, i32, i32, i32*)*, i32 (i32, i32, %struct.stream*, %struct.stream*)* }
%struct.fileinfo = type { i32, i32, i32, [4096 x i8], %struct.__dirstream*, %struct.dirent*, [4096 x i8], i32, %struct.notify_data, i32 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.notify_data = type { i64, i64, i64, i32 }
%struct.fd_set = type { [16 x i64] }
%struct.timeval = type { i64, i64 }
%struct.rdpdr_printer_info = type { %struct._IO_FILE*, i8*, i8*, i32, i8*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22, globals: !172)
!1 = !DIFile(filename: "[inter]rdpdr.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !{!23, !27, !30, !31, !34, !35, !38, !96, !104, !33}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !25, line: 41, baseType: !26)
!25 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!26 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !25, line: 43, baseType: !29)
!29 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !32, line: 54, baseType: !33)
!32 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!33 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!34 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !25, line: 39, baseType: !37)
!37 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "async_iorequest", file: !40, line: 87, size: 576, align: 64, elements: !41)
!40 = !DIFile(filename: "rdpdr.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !95}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !39, file: !40, line: 89, baseType: !28, size: 32, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !39, file: !40, line: 89, baseType: !28, size: 32, align: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !39, file: !40, line: 89, baseType: !28, size: 32, align: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !39, file: !40, line: 89, baseType: !28, size: 32, align: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !39, file: !40, line: 89, baseType: !28, size: 32, align: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !39, file: !40, line: 89, baseType: !28, size: 32, align: 32, offset: 160)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !39, file: !40, line: 89, baseType: !28, size: 32, align: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "partial_len", scope: !39, file: !40, line: 89, baseType: !28, size: 32, align: 32, offset: 224)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !39, file: !40, line: 90, baseType: !33, size: 64, align: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "itv_timeout", scope: !39, file: !40, line: 91, baseType: !33, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !39, file: !40, line: 92, baseType: !35, size: 64, align: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "fns", scope: !39, file: !40, line: 93, baseType: !54, size: 64, align: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "DEVICE_FNS", file: !25, line: 223, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DEVICE_FNS", file: !25, line: 211, size: 320, align: 64, elements: !57)
!57 = !{!58, !67, !71, !75, !76}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !56, file: !25, line: 213, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !28, !28, !28, !28, !28, !63, !65}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_NTSTATUS", file: !25, line: 208, baseType: !28)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_NTHANDLE", file: !25, line: 209, baseType: !28)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !56, file: !25, line: 216, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!62, !66}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !56, file: !25, line: 217, baseType: !72, size: 64, align: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!62, !66, !35, !28, !28, !27}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !56, file: !25, line: 219, baseType: !72, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "device_control", scope: !56, file: !25, line: 221, baseType: !77, size: 64, align: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!62, !66, !28, !80, !80}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !81, line: 40, baseType: !82)
!81 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !81, line: 25, size: 576, align: 64, elements: !84)
!84 = !{!85, !87, !88, !89, !90, !91, !92, !93, !94}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !83, file: !81, line: 27, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !83, file: !81, line: 28, baseType: !86, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !83, file: !81, line: 29, baseType: !86, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !83, file: !81, line: 30, baseType: !29, size: 32, align: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !83, file: !81, line: 33, baseType: !86, size: 64, align: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !83, file: !81, line: 34, baseType: !86, size: 64, align: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !83, file: !81, line: 35, baseType: !86, size: 64, align: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !83, file: !81, line: 36, baseType: !86, size: 64, align: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !83, file: !81, line: 37, baseType: !86, size: 64, align: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !39, file: !40, line: 95, baseType: !38, size: 64, align: 64, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "DISK_DEVICE", file: !25, line: 240, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rdpdr_disk_device_info", file: !25, line: 236, size: 32768, align: 8, elements: !99)
!99 = !{!100}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !98, file: !25, line: 238, baseType: !101, size: 32768, align: 8)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 32768, align: 8, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 4096)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "PRINTER", file: !25, line: 285, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rdpdr_printer_info", file: !25, line: 277, size: 384, align: 64, elements: !107)
!107 = !{!108, !166, !167, !168, !169, !170}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "printer_fp", scope: !106, file: !25, line: 279, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !111, line: 48, baseType: !112)
!111 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !113, line: 241, size: 1728, align: 64, elements: !114)
!113 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !135, !136, !137, !138, !141, !142, !144, !148, !151, !153, !154, !155, !156, !157, !161, !162}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !112, file: !113, line: 242, baseType: !34, size: 32, align: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !112, file: !113, line: 247, baseType: !63, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !112, file: !113, line: 248, baseType: !63, size: 64, align: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !112, file: !113, line: 249, baseType: !63, size: 64, align: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !112, file: !113, line: 250, baseType: !63, size: 64, align: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !112, file: !113, line: 251, baseType: !63, size: 64, align: 64, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !112, file: !113, line: 252, baseType: !63, size: 64, align: 64, offset: 384)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !112, file: !113, line: 253, baseType: !63, size: 64, align: 64, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !112, file: !113, line: 254, baseType: !63, size: 64, align: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !112, file: !113, line: 256, baseType: !63, size: 64, align: 64, offset: 576)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !112, file: !113, line: 257, baseType: !63, size: 64, align: 64, offset: 640)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !112, file: !113, line: 258, baseType: !63, size: 64, align: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !112, file: !113, line: 260, baseType: !128, size: 64, align: 64, offset: 768)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !113, line: 156, size: 192, align: 64, elements: !130)
!130 = !{!131, !132, !134}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !129, file: !113, line: 157, baseType: !128, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !129, file: !113, line: 158, baseType: !133, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !129, file: !113, line: 162, baseType: !34, size: 32, align: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !112, file: !113, line: 262, baseType: !133, size: 64, align: 64, offset: 832)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !112, file: !113, line: 264, baseType: !34, size: 32, align: 32, offset: 896)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !112, file: !113, line: 268, baseType: !34, size: 32, align: 32, offset: 928)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !112, file: !113, line: 270, baseType: !139, size: 64, align: 64, offset: 960)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !140, line: 131, baseType: !33)
!140 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !112, file: !113, line: 274, baseType: !26, size: 16, align: 16, offset: 1024)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !112, file: !113, line: 275, baseType: !143, size: 8, align: 8, offset: 1040)
!143 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !112, file: !113, line: 276, baseType: !145, size: 8, align: 8, offset: 1048)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8, align: 8, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 1)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !112, file: !113, line: 280, baseType: !149, size: 64, align: 64, offset: 1088)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !113, line: 150, baseType: null)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !112, file: !113, line: 289, baseType: !152, size: 64, align: 64, offset: 1152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !140, line: 132, baseType: !33)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !112, file: !113, line: 297, baseType: !30, size: 64, align: 64, offset: 1216)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !112, file: !113, line: 298, baseType: !30, size: 64, align: 64, offset: 1280)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !112, file: !113, line: 299, baseType: !30, size: 64, align: 64, offset: 1344)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !112, file: !113, line: 300, baseType: !30, size: 64, align: 64, offset: 1408)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !112, file: !113, line: 302, baseType: !158, size: 64, align: 64, offset: 1472)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !159, line: 216, baseType: !160)
!159 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!160 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !112, file: !113, line: 303, baseType: !34, size: 32, align: 32, offset: 1536)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !112, file: !113, line: 305, baseType: !163, size: 160, align: 8, offset: 1568)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 160, align: 8, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 20)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !106, file: !25, line: 280, baseType: !63, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "printer", scope: !106, file: !25, line: 280, baseType: !63, size: 64, align: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "bloblen", scope: !106, file: !25, line: 281, baseType: !28, size: 32, align: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !106, file: !25, line: 282, baseType: !35, size: 64, align: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "default_printer", scope: !106, file: !25, line: 283, baseType: !171, size: 32, align: 32, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !25, line: 28, baseType: !34)
!172 = !{!173, !174, !190, !191, !192, !193, !205, !206}
!173 = distinct !DIGlobalVariable(name: "g_rdpdr_clientname", scope: !0, file: !40, line: 82, type: !63, isLocal: false, isDefinition: true, variable: i8** @g_rdpdr_clientname)
!174 = distinct !DIGlobalVariable(name: "rdpdr_channel", scope: !0, file: !40, line: 71, type: !175, isLocal: true, isDefinition: true, variable: %struct._VCHANNEL** @rdpdr_channel)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "VCHANNEL", file: !25, line: 169, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VCHANNEL", file: !25, line: 161, size: 768, align: 64, elements: !178)
!178 = !{!179, !180, !184, !185, !186}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_id", scope: !177, file: !25, line: 163, baseType: !24, size: 16, align: 16)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !177, file: !25, line: 164, baseType: !181, size: 64, align: 8, offset: 16)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 64, align: 8, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !177, file: !25, line: 165, baseType: !28, size: 32, align: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !177, file: !25, line: 166, baseType: !83, size: 576, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !177, file: !25, line: 167, baseType: !187, size: 64, align: 64, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !80}
!190 = distinct !DIGlobalVariable(name: "g_min_timeout_fd", scope: !0, file: !40, line: 75, type: !66, isLocal: false, isDefinition: true, variable: i32* @g_min_timeout_fd)
!191 = distinct !DIGlobalVariable(name: "g_num_devices", scope: !0, file: !40, line: 76, type: !28, isLocal: false, isDefinition: true, variable: i32* @g_num_devices)
!192 = distinct !DIGlobalVariable(name: "g_client_id", scope: !0, file: !40, line: 78, type: !28, isLocal: false, isDefinition: true, variable: i32* @g_client_id)
!193 = distinct !DIGlobalVariable(name: "g_rdpdr_device", scope: !0, file: !40, line: 81, type: !194, isLocal: false, isDefinition: true, variable: [16 x %struct.rdpdr_device_info]* @g_rdpdr_device)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 4096, align: 64, elements: !203)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDPDR_DEVICE", file: !25, line: 234, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rdpdr_device_info", file: !25, line: 226, size: 256, align: 64, elements: !197)
!197 = !{!198, !199, !200, !201, !202}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "device_type", scope: !196, file: !25, line: 228, baseType: !28, size: 32, align: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !196, file: !25, line: 229, baseType: !66, size: 32, align: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !196, file: !25, line: 230, baseType: !181, size: 64, align: 8, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "local_path", scope: !196, file: !25, line: 231, baseType: !63, size: 64, align: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pdevice_data", scope: !196, file: !25, line: 232, baseType: !30, size: 64, align: 64, offset: 192)
!203 = !{!204}
!204 = !DISubrange(count: 16)
!205 = distinct !DIGlobalVariable(name: "g_iorequest", scope: !0, file: !40, line: 98, type: !38, isLocal: false, isDefinition: true, variable: %struct.async_iorequest** @g_iorequest)
!206 = distinct !DIGlobalVariable(name: "g_epoch", scope: !0, file: !40, line: 72, type: !28, isLocal: true, isDefinition: true, variable: i32* @g_epoch)
!207 = !{i32 2, !"Dwarf Version", i32 4}
!208 = !{i32 2, !"Debug Info Version", i32 3}
!209 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!210 = distinct !DISubprogram(name: "get_device_index", scope: !40, file: !40, line: 102, type: !211, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !213)
!211 = !DISubroutineType(types: !212)
!212 = !{!34, !66}
!213 = !{}
!214 = !DILocalVariable(name: "handle", arg: 1, scope: !210, file: !40, line: 102, type: !66)
!215 = !DIExpression()
!216 = !DILocation(line: 102, column: 30, scope: !210)
!217 = !DILocalVariable(name: "i", scope: !210, file: !40, line: 104, type: !34)
!218 = !DILocation(line: 104, column: 6, scope: !210)
!219 = !DILocation(line: 105, column: 9, scope: !220)
!220 = distinct !DILexicalBlock(scope: !210, file: !40, line: 105, column: 2)
!221 = !DILocation(line: 105, column: 7, scope: !220)
!222 = !DILocation(line: 105, column: 14, scope: !223)
!223 = !DILexicalBlockFile(scope: !224, file: !40, discriminator: 1)
!224 = distinct !DILexicalBlock(scope: !220, file: !40, line: 105, column: 2)
!225 = !DILocation(line: 105, column: 16, scope: !223)
!226 = !DILocation(line: 105, column: 2, scope: !223)
!227 = !DILocation(line: 107, column: 22, scope: !228)
!228 = distinct !DILexicalBlock(scope: !229, file: !40, line: 107, column: 7)
!229 = distinct !DILexicalBlock(scope: !224, file: !40, line: 106, column: 2)
!230 = !DILocation(line: 107, column: 7, scope: !228)
!231 = !DILocation(line: 107, column: 25, scope: !228)
!232 = !DILocation(line: 107, column: 35, scope: !228)
!233 = !DILocation(line: 107, column: 32, scope: !228)
!234 = !DILocation(line: 107, column: 7, scope: !229)
!235 = !DILocation(line: 108, column: 11, scope: !228)
!236 = !DILocation(line: 108, column: 4, scope: !228)
!237 = !DILocation(line: 109, column: 2, scope: !229)
!238 = !DILocation(line: 105, column: 25, scope: !239)
!239 = !DILexicalBlockFile(scope: !224, file: !40, discriminator: 2)
!240 = !DILocation(line: 105, column: 2, scope: !239)
!241 = distinct !{!241, !242}
!242 = !DILocation(line: 105, column: 2, scope: !210)
!243 = !DILocation(line: 110, column: 2, scope: !210)
!244 = !DILocation(line: 111, column: 1, scope: !210)
!245 = distinct !DISubprogram(name: "convert_to_unix_filename", scope: !40, file: !40, line: 115, type: !246, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !213)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !63}
!248 = !DILocalVariable(name: "filename", arg: 1, scope: !245, file: !40, line: 115, type: !63)
!249 = !DILocation(line: 115, column: 32, scope: !245)
!250 = !DILocalVariable(name: "p", scope: !245, file: !40, line: 117, type: !63)
!251 = !DILocation(line: 117, column: 8, scope: !245)
!252 = !DILocation(line: 119, column: 2, scope: !245)
!253 = !DILocation(line: 119, column: 21, scope: !254)
!254 = !DILexicalBlockFile(scope: !245, file: !40, discriminator: 1)
!255 = !DILocation(line: 119, column: 14, scope: !254)
!256 = !DILocation(line: 119, column: 12, scope: !254)
!257 = !DILocation(line: 119, column: 2, scope: !254)
!258 = !DILocation(line: 121, column: 4, scope: !259)
!259 = distinct !DILexicalBlock(scope: !245, file: !40, line: 120, column: 2)
!260 = !DILocation(line: 121, column: 6, scope: !259)
!261 = !DILocation(line: 119, column: 2, scope: !262)
!262 = !DILexicalBlockFile(scope: !245, file: !40, discriminator: 2)
!263 = distinct !{!263, !252}
!264 = !DILocation(line: 123, column: 1, scope: !245)
!265 = distinct !DISubprogram(name: "rdpdr_send_completion", scope: !40, file: !40, line: 359, type: !266, isLocal: false, isDefinition: true, scopeLine: 361, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !213)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !28, !28, !28, !28, !35, !28}
!268 = !DILocalVariable(name: "device", arg: 1, scope: !265, file: !40, line: 359, type: !28)
!269 = !DILocation(line: 359, column: 30, scope: !265)
!270 = !DILocalVariable(name: "id", arg: 2, scope: !265, file: !40, line: 359, type: !28)
!271 = !DILocation(line: 359, column: 45, scope: !265)
!272 = !DILocalVariable(name: "status", arg: 3, scope: !265, file: !40, line: 359, type: !28)
!273 = !DILocation(line: 359, column: 56, scope: !265)
!274 = !DILocalVariable(name: "result", arg: 4, scope: !265, file: !40, line: 359, type: !28)
!275 = !DILocation(line: 359, column: 71, scope: !265)
!276 = !DILocalVariable(name: "buffer", arg: 5, scope: !265, file: !40, line: 359, type: !35)
!277 = !DILocation(line: 359, column: 87, scope: !265)
!278 = !DILocalVariable(name: "length", arg: 6, scope: !265, file: !40, line: 360, type: !28)
!279 = !DILocation(line: 360, column: 16, scope: !265)
!280 = !DILocalVariable(name: "s", scope: !265, file: !40, line: 362, type: !80)
!281 = !DILocation(line: 362, column: 9, scope: !265)
!282 = !DILocation(line: 367, column: 19, scope: !265)
!283 = !DILocation(line: 367, column: 39, scope: !265)
!284 = !DILocation(line: 367, column: 37, scope: !265)
!285 = !DILocation(line: 367, column: 6, scope: !265)
!286 = !DILocation(line: 367, column: 4, scope: !265)
!287 = !DILocation(line: 368, column: 17, scope: !288)
!288 = distinct !DILexicalBlock(scope: !265, file: !40, line: 368, column: 2)
!289 = !DILocation(line: 368, column: 21, scope: !288)
!290 = !DILocation(line: 368, column: 4, scope: !288)
!291 = !DILocation(line: 368, column: 24, scope: !288)
!292 = !DILocation(line: 368, column: 35, scope: !288)
!293 = !DILocation(line: 368, column: 39, scope: !288)
!294 = !DILocation(line: 368, column: 41, scope: !288)
!295 = !DILocation(line: 369, column: 17, scope: !296)
!296 = distinct !DILexicalBlock(scope: !265, file: !40, line: 369, column: 2)
!297 = !DILocation(line: 369, column: 21, scope: !296)
!298 = !DILocation(line: 369, column: 4, scope: !296)
!299 = !DILocation(line: 369, column: 24, scope: !296)
!300 = !DILocation(line: 369, column: 35, scope: !296)
!301 = !DILocation(line: 369, column: 39, scope: !296)
!302 = !DILocation(line: 369, column: 41, scope: !296)
!303 = !DILocation(line: 370, column: 26, scope: !304)
!304 = distinct !DILexicalBlock(scope: !265, file: !40, line: 370, column: 2)
!305 = !DILocation(line: 370, column: 17, scope: !304)
!306 = !DILocation(line: 370, column: 21, scope: !304)
!307 = !DILocation(line: 370, column: 4, scope: !304)
!308 = !DILocation(line: 370, column: 24, scope: !304)
!309 = !DILocation(line: 370, column: 35, scope: !304)
!310 = !DILocation(line: 370, column: 39, scope: !304)
!311 = !DILocation(line: 370, column: 41, scope: !304)
!312 = !DILocation(line: 371, column: 26, scope: !313)
!313 = distinct !DILexicalBlock(scope: !265, file: !40, line: 371, column: 2)
!314 = !DILocation(line: 371, column: 17, scope: !313)
!315 = !DILocation(line: 371, column: 21, scope: !313)
!316 = !DILocation(line: 371, column: 4, scope: !313)
!317 = !DILocation(line: 371, column: 24, scope: !313)
!318 = !DILocation(line: 371, column: 31, scope: !313)
!319 = !DILocation(line: 371, column: 35, scope: !313)
!320 = !DILocation(line: 371, column: 37, scope: !313)
!321 = !DILocation(line: 372, column: 26, scope: !322)
!322 = distinct !DILexicalBlock(scope: !265, file: !40, line: 372, column: 2)
!323 = !DILocation(line: 372, column: 17, scope: !322)
!324 = !DILocation(line: 372, column: 21, scope: !322)
!325 = !DILocation(line: 372, column: 4, scope: !322)
!326 = !DILocation(line: 372, column: 24, scope: !322)
!327 = !DILocation(line: 372, column: 35, scope: !322)
!328 = !DILocation(line: 372, column: 39, scope: !322)
!329 = !DILocation(line: 372, column: 41, scope: !322)
!330 = !DILocation(line: 373, column: 26, scope: !331)
!331 = distinct !DILexicalBlock(scope: !265, file: !40, line: 373, column: 2)
!332 = !DILocation(line: 373, column: 17, scope: !331)
!333 = !DILocation(line: 373, column: 21, scope: !331)
!334 = !DILocation(line: 373, column: 4, scope: !331)
!335 = !DILocation(line: 373, column: 24, scope: !331)
!336 = !DILocation(line: 373, column: 35, scope: !331)
!337 = !DILocation(line: 373, column: 39, scope: !331)
!338 = !DILocation(line: 373, column: 41, scope: !331)
!339 = !DILocation(line: 374, column: 12, scope: !340)
!340 = distinct !DILexicalBlock(scope: !265, file: !40, line: 374, column: 2)
!341 = !DILocation(line: 374, column: 16, scope: !340)
!342 = !DILocation(line: 374, column: 18, scope: !340)
!343 = !DILocation(line: 374, column: 25, scope: !340)
!344 = !DILocation(line: 374, column: 4, scope: !340)
!345 = !DILocation(line: 374, column: 44, scope: !340)
!346 = !DILocation(line: 374, column: 35, scope: !340)
!347 = !DILocation(line: 374, column: 39, scope: !340)
!348 = !DILocation(line: 374, column: 41, scope: !340)
!349 = !DILocation(line: 375, column: 14, scope: !265)
!350 = !DILocation(line: 375, column: 18, scope: !265)
!351 = !DILocation(line: 375, column: 3, scope: !265)
!352 = !DILocation(line: 375, column: 7, scope: !265)
!353 = !DILocation(line: 375, column: 11, scope: !265)
!354 = !DILocation(line: 377, column: 2, scope: !265)
!355 = !DILocation(line: 380, column: 15, scope: !265)
!356 = !DILocation(line: 380, column: 18, scope: !265)
!357 = !DILocation(line: 380, column: 2, scope: !265)
!358 = !DILocation(line: 384, column: 1, scope: !265)
!359 = distinct !DISubprogram(name: "rdpdr_init", scope: !40, file: !40, line: 942, type: !360, isLocal: false, isDefinition: true, scopeLine: 943, isOptimized: false, unit: !0, variables: !213)
!360 = !DISubroutineType(types: !361)
!361 = !{!171}
!362 = !DILocation(line: 945, column: 3, scope: !359)
!363 = !DILocation(line: 944, column: 16, scope: !359)
!364 = !DILocation(line: 949, column: 10, scope: !359)
!365 = !DILocation(line: 949, column: 24, scope: !359)
!366 = !DILocation(line: 949, column: 2, scope: !359)
!367 = distinct !DISubprogram(name: "rdpdr_process", scope: !40, file: !40, line: 849, type: !188, isLocal: true, isDefinition: true, scopeLine: 850, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !213)
!368 = !DILocalVariable(name: "s", arg: 1, scope: !367, file: !40, line: 849, type: !80)
!369 = !DILocation(line: 849, column: 22, scope: !367)
!370 = !DILocalVariable(name: "handle", scope: !367, file: !40, line: 851, type: !28)
!371 = !DILocation(line: 851, column: 9, scope: !367)
!372 = !DILocalVariable(name: "vmin", scope: !367, file: !40, line: 852, type: !24)
!373 = !DILocation(line: 852, column: 9, scope: !367)
!374 = !DILocalVariable(name: "component", scope: !367, file: !40, line: 853, type: !24)
!375 = !DILocation(line: 853, column: 9, scope: !367)
!376 = !DILocalVariable(name: "pakid", scope: !367, file: !40, line: 854, type: !24)
!377 = !DILocation(line: 854, column: 9, scope: !367)
!378 = !DILocation(line: 856, column: 2, scope: !367)
!379 = !DILocation(line: 859, column: 29, scope: !380)
!380 = distinct !DILexicalBlock(scope: !367, file: !40, line: 859, column: 2)
!381 = !DILocation(line: 859, column: 33, scope: !380)
!382 = !DILocation(line: 859, column: 16, scope: !380)
!383 = !DILocation(line: 859, column: 14, scope: !380)
!384 = !DILocation(line: 859, column: 38, scope: !380)
!385 = !DILocation(line: 859, column: 42, scope: !380)
!386 = !DILocation(line: 859, column: 44, scope: !380)
!387 = !DILocation(line: 860, column: 25, scope: !388)
!388 = distinct !DILexicalBlock(scope: !367, file: !40, line: 860, column: 2)
!389 = !DILocation(line: 860, column: 29, scope: !388)
!390 = !DILocation(line: 860, column: 12, scope: !388)
!391 = !DILocation(line: 860, column: 10, scope: !388)
!392 = !DILocation(line: 860, column: 34, scope: !388)
!393 = !DILocation(line: 860, column: 38, scope: !388)
!394 = !DILocation(line: 860, column: 40, scope: !388)
!395 = !DILocation(line: 862, column: 6, scope: !396)
!396 = distinct !DILexicalBlock(scope: !367, file: !40, line: 862, column: 6)
!397 = !DILocation(line: 862, column: 16, scope: !396)
!398 = !DILocation(line: 862, column: 6, scope: !367)
!399 = !DILocation(line: 864, column: 11, scope: !400)
!400 = distinct !DILexicalBlock(scope: !396, file: !40, line: 863, column: 2)
!401 = !DILocation(line: 864, column: 3, scope: !400)
!402 = !DILocation(line: 867, column: 23, scope: !403)
!403 = distinct !DILexicalBlock(scope: !400, file: !40, line: 865, column: 3)
!404 = !DILocation(line: 867, column: 5, scope: !403)
!405 = !DILocation(line: 868, column: 5, scope: !403)
!406 = !DILocation(line: 872, column: 6, scope: !403)
!407 = !DILocation(line: 872, column: 10, scope: !403)
!408 = !DILocation(line: 872, column: 12, scope: !403)
!409 = !DILocation(line: 873, column: 27, scope: !410)
!410 = distinct !DILexicalBlock(scope: !403, file: !40, line: 873, column: 5)
!411 = !DILocation(line: 873, column: 31, scope: !410)
!412 = !DILocation(line: 873, column: 14, scope: !410)
!413 = !DILocation(line: 873, column: 12, scope: !410)
!414 = !DILocation(line: 873, column: 36, scope: !410)
!415 = !DILocation(line: 873, column: 40, scope: !410)
!416 = !DILocation(line: 873, column: 42, scope: !410)
!417 = !DILocation(line: 874, column: 34, scope: !418)
!418 = distinct !DILexicalBlock(scope: !403, file: !40, line: 874, column: 5)
!419 = !DILocation(line: 874, column: 38, scope: !418)
!420 = !DILocation(line: 874, column: 21, scope: !418)
!421 = !DILocation(line: 874, column: 19, scope: !418)
!422 = !DILocation(line: 874, column: 43, scope: !418)
!423 = !DILocation(line: 874, column: 47, scope: !418)
!424 = !DILocation(line: 874, column: 49, scope: !418)
!425 = !DILocation(line: 878, column: 9, scope: !426)
!426 = distinct !DILexicalBlock(scope: !403, file: !40, line: 878, column: 9)
!427 = !DILocation(line: 878, column: 14, scope: !426)
!428 = !DILocation(line: 878, column: 9, scope: !403)
!429 = !DILocation(line: 879, column: 18, scope: !426)
!430 = !DILocation(line: 879, column: 6, scope: !426)
!431 = !DILocation(line: 880, column: 12, scope: !403)
!432 = !DILocation(line: 906, column: 5, scope: !403)
!433 = !DILocation(line: 907, column: 5, scope: !403)
!434 = !DILocation(line: 908, column: 5, scope: !403)
!435 = !DILocation(line: 911, column: 5, scope: !403)
!436 = !DILocation(line: 912, column: 5, scope: !403)
!437 = !DILocation(line: 915, column: 29, scope: !438)
!438 = distinct !DILexicalBlock(scope: !403, file: !40, line: 915, column: 5)
!439 = !DILocation(line: 915, column: 33, scope: !438)
!440 = !DILocation(line: 915, column: 16, scope: !438)
!441 = !DILocation(line: 915, column: 14, scope: !438)
!442 = !DILocation(line: 915, column: 38, scope: !438)
!443 = !DILocation(line: 915, column: 42, scope: !438)
!444 = !DILocation(line: 915, column: 44, scope: !438)
!445 = !DILocation(line: 917, column: 64, scope: !403)
!446 = !DILocation(line: 916, column: 5, scope: !403)
!447 = !DILocation(line: 918, column: 5, scope: !403)
!448 = !DILocation(line: 921, column: 5, scope: !403)
!449 = !DILocation(line: 922, column: 5, scope: !403)
!450 = !DILocation(line: 926, column: 61, scope: !403)
!451 = !DILocation(line: 927, column: 12, scope: !403)
!452 = !DILocation(line: 925, column: 5, scope: !403)
!453 = !DILocation(line: 928, column: 5, scope: !403)
!454 = !DILocation(line: 931, column: 2, scope: !400)
!455 = !DILocation(line: 932, column: 11, scope: !456)
!456 = distinct !DILexicalBlock(scope: !396, file: !40, line: 932, column: 11)
!457 = !DILocation(line: 932, column: 21, scope: !456)
!458 = !DILocation(line: 932, column: 11, scope: !396)
!459 = !DILocation(line: 934, column: 7, scope: !460)
!460 = distinct !DILexicalBlock(scope: !461, file: !40, line: 934, column: 7)
!461 = distinct !DILexicalBlock(scope: !456, file: !40, line: 933, column: 2)
!462 = !DILocation(line: 934, column: 13, scope: !460)
!463 = !DILocation(line: 934, column: 7, scope: !461)
!464 = !DILocation(line: 935, column: 25, scope: !460)
!465 = !DILocation(line: 935, column: 4, scope: !460)
!466 = !DILocation(line: 936, column: 2, scope: !461)
!467 = !DILocation(line: 938, column: 74, scope: !456)
!468 = !DILocation(line: 938, column: 3, scope: !456)
!469 = !DILocation(line: 939, column: 1, scope: !367)
!470 = distinct !DISubprogram(name: "rdpdr_add_fds", scope: !40, file: !40, line: 954, type: !471, isLocal: false, isDefinition: true, scopeLine: 955, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !213)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !473, !474, !474, !480, !488}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !32, line: 75, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 64, size: 1024, align: 64, elements: !477)
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__fds_bits", scope: !476, file: !32, line: 72, baseType: !479, size: 1024, align: 64)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1024, align: 64, elements: !203)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !482, line: 30, size: 128, align: 64, elements: !483)
!482 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!483 = !{!484, !486}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !481, file: !482, line: 32, baseType: !485, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !140, line: 139, baseType: !33)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !481, file: !482, line: 33, baseType: !487, size: 64, align: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !140, line: 141, baseType: !33)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!489 = !DILocalVariable(name: "n", arg: 1, scope: !470, file: !40, line: 954, type: !473)
!490 = !DILocation(line: 954, column: 20, scope: !470)
!491 = !DILocalVariable(name: "rfds", arg: 2, scope: !470, file: !40, line: 954, type: !474)
!492 = !DILocation(line: 954, column: 32, scope: !470)
!493 = !DILocalVariable(name: "wfds", arg: 3, scope: !470, file: !40, line: 954, type: !474)
!494 = !DILocation(line: 954, column: 47, scope: !470)
!495 = !DILocalVariable(name: "tv", arg: 4, scope: !470, file: !40, line: 954, type: !480)
!496 = !DILocation(line: 954, column: 69, scope: !470)
!497 = !DILocalVariable(name: "timeout", arg: 5, scope: !470, file: !40, line: 954, type: !488)
!498 = !DILocation(line: 954, column: 83, scope: !470)
!499 = !DILocalVariable(name: "select_timeout", scope: !470, file: !40, line: 956, type: !28)
!500 = !DILocation(line: 956, column: 9, scope: !470)
!501 = !DILocalVariable(name: "iorq", scope: !470, file: !40, line: 957, type: !38)
!502 = !DILocation(line: 957, column: 26, scope: !470)
!503 = !DILocalVariable(name: "c", scope: !470, file: !40, line: 958, type: !64)
!504 = !DILocation(line: 958, column: 7, scope: !470)
!505 = !DILocation(line: 960, column: 9, scope: !470)
!506 = !DILocation(line: 960, column: 7, scope: !470)
!507 = !DILocation(line: 961, column: 2, scope: !470)
!508 = !DILocation(line: 961, column: 9, scope: !509)
!509 = !DILexicalBlockFile(scope: !470, file: !40, discriminator: 1)
!510 = !DILocation(line: 961, column: 14, scope: !509)
!511 = !DILocation(line: 961, column: 2, scope: !509)
!512 = !DILocation(line: 963, column: 7, scope: !513)
!513 = distinct !DILexicalBlock(scope: !514, file: !40, line: 963, column: 7)
!514 = distinct !DILexicalBlock(scope: !470, file: !40, line: 962, column: 2)
!515 = !DILocation(line: 963, column: 13, scope: !513)
!516 = !DILocation(line: 963, column: 16, scope: !513)
!517 = !DILocation(line: 963, column: 7, scope: !514)
!518 = !DILocation(line: 965, column: 12, scope: !519)
!519 = distinct !DILexicalBlock(scope: !513, file: !40, line: 964, column: 3)
!520 = !DILocation(line: 965, column: 18, scope: !519)
!521 = !DILocation(line: 965, column: 4, scope: !519)
!522 = !DILocation(line: 973, column: 5, scope: !523)
!523 = distinct !DILexicalBlock(scope: !519, file: !40, line: 966, column: 4)
!524 = !DILocation(line: 973, column: 11, scope: !523)
!525 = !DILocation(line: 973, column: 7, scope: !523)
!526 = !DILocation(line: 973, column: 63, scope: !523)
!527 = !DILocation(line: 973, column: 14, scope: !523)
!528 = !DILocation(line: 973, column: 8, scope: !523)
!529 = !DILocation(line: 973, column: 42, scope: !523)
!530 = !DILocation(line: 974, column: 15, scope: !523)
!531 = !DILocation(line: 974, column: 14, scope: !523)
!532 = !DILocation(line: 974, column: 26, scope: !523)
!533 = !DILocation(line: 974, column: 32, scope: !523)
!534 = !DILocation(line: 974, column: 18, scope: !523)
!535 = !DILocation(line: 974, column: 12, scope: !523)
!536 = !DILocation(line: 974, column: 41, scope: !537)
!537 = !DILexicalBlockFile(scope: !523, file: !40, discriminator: 1)
!538 = !DILocation(line: 974, column: 40, scope: !537)
!539 = !DILocation(line: 974, column: 12, scope: !537)
!540 = !DILocation(line: 974, column: 52, scope: !541)
!541 = !DILexicalBlockFile(scope: !523, file: !40, discriminator: 2)
!542 = !DILocation(line: 974, column: 58, scope: !541)
!543 = !DILocation(line: 974, column: 12, scope: !541)
!544 = !DILocation(line: 974, column: 12, scope: !545)
!545 = !DILexicalBlockFile(scope: !523, file: !40, discriminator: 3)
!546 = !DILocation(line: 974, column: 7, scope: !545)
!547 = !DILocation(line: 974, column: 9, scope: !545)
