; ModuleID = './[inter]utils.o.i'
source_filename = "./[inter]utils.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [7 x i8] c"%%%02X\00", align 1
@.str.1 = private unnamed_addr constant [8 x i8] c"%%%2hhX\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"/\00", align 1
@utils_locale_to_utf8.iconv_h = internal global i8** inttoptr (i64 -1 to i8**), align 8
@g_codepage = external global [16 x i8], align 16
@.str.3 = private unnamed_addr constant [6 x i8] c"UTF-8\00", align 1
@g_iconv_works = internal global i32 1, align 4
@.str.4 = private unnamed_addr constant [53 x i8] c"utils_string_to_utf8(), iconv_open[%s -> %s] fail %p\00", align 1
@.str.5 = private unnamed_addr constant [46 x i8] c"utils_string_to_utf8, iconv(1) fail, errno %d\00", align 1
@_logger_level = internal global i32 2, align 4
@_logger_subjects = internal global i32 64, align 4

!193 = !DILocation(line: 83, column: 11, scope: !194)
!194 = distinct !DILexicalBlock(scope: !173, file: !39, line: 82, column: 3)
!195 = !DILocation(line: 83, column: 10, scope: !194)
!196 = !DILocation(line: 83, column: 5, scope: !194)
!197 = !DILocation(line: 83, column: 8, scope: !194)
!198 = !DILocation(line: 84, column: 6, scope: !194)
!199 = !DILocation(line: 87, column: 4, scope: !174)
!200 = !DILocation(line: 73, column: 2, scope: !141)
!201 = distinct !{!201, !167}
!202 = !DILocation(line: 90, column: 9, scope: !98)
!203 = !DILocation(line: 90, column: 2, scope: !98)
!204 = !DILocation(line: 91, column: 1, scope: !98)
!205 = distinct !DISubprogram(name: "utils_string_unescape", scope: !39, file: !39, line: 94, type: !99, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !45)
!206 = !DILocalVariable(name: "str", arg: 1, scope: !205, file: !39, line: 94, type: !43)
!207 = !DILocation(line: 94, column: 35, scope: !205)
!208 = !DILocalVariable(name: "ns", scope: !205, file: !39, line: 96, type: !32)
!209 = !DILocation(line: 96, column: 8, scope: !205)
!210 = !DILocalVariable(name: "ps", scope: !205, file: !39, line: 96, type: !32)
!211 = !DILocation(line: 96, column: 13, scope: !205)
!212 = !DILocalVariable(name: "pd", scope: !205, file: !39, line: 96, type: !32)
!213 = !DILocation(line: 96, column: 18, scope: !205)
!214 = !DILocalVariable(name: "c", scope: !205, file: !39, line: 97, type: !26)
!215 = !DILocation(line: 97, column: 16, scope: !205)
!216 = !DILocation(line: 99, column: 22, scope: !205)
!217 = !DILocation(line: 99, column: 15, scope: !205)
!218 = !DILocation(line: 99, column: 27, scope: !205)
!219 = !DILocation(line: 99, column: 7, scope: !220)
!220 = !DILexicalBlockFile(scope: !205, file: !39, discriminator: 1)
!221 = !DILocation(line: 99, column: 5, scope: !205)
!222 = !DILocation(line: 100, column: 9, scope: !205)
!223 = !DILocation(line: 100, column: 13, scope: !205)
!224 = !DILocation(line: 100, column: 25, scope: !205)
!225 = !DILocation(line: 100, column: 18, scope: !205)
!226 = !DILocation(line: 100, column: 30, scope: !205)
!227 = !DILocation(line: 100, column: 2, scope: !220)
!228 = !DILocation(line: 101, column: 12, scope: !205)
!229 = !DILocation(line: 101, column: 10, scope: !205)
!230 = !DILocation(line: 101, column: 5, scope: !205)
!231 = !DILocation(line: 103, column: 2, scope: !205)
!232 = !DILocation(line: 103, column: 10, scope: !220)
!233 = !DILocation(line: 103, column: 9, scope: !220)
!234 = !DILocation(line: 103, column: 13, scope: !220)
!235 = !DILocation(line: 103, column: 2, scope: !220)
!236 = !DILocation(line: 106, column: 7, scope: !237)
!237 = distinct !DILexicalBlock(scope: !238, file: !39, line: 106, column: 7)
!238 = distinct !DILexicalBlock(scope: !205, file: !39, line: 104, column: 2)
!239 = !DILocation(line: 106, column: 13, scope: !237)
!240 = !DILocation(line: 106, column: 7, scope: !238)
!241 = !DILocation(line: 108, column: 15, scope: !242)
!242 = distinct !DILexicalBlock(scope: !243, file: !39, line: 108, column: 8)
!243 = distinct !DILexicalBlock(scope: !237, file: !39, line: 107, column: 3)
!244 = !DILocation(line: 108, column: 8, scope: !242)
!245 = !DILocation(line: 108, column: 34, scope: !242)
!246 = !DILocation(line: 108, column: 8, scope: !243)
!247 = !DILocation(line: 110, column: 19, scope: !248)
!248 = distinct !DILexicalBlock(scope: !242, file: !39, line: 109, column: 4)
!249 = !DILocation(line: 110, column: 5, scope: !248)
!250 = !DILocation(line: 110, column: 11, scope: !248)
!251 = !DILocation(line: 111, column: 8, scope: !248)
!252 = !DILocation(line: 112, column: 7, scope: !248)
!253 = !DILocation(line: 113, column: 5, scope: !248)
!254 = distinct !{!254, !231}
!255 = !DILocation(line: 115, column: 3, scope: !243)
!256 = !DILocation(line: 118, column: 10, scope: !238)
!257 = !DILocation(line: 118, column: 9, scope: !238)
!258 = !DILocation(line: 118, column: 4, scope: !238)
!259 = !DILocation(line: 118, column: 7, scope: !238)
!260 = !DILocation(line: 119, column: 5, scope: !238)
!261 = !DILocation(line: 120, column: 5, scope: !238)
!262 = !DILocation(line: 103, column: 2, scope: !263)
!263 = !DILexicalBlockFile(scope: !205, file: !39, discriminator: 2)
!264 = !DILocation(line: 122, column: 2, scope: !205)
!265 = !DILocation(line: 122, column: 8, scope: !205)
!266 = !DILocation(line: 124, column: 9, scope: !205)
!267 = !DILocation(line: 124, column: 2, scope: !205)
!268 = distinct !DISubprogram(name: "utils_mkdir_safe", scope: !39, file: !39, line: 128, type: !269, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !45)
!269 = !DISubroutineType(types: !270)
!270 = !{!42, !43, !42}
!271 = !DILocalVariable(name: "path", arg: 1, scope: !268, file: !39, line: 128, type: !43)
!272 = !DILocation(line: 128, column: 30, scope: !268)
!273 = !DILocalVariable(name: "mask", arg: 2, scope: !268, file: !39, line: 128, type: !42)
!274 = !DILocation(line: 128, column: 40, scope: !268)
!275 = !DILocalVariable(name: "res", scope: !268, file: !39, line: 130, type: !42)
!276 = !DILocation(line: 130, column: 6, scope: !268)
!277 = !DILocalVariable(name: "st", scope: !268, file: !39, line: 131, type: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !279, line: 46, size: 1152, align: 64, elements: !280)
!279 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!280 = !{!281, !284, !286, !288, !290, !292, !294, !295, !296, !299, !301, !303, !311, !312, !313}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !278, file: !279, line: 48, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !283, line: 124, baseType: !35)
!283 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!284 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !278, file: !279, line: 53, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !283, line: 127, baseType: !35)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !278, file: !279, line: 61, baseType: !287, size: 64, align: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !283, line: 130, baseType: !35)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !278, file: !279, line: 62, baseType: !289, size: 32, align: 32, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !283, line: 129, baseType: !67)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !278, file: !279, line: 64, baseType: !291, size: 32, align: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !283, line: 125, baseType: !67)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !278, file: !279, line: 65, baseType: !293, size: 32, align: 32, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !283, line: 126, baseType: !67)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !278, file: !279, line: 67, baseType: !42, size: 32, align: 32, offset: 288)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !278, file: !279, line: 69, baseType: !282, size: 64, align: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !278, file: !279, line: 74, baseType: !297, size: 64, align: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !283, line: 131, baseType: !298)
!298 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !278, file: !279, line: 78, baseType: !300, size: 64, align: 64, offset: 448)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !283, line: 153, baseType: !298)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !278, file: !279, line: 80, baseType: !302, size: 64, align: 64, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !283, line: 158, baseType: !298)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !278, file: !279, line: 91, baseType: !304, size: 128, align: 64, offset: 576)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !305, line: 120, size: 128, align: 64, elements: !306)
!305 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!306 = !{!307, !309}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !304, file: !305, line: 122, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !283, line: 139, baseType: !298)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !304, file: !305, line: 123, baseType: !310, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !283, line: 175, baseType: !298)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !278, file: !279, line: 92, baseType: !304, size: 128, align: 64, offset: 704)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !278, file: !279, line: 93, baseType: !304, size: 128, align: 64, offset: 832)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !278, file: !279, line: 106, baseType: !314, size: 192, align: 64, offset: 960)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 192, align: 64, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 3)
!317 = !DILocation(line: 131, column: 14, scope: !268)
!318 = !DILocation(line: 133, column: 13, scope: !268)
!319 = !DILocation(line: 133, column: 8, scope: !268)
!320 = !DILocation(line: 133, column: 6, scope: !268)
!321 = !DILocation(line: 134, column: 6, scope: !322)
!322 = distinct !DILexicalBlock(scope: !268, file: !39, line: 134, column: 6)
!323 = !DILocation(line: 134, column: 10, scope: !322)
!324 = !DILocation(line: 134, column: 6, scope: !268)
!325 = !DILocation(line: 135, column: 16, scope: !322)
!326 = !DILocation(line: 135, column: 22, scope: !322)
!327 = !DILocation(line: 135, column: 10, scope: !322)
!328 = !DILocation(line: 135, column: 3, scope: !322)
!329 = !DILocation(line: 137, column: 9, scope: !330)
!330 = distinct !DILexicalBlock(scope: !268, file: !39, line: 137, column: 6)
!331 = !DILocation(line: 137, column: 20, scope: !330)
!332 = !DILocation(line: 137, column: 6, scope: !268)
!333 = !DILocation(line: 139, column: 4, scope: !334)
!334 = distinct !DILexicalBlock(scope: !330, file: !39, line: 138, column: 2)
!335 = !DILocation(line: 139, column: 8, scope: !334)
!336 = !DILocation(line: 140, column: 3, scope: !334)
!337 = !DILocation(line: 143, column: 2, scope: !268)
!338 = !DILocation(line: 144, column: 1, scope: !268)
!339 = distinct !DISubprogram(name: "utils_mkdir_p", scope: !39, file: !39, line: 147, type: !269, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !45)
!340 = !DILocalVariable(name: "path", arg: 1, scope: !339, file: !39, line: 147, type: !43)
!341 = !DILocation(line: 147, column: 27, scope: !339)
!342 = !DILocalVariable(name: "mask", arg: 2, scope: !339, file: !39, line: 147, type: !42)
!343 = !DILocation(line: 147, column: 37, scope: !339)
!344 = !DILocalVariable(name: "res", scope: !339, file: !39, line: 149, type: !42)
!345 = !DILocation(line: 149, column: 6, scope: !339)
!346 = !DILocalVariable(name: "ptok", scope: !339, file: !39, line: 150, type: !32)
!347 = !DILocation(line: 150, column: 8, scope: !339)
!348 = !DILocalVariable(name: "pt", scope: !339, file: !39, line: 151, type: !349)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32768, align: 8, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 4096)
!352 = !DILocation(line: 151, column: 7, scope: !339)
!353 = !DILocalVariable(name: "bp", scope: !339, file: !39, line: 152, type: !349)
!354 = !DILocation(line: 152, column: 7, scope: !339)
!355 = !DILocation(line: 154, column: 7, scope: !356)
!356 = distinct !DILexicalBlock(scope: !339, file: !39, line: 154, column: 6)
!357 = !DILocation(line: 154, column: 12, scope: !356)
!358 = !DILocation(line: 154, column: 22, scope: !359)
!359 = !DILexicalBlockFile(scope: !356, file: !39, discriminator: 1)
!360 = !DILocation(line: 154, column: 15, scope: !359)
!361 = !DILocation(line: 154, column: 28, scope: !359)
!362 = !DILocation(line: 154, column: 6, scope: !359)
!363 = !DILocation(line: 156, column: 4, scope: !364)
!364 = distinct !DILexicalBlock(scope: !356, file: !39, line: 155, column: 2)
!365 = !DILocation(line: 156, column: 8, scope: !364)
!366 = !DILocation(line: 157, column: 3, scope: !364)
!367 = !DILocation(line: 159, column: 13, scope: !368)
!368 = distinct !DILexicalBlock(scope: !339, file: !39, line: 159, column: 6)
!369 = !DILocation(line: 159, column: 6, scope: !368)
!370 = !DILocation(line: 159, column: 19, scope: !368)
!371 = !DILocation(line: 159, column: 6, scope: !339)
!372 = !DILocation(line: 161, column: 4, scope: !373)
!373 = distinct !DILexicalBlock(scope: !368, file: !39, line: 160, column: 2)
!374 = !DILocation(line: 161, column: 8, scope: !373)
!375 = !DILocation(line: 162, column: 3, scope: !373)
!376 = !DILocation(line: 165, column: 6, scope: !339)
!377 = !DILocation(line: 166, column: 10, scope: !339)
!378 = !DILocation(line: 166, column: 16, scope: !339)
!379 = !DILocation(line: 166, column: 2, scope: !339)
!380 = !DILocation(line: 166, column: 8, scope: !339)
!381 = !DILocation(line: 167, column: 9, scope: !339)
!382 = !DILocation(line: 167, column: 13, scope: !339)
!383 = !DILocation(line: 167, column: 2, scope: !339)
!384 = !DILocation(line: 169, column: 16, scope: !339)
!385 = !DILocation(line: 169, column: 9, scope: !339)
!386 = !DILocation(line: 169, column: 7, scope: !339)
!387 = !DILocation(line: 170, column: 6, scope: !388)
!388 = distinct !DILexicalBlock(scope: !339, file: !39, line: 170, column: 6)
!389 = !DILocation(line: 170, column: 11, scope: !388)
!390 = !DILocation(line: 170, column: 6, scope: !339)
!391 = !DILocation(line: 171, column: 27, scope: !388)
!392 = !DILocation(line: 171, column: 33, scope: !388)
!393 = !DILocation(line: 171, column: 10, scope: !388)
!394 = !DILocation(line: 171, column: 3, scope: !388)
!395 = !DILocation(line: 173, column: 2, scope: !339)
!396 = distinct !{!396, !395}
!397 = !DILocation(line: 175, column: 7, scope: !398)
!398 = distinct !DILexicalBlock(scope: !399, file: !39, line: 175, column: 7)
!399 = distinct !DILexicalBlock(scope: !339, file: !39, line: 174, column: 2)
!400 = !DILocation(line: 175, column: 15, scope: !398)
!401 = !DILocation(line: 175, column: 12, scope: !398)
!402 = !DILocation(line: 175, column: 7, scope: !399)
!403 = !DILocation(line: 176, column: 11, scope: !398)
!404 = !DILocation(line: 176, column: 4, scope: !398)
!405 = !DILocation(line: 178, column: 10, scope: !399)
!406 = !DILocation(line: 178, column: 14, scope: !399)
!407 = !DILocation(line: 178, column: 3, scope: !399)
!408 = !DILocation(line: 179, column: 26, scope: !399)
!409 = !DILocation(line: 179, column: 30, scope: !399)
!410 = !DILocation(line: 179, column: 9, scope: !399)
!411 = !DILocation(line: 179, column: 7, scope: !399)
!412 = !DILocation(line: 180, column: 7, scope: !413)
!413 = distinct !DILexicalBlock(scope: !399, file: !39, line: 180, column: 7)
!414 = !DILocation(line: 180, column: 11, scope: !413)
!415 = !DILocation(line: 180, column: 7, scope: !399)
!416 = !DILocation(line: 181, column: 11, scope: !413)
!417 = !DILocation(line: 181, column: 4, scope: !413)
!418 = !DILocation(line: 183, column: 2, scope: !399)
!419 = !DILocation(line: 184, column: 17, scope: !339)
!420 = !DILocation(line: 184, column: 15, scope: !339)
!421 = !DILocation(line: 184, column: 35, scope: !339)
!422 = !DILocation(line: 183, column: 2, scope: !423)
!423 = !DILexicalBlockFile(scope: !399, file: !39, discriminator: 1)
!424 = !DILocation(line: 186, column: 2, scope: !339)
!425 = !DILocation(line: 187, column: 1, scope: !339)
!426 = !DILocalVariable(name: "src", arg: 1, scope: !38, file: !39, line: 191, type: !43)
!427 = !DILocation(line: 191, column: 34, scope: !38)
!428 = !DILocalVariable(name: "is", arg: 2, scope: !38, file: !39, line: 191, type: !33)
!429 = !DILocation(line: 191, column: 46, scope: !38)
!430 = !DILocalVariable(name: "dest", arg: 3, scope: !38, file: !39, line: 191, type: !32)
!431 = !DILocation(line: 191, column: 56, scope: !38)
!432 = !DILocalVariable(name: "os", arg: 4, scope: !38, file: !39, line: 191, type: !33)
!433 = !DILocation(line: 191, column: 69, scope: !38)
!434 = !DILocation(line: 194, column: 6, scope: !435)
!435 = distinct !DILexicalBlock(scope: !38, file: !39, line: 194, column: 6)
!436 = !DILocation(line: 194, column: 52, scope: !435)
!437 = !DILocation(line: 194, column: 6, scope: !38)
!438 = !DILocation(line: 195, column: 3, scope: !435)
!439 = !DILocation(line: 197, column: 6, scope: !440)
!440 = distinct !DILexicalBlock(scope: !38, file: !39, line: 197, column: 6)
!441 = !DILocation(line: 197, column: 20, scope: !440)
!442 = !DILocation(line: 197, column: 6, scope: !38)
!443 = !DILocation(line: 198, column: 3, scope: !440)
!444 = !DILocation(line: 201, column: 6, scope: !445)
!445 = distinct !DILexicalBlock(scope: !38, file: !39, line: 201, column: 6)
!446 = !DILocation(line: 201, column: 14, scope: !445)
!447 = !DILocation(line: 201, column: 6, scope: !38)
!448 = !DILocation(line: 203, column: 17, scope: !449)
!449 = distinct !DILexicalBlock(scope: !450, file: !39, line: 203, column: 7)
!450 = distinct !DILexicalBlock(scope: !445, file: !39, line: 202, column: 2)
!451 = !DILocation(line: 203, column: 16, scope: !449)
!452 = !DILocation(line: 203, column: 50, scope: !449)
!453 = !DILocation(line: 203, column: 7, scope: !450)
!454 = !DILocation(line: 207, column: 20, scope: !455)
!455 = distinct !DILexicalBlock(scope: !449, file: !39, line: 204, column: 3)
!456 = !DILocation(line: 205, column: 4, scope: !455)
!457 = !DILocation(line: 209, column: 18, scope: !455)
!458 = !DILocation(line: 210, column: 4, scope: !455)
!459 = !DILocation(line: 212, column: 2, scope: !450)
!460 = !DILocation(line: 215, column: 11, scope: !461)
!461 = distinct !DILexicalBlock(scope: !38, file: !39, line: 215, column: 5)
!462 = !DILocation(line: 215, column: 5, scope: !461)
!463 = !DILocation(line: 215, column: 53, scope: !461)
!464 = !DILocation(line: 215, column: 5, scope: !38)
!465 = !DILocation(line: 217, column: 14, scope: !466)
!466 = distinct !DILexicalBlock(scope: !461, file: !39, line: 216, column: 2)
!467 = !DILocation(line: 217, column: 2, scope: !466)
!468 = !DILocation(line: 218, column: 11, scope: !466)
!469 = !DILocation(line: 219, column: 75, scope: !466)
!470 = !DILocation(line: 219, column: 74, scope: !466)
!471 = !DILocation(line: 219, column: 3, scope: !472)
!472 = !DILexicalBlockFile(scope: !466, file: !39, discriminator: 1)
!473 = !DILocation(line: 221, column: 17, scope: !466)
!474 = !DILocation(line: 222, column: 3, scope: !466)
!475 = !DILocation(line: 226, column: 6, scope: !476)
!476 = distinct !DILexicalBlock(scope: !38, file: !39, line: 226, column: 6)
!477 = !DILocation(line: 226, column: 9, scope: !476)
!478 = !DILocation(line: 226, column: 6, scope: !38)
!479 = !DILocation(line: 227, column: 3, scope: !476)
!480 = !DILocation(line: 226, column: 12, scope: !481)
!481 = !DILexicalBlockFile(scope: !476, file: !39, discriminator: 1)
!482 = !DILocation(line: 231, column: 6, scope: !483)
!483 = distinct !DILexicalBlock(scope: !38, file: !39, line: 231, column: 6)
!484 = !DILocation(line: 231, column: 19, scope: !483)
!485 = !DILocation(line: 231, column: 12, scope: !483)
!486 = !DILocation(line: 231, column: 24, scope: !483)
!487 = !DILocation(line: 231, column: 9, scope: !483)
!488 = !DILocation(line: 231, column: 6, scope: !38)
!489 = !DILocation(line: 232, column: 3, scope: !483)
!490 = !DILocation(line: 234, column: 9, scope: !38)
!491 = !DILocation(line: 234, column: 15, scope: !38)
!492 = !DILocation(line: 234, column: 27, scope: !38)
!493 = !DILocation(line: 234, column: 20, scope: !38)
!494 = !DILocation(line: 234, column: 32, scope: !38)
!495 = !DILocation(line: 234, column: 2, scope: !496)
!496 = !DILexicalBlockFile(scope: !38, file: !39, discriminator: 1)
!497 = !DILocation(line: 235, column: 2, scope: !38)
!498 = !DILocation(line: 236, column: 1, scope: !38)
!499 = distinct !DISubprogram(name: "logger", scope: !39, file: !39, line: 325, type: !500, isLocal: false, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !45)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !502, !50, !32, null}
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_subject_t", file: !4, line: 57, baseType: !3)
!503 = !DILocalVariable(name: "s", arg: 1, scope: !499, file: !39, line: 325, type: !502)
!504 = !DILocation(line: 325, column: 22, scope: !499)
!505 = !DILocalVariable(name: "lvl", arg: 2, scope: !499, file: !39, line: 325, type: !50)
!506 = !DILocation(line: 325, column: 37, scope: !499)
!507 = !DILocalVariable(name: "format", arg: 3, scope: !499, file: !39, line: 325, type: !32)
!508 = !DILocation(line: 325, column: 48, scope: !499)
!509 = !DILocalVariable(name: "ap", scope: !499, file: !39, line: 327, type: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !511, line: 79, baseType: !512)
!511 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !513, line: 40, baseType: !514)
!513 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 327, baseType: !515)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 192, align: 64, elements: !522)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 327, size: 192, align: 64, elements: !517)
!517 = !{!518, !519, !520, !521}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !516, file: !1, line: 327, baseType: !67, size: 32, align: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !516, file: !1, line: 327, baseType: !67, size: 32, align: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !516, file: !1, line: 327, baseType: !28, size: 64, align: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !516, file: !1, line: 327, baseType: !28, size: 64, align: 64, offset: 128)
!522 = !{!523}
!523 = !DISubrange(count: 1)
!524 = !DILocation(line: 327, column: 10, scope: !499)
!525 = !DILocalVariable(name: "buf", scope: !499, file: !39, line: 328, type: !526)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8192, align: 8, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 1024)
!529 = !DILocation(line: 328, column: 7, scope: !499)
!530 = !DILocation(line: 331, column: 6, scope: !531)
!531 = distinct !DILexicalBlock(scope: !499, file: !39, line: 331, column: 6)
!532 = !DILocation(line: 331, column: 22, scope: !531)
!533 = !DILocation(line: 331, column: 20, scope: !531)
!534 = !DILocation(line: 331, column: 6, scope: !499)
!535 = !DILocation(line: 332, column: 3, scope: !531)
!536 = !DILocation(line: 335, column: 6, scope: !537)
!537 = distinct !DILexicalBlock(scope: !499, file: !39, line: 335, column: 6)
!538 = !DILocation(line: 335, column: 10, scope: !537)
!539 = !DILocation(line: 335, column: 20, scope: !537)
!540 = !DILocation(line: 335, column: 25, scope: !541)
!541 = !DILexicalBlockFile(scope: !537, file: !39, discriminator: 1)
!542 = !DILocation(line: 335, column: 50, scope: !541)
!543 = !DILocation(line: 335, column: 47, scope: !541)
!544 = !DILocation(line: 335, column: 42, scope: !541)
!545 = !DILocation(line: 335, column: 6, scope: !541)
!546 = !DILocation(line: 336, column: 3, scope: !537)
!547 = !DILocation(line: 338, column: 1, scope: !499)
!548 = !DILocation(line: 339, column: 12, scope: !499)
!549 = !DILocation(line: 339, column: 30, scope: !499)
!550 = !DILocation(line: 339, column: 38, scope: !499)
!551 = !DILocation(line: 339, column: 2, scope: !499)
!552 = !DILocation(line: 342, column: 6, scope: !553)
!553 = distinct !DILexicalBlock(scope: !499, file: !39, line: 342, column: 6)
!554 = !DILocation(line: 342, column: 10, scope: !553)
!555 = !DILocation(line: 342, column: 20, scope: !553)
!556 = !DILocation(line: 342, column: 23, scope: !557)
!557 = !DILexicalBlockFile(scope: !553, file: !39, discriminator: 1)
!558 = !DILocation(line: 342, column: 27, scope: !557)
!559 = !DILocation(line: 342, column: 6, scope: !557)
!560 = !DILocation(line: 343, column: 10, scope: !553)
!561 = !DILocation(line: 343, column: 26, scope: !553)
!562 = !DILocation(line: 343, column: 3, scope: !553)
!563 = !DILocation(line: 345, column: 10, scope: !553)
!564 = !DILocation(line: 345, column: 42, scope: !553)
!565 = !DILocation(line: 345, column: 34, scope: !553)
!566 = !DILocation(line: 345, column: 52, scope: !553)
!567 = !DILocation(line: 345, column: 46, scope: !553)
!568 = !DILocation(line: 345, column: 58, scope: !553)
!569 = !DILocation(line: 345, column: 3, scope: !553)
!570 = !DILocation(line: 347, column: 8, scope: !499)
!571 = !DILocation(line: 347, column: 2, scope: !499)
!572 = !DILocation(line: 349, column: 1, scope: !499)
!573 = !DILocation(line: 350, column: 1, scope: !499)
!574 = !DILocation(line: 350, column: 1, scope: !575)
!575 = !DILexicalBlockFile(scope: !499, file: !39, discriminator: 1)
!576 = distinct !DISubprogram(name: "utils_calculate_dpi_scale_factors", scope: !39, file: !39, line: 240, type: !577, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !45)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !66, !66, !66, !579, !579, !579, !579}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!580 = !DILocalVariable(name: "width", arg: 1, scope: !576, file: !39, line: 240, type: !66)
!581 = !DILocation(line: 240, column: 42, scope: !576)
!582 = !DILocalVariable(name: "height", arg: 2, scope: !576, file: !39, line: 240, type: !66)
!583 = !DILocation(line: 240, column: 56, scope: !576)
!584 = !DILocalVariable(name: "dpi", arg: 3, scope: !576, file: !39, line: 240, type: !66)
!585 = !DILocation(line: 240, column: 71, scope: !576)
