; ModuleID = './[inter]xwin.o.i'
source_filename = "./[inter]xwin.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._XDisplay = type opaque
%struct.XModifierKeymap = type { i32, i8* }
%struct.XErrorEvent = type { i32, %struct._XDisplay*, i64, i64, i8, i8, i8 }
%struct.Screen = type { %struct._XExtData*, %struct._XDisplay*, i64, i32, i32, i32, i32, i32, %struct.Depth*, i32, %struct.Visual*, %struct._XGC*, i64, i64, i64, i32, i32, i32, i32, i64 }
%struct._XExtData = type { i32, %struct._XExtData*, i32 (%struct._XExtData*)*, i8* }
%struct.Depth = type { i32, i32, %struct.Visual* }
%struct.Visual = type { %struct._XExtData*, i64, i32, i64, i64, i64, i32, i32 }
%struct._XGC = type opaque
%struct._XIM = type opaque
%struct._XIC = type opaque
%struct._seamless_window = type { i64, i64, i64, %struct._seamless_group*, i32, i32, i32, i32, i32, i32, %struct.timeval*, i32, i32, i32, i32, i32, i32, i32, i32, [4096 x i8], %struct._seamless_window* }
%struct._seamless_group = type { i64, i64, i32 }
%struct.timeval = type { i64, i64 }
%struct.XRectangle = type { i16, i16, i16, i16 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !42, globals: !248)
!1 = !DIFile(filename: "[inter]xwin.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15, !22, !31, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RDP_INPUT_DEVICE", file: !23, line: 278, size: 32, align: 32, elements: !24)
!23 = !DIFile(filename: "constants.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!24 = !{!25, !26, !27, !28, !29, !30}
!25 = !DIEnumerator(name: "RDP_INPUT_SYNCHRONIZE", value: 0)
!26 = !DIEnumerator(name: "RDP_INPUT_CODEPOINT", value: 1)
!27 = !DIEnumerator(name: "RDP_INPUT_VIRTKEY", value: 2)
!28 = !DIEnumerator(name: "RDP_INPUT_SCANCODE", value: 4)
!29 = !DIEnumerator(name: "RDP_INPUT_MOUSE", value: 32769)
!30 = !DIEnumerator(name: "RDP_INPUT_MOUSEX", value: 32770)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RDP_SUPPRESS_STATUS", file: !23, line: 811, size: 32, align: 32, elements: !32)
!32 = !{!33, !34}
!33 = !DIEnumerator(name: "SUPPRESS_DISPLAY_UPDATES", value: 0)
!34 = !DIEnumerator(name: "ALLOW_DISPLAY_UPDATES", value: 1)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 311, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!37 = !{!38, !39, !40, !41}
!38 = !DIEnumerator(name: "Fixed", value: 0)
!39 = !DIEnumerator(name: "PercentageOfScreen", value: 1)
!40 = !DIEnumerator(name: "Workarea", value: 2)
!41 = !DIEnumerator(name: "Fullscreen", value: 3)
!42 = !{!43, !44, !46, !49, !187, !136, !45, !68, !188, !189, !190, !191, !192, !178, !194, !205, !170, !206, !81, !117, !213, !214, !215, !237, !239, !47, !240, !67, !241}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !36, line: 28, baseType: !45)
!45 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !36, line: 39, baseType: !48)
!48 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "_XPrivDisplay", file: !50, line: 550, baseType: !51)
!50 = !DIFile(filename: "/usr/include/X11/Xlib.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 493, size: 2368, align: 64, elements: !53)
!53 = !{!54, !70, !73, !74, !75, !76, !77, !78, !82, !83, !84, !85, !91, !92, !93, !94, !95, !96, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !118, !121, !125, !126, !127, !128, !179, !180, !181, !182, !183, !184, !185, !186}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !52, file: !50, line: 498, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "XExtData", file: !50, line: 155, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_XExtData", file: !50, line: 148, size: 256, align: 64, elements: !58)
!58 = !{!59, !60, !62, !66}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !57, file: !50, line: 149, baseType: !45, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !57, file: !50, line: 150, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "free_private", scope: !57, file: !50, line: 151, baseType: !63, size: 64, align: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!45, !61}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !57, file: !50, line: 154, baseType: !67, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPointer", file: !50, line: 80, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "private1", scope: !52, file: !50, line: 499, baseType: !71, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XPrivate", file: !50, line: 490, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !52, file: !50, line: 500, baseType: !45, size: 32, align: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "private2", scope: !52, file: !50, line: 501, baseType: !45, size: 32, align: 32, offset: 160)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "proto_major_version", scope: !52, file: !50, line: 502, baseType: !45, size: 32, align: 32, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "proto_minor_version", scope: !52, file: !50, line: 503, baseType: !45, size: 32, align: 32, offset: 224)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !52, file: !50, line: 504, baseType: !68, size: 64, align: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "private3", scope: !52, file: !50, line: 505, baseType: !79, size: 64, align: 64, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "XID", file: !80, line: 66, baseType: !81)
!80 = !DIFile(filename: "/usr/include/X11/X.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!81 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "private4", scope: !52, file: !50, line: 506, baseType: !79, size: 64, align: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "private5", scope: !52, file: !50, line: 507, baseType: !79, size: 64, align: 64, offset: 448)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "private6", scope: !52, file: !50, line: 508, baseType: !45, size: 32, align: 32, offset: 512)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "resource_alloc", scope: !52, file: !50, line: 509, baseType: !86, size: 64, align: 64, offset: 576)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!79, !89}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XDisplay", file: !50, line: 255, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "byte_order", scope: !52, file: !50, line: 512, baseType: !45, size: 32, align: 32, offset: 640)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_unit", scope: !52, file: !50, line: 513, baseType: !45, size: 32, align: 32, offset: 672)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_pad", scope: !52, file: !50, line: 514, baseType: !45, size: 32, align: 32, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_bit_order", scope: !52, file: !50, line: 515, baseType: !45, size: 32, align: 32, offset: 736)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "nformats", scope: !52, file: !50, line: 516, baseType: !45, size: 32, align: 32, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "pixmap_format", scope: !52, file: !50, line: 517, baseType: !97, size: 64, align: 64, offset: 832)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScreenFormat", file: !50, line: 285, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 280, size: 192, align: 64, elements: !100)
!100 = !{!101, !102, !103, !104}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !99, file: !50, line: 281, baseType: !55, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !99, file: !50, line: 282, baseType: !45, size: 32, align: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_pixel", scope: !99, file: !50, line: 283, baseType: !45, size: 32, align: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "scanline_pad", scope: !99, file: !50, line: 284, baseType: !45, size: 32, align: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "private8", scope: !52, file: !50, line: 518, baseType: !45, size: 32, align: 32, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !52, file: !50, line: 519, baseType: !45, size: 32, align: 32, offset: 928)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "private9", scope: !52, file: !50, line: 520, baseType: !71, size: 64, align: 64, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "private10", scope: !52, file: !50, line: 520, baseType: !71, size: 64, align: 64, offset: 1024)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "qlen", scope: !52, file: !50, line: 521, baseType: !45, size: 32, align: 32, offset: 1088)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "last_request_read", scope: !52, file: !50, line: 522, baseType: !81, size: 64, align: 64, offset: 1152)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "request", scope: !52, file: !50, line: 523, baseType: !81, size: 64, align: 64, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "private11", scope: !52, file: !50, line: 524, baseType: !67, size: 64, align: 64, offset: 1280)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "private12", scope: !52, file: !50, line: 525, baseType: !67, size: 64, align: 64, offset: 1344)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "private13", scope: !52, file: !50, line: 526, baseType: !67, size: 64, align: 64, offset: 1408)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "private14", scope: !52, file: !50, line: 527, baseType: !67, size: 64, align: 64, offset: 1472)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "max_request_size", scope: !52, file: !50, line: 528, baseType: !117, size: 32, align: 32, offset: 1536)
!117 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !52, file: !50, line: 529, baseType: !119, size: 64, align: 64, offset: 1600)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XrmHashBucketRec", file: !50, line: 491, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "private15", scope: !52, file: !50, line: 530, baseType: !122, size: 64, align: 64, offset: 1664)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!45, !89}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "display_name", scope: !52, file: !50, line: 533, baseType: !68, size: 64, align: 64, offset: 1728)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "default_screen", scope: !52, file: !50, line: 534, baseType: !45, size: 32, align: 32, offset: 1792)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nscreens", scope: !52, file: !50, line: 535, baseType: !45, size: 32, align: 32, offset: 1824)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "screens", scope: !52, file: !50, line: 536, baseType: !129, size: 64, align: 64, offset: 1856)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "Screen", file: !50, line: 275, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 257, size: 1024, align: 64, elements: !132)
!132 = !{!133, !134, !135, !137, !138, !139, !140, !141, !142, !163, !164, !165, !169, !171, !172, !173, !174, !175, !176, !177}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !131, file: !50, line: 258, baseType: !55, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !131, file: !50, line: 259, baseType: !89, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !131, file: !50, line: 260, baseType: !136, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "Window", file: !80, line: 96, baseType: !79)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !131, file: !50, line: 261, baseType: !45, size: 32, align: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !131, file: !50, line: 261, baseType: !45, size: 32, align: 32, offset: 224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mwidth", scope: !131, file: !50, line: 262, baseType: !45, size: 32, align: 32, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mheight", scope: !131, file: !50, line: 262, baseType: !45, size: 32, align: 32, offset: 288)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ndepths", scope: !131, file: !50, line: 263, baseType: !45, size: 32, align: 32, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "depths", scope: !131, file: !50, line: 264, baseType: !143, size: 64, align: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "Depth", file: !50, line: 247, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 243, size: 128, align: 64, elements: !146)
!146 = !{!147, !148, !149}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !145, file: !50, line: 244, baseType: !45, size: 32, align: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nvisuals", scope: !145, file: !50, line: 245, baseType: !45, size: 32, align: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "visuals", scope: !145, file: !50, line: 246, baseType: !150, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "Visual", file: !50, line: 238, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 227, size: 448, align: 64, elements: !153)
!153 = !{!154, !155, !157, !158, !159, !160, !161, !162}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ext_data", scope: !152, file: !50, line: 228, baseType: !55, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "visualid", scope: !152, file: !50, line: 229, baseType: !156, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "VisualID", file: !80, line: 76, baseType: !81)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !152, file: !50, line: 233, baseType: !45, size: 32, align: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !152, file: !50, line: 235, baseType: !81, size: 64, align: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !152, file: !50, line: 235, baseType: !81, size: 64, align: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !152, file: !50, line: 235, baseType: !81, size: 64, align: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !152, file: !50, line: 236, baseType: !45, size: 32, align: 32, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "map_entries", scope: !152, file: !50, line: 237, baseType: !45, size: 32, align: 32, offset: 416)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "root_depth", scope: !131, file: !50, line: 265, baseType: !45, size: 32, align: 32, offset: 448)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "root_visual", scope: !131, file: !50, line: 266, baseType: !150, size: 64, align: 64, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "default_gc", scope: !131, file: !50, line: 267, baseType: !166, size: 64, align: 64, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "GC", file: !50, line: 222, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XGC", file: !50, line: 214, flags: DIFlagFwdDecl)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "cmap", scope: !131, file: !50, line: 268, baseType: !170, size: 64, align: 64, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colormap", file: !80, line: 104, baseType: !79)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "white_pixel", scope: !131, file: !50, line: 269, baseType: !81, size: 64, align: 64, offset: 704)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "black_pixel", scope: !131, file: !50, line: 270, baseType: !81, size: 64, align: 64, offset: 768)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "max_maps", scope: !131, file: !50, line: 271, baseType: !45, size: 32, align: 32, offset: 832)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "min_maps", scope: !131, file: !50, line: 271, baseType: !45, size: 32, align: 32, offset: 864)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "backing_store", scope: !131, file: !50, line: 272, baseType: !45, size: 32, align: 32, offset: 896)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "save_unders", scope: !131, file: !50, line: 273, baseType: !45, size: 32, align: 32, offset: 928)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "root_input_mask", scope: !131, file: !50, line: 274, baseType: !178, size: 64, align: 64, offset: 960)
!178 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "motion_buffer", scope: !52, file: !50, line: 537, baseType: !81, size: 64, align: 64, offset: 1920)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "private16", scope: !52, file: !50, line: 538, baseType: !81, size: 64, align: 64, offset: 1984)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "min_keycode", scope: !52, file: !50, line: 539, baseType: !45, size: 32, align: 32, offset: 2048)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "max_keycode", scope: !52, file: !50, line: 540, baseType: !45, size: 32, align: 32, offset: 2080)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "private17", scope: !52, file: !50, line: 541, baseType: !67, size: 64, align: 64, offset: 2112)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "private18", scope: !52, file: !50, line: 542, baseType: !67, size: 64, align: 64, offset: 2176)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "private19", scope: !52, file: !50, line: 543, baseType: !45, size: 32, align: 32, offset: 2240)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "xdefaults", scope: !52, file: !50, line: 544, baseType: !68, size: 64, align: 64, offset: 2304)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cursor", file: !80, line: 103, baseType: !79)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_HBITMAP", file: !36, line: 46, baseType: !43)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixmap", file: !80, line: 102, baseType: !79)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_HGLYPH", file: !36, line: 47, baseType: !43)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_HCURSOR", file: !36, line: 49, baseType: !43)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !36, line: 43, baseType: !117)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "XColor", file: !50, line: 415, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 410, size: 128, align: 64, elements: !197)
!197 = !{!198, !199, !201, !202, !203, !204}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !196, file: !50, line: 411, baseType: !81, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !196, file: !50, line: 412, baseType: !200, size: 16, align: 16, offset: 64)
!200 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !196, file: !50, line: 412, baseType: !200, size: 16, align: 16, offset: 80)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !196, file: !50, line: 412, baseType: !200, size: 16, align: 16, offset: 96)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !196, file: !50, line: 413, baseType: !69, size: 8, align: 8, offset: 112)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !196, file: !50, line: 414, baseType: !69, size: 8, align: 8, offset: 120)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_HCOLOURMAP", file: !36, line: 48, baseType: !43)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPoint", file: !50, line: 428, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 426, size: 32, align: 16, elements: !209)
!209 = !{!210, !212}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !208, file: !50, line: 427, baseType: !211, size: 16, align: 16)
!211 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !208, file: !50, line: 427, baseType: !211, size: 16, align: 16, offset: 16)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atom", file: !80, line: 74, baseType: !81)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "XKeyEvent", file: !50, line: 571, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 557, size: 768, align: 64, elements: !218)
!218 = !{!219, !220, !221, !222, !225, !226, !227, !228, !230, !231, !232, !233, !234, !235, !236}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !217, file: !50, line: 558, baseType: !45, size: 32, align: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !217, file: !50, line: 559, baseType: !81, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "send_event", scope: !217, file: !50, line: 560, baseType: !45, size: 32, align: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !217, file: !50, line: 561, baseType: !223, size: 64, align: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "Display", file: !50, line: 487, baseType: !90)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !217, file: !50, line: 562, baseType: !136, size: 64, align: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !217, file: !50, line: 563, baseType: !136, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "subwindow", scope: !217, file: !50, line: 564, baseType: !136, size: 64, align: 64, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !217, file: !50, line: 565, baseType: !229, size: 64, align: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "Time", file: !80, line: 77, baseType: !81)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !217, file: !50, line: 566, baseType: !45, size: 32, align: 32, offset: 512)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !217, file: !50, line: 566, baseType: !45, size: 32, align: 32, offset: 544)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "x_root", scope: !217, file: !50, line: 567, baseType: !45, size: 32, align: 32, offset: 576)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "y_root", scope: !217, file: !50, line: 567, baseType: !45, size: 32, align: 32, offset: 608)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !217, file: !50, line: 568, baseType: !117, size: 32, align: 32, offset: 640)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !217, file: !50, line: 569, baseType: !117, size: 32, align: 32, offset: 672)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "same_screen", scope: !217, file: !50, line: 570, baseType: !45, size: 32, align: 32, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !238, line: 54, baseType: !178)
!238 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !36, line: 41, baseType: !200)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "sw_configurenotify_context", file: !243, line: 574, baseType: !244)
!243 = !DIFile(filename: "xwin.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sw_configurenotify_context", file: !243, line: 570, size: 128, align: 64, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !244, file: !243, line: 572, baseType: !136, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !244, file: !243, line: 573, baseType: !81, size: 64, align: 64, offset: 64)
!248 = !{!249, !250, !251, !252, !257, !258, !259, !260, !265, !266, !267, !268, !269, !270, !271, !272, !273, !281, !282, !283, !284, !288, !292, !301, !302, !303, !304, !305, !306, !307, !308, !309, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !338, !339, !340, !341, !342, !343, !344, !348, !349, !350, !351, !352, !359, !397, !398, !399, !403, !407, !408}
!249 = distinct !DIGlobalVariable(name: "g_dynamic_session_resize", scope: !0, file: !243, line: 80, type: !44, isLocal: false, isDefinition: true, variable: i32* @g_dynamic_session_resize)
!250 = distinct !DIGlobalVariable(name: "g_seamless_active", scope: !0, file: !243, line: 119, type: !44, isLocal: false, isDefinition: true, variable: i32* @g_seamless_active)
!251 = distinct !DIGlobalVariable(name: "g_enable_compose", scope: !0, file: !243, line: 126, type: !44, isLocal: false, isDefinition: true, variable: i32* @g_enable_compose)
!252 = distinct !DIGlobalVariable(name: "windowed_x", scope: !253, file: !243, line: 2311, type: !193, isLocal: true, isDefinition: true, variable: i32* @xwin_toggle_fullscreen.windowed_x)
!253 = distinct !DISubprogram(name: "xwin_toggle_fullscreen", scope: !243, file: !243, line: 2304, type: !254, isLocal: false, isDefinition: true, scopeLine: 2305, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !256)
!254 = !DISubroutineType(types: !255)
!255 = !{null}
!256 = !{}
!257 = distinct !DIGlobalVariable(name: "windowed_y", scope: !253, file: !243, line: 2312, type: !193, isLocal: true, isDefinition: true, variable: i32* @xwin_toggle_fullscreen.windowed_y)
!258 = distinct !DIGlobalVariable(name: "windowed_height", scope: !253, file: !243, line: 2313, type: !193, isLocal: true, isDefinition: true, variable: i32* @xwin_toggle_fullscreen.windowed_height)
!259 = distinct !DIGlobalVariable(name: "windowed_width", scope: !253, file: !243, line: 2314, type: !193, isLocal: true, isDefinition: true, variable: i32* @xwin_toggle_fullscreen.windowed_width)
!260 = distinct !DIGlobalVariable(name: "g_wait_for_deactivate_ts", scope: !0, file: !243, line: 2958, type: !261, isLocal: false, isDefinition: true, variable: i64* @g_wait_for_deactivate_ts)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !262, line: 75, baseType: !263)
!262 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !264, line: 139, baseType: !178)
!264 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!265 = distinct !DIGlobalVariable(name: "g_display", scope: !0, file: !243, line: 74, type: !223, isLocal: false, isDefinition: true, variable: %struct._XDisplay** @g_display)
!266 = distinct !DIGlobalVariable(name: "g_last_gesturetime", scope: !0, file: !243, line: 75, type: !229, isLocal: false, isDefinition: true, variable: i64* @g_last_gesturetime)
!267 = distinct !DIGlobalVariable(name: "g_x_socket", scope: !0, file: !243, line: 76, type: !45, isLocal: true, isDefinition: true, variable: i32* @g_x_socket)
!268 = distinct !DIGlobalVariable(name: "g_screen", scope: !0, file: !243, line: 77, type: !129, isLocal: true, isDefinition: true, variable: %struct.Screen** @g_screen)
!269 = distinct !DIGlobalVariable(name: "g_wnd", scope: !0, file: !243, line: 78, type: !136, isLocal: false, isDefinition: true, variable: i64* @g_wnd)
!270 = distinct !DIGlobalVariable(name: "g_window_width", scope: !0, file: !243, line: 83, type: !193, isLocal: true, isDefinition: true, variable: i32* @g_window_width)
!271 = distinct !DIGlobalVariable(name: "g_window_height", scope: !0, file: !243, line: 84, type: !193, isLocal: true, isDefinition: true, variable: i32* @g_window_height)
!272 = distinct !DIGlobalVariable(name: "g_Unobscured", scope: !0, file: !243, line: 127, type: !44, isLocal: false, isDefinition: true, variable: i32* @g_Unobscured)
!273 = distinct !DIGlobalVariable(name: "g_clip_rectangle", scope: !0, file: !243, line: 131, type: !274, isLocal: true, isDefinition: true, variable: %struct.XRectangle* @g_clip_rectangle)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "XRectangle", file: !50, line: 433, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 430, size: 64, align: 16, elements: !276)
!276 = !{!277, !278, !279, !280}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !275, file: !50, line: 431, baseType: !211, size: 16, align: 16)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !275, file: !50, line: 431, baseType: !211, size: 16, align: 16, offset: 16)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !275, file: !50, line: 432, baseType: !200, size: 16, align: 16, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !275, file: !50, line: 432, baseType: !200, size: 16, align: 16, offset: 48)
!281 = distinct !DIGlobalVariable(name: "g_visual", scope: !0, file: !243, line: 132, type: !150, isLocal: true, isDefinition: true, variable: %struct.Visual** @g_visual)
!282 = distinct !DIGlobalVariable(name: "g_depth", scope: !0, file: !243, line: 136, type: !45, isLocal: true, isDefinition: true, variable: i32* @g_depth)
!283 = distinct !DIGlobalVariable(name: "g_bpp", scope: !0, file: !243, line: 140, type: !45, isLocal: true, isDefinition: true, variable: i32* @g_bpp)
!284 = distinct !DIGlobalVariable(name: "g_IM", scope: !0, file: !243, line: 141, type: !285, isLocal: true, isDefinition: true, variable: %struct._XIM** @g_IM)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "XIM", file: !50, line: 1145, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XIM", file: !50, line: 1145, flags: DIFlagFwdDecl)
!288 = distinct !DIGlobalVariable(name: "g_IC", scope: !0, file: !243, line: 142, type: !289, isLocal: true, isDefinition: true, variable: %struct._XIC** @g_IC)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "XIC", file: !50, line: 1146, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XIC", file: !50, line: 1146, flags: DIFlagFwdDecl)
!292 = distinct !DIGlobalVariable(name: "g_mod_map", scope: !0, file: !243, line: 143, type: !293, isLocal: true, isDefinition: true, variable: %struct.XModifierKeymap** @g_mod_map)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "XModifierKeymap", file: !50, line: 478, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 475, size: 128, align: 64, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "max_keypermod", scope: !295, file: !50, line: 476, baseType: !45, size: 32, align: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "modifiermap", scope: !295, file: !50, line: 477, baseType: !299, size: 64, align: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "KeyCode", file: !80, line: 108, baseType: !48)
!301 = distinct !DIGlobalVariable(name: "g_current_cursor", scope: !0, file: !243, line: 147, type: !187, isLocal: true, isDefinition: true, variable: i64* @g_current_cursor)
!302 = distinct !DIGlobalVariable(name: "g_protocol_atom", scope: !0, file: !243, line: 149, type: !214, isLocal: true, isDefinition: true, variable: i64* @g_protocol_atom)
!303 = distinct !DIGlobalVariable(name: "g_kill_atom", scope: !0, file: !243, line: 149, type: !214, isLocal: true, isDefinition: true, variable: i64* @g_kill_atom)
!304 = distinct !DIGlobalVariable(name: "g_focused", scope: !0, file: !243, line: 154, type: !44, isLocal: true, isDefinition: true, variable: i32* @g_focused)
!305 = distinct !DIGlobalVariable(name: "g_mouse_in_wnd", scope: !0, file: !243, line: 155, type: !44, isLocal: true, isDefinition: true, variable: i32* @g_mouse_in_wnd)
!306 = distinct !DIGlobalVariable(name: "g_host_be", scope: !0, file: !243, line: 176, type: !44, isLocal: true, isDefinition: true, variable: i32* @g_host_be)
!307 = distinct !DIGlobalVariable(name: "g_xserver_be", scope: !0, file: !243, line: 177, type: !44, isLocal: true, isDefinition: true, variable: i32* @g_xserver_be)
!308 = distinct !DIGlobalVariable(name: "g_xcolmap", scope: !0, file: !243, line: 294, type: !170, isLocal: true, isDefinition: true, variable: i64* @g_xcolmap)
!309 = distinct !DIGlobalVariable(name: "g_old_error_handler", scope: !0, file: !243, line: 1836, type: !310, isLocal: true, isDefinition: true, variable: i32 (%struct._XDisplay*, %struct.XErrorEvent*)** @g_old_error_handler)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "XErrorHandler", file: !50, line: 1843, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!45, !223, !314}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "XErrorEvent", file: !50, line: 932, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 924, size: 320, align: 64, elements: !317)
!317 = !{!318, !319, !320, !321, !322, !323, !324}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !316, file: !50, line: 925, baseType: !45, size: 32, align: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !316, file: !50, line: 926, baseType: !223, size: 64, align: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "resourceid", scope: !316, file: !50, line: 927, baseType: !79, size: 64, align: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !316, file: !50, line: 928, baseType: !81, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "error_code", scope: !316, file: !50, line: 929, baseType: !48, size: 8, align: 8, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "request_code", scope: !316, file: !50, line: 930, baseType: !48, size: 8, align: 8, offset: 264)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "minor_code", scope: !316, file: !50, line: 931, baseType: !48, size: 8, align: 8, offset: 272)
!325 = distinct !DIGlobalVariable(name: "g_error_expected", scope: !0, file: !243, line: 1837, type: !44, isLocal: true, isDefinition: true, variable: i32* @g_error_expected)
!326 = distinct !DIGlobalVariable(name: "g_compatible_arch", scope: !0, file: !243, line: 162, type: !44, isLocal: true, isDefinition: true, variable: i32* @g_compatible_arch)
!327 = distinct !DIGlobalVariable(name: "g_red_shift_r", scope: !0, file: !243, line: 178, type: !45, isLocal: true, isDefinition: true, variable: i32* @g_red_shift_r)
!328 = distinct !DIGlobalVariable(name: "g_red_shift_l", scope: !0, file: !243, line: 179, type: !45, isLocal: true, isDefinition: true, variable: i32* @g_red_shift_l)
!329 = distinct !DIGlobalVariable(name: "g_green_shift_r", scope: !0, file: !243, line: 178, type: !45, isLocal: true, isDefinition: true, variable: i32* @g_green_shift_r)
!330 = distinct !DIGlobalVariable(name: "g_green_shift_l", scope: !0, file: !243, line: 179, type: !45, isLocal: true, isDefinition: true, variable: i32* @g_green_shift_l)
!331 = distinct !DIGlobalVariable(name: "g_blue_shift_r", scope: !0, file: !243, line: 178, type: !45, isLocal: true, isDefinition: true, variable: i32* @g_blue_shift_r)
!332 = distinct !DIGlobalVariable(name: "g_blue_shift_l", scope: !0, file: !243, line: 179, type: !45, isLocal: true, isDefinition: true, variable: i32* @g_blue_shift_l)
!333 = distinct !DIGlobalVariable(name: "g_no_translate_image", scope: !0, file: !243, line: 173, type: !44, isLocal: true, isDefinition: true, variable: i32* @g_no_translate_image)
!334 = distinct !DIGlobalVariable(name: "g_pointer_log_to_phys_map", scope: !0, file: !243, line: 146, type: !335, isLocal: true, isDefinition: true, variable: [32 x i8]* @g_pointer_log_to_phys_map)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 256, align: 8, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 32)
!338 = distinct !DIGlobalVariable(name: "g_using_full_workarea", scope: !0, file: !243, line: 189, type: !44, isLocal: true, isDefinition: true, variable: i32* @g_using_full_workarea)
!339 = distinct !DIGlobalVariable(name: "g_null_cursor", scope: !0, file: !243, line: 148, type: !191, isLocal: true, isDefinition: true, variable: i8** @g_null_cursor)
!340 = distinct !DIGlobalVariable(name: "g_gc", scope: !0, file: !243, line: 128, type: !166, isLocal: true, isDefinition: true, variable: %struct._XGC** @g_gc)
!341 = distinct !DIGlobalVariable(name: "g_create_bitmap_gc", scope: !0, file: !243, line: 129, type: !166, isLocal: true, isDefinition: true, variable: %struct._XGC** @g_create_bitmap_gc)
!342 = distinct !DIGlobalVariable(name: "g_backstore", scope: !0, file: !243, line: 183, type: !189, isLocal: true, isDefinition: true, variable: i64* @g_backstore)
!343 = distinct !DIGlobalVariable(name: "g_seamless_broken_restack", scope: !0, file: !243, line: 121, type: !44, isLocal: true, isDefinition: true, variable: i32* @g_seamless_broken_restack)
!344 = distinct !DIGlobalVariable(name: "is_g_wnd_mapped", scope: !345, file: !243, line: 2524, type: !44, isLocal: true, isDefinition: true, variable: i32* @xwin_process_events.is_g_wnd_mapped)
!345 = distinct !DISubprogram(name: "xwin_process_events", scope: !243, file: !243, line: 2515, type: !346, isLocal: true, isDefinition: true, scopeLine: 2516, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !256)
!346 = !DISubroutineType(types: !347)
!347 = !{!45}
!348 = distinct !DIGlobalVariable(name: "g_moving_wnd", scope: !0, file: !243, line: 186, type: !44, isLocal: true, isDefinition: true, variable: i32* @g_moving_wnd)
!349 = distinct !DIGlobalVariable(name: "g_move_x_offset", scope: !0, file: !243, line: 187, type: !45, isLocal: true, isDefinition: true, variable: i32* @g_move_x_offset)
!350 = distinct !DIGlobalVariable(name: "g_move_y_offset", scope: !0, file: !243, line: 188, type: !45, isLocal: true, isDefinition: true, variable: i32* @g_move_y_offset)
!351 = distinct !DIGlobalVariable(name: "g_seamless_focused", scope: !0, file: !243, line: 117, type: !81, isLocal: true, isDefinition: true, variable: i64* @g_seamless_focused)
!352 = distinct !DIGlobalVariable(name: "g_resize_timer", scope: !0, file: !243, line: 72, type: !353, isLocal: true, isDefinition: true, variable: %struct.timeval* @g_resize_timer)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !354, line: 30, size: 128, align: 64, elements: !355)
!354 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !353, file: !354, line: 32, baseType: !263, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !353, file: !354, line: 33, baseType: !358, size: 64, align: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !264, line: 141, baseType: !178)
!359 = distinct !DIGlobalVariable(name: "g_seamless_windows", scope: !0, file: !243, line: 116, type: !360, isLocal: true, isDefinition: true, variable: %struct._seamless_window** @g_seamless_windows)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "seamless_window", file: !243, line: 115, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seamless_window", file: !243, line: 93, size: 33600, align: 64, elements: !363)
!363 = !{!364, !365, !366, !367, !375, !376, !377, !378, !379, !380, !381, !383, !384, !385, !386, !387, !388, !389, !390, !391, !395}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "wnd", scope: !362, file: !243, line: 95, baseType: !136, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !362, file: !243, line: 96, baseType: !81, size: 64, align: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "behind", scope: !362, file: !243, line: 97, baseType: !81, size: 64, align: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !362, file: !243, line: 98, baseType: !368, size: 64, align: 64, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "seamless_group", file: !243, line: 92, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seamless_group", file: !243, line: 87, size: 192, align: 64, elements: !371)
!371 = !{!372, !373, !374}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "wnd", scope: !370, file: !243, line: 89, baseType: !136, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !370, file: !243, line: 90, baseType: !81, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !370, file: !243, line: 91, baseType: !117, size: 32, align: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "xoffset", scope: !362, file: !243, line: 99, baseType: !45, size: 32, align: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "yoffset", scope: !362, file: !243, line: 99, baseType: !45, size: 32, align: 32, offset: 288)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !362, file: !243, line: 100, baseType: !45, size: 32, align: 32, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !362, file: !243, line: 100, baseType: !45, size: 32, align: 32, offset: 352)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !362, file: !243, line: 101, baseType: !45, size: 32, align: 32, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "desktop", scope: !362, file: !243, line: 102, baseType: !117, size: 32, align: 32, offset: 416)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "position_timer", scope: !362, file: !243, line: 103, baseType: !382, size: 64, align: 64, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "outstanding_position", scope: !362, file: !243, line: 105, baseType: !44, size: 32, align: 32, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "outpos_serial", scope: !362, file: !243, line: 106, baseType: !117, size: 32, align: 32, offset: 544)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "outpos_xoffset", scope: !362, file: !243, line: 107, baseType: !45, size: 32, align: 32, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "outpos_yoffset", scope: !362, file: !243, line: 107, baseType: !45, size: 32, align: 32, offset: 608)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "outpos_width", scope: !362, file: !243, line: 108, baseType: !45, size: 32, align: 32, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "outpos_height", scope: !362, file: !243, line: 108, baseType: !45, size: 32, align: 32, offset: 672)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "icon_size", scope: !362, file: !243, line: 110, baseType: !117, size: 32, align: 32, offset: 704)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "icon_offset", scope: !362, file: !243, line: 111, baseType: !117, size: 32, align: 32, offset: 736)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "icon_buffer", scope: !362, file: !243, line: 112, baseType: !392, size: 32768, align: 8, offset: 768)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 32768, align: 8, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 4096)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !362, file: !243, line: 114, baseType: !396, size: 64, align: 64, offset: 33536)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!397 = distinct !DIGlobalVariable(name: "g_create_glyph_gc", scope: !0, file: !243, line: 130, type: !166, isLocal: true, isDefinition: true, variable: %struct._XGC** @g_create_glyph_gc)
!398 = distinct !DIGlobalVariable(name: "g_colmap", scope: !0, file: !243, line: 295, type: !192, isLocal: true, isDefinition: true, variable: i32** @g_colmap)
!399 = distinct !DIGlobalVariable(name: "rop2_map", scope: !0, file: !243, line: 301, type: !400, isLocal: true, isDefinition: true, variable: [16 x i32]* @rop2_map)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 512, align: 32, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 16)
!403 = distinct !DIGlobalVariable(name: "hatch_patterns", scope: !0, file: !243, line: 3698, type: !404, isLocal: true, isDefinition: true, variable: [48 x i8]* @hatch_patterns)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 384, align: 8, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 48)
!407 = distinct !DIGlobalVariable(name: "g_seamless_started", scope: !0, file: !243, line: 118, type: !44, isLocal: true, isDefinition: true, variable: i32* @g_seamless_started)
!408 = distinct !DIGlobalVariable(name: "g_seamless_hidden", scope: !0, file: !243, line: 120, type: !44, isLocal: true, isDefinition: true, variable: i32* @g_seamless_hidden)
!409 = !{i32 2, !"Dwarf Version", i32 4}
!410 = !{i32 2, !"Debug Info Version", i32 3}
!411 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!412 = distinct !DISubprogram(name: "get_key_state", scope: !243, file: !243, line: 1593, type: !413, isLocal: false, isDefinition: true, scopeLine: 1594, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !256)
!413 = !DISubroutineType(types: !414)
!414 = !{!44, !117, !193}
!415 = !DILocalVariable(name: "state", arg: 1, scope: !412, file: !243, line: 1593, type: !117)
!416 = !DIExpression()
!417 = !DILocation(line: 1593, column: 28, scope: !412)
!418 = !DILocalVariable(name: "keysym", arg: 2, scope: !412, file: !243, line: 1593, type: !193)
!419 = !DILocation(line: 1593, column: 42, scope: !412)
!420 = !DILocalVariable(name: "modifierpos", scope: !412, file: !243, line: 1595, type: !45)
!421 = !DILocation(line: 1595, column: 6, scope: !412)
!422 = !DILocalVariable(name: "key", scope: !412, file: !243, line: 1595, type: !45)
!423 = !DILocation(line: 1595, column: 19, scope: !412)
!424 = !DILocalVariable(name: "keysymMask", scope: !412, file: !243, line: 1595, type: !45)
!425 = !DILocation(line: 1595, column: 24, scope: !412)
!426 = !DILocalVariable(name: "offset", scope: !412, file: !243, line: 1596, type: !45)
!427 = !DILocation(line: 1596, column: 6, scope: !412)
!428 = !DILocalVariable(name: "keycode", scope: !412, file: !243, line: 1598, type: !300)
!429 = !DILocation(line: 1598, column: 10, scope: !412)
!430 = !DILocation(line: 1598, column: 37, scope: !412)
!431 = !DILocation(line: 1598, column: 48, scope: !412)
!432 = !DILocation(line: 1598, column: 20, scope: !412)
!433 = !DILocation(line: 1600, column: 6, scope: !434)
!434 = distinct !DILexicalBlock(scope: !412, file: !243, line: 1600, column: 6)
!435 = !DILocation(line: 1600, column: 14, scope: !434)
!436 = !DILocation(line: 1600, column: 6, scope: !412)
!437 = !DILocation(line: 1601, column: 3, scope: !434)
!438 = !DILocation(line: 1603, column: 19, scope: !439)
!439 = distinct !DILexicalBlock(scope: !412, file: !243, line: 1603, column: 2)
!440 = !DILocation(line: 1603, column: 7, scope: !439)
!441 = !DILocation(line: 1603, column: 24, scope: !442)
!442 = !DILexicalBlockFile(scope: !443, file: !243, discriminator: 1)
!443 = distinct !DILexicalBlock(scope: !439, file: !243, line: 1603, column: 2)
!444 = !DILocation(line: 1603, column: 36, scope: !442)
!445 = !DILocation(line: 1603, column: 2, scope: !442)
!446 = !DILocation(line: 1605, column: 12, scope: !447)
!447 = distinct !DILexicalBlock(scope: !443, file: !243, line: 1604, column: 2)
!448 = !DILocation(line: 1605, column: 23, scope: !447)
!449 = !DILocation(line: 1605, column: 39, scope: !447)
!450 = !DILocation(line: 1605, column: 37, scope: !447)
!451 = !DILocation(line: 1605, column: 10, scope: !447)
!452 = !DILocation(line: 1607, column: 12, scope: !453)
!453 = distinct !DILexicalBlock(scope: !447, file: !243, line: 1607, column: 3)
!454 = !DILocation(line: 1607, column: 8, scope: !453)
!455 = !DILocation(line: 1607, column: 17, scope: !456)
!456 = !DILexicalBlockFile(scope: !457, file: !243, discriminator: 1)
!457 = distinct !DILexicalBlock(scope: !453, file: !243, line: 1607, column: 3)
!458 = !DILocation(line: 1607, column: 23, scope: !456)
!459 = !DILocation(line: 1607, column: 34, scope: !456)
!460 = !DILocation(line: 1607, column: 21, scope: !456)
!461 = !DILocation(line: 1607, column: 3, scope: !456)
!462 = !DILocation(line: 1609, column: 31, scope: !463)
!463 = distinct !DILexicalBlock(scope: !464, file: !243, line: 1609, column: 8)
!464 = distinct !DILexicalBlock(scope: !457, file: !243, line: 1608, column: 3)
!465 = !DILocation(line: 1609, column: 40, scope: !463)
!466 = !DILocation(line: 1609, column: 38, scope: !463)
!467 = !DILocation(line: 1609, column: 8, scope: !463)
!468 = !DILocation(line: 1609, column: 19, scope: !463)
!469 = !DILocation(line: 1609, column: 48, scope: !463)
!470 = !DILocation(line: 1609, column: 45, scope: !463)
!471 = !DILocation(line: 1609, column: 8, scope: !464)
!472 = !DILocation(line: 1610, column: 24, scope: !463)
!473 = !DILocation(line: 1610, column: 21, scope: !463)
!474 = !DILocation(line: 1610, column: 16, scope: !463)
!475 = !DILocation(line: 1610, column: 5, scope: !463)
!476 = !DILocation(line: 1611, column: 3, scope: !464)
!477 = !DILocation(line: 1607, column: 52, scope: !478)
!478 = !DILexicalBlockFile(scope: !457, file: !243, discriminator: 2)
!479 = !DILocation(line: 1607, column: 3, scope: !478)
!480 = distinct !{!480, !481}
!481 = !DILocation(line: 1607, column: 3, scope: !447)
!482 = !DILocation(line: 1612, column: 2, scope: !447)
!483 = !DILocation(line: 1603, column: 52, scope: !484)
!484 = !DILexicalBlockFile(scope: !443, file: !243, discriminator: 2)
!485 = !DILocation(line: 1603, column: 2, scope: !484)
!486 = distinct !{!486, !487}
!487 = !DILocation(line: 1603, column: 2, scope: !412)
!488 = !DILocation(line: 1614, column: 10, scope: !412)
!489 = !DILocation(line: 1614, column: 18, scope: !412)
!490 = !DILocation(line: 1614, column: 16, scope: !412)
!491 = !DILocation(line: 1614, column: 9, scope: !412)
!492 = !DILocation(line: 1614, column: 2, scope: !412)
!493 = !DILocation(line: 1615, column: 1, scope: !412)
!494 = distinct !DISubprogram(name: "sw_window_exists", scope: !243, file: !243, line: 1842, type: !495, isLocal: false, isDefinition: true, scopeLine: 1843, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !256)
!495 = !DISubroutineType(types: !496)
!496 = !{!44, !81}
!497 = !DILocalVariable(name: "id", arg: 1, scope: !494, file: !243, line: 1842, type: !81)
!498 = !DILocation(line: 1842, column: 32, scope: !494)
!499 = !DILocalVariable(name: "sw", scope: !494, file: !243, line: 1844, type: !360)
!500 = !DILocation(line: 1844, column: 19, scope: !494)
!501 = !DILocalVariable(name: "name", scope: !494, file: !243, line: 1845, type: !68)
!502 = !DILocation(line: 1845, column: 8, scope: !494)
!503 = !DILocalVariable(name: "sts", scope: !494, file: !243, line: 1846, type: !45)
!504 = !DILocation(line: 1846, column: 8, scope: !494)
!505 = !DILocation(line: 1848, column: 27, scope: !494)
!506 = !DILocation(line: 1848, column: 7, scope: !494)
!507 = !DILocation(line: 1848, column: 5, scope: !494)
!508 = !DILocation(line: 1849, column: 7, scope: !509)
!509 = distinct !DILexicalBlock(scope: !494, file: !243, line: 1849, column: 6)
!510 = !DILocation(line: 1849, column: 6, scope: !494)
!511 = !DILocation(line: 1850, column: 3, scope: !509)
!512 = !DILocation(line: 1852, column: 19, scope: !494)
!513 = !DILocation(line: 1853, column: 19, scope: !494)
!514 = !DILocation(line: 1853, column: 30, scope: !494)
!515 = !DILocation(line: 1853, column: 34, scope: !494)
!516 = !DILocation(line: 1853, column: 8, scope: !494)
!517 = !DILocation(line: 1853, column: 6, scope: !494)
!518 = !DILocation(line: 1854, column: 19, scope: !494)
!519 = !DILocation(line: 1855, column: 6, scope: !520)
!520 = distinct !DILexicalBlock(scope: !494, file: !243, line: 1855, column: 6)
!521 = !DILocation(line: 1855, column: 6, scope: !494)
!522 = !DILocation(line: 1857, column: 9, scope: !523)
!523 = distinct !DILexicalBlock(scope: !520, file: !243, line: 1856, column: 2)
!524 = !DILocation(line: 1857, column: 3, scope: !523)
!525 = !DILocation(line: 1858, column: 2, scope: !523)
!526 = !DILocation(line: 1860, column: 9, scope: !494)
!527 = !DILocation(line: 1860, column: 2, scope: !494)
!528 = !DILocation(line: 1861, column: 1, scope: !494)
!529 = distinct !DISubprogram(name: "sw_get_window_by_id", scope: !243, file: !243, line: 324, type: !530, isLocal: true, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !256)
!530 = !DISubroutineType(types: !531)
!531 = !{!360, !81}
!532 = !DILocalVariable(name: "id", arg: 1, scope: !529, file: !243, line: 324, type: !81)
!533 = !DILocation(line: 324, column: 35, scope: !529)
!534 = !DILocalVariable(name: "sw", scope: !529, file: !243, line: 326, type: !360)
!535 = !DILocation(line: 326, column: 19, scope: !529)
!536 = !DILocation(line: 327, column: 12, scope: !537)
!537 = distinct !DILexicalBlock(scope: !529, file: !243, line: 327, column: 2)
!538 = !DILocation(line: 327, column: 10, scope: !537)
!539 = !DILocation(line: 327, column: 7, scope: !537)
!540 = !DILocation(line: 327, column: 32, scope: !541)
!541 = !DILexicalBlockFile(scope: !542, file: !243, discriminator: 1)
!542 = distinct !DILexicalBlock(scope: !537, file: !243, line: 327, column: 2)
!543 = !DILocation(line: 327, column: 2, scope: !541)
!544 = !DILocation(line: 329, column: 7, scope: !545)
!545 = distinct !DILexicalBlock(scope: !546, file: !243, line: 329, column: 7)
!546 = distinct !DILexicalBlock(scope: !542, file: !243, line: 328, column: 2)
!547 = !DILocation(line: 329, column: 11, scope: !545)
!548 = !DILocation(line: 329, column: 17, scope: !545)
!549 = !DILocation(line: 329, column: 14, scope: !545)
!550 = !DILocation(line: 329, column: 7, scope: !546)
!551 = !DILocation(line: 330, column: 11, scope: !545)
!552 = !DILocation(line: 330, column: 4, scope: !545)
!553 = !DILocation(line: 331, column: 2, scope: !546)
!554 = !DILocation(line: 327, column: 41, scope: !555)
!555 = !DILexicalBlockFile(scope: !542, file: !243, discriminator: 2)
!556 = !DILocation(line: 327, column: 45, scope: !555)
!557 = !DILocation(line: 327, column: 39, scope: !555)
!558 = !DILocation(line: 327, column: 2, scope: !555)
!559 = distinct !{!559, !560}
!560 = !DILocation(line: 327, column: 2, scope: !529)
!561 = !DILocation(line: 332, column: 2, scope: !529)
!562 = !DILocation(line: 333, column: 1, scope: !529)
!563 = distinct !DISubprogram(name: "ui_init", scope: !243, file: !243, line: 1891, type: !564, isLocal: false, isDefinition: true, scopeLine: 1892, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !256)
!564 = !DISubroutineType(types: !565)
!565 = !{!44}
!566 = !DILocalVariable(name: "screen_num", scope: !563, file: !243, line: 1893, type: !45)
!567 = !DILocation(line: 1893, column: 6, scope: !563)
!568 = !DILocation(line: 1895, column: 14, scope: !563)
!569 = !DILocation(line: 1895, column: 12, scope: !563)
!570 = !DILocation(line: 1896, column: 6, scope: !571)
!571 = distinct !DILexicalBlock(scope: !563, file: !243, line: 1896, column: 6)
!572 = !DILocation(line: 1896, column: 16, scope: !571)
!573 = !DILocation(line: 1896, column: 6, scope: !563)
!574 = !DILocation(line: 1898, column: 67, scope: !575)
!575 = distinct !DILexicalBlock(scope: !571, file: !243, line: 1897, column: 2)
!576 = !DILocation(line: 1898, column: 3, scope: !577)
!577 = !DILexicalBlockFile(scope: !575, file: !243, discriminator: 1)
!578 = !DILocation(line: 1899, column: 3, scope: !575)
!579 = !DILocalVariable(name: "endianness_test", scope: !580, file: !243, line: 1903, type: !240)
!580 = distinct !DILexicalBlock(scope: !563, file: !243, line: 1902, column: 2)
!581 = !DILocation(line: 1903, column: 10, scope: !580)
!582 = !DILocation(line: 1904, column: 27, scope: !580)
!583 = !DILocation(line: 1904, column: 16, scope: !580)
!584 = !DILocation(line: 1904, column: 15, scope: !580)
!585 = !DILocation(line: 1904, column: 13, scope: !580)
!586 = !DILocation(line: 1907, column: 24, scope: !563)
!587 = !DILocation(line: 1907, column: 22, scope: !563)
!588 = !DILocation(line: 1908, column: 17, scope: !563)
!589 = !DILocation(line: 1908, column: 20, scope: !563)
!590 = !DILocation(line: 1908, column: 43, scope: !563)
!591 = !DILocation(line: 1908, column: 15, scope: !563)
!592 = !DILocation(line: 1909, column: 14, scope: !563)
!593 = !DILocation(line: 1909, column: 17, scope: !563)
!594 = !DILocation(line: 1909, column: 13, scope: !563)
!595 = !DILocation(line: 1910, column: 14, scope: !563)
!596 = !DILocation(line: 1910, column: 17, scope: !563)
!597 = !DILocation(line: 1910, column: 13, scope: !563)
!598 = !DILocation(line: 1911, column: 12, scope: !563)
!599 = !DILocation(line: 1911, column: 14, scope: !563)
!600 = !DILocation(line: 1911, column: 15, scope: !563)
!601 = !DILocation(line: 1911, column: 11, scope: !563)
!602 = !DILocation(line: 1912, column: 11, scope: !563)
!603 = !DILocation(line: 1912, column: 14, scope: !563)
!604 = !DILocation(line: 1912, column: 10, scope: !563)
!605 = !DILocation(line: 1914, column: 21, scope: !606)
!606 = distinct !DILexicalBlock(scope: !563, file: !243, line: 1914, column: 6)
!607 = !DILocation(line: 1914, column: 7, scope: !606)
!608 = !DILocation(line: 1914, column: 6, scope: !563)
!609 = !DILocation(line: 1915, column: 3, scope: !606)
!610 = !DILocation(line: 1917, column: 6, scope: !611)
!611 = distinct !DILexicalBlock(scope: !563, file: !243, line: 1917, column: 6)
!612 = !DILocation(line: 1917, column: 6, scope: !563)
!613 = !DILocation(line: 1919, column: 3, scope: !614)
!614 = distinct !DILexicalBlock(scope: !611, file: !243, line: 1918, column: 2)
!615 = !DILocation(line: 1921, column: 2, scope: !614)
!616 = !DILocation(line: 1923, column: 6, scope: !617)
!617 = distinct !DILexicalBlock(scope: !563, file: !243, line: 1923, column: 6)
!618 = !DILocation(line: 1923, column: 23, scope: !617)
!619 = !DILocation(line: 1923, column: 21, scope: !617)
!620 = !DILocation(line: 1923, column: 6, scope: !563)
!621 = !DILocation(line: 1927, column: 10, scope: !622)
!622 = distinct !DILexicalBlock(scope: !617, file: !243, line: 1924, column: 2)
!623 = !DILocation(line: 1927, column: 26, scope: !622)
!624 = !DILocation(line: 1925, column: 3, scope: !622)
!625 = !DILocation(line: 1928, column: 2, scope: !622)
!626 = !DILocation(line: 1932, column: 9, scope: !563)
!627 = !DILocation(line: 1932, column: 25, scope: !563)
!628 = !DILocation(line: 1932, column: 34, scope: !563)
!629 = !DILocation(line: 1932, column: 41, scope: !563)
!630 = !DILocation(line: 1932, column: 55, scope: !563)
!631 = !DILocation(line: 1930, column: 2, scope: !563)
!632 = !DILocation(line: 1934, column: 7, scope: !633)
!633 = distinct !DILexicalBlock(scope: !563, file: !243, line: 1934, column: 6)
!634 = !DILocation(line: 1934, column: 6, scope: !563)
!635 = !DILocation(line: 1937, column: 20, scope: !636)
!636 = distinct !DILexicalBlock(scope: !633, file: !243, line: 1935, column: 2)
!637 = !DILocation(line: 1937, column: 30, scope: !636)
!638 = !DILocation(line: 1937, column: 33, scope: !636)
!639 = !DILocation(line: 1937, column: 60, scope: !636)
!640 = !DILocation(line: 1937, column: 4, scope: !636)
!641 = !DILocation(line: 1936, column: 13, scope: !636)
!642 = !DILocation(line: 1939, column: 7, scope: !643)
!643 = distinct !DILexicalBlock(scope: !636, file: !243, line: 1939, column: 7)
!644 = !DILocation(line: 1939, column: 15, scope: !643)
!645 = !DILocation(line: 1939, column: 7, scope: !636)
!646 = !DILocation(line: 1942, column: 11, scope: !643)
!647 = !DILocation(line: 1940, column: 4, scope: !643)
!648 = !DILocation(line: 1943, column: 2, scope: !636)
!649 = !DILocation(line: 1945, column: 8, scope: !650)
!650 = distinct !DILexicalBlock(scope: !563, file: !243, line: 1945, column: 6)
!651 = !DILocation(line: 1945, column: 24, scope: !650)
!652 = !DILocation(line: 1945, column: 27, scope: !653)
!653 = !DILexicalBlockFile(scope: !650, file: !243, discriminator: 1)
!654 = !DILocation(line: 1945, column: 30, scope: !653)
!655 = !DILocation(line: 1945, column: 54, scope: !653)
!656 = !DILocation(line: 1945, column: 6, scope: !653)
!657 = !DILocation(line: 1947, column: 3, scope: !658)
!658 = distinct !DILexicalBlock(scope: !650, file: !243, line: 1946, column: 2)
!659 = !DILocation(line: 1948, column: 18, scope: !658)
!660 = !DILocation(line: 1949, column: 2, scope: !658)
!661 = !DILocation(line: 1951, column: 34, scope: !563)
!662 = !DILocation(line: 1951, column: 14, scope: !563)
!663 = !DILocation(line: 1951, column: 12, scope: !563)
!664 = !DILocation(line: 1952, column: 2, scope: !563)
!665 = !DILocation(line: 1954, column: 2, scope: !563)
!666 = !DILocation(line: 1956, column: 6, scope: !667)
!667 = distinct !DILexicalBlock(scope: !563, file: !243, line: 1956, column: 6)
!668 = !DILocation(line: 1956, column: 6, scope: !563)
!669 = !DILocation(line: 1957, column: 18, scope: !667)
!670 = !DILocation(line: 1957, column: 10, scope: !667)
!671 = !DILocation(line: 1957, column: 8, scope: !667)
!672 = !DILocation(line: 1957, column: 3, scope: !667)
!673 = !DILocation(line: 1959, column: 2, scope: !563)
!674 = !DILocation(line: 1960, column: 2, scope: !563)
!675 = !DILocation(line: 1961, column: 6, scope: !676)
!676 = distinct !DILexicalBlock(scope: !563, file: !243, line: 1961, column: 6)
!677 = !DILocation(line: 1961, column: 6, scope: !563)
!678 = !DILocation(line: 1963, column: 3, scope: !679)
!679 = distinct !DILexicalBlock(scope: !676, file: !243, line: 1962, column: 2)
!680 = !DILocation(line: 1964, column: 2, scope: !679)
!681 = !DILocation(line: 1966, column: 2, scope: !563)
!682 = !DILocation(line: 1967, column: 1, scope: !563)
!683 = distinct !DISubprogram(name: "error_handler", scope: !243, file: !243, line: 1864, type: !312, isLocal: true, isDefinition: true, scopeLine: 1865, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !256)
!684 = !DILocalVariable(name: "dpy", arg: 1, scope: !683, file: !243, line: 1864, type: !223)
!685 = !DILocation(line: 1864, column: 25, scope: !683)
!686 = !DILocalVariable(name: "eev", arg: 2, scope: !683, file: !243, line: 1864, type: !314)
!687 = !DILocation(line: 1864, column: 44, scope: !683)
!688 = !DILocation(line: 1866, column: 6, scope: !689)
!689 = distinct !DILexicalBlock(scope: !683, file: !243, line: 1866, column: 6)
!690 = !DILocation(line: 1866, column: 6, scope: !683)
!691 = !DILocation(line: 1867, column: 3, scope: !689)
!692 = !DILocation(line: 1869, column: 9, scope: !683)
!693 = !DILocation(line: 1869, column: 29, scope: !683)
!694 = !DILocation(line: 1869, column: 34, scope: !683)
!695 = !DILocation(line: 1869, column: 2, scope: !683)
!696 = !DILocation(line: 1870, column: 1, scope: !683)
!697 = distinct !DISubprogram(name: "select_visual", scope: !243, file: !243, line: 1641, type: !698, isLocal: true, isDefinition: true, scopeLine: 1642, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !256)
!698 = !DISubroutineType(types: !699)
!699 = !{!44, !45}
!700 = !DILocalVariable(name: "screen_num", arg: 1, scope: !697, file: !243, line: 1641, type: !45)
!701 = !DILocation(line: 1641, column: 19, scope: !697)
!702 = !DILocalVariable(name: "pfm", scope: !697, file: !243, line: 1643, type: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "XPixmapFormatValues", file: !50, line: 175, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !50, line: 171, size: 96, align: 32, elements: !706)
!706 = !{!707, !708, !709}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !705, file: !50, line: 172, baseType: !45, size: 32, align: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_pixel", scope: !705, file: !50, line: 173, baseType: !45, size: 32, align: 32, offset: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "scanline_pad", scope: !705, file: !50, line: 174, baseType: !45, size: 32, align: 32, offset: 64)
!710 = !DILocation(line: 1643, column: 23, scope: !697)
!711 = !DILocalVariable(name: "pixmap_formats_count", scope: !697, file: !243, line: 1644, type: !45)
!712 = !DILocation(line: 1644, column: 6, scope: !697)
!713 = !DILocalVariable(name: "visuals_count", scope: !697, file: !243, line: 1644, type: !45)
!714 = !DILocation(line: 1644, column: 28, scope: !697)
!715 = !DILocalVariable(name: "vmatches", scope: !697, file: !243, line: 1645, type: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64, align: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "XVisualInfo", file: !718, line: 302, baseType: !719)
!718 = !DIFile(filename: "/usr/include/X11/Xutil.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !718, line: 287, size: 512, align: 64, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728, !729, !730}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "visual", scope: !719, file: !718, line: 288, baseType: !150, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "visualid", scope: !719, file: !718, line: 289, baseType: !156, size: 64, align: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !719, file: !718, line: 290, baseType: !45, size: 32, align: 32, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !719, file: !718, line: 291, baseType: !45, size: 32, align: 32, offset: 160)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !719, file: !718, line: 295, baseType: !45, size: 32, align: 32, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "red_mask", scope: !719, file: !718, line: 297, baseType: !81, size: 64, align: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "green_mask", scope: !719, file: !718, line: 298, baseType: !81, size: 64, align: 64, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "blue_mask", scope: !719, file: !718, line: 299, baseType: !81, size: 64, align: 64, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "colormap_size", scope: !719, file: !718, line: 300, baseType: !45, size: 32, align: 32, offset: 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_rgb", scope: !719, file: !718, line: 301, baseType: !45, size: 32, align: 32, offset: 480)
!731 = !DILocation(line: 1645, column: 15, scope: !697)
!732 = !DILocalVariable(name: "template", scope: !697, file: !243, line: 1646, type: !717)
!733 = !DILocation(line: 1646, column: 14, scope: !697)
!734 = !DILocalVariable(name: "i", scope: !697, file: !243, line: 1647, type: !45)
!735 = !DILocation(line: 1647, column: 6, scope: !697)
!736 = !DILocalVariable(name: "red_weight", scope: !697, file: !243, line: 1648, type: !117)
!737 = !DILocation(line: 1648, column: 11, scope: !697)
!738 = !DILocalVariable(name: "blue_weight", scope: !697, file: !243, line: 1648, type: !117)
!739 = !DILocation(line: 1648, column: 23, scope: !697)
!740 = !DILocalVariable(name: "green_weight", scope: !697, file: !243, line: 1648, type: !117)
!741 = !DILocation(line: 1648, column: 36, scope: !697)
!742 = !DILocation(line: 1650, column: 42, scope: !697)
!743 = !DILocation(line: 1650, column: 27, scope: !697)
!744 = !DILocation(line: 1650, column: 13, scope: !697)
!745 = !DILocation(line: 1652, column: 6, scope: !746)
!746 = distinct !DILexicalBlock(scope: !697, file: !243, line: 1652, column: 6)
!747 = !DILocation(line: 1652, column: 21, scope: !746)
!748 = !DILocation(line: 1652, column: 6, scope: !697)
!749 = !DILocation(line: 1654, column: 19, scope: !750)
!750 = distinct !DILexicalBlock(scope: !746, file: !243, line: 1653, column: 2)
!751 = !DILocation(line: 1654, column: 22, scope: !750)
!752 = !DILocation(line: 1654, column: 41, scope: !750)
!753 = !DILocation(line: 1654, column: 18, scope: !750)
!754 = !DILocation(line: 1655, column: 2, scope: !750)
!755 = !DILocation(line: 1657, column: 27, scope: !697)
!756 = !DILocation(line: 1657, column: 8, scope: !697)
!757 = !DILocation(line: 1657, column: 6, scope: !697)
!758 = !DILocation(line: 1658, column: 6, scope: !759)
!759 = distinct !DILexicalBlock(scope: !697, file: !243, line: 1658, column: 6)
!760 = !DILocation(line: 1658, column: 10, scope: !759)
!761 = !DILocation(line: 1658, column: 6, scope: !697)
!762 = !DILocation(line: 1660, column: 3, scope: !763)
!763 = distinct !DILexicalBlock(scope: !759, file: !243, line: 1659, column: 2)
!764 = !DILocation(line: 1661, column: 17, scope: !763)
!765 = !DILocation(line: 1661, column: 3, scope: !763)
!766 = !DILocation(line: 1662, column: 3, scope: !763)
!767 = !DILocation(line: 1666, column: 11, scope: !697)
!768 = !DILocation(line: 1666, column: 17, scope: !697)
!769 = !DILocation(line: 1667, column: 20, scope: !697)
!770 = !DILocation(line: 1667, column: 11, scope: !697)
!771 = !DILocation(line: 1667, column: 18, scope: !697)
!772 = !DILocation(line: 1669, column: 18, scope: !697)
!773 = !DILocation(line: 1669, column: 3, scope: !697)
!774 = !DILocation(line: 1668, column: 11, scope: !697)
!775 = !DILocation(line: 1671, column: 11, scope: !697)
!776 = !DILocation(line: 1672, column: 23, scope: !697)
!777 = !DILocation(line: 1673, column: 20, scope: !697)
!778 = !DILocation(line: 1674, column: 6, scope: !779)
!779 = distinct !DILexicalBlock(scope: !697, file: !243, line: 1674, column: 6)
!780 = !DILocation(line: 1674, column: 15, scope: !779)
!781 = !DILocation(line: 1674, column: 6, scope: !697)
!782 = !DILocation(line: 1676, column: 10, scope: !783)
!783 = distinct !DILexicalBlock(scope: !784, file: !243, line: 1676, column: 3)
!784 = distinct !DILexicalBlock(scope: !779, file: !243, line: 1675, column: 2)
!785 = !DILocation(line: 1676, column: 8, scope: !783)
!786 = !DILocation(line: 1676, column: 15, scope: !787)
!787 = !DILexicalBlockFile(scope: !788, file: !243, discriminator: 1)
!788 = distinct !DILexicalBlock(scope: !783, file: !243, line: 1676, column: 3)
!789 = !DILocation(line: 1676, column: 19, scope: !787)
!790 = !DILocation(line: 1676, column: 17, scope: !787)
!791 = !DILocation(line: 1676, column: 3, scope: !787)
!792 = !DILocalVariable(name: "visual_info", scope: !793, file: !243, line: 1678, type: !716)
!793 = distinct !DILexicalBlock(scope: !788, file: !243, line: 1677, column: 3)
!794 = !DILocation(line: 1678, column: 17, scope: !793)
!795 = !DILocation(line: 1678, column: 41, scope: !793)
!796 = !DILocation(line: 1678, column: 32, scope: !793)
!797 = !DILocalVariable(name: "can_translate_to_bpp", scope: !793, file: !243, line: 1679, type: !44)
!798 = !DILocation(line: 1679, column: 12, scope: !793)
!799 = !DILocalVariable(name: "j", scope: !793, file: !243, line: 1680, type: !45)
!800 = !DILocation(line: 1680, column: 8, scope: !793)
!801 = !DILocation(line: 1684, column: 9, scope: !802)
!802 = distinct !DILexicalBlock(scope: !793, file: !243, line: 1684, column: 8)
!803 = !DILocation(line: 1684, column: 22, scope: !802)
!804 = !DILocation(line: 1684, column: 28, scope: !805)
!805 = !DILexicalBlockFile(scope: !802, file: !243, discriminator: 1)
!806 = !DILocation(line: 1684, column: 41, scope: !805)
!807 = !DILocation(line: 1684, column: 47, scope: !805)
!808 = !DILocation(line: 1684, column: 54, scope: !805)
!809 = !DILocation(line: 1686, column: 14, scope: !802)
!810 = !DILocation(line: 1686, column: 27, scope: !802)
!811 = !DILocation(line: 1686, column: 36, scope: !802)
!812 = !DILocation(line: 1686, column: 47, scope: !802)
!813 = !DILocation(line: 1687, column: 14, scope: !802)
!814 = !DILocation(line: 1687, column: 27, scope: !802)
!815 = !DILocation(line: 1687, column: 38, scope: !802)
!816 = !DILocation(line: 1687, column: 48, scope: !802)
!817 = !DILocation(line: 1688, column: 14, scope: !802)
!818 = !DILocation(line: 1688, column: 27, scope: !802)
!819 = !DILocation(line: 1688, column: 37, scope: !802)
!820 = !DILocation(line: 1688, column: 47, scope: !802)
!821 = !DILocation(line: 1689, column: 14, scope: !802)
!822 = !DILocation(line: 1689, column: 27, scope: !802)
!823 = !DILocation(line: 1689, column: 33, scope: !802)
!824 = !DILocation(line: 1689, column: 40, scope: !802)
!825 = !DILocation(line: 1691, column: 14, scope: !802)
!826 = !DILocation(line: 1691, column: 27, scope: !802)
!827 = !DILocation(line: 1691, column: 36, scope: !802)
!828 = !DILocation(line: 1691, column: 47, scope: !802)
!829 = !DILocation(line: 1692, column: 14, scope: !802)
!830 = !DILocation(line: 1692, column: 27, scope: !802)
!831 = !DILocation(line: 1692, column: 38, scope: !802)
!832 = !DILocation(line: 1692, column: 48, scope: !802)
!833 = !DILocation(line: 1693, column: 14, scope: !802)
!834 = !DILocation(line: 1693, column: 27, scope: !802)
!835 = !DILocation(line: 1693, column: 37, scope: !802)
!836 = !DILocation(line: 1693, column: 47, scope: !802)
!837 = !DILocation(line: 1694, column: 14, scope: !802)
!838 = !DILocation(line: 1694, column: 27, scope: !802)
!839 = !DILocation(line: 1694, column: 33, scope: !802)
!840 = !DILocation(line: 1694, column: 40, scope: !802)
!841 = !DILocation(line: 1696, column: 14, scope: !802)
!842 = !DILocation(line: 1696, column: 27, scope: !802)
!843 = !DILocation(line: 1696, column: 36, scope: !802)
!844 = !DILocation(line: 1696, column: 49, scope: !802)
!845 = !DILocation(line: 1697, column: 14, scope: !802)
!846 = !DILocation(line: 1697, column: 27, scope: !802)
!847 = !DILocation(line: 1697, column: 38, scope: !802)
!848 = !DILocation(line: 1697, column: 49, scope: !802)
!849 = !DILocation(line: 1698, column: 14, scope: !802)
!850 = !DILocation(line: 1698, column: 27, scope: !802)
!851 = !DILocation(line: 1698, column: 37, scope: !802)
!852 = !DILocation(line: 1684, column: 8, scope: !853)
!853 = !DILexicalBlockFile(scope: !793, file: !243, discriminator: 2)
!854 = !DILocation(line: 1700, column: 16, scope: !855)
!855 = distinct !DILexicalBlock(scope: !802, file: !243, line: 1699, column: 4)
!856 = !DILocation(line: 1700, column: 29, scope: !855)
!857 = !DILocation(line: 1700, column: 14, scope: !855)
!858 = !DILocation(line: 1701, column: 15, scope: !855)
!859 = !DILocation(line: 1701, column: 28, scope: !855)
!860 = !DILocation(line: 1701, column: 13, scope: !855)
!861 = !DILocation(line: 1702, column: 26, scope: !855)
!862 = !DILocation(line: 1702, column: 25, scope: !855)
!863 = !DILocation(line: 1702, column: 23, scope: !855)
!864 = !DILocation(line: 1703, column: 29, scope: !855)
!865 = !DILocation(line: 1703, column: 42, scope: !855)
!866 = !DILocation(line: 1703, column: 51, scope: !855)
!867 = !DILocation(line: 1703, column: 48, scope: !855)
!868 = !DILocation(line: 1703, column: 26, scope: !855)
!869 = !DILocation(line: 1704, column: 9, scope: !870)
!870 = distinct !DILexicalBlock(scope: !855, file: !243, line: 1704, column: 9)
!871 = !DILocation(line: 1704, column: 9, scope: !855)
!872 = !DILocation(line: 1706, column: 6, scope: !870)
!873 = !DILocation(line: 1707, column: 4, scope: !855)
!874 = !DILocation(line: 1710, column: 23, scope: !875)
!875 = distinct !DILexicalBlock(scope: !802, file: !243, line: 1709, column: 4)
!876 = !DILocation(line: 1713, column: 8, scope: !877)
!877 = distinct !DILexicalBlock(scope: !793, file: !243, line: 1713, column: 8)
!878 = !DILocation(line: 1713, column: 21, scope: !877)
!879 = !DILocation(line: 1713, column: 27, scope: !877)
!880 = !DILocation(line: 1713, column: 8, scope: !793)
!881 = !DILocation(line: 1719, column: 5, scope: !882)
!882 = distinct !DILexicalBlock(scope: !877, file: !243, line: 1714, column: 4)
!883 = !DILocation(line: 1724, column: 11, scope: !884)
!884 = distinct !DILexicalBlock(scope: !793, file: !243, line: 1724, column: 4)
!885 = !DILocation(line: 1724, column: 9, scope: !884)
!886 = !DILocation(line: 1724, column: 16, scope: !887)
!887 = !DILexicalBlockFile(scope: !888, file: !243, discriminator: 1)
!888 = distinct !DILexicalBlock(scope: !884, file: !243, line: 1724, column: 4)
!889 = !DILocation(line: 1724, column: 20, scope: !887)
!890 = !DILocation(line: 1724, column: 18, scope: !887)
!891 = !DILocation(line: 1724, column: 4, scope: !887)
!892 = !DILocation(line: 1726, column: 13, scope: !893)
!893 = distinct !DILexicalBlock(scope: !894, file: !243, line: 1726, column: 9)
!894 = distinct !DILexicalBlock(scope: !888, file: !243, line: 1725, column: 4)
!895 = !DILocation(line: 1726, column: 9, scope: !893)
!896 = !DILocation(line: 1726, column: 16, scope: !893)
!897 = !DILocation(line: 1726, column: 25, scope: !893)
!898 = !DILocation(line: 1726, column: 38, scope: !893)
!899 = !DILocation(line: 1726, column: 22, scope: !893)
!900 = !DILocation(line: 1726, column: 9, scope: !894)
!901 = !DILocation(line: 1728, column: 15, scope: !902)
!902 = distinct !DILexicalBlock(scope: !903, file: !243, line: 1728, column: 10)
!903 = distinct !DILexicalBlock(scope: !893, file: !243, line: 1727, column: 5)
!904 = !DILocation(line: 1728, column: 11, scope: !902)
!905 = !DILocation(line: 1728, column: 18, scope: !902)
!906 = !DILocation(line: 1728, column: 33, scope: !902)
!907 = !DILocation(line: 1728, column: 40, scope: !902)
!908 = !DILocation(line: 1729, column: 15, scope: !902)
!909 = !DILocation(line: 1729, column: 11, scope: !902)
!910 = !DILocation(line: 1729, column: 18, scope: !902)
!911 = !DILocation(line: 1729, column: 33, scope: !902)
!912 = !DILocation(line: 1729, column: 40, scope: !902)
!913 = !DILocation(line: 1730, column: 15, scope: !902)
!914 = !DILocation(line: 1730, column: 11, scope: !902)
!915 = !DILocation(line: 1730, column: 18, scope: !902)
!916 = !DILocation(line: 1730, column: 33, scope: !902)
!917 = !DILocation(line: 1728, column: 10, scope: !918)
!918 = !DILexicalBlockFile(scope: !903, file: !243, discriminator: 1)
!919 = !DILocation(line: 1732, column: 28, scope: !920)
!920 = distinct !DILexicalBlock(scope: !902, file: !243, line: 1731, column: 6)
!921 = !DILocation(line: 1733, column: 6, scope: !920)
!922 = !DILocation(line: 1734, column: 6, scope: !903)
!923 = !DILocation(line: 1736, column: 4, scope: !894)
!924 = !DILocation(line: 1724, column: 42, scope: !925)
!925 = !DILexicalBlockFile(scope: !888, file: !243, discriminator: 2)
!926 = !DILocation(line: 1724, column: 4, scope: !925)
!927 = distinct !{!927, !928}
!928 = !DILocation(line: 1724, column: 4, scope: !793)
!929 = !DILocation(line: 1741, column: 8, scope: !930)
!930 = distinct !DILexicalBlock(scope: !793, file: !243, line: 1741, column: 8)
!931 = !DILocation(line: 1741, column: 8, scope: !793)
!932 = !DILocalVariable(name: "vis_red_weight", scope: !933, file: !243, line: 1743, type: !117)
!933 = distinct !DILexicalBlock(scope: !930, file: !243, line: 1742, column: 4)
!934 = !DILocation(line: 1743, column: 14, scope: !933)
!935 = !DILocation(line: 1744, column: 28, scope: !933)
!936 = !DILocation(line: 1744, column: 41, scope: !933)
!937 = !DILocation(line: 1744, column: 6, scope: !933)
!938 = !DILocalVariable(name: "vis_green_weight", scope: !933, file: !243, line: 1745, type: !117)
!939 = !DILocation(line: 1745, column: 14, scope: !933)
!940 = !DILocation(line: 1746, column: 28, scope: !933)
!941 = !DILocation(line: 1746, column: 41, scope: !933)
!942 = !DILocation(line: 1746, column: 6, scope: !933)
!943 = !DILocalVariable(name: "vis_blue_weight", scope: !933, file: !243, line: 1747, type: !117)
!944 = !DILocation(line: 1747, column: 14, scope: !933)
!945 = !DILocation(line: 1748, column: 28, scope: !933)
!946 = !DILocation(line: 1748, column: 41, scope: !933)
!947 = !DILocation(line: 1748, column: 6, scope: !933)
!948 = !DILocation(line: 1749, column: 10, scope: !949)
!949 = distinct !DILexicalBlock(scope: !933, file: !243, line: 1749, column: 9)
!950 = !DILocation(line: 1749, column: 28, scope: !949)
!951 = !DILocation(line: 1749, column: 25, scope: !949)
!952 = !DILocation(line: 1750, column: 9, scope: !949)
!953 = !DILocation(line: 1750, column: 13, scope: !954)
!954 = !DILexicalBlockFile(scope: !949, file: !243, discriminator: 1)
!955 = !DILocation(line: 1750, column: 33, scope: !954)
!956 = !DILocation(line: 1750, column: 30, scope: !954)
!957 = !DILocation(line: 1751, column: 9, scope: !949)
!958 = !DILocation(line: 1751, column: 13, scope: !954)
!959 = !DILocation(line: 1751, column: 32, scope: !954)
!960 = !DILocation(line: 1751, column: 29, scope: !954)
!961 = !DILocation(line: 1749, column: 9, scope: !962)
!962 = !DILexicalBlockFile(scope: !933, file: !243, discriminator: 1)
!963 = !DILocation(line: 1753, column: 19, scope: !964)
!964 = distinct !DILexicalBlock(scope: !949, file: !243, line: 1752, column: 5)
!965 = !DILocation(line: 1753, column: 17, scope: !964)
!966 = !DILocation(line: 1754, column: 21, scope: !964)
!967 = !DILocation(line: 1754, column: 19, scope: !964)
!968 = !DILocation(line: 1755, column: 20, scope: !964)
!969 = !DILocation(line: 1755, column: 18, scope: !964)
!970 = !DILocation(line: 1756, column: 17, scope: !964)
!971 = !DILocation(line: 1756, column: 30, scope: !964)
!972 = !DILocation(line: 1756, column: 15, scope: !964)
!973 = !DILocation(line: 1757, column: 16, scope: !964)
!974 = !DILocation(line: 1757, column: 29, scope: !964)
!975 = !DILocation(line: 1757, column: 14, scope: !964)
!976 = !DILocation(line: 1758, column: 5, scope: !964)
!977 = !DILocation(line: 1759, column: 4, scope: !933)
!978 = !DILocation(line: 1760, column: 3, scope: !793)
!979 = !DILocation(line: 1676, column: 34, scope: !980)
!980 = !DILexicalBlockFile(scope: !788, file: !243, discriminator: 2)
!981 = !DILocation(line: 1676, column: 3, scope: !980)
!982 = distinct !{!982, !983}
!983 = !DILocation(line: 1676, column: 3, scope: !784)
!984 = !DILocation(line: 1761, column: 9, scope: !784)
!985 = !DILocation(line: 1761, column: 3, scope: !784)
!986 = !DILocation(line: 1762, column: 2, scope: !784)
!987 = !DILocation(line: 1764, column: 6, scope: !988)
!988 = distinct !DILexicalBlock(scope: !697, file: !243, line: 1764, column: 6)
!989 = !DILocation(line: 1764, column: 15, scope: !988)
!990 = !DILocation(line: 1764, column: 6, scope: !697)
!991 = !DILocation(line: 1766, column: 15, scope: !992)
!992 = distinct !DILexicalBlock(scope: !988, file: !243, line: 1765, column: 2)
!993 = !DILocation(line: 1767, column: 20, scope: !992)
!994 = !DILocation(line: 1767, column: 30, scope: !992)
!995 = !DILocation(line: 1767, column: 3, scope: !992)
!996 = !DILocation(line: 1768, column: 20, scope: !992)
!997 = !DILocation(line: 1768, column: 30, scope: !992)
!998 = !DILocation(line: 1768, column: 3, scope: !992)
!999 = !DILocation(line: 1769, column: 20, scope: !992)
!1000 = !DILocation(line: 1769, column: 30, scope: !992)
!1001 = !DILocation(line: 1769, column: 3, scope: !992)
!1002 = !DILocation(line: 1770, column: 2, scope: !992)
!1003 = !DILocation(line: 1773, column: 12, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !988, file: !243, line: 1772, column: 2)
!1005 = !DILocation(line: 1773, column: 18, scope: !1004)
!1006 = !DILocation(line: 1774, column: 12, scope: !1004)
!1007 = !DILocation(line: 1774, column: 18, scope: !1004)
!1008 = !DILocation(line: 1775, column: 12, scope: !1004)
!1009 = !DILocation(line: 1775, column: 26, scope: !1004)
!1010 = !DILocation(line: 1777, column: 19, scope: !1004)
!1011 = !DILocation(line: 1777, column: 4, scope: !1004)
!1012 = !DILocation(line: 1776, column: 12, scope: !1004)
!1013 = !DILocation(line: 1780, column: 7, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1004, file: !243, line: 1780, column: 7)
!1015 = !DILocation(line: 1780, column: 16, scope: !1014)
!1016 = !DILocation(line: 1780, column: 7, scope: !1004)
!1017 = !DILocation(line: 1782, column: 4, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1014, file: !243, line: 1781, column: 3)
!1019 = !DILocation(line: 1784, column: 18, scope: !1018)
!1020 = !DILocation(line: 1784, column: 4, scope: !1018)
!1021 = !DILocation(line: 1785, column: 10, scope: !1018)
!1022 = !DILocation(line: 1785, column: 4, scope: !1018)
!1023 = !DILocation(line: 1786, column: 4, scope: !1018)
!1024 = !DILocation(line: 1790, column: 15, scope: !1004)
!1025 = !DILocation(line: 1791, column: 14, scope: !1004)
!1026 = !DILocation(line: 1791, column: 26, scope: !1004)
!1027 = !DILocation(line: 1791, column: 12, scope: !1004)
!1028 = !DILocation(line: 1792, column: 13, scope: !1004)
!1029 = !DILocation(line: 1792, column: 25, scope: !1004)
!1030 = !DILocation(line: 1792, column: 11, scope: !1004)
!1031 = !DILocation(line: 1795, column: 8, scope: !697)
!1032 = !DILocation(line: 1796, column: 9, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !697, file: !243, line: 1796, column: 2)
!1034 = !DILocation(line: 1796, column: 7, scope: !1033)
!1035 = !DILocation(line: 1796, column: 14, scope: !1036)
!1036 = !DILexicalBlockFile(scope: !1037, file: !243, discriminator: 1)
!1037 = distinct !DILexicalBlock(scope: !1033, file: !243, line: 1796, column: 2)
!1038 = !DILocation(line: 1796, column: 18, scope: !1036)
!1039 = !DILocation(line: 1796, column: 16, scope: !1036)
!1040 = !DILocation(line: 1796, column: 2, scope: !1036)
!1041 = !DILocalVariable(name: "pf", scope: !1042, file: !243, line: 1798, type: !703)
!1042 = distinct !DILexicalBlock(scope: !1037, file: !243, line: 1797, column: 2)
!1043 = !DILocation(line: 1798, column: 24, scope: !1042)
!1044 = !DILocation(line: 1798, column: 34, scope: !1042)
!1045 = !DILocation(line: 1798, column: 30, scope: !1042)
!1046 = !DILocation(line: 1799, column: 7, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1042, file: !243, line: 1799, column: 7)
!1048 = !DILocation(line: 1799, column: 11, scope: !1047)
!1049 = !DILocation(line: 1799, column: 20, scope: !1047)
!1050 = !DILocation(line: 1799, column: 17, scope: !1047)
!1051 = !DILocation(line: 1799, column: 7, scope: !1042)
!1052 = !DILocation(line: 1801, column: 12, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1047, file: !243, line: 1800, column: 3)
!1054 = !DILocation(line: 1801, column: 16, scope: !1053)
!1055 = !DILocation(line: 1801, column: 10, scope: !1053)
!1056 = !DILocation(line: 1803, column: 8, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1053, file: !243, line: 1803, column: 8)
!1058 = !DILocation(line: 1803, column: 8, scope: !1053)
!1059 = !DILocation(line: 1805, column: 13, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1057, file: !243, line: 1804, column: 4)
!1061 = !DILocation(line: 1805, column: 5, scope: !1060)
!1062 = !DILocation(line: 1809, column: 11, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !243, line: 1809, column: 11)
!1064 = distinct !DILexicalBlock(scope: !1060, file: !243, line: 1806, column: 5)
!1065 = !DILocation(line: 1809, column: 17, scope: !1063)
!1066 = !DILocation(line: 1809, column: 11, scope: !1064)
!1067 = !DILocation(line: 1810, column: 29, scope: !1063)
!1068 = !DILocation(line: 1810, column: 8, scope: !1063)
!1069 = !DILocation(line: 1811, column: 7, scope: !1064)
!1070 = !DILocation(line: 1816, column: 11, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1064, file: !243, line: 1816, column: 11)
!1072 = !DILocation(line: 1816, column: 17, scope: !1071)
!1073 = !DILocation(line: 1816, column: 11, scope: !1064)
!1074 = !DILocation(line: 1817, column: 29, scope: !1071)
!1075 = !DILocation(line: 1817, column: 8, scope: !1071)
!1076 = !DILocation(line: 1818, column: 7, scope: !1064)
!1077 = !DILocation(line: 1820, column: 28, scope: !1064)
!1078 = !DILocation(line: 1821, column: 7, scope: !1064)
!1079 = !DILocation(line: 1823, column: 4, scope: !1060)
!1080 = !DILocation(line: 1828, column: 4, scope: !1053)
!1081 = !DILocation(line: 1830, column: 2, scope: !1042)
!1082 = !DILocation(line: 1796, column: 40, scope: !1083)
!1083 = !DILexicalBlockFile(scope: !1037, file: !243, discriminator: 2)
!1084 = !DILocation(line: 1796, column: 2, scope: !1083)
!1085 = distinct !{!1085, !1086}
!1086 = !DILocation(line: 1796, column: 2, scope: !697)
!1087 = !DILocation(line: 1831, column: 8, scope: !697)
!1088 = !DILocation(line: 1831, column: 2, scope: !697)
!1089 = !DILocation(line: 1832, column: 6, scope: !697)
!1090 = !DILocation(line: 1833, column: 2, scope: !697)
!1091 = !DILocation(line: 1834, column: 1, scope: !697)
!1092 = distinct !DISubprogram(name: "xwin_refresh_pointer_map", scope: !243, file: !243, line: 1570, type: !254, isLocal: true, isDefinition: true, scopeLine: 1571, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !256)
!1093 = !DILocalVariable(name: "phys_to_log_map", scope: !1092, file: !243, line: 1572, type: !335)
!1094 = !DILocation(line: 1572, column: 16, scope: !1092)
!1095 = !DILocalVariable(name: "i", scope: !1092, file: !243, line: 1573, type: !45)
!1096 = !DILocation(line: 1573, column: 6, scope: !1092)
!1097 = !DILocalVariable(name: "pointer_buttons", scope: !1092, file: !243, line: 1574, type: !117)
!1098 = !DILocation(line: 1574, column: 15, scope: !1092)
!1099 = !DILocation(line: 1576, column: 53, scope: !1092)
!1100 = !DILocation(line: 1576, column: 64, scope: !1092)
!1101 = !DILocation(line: 1576, column: 34, scope: !1092)
!1102 = !DILocation(line: 1576, column: 18, scope: !1092)
!1103 = !DILocation(line: 1577, column: 6, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1092, file: !243, line: 1577, column: 6)
!1105 = !DILocation(line: 1577, column: 22, scope: !1104)
!1106 = !DILocation(line: 1577, column: 6, scope: !1092)
!1107 = !DILocation(line: 1578, column: 19, scope: !1104)
!1108 = !DILocation(line: 1578, column: 3, scope: !1104)
!1109 = !DILocation(line: 1582, column: 11, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1092, file: !243, line: 1582, column: 2)
!1111 = !DILocation(line: 1582, column: 27, scope: !1110)
!1112 = !DILocation(line: 1582, column: 9, scope: !1110)
!1113 = !DILocation(line: 1582, column: 7, scope: !1110)
!1114 = !DILocation(line: 1582, column: 32, scope: !1115)
!1115 = !DILexicalBlockFile(scope: !1116, file: !243, discriminator: 1)
!1116 = distinct !DILexicalBlock(scope: !1110, file: !243, line: 1582, column: 2)
!1117 = !DILocation(line: 1582, column: 34, scope: !1115)
!1118 = !DILocation(line: 1582, column: 2, scope: !1115)
!1119 = !DILocation(line: 1586, column: 23, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1121, file: !243, line: 1586, column: 7)
!1121 = distinct !DILexicalBlock(scope: !1116, file: !243, line: 1583, column: 2)
!1122 = !DILocation(line: 1586, column: 7, scope: !1120)
!1123 = !DILocation(line: 1586, column: 26, scope: !1120)
!1124 = !DILocation(line: 1586, column: 7, scope: !1121)
!1125 = !DILocation(line: 1587, column: 4, scope: !1120)
!1126 = !DILocation(line: 1588, column: 55, scope: !1121)
!1127 = !DILocation(line: 1588, column: 57, scope: !1121)
!1128 = !DILocation(line: 1588, column: 45, scope: !1121)
!1129 = !DILocation(line: 1588, column: 29, scope: !1121)
!1130 = !DILocation(line: 1588, column: 48, scope: !1121)
!1131 = !DILocation(line: 1588, column: 3, scope: !1121)
!1132 = !DILocation(line: 1588, column: 53, scope: !1121)
!1133 = !DILocation(line: 1589, column: 2, scope: !1121)
!1134 = !DILocation(line: 1582, column: 41, scope: !1135)
!1135 = !DILexicalBlockFile(scope: !1116, file: !243, discriminator: 2)
!1136 = !DILocation(line: 1582, column: 2, scope: !1135)
!1137 = distinct !{!1137, !1138}
!1138 = !DILocation(line: 1582, column: 2, scope: !1092)
!1139 = !DILocation(line: 1590, column: 1, scope: !1092)
!1140 = distinct !DISubprogram(name: "ui_get_screen_size", scope: !243, file: !243, line: 1970, type: !1141, isLocal: false, isDefinition: true, scopeLine: 1971, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !256)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{null, !192, !192}
!1143 = !DILocalVariable(name: "width", arg: 1, scope: !1140, file: !243, line: 1970, type: !192)
!1144 = !DILocation(line: 1970, column: 28, scope: !1140)
!1145 = !DILocalVariable(name: "height", arg: 2, scope: !1140, file: !243, line: 1970, type: !192)
!1146 = !DILocation(line: 1970, column: 43, scope: !1140)
!1147 = !DILocation(line: 1972, column: 11, scope: !1140)
!1148 = !DILocation(line: 1972, column: 14, scope: !1140)
!1149 = !DILocation(line: 1972, column: 3, scope: !1140)
!1150 = !DILocation(line: 1972, column: 9, scope: !1140)
!1151 = !DILocation(line: 1973, column: 12, scope: !1140)
!1152 = !DILocation(line: 1973, column: 15, scope: !1140)
!1153 = !DILocation(line: 1973, column: 3, scope: !1140)
!1154 = !DILocation(line: 1973, column: 10, scope: !1140)
!1155 = !DILocation(line: 1974, column: 1, scope: !1140)
!1156 = distinct !DISubprogram(name: "ui_get_screen_size_from_percentage", scope: !243, file: !243, line: 1977, type: !1157, isLocal: false, isDefinition: true, scopeLine: 1978, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !256)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{null, !193, !193, !192, !192}
!1159 = !DILocalVariable(name: "pw", arg: 1, scope: !1156, file: !243, line: 1977, type: !193)
!1160 = !DILocation(line: 1977, column: 43, scope: !1156)
!1161 = !DILocalVariable(name: "ph", arg: 2, scope: !1156, file: !243, line: 1977, type: !193)
!1162 = !DILocation(line: 1977, column: 54, scope: !1156)
!1163 = !DILocalVariable(name: "width", arg: 3, scope: !1156, file: !243, line: 1977, type: !192)
!1164 = !DILocation(line: 1977, column: 66, scope: !1156)
!1165 = !DILocalVariable(name: "height", arg: 4, scope: !1156, file: !243, line: 1977, type: !192)
!1166 = !DILocation(line: 1977, column: 81, scope: !1156)
!1167 = !DILocalVariable(name: "sw", scope: !1156, file: !243, line: 1979, type: !193)
!1168 = !DILocation(line: 1979, column: 9, scope: !1156)
!1169 = !DILocalVariable(name: "sh", scope: !1156, file: !243, line: 1979, type: !193)
!1170 = !DILocation(line: 1979, column: 12, scope: !1156)
!1171 = !DILocation(line: 1980, column: 2, scope: !1156)
!1172 = !DILocation(line: 1981, column: 11, scope: !1156)
!1173 = !DILocation(line: 1981, column: 16, scope: !1156)
!1174 = !DILocation(line: 1981, column: 14, scope: !1156)
!1175 = !DILocation(line: 1981, column: 19, scope: !1156)
!1176 = !DILocation(line: 1981, column: 3, scope: !1156)
!1177 = !DILocation(line: 1981, column: 9, scope: !1156)
!1178 = !DILocation(line: 1982, column: 12, scope: !1156)
!1179 = !DILocation(line: 1982, column: 17, scope: !1156)
!1180 = !DILocation(line: 1982, column: 15, scope: !1156)
!1181 = !DILocation(line: 1982, column: 20, scope: !1156)
!1182 = !DILocation(line: 1982, column: 3, scope: !1156)
!1183 = !DILocation(line: 1982, column: 10, scope: !1156)
!1184 = !DILocation(line: 1983, column: 1, scope: !1156)
!1185 = distinct !DISubprogram(name: "ui_get_workarea_size", scope: !243, file: !243, line: 1986, type: !1141, isLocal: false, isDefinition: true, scopeLine: 1987, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !256)
