; ModuleID = './[inter]printercache.o.i'
source_filename = "./[inter]printercache.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }

@.str = private unnamed_addr constant [5 x i8] c"HOME\00", align 1
@.str.1 = private unnamed_addr constant [43 x i8] c"%s/.rdesktop/rdpdr/%s/AutoPrinterCacheData\00", align 1
@.str.2 = private unnamed_addr constant [49 x i8] c"printercache_process(), unhandled packet type %d\00", align 1
@.str.3 = private unnamed_addr constant [22 x i8] c"%s/.rdesktop/rdpdr/%s\00", align 1
@.str.4 = private unnamed_addr constant [65 x i8] c"printercache_rename_blob(), printer_path=%s, new_printer_path=%s\00", align 1
@.str.5 = private unnamed_addr constant [48 x i8] c"printercache_rename_blob(), rename() failed: %s\00", align 1
@.str.6 = private unnamed_addr constant [44 x i8] c"printercache_save_blob(), open() failed: %s\00", align 1
@.str.7 = private unnamed_addr constant [45 x i8] c"printercache_save_blob(), write() failed: %s\00", align 1
@.str.8 = private unnamed_addr constant [13 x i8] c"%s/.rdesktop\00", align 1
@.str.9 = private unnamed_addr constant [41 x i8] c"printercache_mkdir(), mkdir() failed: %s\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22)
!1 = !DIFile(filename: "[inter]printercache.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !{!23, !24, !26, !30}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !28, line: 39, baseType: !29)
!28 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!29 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !28, line: 43, baseType: !32)
!32 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!33 = !{i32 2, !"Dwarf Version", i32 4}
!34 = !{i32 2, !"Debug Info Version", i32 3}
!35 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!36 = distinct !DISubprogram(name: "printercache_load_blob", scope: !37, file: !37, line: 158, type: !38, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !42)
!37 = !DIFile(filename: "printercache.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !24, !41}
!40 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!42 = !{}
!43 = !DILocalVariable(name: "printer_name", arg: 1, scope: !36, file: !37, line: 158, type: !24)
!44 = !DIExpression()
!45 = !DILocation(line: 158, column: 30, scope: !36)
!46 = !DILocalVariable(name: "data", arg: 2, scope: !36, file: !37, line: 158, type: !41)
!47 = !DILocation(line: 158, column: 53, scope: !36)
!48 = !DILocalVariable(name: "home", scope: !36, file: !37, line: 160, type: !24)
!49 = !DILocation(line: 160, column: 8, scope: !36)
!50 = !DILocalVariable(name: "path", scope: !36, file: !37, line: 160, type: !24)
!51 = !DILocation(line: 160, column: 15, scope: !36)
!52 = !DILocalVariable(name: "st", scope: !36, file: !37, line: 161, type: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !54, line: 46, size: 1152, align: 64, elements: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!55 = !{!56, !60, !62, !64, !66, !68, !70, !71, !72, !75, !77, !79, !87, !88, !89}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !53, file: !54, line: 48, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !58, line: 124, baseType: !59)
!58 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!59 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !53, file: !54, line: 53, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !58, line: 127, baseType: !59)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !53, file: !54, line: 61, baseType: !63, size: 64, align: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !58, line: 130, baseType: !59)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !53, file: !54, line: 62, baseType: !65, size: 32, align: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !58, line: 129, baseType: !32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !53, file: !54, line: 64, baseType: !67, size: 32, align: 32, offset: 224)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !58, line: 125, baseType: !32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !53, file: !54, line: 65, baseType: !69, size: 32, align: 32, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !58, line: 126, baseType: !32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !53, file: !54, line: 67, baseType: !40, size: 32, align: 32, offset: 288)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !53, file: !54, line: 69, baseType: !57, size: 64, align: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !53, file: !54, line: 74, baseType: !73, size: 64, align: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !58, line: 131, baseType: !74)
!74 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !53, file: !54, line: 78, baseType: !76, size: 64, align: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !58, line: 153, baseType: !74)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !53, file: !54, line: 80, baseType: !78, size: 64, align: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !58, line: 158, baseType: !74)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !53, file: !54, line: 91, baseType: !80, size: 128, align: 64, offset: 576)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !81, line: 120, size: 128, align: 64, elements: !82)
!81 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!82 = !{!83, !85}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !80, file: !81, line: 122, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !58, line: 139, baseType: !74)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !80, file: !81, line: 123, baseType: !86, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !58, line: 175, baseType: !74)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !53, file: !54, line: 92, baseType: !80, size: 128, align: 64, offset: 704)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !53, file: !54, line: 93, baseType: !80, size: 128, align: 64, offset: 832)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !53, file: !54, line: 106, baseType: !90, size: 192, align: 64, offset: 960)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 192, align: 64, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 3)
!93 = !DILocation(line: 161, column: 14, scope: !36)
!94 = !DILocalVariable(name: "fd", scope: !36, file: !37, line: 162, type: !40)
!95 = !DILocation(line: 162, column: 6, scope: !36)
!96 = !DILocalVariable(name: "length", scope: !36, file: !37, line: 162, type: !40)
!97 = !DILocation(line: 162, column: 10, scope: !36)
!98 = !DILocation(line: 164, column: 6, scope: !99)
!99 = distinct !DILexicalBlock(scope: !36, file: !37, line: 164, column: 6)
!100 = !DILocation(line: 164, column: 19, scope: !99)
!101 = !DILocation(line: 164, column: 6, scope: !36)
!102 = !DILocation(line: 165, column: 3, scope: !99)
!103 = !DILocation(line: 167, column: 3, scope: !36)
!104 = !DILocation(line: 167, column: 8, scope: !36)
!105 = !DILocation(line: 169, column: 9, scope: !36)
!106 = !DILocation(line: 169, column: 7, scope: !36)
!107 = !DILocation(line: 170, column: 6, scope: !108)
!108 = distinct !DILexicalBlock(scope: !36, file: !37, line: 170, column: 6)
!109 = !DILocation(line: 170, column: 11, scope: !108)
!110 = !DILocation(line: 170, column: 6, scope: !36)
!111 = !DILocation(line: 171, column: 3, scope: !108)
!112 = !DILocation(line: 173, column: 33, scope: !36)
!113 = !DILocation(line: 173, column: 26, scope: !36)
!114 = !DILocation(line: 173, column: 39, scope: !36)
!115 = !DILocation(line: 173, column: 78, scope: !36)
!116 = !DILocation(line: 173, column: 71, scope: !117)
!117 = !DILexicalBlockFile(scope: !36, file: !37, discriminator: 1)
!118 = !DILocation(line: 173, column: 69, scope: !36)
!119 = !DILocation(line: 173, column: 92, scope: !36)
!120 = !DILocation(line: 174, column: 37, scope: !36)
!121 = !DILocation(line: 173, column: 18, scope: !122)
!122 = !DILexicalBlockFile(scope: !36, file: !37, discriminator: 2)
!123 = !DILocation(line: 173, column: 7, scope: !36)
!124 = !DILocation(line: 175, column: 10, scope: !36)
!125 = !DILocation(line: 175, column: 62, scope: !36)
!126 = !DILocation(line: 175, column: 68, scope: !36)
!127 = !DILocation(line: 175, column: 2, scope: !36)
!128 = !DILocation(line: 177, column: 12, scope: !36)
!129 = !DILocation(line: 177, column: 7, scope: !36)
!130 = !DILocation(line: 177, column: 5, scope: !36)
!131 = !DILocation(line: 178, column: 6, scope: !132)
!132 = distinct !DILexicalBlock(scope: !36, file: !37, line: 178, column: 6)
!133 = !DILocation(line: 178, column: 9, scope: !132)
!134 = !DILocation(line: 178, column: 6, scope: !36)
!135 = !DILocation(line: 180, column: 9, scope: !136)
!136 = distinct !DILexicalBlock(scope: !132, file: !37, line: 179, column: 2)
!137 = !DILocation(line: 180, column: 3, scope: !136)
!138 = !DILocation(line: 181, column: 3, scope: !136)
!139 = !DILocation(line: 184, column: 12, scope: !140)
!140 = distinct !DILexicalBlock(scope: !36, file: !37, line: 184, column: 6)
!141 = !DILocation(line: 184, column: 6, scope: !140)
!142 = !DILocation(line: 184, column: 6, scope: !36)
!143 = !DILocation(line: 186, column: 9, scope: !144)
!144 = distinct !DILexicalBlock(scope: !140, file: !37, line: 185, column: 2)
!145 = !DILocation(line: 186, column: 3, scope: !144)
!146 = !DILocation(line: 187, column: 3, scope: !144)
!147 = !DILocation(line: 190, column: 31, scope: !36)
!148 = !DILocation(line: 190, column: 28, scope: !36)
!149 = !DILocation(line: 190, column: 20, scope: !36)
!150 = !DILocation(line: 190, column: 3, scope: !36)
!151 = !DILocation(line: 190, column: 8, scope: !36)
!152 = !DILocation(line: 191, column: 16, scope: !36)
!153 = !DILocation(line: 191, column: 21, scope: !36)
!154 = !DILocation(line: 191, column: 20, scope: !36)
!155 = !DILocation(line: 191, column: 30, scope: !36)
!156 = !DILocation(line: 191, column: 11, scope: !36)
!157 = !DILocation(line: 191, column: 9, scope: !36)
!158 = !DILocation(line: 192, column: 8, scope: !36)
!159 = !DILocation(line: 192, column: 2, scope: !36)
!160 = !DILocation(line: 193, column: 8, scope: !36)
!161 = !DILocation(line: 193, column: 2, scope: !36)
!162 = !DILocation(line: 194, column: 9, scope: !36)
!163 = !DILocation(line: 194, column: 2, scope: !36)
!164 = !DILocation(line: 195, column: 1, scope: !36)
!165 = distinct !DISubprogram(name: "printercache_process", scope: !37, file: !37, line: 237, type: !166, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !42)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !168}
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !169, line: 40, baseType: !170)
!169 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !169, line: 25, size: 576, align: 64, elements: !172)
!172 = !{!173, !175, !176, !177, !178, !179, !180, !181, !182}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !171, file: !169, line: 27, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !171, file: !169, line: 28, baseType: !174, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !171, file: !169, line: 29, baseType: !174, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !171, file: !169, line: 30, baseType: !32, size: 32, align: 32, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !171, file: !169, line: 33, baseType: !174, size: 64, align: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !171, file: !169, line: 34, baseType: !174, size: 64, align: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !171, file: !169, line: 35, baseType: !174, size: 64, align: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !171, file: !169, line: 36, baseType: !174, size: 64, align: 64, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !171, file: !169, line: 37, baseType: !174, size: 64, align: 64, offset: 512)
!183 = !DILocalVariable(name: "s", arg: 1, scope: !165, file: !37, line: 237, type: !168)
!184 = !DILocation(line: 237, column: 29, scope: !165)
!185 = !DILocalVariable(name: "type", scope: !165, file: !37, line: 239, type: !31)
!186 = !DILocation(line: 239, column: 9, scope: !165)
!187 = !DILocalVariable(name: "printer_length", scope: !165, file: !37, line: 239, type: !31)
!188 = !DILocation(line: 239, column: 15, scope: !165)
!189 = !DILocalVariable(name: "driver_length", scope: !165, file: !37, line: 239, type: !31)
!190 = !DILocation(line: 239, column: 31, scope: !165)
!191 = !DILocalVariable(name: "printer_unicode_length", scope: !165, file: !37, line: 239, type: !31)
!192 = !DILocation(line: 239, column: 46, scope: !165)
!193 = !DILocalVariable(name: "blob_length", scope: !165, file: !37, line: 239, type: !31)
!194 = !DILocation(line: 239, column: 70, scope: !165)
!195 = !DILocalVariable(name: "device_name", scope: !165, file: !37, line: 240, type: !196)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 72, align: 8, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 9)
!199 = !DILocation(line: 240, column: 7, scope: !165)
!200 = !DILocalVariable(name: "printer", scope: !165, file: !37, line: 240, type: !24)
!201 = !DILocation(line: 240, column: 24, scope: !165)
!202 = !DILocalVariable(name: "driver", scope: !165, file: !37, line: 240, type: !24)
!203 = !DILocation(line: 240, column: 34, scope: !165)
!204 = !DILocation(line: 242, column: 19, scope: !165)
!205 = !DILocation(line: 242, column: 10, scope: !165)
!206 = !DILocation(line: 244, column: 24, scope: !207)
!207 = distinct !DILexicalBlock(scope: !165, file: !37, line: 244, column: 2)
!208 = !DILocation(line: 244, column: 28, scope: !207)
!209 = !DILocation(line: 244, column: 11, scope: !207)
!210 = !DILocation(line: 244, column: 9, scope: !207)
!211 = !DILocation(line: 244, column: 33, scope: !207)
!212 = !DILocation(line: 244, column: 37, scope: !207)
!213 = !DILocation(line: 244, column: 39, scope: !207)
!214 = !DILocation(line: 245, column: 10, scope: !165)
!215 = !DILocation(line: 245, column: 2, scope: !165)
!216 = !DILocation(line: 248, column: 24, scope: !217)
!217 = distinct !DILexicalBlock(scope: !165, file: !37, line: 246, column: 2)
!218 = !DILocation(line: 248, column: 28, scope: !217)
!219 = !DILocation(line: 248, column: 29, scope: !217)
!220 = !DILocation(line: 248, column: 21, scope: !217)
!221 = !DILocation(line: 248, column: 19, scope: !217)
!222 = !DILocation(line: 249, column: 5, scope: !217)
!223 = !DILocation(line: 249, column: 9, scope: !217)
!224 = !DILocation(line: 249, column: 11, scope: !217)
!225 = !DILocation(line: 250, column: 23, scope: !217)
!226 = !DILocation(line: 250, column: 27, scope: !217)
!227 = !DILocation(line: 250, column: 28, scope: !217)
!228 = !DILocation(line: 250, column: 20, scope: !217)
!229 = !DILocation(line: 250, column: 18, scope: !217)
!230 = !DILocation(line: 251, column: 5, scope: !217)
!231 = !DILocation(line: 251, column: 9, scope: !217)
!232 = !DILocation(line: 251, column: 11, scope: !217)
!233 = !DILocation(line: 255, column: 18, scope: !217)
!234 = !DILocation(line: 255, column: 21, scope: !217)
!235 = !DILocation(line: 255, column: 4, scope: !217)
!236 = !DILocation(line: 256, column: 18, scope: !217)
!237 = !DILocation(line: 256, column: 21, scope: !217)
!238 = !DILocation(line: 256, column: 4, scope: !217)
!239 = !DILocation(line: 258, column: 8, scope: !240)
!240 = distinct !DILexicalBlock(scope: !217, file: !37, line: 258, column: 8)
!241 = !DILocation(line: 258, column: 16, scope: !240)
!242 = !DILocation(line: 258, column: 23, scope: !240)
!243 = !DILocation(line: 258, column: 26, scope: !244)
!244 = !DILexicalBlockFile(scope: !240, file: !37, discriminator: 1)
!245 = !DILocation(line: 258, column: 33, scope: !244)
