; ModuleID = './[inter]rdpsnd.o.i'
source_filename = "./[inter]rdpsnd.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.audio_driver = type { void (i32*, %struct.fd_set*, %struct.fd_set*, %struct.timeval*)*, void (%struct.fd_set*, %struct.fd_set*)*, i32 ()*, void ()*, i32 (%struct._RD_WAVEFORMATEX*)*, i32 (%struct._RD_WAVEFORMATEX*)*, void (i16, i16)*, i32 ()*, void ()*, i32 (%struct._RD_WAVEFORMATEX*)*, i32 (%struct._RD_WAVEFORMATEX*)*, void (i16, i16)*, i8*, i8*, i32, i32, %struct.audio_driver* }
%struct.fd_set = type { [16 x i64] }
%struct.timeval = type { i64, i64 }
%struct._RD_WAVEFORMATEX = type { i16, i16, i32, i32, i16, i16, i16, [256 x i8] }
%struct.stream = type { i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8* }
%struct._VCHANNEL = type { i16, [8 x i8], i32, %struct.stream, void (%struct.stream*)* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.audio_packet = type { %struct.stream, i16, i8, %struct.timeval, %struct.timeval }
%struct.timezone = type { i32, i32 }

@current_driver = global %struct.audio_driver* null, align 8
@drivers = internal global %struct.audio_driver* null, align 8
@packet = internal global %struct.stream zeroinitializer, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22, globals: !37)
!1 = !DIFile(filename: "[inter]rdpsnd.o.i", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_subject_t", file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "utils.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "GUI", value: 0)
!7 = !DIEnumerator(name: "Keyboard", value: 1)
!8 = !DIEnumerator(name: "Clipboard", value: 2)
!9 = !DIEnumerator(name: "Sound", value: 3)
!10 = !DIEnumerator(name: "Protocol", value: 4)
!11 = !DIEnumerator(name: "Graphics", value: 5)
!12 = !DIEnumerator(name: "Core", value: 6)
!13 = !DIEnumerator(name: "SmartCard", value: 7)
!14 = !DIEnumerator(name: "Disk", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_level_t", file: !4, line: 37, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "Debug", value: 0)
!18 = !DIEnumerator(name: "Verbose", value: 1)
!19 = !DIEnumerator(name: "Warning", value: 2)
!20 = !DIEnumerator(name: "Error", value: 3)
!21 = !DIEnumerator(name: "Notice", value: 4)
!22 = !{!23, !27, !28, !31, !32, !33, !35}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !25, line: 39, baseType: !26)
!25 = !DIFile(filename: "types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!26 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !25, line: 41, baseType: !30)
!30 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!31 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!32 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !25, line: 43, baseType: !32)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!37 = !{!38, !116, !147, !148, !149, !150, !151, !152, !153, !164, !165, !166, !167, !168, !173, !174, !175, !176, !180, !182, !183}
!38 = distinct !DIGlobalVariable(name: "current_driver", scope: !0, file: !39, line: 53, type: !40, isLocal: false, isDefinition: true, variable: %struct.audio_driver** @current_driver)
!39 = !DIFile(filename: "rdpsnd.c", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "audio_driver", file: !42, line: 30, size: 1024, align: 64, elements: !43)
!42 = !DIFile(filename: "rdpsnd.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!43 = !{!44, !69, !73, !78, !82, !101, !102, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "add_fds", scope: !41, file: !42, line: 32, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !48, !49, !49, !60}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !51, line: 75, baseType: !52)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 64, size: 1024, align: 64, elements: !53)
!53 = !{!54}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__fds_bits", scope: !52, file: !51, line: 72, baseType: !55, size: 1024, align: 64)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 1024, align: 64, elements: !58)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !51, line: 54, baseType: !57)
!57 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!58 = !{!59}
!59 = !DISubrange(count: 16)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !62, line: 30, size: 128, align: 64, elements: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!63 = !{!64, !67}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !61, file: !62, line: 32, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !66, line: 139, baseType: !57)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !61, file: !62, line: 33, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !66, line: 141, baseType: !57)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "check_fds", scope: !41, file: !42, line: 33, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !49, !49}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "wave_out_open", scope: !41, file: !42, line: 35, baseType: !74, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_BOOL", file: !25, line: 28, baseType: !31)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "wave_out_close", scope: !41, file: !42, line: 36, baseType: !79, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{null}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "wave_out_format_supported", scope: !41, file: !42, line: 37, baseType: !83, size: 64, align: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!77, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "RD_WAVEFORMATEX", file: !25, line: 197, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RD_WAVEFORMATEX", file: !25, line: 187, size: 2208, align: 32, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "wFormatTag", scope: !88, file: !25, line: 189, baseType: !29, size: 16, align: 16)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "nChannels", scope: !88, file: !25, line: 190, baseType: !29, size: 16, align: 16, offset: 16)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "nSamplesPerSec", scope: !88, file: !25, line: 191, baseType: !34, size: 32, align: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "nAvgBytesPerSec", scope: !88, file: !25, line: 192, baseType: !34, size: 32, align: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "nBlockAlign", scope: !88, file: !25, line: 193, baseType: !29, size: 16, align: 16, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "wBitsPerSample", scope: !88, file: !25, line: 194, baseType: !29, size: 16, align: 16, offset: 112)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cbSize", scope: !88, file: !25, line: 195, baseType: !29, size: 16, align: 16, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !88, file: !25, line: 196, baseType: !98, size: 2048, align: 8, offset: 144)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 2048, align: 8, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "wave_out_set_format", scope: !41, file: !42, line: 38, baseType: !83, size: 64, align: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "wave_out_volume", scope: !41, file: !42, line: 39, baseType: !103, size: 64, align: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !29, !29}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "wave_in_open", scope: !41, file: !42, line: 41, baseType: !74, size: 64, align: 64, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "wave_in_close", scope: !41, file: !42, line: 42, baseType: !79, size: 64, align: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "wave_in_format_supported", scope: !41, file: !42, line: 43, baseType: !83, size: 64, align: 64, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "wave_in_set_format", scope: !41, file: !42, line: 44, baseType: !83, size: 64, align: 64, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "wave_in_volume", scope: !41, file: !42, line: 45, baseType: !103, size: 64, align: 64, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !41, file: !42, line: 47, baseType: !35, size: 64, align: 64, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !41, file: !42, line: 48, baseType: !35, size: 64, align: 64, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "need_byteswap_on_be", scope: !41, file: !42, line: 49, baseType: !31, size: 32, align: 32, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "need_resampling", scope: !41, file: !42, line: 50, baseType: !31, size: 32, align: 32, offset: 928)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !41, file: !42, line: 51, baseType: !40, size: 64, align: 64, offset: 960)
!116 = distinct !DIGlobalVariable(name: "rdpsnd_channel", scope: !0, file: !39, line: 50, type: !117, isLocal: true, isDefinition: true, variable: %struct._VCHANNEL** @rdpsnd_channel)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "VCHANNEL", file: !25, line: 169, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VCHANNEL", file: !25, line: 161, size: 768, align: 64, elements: !120)
!120 = !{!121, !122, !126, !127, !141}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_id", scope: !119, file: !25, line: 163, baseType: !29, size: 16, align: 16)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !25, line: 164, baseType: !123, size: 64, align: 8, offset: 16)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 64, align: 8, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 8)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !119, file: !25, line: 165, baseType: !34, size: 32, align: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !119, file: !25, line: 166, baseType: !128, size: 576, align: 64, offset: 128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stream", file: !129, line: 25, size: 576, align: 64, elements: !130)
!129 = !DIFile(filename: "stream.h", directory: "/home/lichi/Desktop/rdesktop/[task]rdesktop")
!130 = !{!131, !133, !134, !135, !136, !137, !138, !139, !140}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !128, file: !129, line: 27, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !128, file: !129, line: 28, baseType: !132, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !128, file: !129, line: 29, baseType: !132, size: 64, align: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !128, file: !129, line: 30, baseType: !32, size: 32, align: 32, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "iso_hdr", scope: !128, file: !129, line: 33, baseType: !132, size: 64, align: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "mcs_hdr", scope: !128, file: !129, line: 34, baseType: !132, size: 64, align: 64, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "sec_hdr", scope: !128, file: !129, line: 35, baseType: !132, size: 64, align: 64, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "rdp_hdr", scope: !128, file: !129, line: 36, baseType: !132, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "channel_hdr", scope: !128, file: !129, line: 37, baseType: !132, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !119, file: !25, line: 167, baseType: !142, size: 64, align: 64, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !145}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "STREAM", file: !129, line: 40, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!147 = distinct !DIGlobalVariable(name: "rdpsnddbg_channel", scope: !0, file: !39, line: 51, type: !117, isLocal: true, isDefinition: true, variable: %struct._VCHANNEL** @rdpsnddbg_channel)
!148 = distinct !DIGlobalVariable(name: "rdpsnd_negotiated", scope: !0, file: !39, line: 55, type: !77, isLocal: true, isDefinition: true, variable: i32* @rdpsnd_negotiated)
!149 = distinct !DIGlobalVariable(name: "device_open", scope: !0, file: !39, line: 57, type: !77, isLocal: true, isDefinition: true, variable: i32* @device_open)
!150 = distinct !DIGlobalVariable(name: "queue_hi", scope: !0, file: !39, line: 63, type: !32, isLocal: false, isDefinition: true, variable: i32* @queue_hi)
!151 = distinct !DIGlobalVariable(name: "queue_lo", scope: !0, file: !39, line: 63, type: !32, isLocal: false, isDefinition: true, variable: i32* @queue_lo)
!152 = distinct !DIGlobalVariable(name: "queue_pending", scope: !0, file: !39, line: 63, type: !32, isLocal: false, isDefinition: true, variable: i32* @queue_pending)
!153 = distinct !DIGlobalVariable(name: "packet_queue", scope: !0, file: !39, line: 64, type: !154, isLocal: false, isDefinition: true, variable: [50 x %struct.audio_packet]* @packet_queue)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 44800, align: 64, elements: !162)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "audio_packet", file: !42, line: 20, size: 896, align: 64, elements: !156)
!156 = !{!157, !158, !159, !160, !161}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !155, file: !42, line: 22, baseType: !128, size: 576, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tick", scope: !155, file: !42, line: 23, baseType: !29, size: 16, align: 16, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !155, file: !42, line: 24, baseType: !24, size: 8, align: 8, offset: 592)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "arrive_tv", scope: !155, file: !42, line: 26, baseType: !61, size: 128, align: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "completion_tv", scope: !155, file: !42, line: 27, baseType: !61, size: 128, align: 64, offset: 768)
!162 = !{!163}
!163 = !DISubrange(count: 50)
!164 = distinct !DIGlobalVariable(name: "packet", scope: !0, file: !39, line: 67, type: !128, isLocal: true, isDefinition: true, variable: %struct.stream* @packet)
!165 = distinct !DIGlobalVariable(name: "wave_out_play", scope: !0, file: !39, line: 69, type: !79, isLocal: false, isDefinition: true, variable: void ()** @wave_out_play)
!166 = distinct !DIGlobalVariable(name: "drivers", scope: !0, file: !39, line: 52, type: !40, isLocal: true, isDefinition: true, variable: %struct.audio_driver** @drivers)
!167 = distinct !DIGlobalVariable(name: "packet_opcode", scope: !0, file: !39, line: 66, type: !24, isLocal: true, isDefinition: true, variable: i8* @packet_opcode)
!168 = distinct !DIGlobalVariable(name: "tick", scope: !169, file: !39, line: 289, type: !29, isLocal: true, isDefinition: true, variable: i16* @rdpsnd_process_packet.tick)
!169 = distinct !DISubprogram(name: "rdpsnd_process_packet", scope: !39, file: !39, line: 286, type: !170, isLocal: true, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !172)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !24, !145}
!172 = !{}
!173 = distinct !DIGlobalVariable(name: "format", scope: !169, file: !39, line: 289, type: !29, isLocal: true, isDefinition: true, variable: i16* @rdpsnd_process_packet.format)
!174 = distinct !DIGlobalVariable(name: "packet_index", scope: !169, file: !39, line: 290, type: !24, isLocal: true, isDefinition: true, variable: i8* @rdpsnd_process_packet.packet_index)
!175 = distinct !DIGlobalVariable(name: "current_format", scope: !0, file: !39, line: 61, type: !32, isLocal: true, isDefinition: true, variable: i32* @current_format)
!176 = distinct !DIGlobalVariable(name: "formats", scope: !0, file: !39, line: 59, type: !177, isLocal: true, isDefinition: true, variable: [10 x %struct._RD_WAVEFORMATEX]* @formats)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 22080, align: 32, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 10)
!180 = distinct !DIGlobalVariable(name: "failed", scope: !181, file: !39, line: 122, type: !77, isLocal: true, isDefinition: true, variable: i32* @rdpsnd_auto_select.failed)
!181 = distinct !DISubprogram(name: "rdpsnd_auto_select", scope: !39, file: !39, line: 120, type: !75, isLocal: true, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !172)
!182 = distinct !DIGlobalVariable(name: "format_count", scope: !0, file: !39, line: 60, type: !32, isLocal: true, isDefinition: true, variable: i32* @format_count)
!183 = distinct !DIGlobalVariable(name: "rest", scope: !184, file: !39, line: 445, type: !35, isLocal: true, isDefinition: true, variable: i8** @rdpsnddbg_process.rest)
!184 = distinct !DISubprogram(name: "rdpsnddbg_process", scope: !39, file: !39, line: 442, type: !143, isLocal: true, isDefinition: true, scopeLine: 443, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !172)
!185 = !{i32 2, !"Dwarf Version", i32 4}
!186 = !{i32 2, !"Debug Info Version", i32 3}
!187 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!188 = distinct !DISubprogram(name: "rdpsnd_record", scope: !39, file: !39, line: 112, type: !189, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !172)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !191, !32}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!193 = !DILocalVariable(name: "data", arg: 1, scope: !188, file: !39, line: 112, type: !191)
!194 = !DIExpression()
!195 = !DILocation(line: 112, column: 27, scope: !188)
!196 = !DILocalVariable(name: "size", arg: 2, scope: !188, file: !39, line: 112, type: !32)
