; ModuleID = '/home/lichi/Desktop/genwqe/[task]lib--__libzHW.o/[inter]lib--deflate.o.i'
source_filename = "/home/lichi/Desktop/genwqe/[task]lib--__libzHW.o/[inter]lib--deflate.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.zedc_stream_s = type { i32, i32, i32, i32, i32, i32, i32, i8*, i32, i64, i8*, i32, i64, i32, i32, i8*, %struct.ddcb_cmd, i16, i16, i32, i32, i32, %struct.zedc_fifo, %struct.zedc_fifo, i32, i16, i32, i32, i8, i32, i32, i32, i32, i32, %struct.zedc_wsp*, i32, [3 x i32], i32, i32, i32, i32, %struct.gzedc_header_s*, i32, i16, i8, i8, i32, i32, i8, i8, i32, i16, i8, i16, i32, i32, i32, i64, i32, i32, i16, i8, i16, i32, i32, [18 x i8], i16, i32, i32, [18 x i8] }
%struct.ddcb_cmd = type { i64, i64, i8, i8, i8, i8, i16, i16, i16, i16, i32, i64, i64, i64, i64, [64 x i8], %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i64, [96 x i8] }
%struct.zedc_fifo = type { i32, i32, [256 x i8] }
%struct.zedc_wsp = type { [2 x [32784 x i8]], [512 x i8] }
%struct.gzedc_header_s = type { i32, i64, i32, i32, i8*, i32, i32, i8*, i32, i8*, i32, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !29, globals: !115)
!1 = !DIFile(filename: "/home/lichi/Desktop/genwqe/[task]lib--__libzHW.o/[inter]lib--deflate.o.i", directory: "/home/lichi/Desktop")
!2 = !{!3, !22}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "e_head_state", file: !4, line: 152, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../include/libzHW.h", directory: "/home/lichi/Desktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!6 = !DIEnumerator(name: "HEADER_START", value: 0)
!7 = !DIEnumerator(name: "FLAGS_CHECK_EMPTY", value: 1)
!8 = !DIEnumerator(name: "FLAGS_CHECK_EXTRA", value: 2)
!9 = !DIEnumerator(name: "FLAGS_GET_EXTRA_LEN1", value: 3)
!10 = !DIEnumerator(name: "FLAGS_GET_EXTRA_LEN2", value: 4)
!11 = !DIEnumerator(name: "FLAGS_GET_EXTRA", value: 5)
!12 = !DIEnumerator(name: "FLAGS_CHECK_FNAME", value: 6)
!13 = !DIEnumerator(name: "FLAGS_GET_FNAME", value: 7)
!14 = !DIEnumerator(name: "FLAGS_CHECK_FCOMMENT", value: 8)
!15 = !DIEnumerator(name: "FLAGS_GET_FCOMMENT", value: 9)
!16 = !DIEnumerator(name: "FLAGS_CHECK_FHCRC", value: 10)
!17 = !DIEnumerator(name: "FLAGS_GET_FHCRC1", value: 11)
!18 = !DIEnumerator(name: "FLAGS_GET_FHCRC2", value: 12)
!19 = !DIEnumerator(name: "FLAGS_CHECK_FTEXT", value: 13)
!20 = !DIEnumerator(name: "ZLIB_ADLER", value: 14)
!21 = !DIEnumerator(name: "HEADER_DONE", value: 15)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "zedc_mtype", file: !4, line: 131, size: 32, align: 32, elements: !23)
!23 = !{!24, !25, !26, !27, !28}
!24 = !DIEnumerator(name: "DDCB_DMA_TYPE_MASK", value: 24)
!25 = !DIEnumerator(name: "DDCB_DMA_TYPE_FLAT", value: 8)
!26 = !DIEnumerator(name: "DDCB_DMA_TYPE_SGLIST", value: 16)
!27 = !DIEnumerator(name: "DDCB_DMA_WRITEABLE", value: 4)
!28 = !DIEnumerator(name: "DDCB_DMA_PIN_MEMORY", value: 32)
!29 = !{!30, !47, !48, !79, !101, !55, !106, !107, !108, !109, !57, !110, !111}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "zedc_handle_t", file: !4, line: 354, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_dev_t", file: !33, line: 82, size: 256, align: 64, elements: !34)
!33 = !DIFile(filename: "hw_defs.h", directory: "/home/lichi/Desktop")
!34 = !{!35, !37, !38, !44, !45, !46}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !32, file: !33, line: 83, baseType: !36, size: 32, align: 32)
!36 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "zedc_rc", scope: !32, file: !33, line: 84, baseType: !36, size: 32, align: 32, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "card", scope: !32, file: !33, line: 87, baseType: !39, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "accel_t", file: !40, line: 198, baseType: !41)
!40 = !DIFile(filename: "../include/libddcb.h", directory: "/home/lichi/Desktop")
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "card_dev_t", file: !43, line: 95, flags: DIFlagFwdDecl)
!43 = !DIFile(filename: "../include/libcard.h", directory: "/home/lichi/Desktop")
!44 = !DIDerivedType(tag: DW_TAG_member, name: "card_rc", scope: !32, file: !33, line: 88, baseType: !36, size: 32, align: 32, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "card_errno", scope: !32, file: !33, line: 89, baseType: !36, size: 32, align: 32, offset: 160)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "collect_debug_data", scope: !32, file: !33, line: 90, baseType: !36, size: 32, align: 32, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_asiv_defl", file: !50, line: 179, size: 768, align: 8, elements: !51)
!50 = !DIFile(filename: "../include/deflate_ddcb.h", directory: "/home/lichi/Desktop")
!51 = !{!52, !56, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !78}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "in_buff", scope: !49, file: !50, line: 180, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !54, line: 55, baseType: !55)
!54 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop")
!55 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "in_buff_len", scope: !49, file: !50, line: 181, baseType: !57, size: 32, align: 32, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !54, line: 51, baseType: !58)
!58 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "in_crc32", scope: !49, file: !50, line: 182, baseType: !57, size: 32, align: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "out_buff", scope: !49, file: !50, line: 184, baseType: !53, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "out_buff_len", scope: !49, file: !50, line: 185, baseType: !57, size: 32, align: 32, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "in_adler32", scope: !49, file: !50, line: 186, baseType: !57, size: 32, align: 32, offset: 224)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "in_dict", scope: !49, file: !50, line: 188, baseType: !53, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "in_dict_len", scope: !49, file: !50, line: 189, baseType: !57, size: 32, align: 32, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_0", scope: !49, file: !50, line: 190, baseType: !57, size: 32, align: 32, offset: 352)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_1", scope: !49, file: !50, line: 192, baseType: !53, size: 64, align: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_2", scope: !49, file: !50, line: 193, baseType: !53, size: 64, align: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict", scope: !49, file: !50, line: 195, baseType: !53, size: 64, align: 64, offset: 512)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict_len", scope: !49, file: !50, line: 196, baseType: !57, size: 32, align: 32, offset: 576)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_3", scope: !49, file: !50, line: 197, baseType: !57, size: 32, align: 32, offset: 608)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_4", scope: !49, file: !50, line: 199, baseType: !53, size: 64, align: 64, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ibits", scope: !49, file: !50, line: 201, baseType: !73, size: 56, align: 8, offset: 704)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 56, align: 8, elements: !76)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !54, line: 48, baseType: !75)
!75 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!76 = !{!77}
!77 = !DISubrange(count: 7)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "inumbits", scope: !49, file: !50, line: 202, baseType: !74, size: 8, align: 8, offset: 760)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_asv_defl", file: !50, line: 206, size: 512, align: 8, elements: !81)
!81 = !{!82, !85, !89, !90, !91, !92, !93, !94, !95, !99, !100}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict_used", scope: !80, file: !50, line: 207, baseType: !83, size: 16, align: 16)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !54, line: 49, baseType: !84)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "resrv_1", scope: !80, file: !50, line: 208, baseType: !86, size: 40, align: 8, offset: 16)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 40, align: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 5)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "onumbits", scope: !80, file: !50, line: 209, baseType: !74, size: 8, align: 8, offset: 56)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "resrv_2", scope: !80, file: !50, line: 210, baseType: !53, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "out_crc32", scope: !80, file: !50, line: 212, baseType: !57, size: 32, align: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "out_adler32", scope: !80, file: !50, line: 213, baseType: !57, size: 32, align: 32, offset: 160)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "inp_processed", scope: !80, file: !50, line: 214, baseType: !57, size: 32, align: 32, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "outp_returned", scope: !80, file: !50, line: 215, baseType: !57, size: 32, align: 32, offset: 224)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "obits", scope: !80, file: !50, line: 217, baseType: !96, size: 192, align: 8, offset: 256)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 192, align: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 24)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict_offs", scope: !80, file: !50, line: 218, baseType: !74, size: 8, align: 8, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "obits_extra", scope: !80, file: !50, line: 219, baseType: !73, size: 56, align: 8, offset: 456)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be64", file: !102, line: 32, baseType: !103)
!102 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/lichi/Desktop")
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !104, line: 30, baseType: !105)
!104 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop")
!105 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !102, line: 30, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !104, line: 26, baseType: !58)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !104, line: 23, baseType: !84)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !102, line: 28, baseType: !108)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le32", file: !102, line: 29, baseType: !107)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !112, line: 98, baseType: !113)
!112 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !114, line: 133, baseType: !36)
!114 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop")
!115 = !{!116}
!116 = distinct !DIGlobalVariable(name: "bmsk", scope: !0, file: !117, line: 376, type: !118, isLocal: true, isDefinition: true, variable: [8 x i8]* @bmsk)
!117 = !DIFile(filename: "deflate.c", directory: "/home/lichi/Desktop")
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 64, align: 8, elements: !120)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!120 = !{!121}
!121 = !DISubrange(count: 8)
!122 = !{i32 2, !"Dwarf Version", i32 4}
!123 = !{i32 2, !"Debug Info Version", i32 3}
!124 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!125 = distinct !DISubprogram(name: "zedc_deflateInit2", scope: !117, file: !117, line: 241, type: !126, isLocal: false, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !287)
!126 = !DISubroutineType(types: !127)
!127 = !{!36, !128, !36, !36, !36, !36, !36}
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "zedc_streamp", file: !4, line: 347, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_stream_s", file: !4, line: 218, size: 8704, align: 64, elements: !131)
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !141, !142, !143, !145, !146, !147, !148, !149, !150, !188, !189, !190, !191, !192, !193, !203, !204, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !228, !229, !233, !234, !235, !236, !237, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !283, !284, !285, !286}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !130, file: !4, line: 220, baseType: !36, size: 32, align: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !130, file: !4, line: 221, baseType: !36, size: 32, align: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "windowBits", scope: !130, file: !4, line: 222, baseType: !36, size: 32, align: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "memLevel", scope: !130, file: !4, line: 227, baseType: !36, size: 32, align: 32, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !130, file: !4, line: 228, baseType: !36, size: 32, align: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !130, file: !4, line: 229, baseType: !36, size: 32, align: 32, offset: 160)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !130, file: !4, line: 230, baseType: !36, size: 32, align: 32, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !130, file: !4, line: 233, baseType: !140, size: 64, align: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !130, file: !4, line: 234, baseType: !58, size: 32, align: 32, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !130, file: !4, line: 235, baseType: !55, size: 64, align: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !130, file: !4, line: 237, baseType: !144, size: 64, align: 64, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !130, file: !4, line: 238, baseType: !58, size: 32, align: 32, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !130, file: !4, line: 239, baseType: !55, size: 64, align: 64, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !130, file: !4, line: 241, baseType: !57, size: 32, align: 32, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "adler32", scope: !130, file: !4, line: 242, baseType: !57, size: 32, align: 32, offset: 672)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !130, file: !4, line: 255, baseType: !47, size: 64, align: 64, offset: 704)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !130, file: !4, line: 256, baseType: !151, size: 1856, align: 64, offset: 768)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ddcb_cmd", file: !40, line: 154, size: 1856, align: 64, elements: !152)
!152 = !{!153, !154, !155, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !173}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "next_addr", scope: !151, file: !40, line: 155, baseType: !103, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !151, file: !40, line: 156, baseType: !103, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "acfunc", scope: !151, file: !40, line: 158, baseType: !156, size: 8, align: 8, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !104, line: 20, baseType: !75)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !151, file: !40, line: 159, baseType: !156, size: 8, align: 8, offset: 136)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "asiv_length", scope: !151, file: !40, line: 160, baseType: !156, size: 8, align: 8, offset: 144)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "asv_length", scope: !151, file: !40, line: 161, baseType: !156, size: 8, align: 8, offset: 152)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "cmdopts", scope: !151, file: !40, line: 162, baseType: !108, size: 16, align: 16, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "retc", scope: !151, file: !40, line: 163, baseType: !108, size: 16, align: 16, offset: 176)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "attn", scope: !151, file: !40, line: 165, baseType: !108, size: 16, align: 16, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "vcrc", scope: !151, file: !40, line: 166, baseType: !108, size: 16, align: 16, offset: 208)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !151, file: !40, line: 167, baseType: !107, size: 32, align: 32, offset: 224)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "deque_ts", scope: !151, file: !40, line: 169, baseType: !103, size: 64, align: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "cmplt_ts", scope: !151, file: !40, line: 170, baseType: !103, size: 64, align: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "disp_ts", scope: !151, file: !40, line: 171, baseType: !103, size: 64, align: 64, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ddata_addr", scope: !151, file: !40, line: 173, baseType: !103, size: 64, align: 64, offset: 448)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "asv", scope: !151, file: !40, line: 175, baseType: !170, size: 512, align: 8, offset: 512)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 512, align: 8, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !40, line: 177, baseType: !174, size: 832, align: 64, offset: 1024)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !151, file: !40, line: 177, size: 832, align: 64, elements: !175)
!175 = !{!176, !184}
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !174, file: !40, line: 179, baseType: !177, size: 832, align: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !174, file: !40, line: 179, size: 832, align: 64, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ats", scope: !177, file: !40, line: 180, baseType: !103, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "asiv", scope: !177, file: !40, line: 181, baseType: !181, size: 768, align: 8, offset: 64)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 768, align: 8, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 96)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__asiv", scope: !174, file: !40, line: 184, baseType: !185, size: 832, align: 8)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 832, align: 8, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 104)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "retc", scope: !130, file: !4, line: 257, baseType: !83, size: 16, align: 16, offset: 2624)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "attn", scope: !130, file: !4, line: 258, baseType: !83, size: 16, align: 16, offset: 2640)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !130, file: !4, line: 259, baseType: !57, size: 32, align: 32, offset: 2656)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !130, file: !4, line: 262, baseType: !36, size: 32, align: 32, offset: 2688)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !130, file: !4, line: 263, baseType: !36, size: 32, align: 32, offset: 2720)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "out_fifo", scope: !130, file: !4, line: 266, baseType: !194, size: 2112, align: 32, offset: 2752)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_fifo", file: !195, line: 45, size: 2112, align: 32, elements: !196)
!195 = !DIFile(filename: "../include/deflate_fifo.h", directory: "/home/lichi/Desktop")
!196 = !{!197, !198, !199}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "push", scope: !194, file: !195, line: 46, baseType: !58, size: 32, align: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pop", scope: !194, file: !195, line: 47, baseType: !58, size: 32, align: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fifo", scope: !194, file: !195, line: 48, baseType: !200, size: 2048, align: 8, offset: 64)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 2048, align: 8, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "in_fifo", scope: !130, file: !4, line: 267, baseType: !194, size: 2112, align: 32, offset: 4864)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "header_state", scope: !130, file: !4, line: 268, baseType: !205, size: 32, align: 32, offset: 6976)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "head_state", file: !4, line: 163, baseType: !3)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "gzip_hcrc", scope: !130, file: !4, line: 269, baseType: !83, size: 16, align: 16, offset: 7008)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "gzip_header_idx", scope: !130, file: !4, line: 270, baseType: !36, size: 32, align: 32, offset: 7040)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "onumbits", scope: !130, file: !4, line: 273, baseType: !36, size: 32, align: 32, offset: 7072)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "obyte", scope: !130, file: !4, line: 274, baseType: !74, size: 8, align: 8, offset: 7104)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "eob_seen", scope: !130, file: !4, line: 277, baseType: !36, size: 32, align: 32, offset: 7136)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "eob_added", scope: !130, file: !4, line: 278, baseType: !36, size: 32, align: 32, offset: 7168)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "header_added", scope: !130, file: !4, line: 279, baseType: !36, size: 32, align: 32, offset: 7200)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "trailer_added", scope: !130, file: !4, line: 280, baseType: !36, size: 32, align: 32, offset: 7232)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "havedict", scope: !130, file: !4, line: 281, baseType: !36, size: 32, align: 32, offset: 7264)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "wsp", scope: !130, file: !4, line: 284, baseType: !216, size: 64, align: 64, offset: 7296)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_wsp", file: !50, line: 93, size: 528640, align: 8, elements: !218)
!218 = !{!219, !224}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !217, file: !50, line: 94, baseType: !220, size: 524544, align: 8)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 524544, align: 8, elements: !221)
!221 = !{!222, !223}
!222 = !DISubrange(count: 2)
!223 = !DISubrange(count: 32784)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !217, file: !50, line: 95, baseType: !225, size: 4096, align: 8, offset: 524544)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 4096, align: 8, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "wsp_page", scope: !130, file: !4, line: 285, baseType: !36, size: 32, align: 32, offset: 7360)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "dma_type", scope: !130, file: !4, line: 286, baseType: !230, size: 96, align: 32, offset: 7392)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 96, align: 32, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 3)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "file_size", scope: !130, file: !4, line: 289, baseType: !57, size: 32, align: 32, offset: 7488)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "file_adler32", scope: !130, file: !4, line: 290, baseType: !57, size: 32, align: 32, offset: 7520)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "file_crc32", scope: !130, file: !4, line: 291, baseType: !57, size: 32, align: 32, offset: 7552)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "dict_adler32", scope: !130, file: !4, line: 292, baseType: !57, size: 32, align: 32, offset: 7584)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "gzip_head", scope: !130, file: !4, line: 293, baseType: !238, size: 64, align: 64, offset: 7616)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gzedc_header_s", file: !4, line: 169, size: 640, align: 64, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !251, !252, !253, !254, !255}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !239, file: !4, line: 170, baseType: !36, size: 32, align: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !239, file: !4, line: 171, baseType: !55, size: 64, align: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "xflags", scope: !239, file: !4, line: 172, baseType: !36, size: 32, align: 32, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !239, file: !4, line: 173, baseType: !36, size: 32, align: 32, offset: 160)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !239, file: !4, line: 174, baseType: !144, size: 64, align: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "extra_len", scope: !239, file: !4, line: 175, baseType: !58, size: 32, align: 32, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "extra_max", scope: !239, file: !4, line: 176, baseType: !58, size: 32, align: 32, offset: 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !239, file: !4, line: 177, baseType: !249, size: 64, align: 64, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !239, file: !4, line: 178, baseType: !58, size: 32, align: 32, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !239, file: !4, line: 179, baseType: !249, size: 64, align: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "comm_max", scope: !239, file: !4, line: 180, baseType: !58, size: 32, align: 32, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "hcrc", scope: !239, file: !4, line: 181, baseType: !36, size: 32, align: 32, offset: 544)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !239, file: !4, line: 182, baseType: !36, size: 32, align: 32, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "in_hdr_scratch_len", scope: !130, file: !4, line: 297, baseType: !57, size: 32, align: 32, offset: 7680)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "in_hdr_bits", scope: !130, file: !4, line: 298, baseType: !83, size: 16, align: 16, offset: 7712)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_ib", scope: !130, file: !4, line: 299, baseType: !74, size: 8, align: 8, offset: 7728)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "scratch_ib", scope: !130, file: !4, line: 300, baseType: !74, size: 8, align: 8, offset: 7736)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "inp_processed", scope: !130, file: !4, line: 303, baseType: !57, size: 32, align: 32, offset: 7744)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "outp_returned", scope: !130, file: !4, line: 304, baseType: !57, size: 32, align: 32, offset: 7776)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "proc_bits", scope: !130, file: !4, line: 305, baseType: !74, size: 8, align: 8, offset: 7808)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "infl_stat", scope: !130, file: !4, line: 313, baseType: !74, size: 8, align: 8, offset: 7816)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_start", scope: !130, file: !4, line: 318, baseType: !57, size: 32, align: 32, offset: 7840)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "out_hdr_bits", scope: !130, file: !4, line: 319, baseType: !83, size: 16, align: 16, offset: 7872)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "out_hdr_start_bits", scope: !130, file: !4, line: 320, baseType: !74, size: 8, align: 8, offset: 7888)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "copyblock_len", scope: !130, file: !4, line: 321, baseType: !83, size: 16, align: 16, offset: 7904)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tree_bits", scope: !130, file: !4, line: 324, baseType: !57, size: 32, align: 32, offset: 7936)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pad_bits", scope: !130, file: !4, line: 325, baseType: !57, size: 32, align: 32, offset: 7968)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "scratch_bits", scope: !130, file: !4, line: 326, baseType: !57, size: 32, align: 32, offset: 8000)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pre_scratch_bits", scope: !130, file: !4, line: 327, baseType: !53, size: 64, align: 64, offset: 8064)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inp_data_offs", scope: !130, file: !4, line: 328, baseType: !57, size: 32, align: 32, offset: 8128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "in_data_used", scope: !130, file: !4, line: 329, baseType: !57, size: 32, align: 32, offset: 8160)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "dict_len", scope: !130, file: !4, line: 332, baseType: !83, size: 16, align: 16, offset: 8192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict_offs", scope: !130, file: !4, line: 333, baseType: !74, size: 8, align: 8, offset: 8208)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "obytes_in_dict", scope: !130, file: !4, line: 334, baseType: !83, size: 16, align: 16, offset: 8224)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "prefx_len", scope: !130, file: !4, line: 337, baseType: !36, size: 32, align: 32, offset: 8256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prefx_idx", scope: !130, file: !4, line: 338, baseType: !36, size: 32, align: 32, offset: 8288)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prefx", scope: !130, file: !4, line: 339, baseType: !280, size: 144, align: 8, offset: 8320)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 144, align: 8, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 18)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "xlen", scope: !130, file: !4, line: 340, baseType: !83, size: 16, align: 16, offset: 8464)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "postfx_len", scope: !130, file: !4, line: 342, baseType: !36, size: 32, align: 32, offset: 8480)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "postfx_idx", scope: !130, file: !4, line: 343, baseType: !36, size: 32, align: 32, offset: 8512)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "postfx", scope: !130, file: !4, line: 344, baseType: !280, size: 144, align: 8, offset: 8544)
!287 = !{}
!288 = !DILocalVariable(name: "strm", arg: 1, scope: !125, file: !117, line: 241, type: !128)
!289 = !DIExpression()
!290 = !DILocation(line: 241, column: 36, scope: !125)
!291 = !DILocalVariable(name: "level", arg: 2, scope: !125, file: !117, line: 242, type: !36)
!292 = !DILocation(line: 242, column: 13, scope: !125)
!293 = !DILocalVariable(name: "method", arg: 3, scope: !125, file: !117, line: 243, type: !36)
!294 = !DILocation(line: 243, column: 13, scope: !125)
!295 = !DILocalVariable(name: "windowBits", arg: 4, scope: !125, file: !117, line: 244, type: !36)
!296 = !DILocation(line: 244, column: 13, scope: !125)
!297 = !DILocalVariable(name: "memLevel", arg: 5, scope: !125, file: !117, line: 245, type: !36)
!298 = !DILocation(line: 245, column: 13, scope: !125)
!299 = !DILocalVariable(name: "strategy", arg: 6, scope: !125, file: !117, line: 246, type: !36)
!300 = !DILocation(line: 246, column: 13, scope: !125)
!301 = !DILocalVariable(name: "rc", scope: !125, file: !117, line: 248, type: !36)
!302 = !DILocation(line: 248, column: 6, scope: !125)
!303 = !DILocalVariable(name: "zedc", scope: !125, file: !117, line: 249, type: !30)
!304 = !DILocation(line: 249, column: 16, scope: !125)
!305 = !DILocation(line: 251, column: 7, scope: !306)
!306 = distinct !DILexicalBlock(scope: !125, file: !117, line: 251, column: 6)
!307 = !DILocation(line: 251, column: 6, scope: !125)
!308 = !DILocation(line: 252, column: 3, scope: !306)
!309 = !DILocation(line: 254, column: 24, scope: !125)
!310 = !DILocation(line: 254, column: 30, scope: !125)
!311 = !DILocation(line: 254, column: 9, scope: !125)
!312 = !DILocation(line: 254, column: 7, scope: !125)
!313 = !DILocation(line: 255, column: 7, scope: !314)
!314 = distinct !DILexicalBlock(scope: !125, file: !117, line: 255, column: 6)
!315 = !DILocation(line: 255, column: 6, scope: !125)
!316 = !DILocation(line: 256, column: 3, scope: !314)
!317 = !DILocation(line: 258, column: 15, scope: !318)
!318 = distinct !DILexicalBlock(scope: !125, file: !117, line: 258, column: 6)
!319 = !DILocation(line: 258, column: 7, scope: !318)
!320 = !DILocation(line: 258, column: 6, scope: !125)
!321 = !DILocation(line: 259, column: 3, scope: !318)
!322 = !DILocation(line: 261, column: 28, scope: !125)
!323 = !DILocation(line: 261, column: 7, scope: !125)
!324 = !DILocation(line: 261, column: 5, scope: !125)
!325 = !DILocation(line: 262, column: 6, scope: !326)
!326 = distinct !DILexicalBlock(scope: !125, file: !117, line: 262, column: 6)
!327 = !DILocation(line: 262, column: 9, scope: !326)
!328 = !DILocation(line: 262, column: 6, scope: !125)
!329 = !DILocation(line: 263, column: 10, scope: !326)
!330 = !DILocation(line: 263, column: 3, scope: !326)
!331 = !DILocation(line: 265, column: 21, scope: !125)
!332 = !DILocation(line: 265, column: 2, scope: !125)
!333 = !DILocation(line: 265, column: 8, scope: !125)
!334 = !DILocation(line: 265, column: 19, scope: !125)
!335 = !DILocation(line: 266, column: 16, scope: !125)
!336 = !DILocation(line: 266, column: 2, scope: !125)
!337 = !DILocation(line: 266, column: 8, scope: !125)
!338 = !DILocation(line: 266, column: 14, scope: !125)
!339 = !DILocation(line: 267, column: 17, scope: !125)
!340 = !DILocation(line: 267, column: 2, scope: !125)
!341 = !DILocation(line: 267, column: 8, scope: !125)
!342 = !DILocation(line: 267, column: 15, scope: !125)
!343 = !DILocation(line: 268, column: 19, scope: !125)
!344 = !DILocation(line: 268, column: 2, scope: !125)
!345 = !DILocation(line: 268, column: 8, scope: !125)
!346 = !DILocation(line: 268, column: 17, scope: !125)
!347 = !DILocation(line: 269, column: 19, scope: !125)
!348 = !DILocation(line: 269, column: 2, scope: !125)
!349 = !DILocation(line: 269, column: 8, scope: !125)
!350 = !DILocation(line: 269, column: 17, scope: !125)
!351 = !DILocation(line: 270, column: 22, scope: !125)
