; ModuleID = '/home/lichi/Desktop/genwqe/[task]lib--__libzHW.o/[inter]lib--inflate.o.i'
source_filename = "/home/lichi/Desktop/genwqe/[task]lib--__libzHW.o/[inter]lib--inflate.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.zedc_stream_s = type { i32, i32, i32, i32, i32, i32, i32, i8*, i32, i64, i8*, i32, i64, i32, i32, i8*, %struct.ddcb_cmd, i16, i16, i32, i32, i32, %struct.zedc_fifo, %struct.zedc_fifo, i32, i16, i32, i32, i8, i32, i32, i32, i32, i32, %struct.zedc_wsp*, i32, [3 x i32], i32, i32, i32, i32, %struct.gzedc_header_s*, i32, i16, i8, i8, i32, i32, i8, i8, i32, i16, i8, i16, i32, i32, i32, i64, i32, i32, i16, i8, i16, i32, i32, [18 x i8], i16, i32, i32, [18 x i8] }
%struct.ddcb_cmd = type { i64, i64, i8, i8, i8, i8, i16, i16, i16, i16, i32, i64, i64, i64, i64, [64 x i8], %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i64, [96 x i8] }
%struct.zedc_fifo = type { i32, i32, [256 x i8] }
%struct.zedc_wsp = type { [2 x [32784 x i8]], [512 x i8] }
%struct.gzedc_header_s = type { i32, i64, i32, i32, i8*, i32, i32, i8*, i32, i8*, i32, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !29)
!1 = !DIFile(filename: "/home/lichi/Desktop/genwqe/[task]lib--__libzHW.o/[inter]lib--inflate.o.i", directory: "/home/lichi/Desktop")
!2 = !{!3, !22}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "e_head_state", file: !4, line: 152, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../include/libzHW.h", directory: "/home/lichi/Desktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!6 = !DIEnumerator(name: "HEADER_START", value: 0)
!7 = !DIEnumerator(name: "FLAGS_CHECK_EMPTY", value: 1)
!8 = !DIEnumerator(name: "FLAGS_CHECK_EXTRA", value: 2)
!9 = !DIEnumerator(name: "FLAGS_GET_EXTRA_LEN1", value: 3)
!10 = !DIEnumerator(name: "FLAGS_GET_EXTRA_LEN2", value: 4)
!11 = !DIEnumerator(name: "FLAGS_GET_EXTRA", value: 5)
!12 = !DIEnumerator(name: "FLAGS_CHECK_FNAME", value: 6)
!13 = !DIEnumerator(name: "FLAGS_GET_FNAME", value: 7)
!14 = !DIEnumerator(name: "FLAGS_CHECK_FCOMMENT", value: 8)
!15 = !DIEnumerator(name: "FLAGS_GET_FCOMMENT", value: 9)
!16 = !DIEnumerator(name: "FLAGS_CHECK_FHCRC", value: 10)
!17 = !DIEnumerator(name: "FLAGS_GET_FHCRC1", value: 11)
!18 = !DIEnumerator(name: "FLAGS_GET_FHCRC2", value: 12)
!19 = !DIEnumerator(name: "FLAGS_CHECK_FTEXT", value: 13)
!20 = !DIEnumerator(name: "ZLIB_ADLER", value: 14)
!21 = !DIEnumerator(name: "HEADER_DONE", value: 15)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "zedc_mtype", file: !4, line: 131, size: 32, align: 32, elements: !23)
!23 = !{!24, !25, !26, !27, !28}
!24 = !DIEnumerator(name: "DDCB_DMA_TYPE_MASK", value: 24)
!25 = !DIEnumerator(name: "DDCB_DMA_TYPE_FLAT", value: 8)
!26 = !DIEnumerator(name: "DDCB_DMA_TYPE_SGLIST", value: 16)
!27 = !DIEnumerator(name: "DDCB_DMA_WRITEABLE", value: 4)
!28 = !DIEnumerator(name: "DDCB_DMA_PIN_MEMORY", value: 32)
!29 = !{!30, !62, !37, !63, !66, !68, !69, !70, !87, !113, !117, !118, !51, !76, !39, !40, !119, !120, !121, !122, !123, !35}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_asiv_infl", file: !32, line: 110, size: 768, align: 8, elements: !33)
!32 = !DIFile(filename: "../include/deflate_ddcb.h", directory: "/home/lichi/Desktop")
!33 = !{!34, !38, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !53, !56, !57, !58, !59, !60, !61}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "in_buff", scope: !31, file: !32, line: 111, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !36, line: 55, baseType: !37)
!36 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop")
!37 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "in_buff_len", scope: !31, file: !32, line: 112, baseType: !39, size: 32, align: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !36, line: 51, baseType: !40)
!40 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "in_crc32", scope: !31, file: !32, line: 113, baseType: !39, size: 32, align: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "out_buff", scope: !31, file: !32, line: 115, baseType: !35, size: 64, align: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "out_buff_len", scope: !31, file: !32, line: 116, baseType: !39, size: 32, align: 32, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "in_adler32", scope: !31, file: !32, line: 117, baseType: !39, size: 32, align: 32, offset: 224)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "in_dict", scope: !31, file: !32, line: 119, baseType: !35, size: 64, align: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "in_dict_len", scope: !31, file: !32, line: 120, baseType: !39, size: 32, align: 32, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_0", scope: !31, file: !32, line: 121, baseType: !39, size: 32, align: 32, offset: 352)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "inp_scratch", scope: !31, file: !32, line: 123, baseType: !35, size: 64, align: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "in_scratch_len", scope: !31, file: !32, line: 124, baseType: !39, size: 32, align: 32, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "in_hdr_bits", scope: !31, file: !32, line: 125, baseType: !51, size: 16, align: 16, offset: 480)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !36, line: 49, baseType: !52)
!52 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_ib", scope: !31, file: !32, line: 126, baseType: !54, size: 8, align: 8, offset: 496)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !36, line: 48, baseType: !55)
!55 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "scratch_ib", scope: !31, file: !32, line: 127, baseType: !54, size: 8, align: 8, offset: 504)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict", scope: !31, file: !32, line: 129, baseType: !35, size: 64, align: 64, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict_len", scope: !31, file: !32, line: 130, baseType: !39, size: 32, align: 32, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_1", scope: !31, file: !32, line: 131, baseType: !39, size: 32, align: 32, offset: 608)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_2", scope: !31, file: !32, line: 133, baseType: !35, size: 64, align: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_3", scope: !31, file: !32, line: 134, baseType: !35, size: 64, align: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !64, line: 30, baseType: !65)
!64 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop")
!65 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be64", file: !67, line: 32, baseType: !63)
!67 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/lichi/Desktop")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !64, line: 26, baseType: !40)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !67, line: 30, baseType: !68)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "zedc_handle_t", file: !4, line: 354, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_dev_t", file: !73, line: 82, size: 256, align: 64, elements: !74)
!73 = !DIFile(filename: "hw_defs.h", directory: "/home/lichi/Desktop")
!74 = !{!75, !77, !78, !84, !85, !86}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !72, file: !73, line: 83, baseType: !76, size: 32, align: 32)
!76 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "zedc_rc", scope: !72, file: !73, line: 84, baseType: !76, size: 32, align: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "card", scope: !72, file: !73, line: 87, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "accel_t", file: !80, line: 198, baseType: !81)
!80 = !DIFile(filename: "../include/libddcb.h", directory: "/home/lichi/Desktop")
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "card_dev_t", file: !83, line: 95, flags: DIFlagFwdDecl)
!83 = !DIFile(filename: "../include/libcard.h", directory: "/home/lichi/Desktop")
!84 = !DIDerivedType(tag: DW_TAG_member, name: "card_rc", scope: !72, file: !73, line: 88, baseType: !76, size: 32, align: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "card_errno", scope: !72, file: !73, line: 89, baseType: !76, size: 32, align: 32, offset: 160)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "collect_debug_data", scope: !72, file: !73, line: 90, baseType: !76, size: 32, align: 32, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_asv_infl", file: !32, line: 149, size: 512, align: 8, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !108, !109, !110, !111, !112}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict_used", scope: !88, file: !32, line: 150, baseType: !51, size: 16, align: 16)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "copyblock_len", scope: !88, file: !32, line: 151, baseType: !51, size: 16, align: 16, offset: 16)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_84", scope: !88, file: !32, line: 152, baseType: !54, size: 8, align: 8, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "infl_stat", scope: !88, file: !32, line: 153, baseType: !54, size: 8, align: 8, offset: 40)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_86", scope: !88, file: !32, line: 154, baseType: !54, size: 8, align: 8, offset: 48)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "proc_bits", scope: !88, file: !32, line: 155, baseType: !54, size: 8, align: 8, offset: 56)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_start", scope: !88, file: !32, line: 157, baseType: !39, size: 32, align: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_8c", scope: !88, file: !32, line: 158, baseType: !54, size: 8, align: 8, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_start_bits", scope: !88, file: !32, line: 159, baseType: !54, size: 8, align: 8, offset: 104)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "out_hdr_bits", scope: !88, file: !32, line: 160, baseType: !51, size: 16, align: 16, offset: 112)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "out_crc32", scope: !88, file: !32, line: 162, baseType: !39, size: 32, align: 32, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "out_adler32", scope: !88, file: !32, line: 163, baseType: !39, size: 32, align: 32, offset: 160)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "inp_processed", scope: !88, file: !32, line: 165, baseType: !39, size: 32, align: 32, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "outp_returned", scope: !88, file: !32, line: 166, baseType: !39, size: 32, align: 32, offset: 224)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_a0", scope: !88, file: !32, line: 168, baseType: !105, size: 192, align: 64, offset: 256)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 192, align: 64, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 3)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict_offs", scope: !88, file: !32, line: 170, baseType: !54, size: 8, align: 8, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_b9", scope: !88, file: !32, line: 171, baseType: !54, size: 8, align: 8, offset: 456)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "obytes_in_dict", scope: !88, file: !32, line: 172, baseType: !51, size: 16, align: 16, offset: 464)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_bc", scope: !88, file: !32, line: 173, baseType: !51, size: 16, align: 16, offset: 480)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_be", scope: !88, file: !32, line: 174, baseType: !51, size: 16, align: 16, offset: 496)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !114, line: 98, baseType: !115)
!114 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !116, line: 133, baseType: !76)
!116 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop")
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le32", file: !67, line: 29, baseType: !68)
!118 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !67, line: 28, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !64, line: 23, baseType: !52)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le16", file: !67, line: 27, baseType: !120)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!124 = !{i32 2, !"Dwarf Version", i32 4}
!125 = !{i32 2, !"Debug Info Version", i32 3}
!126 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!127 = distinct !DISubprogram(name: "zedc_inflate_pending_output", scope: !128, file: !128, line: 766, type: !129, isLocal: false, isDefinition: true, scopeLine: 767, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !287)
!128 = !DIFile(filename: "inflate.c", directory: "/home/lichi/Desktop")
!129 = !DISubroutineType(types: !130)
!130 = !{!76, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_stream_s", file: !4, line: 218, size: 8704, align: 64, elements: !133)
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141, !144, !145, !146, !147, !148, !149, !150, !151, !152, !190, !191, !192, !193, !194, !195, !205, !206, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !230, !231, !233, !234, !235, !236, !237, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !283, !284, !285, !286}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !132, file: !4, line: 220, baseType: !76, size: 32, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !132, file: !4, line: 221, baseType: !76, size: 32, align: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "windowBits", scope: !132, file: !4, line: 222, baseType: !76, size: 32, align: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "memLevel", scope: !132, file: !4, line: 227, baseType: !76, size: 32, align: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !132, file: !4, line: 228, baseType: !76, size: 32, align: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !132, file: !4, line: 229, baseType: !76, size: 32, align: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !132, file: !4, line: 230, baseType: !76, size: 32, align: 32, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !132, file: !4, line: 233, baseType: !142, size: 64, align: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !132, file: !4, line: 234, baseType: !40, size: 32, align: 32, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !132, file: !4, line: 235, baseType: !37, size: 64, align: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !132, file: !4, line: 237, baseType: !121, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !132, file: !4, line: 238, baseType: !40, size: 32, align: 32, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !132, file: !4, line: 239, baseType: !37, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !132, file: !4, line: 241, baseType: !39, size: 32, align: 32, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "adler32", scope: !132, file: !4, line: 242, baseType: !39, size: 32, align: 32, offset: 672)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !132, file: !4, line: 255, baseType: !62, size: 64, align: 64, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !132, file: !4, line: 256, baseType: !153, size: 1856, align: 64, offset: 768)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ddcb_cmd", file: !80, line: 154, size: 1856, align: 64, elements: !154)
!154 = !{!155, !156, !157, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !175}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "next_addr", scope: !153, file: !80, line: 155, baseType: !63, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !153, file: !80, line: 156, baseType: !63, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "acfunc", scope: !153, file: !80, line: 158, baseType: !158, size: 8, align: 8, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !64, line: 20, baseType: !55)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !153, file: !80, line: 159, baseType: !158, size: 8, align: 8, offset: 136)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "asiv_length", scope: !153, file: !80, line: 160, baseType: !158, size: 8, align: 8, offset: 144)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "asv_length", scope: !153, file: !80, line: 161, baseType: !158, size: 8, align: 8, offset: 152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "cmdopts", scope: !153, file: !80, line: 162, baseType: !120, size: 16, align: 16, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "retc", scope: !153, file: !80, line: 163, baseType: !120, size: 16, align: 16, offset: 176)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "attn", scope: !153, file: !80, line: 165, baseType: !120, size: 16, align: 16, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "vcrc", scope: !153, file: !80, line: 166, baseType: !120, size: 16, align: 16, offset: 208)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !153, file: !80, line: 167, baseType: !68, size: 32, align: 32, offset: 224)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "deque_ts", scope: !153, file: !80, line: 169, baseType: !63, size: 64, align: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "cmplt_ts", scope: !153, file: !80, line: 170, baseType: !63, size: 64, align: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "disp_ts", scope: !153, file: !80, line: 171, baseType: !63, size: 64, align: 64, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ddata_addr", scope: !153, file: !80, line: 173, baseType: !63, size: 64, align: 64, offset: 448)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "asv", scope: !153, file: !80, line: 175, baseType: !172, size: 512, align: 8, offset: 512)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 512, align: 8, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, scope: !153, file: !80, line: 177, baseType: !176, size: 832, align: 64, offset: 1024)
!176 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !153, file: !80, line: 177, size: 832, align: 64, elements: !177)
!177 = !{!178, !186}
!178 = !DIDerivedType(tag: DW_TAG_member, scope: !176, file: !80, line: 179, baseType: !179, size: 832, align: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !176, file: !80, line: 179, size: 832, align: 64, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ats", scope: !179, file: !80, line: 180, baseType: !63, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "asiv", scope: !179, file: !80, line: 181, baseType: !183, size: 768, align: 8, offset: 64)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 768, align: 8, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__asiv", scope: !176, file: !80, line: 184, baseType: !187, size: 832, align: 8)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 832, align: 8, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 104)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "retc", scope: !132, file: !4, line: 257, baseType: !51, size: 16, align: 16, offset: 2624)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "attn", scope: !132, file: !4, line: 258, baseType: !51, size: 16, align: 16, offset: 2640)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !132, file: !4, line: 259, baseType: !39, size: 32, align: 32, offset: 2656)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !132, file: !4, line: 262, baseType: !76, size: 32, align: 32, offset: 2688)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !132, file: !4, line: 263, baseType: !76, size: 32, align: 32, offset: 2720)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "out_fifo", scope: !132, file: !4, line: 266, baseType: !196, size: 2112, align: 32, offset: 2752)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_fifo", file: !197, line: 45, size: 2112, align: 32, elements: !198)
!197 = !DIFile(filename: "../include/deflate_fifo.h", directory: "/home/lichi/Desktop")
!198 = !{!199, !200, !201}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "push", scope: !196, file: !197, line: 46, baseType: !40, size: 32, align: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pop", scope: !196, file: !197, line: 47, baseType: !40, size: 32, align: 32, offset: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fifo", scope: !196, file: !197, line: 48, baseType: !202, size: 2048, align: 8, offset: 64)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 2048, align: 8, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "in_fifo", scope: !132, file: !4, line: 267, baseType: !196, size: 2112, align: 32, offset: 4864)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "header_state", scope: !132, file: !4, line: 268, baseType: !207, size: 32, align: 32, offset: 6976)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "head_state", file: !4, line: 163, baseType: !3)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "gzip_hcrc", scope: !132, file: !4, line: 269, baseType: !51, size: 16, align: 16, offset: 7008)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "gzip_header_idx", scope: !132, file: !4, line: 270, baseType: !76, size: 32, align: 32, offset: 7040)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "onumbits", scope: !132, file: !4, line: 273, baseType: !76, size: 32, align: 32, offset: 7072)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "obyte", scope: !132, file: !4, line: 274, baseType: !54, size: 8, align: 8, offset: 7104)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "eob_seen", scope: !132, file: !4, line: 277, baseType: !76, size: 32, align: 32, offset: 7136)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "eob_added", scope: !132, file: !4, line: 278, baseType: !76, size: 32, align: 32, offset: 7168)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "header_added", scope: !132, file: !4, line: 279, baseType: !76, size: 32, align: 32, offset: 7200)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "trailer_added", scope: !132, file: !4, line: 280, baseType: !76, size: 32, align: 32, offset: 7232)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "havedict", scope: !132, file: !4, line: 281, baseType: !76, size: 32, align: 32, offset: 7264)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "wsp", scope: !132, file: !4, line: 284, baseType: !218, size: 64, align: 64, offset: 7296)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_wsp", file: !32, line: 93, size: 528640, align: 8, elements: !220)
!220 = !{!221, !226}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !219, file: !32, line: 94, baseType: !222, size: 524544, align: 8)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 524544, align: 8, elements: !223)
!223 = !{!224, !225}
!224 = !DISubrange(count: 2)
!225 = !DISubrange(count: 32784)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !219, file: !32, line: 95, baseType: !227, size: 4096, align: 8, offset: 524544)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 4096, align: 8, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 512)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "wsp_page", scope: !132, file: !4, line: 285, baseType: !76, size: 32, align: 32, offset: 7360)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "dma_type", scope: !132, file: !4, line: 286, baseType: !232, size: 96, align: 32, offset: 7392)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 96, align: 32, elements: !106)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "file_size", scope: !132, file: !4, line: 289, baseType: !39, size: 32, align: 32, offset: 7488)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "file_adler32", scope: !132, file: !4, line: 290, baseType: !39, size: 32, align: 32, offset: 7520)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "file_crc32", scope: !132, file: !4, line: 291, baseType: !39, size: 32, align: 32, offset: 7552)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "dict_adler32", scope: !132, file: !4, line: 292, baseType: !39, size: 32, align: 32, offset: 7584)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "gzip_head", scope: !132, file: !4, line: 293, baseType: !238, size: 64, align: 64, offset: 7616)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gzedc_header_s", file: !4, line: 169, size: 640, align: 64, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !251, !252, !253, !254, !255}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !239, file: !4, line: 170, baseType: !76, size: 32, align: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !239, file: !4, line: 171, baseType: !37, size: 64, align: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "xflags", scope: !239, file: !4, line: 172, baseType: !76, size: 32, align: 32, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !239, file: !4, line: 173, baseType: !76, size: 32, align: 32, offset: 160)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !239, file: !4, line: 174, baseType: !121, size: 64, align: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "extra_len", scope: !239, file: !4, line: 175, baseType: !40, size: 32, align: 32, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "extra_max", scope: !239, file: !4, line: 176, baseType: !40, size: 32, align: 32, offset: 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !239, file: !4, line: 177, baseType: !249, size: 64, align: 64, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !239, file: !4, line: 178, baseType: !40, size: 32, align: 32, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !239, file: !4, line: 179, baseType: !249, size: 64, align: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "comm_max", scope: !239, file: !4, line: 180, baseType: !40, size: 32, align: 32, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "hcrc", scope: !239, file: !4, line: 181, baseType: !76, size: 32, align: 32, offset: 544)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !239, file: !4, line: 182, baseType: !76, size: 32, align: 32, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "in_hdr_scratch_len", scope: !132, file: !4, line: 297, baseType: !39, size: 32, align: 32, offset: 7680)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "in_hdr_bits", scope: !132, file: !4, line: 298, baseType: !51, size: 16, align: 16, offset: 7712)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_ib", scope: !132, file: !4, line: 299, baseType: !54, size: 8, align: 8, offset: 7728)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "scratch_ib", scope: !132, file: !4, line: 300, baseType: !54, size: 8, align: 8, offset: 7736)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "inp_processed", scope: !132, file: !4, line: 303, baseType: !39, size: 32, align: 32, offset: 7744)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "outp_returned", scope: !132, file: !4, line: 304, baseType: !39, size: 32, align: 32, offset: 7776)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "proc_bits", scope: !132, file: !4, line: 305, baseType: !54, size: 8, align: 8, offset: 7808)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "infl_stat", scope: !132, file: !4, line: 313, baseType: !54, size: 8, align: 8, offset: 7816)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_start", scope: !132, file: !4, line: 318, baseType: !39, size: 32, align: 32, offset: 7840)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "out_hdr_bits", scope: !132, file: !4, line: 319, baseType: !51, size: 16, align: 16, offset: 7872)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "out_hdr_start_bits", scope: !132, file: !4, line: 320, baseType: !54, size: 8, align: 8, offset: 7888)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "copyblock_len", scope: !132, file: !4, line: 321, baseType: !51, size: 16, align: 16, offset: 7904)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tree_bits", scope: !132, file: !4, line: 324, baseType: !39, size: 32, align: 32, offset: 7936)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pad_bits", scope: !132, file: !4, line: 325, baseType: !39, size: 32, align: 32, offset: 7968)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "scratch_bits", scope: !132, file: !4, line: 326, baseType: !39, size: 32, align: 32, offset: 8000)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pre_scratch_bits", scope: !132, file: !4, line: 327, baseType: !35, size: 64, align: 64, offset: 8064)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inp_data_offs", scope: !132, file: !4, line: 328, baseType: !39, size: 32, align: 32, offset: 8128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "in_data_used", scope: !132, file: !4, line: 329, baseType: !39, size: 32, align: 32, offset: 8160)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "dict_len", scope: !132, file: !4, line: 332, baseType: !51, size: 16, align: 16, offset: 8192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict_offs", scope: !132, file: !4, line: 333, baseType: !54, size: 8, align: 8, offset: 8208)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "obytes_in_dict", scope: !132, file: !4, line: 334, baseType: !51, size: 16, align: 16, offset: 8224)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "prefx_len", scope: !132, file: !4, line: 337, baseType: !76, size: 32, align: 32, offset: 8256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prefx_idx", scope: !132, file: !4, line: 338, baseType: !76, size: 32, align: 32, offset: 8288)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prefx", scope: !132, file: !4, line: 339, baseType: !280, size: 144, align: 8, offset: 8320)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 144, align: 8, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 18)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "xlen", scope: !132, file: !4, line: 340, baseType: !51, size: 16, align: 16, offset: 8464)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "postfx_len", scope: !132, file: !4, line: 342, baseType: !76, size: 32, align: 32, offset: 8480)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "postfx_idx", scope: !132, file: !4, line: 343, baseType: !76, size: 32, align: 32, offset: 8512)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "postfx", scope: !132, file: !4, line: 344, baseType: !280, size: 144, align: 8, offset: 8544)
!287 = !{}
!288 = !DILocalVariable(name: "strm", arg: 1, scope: !127, file: !128, line: 766, type: !131)
!289 = !DIExpression()
!290 = !DILocation(line: 766, column: 55, scope: !127)
!291 = !DILocation(line: 768, column: 9, scope: !127)
!292 = !DILocation(line: 768, column: 15, scope: !127)
!293 = !DILocation(line: 768, column: 2, scope: !127)
!294 = distinct !DISubprogram(name: "zedc_read_pending_output", scope: !128, file: !128, line: 778, type: !295, isLocal: false, isDefinition: true, scopeLine: 780, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !287)
!295 = !DISubroutineType(types: !296)
!296 = !{!76, !131, !121, !40}
!297 = !DILocalVariable(name: "strm", arg: 1, scope: !294, file: !128, line: 778, type: !131)
!298 = !DILocation(line: 778, column: 52, scope: !294)
!299 = !DILocalVariable(name: "buf", arg: 2, scope: !294, file: !128, line: 779, type: !121)
!300 = !DILocation(line: 779, column: 13, scope: !294)
!301 = !DILocalVariable(name: "len", arg: 3, scope: !294, file: !128, line: 779, type: !40)
!302 = !DILocation(line: 779, column: 31, scope: !294)
!303 = !DILocalVariable(name: "pdict", scope: !294, file: !128, line: 781, type: !121)
!304 = !DILocation(line: 781, column: 11, scope: !294)
!305 = !DILocalVariable(name: "_len", scope: !294, file: !128, line: 782, type: !40)
!306 = !DILocation(line: 782, column: 15, scope: !294)
!307 = !DILocation(line: 784, column: 6, scope: !308)
!308 = distinct !DILexicalBlock(scope: !294, file: !128, line: 784, column: 6)
!309 = !DILocation(line: 784, column: 12, scope: !308)
!310 = !DILocation(line: 784, column: 27, scope: !308)
!311 = !DILocation(line: 784, column: 6, scope: !294)
!312 = !DILocation(line: 785, column: 3, scope: !308)
!313 = !DILocation(line: 786, column: 6, scope: !314)
!314 = distinct !DILexicalBlock(scope: !294, file: !128, line: 786, column: 6)
!315 = !DILocation(line: 786, column: 12, scope: !314)
!316 = !DILocation(line: 786, column: 23, scope: !314)
!317 = !DILocation(line: 786, column: 29, scope: !314)
!318 = !DILocation(line: 786, column: 21, scope: !314)
!319 = !DILocation(line: 786, column: 6, scope: !294)
!320 = !DILocation(line: 787, column: 3, scope: !314)
!321 = !DILocation(line: 790, column: 26, scope: !294)
!322 = !DILocation(line: 790, column: 32, scope: !294)
!323 = !DILocation(line: 790, column: 10, scope: !294)
!324 = !DILocation(line: 790, column: 16, scope: !294)
!325 = !DILocation(line: 790, column: 21, scope: !294)
!326 = !DILocation(line: 791, column: 3, scope: !294)
!327 = !DILocation(line: 791, column: 9, scope: !294)
!328 = !DILocation(line: 790, column: 42, scope: !294)
!329 = !DILocation(line: 791, column: 25, scope: !294)
!330 = !DILocation(line: 791, column: 31, scope: !294)
!331 = !DILocation(line: 791, column: 23, scope: !294)
!332 = !DILocation(line: 791, column: 42, scope: !294)
!333 = !DILocation(line: 791, column: 48, scope: !294)
!334 = !DILocation(line: 791, column: 40, scope: !294)
!335 = !DILocation(line: 790, column: 8, scope: !294)
!336 = !DILocation(line: 793, column: 2, scope: !294)
!337 = !DILocation(line: 793, column: 9, scope: !338)
!338 = !DILexicalBlockFile(scope: !294, file: !128, discriminator: 1)
!339 = !DILocation(line: 793, column: 13, scope: !338)
!340 = !DILocation(line: 793, column: 16, scope: !341)
!341 = !DILexicalBlockFile(scope: !294, file: !128, discriminator: 2)
!342 = !DILocation(line: 793, column: 22, scope: !341)
!343 = !DILocation(line: 793, column: 13, scope: !341)
!344 = !DILocation(line: 793, column: 2, scope: !345)
!345 = !DILexicalBlockFile(scope: !294, file: !128, discriminator: 3)
!346 = !DILocation(line: 794, column: 18, scope: !347)
!347 = distinct !DILexicalBlock(scope: !294, file: !128, line: 793, column: 38)
!348 = !DILocation(line: 794, column: 12, scope: !347)
!349 = !DILocation(line: 794, column: 7, scope: !347)
!350 = !DILocation(line: 794, column: 10, scope: !347)
!351 = !DILocation(line: 795, column: 3, scope: !347)
!352 = !DILocation(line: 795, column: 9, scope: !347)
!353 = !DILocation(line: 795, column: 23, scope: !347)
!354 = !DILocation(line: 796, column: 6, scope: !347)
!355 = !DILocation(line: 797, column: 7, scope: !347)
!356 = !DILocation(line: 793, column: 2, scope: !357)
!357 = !DILexicalBlockFile(scope: !294, file: !128, discriminator: 4)
!358 = distinct !{!358, !336}
!359 = !DILocation(line: 799, column: 9, scope: !294)
!360 = !DILocation(line: 799, column: 2, scope: !294)
!361 = !DILocation(line: 800, column: 1, scope: !294)
!362 = distinct !DISubprogram(name: "zedc_inflateSaveBuffers", scope: !128, file: !128, line: 977, type: !363, isLocal: false, isDefinition: true, scopeLine: 978, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !287)
!363 = !DISubroutineType(types: !364)
!364 = !{!76, !365, !366}
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "zedc_streamp", file: !4, line: 347, baseType: !131)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!368 = !DILocalVariable(name: "strm", arg: 1, scope: !362, file: !128, line: 977, type: !365)
!369 = !DILocation(line: 977, column: 42, scope: !362)
!370 = !DILocalVariable(name: "prefix", arg: 2, scope: !362, file: !128, line: 977, type: !366)
!371 = !DILocation(line: 977, column: 60, scope: !362)
!372 = !DILocalVariable(name: "rc", scope: !362, file: !128, line: 979, type: !76)
!373 = !DILocation(line: 979, column: 6, scope: !362)
!374 = !DILocalVariable(name: "asiv", scope: !362, file: !128, line: 980, type: !30)
!375 = !DILocation(line: 980, column: 25, scope: !362)
!376 = !DILocalVariable(name: "cmd", scope: !362, file: !128, line: 981, type: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!378 = !DILocation(line: 981, column: 19, scope: !362)
!379 = !DILocalVariable(name: "fname", scope: !362, file: !128, line: 982, type: !380)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 2048, align: 8, elements: !203)
!381 = !DILocation(line: 982, column: 7, scope: !362)
!382 = !DILocation(line: 984, column: 7, scope: !383)
!383 = distinct !DILexicalBlock(scope: !362, file: !128, line: 984, column: 6)
!384 = !DILocation(line: 984, column: 6, scope: !362)
!385 = !DILocation(line: 985, column: 3, scope: !383)
!386 = !DILocation(line: 987, column: 9, scope: !362)
!387 = !DILocation(line: 987, column: 15, scope: !362)
!388 = !DILocation(line: 987, column: 6, scope: !362)
!389 = !DILocation(line: 988, column: 35, scope: !362)
!390 = !DILocation(line: 988, column: 40, scope: !362)
!391 = !DILocation(line: 988, column: 9, scope: !362)
!392 = !DILocation(line: 988, column: 7, scope: !362)
!393 = !DILocation(line: 991, column: 11, scope: !362)
!394 = !DILocation(line: 991, column: 55, scope: !362)
!395 = !DILocation(line: 991, column: 2, scope: !362)
!396 = !DILocation(line: 992, column: 26, scope: !362)
!397 = !DILocation(line: 993, column: 4, scope: !362)
!398 = !DILocation(line: 993, column: 10, scope: !362)
!399 = !DILocation(line: 993, column: 50, scope: !362)
!400 = !DILocation(line: 992, column: 33, scope: !362)
!401 = !DILocation(line: 994, column: 4, scope: !362)
!402 = !DILocation(line: 994, column: 10, scope: !362)
!403 = !DILocation(line: 994, column: 41, scope: !362)
!404 = !DILocation(line: 992, column: 7, scope: !362)
!405 = !DILocation(line: 992, column: 5, scope: !362)
!406 = !DILocation(line: 995, column: 6, scope: !407)
!407 = distinct !DILexicalBlock(scope: !362, file: !128, line: 995, column: 6)
!408 = !DILocation(line: 995, column: 9, scope: !407)
!409 = !DILocation(line: 995, column: 6, scope: !362)
!410 = !DILocation(line: 996, column: 10, scope: !407)
!411 = !DILocation(line: 996, column: 3, scope: !407)
!412 = !DILocation(line: 998, column: 11, scope: !362)
!413 = !DILocation(line: 998, column: 55, scope: !362)
!414 = !DILocation(line: 998, column: 2, scope: !362)
!415 = !DILocation(line: 999, column: 26, scope: !362)
!416 = !DILocation(line: 1000, column: 4, scope: !362)
!417 = !DILocation(line: 1000, column: 10, scope: !362)
!418 = !DILocation(line: 1000, column: 50, scope: !362)
!419 = !DILocation(line: 999, column: 33, scope: !362)
!420 = !DILocation(line: 1001, column: 4, scope: !362)
!421 = !DILocation(line: 1001, column: 10, scope: !362)
!422 = !DILocation(line: 1001, column: 41, scope: !362)
!423 = !DILocation(line: 999, column: 7, scope: !362)
!424 = !DILocation(line: 999, column: 5, scope: !362)
!425 = !DILocation(line: 1002, column: 6, scope: !426)
!426 = distinct !DILexicalBlock(scope: !362, file: !128, line: 1002, column: 6)
!427 = !DILocation(line: 1002, column: 9, scope: !426)
!428 = !DILocation(line: 1002, column: 6, scope: !362)
!429 = !DILocation(line: 1003, column: 10, scope: !426)
!430 = !DILocation(line: 1003, column: 3, scope: !426)
!431 = !DILocation(line: 1005, column: 11, scope: !362)
!432 = !DILocation(line: 1005, column: 55, scope: !362)
!433 = !DILocation(line: 1005, column: 2, scope: !362)
!434 = !DILocation(line: 1006, column: 26, scope: !362)
!435 = !DILocation(line: 1007, column: 4, scope: !362)
!436 = !DILocation(line: 1007, column: 10, scope: !362)
!437 = !DILocation(line: 1007, column: 50, scope: !362)
!438 = !DILocation(line: 1006, column: 33, scope: !362)
!439 = !DILocation(line: 1008, column: 4, scope: !362)
!440 = !DILocation(line: 1008, column: 10, scope: !362)
!441 = !DILocation(line: 1008, column: 41, scope: !362)
!442 = !DILocation(line: 1006, column: 7, scope: !362)
!443 = !DILocation(line: 1006, column: 5, scope: !362)
!444 = !DILocation(line: 1009, column: 6, scope: !445)
!445 = distinct !DILexicalBlock(scope: !362, file: !128, line: 1009, column: 6)
!446 = !DILocation(line: 1009, column: 9, scope: !445)
!447 = !DILocation(line: 1009, column: 6, scope: !362)
!448 = !DILocation(line: 1010, column: 10, scope: !445)
!449 = !DILocation(line: 1010, column: 3, scope: !445)
!450 = !DILocation(line: 1012, column: 11, scope: !362)
!451 = !DILocation(line: 1012, column: 56, scope: !362)
!452 = !DILocation(line: 1012, column: 2, scope: !362)
!453 = !DILocation(line: 1013, column: 26, scope: !362)
!454 = !DILocation(line: 1014, column: 4, scope: !362)
!455 = !DILocation(line: 1014, column: 10, scope: !362)
!456 = !DILocation(line: 1014, column: 50, scope: !362)
!457 = !DILocation(line: 1013, column: 33, scope: !362)
!458 = !DILocation(line: 1015, column: 4, scope: !362)
!459 = !DILocation(line: 1015, column: 10, scope: !362)
!460 = !DILocation(line: 1015, column: 41, scope: !362)
!461 = !DILocation(line: 1013, column: 7, scope: !362)
!462 = !DILocation(line: 1013, column: 5, scope: !362)
!463 = !DILocation(line: 1016, column: 6, scope: !464)
!464 = distinct !DILexicalBlock(scope: !362, file: !128, line: 1016, column: 6)
!465 = !DILocation(line: 1016, column: 9, scope: !464)
!466 = !DILocation(line: 1016, column: 6, scope: !362)
!467 = !DILocation(line: 1017, column: 10, scope: !464)
!468 = !DILocation(line: 1017, column: 3, scope: !464)
!469 = !DILocation(line: 1019, column: 11, scope: !362)
!470 = !DILocation(line: 1019, column: 59, scope: !362)
!471 = !DILocation(line: 1019, column: 2, scope: !362)
!472 = !DILocation(line: 1020, column: 26, scope: !362)
!473 = !DILocation(line: 1021, column: 4, scope: !362)
!474 = !DILocation(line: 1021, column: 10, scope: !362)
!475 = !DILocation(line: 1021, column: 50, scope: !362)
!476 = !DILocation(line: 1020, column: 33, scope: !362)
!477 = !DILocation(line: 1022, column: 4, scope: !362)
!478 = !DILocation(line: 1022, column: 10, scope: !362)
!479 = !DILocation(line: 1022, column: 41, scope: !362)
!480 = !DILocation(line: 1020, column: 7, scope: !362)
!481 = !DILocation(line: 1020, column: 5, scope: !362)
!482 = !DILocation(line: 1023, column: 6, scope: !483)
!483 = distinct !DILexicalBlock(scope: !362, file: !128, line: 1023, column: 6)
!484 = !DILocation(line: 1023, column: 9, scope: !483)
!485 = !DILocation(line: 1023, column: 6, scope: !362)
!486 = !DILocation(line: 1024, column: 10, scope: !483)
!487 = !DILocation(line: 1024, column: 3, scope: !483)
!488 = !DILocation(line: 1026, column: 2, scope: !362)
!489 = !DILocation(line: 1027, column: 1, scope: !362)
!490 = distinct !DISubprogram(name: "__save_buf_to_file", scope: !128, file: !128, line: 948, type: !491, isLocal: true, isDefinition: true, scopeLine: 949, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !287)
!491 = !DISubroutineType(types: !492)
!492 = !{!76, !366, !142, !76}
!493 = !DILocalVariable(name: "fname", arg: 1, scope: !490, file: !128, line: 948, type: !366)
!494 = !DILocation(line: 948, column: 43, scope: !490)
!495 = !DILocalVariable(name: "buff", arg: 2, scope: !490, file: !128, line: 948, type: !142)
!496 = !DILocation(line: 948, column: 65, scope: !490)
!497 = !DILocalVariable(name: "len", arg: 3, scope: !490, file: !128, line: 948, type: !76)
!498 = !DILocation(line: 948, column: 75, scope: !490)
!499 = !DILocalVariable(name: "rc", scope: !490, file: !128, line: 950, type: !76)
!500 = !DILocation(line: 950, column: 6, scope: !490)
!501 = !DILocalVariable(name: "fp", scope: !490, file: !128, line: 951, type: !502)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !504, line: 48, baseType: !505)
!504 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !506, line: 241, size: 1728, align: 64, elements: !507)
!506 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop")
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !528, !529, !530, !531, !534, !535, !537, !541, !544, !546, !547, !548, !549, !550, !553, !554}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !505, file: !506, line: 242, baseType: !76, size: 32, align: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !505, file: !506, line: 247, baseType: !249, size: 64, align: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !505, file: !506, line: 248, baseType: !249, size: 64, align: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !505, file: !506, line: 249, baseType: !249, size: 64, align: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !505, file: !506, line: 250, baseType: !249, size: 64, align: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !505, file: !506, line: 251, baseType: !249, size: 64, align: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !505, file: !506, line: 252, baseType: !249, size: 64, align: 64, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !505, file: !506, line: 253, baseType: !249, size: 64, align: 64, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !505, file: !506, line: 254, baseType: !249, size: 64, align: 64, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !505, file: !506, line: 256, baseType: !249, size: 64, align: 64, offset: 576)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !505, file: !506, line: 257, baseType: !249, size: 64, align: 64, offset: 640)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !505, file: !506, line: 258, baseType: !249, size: 64, align: 64, offset: 704)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !505, file: !506, line: 260, baseType: !521, size: 64, align: 64, offset: 768)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !506, line: 156, size: 192, align: 64, elements: !523)
!523 = !{!524, !525, !527}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !522, file: !506, line: 157, baseType: !521, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !522, file: !506, line: 158, baseType: !526, size: 64, align: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !522, file: !506, line: 162, baseType: !76, size: 32, align: 32, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !505, file: !506, line: 262, baseType: !526, size: 64, align: 64, offset: 832)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !505, file: !506, line: 264, baseType: !76, size: 32, align: 32, offset: 896)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !505, file: !506, line: 268, baseType: !76, size: 32, align: 32, offset: 928)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !505, file: !506, line: 270, baseType: !532, size: 64, align: 64, offset: 960)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !116, line: 131, baseType: !533)
!533 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !505, file: !506, line: 274, baseType: !52, size: 16, align: 16, offset: 1024)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !505, file: !506, line: 275, baseType: !536, size: 8, align: 8, offset: 1040)
!536 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !505, file: !506, line: 276, baseType: !538, size: 8, align: 8, offset: 1048)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 8, align: 8, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 1)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !505, file: !506, line: 280, baseType: !542, size: 64, align: 64, offset: 1088)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !506, line: 150, baseType: null)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !505, file: !506, line: 289, baseType: !545, size: 64, align: 64, offset: 1152)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !116, line: 132, baseType: !533)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !505, file: !506, line: 297, baseType: !62, size: 64, align: 64, offset: 1216)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !505, file: !506, line: 298, baseType: !62, size: 64, align: 64, offset: 1280)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !505, file: !506, line: 299, baseType: !62, size: 64, align: 64, offset: 1344)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !505, file: !506, line: 300, baseType: !62, size: 64, align: 64, offset: 1408)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !505, file: !506, line: 302, baseType: !551, size: 64, align: 64, offset: 1472)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !552, line: 216, baseType: !37)
!552 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop")
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !505, file: !506, line: 303, baseType: !76, size: 32, align: 32, offset: 1536)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !505, file: !506, line: 305, baseType: !555, size: 160, align: 8, offset: 1568)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 160, align: 8, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 20)
!558 = !DILocation(line: 951, column: 8, scope: !490)
!559 = !DILocation(line: 953, column: 6, scope: !560)
!560 = distinct !DILexicalBlock(scope: !490, file: !128, line: 953, column: 6)
!561 = !DILocation(line: 953, column: 11, scope: !560)
!562 = !DILocation(line: 953, column: 6, scope: !490)
!563 = !DILocation(line: 954, column: 3, scope: !560)
!564 = !DILocation(line: 956, column: 6, scope: !565)
!565 = distinct !DILexicalBlock(scope: !490, file: !128, line: 956, column: 6)
!566 = !DILocation(line: 956, column: 10, scope: !565)
!567 = !DILocation(line: 956, column: 6, scope: !490)
!568 = !DILocation(line: 957, column: 3, scope: !565)
!569 = !DILocation(line: 959, column: 2, scope: !490)
!570 = distinct !{!570, !569}
!571 = !DILocation(line: 959, column: 11, scope: !572)
!572 = !DILexicalBlockFile(scope: !573, file: !128, discriminator: 1)
!573 = distinct !DILexicalBlock(scope: !574, file: !128, line: 959, column: 11)
!574 = distinct !DILexicalBlock(scope: !490, file: !128, line: 959, column: 5)
!575 = !DILocation(line: 959, column: 29, scope: !576)
!576 = !DILexicalBlockFile(scope: !573, file: !128, discriminator: 2)
!577 = !DILocation(line: 959, column: 98, scope: !576)
!578 = !DILocation(line: 959, column: 108, scope: !579)
!579 = !DILexicalBlockFile(scope: !576, file: !128, discriminator: 4)
!580 = !DILocation(line: 959, column: 136, scope: !576)
!581 = !DILocation(line: 959, column: 143, scope: !576)
!582 = !DILocation(line: 959, column: 21, scope: !583)
!583 = !DILexicalBlockFile(scope: !576, file: !128, discriminator: 5)
!584 = !DILocation(line: 959, column: 21, scope: !576)
!585 = !DILocation(line: 959, column: 149, scope: !586)
!586 = !DILexicalBlockFile(scope: !574, file: !128, discriminator: 3)
!587 = !DILocation(line: 961, column: 13, scope: !490)
!588 = !DILocation(line: 961, column: 7, scope: !490)
!589 = !DILocation(line: 961, column: 5, scope: !490)
!590 = !DILocation(line: 962, column: 7, scope: !591)
!591 = distinct !DILexicalBlock(scope: !490, file: !128, line: 962, column: 6)
!592 = !DILocation(line: 962, column: 6, scope: !490)
!593 = !DILocation(line: 963, column: 3, scope: !594)
!594 = distinct !DILexicalBlock(scope: !591, file: !128, line: 962, column: 11)
!595 = distinct !{!595, !593}
!596 = !DILocation(line: 963, column: 12, scope: !597)
!597 = !DILexicalBlockFile(scope: !598, file: !128, discriminator: 1)
!598 = distinct !DILexicalBlock(scope: !599, file: !128, line: 963, column: 12)
!599 = distinct !DILexicalBlock(scope: !594, file: !128, line: 963, column: 6)
!600 = !DILocation(line: 963, column: 30, scope: !601)
!601 = !DILexicalBlockFile(scope: !598, file: !128, discriminator: 2)
!602 = !DILocation(line: 963, column: 96, scope: !601)
!603 = !DILocation(line: 963, column: 106, scope: !604)
!604 = !DILexicalBlockFile(scope: !601, file: !128, discriminator: 4)
!605 = !DILocation(line: 963, column: 134, scope: !601)
!606 = !DILocation(line: 963, column: 4, scope: !607)
!607 = !DILexicalBlockFile(scope: !601, file: !128, discriminator: 5)
!608 = !DILocation(line: 963, column: 3, scope: !601)
!609 = !DILocation(line: 963, column: 141, scope: !610)
!610 = !DILexicalBlockFile(scope: !601, file: !128, discriminator: 6)
!611 = !DILocation(line: 963, column: 22, scope: !612)
!612 = !DILexicalBlockFile(scope: !601, file: !128, discriminator: 7)
!613 = !DILocation(line: 963, column: 22, scope: !601)
!614 = !DILocation(line: 963, column: 6, scope: !615)
!615 = !DILexicalBlockFile(scope: !599, file: !128, discriminator: 3)
!616 = !DILocation(line: 964, column: 3, scope: !594)
!617 = !DILocation(line: 966, column: 14, scope: !490)
!618 = !DILocation(line: 966, column: 20, scope: !490)
!619 = !DILocation(line: 966, column: 28, scope: !490)
