; ModuleID = '/home/lichi/Desktop/genwqe/[task]lib--__libzHW.o/[inter]lib--libzHW.o.i'
source_filename = "/home/lichi/Desktop/genwqe/[task]lib--__libzHW.o/[inter]lib--libzHW.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.err_lookup = type { i32, i8* }
%struct.zedc_dev_t = type { i32, i32, %struct.card_dev_t*, i32, i32, i32 }
%struct.card_dev_t = type opaque
%struct.ddcb_cmd = type { i64, i64, i8, i8, i8, i8, i16, i16, i16, i16, i32, i64, i64, i64, i64, [64 x i8], %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i64, [96 x i8] }
%struct.zedc_stream_s = type { i32, i32, i32, i32, i32, i32, i32, i8*, i32, i64, i8*, i32, i64, i32, i32, i8*, %struct.ddcb_cmd, i16, i16, i32, i32, i32, %struct.zedc_fifo, %struct.zedc_fifo, i32, i16, i32, i32, i8, i32, i32, i32, i32, i32, %struct.zedc_wsp*, i32, [3 x i32], i32, i32, i32, i32, %struct.gzedc_header_s*, i32, i16, i8, i8, i32, i32, i8, i8, i32, i16, i8, i16, i32, i32, i32, i64, i32, i32, i16, i8, i16, i32, i32, [18 x i8], i16, i32, i32, [18 x i8] }
%struct.zedc_fifo = type { i32, i32, [256 x i8] }
%struct.zedc_wsp = type { [2 x [32784 x i8]], [512 x i8] }

!164 = !DIEnumerator(name: "_SC_XOPEN_REALTIME_THREADS", value: 131)
!165 = !DIEnumerator(name: "_SC_ADVISORY_INFO", value: 132)
!166 = !DIEnumerator(name: "_SC_BARRIERS", value: 133)
!167 = !DIEnumerator(name: "_SC_BASE", value: 134)
!168 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135)
!169 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136)
!170 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137)
!171 = !DIEnumerator(name: "_SC_CPUTIME", value: 138)
!172 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139)
!173 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!174 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!175 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!176 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!177 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!178 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!179 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!180 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!181 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!182 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!183 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!184 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!185 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!186 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!187 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!188 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!189 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!190 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!191 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!192 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!193 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!194 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!195 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!196 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!197 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!198 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!199 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!200 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!201 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!202 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!203 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!204 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!205 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!206 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!207 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!208 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!209 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!210 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!211 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!212 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!213 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!214 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!215 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!216 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!217 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!218 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!219 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!220 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!221 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!222 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!223 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!224 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!225 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!226 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!227 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!228 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!229 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!230 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!231 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!232 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!233 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!234 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!235 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!236 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!237 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!238 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!239 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!240 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!241 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!242 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!243 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!244 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!245 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!246 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!247 = !{!248, !280, !282, !284, !285, !286, !287, !289, !290, !313, !333, !359, !360, !376}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_asiv_infl", file: !250, line: 110, size: 768, align: 8, elements: !251)
!250 = !DIFile(filename: "../include/deflate_ddcb.h", directory: "/home/lichi/Desktop")
!251 = !{!252, !256, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !271, !274, !275, !276, !277, !278, !279}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "in_buff", scope: !249, file: !250, line: 111, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !254, line: 55, baseType: !255)
!254 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop")
!255 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "in_buff_len", scope: !249, file: !250, line: 112, baseType: !257, size: 32, align: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !254, line: 51, baseType: !258)
!258 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "in_crc32", scope: !249, file: !250, line: 113, baseType: !257, size: 32, align: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "out_buff", scope: !249, file: !250, line: 115, baseType: !253, size: 64, align: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "out_buff_len", scope: !249, file: !250, line: 116, baseType: !257, size: 32, align: 32, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "in_adler32", scope: !249, file: !250, line: 117, baseType: !257, size: 32, align: 32, offset: 224)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "in_dict", scope: !249, file: !250, line: 119, baseType: !253, size: 64, align: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "in_dict_len", scope: !249, file: !250, line: 120, baseType: !257, size: 32, align: 32, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_0", scope: !249, file: !250, line: 121, baseType: !257, size: 32, align: 32, offset: 352)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "inp_scratch", scope: !249, file: !250, line: 123, baseType: !253, size: 64, align: 64, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "in_scratch_len", scope: !249, file: !250, line: 124, baseType: !257, size: 32, align: 32, offset: 448)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "in_hdr_bits", scope: !249, file: !250, line: 125, baseType: !269, size: 16, align: 16, offset: 480)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !254, line: 49, baseType: !270)
!270 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_ib", scope: !249, file: !250, line: 126, baseType: !272, size: 8, align: 8, offset: 496)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !254, line: 48, baseType: !273)
!273 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "scratch_ib", scope: !249, file: !250, line: 127, baseType: !272, size: 8, align: 8, offset: 504)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict", scope: !249, file: !250, line: 129, baseType: !253, size: 64, align: 64, offset: 512)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict_len", scope: !249, file: !250, line: 130, baseType: !257, size: 32, align: 32, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_1", scope: !249, file: !250, line: 131, baseType: !257, size: 32, align: 32, offset: 608)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_2", scope: !249, file: !250, line: 133, baseType: !253, size: 64, align: 64, offset: 640)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_3", scope: !249, file: !250, line: 134, baseType: !253, size: 64, align: 64, offset: 704)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !281, line: 26, baseType: !258)
!281 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop")
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !283, line: 30, baseType: !280)
!283 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/lichi/Desktop")
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !281, line: 23, baseType: !270)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !283, line: 28, baseType: !284)
!286 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !281, line: 30, baseType: !288)
!288 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be64", file: !283, line: 32, baseType: !287)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_asiv_defl", file: !250, line: 179, size: 768, align: 8, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !312}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "in_buff", scope: !291, file: !250, line: 180, baseType: !253, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "in_buff_len", scope: !291, file: !250, line: 181, baseType: !257, size: 32, align: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "in_crc32", scope: !291, file: !250, line: 182, baseType: !257, size: 32, align: 32, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "out_buff", scope: !291, file: !250, line: 184, baseType: !253, size: 64, align: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "out_buff_len", scope: !291, file: !250, line: 185, baseType: !257, size: 32, align: 32, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "in_adler32", scope: !291, file: !250, line: 186, baseType: !257, size: 32, align: 32, offset: 224)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "in_dict", scope: !291, file: !250, line: 188, baseType: !253, size: 64, align: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "in_dict_len", scope: !291, file: !250, line: 189, baseType: !257, size: 32, align: 32, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_0", scope: !291, file: !250, line: 190, baseType: !257, size: 32, align: 32, offset: 352)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_1", scope: !291, file: !250, line: 192, baseType: !253, size: 64, align: 64, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_2", scope: !291, file: !250, line: 193, baseType: !253, size: 64, align: 64, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict", scope: !291, file: !250, line: 195, baseType: !253, size: 64, align: 64, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict_len", scope: !291, file: !250, line: 196, baseType: !257, size: 32, align: 32, offset: 576)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_3", scope: !291, file: !250, line: 197, baseType: !257, size: 32, align: 32, offset: 608)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_4", scope: !291, file: !250, line: 199, baseType: !253, size: 64, align: 64, offset: 640)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ibits", scope: !291, file: !250, line: 201, baseType: !309, size: 56, align: 8, offset: 704)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 56, align: 8, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 7)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "inumbits", scope: !291, file: !250, line: 202, baseType: !272, size: 8, align: 8, offset: 760)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_asv_defl", file: !250, line: 206, size: 512, align: 8, elements: !315)
!315 = !{!316, !317, !321, !322, !323, !324, !325, !326, !327, !331, !332}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict_used", scope: !314, file: !250, line: 207, baseType: !269, size: 16, align: 16)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "resrv_1", scope: !314, file: !250, line: 208, baseType: !318, size: 40, align: 8, offset: 16)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 40, align: 8, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 5)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "onumbits", scope: !314, file: !250, line: 209, baseType: !272, size: 8, align: 8, offset: 56)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "resrv_2", scope: !314, file: !250, line: 210, baseType: !253, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "out_crc32", scope: !314, file: !250, line: 212, baseType: !257, size: 32, align: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "out_adler32", scope: !314, file: !250, line: 213, baseType: !257, size: 32, align: 32, offset: 160)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "inp_processed", scope: !314, file: !250, line: 214, baseType: !257, size: 32, align: 32, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "outp_returned", scope: !314, file: !250, line: 215, baseType: !257, size: 32, align: 32, offset: 224)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "obits", scope: !314, file: !250, line: 217, baseType: !328, size: 192, align: 8, offset: 256)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 192, align: 8, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 24)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict_offs", scope: !314, file: !250, line: 218, baseType: !272, size: 8, align: 8, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "obits_extra", scope: !314, file: !250, line: 219, baseType: !309, size: 56, align: 8, offset: 456)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_asv_infl", file: !250, line: 149, size: 512, align: 8, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !354, !355, !356, !357, !358}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict_used", scope: !334, file: !250, line: 150, baseType: !269, size: 16, align: 16)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "copyblock_len", scope: !334, file: !250, line: 151, baseType: !269, size: 16, align: 16, offset: 16)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_84", scope: !334, file: !250, line: 152, baseType: !272, size: 8, align: 8, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "infl_stat", scope: !334, file: !250, line: 153, baseType: !272, size: 8, align: 8, offset: 40)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_86", scope: !334, file: !250, line: 154, baseType: !272, size: 8, align: 8, offset: 48)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "proc_bits", scope: !334, file: !250, line: 155, baseType: !272, size: 8, align: 8, offset: 56)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_start", scope: !334, file: !250, line: 157, baseType: !257, size: 32, align: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_8c", scope: !334, file: !250, line: 158, baseType: !272, size: 8, align: 8, offset: 96)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_start_bits", scope: !334, file: !250, line: 159, baseType: !272, size: 8, align: 8, offset: 104)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "out_hdr_bits", scope: !334, file: !250, line: 160, baseType: !269, size: 16, align: 16, offset: 112)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "out_crc32", scope: !334, file: !250, line: 162, baseType: !257, size: 32, align: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "out_adler32", scope: !334, file: !250, line: 163, baseType: !257, size: 32, align: 32, offset: 160)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "inp_processed", scope: !334, file: !250, line: 165, baseType: !257, size: 32, align: 32, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "outp_returned", scope: !334, file: !250, line: 166, baseType: !257, size: 32, align: 32, offset: 224)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_a0", scope: !334, file: !250, line: 168, baseType: !351, size: 192, align: 64, offset: 256)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 192, align: 64, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 3)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict_offs", scope: !334, file: !250, line: 170, baseType: !272, size: 8, align: 8, offset: 448)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_b9", scope: !334, file: !250, line: 171, baseType: !272, size: 8, align: 8, offset: 456)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "obytes_in_dict", scope: !334, file: !250, line: 172, baseType: !269, size: 16, align: 16, offset: 464)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_bc", scope: !334, file: !250, line: 173, baseType: !269, size: 16, align: 16, offset: 480)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd_be", scope: !334, file: !250, line: 174, baseType: !269, size: 16, align: 16, offset: 496)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "zedc_handle_t", file: !4, line: 354, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_dev_t", file: !363, line: 82, size: 256, align: 64, elements: !364)
!363 = !DIFile(filename: "hw_defs.h", directory: "/home/lichi/Desktop")
!364 = !{!365, !367, !368, !373, !374, !375}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !362, file: !363, line: 83, baseType: !366, size: 32, align: 32)
!366 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "zedc_rc", scope: !362, file: !363, line: 84, baseType: !366, size: 32, align: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "card", scope: !362, file: !363, line: 87, baseType: !369, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "accel_t", file: !370, line: 198, baseType: !371)
!370 = !DIFile(filename: "../include/libddcb.h", directory: "/home/lichi/Desktop")
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "card_dev_t", file: !370, line: 198, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "card_rc", scope: !362, file: !363, line: 88, baseType: !366, size: 32, align: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "card_errno", scope: !362, file: !363, line: 89, baseType: !366, size: 32, align: 32, offset: 160)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "collect_debug_data", scope: !362, file: !363, line: 90, baseType: !366, size: 32, align: 32, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !377, line: 98, baseType: !378)
!377 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop")
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !379, line: 133, baseType: !366)
!379 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop")
!380 = !{!381, !441, !442, !443}
!381 = distinct !DIGlobalVariable(name: "zedc_log", scope: !0, file: !382, line: 41, type: !383, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @zedc_log)
!382 = !DIFile(filename: "libzHW.c", directory: "/home/lichi/Desktop")
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !385, line: 48, baseType: !386)
!385 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop")
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !387, line: 241, size: 1728, align: 64, elements: !388)
!387 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop")
!388 = !{!389, !390, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !411, !412, !413, !414, !417, !418, !420, !424, !427, !429, !430, !431, !432, !433, !436, !437}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !386, file: !387, line: 242, baseType: !366, size: 32, align: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !386, file: !387, line: 247, baseType: !391, size: 64, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !386, file: !387, line: 248, baseType: !391, size: 64, align: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !386, file: !387, line: 249, baseType: !391, size: 64, align: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !386, file: !387, line: 250, baseType: !391, size: 64, align: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !386, file: !387, line: 251, baseType: !391, size: 64, align: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !386, file: !387, line: 252, baseType: !391, size: 64, align: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !386, file: !387, line: 253, baseType: !391, size: 64, align: 64, offset: 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !386, file: !387, line: 254, baseType: !391, size: 64, align: 64, offset: 512)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !386, file: !387, line: 256, baseType: !391, size: 64, align: 64, offset: 576)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !386, file: !387, line: 257, baseType: !391, size: 64, align: 64, offset: 640)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !386, file: !387, line: 258, baseType: !391, size: 64, align: 64, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !386, file: !387, line: 260, baseType: !404, size: 64, align: 64, offset: 768)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !387, line: 156, size: 192, align: 64, elements: !406)
!406 = !{!407, !408, !410}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !405, file: !387, line: 157, baseType: !404, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !405, file: !387, line: 158, baseType: !409, size: 64, align: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !405, file: !387, line: 162, baseType: !366, size: 32, align: 32, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !386, file: !387, line: 262, baseType: !409, size: 64, align: 64, offset: 832)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !386, file: !387, line: 264, baseType: !366, size: 32, align: 32, offset: 896)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !386, file: !387, line: 268, baseType: !366, size: 32, align: 32, offset: 928)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !386, file: !387, line: 270, baseType: !415, size: 64, align: 64, offset: 960)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !379, line: 131, baseType: !416)
!416 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !386, file: !387, line: 274, baseType: !270, size: 16, align: 16, offset: 1024)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !386, file: !387, line: 275, baseType: !419, size: 8, align: 8, offset: 1040)
!419 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !386, file: !387, line: 276, baseType: !421, size: 8, align: 8, offset: 1048)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 8, align: 8, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 1)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !386, file: !387, line: 280, baseType: !425, size: 64, align: 64, offset: 1088)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !387, line: 150, baseType: null)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !386, file: !387, line: 289, baseType: !428, size: 64, align: 64, offset: 1152)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !379, line: 132, baseType: !416)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !386, file: !387, line: 297, baseType: !359, size: 64, align: 64, offset: 1216)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !386, file: !387, line: 298, baseType: !359, size: 64, align: 64, offset: 1280)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !386, file: !387, line: 299, baseType: !359, size: 64, align: 64, offset: 1344)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !386, file: !387, line: 300, baseType: !359, size: 64, align: 64, offset: 1408)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !386, file: !387, line: 302, baseType: !434, size: 64, align: 64, offset: 1472)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !435, line: 216, baseType: !255)
!435 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop")
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !386, file: !387, line: 303, baseType: !366, size: 32, align: 32, offset: 1536)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !386, file: !387, line: 305, baseType: !438, size: 160, align: 8, offset: 1568)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 160, align: 8, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 20)
!441 = distinct !DIGlobalVariable(name: "zedc_dbg", scope: !0, file: !382, line: 42, type: !366, isLocal: false, isDefinition: true, variable: i32* @zedc_dbg)
!442 = distinct !DIGlobalVariable(name: "zedc_nerr", scope: !0, file: !382, line: 76, type: !366, isLocal: true, isDefinition: true, variable: i32* @zedc_nerr)
!443 = distinct !DIGlobalVariable(name: "zedc_errlist", scope: !0, file: !382, line: 50, type: !444, isLocal: true, isDefinition: true, variable: [19 x %struct.err_lookup]* @zedc_errlist)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 2432, align: 64, elements: !451)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "err_lookup", file: !382, line: 45, size: 128, align: 64, elements: !446)
!446 = !{!447, !448}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !445, file: !382, line: 46, baseType: !366, size: 32, align: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !445, file: !382, line: 47, baseType: !449, size: 64, align: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!451 = !{!452}
!452 = !DISubrange(count: 19)
!453 = !{i32 2, !"Dwarf Version", i32 4}
!454 = !{i32 2, !"Debug Info Version", i32 3}
!455 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!456 = distinct !DISubprogram(name: "zedc_Version", scope: !382, file: !382, line: 78, type: !457, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !459)
!457 = !DISubroutineType(types: !458)
!458 = !{!449}
!459 = !{}
!460 = !DILocation(line: 80, column: 2, scope: !456)
!461 = distinct !DISubprogram(name: "zedc_set_logfile", scope: !382, file: !382, line: 83, type: !462, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !459)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !383}
!464 = !DILocalVariable(name: "logfile", arg: 1, scope: !461, file: !382, line: 83, type: !383)
!465 = !DIExpression()
!466 = !DILocation(line: 83, column: 29, scope: !461)
!467 = !DILocation(line: 85, column: 14, scope: !461)
!468 = !DILocation(line: 85, column: 12, scope: !461)
!469 = !DILocation(line: 86, column: 1, scope: !461)
!470 = distinct !DISubprogram(name: "zedc_clearerr", scope: !382, file: !382, line: 88, type: !471, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !459)
!471 = !DISubroutineType(types: !472)
!472 = !{!366, !360}
!473 = !DILocalVariable(name: "zedc", arg: 1, scope: !470, file: !382, line: 88, type: !360)
!474 = !DILocation(line: 88, column: 33, scope: !470)
!475 = !DILocation(line: 90, column: 7, scope: !476)
!476 = distinct !DILexicalBlock(scope: !470, file: !382, line: 90, column: 6)
!477 = !DILocation(line: 90, column: 6, scope: !470)
!478 = !DILocation(line: 91, column: 3, scope: !476)
!479 = !DILocation(line: 93, column: 2, scope: !470)
!480 = !DILocation(line: 93, column: 8, scope: !470)
!481 = !DILocation(line: 93, column: 16, scope: !470)
!482 = !DILocation(line: 94, column: 2, scope: !470)
!483 = !DILocation(line: 94, column: 8, scope: !470)
!484 = !DILocation(line: 94, column: 16, scope: !470)
!485 = !DILocation(line: 96, column: 2, scope: !470)
!486 = !DILocation(line: 97, column: 1, scope: !470)
!487 = distinct !DISubprogram(name: "zedc_strerror", scope: !382, file: !382, line: 105, type: !488, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !459)
!488 = !DISubroutineType(types: !489)
!489 = !{!449, !366}
!490 = !DILocalVariable(name: "errnum", arg: 1, scope: !487, file: !382, line: 105, type: !366)
!491 = !DILocation(line: 105, column: 31, scope: !487)
!492 = !DILocalVariable(name: "i", scope: !487, file: !382, line: 107, type: !366)
!493 = !DILocation(line: 107, column: 6, scope: !487)
!494 = !DILocation(line: 109, column: 4, scope: !487)
!495 = !DILocation(line: 110, column: 2, scope: !487)
!496 = !DILocation(line: 110, column: 9, scope: !497)
!497 = !DILexicalBlockFile(scope: !487, file: !382, discriminator: 1)
!498 = !DILocation(line: 110, column: 13, scope: !497)
!499 = !DILocation(line: 110, column: 11, scope: !497)
!500 = !DILocation(line: 110, column: 2, scope: !497)
!501 = !DILocation(line: 111, column: 7, scope: !502)
!502 = distinct !DILexicalBlock(scope: !503, file: !382, line: 111, column: 7)
!503 = distinct !DILexicalBlock(scope: !487, file: !382, line: 110, column: 24)
!504 = !DILocation(line: 111, column: 30, scope: !502)
!505 = !DILocation(line: 111, column: 17, scope: !502)
!506 = !DILocation(line: 111, column: 33, scope: !502)
!507 = !DILocation(line: 111, column: 14, scope: !502)
!508 = !DILocation(line: 111, column: 7, scope: !503)
!509 = !DILocation(line: 112, column: 24, scope: !502)
!510 = !DILocation(line: 112, column: 11, scope: !502)
!511 = !DILocation(line: 112, column: 27, scope: !502)
!512 = !DILocation(line: 112, column: 4, scope: !502)
!513 = !DILocation(line: 113, column: 4, scope: !503)
!514 = !DILocation(line: 110, column: 2, scope: !515)
!515 = !DILexicalBlockFile(scope: !487, file: !382, discriminator: 2)
!516 = distinct !{!516, !495}
!517 = !DILocation(line: 115, column: 2, scope: !487)
!518 = !DILocation(line: 116, column: 1, scope: !487)
!519 = distinct !DISubprogram(name: "zedc_carderr", scope: !382, file: !382, line: 118, type: !471, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !459)
!520 = !DILocalVariable(name: "zedc", arg: 1, scope: !519, file: !382, line: 118, type: !360)
!521 = !DILocation(line: 118, column: 32, scope: !519)
!522 = !DILocation(line: 120, column: 7, scope: !523)
!523 = distinct !DILexicalBlock(scope: !519, file: !382, line: 120, column: 6)
!524 = !DILocation(line: 120, column: 6, scope: !519)
!525 = !DILocation(line: 121, column: 3, scope: !523)
!526 = !DILocation(line: 123, column: 9, scope: !519)
!527 = !DILocation(line: 123, column: 15, scope: !519)
!528 = !DILocation(line: 123, column: 2, scope: !519)
!529 = !DILocation(line: 124, column: 1, scope: !519)
!530 = distinct !DISubprogram(name: "zedc_liberr", scope: !382, file: !382, line: 126, type: !471, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !459)
!531 = !DILocalVariable(name: "zedc", arg: 1, scope: !530, file: !382, line: 126, type: !360)
!532 = !DILocation(line: 126, column: 31, scope: !530)
!533 = !DILocation(line: 128, column: 7, scope: !534)
!534 = distinct !DILexicalBlock(scope: !530, file: !382, line: 128, column: 6)
!535 = !DILocation(line: 128, column: 6, scope: !530)
!536 = !DILocation(line: 129, column: 3, scope: !534)
!537 = !DILocation(line: 131, column: 9, scope: !530)
!538 = !DILocation(line: 131, column: 15, scope: !530)
!539 = !DILocation(line: 131, column: 2, scope: !530)
!540 = !DILocation(line: 132, column: 1, scope: !530)
!541 = distinct !DISubprogram(name: "zedc_last_cmd", scope: !382, file: !382, line: 134, type: !542, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !459)
!542 = !DISubroutineType(types: !543)
!543 = !{!544, !582}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ddcb_cmd", file: !370, line: 154, size: 1856, align: 64, elements: !546)
!546 = !{!547, !548, !549, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !567}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "next_addr", scope: !545, file: !370, line: 155, baseType: !287, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !545, file: !370, line: 156, baseType: !287, size: 64, align: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "acfunc", scope: !545, file: !370, line: 158, baseType: !550, size: 8, align: 8, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !281, line: 20, baseType: !273)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !545, file: !370, line: 159, baseType: !550, size: 8, align: 8, offset: 136)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "asiv_length", scope: !545, file: !370, line: 160, baseType: !550, size: 8, align: 8, offset: 144)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "asv_length", scope: !545, file: !370, line: 161, baseType: !550, size: 8, align: 8, offset: 152)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "cmdopts", scope: !545, file: !370, line: 162, baseType: !284, size: 16, align: 16, offset: 160)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "retc", scope: !545, file: !370, line: 163, baseType: !284, size: 16, align: 16, offset: 176)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "attn", scope: !545, file: !370, line: 165, baseType: !284, size: 16, align: 16, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "vcrc", scope: !545, file: !370, line: 166, baseType: !284, size: 16, align: 16, offset: 208)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !545, file: !370, line: 167, baseType: !280, size: 32, align: 32, offset: 224)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "deque_ts", scope: !545, file: !370, line: 169, baseType: !287, size: 64, align: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "cmplt_ts", scope: !545, file: !370, line: 170, baseType: !287, size: 64, align: 64, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "disp_ts", scope: !545, file: !370, line: 171, baseType: !287, size: 64, align: 64, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ddata_addr", scope: !545, file: !370, line: 173, baseType: !287, size: 64, align: 64, offset: 448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "asv", scope: !545, file: !370, line: 175, baseType: !564, size: 512, align: 8, offset: 512)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 512, align: 8, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, scope: !545, file: !370, line: 177, baseType: !568, size: 832, align: 64, offset: 1024)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !545, file: !370, line: 177, size: 832, align: 64, elements: !569)
!569 = !{!570, !578}
!570 = !DIDerivedType(tag: DW_TAG_member, scope: !568, file: !370, line: 179, baseType: !571, size: 832, align: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !568, file: !370, line: 179, size: 832, align: 64, elements: !572)
!572 = !{!573, !574}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ats", scope: !571, file: !370, line: 180, baseType: !287, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "asiv", scope: !571, file: !370, line: 181, baseType: !575, size: 768, align: 8, offset: 64)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 768, align: 8, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 96)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__asiv", scope: !568, file: !370, line: 184, baseType: !579, size: 832, align: 8)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 832, align: 8, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 104)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64, align: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_stream_s", file: !4, line: 218, size: 8704, align: 64, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !595, !596, !597, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !620, !621, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !645, !646, !648, !649, !650, !651, !652, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !696, !697, !698, !699}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !583, file: !4, line: 220, baseType: !366, size: 32, align: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !583, file: !4, line: 221, baseType: !366, size: 32, align: 32, offset: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "windowBits", scope: !583, file: !4, line: 222, baseType: !366, size: 32, align: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "memLevel", scope: !583, file: !4, line: 227, baseType: !366, size: 32, align: 32, offset: 96)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !583, file: !4, line: 228, baseType: !366, size: 32, align: 32, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !583, file: !4, line: 229, baseType: !366, size: 32, align: 32, offset: 160)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !583, file: !4, line: 230, baseType: !366, size: 32, align: 32, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !583, file: !4, line: 233, baseType: !593, size: 64, align: 64, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !583, file: !4, line: 234, baseType: !258, size: 32, align: 32, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !583, file: !4, line: 235, baseType: !255, size: 64, align: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !583, file: !4, line: 237, baseType: !598, size: 64, align: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !583, file: !4, line: 238, baseType: !258, size: 32, align: 32, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !583, file: !4, line: 239, baseType: !255, size: 64, align: 64, offset: 576)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !583, file: !4, line: 241, baseType: !257, size: 32, align: 32, offset: 640)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "adler32", scope: !583, file: !4, line: 242, baseType: !257, size: 32, align: 32, offset: 672)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !583, file: !4, line: 255, baseType: !359, size: 64, align: 64, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !583, file: !4, line: 256, baseType: !545, size: 1856, align: 64, offset: 768)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "retc", scope: !583, file: !4, line: 257, baseType: !269, size: 16, align: 16, offset: 2624)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "attn", scope: !583, file: !4, line: 258, baseType: !269, size: 16, align: 16, offset: 2640)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !583, file: !4, line: 259, baseType: !257, size: 32, align: 32, offset: 2656)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !583, file: !4, line: 262, baseType: !366, size: 32, align: 32, offset: 2688)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !583, file: !4, line: 263, baseType: !366, size: 32, align: 32, offset: 2720)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "out_fifo", scope: !583, file: !4, line: 266, baseType: !611, size: 2112, align: 32, offset: 2752)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_fifo", file: !612, line: 45, size: 2112, align: 32, elements: !613)
!612 = !DIFile(filename: "../include/deflate_fifo.h", directory: "/home/lichi/Desktop")
!613 = !{!614, !615, !616}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "push", scope: !611, file: !612, line: 46, baseType: !258, size: 32, align: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "pop", scope: !611, file: !612, line: 47, baseType: !258, size: 32, align: 32, offset: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "fifo", scope: !611, file: !612, line: 48, baseType: !617, size: 2048, align: 8, offset: 64)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 2048, align: 8, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "in_fifo", scope: !583, file: !4, line: 267, baseType: !611, size: 2112, align: 32, offset: 4864)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "header_state", scope: !583, file: !4, line: 268, baseType: !622, size: 32, align: 32, offset: 6976)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "head_state", file: !4, line: 163, baseType: !3)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "gzip_hcrc", scope: !583, file: !4, line: 269, baseType: !269, size: 16, align: 16, offset: 7008)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "gzip_header_idx", scope: !583, file: !4, line: 270, baseType: !366, size: 32, align: 32, offset: 7040)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "onumbits", scope: !583, file: !4, line: 273, baseType: !366, size: 32, align: 32, offset: 7072)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "obyte", scope: !583, file: !4, line: 274, baseType: !272, size: 8, align: 8, offset: 7104)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "eob_seen", scope: !583, file: !4, line: 277, baseType: !366, size: 32, align: 32, offset: 7136)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "eob_added", scope: !583, file: !4, line: 278, baseType: !366, size: 32, align: 32, offset: 7168)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "header_added", scope: !583, file: !4, line: 279, baseType: !366, size: 32, align: 32, offset: 7200)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "trailer_added", scope: !583, file: !4, line: 280, baseType: !366, size: 32, align: 32, offset: 7232)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "havedict", scope: !583, file: !4, line: 281, baseType: !366, size: 32, align: 32, offset: 7264)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "wsp", scope: !583, file: !4, line: 284, baseType: !633, size: 64, align: 64, offset: 7296)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zedc_wsp", file: !250, line: 93, size: 528640, align: 8, elements: !635)
!635 = !{!636, !641}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !634, file: !250, line: 94, baseType: !637, size: 524544, align: 8)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 524544, align: 8, elements: !638)
!638 = !{!639, !640}
!639 = !DISubrange(count: 2)
!640 = !DISubrange(count: 32784)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !634, file: !250, line: 95, baseType: !642, size: 4096, align: 8, offset: 524544)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 4096, align: 8, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 512)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "wsp_page", scope: !583, file: !4, line: 285, baseType: !366, size: 32, align: 32, offset: 7360)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "dma_type", scope: !583, file: !4, line: 286, baseType: !647, size: 96, align: 32, offset: 7392)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 96, align: 32, elements: !352)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "file_size", scope: !583, file: !4, line: 289, baseType: !257, size: 32, align: 32, offset: 7488)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "file_adler32", scope: !583, file: !4, line: 290, baseType: !257, size: 32, align: 32, offset: 7520)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "file_crc32", scope: !583, file: !4, line: 291, baseType: !257, size: 32, align: 32, offset: 7552)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "dict_adler32", scope: !583, file: !4, line: 292, baseType: !257, size: 32, align: 32, offset: 7584)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "gzip_head", scope: !583, file: !4, line: 293, baseType: !653, size: 64, align: 64, offset: 7616)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gzedc_header_s", file: !4, line: 169, size: 640, align: 64, elements: !655)
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !654, file: !4, line: 170, baseType: !366, size: 32, align: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !654, file: !4, line: 171, baseType: !255, size: 64, align: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "xflags", scope: !654, file: !4, line: 172, baseType: !366, size: 32, align: 32, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !654, file: !4, line: 173, baseType: !366, size: 32, align: 32, offset: 160)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !654, file: !4, line: 174, baseType: !598, size: 64, align: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "extra_len", scope: !654, file: !4, line: 175, baseType: !258, size: 32, align: 32, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "extra_max", scope: !654, file: !4, line: 176, baseType: !258, size: 32, align: 32, offset: 288)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !654, file: !4, line: 177, baseType: !391, size: 64, align: 64, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !654, file: !4, line: 178, baseType: !258, size: 32, align: 32, offset: 384)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !654, file: !4, line: 179, baseType: !391, size: 64, align: 64, offset: 448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "comm_max", scope: !654, file: !4, line: 180, baseType: !258, size: 32, align: 32, offset: 512)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "hcrc", scope: !654, file: !4, line: 181, baseType: !366, size: 32, align: 32, offset: 544)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !654, file: !4, line: 182, baseType: !366, size: 32, align: 32, offset: 576)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "in_hdr_scratch_len", scope: !583, file: !4, line: 297, baseType: !257, size: 32, align: 32, offset: 7680)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "in_hdr_bits", scope: !583, file: !4, line: 298, baseType: !269, size: 16, align: 16, offset: 7712)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_ib", scope: !583, file: !4, line: 299, baseType: !272, size: 8, align: 8, offset: 7728)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "scratch_ib", scope: !583, file: !4, line: 300, baseType: !272, size: 8, align: 8, offset: 7736)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "inp_processed", scope: !583, file: !4, line: 303, baseType: !257, size: 32, align: 32, offset: 7744)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "outp_returned", scope: !583, file: !4, line: 304, baseType: !257, size: 32, align: 32, offset: 7776)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "proc_bits", scope: !583, file: !4, line: 305, baseType: !272, size: 8, align: 8, offset: 7808)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "infl_stat", scope: !583, file: !4, line: 313, baseType: !272, size: 8, align: 8, offset: 7816)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_start", scope: !583, file: !4, line: 318, baseType: !257, size: 32, align: 32, offset: 7840)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "out_hdr_bits", scope: !583, file: !4, line: 319, baseType: !269, size: 16, align: 16, offset: 7872)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "out_hdr_start_bits", scope: !583, file: !4, line: 320, baseType: !272, size: 8, align: 8, offset: 7888)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "copyblock_len", scope: !583, file: !4, line: 321, baseType: !269, size: 16, align: 16, offset: 7904)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "tree_bits", scope: !583, file: !4, line: 324, baseType: !257, size: 32, align: 32, offset: 7936)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pad_bits", scope: !583, file: !4, line: 325, baseType: !257, size: 32, align: 32, offset: 7968)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "scratch_bits", scope: !583, file: !4, line: 326, baseType: !257, size: 32, align: 32, offset: 8000)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "pre_scratch_bits", scope: !583, file: !4, line: 327, baseType: !253, size: 64, align: 64, offset: 8064)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "inp_data_offs", scope: !583, file: !4, line: 328, baseType: !257, size: 32, align: 32, offset: 8128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "in_data_used", scope: !583, file: !4, line: 329, baseType: !257, size: 32, align: 32, offset: 8160)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "dict_len", scope: !583, file: !4, line: 332, baseType: !269, size: 16, align: 16, offset: 8192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "out_dict_offs", scope: !583, file: !4, line: 333, baseType: !272, size: 8, align: 8, offset: 8208)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "obytes_in_dict", scope: !583, file: !4, line: 334, baseType: !269, size: 16, align: 16, offset: 8224)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "prefx_len", scope: !583, file: !4, line: 337, baseType: !366, size: 32, align: 32, offset: 8256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "prefx_idx", scope: !583, file: !4, line: 338, baseType: !366, size: 32, align: 32, offset: 8288)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "prefx", scope: !583, file: !4, line: 339, baseType: !693, size: 144, align: 8, offset: 8320)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 144, align: 8, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 18)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "xlen", scope: !583, file: !4, line: 340, baseType: !269, size: 16, align: 16, offset: 8464)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "postfx_len", scope: !583, file: !4, line: 342, baseType: !366, size: 32, align: 32, offset: 8480)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "postfx_idx", scope: !583, file: !4, line: 343, baseType: !366, size: 32, align: 32, offset: 8512)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "postfx", scope: !583, file: !4, line: 344, baseType: !693, size: 144, align: 8, offset: 8544)
!700 = !DILocalVariable(name: "strm", arg: 1, scope: !541, file: !382, line: 134, type: !582)
!701 = !DILocation(line: 134, column: 54, scope: !541)
!702 = !DILocation(line: 136, column: 7, scope: !703)
!703 = distinct !DILexicalBlock(scope: !541, file: !382, line: 136, column: 6)
!704 = !DILocation(line: 136, column: 6, scope: !541)
!705 = !DILocation(line: 137, column: 3, scope: !703)
!706 = !DILocation(line: 139, column: 10, scope: !541)
!707 = !DILocation(line: 139, column: 16, scope: !541)
!708 = !DILocation(line: 139, column: 2, scope: !541)
!709 = !DILocation(line: 140, column: 1, scope: !541)
!710 = distinct !DISubprogram(name: "zedc_pstatus", scope: !382, file: !382, line: 147, type: !711, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !459)
!711 = !DISubroutineType(types: !712)
!712 = !{!366, !582, !449}
!713 = !DILocalVariable(name: "strm", arg: 1, scope: !710, file: !382, line: 147, type: !582)
!714 = !DILocation(line: 147, column: 40, scope: !710)
!715 = !DILocalVariable(name: "task", arg: 2, scope: !710, file: !382, line: 147, type: !449)
!716 = !DILocation(line: 147, column: 58, scope: !710)
!717 = !DILocalVariable(name: "c", scope: !710, file: !382, line: 149, type: !366)
!718 = !DILocation(line: 149, column: 6, scope: !710)
!719 = !DILocation(line: 151, column: 13, scope: !710)
!720 = !DILocation(line: 153, column: 27, scope: !710)
!721 = !DILocation(line: 153, column: 33, scope: !710)
!722 = !DILocation(line: 153, column: 39, scope: !710)
!723 = !DILocation(line: 153, column: 49, scope: !710)
!724 = !DILocation(line: 153, column: 55, scope: !710)
!725 = !DILocation(line: 154, column: 7, scope: !710)
!726 = !DILocation(line: 154, column: 13, scope: !710)
!727 = !DILocation(line: 154, column: 23, scope: !710)
!728 = !DILocation(line: 154, column: 29, scope: !710)
!729 = !DILocation(line: 151, column: 6, scope: !710)
!730 = !DILocation(line: 151, column: 4, scope: !710)
!731 = !DILocation(line: 156, column: 10, scope: !710)
!732 = !DILocation(line: 156, column: 16, scope: !710)
!733 = !DILocation(line: 156, column: 2, scope: !710)
!734 = !DILocation(line: 158, column: 15, scope: !735)
!735 = distinct !DILexicalBlock(scope: !710, file: !382, line: 156, column: 24)
!736 = !DILocation(line: 159, column: 9, scope: !735)
!737 = !DILocation(line: 159, column: 15, scope: !735)
!738 = !DILocation(line: 159, column: 27, scope: !735)
!739 = !DILocation(line: 159, column: 33, scope: !735)
!740 = !DILocation(line: 158, column: 8, scope: !735)
!741 = !DILocation(line: 158, column: 5, scope: !735)
!742 = !DILocation(line: 160, column: 15, scope: !735)
!743 = !DILocation(line: 161, column: 9, scope: !735)
!744 = !DILocation(line: 161, column: 15, scope: !735)
!745 = !DILocation(line: 161, column: 26, scope: !735)
!746 = !DILocation(line: 161, column: 32, scope: !735)
!747 = !DILocation(line: 160, column: 8, scope: !735)
!748 = !DILocation(line: 160, column: 5, scope: !735)
!749 = !DILocation(line: 162, column: 3, scope: !735)
!750 = !DILocation(line: 165, column: 15, scope: !735)
!751 = !DILocation(line: 166, column: 9, scope: !735)
!752 = !DILocation(line: 166, column: 15, scope: !735)
!753 = !DILocation(line: 166, column: 29, scope: !735)
!754 = !DILocation(line: 166, column: 35, scope: !735)
!755 = !DILocation(line: 165, column: 8, scope: !735)
!756 = !DILocation(line: 165, column: 5, scope: !735)
!757 = !DILocation(line: 167, column: 3, scope: !735)
!758 = !DILocation(line: 170, column: 3, scope: !735)
!759 = !DILocation(line: 172, column: 9, scope: !710)
!760 = !DILocation(line: 172, column: 2, scope: !710)
!761 = distinct !DISubprogram(name: "zedc_lib_debug", scope: !382, file: !382, line: 180, type: !762, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !459)
