; ModuleID = '/home/lichi/Desktop/genwqe/[task]misc--zpipe_rnd/[inter]misc--zpipe_rnd.o.i'
source_filename = "/home/lichi/Desktop/genwqe/[task]misc--zpipe_rnd/[inter]misc--zpipe_rnd.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.internal_state = type opaque

@.str = private unnamed_addr constant [5 x i8] c"ZLIB\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !6)
!1 = !DIFile(filename: "/home/lichi/Desktop/genwqe/[task]misc--zpipe_rnd/[inter]misc--zpipe_rnd.o.i", directory: "/home/lichi/Desktop")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !{!7, !28, !29, !30, !32, !33}
!7 = distinct !DIGlobalVariable(name: "long_options", scope: !8, file: !9, line: 403, type: !15, isLocal: true, isDefinition: true, variable: [14 x %struct.option]* @main.long_options)
!8 = distinct !DISubprogram(name: "main", scope: !9, file: !9, line: 384, type: !10, isLocal: false, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!9 = !DIFile(filename: "zpipe_rnd.c", directory: "/home/lichi/Desktop")
!10 = !DISubroutineType(types: !11)
!11 = !{!5, !5, !12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 3584, align: 64, elements: !26)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !17, line: 104, size: 256, align: 64, elements: !18)
!17 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/lichi/Desktop")
!18 = !{!19, !22, !23, !25}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !16, file: !17, line: 106, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !16, file: !17, line: 109, baseType: !5, size: 32, align: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !16, file: !17, line: 110, baseType: !24, size: 64, align: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !16, file: !17, line: 111, baseType: !5, size: 32, align: 32, offset: 192)
!26 = !{!27}
!27 = !DISubrange(count: 14)
!28 = distinct !DIGlobalVariable(name: "rnd", scope: !0, file: !9, line: 41, type: !5, isLocal: true, isDefinition: true, variable: i32* @rnd)
!29 = distinct !DIGlobalVariable(name: "verbose", scope: !0, file: !9, line: 39, type: !5, isLocal: true, isDefinition: true, variable: i32* @verbose)
!30 = distinct !DIGlobalVariable(name: "seed", scope: !0, file: !9, line: 40, type: !31, isLocal: true, isDefinition: true, variable: i32* @seed)
!31 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!32 = distinct !DIGlobalVariable(name: "CHUNK_i", scope: !0, file: !9, line: 42, type: !31, isLocal: true, isDefinition: true, variable: i32* @CHUNK_i)
!33 = distinct !DIGlobalVariable(name: "CHUNK_o", scope: !0, file: !9, line: 43, type: !31, isLocal: true, isDefinition: true, variable: i32* @CHUNK_o)
!34 = !{i32 2, !"Dwarf Version", i32 4}
!35 = !{i32 2, !"Debug Info Version", i32 3}
!36 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!37 = !DILocalVariable(name: "argc", arg: 1, scope: !8, file: !9, line: 384, type: !5)
!38 = !DIExpression()
!39 = !DILocation(line: 384, column: 14, scope: !8)
!40 = !DILocalVariable(name: "argv", arg: 2, scope: !8, file: !9, line: 384, type: !12)
!41 = !DILocation(line: 384, column: 27, scope: !8)
!42 = !DILocalVariable(name: "ret", scope: !8, file: !9, line: 386, type: !5)
!43 = !DILocation(line: 386, column: 6, scope: !8)
!44 = !DILocalVariable(name: "compress", scope: !8, file: !9, line: 387, type: !5)
!45 = !DILocation(line: 387, column: 6, scope: !8)
!46 = !DILocalVariable(name: "format", scope: !8, file: !9, line: 388, type: !20)
!47 = !DILocation(line: 388, column: 14, scope: !8)
!48 = !DILocalVariable(name: "dictName", scope: !8, file: !9, line: 389, type: !20)
!49 = !DILocation(line: 389, column: 14, scope: !8)
!50 = !DILocalVariable(name: "dictionary", scope: !8, file: !9, line: 390, type: !51)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 262144, align: 8, elements: !55)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !53, line: 48, baseType: !54)
!53 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop")
!54 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!55 = !{!56}
!56 = !DISubrange(count: 32768)
!57 = !DILocation(line: 390, column: 10, scope: !8)
!58 = !DILocalVariable(name: "dictLength", scope: !8, file: !9, line: 391, type: !5)
!59 = !DILocation(line: 391, column: 6, scope: !8)
!60 = !DILocalVariable(name: "windowBits", scope: !8, file: !9, line: 392, type: !5)
!61 = !DILocation(line: 392, column: 6, scope: !8)
!62 = !DILocalVariable(name: "level", scope: !8, file: !9, line: 393, type: !5)
!63 = !DILocation(line: 393, column: 6, scope: !8)
!64 = !DILocalVariable(name: "strategy", scope: !8, file: !9, line: 394, type: !5)
!65 = !DILocation(line: 394, column: 6, scope: !8)
!66 = !DILocation(line: 400, column: 2, scope: !8)
!67 = !DILocalVariable(name: "ch", scope: !68, file: !9, line: 401, type: !5)
!68 = distinct !DILexicalBlock(scope: !8, file: !9, line: 400, column: 12)
!69 = !DILocation(line: 401, column: 7, scope: !68)
!70 = !DILocalVariable(name: "option_index", scope: !68, file: !9, line: 402, type: !5)
!71 = !DILocation(line: 402, column: 7, scope: !68)
!72 = !DILocation(line: 420, column: 20, scope: !68)
!73 = !DILocation(line: 420, column: 26, scope: !68)
!74 = !DILocation(line: 420, column: 8, scope: !68)
!75 = !DILocation(line: 420, column: 6, scope: !68)
!76 = !DILocation(line: 422, column: 7, scope: !77)
!77 = distinct !DILexicalBlock(scope: !68, file: !9, line: 422, column: 7)
!78 = !DILocation(line: 422, column: 10, scope: !77)
!79 = !DILocation(line: 422, column: 7, scope: !68)
!80 = !DILocation(line: 423, column: 4, scope: !77)
!81 = !DILocation(line: 425, column: 11, scope: !68)
!82 = !DILocation(line: 425, column: 3, scope: !68)
!83 = !DILocation(line: 428, column: 13, scope: !84)
!84 = distinct !DILexicalBlock(scope: !68, file: !9, line: 425, column: 15)
!85 = !DILocation(line: 429, column: 4, scope: !84)
!86 = !DILocation(line: 431, column: 13, scope: !84)
!87 = !DILocation(line: 431, column: 11, scope: !84)
!88 = !DILocation(line: 432, column: 4, scope: !84)
!89 = !DILocation(line: 434, column: 10, scope: !84)
!90 = !DILocation(line: 435, column: 4, scope: !84)
!91 = !DILocation(line: 437, column: 10, scope: !84)
!92 = !DILocation(line: 438, column: 4, scope: !84)
!93 = !DILocation(line: 440, column: 10, scope: !84)
!94 = !DILocation(line: 441, column: 4, scope: !84)
!95 = !DILocation(line: 443, column: 15, scope: !84)
!96 = !DILocation(line: 443, column: 13, scope: !84)
!97 = !DILocation(line: 444, column: 4, scope: !84)
!98 = !DILocation(line: 446, column: 7, scope: !84)
!99 = !DILocation(line: 447, column: 4, scope: !84)
!100 = !DILocation(line: 449, column: 11, scope: !84)
!101 = !DILocation(line: 450, column: 4, scope: !84)
!102 = !DILocation(line: 452, column: 22, scope: !84)
!103 = !DILocation(line: 452, column: 11, scope: !84)
!104 = !DILocation(line: 452, column: 9, scope: !84)
!105 = !DILocation(line: 453, column: 4, scope: !84)
!106 = !DILocation(line: 455, column: 26, scope: !84)
!107 = !DILocation(line: 455, column: 15, scope: !84)
!108 = !DILocation(line: 455, column: 13, scope: !84)
!109 = !DILocation(line: 456, column: 4, scope: !84)
!110 = !DILocation(line: 458, column: 25, scope: !84)
!111 = !DILocation(line: 458, column: 14, scope: !84)
!112 = !DILocation(line: 458, column: 12, scope: !84)
!113 = !DILocation(line: 459, column: 4, scope: !84)
!114 = !DILocation(line: 461, column: 25, scope: !84)
!115 = !DILocation(line: 461, column: 14, scope: !84)
!116 = !DILocation(line: 461, column: 12, scope: !84)
!117 = !DILocation(line: 462, column: 4, scope: !84)
!118 = !DILocation(line: 465, column: 10, scope: !84)
!119 = !DILocation(line: 465, column: 4, scope: !84)
!120 = !DILocation(line: 466, column: 4, scope: !84)
!121 = !DILocation(line: 400, column: 2, scope: !122)
!122 = !DILexicalBlockFile(scope: !8, file: !9, discriminator: 1)
!123 = distinct !{!123, !66}
!124 = !DILocation(line: 471, column: 10, scope: !8)
!125 = !DILocation(line: 471, column: 2, scope: !8)
!126 = !DILocation(line: 472, column: 37, scope: !8)
!127 = !DILocation(line: 472, column: 15, scope: !8)
!128 = !DILocation(line: 472, column: 13, scope: !8)
!129 = !DILocation(line: 473, column: 25, scope: !8)
!130 = !DILocation(line: 473, column: 35, scope: !8)
!131 = !DILocation(line: 473, column: 15, scope: !8)
!132 = !DILocation(line: 473, column: 13, scope: !8)
!133 = !DILocation(line: 476, column: 6, scope: !134)
!134 = distinct !DILexicalBlock(scope: !8, file: !9, line: 476, column: 6)
!135 = !DILocation(line: 476, column: 15, scope: !134)
!136 = !DILocation(line: 476, column: 6, scope: !8)
!137 = !DILocation(line: 477, column: 12, scope: !138)
!138 = distinct !DILexicalBlock(scope: !134, file: !9, line: 476, column: 21)
!139 = !DILocation(line: 477, column: 19, scope: !138)
!140 = !DILocation(line: 477, column: 27, scope: !138)
!141 = !DILocation(line: 477, column: 34, scope: !138)
!142 = !DILocation(line: 478, column: 6, scope: !138)
!143 = !DILocation(line: 478, column: 18, scope: !138)
!144 = !DILocation(line: 478, column: 30, scope: !138)
!145 = !DILocation(line: 477, column: 9, scope: !138)
!146 = !DILocation(line: 477, column: 7, scope: !138)
!147 = !DILocation(line: 479, column: 7, scope: !148)
!148 = distinct !DILexicalBlock(scope: !138, file: !9, line: 479, column: 7)
!149 = !DILocation(line: 479, column: 11, scope: !148)
!150 = !DILocation(line: 479, column: 7, scope: !138)
!151 = !DILocation(line: 480, column: 9, scope: !148)
!152 = !DILocation(line: 480, column: 4, scope: !148)
!153 = !DILocation(line: 481, column: 10, scope: !138)
!154 = !DILocation(line: 481, column: 3, scope: !138)
!155 = !DILocation(line: 485, column: 11, scope: !156)
!156 = distinct !DILexicalBlock(scope: !134, file: !9, line: 485, column: 11)
!157 = !DILocation(line: 485, column: 20, scope: !156)
!158 = !DILocation(line: 485, column: 11, scope: !134)
!159 = !DILocation(line: 486, column: 12, scope: !160)
!160 = distinct !DILexicalBlock(scope: !156, file: !9, line: 485, column: 26)
!161 = !DILocation(line: 486, column: 19, scope: !160)
!162 = !DILocation(line: 486, column: 27, scope: !160)
!163 = !DILocation(line: 486, column: 39, scope: !160)
!164 = !DILocation(line: 486, column: 51, scope: !160)
!165 = !DILocation(line: 486, column: 9, scope: !160)
!166 = !DILocation(line: 486, column: 7, scope: !160)
!167 = !DILocation(line: 487, column: 7, scope: !168)
!168 = distinct !DILexicalBlock(scope: !160, file: !9, line: 487, column: 7)
!169 = !DILocation(line: 487, column: 11, scope: !168)
!170 = !DILocation(line: 487, column: 7, scope: !160)
!171 = !DILocation(line: 488, column: 9, scope: !168)
!172 = !DILocation(line: 488, column: 4, scope: !168)
!173 = !DILocation(line: 489, column: 10, scope: !160)
!174 = !DILocation(line: 489, column: 3, scope: !160)
!175 = !DILocation(line: 494, column: 9, scope: !176)
!176 = distinct !DILexicalBlock(scope: !156, file: !9, line: 493, column: 7)
!177 = !DILocation(line: 494, column: 3, scope: !176)
!178 = !DILocation(line: 495, column: 3, scope: !176)
!179 = !DILocation(line: 499, column: 1, scope: !8)
!180 = distinct !DISubprogram(name: "str_to_num", scope: !9, file: !9, line: 305, type: !181, isLocal: true, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!181 = !DISubroutineType(types: !182)
!182 = !{!183, !13}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !53, line: 55, baseType: !184)
!184 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!185 = !DILocalVariable(name: "str", arg: 1, scope: !180, file: !9, line: 305, type: !13)
!186 = !DILocation(line: 305, column: 41, scope: !180)
!187 = !DILocalVariable(name: "s", scope: !180, file: !9, line: 307, type: !13)
!188 = !DILocation(line: 307, column: 8, scope: !180)
!189 = !DILocation(line: 307, column: 12, scope: !180)
!190 = !DILocalVariable(name: "num", scope: !180, file: !9, line: 308, type: !183)
!191 = !DILocation(line: 308, column: 11, scope: !180)
!192 = !DILocation(line: 308, column: 26, scope: !180)
!193 = !DILocation(line: 308, column: 17, scope: !180)
!194 = !DILocation(line: 310, column: 7, scope: !195)
!195 = distinct !DILexicalBlock(scope: !180, file: !9, line: 310, column: 6)
!196 = !DILocation(line: 310, column: 6, scope: !195)
!197 = !DILocation(line: 310, column: 9, scope: !195)
!198 = !DILocation(line: 310, column: 6, scope: !180)
!199 = !DILocation(line: 311, column: 10, scope: !195)
!200 = !DILocation(line: 311, column: 3, scope: !195)
!201 = !DILocation(line: 313, column: 13, scope: !202)
!202 = distinct !DILexicalBlock(scope: !180, file: !9, line: 313, column: 6)
!203 = !DILocation(line: 313, column: 6, scope: !202)
!204 = !DILocation(line: 313, column: 23, scope: !202)
!205 = !DILocation(line: 313, column: 6, scope: !180)
!206 = !DILocation(line: 314, column: 7, scope: !202)
!207 = !DILocation(line: 314, column: 3, scope: !202)
!208 = !DILocation(line: 315, column: 18, scope: !209)
!209 = distinct !DILexicalBlock(scope: !202, file: !9, line: 315, column: 11)
!210 = !DILocation(line: 315, column: 11, scope: !209)
!211 = !DILocation(line: 315, column: 28, scope: !209)
!212 = !DILocation(line: 315, column: 11, scope: !202)
!213 = !DILocation(line: 316, column: 7, scope: !209)
!214 = !DILocation(line: 316, column: 3, scope: !209)
!215 = !DILocation(line: 317, column: 18, scope: !216)
!216 = distinct !DILexicalBlock(scope: !209, file: !9, line: 317, column: 11)
!217 = !DILocation(line: 317, column: 11, scope: !216)
!218 = !DILocation(line: 317, column: 28, scope: !216)
!219 = !DILocation(line: 317, column: 11, scope: !209)
!220 = !DILocation(line: 318, column: 7, scope: !216)
!221 = !DILocation(line: 318, column: 3, scope: !216)
!222 = !DILocation(line: 320, column: 9, scope: !180)
!223 = !DILocation(line: 320, column: 2, scope: !180)
!224 = !DILocation(line: 321, column: 1, scope: !180)
!225 = distinct !DISubprogram(name: "usage", scope: !9, file: !9, line: 323, type: !226, isLocal: true, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !13}
!228 = !DILocalVariable(name: "prog", arg: 1, scope: !225, file: !9, line: 323, type: !13)
!229 = !DILocation(line: 323, column: 25, scope: !225)
!230 = !DILocalVariable(name: "b", scope: !225, file: !9, line: 325, type: !13)
!231 = !DILocation(line: 325, column: 8, scope: !225)
!232 = !DILocation(line: 325, column: 20, scope: !225)
!233 = !DILocation(line: 325, column: 11, scope: !225)
!234 = !DILocation(line: 327, column: 9, scope: !225)
!235 = !DILocation(line: 339, column: 3, scope: !225)
!236 = !DILocation(line: 339, column: 6, scope: !225)
!237 = !DILocation(line: 327, column: 2, scope: !225)
!238 = !DILocation(line: 340, column: 1, scope: !225)
!239 = distinct !DISubprogram(name: "figure_out_windowBits", scope: !9, file: !9, line: 342, type: !240, isLocal: true, isDefinition: true, scopeLine: 343, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!240 = !DISubroutineType(types: !241)
!241 = !{!5, !20}
!242 = !DILocalVariable(name: "format", arg: 1, scope: !239, file: !9, line: 342, type: !20)
!243 = !DILocation(line: 342, column: 46, scope: !239)
!244 = !DILocation(line: 344, column: 13, scope: !245)
!245 = distinct !DILexicalBlock(scope: !239, file: !9, line: 344, column: 6)
!246 = !DILocation(line: 344, column: 6, scope: !245)
!247 = !DILocation(line: 344, column: 29, scope: !245)
!248 = !DILocation(line: 344, column: 6, scope: !239)
!249 = !DILocation(line: 345, column: 3, scope: !245)
!250 = !DILocation(line: 346, column: 18, scope: !251)
!251 = distinct !DILexicalBlock(scope: !245, file: !9, line: 346, column: 11)
!252 = !DILocation(line: 346, column: 11, scope: !251)
!253 = !DILocation(line: 346, column: 37, scope: !251)
!254 = !DILocation(line: 346, column: 11, scope: !245)
!255 = !DILocation(line: 347, column: 3, scope: !251)
!256 = !DILocation(line: 348, column: 18, scope: !257)
!257 = distinct !DILexicalBlock(scope: !251, file: !9, line: 348, column: 11)
!258 = !DILocation(line: 348, column: 11, scope: !257)
!259 = !DILocation(line: 348, column: 34, scope: !257)
!260 = !DILocation(line: 348, column: 11, scope: !251)
!261 = !DILocation(line: 349, column: 3, scope: !257)
!262 = !DILocation(line: 351, column: 2, scope: !239)
!263 = !DILocation(line: 352, column: 1, scope: !239)
!264 = distinct !DISubprogram(name: "dict_load", scope: !9, file: !9, line: 358, type: !265, isLocal: true, isDefinition: true, scopeLine: 359, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!265 = !DISubroutineType(types: !266)
!266 = !{!267, !20, !272, !273}
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !268, line: 102, baseType: !269)
!268 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop")
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !270, line: 172, baseType: !271)
!270 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop")
!271 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !274, line: 216, baseType: !184)
!274 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop")
!275 = !DILocalVariable(name: "fname", arg: 1, scope: !264, file: !9, line: 358, type: !20)
!276 = !DILocation(line: 358, column: 38, scope: !264)
!277 = !DILocalVariable(name: "buff", arg: 2, scope: !264, file: !9, line: 358, type: !272)
!278 = !DILocation(line: 358, column: 54, scope: !264)
!279 = !DILocalVariable(name: "len", arg: 3, scope: !264, file: !9, line: 358, type: !273)
!280 = !DILocation(line: 358, column: 67, scope: !264)
!281 = !DILocalVariable(name: "rc", scope: !264, file: !9, line: 360, type: !5)
!282 = !DILocation(line: 360, column: 6, scope: !264)
!283 = !DILocalVariable(name: "fp", scope: !264, file: !9, line: 361, type: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !268, line: 48, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !287, line: 241, size: 1728, align: 64, elements: !288)
!287 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop")
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !309, !310, !311, !312, !314, !316, !318, !322, !325, !327, !328, !329, !330, !331, !332, !333}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !286, file: !287, line: 242, baseType: !5, size: 32, align: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !286, file: !287, line: 247, baseType: !13, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !286, file: !287, line: 248, baseType: !13, size: 64, align: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !286, file: !287, line: 249, baseType: !13, size: 64, align: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !286, file: !287, line: 250, baseType: !13, size: 64, align: 64, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !286, file: !287, line: 251, baseType: !13, size: 64, align: 64, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !286, file: !287, line: 252, baseType: !13, size: 64, align: 64, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !286, file: !287, line: 253, baseType: !13, size: 64, align: 64, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !286, file: !287, line: 254, baseType: !13, size: 64, align: 64, offset: 512)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !286, file: !287, line: 256, baseType: !13, size: 64, align: 64, offset: 576)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !286, file: !287, line: 257, baseType: !13, size: 64, align: 64, offset: 640)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !286, file: !287, line: 258, baseType: !13, size: 64, align: 64, offset: 704)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !286, file: !287, line: 260, baseType: !302, size: 64, align: 64, offset: 768)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !287, line: 156, size: 192, align: 64, elements: !304)
!304 = !{!305, !306, !308}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !303, file: !287, line: 157, baseType: !302, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !303, file: !287, line: 158, baseType: !307, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !303, file: !287, line: 162, baseType: !5, size: 32, align: 32, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !286, file: !287, line: 262, baseType: !307, size: 64, align: 64, offset: 832)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !286, file: !287, line: 264, baseType: !5, size: 32, align: 32, offset: 896)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !286, file: !287, line: 268, baseType: !5, size: 32, align: 32, offset: 928)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !286, file: !287, line: 270, baseType: !313, size: 64, align: 64, offset: 960)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !270, line: 131, baseType: !271)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !286, file: !287, line: 274, baseType: !315, size: 16, align: 16, offset: 1024)
!315 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !286, file: !287, line: 275, baseType: !317, size: 8, align: 8, offset: 1040)
!317 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !286, file: !287, line: 276, baseType: !319, size: 8, align: 8, offset: 1048)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, align: 8, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 1)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !286, file: !287, line: 280, baseType: !323, size: 64, align: 64, offset: 1088)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !287, line: 150, baseType: null)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !286, file: !287, line: 289, baseType: !326, size: 64, align: 64, offset: 1152)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !270, line: 132, baseType: !271)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !286, file: !287, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !286, file: !287, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !286, file: !287, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !286, file: !287, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !286, file: !287, line: 302, baseType: !273, size: 64, align: 64, offset: 1472)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !286, file: !287, line: 303, baseType: !5, size: 32, align: 32, offset: 1536)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !286, file: !287, line: 305, baseType: !334, size: 160, align: 8, offset: 1568)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, align: 8, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 20)
!337 = !DILocation(line: 361, column: 8, scope: !264)
!338 = !DILocation(line: 363, column: 7, scope: !339)
!339 = distinct !DILexicalBlock(scope: !264, file: !9, line: 363, column: 6)
!340 = !DILocation(line: 363, column: 13, scope: !339)
!341 = !DILocation(line: 363, column: 21, scope: !339)
!342 = !DILocation(line: 363, column: 25, scope: !343)
!343 = !DILexicalBlockFile(scope: !339, file: !9, discriminator: 1)
!344 = !DILocation(line: 363, column: 30, scope: !343)
!345 = !DILocation(line: 363, column: 39, scope: !343)
!346 = !DILocation(line: 363, column: 43, scope: !347)
!347 = !DILexicalBlockFile(scope: !339, file: !9, discriminator: 2)
!348 = !DILocation(line: 363, column: 47, scope: !347)
!349 = !DILocation(line: 363, column: 6, scope: !347)
!350 = !DILocation(line: 364, column: 3, scope: !339)
!351 = !DILocation(line: 366, column: 13, scope: !264)
!352 = !DILocation(line: 366, column: 7, scope: !264)
!353 = !DILocation(line: 366, column: 5, scope: !264)
!354 = !DILocation(line: 367, column: 7, scope: !355)
!355 = distinct !DILexicalBlock(scope: !264, file: !9, line: 367, column: 6)
!356 = !DILocation(line: 367, column: 6, scope: !264)
!357 = !DILocation(line: 368, column: 10, scope: !358)
!358 = distinct !DILexicalBlock(scope: !355, file: !9, line: 367, column: 11)
!359 = !DILocation(line: 369, column: 4, scope: !358)
!360 = !DILocation(line: 369, column: 21, scope: !358)
!361 = !DILocation(line: 369, column: 20, scope: !358)
!362 = !DILocation(line: 369, column: 11, scope: !363)
!363 = !DILexicalBlockFile(scope: !358, file: !9, discriminator: 1)
!364 = !DILocation(line: 368, column: 3, scope: !358)
!365 = !DILocation(line: 370, column: 3, scope: !358)
!366 = !DILocation(line: 372, column: 13, scope: !264)
!367 = !DILocation(line: 372, column: 22, scope: !264)
!368 = !DILocation(line: 372, column: 27, scope: !264)
!369 = !DILocation(line: 372, column: 7, scope: !264)
!370 = !DILocation(line: 372, column: 5, scope: !264)
!371 = !DILocation(line: 373, column: 6, scope: !372)
!372 = distinct !DILexicalBlock(scope: !264, file: !9, line: 373, column: 6)
!373 = !DILocation(line: 373, column: 9, scope: !372)
!374 = !DILocation(line: 373, column: 6, scope: !264)
!375 = !DILocation(line: 374, column: 10, scope: !372)
!376 = !DILocation(line: 375, column: 4, scope: !372)
!377 = !DILocation(line: 375, column: 21, scope: !372)
!378 = !DILocation(line: 375, column: 20, scope: !372)
!379 = !DILocation(line: 375, column: 11, scope: !380)
!380 = !DILexicalBlockFile(scope: !372, file: !9, discriminator: 1)
!381 = !DILocation(line: 374, column: 3, scope: !372)
!382 = !DILocation(line: 377, column: 9, scope: !264)
!383 = !DILocation(line: 377, column: 2, scope: !264)
!384 = !DILocation(line: 378, column: 9, scope: !264)
!385 = !DILocation(line: 378, column: 2, scope: !264)
!386 = !DILocation(line: 379, column: 1, scope: !264)
!387 = distinct !DISubprogram(name: "def", scope: !9, file: !9, line: 51, type: !388, isLocal: true, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!388 = !DISubroutineType(types: !389)
!389 = !{!5, !284, !284, !5, !5, !5, !272, !5}
!390 = !DILocalVariable(name: "source", arg: 1, scope: !387, file: !9, line: 51, type: !284)
!391 = !DILocation(line: 51, column: 22, scope: !387)
!392 = !DILocalVariable(name: "dest", arg: 2, scope: !387, file: !9, line: 51, type: !284)
!393 = !DILocation(line: 51, column: 36, scope: !387)
!394 = !DILocalVariable(name: "level", arg: 3, scope: !387, file: !9, line: 51, type: !5)
!395 = !DILocation(line: 51, column: 46, scope: !387)
!396 = !DILocalVariable(name: "strategy", arg: 4, scope: !387, file: !9, line: 51, type: !5)
!397 = !DILocation(line: 51, column: 57, scope: !387)
!398 = !DILocalVariable(name: "windowBits", arg: 5, scope: !387, file: !9, line: 52, type: !5)
!399 = !DILocation(line: 52, column: 13, scope: !387)
!400 = !DILocalVariable(name: "dictionary", arg: 6, scope: !387, file: !9, line: 52, type: !272)
!401 = !DILocation(line: 52, column: 34, scope: !387)
!402 = !DILocalVariable(name: "dictLength", arg: 7, scope: !387, file: !9, line: 52, type: !5)
!403 = !DILocation(line: 52, column: 50, scope: !387)
!404 = !DILocalVariable(name: "ret", scope: !387, file: !9, line: 54, type: !5)
!405 = !DILocation(line: 54, column: 6, scope: !387)
!406 = !DILocalVariable(name: "flush", scope: !387, file: !9, line: 54, type: !5)
!407 = !DILocation(line: 54, column: 11, scope: !387)
!408 = !DILocalVariable(name: "have", scope: !387, file: !9, line: 55, type: !31)
!409 = !DILocation(line: 55, column: 11, scope: !387)
!410 = !DILocalVariable(name: "strm", scope: !387, file: !9, line: 56, type: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !412, line: 106, baseType: !413)
!412 = !DIFile(filename: "/usr/local/include/zlib.h", directory: "/home/lichi/Desktop")
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !412, line: 86, size: 896, align: 64, elements: !414)
!414 = !{!415, !420, !422, !424, !425, !426, !427, !428, !431, !437, !442, !443, !444, !445}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !413, file: !412, line: 87, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !418, line: 400, baseType: !419)
!418 = !DIFile(filename: "/usr/local/include/zconf.h", directory: "/home/lichi/Desktop")
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !418, line: 391, baseType: !54)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !413, file: !412, line: 88, baseType: !421, size: 32, align: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !418, line: 393, baseType: !31)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !413, file: !412, line: 89, baseType: !423, size: 64, align: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !418, line: 394, baseType: !184)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !413, file: !412, line: 91, baseType: !416, size: 64, align: 64, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !413, file: !412, line: 92, baseType: !421, size: 32, align: 32, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !413, file: !412, line: 93, baseType: !423, size: 64, align: 64, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !413, file: !412, line: 95, baseType: !13, size: 64, align: 64, offset: 384)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !413, file: !412, line: 96, baseType: !429, size: 64, align: 64, offset: 448)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !412, line: 84, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !413, file: !412, line: 98, baseType: !432, size: 64, align: 64, offset: 512)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !412, line: 81, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!436, !436, !421, !421}
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !418, line: 409, baseType: !4)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !413, file: !412, line: 99, baseType: !438, size: 64, align: 64, offset: 576)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !412, line: 82, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !436, !436}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !413, file: !412, line: 100, baseType: !436, size: 64, align: 64, offset: 640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !413, file: !412, line: 102, baseType: !5, size: 32, align: 32, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !413, file: !412, line: 104, baseType: !423, size: 64, align: 64, offset: 768)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !413, file: !412, line: 105, baseType: !423, size: 64, align: 64, offset: 832)
!446 = !DILocation(line: 56, column: 11, scope: !387)
!447 = !DILocalVariable(name: "in", scope: !387, file: !9, line: 57, type: !448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!449 = !DILocation(line: 57, column: 17, scope: !387)
!450 = !DILocalVariable(name: "out", scope: !387, file: !9, line: 58, type: !448)
!451 = !DILocation(line: 58, column: 17, scope: !387)
!452 = !DILocalVariable(name: "chunk_i", scope: !387, file: !9, line: 59, type: !31)
!453 = !DILocation(line: 59, column: 15, scope: !387)
!454 = !DILocation(line: 59, column: 25, scope: !387)
!455 = !DILocalVariable(name: "chunk_o", scope: !387, file: !9, line: 60, type: !31)
!456 = !DILocation(line: 60, column: 15, scope: !387)
!457 = !DILocation(line: 60, column: 25, scope: !387)
!458 = !DILocation(line: 62, column: 14, scope: !387)
!459 = !DILocation(line: 62, column: 7, scope: !387)
!460 = !DILocation(line: 62, column: 5, scope: !387)
!461 = !DILocation(line: 63, column: 6, scope: !462)
!462 = distinct !DILexicalBlock(scope: !387, file: !9, line: 63, column: 6)
!463 = !DILocation(line: 63, column: 9, scope: !462)
!464 = !DILocation(line: 63, column: 6, scope: !387)
!465 = !DILocation(line: 64, column: 3, scope: !462)
!466 = !DILocation(line: 66, column: 15, scope: !387)
!467 = !DILocation(line: 66, column: 8, scope: !387)
!468 = !DILocation(line: 66, column: 6, scope: !387)
!469 = !DILocation(line: 67, column: 6, scope: !470)
!470 = distinct !DILexicalBlock(scope: !387, file: !9, line: 67, column: 6)
!471 = !DILocation(line: 67, column: 10, scope: !470)
!472 = !DILocation(line: 67, column: 6, scope: !387)
!473 = !DILocation(line: 68, column: 8, scope: !474)
!474 = distinct !DILexicalBlock(scope: !470, file: !9, line: 67, column: 18)
!475 = !DILocation(line: 68, column: 3, scope: !474)
!476 = !DILocation(line: 69, column: 3, scope: !474)
!477 = !DILocation(line: 73, column: 7, scope: !387)
!478 = !DILocation(line: 73, column: 14, scope: !387)
!479 = !DILocation(line: 74, column: 7, scope: !387)
!480 = !DILocation(line: 74, column: 13, scope: !387)
!481 = !DILocation(line: 75, column: 7, scope: !387)
!482 = !DILocation(line: 75, column: 14, scope: !387)
!483 = !DILocation(line: 76, column: 7, scope: !387)
!484 = !DILocation(line: 76, column: 6, scope: !387)
!485 = !DILocation(line: 78, column: 6, scope: !486)
!486 = distinct !DILexicalBlock(scope: !387, file: !9, line: 78, column: 6)
!487 = !DILocation(line: 78, column: 10, scope: !486)
!488 = !DILocation(line: 78, column: 6, scope: !387)
!489 = !DILocation(line: 79, column: 8, scope: !490)
!490 = distinct !DILexicalBlock(scope: !486, file: !9, line: 78, column: 18)
!491 = !DILocation(line: 79, column: 3, scope: !490)
!492 = !DILocation(line: 80, column: 8, scope: !490)
!493 = !DILocation(line: 80, column: 3, scope: !490)
!494 = !DILocation(line: 81, column: 10, scope: !490)
!495 = !DILocation(line: 81, column: 3, scope: !490)
!496 = !DILocation(line: 84, column: 6, scope: !497)
!497 = distinct !DILexicalBlock(scope: !387, file: !9, line: 84, column: 6)
!498 = !DILocation(line: 84, column: 17, scope: !497)
!499 = !DILocation(line: 84, column: 6, scope: !387)
!500 = !DILocation(line: 85, column: 37, scope: !501)
!501 = distinct !DILexicalBlock(scope: !497, file: !9, line: 84, column: 22)
!502 = !DILocation(line: 85, column: 49, scope: !501)
!503 = !DILocation(line: 85, column: 9, scope: !501)
!504 = !DILocation(line: 85, column: 7, scope: !501)
!505 = !DILocation(line: 86, column: 7, scope: !506)
!506 = distinct !DILexicalBlock(scope: !501, file: !9, line: 86, column: 7)
!507 = !DILocation(line: 86, column: 11, scope: !506)
!508 = !DILocation(line: 86, column: 7, scope: !501)
!509 = !DILocation(line: 87, column: 9, scope: !510)
!510 = distinct !DILexicalBlock(scope: !506, file: !9, line: 86, column: 19)
!511 = !DILocation(line: 87, column: 4, scope: !510)
