; ModuleID = './libGlibUtils_la-sysLogger.o.i'
source_filename = "./libGlibUtils_la-sysLogger.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.GStaticMutex = type { %union._GMutex*, %union.pthread_mutex_t }
%union._GMutex = type { i8* }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.SysLogger = type { %struct.GlibLogger, i8*, i32 }
%struct.GlibLogger = type { i32, i32, void (i8*, i32, i8*, i8*)*, void (i8*)* }
%struct._GError = type { i32, i32, i8* }

@gSysLoggerLock = internal global %struct.GStaticMutex zeroinitializer, align 8
@gSysLogger = internal global %struct.SysLogger* null, align 8
@.str = private unnamed_addr constant [7 x i8] c"daemon\00", align 1
@.str.1 = private unnamed_addr constant [8 x i8] c"local%d\00", align 1
@.str.2 = private unnamed_addr constant [35 x i8] c"Invalid local facility for %s: %s\0A\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"user\00", align 1
@.str.4 = private unnamed_addr constant [36 x i8] c"Invalid syslog facility for %s: %s\0A\00", align 1
@.str.5 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@__func__.SysLoggerUnref = private unnamed_addr constant [15 x i8] c"SysLoggerUnref\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15, globals: !54)
!1 = !DIFile(filename: "libGlibUtils_la-sysLogger.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line280")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 51, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line280")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!7 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!8 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!9 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!10 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!11 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!12 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!13 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!14 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!15 = !{!16, !17, !21, !52}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !19, line: 46, baseType: !20)
!19 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line280")
!20 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysLogger", file: !23, line: 37, baseType: !24)
!23 = !DIFile(filename: "sysLogger.c", directory: "/home/lichi/Desktop/open-vm-tools/line280")
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SysLogger", file: !23, line: 33, size: 320, align: 64, elements: !25)
!25 = !{!26, !50, !51}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !24, file: !23, line: 34, baseType: !27, size: 192, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "GlibLogger", file: !28, line: 57, baseType: !29)
!28 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/glibUtils.h", directory: "/home/lichi/Desktop/open-vm-tools/line280")
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GlibLogger", file: !28, line: 52, size: 192, align: 64, elements: !30)
!30 = !{!31, !35, !36, !45}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !29, file: !28, line: 53, baseType: !32, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !19, line: 50, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !19, line: 49, baseType: !34)
!34 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "addsTimestamp", scope: !29, file: !28, line: 54, baseType: !32, size: 32, align: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "logfn", scope: !29, file: !28, line: 55, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLogFunc", file: !4, line: 71, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !41, !43, !41, !44}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLogLevelFlags", file: !4, line: 66, baseType: !3)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !19, line: 77, baseType: !16)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "dtor", scope: !29, file: !28, line: 56, baseType: !46, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "GDestroyNotify", file: !19, line: 87, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !44}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !24, file: !23, line: 35, baseType: !17, size: 64, align: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !24, file: !23, line: 36, baseType: !33, size: 32, align: 32, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!54 = !{!55, !56}
!55 = distinct !DIGlobalVariable(name: "gSysLogger", scope: !0, file: !23, line: 40, type: !21, isLocal: true, isDefinition: true, variable: %struct.SysLogger** @gSysLogger)
!56 = distinct !DIGlobalVariable(name: "gSysLoggerLock", scope: !0, file: !23, line: 41, type: !57, isLocal: true, isDefinition: true, variable: %struct.GStaticMutex* @gSysLoggerLock)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "GStaticMutex", file: !58, line: 140, baseType: !59)
!58 = !DIFile(filename: "/usr/include/glib-2.0/glib/deprecated/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line280")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 133, size: 384, align: 64, elements: !60)
!60 = !{!61, !74}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !59, file: !58, line: 135, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMutex", file: !64, line: 51, baseType: !65)
!64 = !DIFile(filename: "/usr/include/glib-2.0/glib/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line280")
!65 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GMutex", file: !64, line: 58, size: 64, align: 64, elements: !66)
!66 = !{!67, !68}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !65, file: !64, line: 61, baseType: !44, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !65, file: !64, line: 62, baseType: !69, size: 64, align: 32)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 64, align: 32, elements: !72)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !19, line: 55, baseType: !71)
!71 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!72 = !{!73}
!73 = !DISubrange(count: 2)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !59, file: !58, line: 138, baseType: !75, size: 320, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !76, line: 128, baseType: !77)
!76 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line280")
!77 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !76, line: 90, size: 320, align: 64, elements: !78)
!78 = !{!79, !97, !101}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !77, file: !76, line: 125, baseType: !80, size: 320, align: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !76, line: 92, size: 320, align: 64, elements: !81)
!81 = !{!82, !83, !84, !85, !86, !87, !89, !90}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !80, file: !76, line: 94, baseType: !34, size: 32, align: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !80, file: !76, line: 95, baseType: !71, size: 32, align: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !80, file: !76, line: 96, baseType: !34, size: 32, align: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !80, file: !76, line: 98, baseType: !71, size: 32, align: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !80, file: !76, line: 102, baseType: !34, size: 32, align: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !80, file: !76, line: 104, baseType: !88, size: 16, align: 16, offset: 160)
!88 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !80, file: !76, line: 105, baseType: !88, size: 16, align: 16, offset: 176)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !80, file: !76, line: 106, baseType: !91, size: 128, align: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !76, line: 79, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !76, line: 75, size: 128, align: 64, elements: !93)
!93 = !{!94, !96}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !92, file: !76, line: 77, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !92, file: !76, line: 78, baseType: !95, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !77, file: !76, line: 126, baseType: !98, size: 320, align: 8)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 320, align: 8, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 40)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !77, file: !76, line: 127, baseType: !102, size: 64, align: 64)
!102 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!103 = !{i32 2, !"Dwarf Version", i32 4}
!104 = !{i32 2, !"Debug Info Version", i32 3}
!105 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!106 = distinct !DISubprogram(name: "GlibUtils_CreateSysLogger", scope: !23, file: !23, line: 140, type: !107, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !110)
!107 = !DISubroutineType(types: !108)
!108 = !{!109, !52, !52}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!110 = !{}
!111 = !DILocalVariable(name: "domain", arg: 1, scope: !106, file: !23, line: 140, type: !52)
!112 = !DIExpression()
!113 = !DILocation(line: 140, column: 39, scope: !106)
!114 = !DILocalVariable(name: "facility", arg: 2, scope: !106, file: !23, line: 141, type: !52)
!115 = !DILocation(line: 141, column: 39, scope: !106)
!116 = !DILocation(line: 143, column: 18, scope: !106)
!117 = !DILocation(line: 143, column: 4, scope: !118)
!118 = !DILexicalBlockFile(scope: !106, file: !23, discriminator: 1)
!119 = !DILocation(line: 144, column: 8, scope: !120)
!120 = distinct !DILexicalBlock(scope: !106, file: !23, line: 144, column: 8)
!121 = !DILocation(line: 144, column: 19, scope: !120)
!122 = !DILocation(line: 144, column: 8, scope: !106)
!123 = !DILocalVariable(name: "facid", scope: !124, file: !23, line: 145, type: !34)
!124 = distinct !DILexicalBlock(scope: !120, file: !23, line: 144, column: 27)
!125 = !DILocation(line: 145, column: 11, scope: !124)
!126 = !DILocation(line: 147, column: 11, scope: !127)
!127 = distinct !DILexicalBlock(scope: !124, file: !23, line: 147, column: 11)
!128 = !DILocation(line: 147, column: 20, scope: !127)
!129 = !DILocation(line: 147, column: 11, scope: !124)
!130 = !DILocalVariable(name: "idx", scope: !131, file: !23, line: 148, type: !34)
!131 = distinct !DILexicalBlock(scope: !127, file: !23, line: 147, column: 28)
!132 = !DILocation(line: 148, column: 14, scope: !131)
!133 = !DILocation(line: 149, column: 21, scope: !134)
!134 = distinct !DILexicalBlock(scope: !131, file: !23, line: 149, column: 14)
!135 = !DILocation(line: 149, column: 14, scope: !134)
!136 = !DILocation(line: 149, column: 41, scope: !134)
!137 = !DILocation(line: 149, column: 14, scope: !131)
!138 = !DILocation(line: 150, column: 19, scope: !139)
!139 = distinct !DILexicalBlock(scope: !134, file: !23, line: 149, column: 47)
!140 = !DILocation(line: 151, column: 10, scope: !139)
!141 = !DILocation(line: 151, column: 28, scope: !142)
!142 = !DILexicalBlockFile(scope: !143, file: !23, discriminator: 1)
!143 = distinct !DILexicalBlock(scope: !134, file: !23, line: 151, column: 21)
!144 = !DILocation(line: 151, column: 21, scope: !142)
!145 = !DILocation(line: 151, column: 55, scope: !142)
!146 = !DILocation(line: 152, column: 21, scope: !147)
!147 = distinct !DILexicalBlock(scope: !143, file: !23, line: 151, column: 61)
!148 = !DILocation(line: 152, column: 13, scope: !147)
!149 = !DILocation(line: 154, column: 22, scope: !150)
!150 = distinct !DILexicalBlock(scope: !147, file: !23, line: 152, column: 26)
!151 = !DILocation(line: 155, column: 16, scope: !150)
!152 = !DILocation(line: 158, column: 22, scope: !150)
!153 = !DILocation(line: 159, column: 16, scope: !150)
!154 = !DILocation(line: 162, column: 22, scope: !150)
!155 = !DILocation(line: 163, column: 16, scope: !150)
