; ModuleID = '/home/lichi/Desktop/genwqe/[task]tools--genwqe_memcopy/[inter]tools--genwqe_memcopy.o.i'
source_filename = "/home/lichi/Desktop/genwqe/[task]tools--genwqe_memcopy/[inter]tools--genwqe_memcopy.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.memcpy_thread_data = type { i32, i64, %struct.card_dev_t*, i8*, i8*, %struct.memcpy_in_parms*, i64, i32, i32, i32, i64, i64, %struct.timespec, %struct.timespec }
%struct.card_dev_t = type opaque
%struct.memcpy_in_parms = type { i32, i32, i32, i8, i32, i32, i8, i32, i32, i32, %struct._IO_FILE*, %struct._IO_FILE*, i64, i32, i32, i32, i32, i32, i32, i32, %struct.timespec, %struct.timespec, i32 }
%struct.timespec = type { i64, i64 }
%union.pthread_attr_t = type { i64, [48 x i8] }
%struct.ddcb_cmd = type { i64, i64, i8, i8, i8, i8, i16, i16, i16, i16, i32, i64, i64, i64, i64, [64 x i8], %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i64, [96 x i8] }
%struct._asv_runtime_dma_error = type { i64, i32, i16, i16, i64, i64, i64, i32, i16, i16, i64, i64 }

!140 = !DIEnumerator(name: "_SC_BARRIERS", value: 133)
!141 = !DIEnumerator(name: "_SC_BASE", value: 134)
!142 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135)
!143 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136)
!144 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137)
!145 = !DIEnumerator(name: "_SC_CPUTIME", value: 138)
!146 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139)
!147 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!148 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!149 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!150 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!151 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!152 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!153 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!154 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!155 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!156 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!157 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!158 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!159 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!160 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!161 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!162 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!163 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!164 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!165 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!166 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!167 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!168 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!169 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!170 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!171 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!172 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!173 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!174 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!175 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!176 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!177 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!178 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!179 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!180 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!181 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!182 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!183 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!184 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!185 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!186 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!187 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!188 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!189 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!190 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!191 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!192 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!193 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!194 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!195 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!196 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!197 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!198 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!199 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!200 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!201 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!202 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!203 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!204 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!205 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!206 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!207 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!208 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!209 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!210 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!211 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!212 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!213 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!214 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!215 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!216 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!217 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!218 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!219 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!220 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!221 = !{!222, !225, !223, !226, !231, !348, !352, !243, !357, !400, !416, !437, !235, !439, !330, !376, !295, !440, !361, !371, !452, !242, !323}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memcpy_thread_data", file: !228, line: 98, size: 960, align: 64, elements: !229)
!228 = !DIFile(filename: "genwqe_memcopy.c", directory: "/home/lichi/Desktop")
!229 = !{!230, !232, !236, !241, !246, !247, !343, !344, !345, !346, !347, !349, !350, !351}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !227, file: !228, line: 99, baseType: !231, size: 32, align: 32)
!231 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !227, file: !228, line: 100, baseType: !233, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !234, line: 60, baseType: !235)
!234 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop")
!235 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "accel", scope: !227, file: !228, line: 101, baseType: !237, size: 64, align: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "accel_t", file: !238, line: 198, baseType: !239)
!238 = !DIFile(filename: "../include/libddcb.h", directory: "/home/lichi/Desktop")
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "card_dev_t", file: !238, line: 198, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf4k", scope: !227, file: !228, line: 102, baseType: !242, size: 64, align: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !244, line: 48, baseType: !245)
!244 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop")
!245 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !227, file: !228, line: 103, baseType: !242, size: 64, align: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !227, file: !228, line: 104, baseType: !248, size: 64, align: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memcpy_in_parms", file: !228, line: 72, size: 1088, align: 64, elements: !250)
!250 = !{!251, !252, !253, !254, !256, !257, !258, !259, !260, !261, !262, !321, !322, !324, !326, !327, !328, !329, !331, !332, !333, !341, !342}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "card_no", scope: !249, file: !228, line: 73, baseType: !231, size: 32, align: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "card_type", scope: !249, file: !228, line: 74, baseType: !231, size: 32, align: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !249, file: !228, line: 75, baseType: !231, size: 32, align: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !249, file: !228, line: 76, baseType: !255, size: 8, align: 8, offset: 96)
!255 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !249, file: !228, line: 77, baseType: !231, size: 32, align: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !249, file: !228, line: 78, baseType: !231, size: 32, align: 32, offset: 160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "force_cmp", scope: !249, file: !228, line: 79, baseType: !255, size: 8, align: 8, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "use_sglist", scope: !249, file: !228, line: 80, baseType: !231, size: 32, align: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "preload", scope: !249, file: !228, line: 81, baseType: !231, size: 32, align: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !249, file: !228, line: 82, baseType: !231, size: 32, align: 32, offset: 288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "o_fp", scope: !249, file: !228, line: 83, baseType: !263, size: 64, align: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !265, line: 48, baseType: !266)
!265 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop")
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !267, line: 241, size: 1728, align: 64, elements: !268)
!267 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop")
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !289, !290, !291, !292, !296, !298, !300, !304, !307, !309, !310, !311, !312, !313, !316, !317}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !266, file: !267, line: 242, baseType: !231, size: 32, align: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !266, file: !267, line: 247, baseType: !223, size: 64, align: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !266, file: !267, line: 248, baseType: !223, size: 64, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !266, file: !267, line: 249, baseType: !223, size: 64, align: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !266, file: !267, line: 250, baseType: !223, size: 64, align: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !266, file: !267, line: 251, baseType: !223, size: 64, align: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !266, file: !267, line: 252, baseType: !223, size: 64, align: 64, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !266, file: !267, line: 253, baseType: !223, size: 64, align: 64, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !266, file: !267, line: 254, baseType: !223, size: 64, align: 64, offset: 512)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !266, file: !267, line: 256, baseType: !223, size: 64, align: 64, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !266, file: !267, line: 257, baseType: !223, size: 64, align: 64, offset: 640)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !266, file: !267, line: 258, baseType: !223, size: 64, align: 64, offset: 704)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !266, file: !267, line: 260, baseType: !282, size: 64, align: 64, offset: 768)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !267, line: 156, size: 192, align: 64, elements: !284)
!284 = !{!285, !286, !288}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !283, file: !267, line: 157, baseType: !282, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !283, file: !267, line: 158, baseType: !287, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !283, file: !267, line: 162, baseType: !231, size: 32, align: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !266, file: !267, line: 262, baseType: !287, size: 64, align: 64, offset: 832)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !266, file: !267, line: 264, baseType: !231, size: 32, align: 32, offset: 896)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !266, file: !267, line: 268, baseType: !231, size: 32, align: 32, offset: 928)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !266, file: !267, line: 270, baseType: !293, size: 64, align: 64, offset: 960)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !294, line: 131, baseType: !295)
!294 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop")
!295 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !266, file: !267, line: 274, baseType: !297, size: 16, align: 16, offset: 1024)
!297 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !266, file: !267, line: 275, baseType: !299, size: 8, align: 8, offset: 1040)
!299 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !266, file: !267, line: 276, baseType: !301, size: 8, align: 8, offset: 1048)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 8, align: 8, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 1)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !266, file: !267, line: 280, baseType: !305, size: 64, align: 64, offset: 1088)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !267, line: 150, baseType: null)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !266, file: !267, line: 289, baseType: !308, size: 64, align: 64, offset: 1152)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !294, line: 132, baseType: !295)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !266, file: !267, line: 297, baseType: !225, size: 64, align: 64, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !266, file: !267, line: 298, baseType: !225, size: 64, align: 64, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !266, file: !267, line: 299, baseType: !225, size: 64, align: 64, offset: 1344)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !266, file: !267, line: 300, baseType: !225, size: 64, align: 64, offset: 1408)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !266, file: !267, line: 302, baseType: !314, size: 64, align: 64, offset: 1472)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !315, line: 216, baseType: !235)
!315 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop")
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !266, file: !267, line: 303, baseType: !231, size: 32, align: 32, offset: 1536)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !266, file: !267, line: 305, baseType: !318, size: 160, align: 8, offset: 1568)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 160, align: 8, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 20)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "fpattern", scope: !249, file: !228, line: 84, baseType: !263, size: 64, align: 64, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "in_ats_type", scope: !249, file: !228, line: 85, baseType: !323, size: 64, align: 64, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !244, line: 55, baseType: !235)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !249, file: !228, line: 86, baseType: !325, size: 32, align: 32, offset: 512)
!325 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "data_buf_size", scope: !249, file: !228, line: 87, baseType: !231, size: 32, align: 32, offset: 544)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pgoffs_i", scope: !249, file: !228, line: 88, baseType: !325, size: 32, align: 32, offset: 576)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pgoffs_o", scope: !249, file: !228, line: 89, baseType: !325, size: 32, align: 32, offset: 608)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "mcpy_crc32", scope: !249, file: !228, line: 90, baseType: !330, size: 32, align: 32, offset: 640)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !244, line: 51, baseType: !325)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mcpy_adler32", scope: !249, file: !228, line: 91, baseType: !330, size: 32, align: 32, offset: 672)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "have_threads", scope: !249, file: !228, line: 92, baseType: !231, size: 32, align: 32, offset: 704)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !249, file: !228, line: 93, baseType: !334, size: 128, align: 64, offset: 768)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !335, line: 120, size: 128, align: 64, elements: !336)
!335 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop")
!336 = !{!337, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !334, file: !335, line: 122, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !294, line: 139, baseType: !295)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !334, file: !335, line: 123, baseType: !340, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !294, line: 175, baseType: !295)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "etime", scope: !249, file: !228, line: 94, baseType: !334, size: 128, align: 64, offset: 896)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "err_inj", scope: !249, file: !228, line: 95, baseType: !325, size: 32, align: 32, offset: 1024)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "out_ats_type", scope: !227, file: !228, line: 105, baseType: !323, size: 64, align: 64, offset: 384)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !227, file: !228, line: 107, baseType: !231, size: 32, align: 32, offset: 448)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !227, file: !228, line: 108, baseType: !231, size: 32, align: 32, offset: 480)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "memcopies", scope: !227, file: !228, line: 109, baseType: !231, size: 32, align: 32, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_copied", scope: !227, file: !228, line: 110, baseType: !348, size: 64, align: 64, offset: 576)
!348 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "total_usec", scope: !227, file: !228, line: 111, baseType: !323, size: 64, align: 64, offset: 640)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !227, file: !228, line: 112, baseType: !334, size: 128, align: 64, offset: 704)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "etime", scope: !227, file: !228, line: 113, baseType: !334, size: 128, align: 64, offset: 832)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !353, line: 85, baseType: !354)
!353 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop")
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !231}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ddcb_cmd", file: !238, line: 154, size: 1856, align: 64, elements: !359)
!359 = !{!360, !364, !365, !367, !368, !369, !370, !372, !373, !374, !375, !377, !378, !379, !380, !381, !385}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "next_addr", scope: !358, file: !238, line: 155, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !362, line: 30, baseType: !363)
!362 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop")
!363 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !358, file: !238, line: 156, baseType: !361, size: 64, align: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "acfunc", scope: !358, file: !238, line: 158, baseType: !366, size: 8, align: 8, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !362, line: 20, baseType: !245)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !358, file: !238, line: 159, baseType: !366, size: 8, align: 8, offset: 136)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "asiv_length", scope: !358, file: !238, line: 160, baseType: !366, size: 8, align: 8, offset: 144)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "asv_length", scope: !358, file: !238, line: 161, baseType: !366, size: 8, align: 8, offset: 152)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "cmdopts", scope: !358, file: !238, line: 162, baseType: !371, size: 16, align: 16, offset: 160)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !362, line: 23, baseType: !297)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "retc", scope: !358, file: !238, line: 163, baseType: !371, size: 16, align: 16, offset: 176)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "attn", scope: !358, file: !238, line: 165, baseType: !371, size: 16, align: 16, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "vcrc", scope: !358, file: !238, line: 166, baseType: !371, size: 16, align: 16, offset: 208)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !358, file: !238, line: 167, baseType: !376, size: 32, align: 32, offset: 224)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !362, line: 26, baseType: !325)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "deque_ts", scope: !358, file: !238, line: 169, baseType: !361, size: 64, align: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "cmplt_ts", scope: !358, file: !238, line: 170, baseType: !361, size: 64, align: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "disp_ts", scope: !358, file: !238, line: 171, baseType: !361, size: 64, align: 64, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ddata_addr", scope: !358, file: !238, line: 173, baseType: !361, size: 64, align: 64, offset: 448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "asv", scope: !358, file: !238, line: 175, baseType: !382, size: 512, align: 8, offset: 512)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 512, align: 8, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, scope: !358, file: !238, line: 177, baseType: !386, size: 832, align: 64, offset: 1024)
!386 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !358, file: !238, line: 177, size: 832, align: 64, elements: !387)
!387 = !{!388, !396}
!388 = !DIDerivedType(tag: DW_TAG_member, scope: !386, file: !238, line: 179, baseType: !389, size: 832, align: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !238, line: 179, size: 832, align: 64, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ats", scope: !389, file: !238, line: 180, baseType: !361, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "asiv", scope: !389, file: !238, line: 181, baseType: !393, size: 768, align: 8, offset: 64)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 768, align: 8, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__asiv", scope: !386, file: !238, line: 184, baseType: !397, size: 832, align: 8)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 832, align: 8, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 104)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_asv_runtime_dma_error", file: !238, line: 122, size: 512, align: 8, elements: !402)
!402 = !{!403, !404, !405, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "raddr_be64", scope: !401, file: !238, line: 123, baseType: !323, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rfmt_chan_disccnt_be32", scope: !401, file: !238, line: 125, baseType: !330, size: 32, align: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "rdmae_be16", scope: !401, file: !238, line: 126, baseType: !406, size: 16, align: 16, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !244, line: 49, baseType: !297)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rsge_be16", scope: !401, file: !238, line: 127, baseType: !406, size: 16, align: 16, offset: 112)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "res0", scope: !401, file: !238, line: 129, baseType: !323, size: 64, align: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !401, file: !238, line: 130, baseType: !323, size: 64, align: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "waddr_be64", scope: !401, file: !238, line: 131, baseType: !323, size: 64, align: 64, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "wfmt_chan_disccnt_be32", scope: !401, file: !238, line: 133, baseType: !330, size: 32, align: 32, offset: 320)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "wdmae_be16", scope: !401, file: !238, line: 134, baseType: !406, size: 16, align: 16, offset: 352)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "wsge_be16", scope: !401, file: !238, line: 135, baseType: !406, size: 16, align: 16, offset: 368)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "res2", scope: !401, file: !238, line: 137, baseType: !323, size: 64, align: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "res3", scope: !401, file: !238, line: 138, baseType: !323, size: 64, align: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asiv_memcpy", file: !418, line: 42, size: 768, align: 8, elements: !419)
!418 = !DIFile(filename: "../include/memcopy_ddcb.h", directory: "/home/lichi/Desktop")
!419 = !{!420, !421, !422, !423, !424, !425, !426, !430, !431, !432, !433}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "inp_buff", scope: !417, file: !418, line: 43, baseType: !323, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "inp_buff_len", scope: !417, file: !418, line: 44, baseType: !330, size: 32, align: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "in_crc32", scope: !417, file: !418, line: 45, baseType: !330, size: 32, align: 32, offset: 96)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "outp_buff", scope: !417, file: !418, line: 47, baseType: !323, size: 64, align: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "outp_buff_len", scope: !417, file: !418, line: 48, baseType: !330, size: 32, align: 32, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "in_adler32", scope: !417, file: !418, line: 49, baseType: !330, size: 32, align: 32, offset: 224)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "res0", scope: !417, file: !418, line: 51, baseType: !427, size: 256, align: 64, offset: 256)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 256, align: 64, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 4)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !417, file: !418, line: 52, baseType: !406, size: 16, align: 16, offset: 512)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "input_lists", scope: !417, file: !418, line: 53, baseType: !406, size: 16, align: 16, offset: 528)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "res2", scope: !417, file: !418, line: 54, baseType: !330, size: 32, align: 32, offset: 544)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "res3", scope: !417, file: !418, line: 56, baseType: !434, size: 192, align: 64, offset: 576)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 192, align: 64, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 3)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be64", file: !438, line: 32, baseType: !361)
!438 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/lichi/Desktop")
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !438, line: 30, baseType: !376)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asv_memcpy", file: !418, line: 63, size: 512, align: 8, elements: !442)
!442 = !{!443, !447, !448, !449, !450, !451}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "res0", scope: !441, file: !418, line: 64, baseType: !444, size: 128, align: 64)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 128, align: 64, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 2)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "out_crc32", scope: !441, file: !418, line: 65, baseType: !330, size: 32, align: 32, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "out_adler32", scope: !441, file: !418, line: 66, baseType: !330, size: 32, align: 32, offset: 160)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "inp_processed", scope: !441, file: !418, line: 67, baseType: !330, size: 32, align: 32, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "outp_returned", scope: !441, file: !418, line: 68, baseType: !330, size: 32, align: 32, offset: 224)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !441, file: !418, line: 69, baseType: !427, size: 256, align: 64, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !438, line: 28, baseType: !371)
!453 = !{!454, !455, !471, !472}
!454 = distinct !DIGlobalVariable(name: "verbose_flag", scope: !0, file: !228, line: 47, type: !231, isLocal: false, isDefinition: true, variable: i32* @verbose_flag)
!455 = distinct !DIGlobalVariable(name: "long_options", scope: !456, file: !228, line: 696, type: !460, isLocal: true, isDefinition: true, variable: [20 x %struct.option]* @main.long_options)
!456 = distinct !DISubprogram(name: "main", scope: !228, file: !228, line: 650, type: !457, isLocal: false, isDefinition: true, scopeLine: 651, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !459)
!457 = !DISubroutineType(types: !458)
!458 = !{!231, !231, !222}
!459 = !{}
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 5120, align: 64, elements: !319)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !462, line: 104, size: 256, align: 64, elements: !463)
!462 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/lichi/Desktop")
!463 = !{!464, !467, !468, !470}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !461, file: !462, line: 106, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !461, file: !462, line: 109, baseType: !231, size: 32, align: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !461, file: !462, line: 110, baseType: !469, size: 64, align: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !461, file: !462, line: 111, baseType: !231, size: 32, align: 32, offset: 192)
!471 = distinct !DIGlobalVariable(name: "version", scope: !0, file: !228, line: 45, type: !465, isLocal: true, isDefinition: true, variable: i8** @version)
!472 = distinct !DIGlobalVariable(name: "stop_memcopying", scope: !0, file: !228, line: 193, type: !255, isLocal: true, isDefinition: true, variable: i8* @stop_memcopying)
!473 = !{i32 2, !"Dwarf Version", i32 4}
!474 = !{i32 2, !"Debug Info Version", i32 3}
!475 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!476 = !DILocalVariable(name: "argc", arg: 1, scope: !456, file: !228, line: 650, type: !231)
!477 = !DIExpression()
!478 = !DILocation(line: 650, column: 14, scope: !456)
!479 = !DILocalVariable(name: "argv", arg: 2, scope: !456, file: !228, line: 650, type: !222)
!480 = !DILocation(line: 650, column: 26, scope: !456)
!481 = !DILocalVariable(name: "cmd", scope: !456, file: !228, line: 652, type: !231)
!482 = !DILocation(line: 652, column: 6, scope: !456)
!483 = !DILocalVariable(name: "endptr", scope: !456, file: !228, line: 653, type: !223)
!484 = !DILocation(line: 653, column: 8, scope: !456)
!485 = !DILocalVariable(name: "tid", scope: !456, file: !228, line: 654, type: !233)
!486 = !DILocation(line: 654, column: 12, scope: !456)
!487 = !DILocalVariable(name: "thread", scope: !456, file: !228, line: 655, type: !231)
!488 = !DILocation(line: 655, column: 6, scope: !456)
!489 = !DILocalVariable(name: "out_f", scope: !456, file: !228, line: 656, type: !223)
!490 = !DILocation(line: 656, column: 8, scope: !456)
!491 = !DILocalVariable(name: "err_code", scope: !456, file: !228, line: 657, type: !231)
!492 = !DILocation(line: 657, column: 6, scope: !456)
!493 = !DILocalVariable(name: "frequency", scope: !456, file: !228, line: 658, type: !363)
!494 = !DILocation(line: 658, column: 21, scope: !456)
!495 = !DILocalVariable(name: "wtime_usec", scope: !456, file: !228, line: 658, type: !363)
!496 = !DILocation(line: 658, column: 32, scope: !456)
!497 = !DILocalVariable(name: "wtime_e", scope: !456, file: !228, line: 658, type: !363)
!498 = !DILocation(line: 658, column: 48, scope: !456)
!499 = !DILocalVariable(name: "bytes_copied", scope: !456, file: !228, line: 661, type: !348)
!500 = !DILocation(line: 661, column: 12, scope: !456)
!501 = !DILocalVariable(name: "total_usec", scope: !456, file: !228, line: 662, type: !323)
!502 = !DILocation(line: 662, column: 11, scope: !456)
!503 = !DILocalVariable(name: "total_msec", scope: !456, file: !228, line: 663, type: !323)
!504 = !DILocation(line: 663, column: 11, scope: !456)
!505 = !DILocalVariable(name: "memcopies", scope: !456, file: !228, line: 664, type: !231)
!506 = !DILocation(line: 664, column: 6, scope: !456)
!507 = !DILocalVariable(name: "errors", scope: !456, file: !228, line: 665, type: !231)
!508 = !DILocation(line: 665, column: 6, scope: !456)
!509 = !DILocalVariable(name: "mib", scope: !456, file: !228, line: 666, type: !231)
!510 = !DILocation(line: 666, column: 6, scope: !456)
!511 = !DILocalVariable(name: "kib", scope: !456, file: !228, line: 666, type: !231)
!512 = !DILocation(line: 666, column: 11, scope: !456)
!513 = !DILocalVariable(name: "kibs", scope: !456, file: !228, line: 667, type: !235)
!514 = !DILocation(line: 667, column: 16, scope: !456)
!515 = !DILocalVariable(name: "mibs", scope: !456, file: !228, line: 667, type: !235)
!516 = !DILocation(line: 667, column: 22, scope: !456)
!517 = !DILocalVariable(name: "tdata", scope: !456, file: !228, line: 668, type: !226)
!518 = !DILocation(line: 668, column: 29, scope: !456)
!519 = !DILocalVariable(name: "pt", scope: !456, file: !228, line: 669, type: !226)
!520 = !DILocation(line: 669, column: 29, scope: !456)
!521 = !DILocalVariable(name: "ip", scope: !456, file: !228, line: 670, type: !249)
!522 = !DILocation(line: 670, column: 25, scope: !456)
!523 = !DILocation(line: 672, column: 5, scope: !456)
