; ModuleID = './[inter]src--querycmd.o.i'
source_filename = "./[inter]src--querycmd.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.cmdinfo = type { i8*, i8, i32, i32*, i8**, void (%struct.cmdinfo*, i8*)*, i32, i8*, i32 (i8**)* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.varbuf = type { i64, i64, i8* }
%struct.fsys_namenode_list = type { %struct.fsys_namenode_list*, %struct.fsys_namenode* }
%struct.fsys_namenode = type { %struct.fsys_namenode*, i8*, %struct.pkg_list*, %struct.fsys_diversion*, %struct.file_stat*, %struct.trigfileint*, i32, i8*, i8*, %struct.file_ondisk_id* }
%struct.pkg_list = type { %struct.pkg_list*, %struct.pkginfo* }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.1, i32 }
%struct.anon.1 = type { %struct.deppossi*, %struct.deppossi* }

!70 = !DIEnumerator(name: "PKG_MULTIARCH_SAME", value: 1)
!71 = !DIEnumerator(name: "PKG_MULTIARCH_ALLOWED", value: 2)
!72 = !DIEnumerator(name: "PKG_MULTIARCH_FOREIGN", value: 3)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_istobe", file: !74, line: 34, size: 32, align: 32, elements: !75)
!74 = !DIFile(filename: "main.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-query")
!75 = !{!76, !77, !78, !79, !80}
!76 = !DIEnumerator(name: "PKG_ISTOBE_NORMAL", value: 0)
!77 = !DIEnumerator(name: "PKG_ISTOBE_REMOVE", value: 1)
!78 = !DIEnumerator(name: "PKG_ISTOBE_INSTALLNEW", value: 2)
!79 = !DIEnumerator(name: "PKG_ISTOBE_DECONFIGURE", value: 3)
!80 = !DIEnumerator(name: "PKG_ISTOBE_PREINSTALL", value: 4)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_cycle_color", file: !74, line: 47, size: 32, align: 32, elements: !82)
!82 = !{!83, !84, !85}
!83 = !DIEnumerator(name: "PKG_CYCLE_WHITE", value: 0)
!84 = !DIEnumerator(name: "PKG_CYCLE_GRAY", value: 1)
!85 = !DIEnumerator(name: "PKG_CYCLE_BLACK", value: 2)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fsys_namenode_flags", file: !87, line: 61, size: 32, align: 32, elements: !88)
!87 = !DIFile(filename: "../lib/dpkg/fsys.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-query")
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!89 = !DIEnumerator(name: "FNNF_NEW_CONFF", value: 1)
!90 = !DIEnumerator(name: "FNNF_NEW_INARCHIVE", value: 2)
!91 = !DIEnumerator(name: "FNNF_OLD_CONFF", value: 4)
!92 = !DIEnumerator(name: "FNNF_OBS_CONFF", value: 8)
!93 = !DIEnumerator(name: "FNNF_ELIDE_OTHER_LISTS", value: 16)
!94 = !DIEnumerator(name: "FNNF_NO_ATOMIC_OVERWRITE", value: 32)
!95 = !DIEnumerator(name: "FNNF_PLACED_ON_DISK", value: 64)
!96 = !DIEnumerator(name: "FNNF_DEFERRED_FSYNC", value: 128)
!97 = !DIEnumerator(name: "FNNF_DEFERRED_RENAME", value: 256)
!98 = !DIEnumerator(name: "FNNF_FILTERED", value: 512)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "modstatdb_rw", file: !4, line: 263, size: 32, align: 32, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108}
!101 = !DIEnumerator(name: "msdbrw_readonly", value: 0)
!102 = !DIEnumerator(name: "msdbrw_needsuperuserlockonly", value: 1)
!103 = !DIEnumerator(name: "msdbrw_writeifposs", value: 2)
!104 = !DIEnumerator(name: "msdbrw_write", value: 3)
!105 = !DIEnumerator(name: "msdbrw_needsuperuser", value: 4)
!106 = !DIEnumerator(name: "msdbrw_available_readonly", value: 256)
!107 = !DIEnumerator(name: "msdbrw_available_write", value: 512)
!108 = !DIEnumerator(name: "msdbrw_available_mask", value: 65280)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_name_arch_when", file: !4, line: 396, size: 32, align: 32, elements: !110)
!110 = !{!111, !112, !113, !114}
!111 = !DIEnumerator(name: "pnaw_never", value: 0)
!112 = !DIEnumerator(name: "pnaw_nonambig", value: 1)
!113 = !DIEnumerator(name: "pnaw_foreign", value: 2)
!114 = !DIEnumerator(name: "pnaw_always", value: 3)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "writedb_flags", file: !4, line: 445, size: 32, align: 32, elements: !116)
!116 = !{!117, !118}
!117 = !DIEnumerator(name: "wdb_dump_available", value: 1)
!118 = !DIEnumerator(name: "wdb_must_sync", value: 2)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "versiondisplayepochwhen", file: !4, line: 388, size: 32, align: 32, elements: !120)
!120 = !{!121, !122, !123}
!121 = !DIEnumerator(name: "vdew_never", value: 0)
!122 = !DIEnumerator(name: "vdew_nonambig", value: 1)
!123 = !DIEnumerator(name: "vdew_always", value: 2)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_spec_flags", file: !125, line: 41, size: 32, align: 32, elements: !126)
!125 = !DIFile(filename: "../lib/dpkg/pkg-spec.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-query")
!126 = !{!127, !128, !129, !130}
!127 = !DIEnumerator(name: "PKG_SPEC_PATTERNS", value: 1)
!128 = !DIEnumerator(name: "PKG_SPEC_ARCH_SINGLE", value: 256)
!129 = !DIEnumerator(name: "PKG_SPEC_ARCH_WILDCARD", value: 512)
!130 = !DIEnumerator(name: "PKG_SPEC_ARCH_MASK", value: 65280)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_msg_type", file: !132, line: 36, size: 32, align: 32, elements: !133)
!132 = !DIFile(filename: "../lib/dpkg/error.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-query")
!133 = !{!134, !135, !136}
!134 = !DIEnumerator(name: "DPKG_MSG_NONE", value: 0)
!135 = !DIEnumerator(name: "DPKG_MSG_WARN", value: 1)
!136 = !DIEnumerator(name: "DPKG_MSG_ERROR", value: 2)
!137 = !{!138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!139 = !{!140, !145, !175, !188, !189, !190}
!140 = distinct !DIGlobalVariable(name: "admindir", scope: !0, file: !141, line: 823, type: !142, isLocal: true, isDefinition: true, variable: i8** @admindir)
!141 = !DIFile(filename: "querycmd.c", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-query")
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!145 = distinct !DIGlobalVariable(name: "cmdinfos", scope: !0, file: !141, line: 828, type: !146, isLocal: true, isDefinition: true, variable: [16 x %struct.cmdinfo]* @cmdinfos)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 8192, align: 64, elements: !173)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmdinfo", file: !149, line: 38, size: 512, align: 64, elements: !150)
!149 = !DIFile(filename: "../lib/dpkg/options.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-query")
!150 = !{!151, !152, !153, !155, !157, !159, !164, !165, !166}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "olong", scope: !148, file: !149, line: 39, baseType: !142, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "oshort", scope: !148, file: !149, line: 40, baseType: !144, size: 8, align: 8, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "takesvalue", scope: !148, file: !149, line: 48, baseType: !154, size: 32, align: 32, offset: 96)
!154 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "iassignto", scope: !148, file: !149, line: 49, baseType: !156, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "sassignto", scope: !148, file: !149, line: 50, baseType: !158, size: 64, align: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !148, file: !149, line: 51, baseType: !160, size: 64, align: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !163, !142}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "arg_int", scope: !148, file: !149, line: 53, baseType: !154, size: 32, align: 32, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "arg_ptr", scope: !148, file: !149, line: 54, baseType: !138, size: 64, align: 64, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !148, file: !149, line: 56, baseType: !167, size: 64, align: 64, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "action_func", file: !149, line: 36, baseType: !169)
!169 = !DISubroutineType(types: !170)
!170 = !{!154, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!173 = !{!174}
!174 = !DISubrange(count: 16)
!175 = distinct !DIGlobalVariable(name: "vb", scope: !176, file: !141, line: 340, type: !178, isLocal: true, isDefinition: true, variable: %struct.varbuf* @searchfiles.vb)
!176 = distinct !DISubprogram(name: "searchfiles", scope: !141, file: !141, line: 332, type: !169, isLocal: true, isDefinition: true, scopeLine: 333, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !177)
!177 = !{}
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !179, line: 55, size: 192, align: 64, elements: !180)
!179 = !DIFile(filename: "../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-query")
!180 = !{!181, !185, !186}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !178, file: !179, line: 56, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !183, line: 216, baseType: !184)
!183 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-query")
!184 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !178, file: !179, line: 56, baseType: !182, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !178, file: !179, line: 57, baseType: !187, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!188 = distinct !DIGlobalVariable(name: "opt_loadavail", scope: !0, file: !141, line: 63, type: !154, isLocal: true, isDefinition: true, variable: i32* @opt_loadavail)
!189 = distinct !DIGlobalVariable(name: "showformat", scope: !0, file: !141, line: 61, type: !142, isLocal: true, isDefinition: true, variable: i8** @showformat)
!190 = distinct !DIGlobalVariable(name: "printforhelp", scope: !0, file: !141, line: 820, type: !191, isLocal: true, isDefinition: true, variable: [45 x i8]* @printforhelp)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 360, align: 8, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 45)
!194 = !{i32 2, !"Dwarf Version", i32 4}
!195 = !{i32 2, !"Debug Info Version", i32 3}
!196 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!197 = distinct !DISubprogram(name: "main", scope: !141, file: !141, line: 848, type: !198, isLocal: false, isDefinition: true, scopeLine: 848, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !177)
!198 = !DISubroutineType(types: !199)
!199 = !{!154, !154, !171}
!200 = !DILocalVariable(name: "argc", arg: 1, scope: !197, file: !141, line: 848, type: !154)
!201 = !DIExpression()
!202 = !DILocation(line: 848, column: 14, scope: !197)
!203 = !DILocalVariable(name: "argv", arg: 2, scope: !197, file: !141, line: 848, type: !171)
!204 = !DILocation(line: 848, column: 39, scope: !197)
!205 = !DILocalVariable(name: "ret", scope: !197, file: !141, line: 849, type: !154)
!206 = !DILocation(line: 849, column: 7, scope: !197)
!207 = !DILocation(line: 851, column: 3, scope: !197)
!208 = !DILocation(line: 852, column: 3, scope: !197)
!209 = !DILocation(line: 853, column: 3, scope: !197)
!210 = !DILocation(line: 854, column: 3, scope: !197)
!211 = !DILocation(line: 856, column: 30, scope: !197)
!212 = !DILocation(line: 856, column: 14, scope: !197)
!213 = !DILocation(line: 856, column: 12, scope: !197)
!214 = !DILocation(line: 858, column: 8, scope: !215)
!215 = distinct !DILexicalBlock(scope: !197, file: !141, line: 858, column: 7)
!216 = !DILocation(line: 858, column: 7, scope: !197)
!217 = !DILocation(line: 858, column: 28, scope: !218)
!218 = !DILexicalBlockFile(scope: !215, file: !141, discriminator: 1)
!219 = !DILocation(line: 858, column: 19, scope: !220)
!220 = !DILexicalBlockFile(scope: !218, file: !141, discriminator: 2)
!221 = !DILocation(line: 858, column: 19, scope: !218)
!222 = !DILocation(line: 860, column: 3, scope: !197)
!223 = !DILocation(line: 862, column: 9, scope: !197)
!224 = !DILocation(line: 862, column: 20, scope: !197)
!225 = !DILocation(line: 862, column: 27, scope: !197)
!226 = !DILocation(line: 862, column: 7, scope: !197)
!227 = !DILocation(line: 864, column: 3, scope: !197)
!228 = !DILocation(line: 866, column: 12, scope: !197)
!229 = !DILocation(line: 866, column: 11, scope: !197)
!230 = !DILocation(line: 866, column: 10, scope: !197)
!231 = !DILocation(line: 866, column: 3, scope: !197)
!232 = distinct !DISubprogram(name: "list_files", scope: !141, file: !141, line: 476, type: !169, isLocal: true, isDefinition: true, scopeLine: 477, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !177)
!233 = !DILocalVariable(name: "argv", arg: 1, scope: !232, file: !141, line: 476, type: !171)
!234 = !DILocation(line: 476, column: 31, scope: !232)
!235 = !DILocalVariable(name: "thisarg", scope: !232, file: !141, line: 478, type: !142)
!236 = !DILocation(line: 478, column: 15, scope: !232)
!237 = !DILocalVariable(name: "file", scope: !232, file: !141, line: 479, type: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !87, line: 122, size: 128, align: 64, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !87, line: 123, baseType: !238, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "namenode", scope: !239, file: !87, line: 124, baseType: !243, size: 64, align: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode", file: !87, line: 90, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !396, !404, !420, !423, !424, !425, !426}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !87, line: 91, baseType: !243, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !244, file: !87, line: 92, baseType: !142, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "packages", scope: !244, file: !87, line: 93, baseType: !249, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_list", file: !251, line: 34, size: 128, align: 64, elements: !252)
!251 = !DIFile(filename: "../lib/dpkg/pkg-list.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-query")
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !251, line: 35, baseType: !249, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !250, file: !251, line: 36, baseType: !255, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !257)
!257 = !{!258, !306, !307, !308, !309, !310, !311, !312, !313, !314, !344, !345, !355, !364, !380, !381, !387, !388, !394, !395}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !256, file: !4, line: 196, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !261)
!261 = !{!262, !263, !264, !265, !305}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !4, line: 243, baseType: !259, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !4, line: 244, baseType: !142, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !260, file: !4, line: 245, baseType: !256, size: 3072, align: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !260, file: !4, line: 249, baseType: !266, size: 128, align: 64, offset: 3200)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !4, line: 246, size: 128, align: 64, elements: !267)
!267 = !{!268, !304}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !266, file: !4, line: 247, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !271)
!271 = !{!272, !280, !281, !282, !283, !284, !293, !300, !301, !303}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !270, file: !4, line: 64, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !275)
!275 = !{!276, !277, !278, !279}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !274, file: !4, line: 57, baseType: !255, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !4, line: 58, baseType: !273, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !274, file: !4, line: 59, baseType: !269, size: 64, align: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !274, file: !4, line: 60, baseType: !3, size: 32, align: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !270, file: !4, line: 65, baseType: !259, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !270, file: !4, line: 66, baseType: !269, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !270, file: !4, line: 66, baseType: !269, size: 64, align: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !270, file: !4, line: 66, baseType: !269, size: 64, align: 64, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !270, file: !4, line: 67, baseType: !285, size: 64, align: 64, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !16, line: 48, size: 192, align: 64, elements: !288)
!288 = !{!289, !291, !292}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !16, line: 49, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !287, file: !16, line: 50, baseType: !142, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !287, file: !16, line: 51, baseType: !15, size: 32, align: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !270, file: !4, line: 68, baseType: !294, size: 192, align: 64, offset: 384)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !27, line: 42, size: 192, align: 64, elements: !295)
!295 = !{!296, !298, !299}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !294, file: !27, line: 44, baseType: !297, size: 32, align: 32)
!297 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !294, file: !27, line: 46, baseType: !142, size: 64, align: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !294, file: !27, line: 48, baseType: !142, size: 64, align: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !270, file: !4, line: 69, baseType: !26, size: 32, align: 32, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !270, file: !4, line: 70, baseType: !302, size: 8, align: 8, offset: 608)
!302 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !270, file: !4, line: 71, baseType: !302, size: 8, align: 8, offset: 616)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !266, file: !4, line: 248, baseType: !269, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !260, file: !4, line: 250, baseType: !154, size: 32, align: 32, offset: 3328)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !256, file: !4, line: 197, baseType: !255, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !256, file: !4, line: 199, baseType: !35, size: 32, align: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !256, file: !4, line: 201, baseType: !43, size: 32, align: 32, offset: 160)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !256, file: !4, line: 202, baseType: !47, size: 32, align: 32, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !256, file: !4, line: 203, baseType: !57, size: 32, align: 32, offset: 224)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !256, file: !4, line: 204, baseType: !142, size: 64, align: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !256, file: !4, line: 205, baseType: !142, size: 64, align: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !256, file: !4, line: 206, baseType: !294, size: 192, align: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !256, file: !4, line: 207, baseType: !315, size: 960, align: 64, offset: 576)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !337}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !315, file: !4, line: 108, baseType: !273, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !315, file: !4, line: 110, baseType: !302, size: 8, align: 8, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !315, file: !4, line: 111, baseType: !67, size: 32, align: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !315, file: !4, line: 112, baseType: !285, size: 64, align: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !315, file: !4, line: 115, baseType: !142, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !315, file: !4, line: 116, baseType: !142, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !315, file: !4, line: 117, baseType: !142, size: 64, align: 64, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !315, file: !4, line: 118, baseType: !142, size: 64, align: 64, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !315, file: !4, line: 119, baseType: !142, size: 64, align: 64, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !315, file: !4, line: 120, baseType: !142, size: 64, align: 64, offset: 512)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !315, file: !4, line: 121, baseType: !142, size: 64, align: 64, offset: 576)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !315, file: !4, line: 122, baseType: !294, size: 192, align: 64, offset: 640)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !315, file: !4, line: 123, baseType: !330, size: 64, align: 64, offset: 832)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !332)
!332 = !{!333, !334, !335, !336}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !331, file: !4, line: 81, baseType: !330, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !331, file: !4, line: 82, baseType: !142, size: 64, align: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !331, file: !4, line: 83, baseType: !142, size: 64, align: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !331, file: !4, line: 84, baseType: !302, size: 8, align: 8, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !315, file: !4, line: 124, baseType: !338, size: 64, align: 64, offset: 896)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !340)
!340 = !{!341, !342, !343}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !4, line: 75, baseType: !338, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !339, file: !4, line: 76, baseType: !142, size: 64, align: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !339, file: !4, line: 77, baseType: !142, size: 64, align: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !256, file: !4, line: 208, baseType: !315, size: 960, align: 64, offset: 1536)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !256, file: !4, line: 209, baseType: !346, size: 64, align: 64, offset: 2496)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !74, line: 53, size: 256, align: 64, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "istobe", scope: !347, file: !74, line: 54, baseType: !73, size: 32, align: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !347, file: !74, line: 57, baseType: !81, size: 32, align: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "enqueued", scope: !347, file: !74, line: 59, baseType: !302, size: 8, align: 8, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "replacingfilesandsaid", scope: !347, file: !74, line: 61, baseType: !154, size: 32, align: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "cmdline_seen", scope: !347, file: !74, line: 62, baseType: !154, size: 32, align: 32, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "trigprocdeferred", scope: !347, file: !74, line: 65, baseType: !249, size: 64, align: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !256, file: !4, line: 211, baseType: !356, size: 64, align: 64, offset: 2560)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !358)
!358 = !{!359, !360, !361, !362, !363}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !357, file: !4, line: 88, baseType: !356, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !357, file: !4, line: 89, baseType: !142, size: 64, align: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !357, file: !4, line: 90, baseType: !142, size: 64, align: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !357, file: !4, line: 91, baseType: !142, size: 64, align: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !357, file: !4, line: 92, baseType: !142, size: 64, align: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !256, file: !4, line: 216, baseType: !365, size: 128, align: 64, offset: 2624)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !256, file: !4, line: 213, size: 128, align: 64, elements: !366)
!366 = !{!367, !379}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !365, file: !4, line: 215, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !370)
!370 = !{!371, !372, !373, !374}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !369, file: !4, line: 143, baseType: !255, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !369, file: !4, line: 143, baseType: !255, size: 64, align: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !369, file: !4, line: 144, baseType: !368, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !369, file: !4, line: 147, baseType: !375, size: 128, align: 64, offset: 192)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !369, file: !4, line: 145, size: 128, align: 64, elements: !376)
!376 = !{!377, !378}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !375, file: !4, line: 146, baseType: !368, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !375, file: !4, line: 146, baseType: !368, size: 64, align: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !365, file: !4, line: 215, baseType: !368, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !256, file: !4, line: 219, baseType: !368, size: 64, align: 64, offset: 2752)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !256, file: !4, line: 220, baseType: !382, size: 64, align: 64, offset: 2816)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !383, file: !4, line: 135, baseType: !382, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !383, file: !4, line: 136, baseType: !142, size: 64, align: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !256, file: !4, line: 231, baseType: !238, size: 64, align: 64, offset: 2880)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !256, file: !4, line: 232, baseType: !389, size: 64, align: 64, offset: 2944)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !390, line: 86, baseType: !391)
!390 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-query")
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !392, line: 131, baseType: !393)
!392 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-query")
!393 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !256, file: !4, line: 233, baseType: !302, size: 8, align: 8, offset: 3008)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !256, file: !4, line: 236, baseType: !302, size: 8, align: 8, offset: 3016)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "divert", scope: !244, file: !87, line: 94, baseType: !397, size: 64, align: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_diversion", file: !87, line: 151, size: 256, align: 64, elements: !399)
!399 = !{!400, !401, !402, !403}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "useinstead", scope: !398, file: !87, line: 152, baseType: !243, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "camefrom", scope: !398, file: !87, line: 153, baseType: !243, size: 64, align: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pkgset", scope: !398, file: !87, line: 154, baseType: !259, size: 64, align: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !398, file: !87, line: 157, baseType: !397, size: 64, align: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "statoverride", scope: !244, file: !87, line: 101, baseType: !405, size: 64, align: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !407, line: 40, size: 256, align: 64, elements: !408)
!407 = !DIFile(filename: "../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-query")
!408 = !{!409, !412, !415, !418, !419}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !406, file: !407, line: 41, baseType: !410, size: 32, align: 32)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !390, line: 80, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !392, line: 125, baseType: !297)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !406, file: !407, line: 42, baseType: !413, size: 32, align: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !390, line: 65, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !392, line: 126, baseType: !297)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !406, file: !407, line: 43, baseType: !416, size: 32, align: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !390, line: 70, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !392, line: 129, baseType: !297)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !406, file: !407, line: 47, baseType: !187, size: 64, align: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !406, file: !407, line: 48, baseType: !187, size: 64, align: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "trig_interested", scope: !244, file: !87, line: 103, baseType: !421, size: 64, align: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "trigfileint", file: !87, line: 103, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !244, file: !87, line: 111, baseType: !86, size: 32, align: 32, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "oldhash", scope: !244, file: !87, line: 114, baseType: !142, size: 64, align: 64, offset: 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "newhash", scope: !244, file: !87, line: 117, baseType: !142, size: 64, align: 64, offset: 512)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "file_ondisk_id", scope: !244, file: !87, line: 119, baseType: !427, size: 64, align: 64, offset: 576)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_ondisk_id", file: !87, line: 85, size: 128, align: 64, elements: !429)
!429 = !{!430, !433}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "id_dev", scope: !428, file: !87, line: 86, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !390, line: 60, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !392, line: 124, baseType: !184)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "id_ino", scope: !428, file: !87, line: 87, baseType: !434, size: 64, align: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !390, line: 48, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !392, line: 127, baseType: !184)
!436 = !DILocation(line: 479, column: 30, scope: !232)
!437 = !DILocalVariable(name: "pkg", scope: !232, file: !141, line: 480, type: !255)
!438 = !DILocation(line: 480, column: 19, scope: !232)
!439 = !DILocalVariable(name: "namenode", scope: !232, file: !141, line: 481, type: !243)
!440 = !DILocation(line: 481, column: 25, scope: !232)
!441 = !DILocalVariable(name: "failures", scope: !232, file: !141, line: 482, type: !154)
!442 = !DILocation(line: 482, column: 7, scope: !232)
!443 = !DILocation(line: 484, column: 9, scope: !444)
!444 = distinct !DILexicalBlock(scope: !232, file: !141, line: 484, column: 7)
!445 = !DILocation(line: 484, column: 8, scope: !444)
!446 = !DILocation(line: 484, column: 7, scope: !232)
!447 = !DILocation(line: 485, column: 14, scope: !444)
!448 = !DILocation(line: 485, column: 72, scope: !444)
!449 = !DILocation(line: 485, column: 83, scope: !444)
!450 = !DILocation(line: 485, column: 5, scope: !451)
!451 = !DILexicalBlockFile(scope: !444, file: !141, discriminator: 1)
!452 = !DILocation(line: 485, column: 5, scope: !444)
!453 = !DILocation(line: 487, column: 3, scope: !232)
!454 = !DILocation(line: 489, column: 3, scope: !232)
!455 = !DILocation(line: 489, column: 26, scope: !456)
!456 = !DILexicalBlockFile(scope: !232, file: !141, discriminator: 1)
!457 = !DILocation(line: 489, column: 21, scope: !456)
!458 = !DILocation(line: 489, column: 19, scope: !456)
!459 = !DILocation(line: 489, column: 30, scope: !456)
!460 = !DILocation(line: 489, column: 3, scope: !456)
!461 = !DILocation(line: 490, column: 38, scope: !462)
!462 = distinct !DILexicalBlock(scope: !232, file: !141, line: 489, column: 38)
!463 = !DILocation(line: 490, column: 49, scope: !462)
!464 = !DILocation(line: 490, column: 11, scope: !462)
!465 = !DILocation(line: 490, column: 9, scope: !462)
!466 = !DILocation(line: 492, column: 13, scope: !462)
!467 = !DILocation(line: 492, column: 18, scope: !462)
!468 = !DILocation(line: 492, column: 5, scope: !462)
!469 = !DILocation(line: 494, column: 14, scope: !470)
!470 = distinct !DILexicalBlock(scope: !462, file: !141, line: 492, column: 26)
!471 = !DILocation(line: 495, column: 23, scope: !470)
!472 = !DILocation(line: 495, column: 14, scope: !470)
!473 = !DILocation(line: 494, column: 7, scope: !474)
!474 = !DILexicalBlockFile(scope: !470, file: !141, discriminator: 1)
!475 = !DILocation(line: 496, column: 15, scope: !470)
!476 = !DILocation(line: 497, column: 7, scope: !470)
!477 = !DILocation(line: 499, column: 37, scope: !470)
!478 = !DILocation(line: 499, column: 7, scope: !470)
!479 = !DILocation(line: 500, column: 7, scope: !470)
!480 = !DILocation(line: 501, column: 14, scope: !470)
!481 = !DILocation(line: 501, column: 19, scope: !470)
!482 = !DILocation(line: 501, column: 12, scope: !470)
!483 = !DILocation(line: 502, column: 12, scope: !484)
!484 = distinct !DILexicalBlock(scope: !470, file: !141, line: 502, column: 11)
!485 = !DILocation(line: 502, column: 11, scope: !470)
!486 = !DILocation(line: 503, column: 16, scope: !487)
!487 = distinct !DILexicalBlock(scope: !484, file: !141, line: 502, column: 18)
!488 = !DILocation(line: 504, column: 25, scope: !487)
!489 = !DILocation(line: 504, column: 16, scope: !487)
!490 = !DILocation(line: 503, column: 9, scope: !491)
!491 = !DILexicalBlockFile(scope: !487, file: !141, discriminator: 1)
!492 = !DILocation(line: 505, column: 7, scope: !487)
!493 = !DILocation(line: 506, column: 9, scope: !494)
!494 = distinct !DILexicalBlock(scope: !484, file: !141, line: 505, column: 14)
!495 = !DILocation(line: 506, column: 16, scope: !496)
!496 = !DILexicalBlockFile(scope: !494, file: !141, discriminator: 1)
!497 = !DILocation(line: 506, column: 9, scope: !496)
!498 = !DILocation(line: 507, column: 22, scope: !499)
!499 = distinct !DILexicalBlock(scope: !494, file: !141, line: 506, column: 22)
!500 = !DILocation(line: 507, column: 28, scope: !499)
!501 = !DILocation(line: 507, column: 20, scope: !499)
!502 = !DILocation(line: 508, column: 16, scope: !499)
!503 = !DILocation(line: 508, column: 26, scope: !499)
!504 = !DILocation(line: 508, column: 11, scope: !499)
!505 = !DILocation(line: 509, column: 15, scope: !506)
!506 = distinct !DILexicalBlock(scope: !499, file: !141, line: 509, column: 15)
!507 = !DILocation(line: 509, column: 25, scope: !506)
!508 = !DILocation(line: 509, column: 32, scope: !506)
!509 = !DILocation(line: 509, column: 36, scope: !510)
!510 = !DILexicalBlockFile(scope: !506, file: !141, discriminator: 1)
!511 = !DILocation(line: 509, column: 46, scope: !510)
!512 = !DILocation(line: 509, column: 54, scope: !510)
!513 = !DILocation(line: 509, column: 15, scope: !510)
!514 = !DILocation(line: 510, column: 18, scope: !515)
!515 = distinct !DILexicalBlock(scope: !516, file: !141, line: 510, column: 17)
!516 = distinct !DILexicalBlock(scope: !506, file: !141, line: 509, column: 64)
!517 = !DILocation(line: 510, column: 28, scope: !515)
!518 = !DILocation(line: 510, column: 36, scope: !515)
!519 = !DILocation(line: 510, column: 17, scope: !516)
!520 = !DILocation(line: 511, column: 22, scope: !515)
!521 = !DILocation(line: 512, column: 22, scope: !515)
!522 = !DILocation(line: 512, column: 32, scope: !515)
!523 = !DILocation(line: 512, column: 40, scope: !515)
!524 = !DILocation(line: 512, column: 52, scope: !515)
!525 = !DILocation(line: 511, column: 15, scope: !526)
!526 = !DILexicalBlockFile(scope: !515, file: !141, discriminator: 1)
!527 = !DILocation(line: 511, column: 15, scope: !515)
!528 = !DILocation(line: 513, column: 22, scope: !529)
!529 = distinct !DILexicalBlock(scope: !515, file: !141, line: 513, column: 22)
!530 = !DILocation(line: 513, column: 27, scope: !529)
!531 = !DILocation(line: 513, column: 34, scope: !529)
!532 = !DILocation(line: 513, column: 44, scope: !529)
!533 = !DILocation(line: 513, column: 52, scope: !529)
!534 = !DILocation(line: 513, column: 31, scope: !529)
!535 = !DILocation(line: 513, column: 22, scope: !515)
!536 = !DILocation(line: 514, column: 22, scope: !529)
!537 = !DILocation(line: 515, column: 22, scope: !529)
!538 = !DILocation(line: 515, column: 32, scope: !529)
!539 = !DILocation(line: 515, column: 40, scope: !529)
!540 = !DILocation(line: 515, column: 52, scope: !529)
!541 = !DILocation(line: 514, column: 15, scope: !542)
!542 = !DILexicalBlockFile(scope: !529, file: !141, discriminator: 1)
!543 = !DILocation(line: 514, column: 15, scope: !529)
!544 = !DILocation(line: 517, column: 22, scope: !529)
!545 = !DILocation(line: 518, column: 22, scope: !529)
!546 = !DILocation(line: 518, column: 32, scope: !529)
!547 = !DILocation(line: 518, column: 40, scope: !529)
!548 = !DILocation(line: 518, column: 48, scope: !529)
!549 = !DILocation(line: 519, column: 22, scope: !529)
!550 = !DILocation(line: 519, column: 32, scope: !529)
!551 = !DILocation(line: 519, column: 40, scope: !529)
!552 = !DILocation(line: 519, column: 52, scope: !529)
!553 = !DILocation(line: 517, column: 15, scope: !542)
!554 = !DILocation(line: 520, column: 11, scope: !516)
!555 = !DILocation(line: 521, column: 18, scope: !499)
!556 = !DILocation(line: 521, column: 24, scope: !499)
!557 = !DILocation(line: 521, column: 16, scope: !499)
!558 = !DILocation(line: 506, column: 9, scope: !559)
!559 = !DILexicalBlockFile(scope: !494, file: !141, discriminator: 2)
!560 = distinct !{!560, !493}
!561 = !DILocation(line: 524, column: 7, scope: !470)
!562 = !DILocation(line: 527, column: 10, scope: !563)
!563 = distinct !DILexicalBlock(scope: !462, file: !141, line: 527, column: 9)
!564 = !DILocation(line: 527, column: 9, scope: !563)
!565 = !DILocation(line: 527, column: 15, scope: !563)
!566 = !DILocation(line: 527, column: 9, scope: !462)
!567 = !DILocation(line: 528, column: 7, scope: !563)
!568 = !DILocation(line: 489, column: 3, scope: !569)
!569 = !DILexicalBlockFile(scope: !232, file: !141, discriminator: 2)
!570 = distinct !{!570, !454}
!571 = !DILocation(line: 531, column: 11, scope: !232)
!572 = !DILocation(line: 531, column: 19, scope: !232)
!573 = !DILocation(line: 531, column: 3, scope: !456)
!574 = !DILocation(line: 532, column: 7, scope: !575)
!575 = distinct !DILexicalBlock(scope: !232, file: !141, line: 532, column: 7)
!576 = !DILocation(line: 532, column: 7, scope: !232)
!577 = !DILocation(line: 533, column: 11, scope: !578)
!578 = distinct !DILexicalBlock(scope: !575, file: !141, line: 532, column: 17)
!579 = !DILocation(line: 534, column: 13, scope: !578)
!580 = !DILocation(line: 533, column: 5, scope: !581)
!581 = !DILexicalBlockFile(scope: !578, file: !141, discriminator: 1)
!582 = !DILocation(line: 535, column: 13, scope: !578)
!583 = !DILocation(line: 535, column: 21, scope: !578)
!584 = !DILocation(line: 535, column: 5, scope: !581)
!585 = !DILocation(line: 536, column: 3, scope: !578)
!586 = !DILocation(line: 538, column: 3, scope: !232)
!587 = !DILocation(line: 540, column: 10, scope: !232)
!588 = !DILocation(line: 540, column: 3, scope: !232)
!589 = distinct !DISubprogram(name: "print_status", scope: !141, file: !141, line: 394, type: !169, isLocal: true, isDefinition: true, scopeLine: 395, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !177)
!590 = !DILocalVariable(name: "argv", arg: 1, scope: !589, file: !141, line: 394, type: !171)
!591 = !DILocation(line: 394, column: 33, scope: !589)
!592 = !DILocalVariable(name: "thisarg", scope: !589, file: !141, line: 396, type: !142)
!593 = !DILocation(line: 396, column: 15, scope: !589)
!594 = !DILocalVariable(name: "pkg", scope: !589, file: !141, line: 397, type: !255)
!595 = !DILocation(line: 397, column: 19, scope: !589)
!596 = !DILocalVariable(name: "failures", scope: !589, file: !141, line: 398, type: !154)
!597 = !DILocation(line: 398, column: 7, scope: !589)
!598 = !DILocation(line: 400, column: 3, scope: !589)
!599 = !DILocation(line: 402, column: 9, scope: !600)
!600 = distinct !DILexicalBlock(scope: !589, file: !141, line: 402, column: 7)
!601 = !DILocation(line: 402, column: 8, scope: !600)
!602 = !DILocation(line: 402, column: 7, scope: !589)
!603 = !DILocation(line: 403, column: 20, scope: !604)
!604 = distinct !DILexicalBlock(scope: !600, file: !141, line: 402, column: 15)
!605 = !DILocation(line: 403, column: 28, scope: !604)
!606 = !DILocation(line: 403, column: 5, scope: !607)
!607 = !DILexicalBlockFile(scope: !604, file: !141, discriminator: 1)
!608 = !DILocation(line: 404, column: 3, scope: !604)
!609 = !DILocation(line: 405, column: 5, scope: !610)
!610 = distinct !DILexicalBlock(scope: !600, file: !141, line: 404, column: 10)
!611 = !DILocation(line: 405, column: 28, scope: !612)
!612 = !DILexicalBlockFile(scope: !610, file: !141, discriminator: 1)
!613 = !DILocation(line: 405, column: 23, scope: !612)
!614 = !DILocation(line: 405, column: 21, scope: !612)
!615 = !DILocation(line: 405, column: 32, scope: !612)
!616 = !DILocation(line: 405, column: 5, scope: !612)
!617 = !DILocation(line: 406, column: 40, scope: !618)
!618 = distinct !DILexicalBlock(scope: !610, file: !141, line: 405, column: 40)
!619 = !DILocation(line: 406, column: 51, scope: !618)
!620 = !DILocation(line: 406, column: 13, scope: !618)
!621 = !DILocation(line: 406, column: 11, scope: !618)
!622 = !DILocation(line: 408, column: 11, scope: !623)
!623 = distinct !DILexicalBlock(scope: !618, file: !141, line: 408, column: 11)
!624 = !DILocation(line: 408, column: 16, scope: !623)
!625 = !DILocation(line: 408, column: 23, scope: !623)
!626 = !DILocation(line: 408, column: 48, scope: !623)
!627 = !DILocation(line: 409, column: 11, scope: !623)
!628 = !DILocation(line: 409, column: 16, scope: !623)
!629 = !DILocation(line: 409, column: 25, scope: !623)
!630 = !DILocation(line: 409, column: 45, scope: !623)
!631 = !DILocation(line: 410, column: 24, scope: !623)
!632 = !DILocation(line: 410, column: 29, scope: !623)
!633 = !DILocation(line: 410, column: 11, scope: !623)
!634 = !DILocation(line: 410, column: 38, scope: !623)
!635 = !DILocation(line: 411, column: 12, scope: !623)
!636 = !DILocation(line: 411, column: 17, scope: !623)
!637 = !DILocation(line: 411, column: 26, scope: !623)
!638 = !DILocation(line: 412, column: 11, scope: !623)
!639 = !DILocation(line: 412, column: 16, scope: !623)
!640 = !DILocation(line: 412, column: 21, scope: !623)
!641 = !DILocation(line: 412, column: 41, scope: !623)
!642 = !DILocation(line: 413, column: 31, scope: !623)
!643 = !DILocation(line: 413, column: 37, scope: !623)
!644 = !DILocation(line: 413, column: 42, scope: !623)
!645 = !DILocation(line: 413, column: 12, scope: !623)
!646 = !DILocation(line: 408, column: 11, scope: !647)
!647 = !DILexicalBlockFile(scope: !618, file: !141, discriminator: 1)
!648 = !DILocation(line: 414, column: 16, scope: !649)
!649 = distinct !DILexicalBlock(scope: !623, file: !141, line: 413, column: 54)
!650 = !DILocation(line: 415, column: 25, scope: !649)
!651 = !DILocation(line: 415, column: 16, scope: !649)
!652 = !DILocation(line: 414, column: 9, scope: !653)
!653 = !DILexicalBlockFile(scope: !649, file: !141, discriminator: 1)
!654 = !DILocation(line: 416, column: 17, scope: !649)
!655 = !DILocation(line: 417, column: 7, scope: !649)
!656 = !DILocation(line: 418, column: 20, scope: !657)
!657 = distinct !DILexicalBlock(scope: !623, file: !141, line: 417, column: 14)
!658 = !DILocation(line: 418, column: 28, scope: !657)
!659 = !DILocation(line: 418, column: 58, scope: !657)
!660 = !DILocation(line: 418, column: 64, scope: !657)
!661 = !DILocation(line: 418, column: 69, scope: !657)
!662 = !DILocation(line: 418, column: 9, scope: !663)
!663 = !DILexicalBlockFile(scope: !657, file: !141, discriminator: 1)
!664 = !DILocation(line: 421, column: 12, scope: !665)
!665 = distinct !DILexicalBlock(scope: !618, file: !141, line: 421, column: 11)
!666 = !DILocation(line: 421, column: 11, scope: !665)
!667 = !DILocation(line: 421, column: 17, scope: !665)
!668 = !DILocation(line: 421, column: 11, scope: !618)
!669 = !DILocation(line: 422, column: 9, scope: !665)
!670 = !DILocation(line: 405, column: 5, scope: !671)
!671 = !DILexicalBlockFile(scope: !610, file: !141, discriminator: 2)
!672 = distinct !{!672, !609}
!673 = !DILocation(line: 426, column: 11, scope: !589)
!674 = !DILocation(line: 426, column: 19, scope: !589)
!675 = !DILocation(line: 426, column: 3, scope: !676)
!676 = !DILexicalBlockFile(scope: !589, file: !141, discriminator: 1)
!677 = !DILocation(line: 427, column: 7, scope: !678)
!678 = distinct !DILexicalBlock(scope: !589, file: !141, line: 427, column: 7)
!679 = !DILocation(line: 427, column: 7, scope: !589)
!680 = !DILocation(line: 428, column: 11, scope: !681)
!681 = distinct !DILexicalBlock(scope: !678, file: !141, line: 427, column: 17)
!682 = !DILocation(line: 429, column: 10, scope: !681)
!683 = !DILocation(line: 428, column: 5, scope: !684)
!684 = !DILexicalBlockFile(scope: !681, file: !141, discriminator: 1)
!685 = !DILocation(line: 430, column: 13, scope: !681)
!686 = !DILocation(line: 430, column: 21, scope: !681)
!687 = !DILocation(line: 430, column: 5, scope: !684)
!688 = !DILocation(line: 431, column: 3, scope: !681)
!689 = !DILocation(line: 433, column: 3, scope: !589)
!690 = !DILocation(line: 435, column: 10, scope: !589)
!691 = !DILocation(line: 435, column: 3, scope: !589)
!692 = distinct !DISubprogram(name: "print_avail", scope: !141, file: !141, line: 439, type: !169, isLocal: true, isDefinition: true, scopeLine: 440, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !177)
!693 = !DILocalVariable(name: "argv", arg: 1, scope: !692, file: !141, line: 439, type: !171)
!694 = !DILocation(line: 439, column: 32, scope: !692)
!695 = !DILocalVariable(name: "thisarg", scope: !692, file: !141, line: 441, type: !142)
!696 = !DILocation(line: 441, column: 15, scope: !692)
!697 = !DILocalVariable(name: "pkg", scope: !692, file: !141, line: 442, type: !255)
!698 = !DILocation(line: 442, column: 19, scope: !692)
!699 = !DILocalVariable(name: "failures", scope: !692, file: !141, line: 443, type: !154)
!700 = !DILocation(line: 443, column: 7, scope: !692)
!701 = !DILocation(line: 445, column: 3, scope: !692)
!702 = !DILocation(line: 447, column: 9, scope: !703)
!703 = distinct !DILexicalBlock(scope: !692, file: !141, line: 447, column: 7)
!704 = !DILocation(line: 447, column: 8, scope: !703)
!705 = !DILocation(line: 447, column: 7, scope: !692)
!706 = !DILocation(line: 448, column: 20, scope: !707)
!707 = distinct !DILexicalBlock(scope: !703, file: !141, line: 447, column: 15)
!708 = !DILocation(line: 448, column: 28, scope: !707)
!709 = !DILocation(line: 448, column: 5, scope: !710)
!710 = !DILexicalBlockFile(scope: !707, file: !141, discriminator: 1)
!711 = !DILocation(line: 449, column: 3, scope: !707)
!712 = !DILocation(line: 450, column: 5, scope: !713)
!713 = distinct !DILexicalBlock(scope: !703, file: !141, line: 449, column: 10)
!714 = !DILocation(line: 450, column: 28, scope: !715)
!715 = !DILexicalBlockFile(scope: !713, file: !141, discriminator: 1)
!716 = !DILocation(line: 450, column: 23, scope: !715)
!717 = !DILocation(line: 450, column: 21, scope: !715)
!718 = !DILocation(line: 450, column: 32, scope: !715)
!719 = !DILocation(line: 450, column: 5, scope: !715)
!720 = !DILocation(line: 451, column: 40, scope: !721)
!721 = distinct !DILexicalBlock(scope: !713, file: !141, line: 450, column: 40)
!722 = !DILocation(line: 451, column: 51, scope: !721)
!723 = !DILocation(line: 451, column: 13, scope: !721)
!724 = !DILocation(line: 451, column: 11, scope: !721)
!725 = !DILocation(line: 453, column: 31, scope: !726)
!726 = distinct !DILexicalBlock(scope: !721, file: !141, line: 453, column: 11)
!727 = !DILocation(line: 453, column: 37, scope: !726)
!728 = !DILocation(line: 453, column: 42, scope: !726)
!729 = !DILocation(line: 453, column: 12, scope: !726)
!730 = !DILocation(line: 453, column: 11, scope: !721)
!731 = !DILocation(line: 454, column: 16, scope: !732)
!732 = distinct !DILexicalBlock(scope: !726, file: !141, line: 453, column: 54)
!733 = !DILocation(line: 455, column: 28, scope: !732)
!734 = !DILocation(line: 455, column: 34, scope: !732)
!735 = !DILocation(line: 455, column: 39, scope: !732)
!736 = !DILocation(line: 455, column: 16, scope: !732)
!737 = !DILocation(line: 454, column: 9, scope: !738)
!738 = !DILexicalBlockFile(scope: !732, file: !141, discriminator: 1)
!739 = !DILocation(line: 456, column: 17, scope: !732)
!740 = !DILocation(line: 457, column: 7, scope: !732)
!741 = !DILocation(line: 458, column: 20, scope: !742)
!742 = distinct !DILexicalBlock(scope: !726, file: !141, line: 457, column: 14)
!743 = !DILocation(line: 458, column: 28, scope: !742)
!744 = !DILocation(line: 458, column: 58, scope: !742)
!745 = !DILocation(line: 458, column: 64, scope: !742)
!746 = !DILocation(line: 458, column: 69, scope: !742)
!747 = !DILocation(line: 458, column: 9, scope: !748)
!748 = !DILexicalBlockFile(scope: !742, file: !141, discriminator: 1)
!749 = !DILocation(line: 461, column: 12, scope: !750)
!750 = distinct !DILexicalBlock(scope: !721, file: !141, line: 461, column: 11)
!751 = !DILocation(line: 461, column: 11, scope: !750)
!752 = !DILocation(line: 461, column: 17, scope: !750)
!753 = !DILocation(line: 461, column: 11, scope: !721)
!754 = !DILocation(line: 462, column: 9, scope: !750)
!755 = !DILocation(line: 450, column: 5, scope: !756)
!756 = !DILexicalBlockFile(scope: !713, file: !141, discriminator: 2)
!757 = distinct !{!757, !712}
!758 = !DILocation(line: 466, column: 11, scope: !692)
!759 = !DILocation(line: 466, column: 19, scope: !692)
!760 = !DILocation(line: 466, column: 3, scope: !761)
!761 = !DILexicalBlockFile(scope: !692, file: !141, discriminator: 1)
!762 = !DILocation(line: 467, column: 7, scope: !763)
!763 = distinct !DILexicalBlock(scope: !692, file: !141, line: 467, column: 7)
!764 = !DILocation(line: 467, column: 7, scope: !692)
!765 = !DILocation(line: 468, column: 13, scope: !763)
!766 = !DILocation(line: 468, column: 21, scope: !763)
!767 = !DILocation(line: 468, column: 5, scope: !768)
!768 = !DILexicalBlockFile(scope: !763, file: !141, discriminator: 1)
!769 = !DILocation(line: 468, column: 5, scope: !763)
!770 = !DILocation(line: 470, column: 3, scope: !692)
!771 = !DILocation(line: 472, column: 10, scope: !692)
!772 = !DILocation(line: 472, column: 3, scope: !692)
!773 = distinct !DISubprogram(name: "listpackages", scope: !141, file: !141, line: 249, type: !169, isLocal: true, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !177)
!774 = !DILocalVariable(name: "argv", arg: 1, scope: !773, file: !141, line: 249, type: !171)
!775 = !DILocation(line: 249, column: 33, scope: !773)
!776 = !DILocalVariable(name: "array", scope: !773, file: !141, line: 251, type: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_array", file: !778, line: 38, size: 128, align: 64, elements: !779)
!778 = !DIFile(filename: "../lib/dpkg/pkg-array.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-query")
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "n_pkgs", scope: !777, file: !778, line: 39, baseType: !154, size: 32, align: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "pkgs", scope: !777, file: !778, line: 40, baseType: !782, size: 64, align: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!783 = !DILocation(line: 251, column: 20, scope: !773)
!784 = !DILocalVariable(name: "pkg", scope: !773, file: !141, line: 252, type: !255)
!785 = !DILocation(line: 252, column: 19, scope: !773)
!786 = !DILocalVariable(name: "i", scope: !773, file: !141, line: 253, type: !154)
!787 = !DILocation(line: 253, column: 7, scope: !773)
!788 = !DILocalVariable(name: "rc", scope: !773, file: !141, line: 254, type: !154)
!789 = !DILocation(line: 254, column: 7, scope: !773)
!790 = !DILocalVariable(name: "fmt", scope: !773, file: !141, line: 255, type: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_format", file: !141, line: 114, size: 160, align: 32, elements: !792)
!792 = !{!793, !794, !795, !796, !797}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !791, file: !141, line: 115, baseType: !302, size: 8, align: 8)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "nw", scope: !791, file: !141, line: 116, baseType: !154, size: 32, align: 32, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "vw", scope: !791, file: !141, line: 117, baseType: !154, size: 32, align: 32, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !791, file: !141, line: 118, baseType: !154, size: 32, align: 32, offset: 96)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !791, file: !141, line: 119, baseType: !154, size: 32, align: 32, offset: 128)
!798 = !DILocation(line: 255, column: 22, scope: !773)
!799 = !DILocalVariable(name: "pager", scope: !773, file: !141, line: 256, type: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64, align: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "pager", file: !802, line: 36, flags: DIFlagFwdDecl)
!802 = !DIFile(filename: "../lib/dpkg/pager.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-query")
!803 = !DILocation(line: 256, column: 17, scope: !773)
!804 = !DILocation(line: 258, column: 8, scope: !805)
!805 = distinct !DILexicalBlock(scope: !773, file: !141, line: 258, column: 7)
!806 = !DILocation(line: 258, column: 7, scope: !773)
!807 = !DILocation(line: 259, column: 5, scope: !805)
!808 = !DILocation(line: 261, column: 5, scope: !805)
!809 = !DILocation(line: 263, column: 3, scope: !773)
!810 = !DILocation(line: 264, column: 3, scope: !773)
!811 = !DILocation(line: 266, column: 3, scope: !773)
!812 = !DILocation(line: 268, column: 23, scope: !773)
!813 = !DILocation(line: 268, column: 11, scope: !814)
!814 = !DILexicalBlockFile(scope: !773, file: !141, discriminator: 1)
!815 = !DILocation(line: 268, column: 9, scope: !773)
!816 = !DILocation(line: 270, column: 9, scope: !817)
!817 = distinct !DILexicalBlock(scope: !773, file: !141, line: 270, column: 7)
!818 = !DILocation(line: 270, column: 8, scope: !817)
!819 = !DILocation(line: 270, column: 7, scope: !773)
!820 = !DILocation(line: 271, column: 12, scope: !821)
!821 = distinct !DILexicalBlock(scope: !822, file: !141, line: 271, column: 5)
!822 = distinct !DILexicalBlock(scope: !817, file: !141, line: 270, column: 15)
!823 = !DILocation(line: 271, column: 10, scope: !821)
!824 = !DILocation(line: 271, column: 17, scope: !825)
!825 = !DILexicalBlockFile(scope: !826, file: !141, discriminator: 1)
!826 = distinct !DILexicalBlock(scope: !821, file: !141, line: 271, column: 5)
!827 = !DILocation(line: 271, column: 27, scope: !825)
!828 = !DILocation(line: 271, column: 19, scope: !825)
!829 = !DILocation(line: 271, column: 5, scope: !825)
!830 = !DILocation(line: 272, column: 24, scope: !831)
!831 = distinct !DILexicalBlock(scope: !826, file: !141, line: 271, column: 40)
!832 = !DILocation(line: 272, column: 13, scope: !831)
!833 = !DILocation(line: 272, column: 19, scope: !831)
!834 = !DILocation(line: 272, column: 11, scope: !831)
!835 = !DILocation(line: 273, column: 11, scope: !836)
!836 = distinct !DILexicalBlock(scope: !831, file: !141, line: 273, column: 11)
!837 = !DILocation(line: 273, column: 16, scope: !836)
!838 = !DILocation(line: 273, column: 23, scope: !836)
!839 = !DILocation(line: 273, column: 11, scope: !831)
!840 = !DILocation(line: 274, column: 20, scope: !836)
!841 = !DILocation(line: 274, column: 9, scope: !836)
!842 = !DILocation(line: 274, column: 15, scope: !836)
!843 = !DILocation(line: 274, column: 23, scope: !836)
!844 = !DILocation(line: 275, column: 5, scope: !831)
!845 = !DILocation(line: 271, column: 36, scope: !846)
!846 = !DILexicalBlockFile(scope: !826, file: !141, discriminator: 2)
!847 = !DILocation(line: 271, column: 5, scope: !846)
!848 = distinct !{!848, !849}
!849 = !DILocation(line: 271, column: 5, scope: !822)
!850 = !DILocation(line: 277, column: 52, scope: !822)
!851 = !DILocation(line: 277, column: 5, scope: !822)
!852 = !DILocation(line: 278, column: 3, scope: !822)
!853 = !DILocation(line: 279, column: 64, scope: !854)
!854 = distinct !DILexicalBlock(scope: !817, file: !141, line: 278, column: 10)
!855 = !DILocation(line: 279, column: 70, scope: !854)
!856 = !DILocation(line: 279, column: 10, scope: !854)
!857 = !DILocation(line: 279, column: 8, scope: !854)
!858 = !DILocation(line: 282, column: 11, scope: !773)
!859 = !DILocation(line: 282, column: 19, scope: !773)
!860 = !DILocation(line: 282, column: 3, scope: !814)
!861 = !DILocation(line: 283, column: 11, scope: !773)
!862 = !DILocation(line: 283, column: 19, scope: !773)
!863 = !DILocation(line: 283, column: 3, scope: !814)
!864 = !DILocation(line: 285, column: 14, scope: !773)
!865 = !DILocation(line: 285, column: 3, scope: !773)
!866 = !DILocation(line: 287, column: 3, scope: !773)
!867 = !DILocation(line: 288, column: 3, scope: !773)
!868 = !DILocation(line: 290, column: 10, scope: !773)
!869 = !DILocation(line: 290, column: 3, scope: !773)
!870 = !DILocalVariable(name: "argv", arg: 1, scope: !176, file: !141, line: 332, type: !171)
!871 = !DILocation(line: 332, column: 32, scope: !176)
!872 = !DILocalVariable(name: "namenode", scope: !176, file: !141, line: 334, type: !243)
!873 = !DILocation(line: 334, column: 25, scope: !176)
!874 = !DILocalVariable(name: "iter", scope: !176, file: !141, line: 335, type: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64, align: 64)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_hash_iter", file: !87, line: 177, flags: DIFlagFwdDecl)
!877 = !DILocation(line: 335, column: 26, scope: !176)
!878 = !DILocalVariable(name: "thisarg", scope: !176, file: !141, line: 336, type: !142)
!879 = !DILocation(line: 336, column: 15, scope: !176)
!880 = !DILocalVariable(name: "found", scope: !176, file: !141, line: 337, type: !154)
!881 = !DILocation(line: 337, column: 7, scope: !176)
!882 = !DILocalVariable(name: "failures", scope: !176, file: !141, line: 338, type: !154)
!883 = !DILocation(line: 338, column: 7, scope: !176)
!884 = !DILocalVariable(name: "path", scope: !176, file: !141, line: 339, type: !178)
!885 = !DILocation(line: 339, column: 17, scope: !176)
!886 = !DILocation(line: 342, column: 9, scope: !887)
!887 = distinct !DILexicalBlock(scope: !176, file: !141, line: 342, column: 7)
!888 = !DILocation(line: 342, column: 8, scope: !887)
!889 = !DILocation(line: 342, column: 7, scope: !176)
!890 = !DILocation(line: 343, column: 14, scope: !887)
!891 = !DILocation(line: 343, column: 5, scope: !892)
!892 = !DILexicalBlockFile(scope: !887, file: !141, discriminator: 1)
!893 = !DILocation(line: 343, column: 5, scope: !887)
!894 = !DILocation(line: 345, column: 3, scope: !176)
!895 = !DILocation(line: 346, column: 3, scope: !176)
!896 = !DILocation(line: 347, column: 3, scope: !176)
!897 = !DILocation(line: 349, column: 3, scope: !176)
!898 = !DILocation(line: 349, column: 26, scope: !899)
!899 = !DILexicalBlockFile(scope: !176, file: !141, discriminator: 1)
!900 = !DILocation(line: 349, column: 21, scope: !899)
!901 = !DILocation(line: 349, column: 19, scope: !899)
!902 = !DILocation(line: 349, column: 30, scope: !899)
!903 = !DILocation(line: 349, column: 3, scope: !899)
!904 = !DILocation(line: 350, column: 10, scope: !905)
!905 = distinct !DILexicalBlock(scope: !176, file: !141, line: 349, column: 38)
!906 = !DILocation(line: 352, column: 25, scope: !907)
!907 = distinct !DILexicalBlock(scope: !905, file: !141, line: 352, column: 9)
!908 = !DILocation(line: 352, column: 24, scope: !907)
!909 = !DILocation(line: 352, column: 10, scope: !907)
!910 = !DILocation(line: 352, column: 9, scope: !905)
!911 = !DILocation(line: 353, column: 7, scope: !912)
!912 = distinct !DILexicalBlock(scope: !907, file: !141, line: 352, column: 35)
!913 = !DILocation(line: 354, column: 7, scope: !912)
!914 = !DILocation(line: 355, column: 27, scope: !912)
!915 = !DILocation(line: 355, column: 43, scope: !912)
!916 = !DILocation(line: 355, column: 36, scope: !912)
!917 = !DILocation(line: 355, column: 7, scope: !918)
!918 = !DILexicalBlockFile(scope: !912, file: !141, discriminator: 1)
!919 = !DILocation(line: 356, column: 7, scope: !912)
!920 = !DILocation(line: 357, column: 7, scope: !912)
!921 = !DILocation(line: 358, column: 19, scope: !912)
!922 = !DILocation(line: 358, column: 14, scope: !912)
!923 = !DILocation(line: 359, column: 5, scope: !912)
!924 = !DILocation(line: 360, column: 18, scope: !925)
!925 = distinct !DILexicalBlock(scope: !905, file: !141, line: 360, column: 9)
!926 = !DILocation(line: 360, column: 10, scope: !925)
!927 = !DILocation(line: 360, column: 9, scope: !905)
!928 = !DILocation(line: 363, column: 7, scope: !929)
!929 = distinct !DILexicalBlock(scope: !925, file: !141, line: 360, column: 37)
!930 = !DILocation(line: 364, column: 29, scope: !929)
!931 = !DILocation(line: 364, column: 45, scope: !929)
!932 = !DILocation(line: 364, column: 38, scope: !929)
!933 = !DILocation(line: 364, column: 7, scope: !934)
!934 = !DILexicalBlockFile(scope: !929, file: !141, discriminator: 1)
!935 = !DILocation(line: 365, column: 7, scope: !929)
!936 = !DILocation(line: 366, column: 57, scope: !929)
!937 = !DILocation(line: 366, column: 27, scope: !929)
!938 = !DILocation(line: 366, column: 7, scope: !934)
!939 = !DILocation(line: 368, column: 43, scope: !929)
!940 = !DILocation(line: 368, column: 18, scope: !929)
!941 = !DILocation(line: 368, column: 16, scope: !929)
!942 = !DILocation(line: 369, column: 29, scope: !929)
!943 = !DILocation(line: 369, column: 16, scope: !929)
!944 = !DILocation(line: 369, column: 13, scope: !929)
!945 = !DILocation(line: 370, column: 5, scope: !929)
!946 = !DILocation(line: 371, column: 14, scope: !947)
!947 = distinct !DILexicalBlock(scope: !925, file: !141, line: 370, column: 12)
!948 = !DILocation(line: 371, column: 12, scope: !947)
!949 = !DILocation(line: 372, column: 7, scope: !947)
!950 = !DILocation(line: 372, column: 46, scope: !951)
!951 = !DILexicalBlockFile(scope: !947, file: !141, discriminator: 1)
!952 = !DILocation(line: 372, column: 26, scope: !951)
!953 = !DILocation(line: 372, column: 24, scope: !951)
!954 = !DILocation(line: 372, column: 53, scope: !951)
!955 = !DILocation(line: 372, column: 7, scope: !951)
!956 = !DILocation(line: 373, column: 21, scope: !957)
!957 = distinct !DILexicalBlock(scope: !958, file: !141, line: 373, column: 13)
!958 = distinct !DILexicalBlock(scope: !947, file: !141, line: 372, column: 61)
!959 = !DILocation(line: 373, column: 29, scope: !957)
!960 = !DILocation(line: 373, column: 39, scope: !957)
!961 = !DILocation(line: 373, column: 13, scope: !957)
!962 = !DILocation(line: 373, column: 13, scope: !958)
!963 = !DILocation(line: 373, column: 48, scope: !964)
!964 = !DILexicalBlockFile(scope: !957, file: !141, discriminator: 1)
!965 = distinct !{!965, !949}
!966 = !DILocation(line: 374, column: 30, scope: !958)
!967 = !DILocation(line: 374, column: 17, scope: !958)
!968 = !DILocation(line: 374, column: 14, scope: !958)
!969 = !DILocation(line: 372, column: 7, scope: !970)
!970 = !DILexicalBlockFile(scope: !947, file: !141, discriminator: 2)
!971 = !DILocation(line: 376, column: 27, scope: !947)
!972 = !DILocation(line: 376, column: 7, scope: !947)
!973 = !DILocation(line: 378, column: 10, scope: !974)
!974 = distinct !DILexicalBlock(scope: !905, file: !141, line: 378, column: 9)
!975 = !DILocation(line: 378, column: 9, scope: !905)
!976 = !DILocation(line: 379, column: 14, scope: !977)
!977 = distinct !DILexicalBlock(scope: !974, file: !141, line: 378, column: 17)
!978 = !DILocation(line: 379, column: 60, scope: !977)
!979 = !DILocation(line: 379, column: 7, scope: !980)
!980 = !DILexicalBlockFile(scope: !977, file: !141, discriminator: 1)
!981 = !DILocation(line: 380, column: 15, scope: !977)
!982 = !DILocation(line: 381, column: 15, scope: !977)
!983 = !DILocation(line: 381, column: 23, scope: !977)
!984 = !DILocation(line: 381, column: 7, scope: !980)
!985 = !DILocation(line: 382, column: 5, scope: !977)
!986 = !DILocation(line: 383, column: 15, scope: !987)
!987 = distinct !DILexicalBlock(scope: !974, file: !141, line: 382, column: 12)
!988 = !DILocation(line: 383, column: 23, scope: !987)
!989 = !DILocation(line: 383, column: 7, scope: !990)
!990 = !DILexicalBlockFile(scope: !987, file: !141, discriminator: 1)
!991 = !DILocation(line: 349, column: 3, scope: !992)
!992 = !DILexicalBlockFile(scope: !176, file: !141, discriminator: 2)
!993 = distinct !{!993, !897}
!994 = !DILocation(line: 386, column: 3, scope: !176)
!995 = !DILocation(line: 388, column: 3, scope: !176)
!996 = !DILocation(line: 390, column: 10, scope: !176)
!997 = !DILocation(line: 390, column: 3, scope: !176)
!998 = distinct !DISubprogram(name: "showpackages", scope: !141, file: !141, line: 552, type: !169, isLocal: true, isDefinition: true, scopeLine: 553, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !177)
!999 = !DILocalVariable(name: "argv", arg: 1, scope: !998, file: !141, line: 552, type: !171)
!1000 = !DILocation(line: 552, column: 33, scope: !998)
!1001 = !DILocalVariable(name: "err", scope: !998, file: !141, line: 554, type: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_error", file: !132, line: 42, size: 128, align: 64, elements: !1003)
!1003 = !{!1004, !1005, !1006}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1002, file: !132, line: 43, baseType: !131, size: 32, align: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "syserrno", scope: !1002, file: !132, line: 45, baseType: !154, size: 32, align: 32, offset: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1002, file: !132, line: 46, baseType: !187, size: 64, align: 64, offset: 64)
!1007 = !DILocation(line: 554, column: 21, scope: !998)
!1008 = !DILocalVariable(name: "array", scope: !998, file: !141, line: 555, type: !777)
!1009 = !DILocation(line: 555, column: 20, scope: !998)
!1010 = !DILocalVariable(name: "pkg", scope: !998, file: !141, line: 556, type: !255)
!1011 = !DILocation(line: 556, column: 19, scope: !998)
!1012 = !DILocalVariable(name: "fmt", scope: !998, file: !141, line: 557, type: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_format_node", file: !1015, line: 36, flags: DIFlagFwdDecl)
!1015 = !DIFile(filename: "../lib/dpkg/pkg-format.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-query")
!1016 = !DILocation(line: 557, column: 27, scope: !998)
!1017 = !DILocalVariable(name: "i", scope: !998, file: !141, line: 558, type: !154)
!1018 = !DILocation(line: 558, column: 7, scope: !998)
!1019 = !DILocalVariable(name: "rc", scope: !998, file: !141, line: 559, type: !154)
!1020 = !DILocation(line: 559, column: 7, scope: !998)
!1021 = !DILocation(line: 561, column: 26, scope: !998)
!1022 = !DILocation(line: 561, column: 9, scope: !998)
!1023 = !DILocation(line: 561, column: 7, scope: !998)
!1024 = !DILocation(line: 562, column: 8, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !998, file: !141, line: 562, column: 7)
!1026 = !DILocation(line: 562, column: 7, scope: !998)
!1027 = !DILocation(line: 563, column: 12, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1025, file: !141, line: 562, column: 13)
!1029 = !DILocation(line: 563, column: 53, scope: !1028)
!1030 = !DILocation(line: 563, column: 5, scope: !1031)
!1031 = !DILexicalBlockFile(scope: !1028, file: !141, discriminator: 1)
!1032 = !DILocation(line: 564, column: 5, scope: !1028)
!1033 = !DILocation(line: 565, column: 7, scope: !1028)
!1034 = !DILocation(line: 566, column: 12, scope: !1028)
!1035 = !DILocation(line: 566, column: 5, scope: !1028)
!1036 = !DILocation(line: 569, column: 8, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !998, file: !141, line: 569, column: 7)
!1038 = !DILocation(line: 569, column: 7, scope: !998)
!1039 = !DILocation(line: 570, column: 5, scope: !1037)
!1040 = !DILocation(line: 572, column: 5, scope: !1037)
!1041 = !DILocation(line: 574, column: 3, scope: !998)
!1042 = !DILocation(line: 575, column: 3, scope: !998)
!1043 = !DILocation(line: 577, column: 9, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !998, file: !141, line: 577, column: 7)
!1045 = !DILocation(line: 577, column: 8, scope: !1044)
!1046 = !DILocation(line: 577, column: 7, scope: !998)
!1047 = !DILocation(line: 578, column: 12, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !141, line: 578, column: 5)
!1049 = distinct !DILexicalBlock(scope: !1044, file: !141, line: 577, column: 15)
!1050 = !DILocation(line: 578, column: 10, scope: !1048)
!1051 = !DILocation(line: 578, column: 17, scope: !1052)
!1052 = !DILexicalBlockFile(scope: !1053, file: !141, discriminator: 1)
!1053 = distinct !DILexicalBlock(scope: !1048, file: !141, line: 578, column: 5)
!1054 = !DILocation(line: 578, column: 27, scope: !1052)
!1055 = !DILocation(line: 578, column: 19, scope: !1052)
!1056 = !DILocation(line: 578, column: 5, scope: !1052)
!1057 = !DILocation(line: 579, column: 24, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1053, file: !141, line: 578, column: 40)
!1059 = !DILocation(line: 579, column: 13, scope: !1058)
!1060 = !DILocation(line: 579, column: 19, scope: !1058)
!1061 = !DILocation(line: 579, column: 11, scope: !1058)
!1062 = !DILocation(line: 580, column: 11, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1058, file: !141, line: 580, column: 11)
!1064 = !DILocation(line: 580, column: 16, scope: !1063)
!1065 = !DILocation(line: 580, column: 23, scope: !1063)
!1066 = !DILocation(line: 580, column: 11, scope: !1058)
!1067 = !DILocation(line: 581, column: 9, scope: !1063)
!1068 = !DILocation(line: 582, column: 23, scope: !1058)
!1069 = !DILocation(line: 582, column: 28, scope: !1058)
!1070 = !DILocation(line: 582, column: 34, scope: !1058)
!1071 = !DILocation(line: 582, column: 39, scope: !1058)
!1072 = !DILocation(line: 582, column: 7, scope: !1058)
!1073 = !DILocation(line: 583, column: 5, scope: !1058)
!1074 = !DILocation(line: 578, column: 36, scope: !1075)
!1075 = !DILexicalBlockFile(scope: !1053, file: !141, discriminator: 2)
!1076 = !DILocation(line: 578, column: 5, scope: !1075)
!1077 = distinct !{!1077, !1078}
!1078 = !DILocation(line: 578, column: 5, scope: !1049)
!1079 = !DILocation(line: 584, column: 3, scope: !1049)
!1080 = !DILocation(line: 585, column: 64, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1044, file: !141, line: 584, column: 10)
!1082 = !DILocation(line: 585, column: 69, scope: !1081)
!1083 = !DILocation(line: 585, column: 10, scope: !1081)
!1084 = !DILocation(line: 585, column: 8, scope: !1081)
!1085 = !DILocation(line: 588, column: 11, scope: !998)
!1086 = !DILocation(line: 588, column: 19, scope: !998)
!1087 = !DILocation(line: 588, column: 3, scope: !1088)
!1088 = !DILexicalBlockFile(scope: !998, file: !141, discriminator: 1)
!1089 = !DILocation(line: 589, column: 11, scope: !998)
!1090 = !DILocation(line: 589, column: 19, scope: !998)
!1091 = !DILocation(line: 589, column: 3, scope: !1088)
!1092 = !DILocation(line: 591, column: 3, scope: !998)
!1093 = !DILocation(line: 592, column: 19, scope: !998)
!1094 = !DILocation(line: 592, column: 3, scope: !998)
!1095 = !DILocation(line: 593, column: 3, scope: !998)
!1096 = !DILocation(line: 595, column: 10, scope: !998)
!1097 = !DILocation(line: 595, column: 3, scope: !998)
!1098 = !DILocation(line: 596, column: 1, scope: !998)
!1099 = distinct !DISubprogram(name: "control_path", scope: !141, file: !141, line: 657, type: !169, isLocal: true, isDefinition: true, scopeLine: 658, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !177)
!1100 = !DILocalVariable(name: "argv", arg: 1, scope: !1099, file: !141, line: 657, type: !171)
!1101 = !DILocation(line: 657, column: 33, scope: !1099)
!1102 = !DILocalVariable(name: "pkg", scope: !1099, file: !141, line: 659, type: !255)
!1103 = !DILocation(line: 659, column: 19, scope: !1099)
!1104 = !DILocalVariable(name: "pkgname", scope: !1099, file: !141, line: 660, type: !142)
!1105 = !DILocation(line: 660, column: 15, scope: !1099)
!1106 = !DILocalVariable(name: "control_file", scope: !1099, file: !141, line: 661, type: !142)
!1107 = !DILocation(line: 661, column: 15, scope: !1099)
!1108 = !DILocation(line: 663, column: 18, scope: !1099)
!1109 = !DILocation(line: 663, column: 13, scope: !1099)
!1110 = !DILocation(line: 663, column: 11, scope: !1099)
!1111 = !DILocation(line: 664, column: 8, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1099, file: !141, line: 664, column: 7)
!1113 = !DILocation(line: 664, column: 7, scope: !1099)
!1114 = !DILocation(line: 665, column: 14, scope: !1112)
!1115 = !DILocation(line: 666, column: 14, scope: !1112)
!1116 = !DILocation(line: 666, column: 25, scope: !1112)
!1117 = !DILocation(line: 665, column: 5, scope: !1118)
!1118 = !DILexicalBlockFile(scope: !1112, file: !141, discriminator: 1)
!1119 = !DILocation(line: 665, column: 5, scope: !1112)
!1120 = !DILocation(line: 668, column: 23, scope: !1099)
!1121 = !DILocation(line: 668, column: 18, scope: !1099)
!1122 = !DILocation(line: 668, column: 16, scope: !1099)
!1123 = !DILocation(line: 669, column: 7, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1099, file: !141, line: 669, column: 7)
!1125 = !DILocation(line: 669, column: 20, scope: !1124)
!1126 = !DILocation(line: 669, column: 24, scope: !1127)
!1127 = !DILexicalBlockFile(scope: !1124, file: !141, discriminator: 1)
!1128 = !DILocation(line: 669, column: 23, scope: !1127)
!1129 = !DILocation(line: 669, column: 7, scope: !1127)
!1130 = !DILocation(line: 670, column: 14, scope: !1124)
!1131 = !DILocation(line: 670, column: 59, scope: !1124)
!1132 = !DILocation(line: 670, column: 70, scope: !1124)
!1133 = !DILocation(line: 670, column: 5, scope: !1127)
!1134 = !DILocation(line: 670, column: 5, scope: !1124)
!1135 = !DILocation(line: 672, column: 7, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1099, file: !141, line: 672, column: 7)
!1137 = !DILocation(line: 672, column: 7, scope: !1099)
!1138 = !DILocation(line: 673, column: 31, scope: !1136)
!1139 = !DILocation(line: 673, column: 5, scope: !1136)
!1140 = !DILocation(line: 675, column: 3, scope: !1099)
!1141 = !DILocation(line: 677, column: 36, scope: !1099)
!1142 = !DILocation(line: 677, column: 47, scope: !1099)
!1143 = !DILocation(line: 677, column: 9, scope: !1099)
!1144 = !DILocation(line: 677, column: 7, scope: !1099)
!1145 = !DILocation(line: 678, column: 7, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1099, file: !141, line: 678, column: 7)
!1147 = !DILocation(line: 678, column: 12, scope: !1146)
!1148 = !DILocation(line: 678, column: 19, scope: !1146)
!1149 = !DILocation(line: 678, column: 7, scope: !1099)
!1150 = !DILocation(line: 679, column: 12, scope: !1146)
!1151 = !DILocation(line: 680, column: 21, scope: !1146)
!1152 = !DILocation(line: 680, column: 12, scope: !1146)
!1153 = !DILocation(line: 679, column: 5, scope: !1154)
!1154 = !DILexicalBlockFile(scope: !1146, file: !141, discriminator: 1)
!1155 = !DILocation(line: 679, column: 5, scope: !1146)
!1156 = !DILocation(line: 682, column: 7, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1099, file: !141, line: 682, column: 7)
!1158 = !DILocation(line: 682, column: 7, scope: !1099)
!1159 = !DILocation(line: 683, column: 23, scope: !1157)
!1160 = !DILocation(line: 683, column: 28, scope: !1157)
!1161 = !DILocation(line: 683, column: 5, scope: !1157)
!1162 = !DILocation(line: 685, column: 24, scope: !1157)
!1163 = !DILocation(line: 685, column: 30, scope: !1157)
!1164 = !DILocation(line: 685, column: 35, scope: !1157)
!1165 = !DILocation(line: 685, column: 5, scope: !1157)
!1166 = !DILocation(line: 687, column: 3, scope: !1099)
!1167 = !DILocation(line: 689, column: 3, scope: !1099)
!1168 = distinct !DISubprogram(name: "control_list", scope: !141, file: !141, line: 693, type: !169, isLocal: true, isDefinition: true, scopeLine: 694, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !177)
!1169 = !DILocalVariable(name: "argv", arg: 1, scope: !1168, file: !141, line: 693, type: !171)
!1170 = !DILocation(line: 693, column: 33, scope: !1168)
!1171 = !DILocalVariable(name: "pkg", scope: !1168, file: !141, line: 695, type: !255)
!1172 = !DILocation(line: 695, column: 19, scope: !1168)
!1173 = !DILocalVariable(name: "pkgname", scope: !1168, file: !141, line: 696, type: !142)
!1174 = !DILocation(line: 696, column: 15, scope: !1168)
!1175 = !DILocation(line: 698, column: 18, scope: !1168)
!1176 = !DILocation(line: 698, column: 13, scope: !1168)
!1177 = !DILocation(line: 698, column: 11, scope: !1168)
!1178 = !DILocation(line: 699, column: 8, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1168, file: !141, line: 699, column: 7)
!1180 = !DILocation(line: 699, column: 16, scope: !1179)
!1181 = !DILocation(line: 699, column: 20, scope: !1182)
!1182 = !DILexicalBlockFile(scope: !1179, file: !141, discriminator: 1)
!1183 = !DILocation(line: 699, column: 19, scope: !1182)
!1184 = !DILocation(line: 699, column: 7, scope: !1182)
!1185 = !DILocation(line: 700, column: 14, scope: !1179)
!1186 = !DILocation(line: 700, column: 63, scope: !1179)
!1187 = !DILocation(line: 700, column: 74, scope: !1179)
!1188 = !DILocation(line: 700, column: 5, scope: !1182)
!1189 = !DILocation(line: 700, column: 5, scope: !1179)
!1190 = !DILocation(line: 702, column: 3, scope: !1168)
!1191 = !DILocation(line: 704, column: 36, scope: !1168)
!1192 = !DILocation(line: 704, column: 47, scope: !1168)
!1193 = !DILocation(line: 704, column: 9, scope: !1168)
!1194 = !DILocation(line: 704, column: 7, scope: !1168)
!1195 = !DILocation(line: 705, column: 7, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1168, file: !141, line: 705, column: 7)
!1197 = !DILocation(line: 705, column: 12, scope: !1196)
!1198 = !DILocation(line: 705, column: 19, scope: !1196)
!1199 = !DILocation(line: 705, column: 7, scope: !1168)
!1200 = !DILocation(line: 706, column: 12, scope: !1196)
!1201 = !DILocation(line: 706, column: 63, scope: !1196)
!1202 = !DILocation(line: 706, column: 54, scope: !1203)
!1203 = !DILexicalBlockFile(scope: !1196, file: !141, discriminator: 1)
!1204 = !DILocation(line: 706, column: 5, scope: !1205)
!1205 = !DILexicalBlockFile(scope: !1196, file: !141, discriminator: 2)
!1206 = !DILocation(line: 706, column: 5, scope: !1196)
!1207 = !DILocation(line: 708, column: 22, scope: !1168)
!1208 = !DILocation(line: 708, column: 28, scope: !1168)
!1209 = !DILocation(line: 708, column: 33, scope: !1168)
!1210 = !DILocation(line: 708, column: 3, scope: !1168)
!1211 = !DILocation(line: 710, column: 3, scope: !1168)
!1212 = !DILocation(line: 712, column: 3, scope: !1168)
!1213 = distinct !DISubprogram(name: "control_show", scope: !141, file: !141, line: 716, type: !169, isLocal: true, isDefinition: true, scopeLine: 717, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !177)
!1214 = !DILocalVariable(name: "argv", arg: 1, scope: !1213, file: !141, line: 716, type: !171)
!1215 = !DILocation(line: 716, column: 33, scope: !1213)
!1216 = !DILocalVariable(name: "pkg", scope: !1213, file: !141, line: 718, type: !255)
!1217 = !DILocation(line: 718, column: 19, scope: !1213)
!1218 = !DILocalVariable(name: "pkgname", scope: !1213, file: !141, line: 719, type: !142)
!1219 = !DILocation(line: 719, column: 15, scope: !1213)
!1220 = !DILocalVariable(name: "filename", scope: !1213, file: !141, line: 720, type: !142)
!1221 = !DILocation(line: 720, column: 15, scope: !1213)
!1222 = !DILocalVariable(name: "control_file", scope: !1213, file: !141, line: 721, type: !142)
!1223 = !DILocation(line: 721, column: 15, scope: !1213)
!1224 = !DILocation(line: 723, column: 18, scope: !1213)
!1225 = !DILocation(line: 723, column: 13, scope: !1213)
!1226 = !DILocation(line: 723, column: 11, scope: !1213)
!1227 = !DILocation(line: 724, column: 8, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1213, file: !141, line: 724, column: 7)
!1229 = !DILocation(line: 724, column: 16, scope: !1228)
!1230 = !DILocation(line: 724, column: 21, scope: !1231)
!1231 = !DILexicalBlockFile(scope: !1228, file: !141, discriminator: 1)
!1232 = !DILocation(line: 724, column: 20, scope: !1231)
!1233 = !DILocation(line: 724, column: 7, scope: !1231)
!1234 = !DILocation(line: 725, column: 14, scope: !1228)
!1235 = !DILocation(line: 726, column: 14, scope: !1228)
!1236 = !DILocation(line: 726, column: 25, scope: !1228)
!1237 = !DILocation(line: 725, column: 5, scope: !1231)
!1238 = !DILocation(line: 725, column: 5, scope: !1228)
!1239 = !DILocation(line: 728, column: 23, scope: !1213)
!1240 = !DILocation(line: 728, column: 18, scope: !1213)
!1241 = !DILocation(line: 728, column: 16, scope: !1213)
!1242 = !DILocation(line: 729, column: 8, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1213, file: !141, line: 729, column: 7)
!1244 = !DILocation(line: 729, column: 21, scope: !1243)
!1245 = !DILocation(line: 729, column: 25, scope: !1246)
!1246 = !DILexicalBlockFile(scope: !1243, file: !141, discriminator: 1)
!1247 = !DILocation(line: 729, column: 24, scope: !1246)
!1248 = !DILocation(line: 729, column: 7, scope: !1246)
!1249 = !DILocation(line: 730, column: 14, scope: !1243)
!1250 = !DILocation(line: 730, column: 59, scope: !1243)
!1251 = !DILocation(line: 730, column: 70, scope: !1243)
!1252 = !DILocation(line: 730, column: 5, scope: !1246)
!1253 = !DILocation(line: 730, column: 5, scope: !1243)
!1254 = !DILocation(line: 732, column: 29, scope: !1213)
!1255 = !DILocation(line: 732, column: 3, scope: !1213)
!1256 = !DILocation(line: 734, column: 3, scope: !1213)
!1257 = !DILocation(line: 736, column: 36, scope: !1213)
!1258 = !DILocation(line: 736, column: 47, scope: !1213)
!1259 = !DILocation(line: 736, column: 9, scope: !1213)
!1260 = !DILocation(line: 736, column: 7, scope: !1213)
!1261 = !DILocation(line: 737, column: 7, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1213, file: !141, line: 737, column: 7)
!1263 = !DILocation(line: 737, column: 12, scope: !1262)
!1264 = !DILocation(line: 737, column: 19, scope: !1262)
!1265 = !DILocation(line: 737, column: 7, scope: !1213)
!1266 = !DILocation(line: 738, column: 12, scope: !1262)
!1267 = !DILocation(line: 738, column: 63, scope: !1262)
!1268 = !DILocation(line: 738, column: 54, scope: !1269)
!1269 = !DILexicalBlockFile(scope: !1262, file: !141, discriminator: 1)
!1270 = !DILocation(line: 738, column: 5, scope: !1271)
!1271 = !DILexicalBlockFile(scope: !1262, file: !141, discriminator: 2)
!1272 = !DILocation(line: 738, column: 5, scope: !1262)
!1273 = !DILocation(line: 740, column: 27, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1213, file: !141, line: 740, column: 7)
!1275 = !DILocation(line: 740, column: 33, scope: !1274)
!1276 = !DILocation(line: 740, column: 38, scope: !1274)
!1277 = !DILocation(line: 740, column: 49, scope: !1274)
!1278 = !DILocation(line: 740, column: 7, scope: !1274)
!1279 = !DILocation(line: 740, column: 7, scope: !1213)
!1280 = !DILocation(line: 741, column: 36, scope: !1274)
!1281 = !DILocation(line: 741, column: 42, scope: !1274)
!1282 = !DILocation(line: 741, column: 47, scope: !1274)
!1283 = !DILocation(line: 741, column: 58, scope: !1274)
!1284 = !DILocation(line: 741, column: 16, scope: !1274)
!1285 = !DILocation(line: 741, column: 14, scope: !1274)
!1286 = !DILocation(line: 741, column: 5, scope: !1274)
!1287 = !DILocation(line: 743, column: 12, scope: !1274)
!1288 = !DILocation(line: 743, column: 57, scope: !1274)
!1289 = !DILocation(line: 743, column: 5, scope: !1290)
!1290 = !DILexicalBlockFile(scope: !1274, file: !141, discriminator: 1)
!1291 = !DILocation(line: 743, column: 5, scope: !1274)
!1292 = !DILocation(line: 745, column: 3, scope: !1213)
!1293 = !DILocation(line: 747, column: 13, scope: !1213)
!1294 = !DILocation(line: 747, column: 3, scope: !1213)
!1295 = !DILocation(line: 749, column: 3, scope: !1213)
!1296 = distinct !DISubprogram(name: "set_no_pager", scope: !141, file: !141, line: 753, type: !161, isLocal: true, isDefinition: true, scopeLine: 754, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !177)
!1297 = !DILocalVariable(name: "ci", arg: 1, scope: !1296, file: !141, line: 753, type: !163)
!1298 = !DILocation(line: 753, column: 36, scope: !1296)
!1299 = !DILocalVariable(name: "value", arg: 2, scope: !1296, file: !141, line: 753, type: !142)
!1300 = !DILocation(line: 753, column: 52, scope: !1296)
!1301 = !DILocation(line: 755, column: 3, scope: !1296)
!1302 = !DILocation(line: 756, column: 1, scope: !1296)
!1303 = distinct !DISubprogram(name: "usage", scope: !141, file: !141, line: 773, type: !161, isLocal: true, isDefinition: true, scopeLine: 774, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !177)
!1304 = !DILocalVariable(name: "ci", arg: 1, scope: !1303, file: !141, line: 773, type: !163)
!1305 = !DILocation(line: 773, column: 29, scope: !1303)
!1306 = !DILocalVariable(name: "value", arg: 2, scope: !1303, file: !141, line: 773, type: !142)
!1307 = !DILocation(line: 773, column: 45, scope: !1303)
!1308 = !DILocation(line: 775, column: 10, scope: !1303)
!1309 = !DILocation(line: 775, column: 3, scope: !1310)
!1310 = !DILexicalBlockFile(scope: !1303, file: !141, discriminator: 1)
!1311 = !DILocation(line: 779, column: 10, scope: !1303)
!1312 = !DILocation(line: 779, column: 3, scope: !1310)
!1313 = !DILocation(line: 794, column: 10, scope: !1303)
!1314 = !DILocation(line: 794, column: 3, scope: !1310)
!1315 = !DILocation(line: 799, column: 10, scope: !1303)
!1316 = !DILocation(line: 799, column: 3, scope: !1310)
!1317 = !DILocation(line: 806, column: 10, scope: !1303)
!1318 = !DILocation(line: 806, column: 3, scope: !1310)
!1319 = !DILocation(line: 815, column: 11, scope: !1303)
!1320 = !DILocation(line: 815, column: 19, scope: !1303)
!1321 = !DILocation(line: 815, column: 3, scope: !1310)
!1322 = !DILocation(line: 817, column: 3, scope: !1303)
!1323 = !DILocation(line: 818, column: 1, scope: !1303)
!1324 = distinct !DISubprogram(name: "printversion", scope: !141, file: !141, line: 759, type: !161, isLocal: true, isDefinition: true, scopeLine: 760, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !177)
!1325 = !DILocalVariable(name: "ci", arg: 1, scope: !1324, file: !141, line: 759, type: !163)
!1326 = !DILocation(line: 759, column: 36, scope: !1324)
!1327 = !DILocalVariable(name: "value", arg: 2, scope: !1324, file: !141, line: 759, type: !142)
!1328 = !DILocation(line: 759, column: 52, scope: !1324)
!1329 = !DILocation(line: 761, column: 10, scope: !1324)
!1330 = !DILocation(line: 761, column: 3, scope: !1331)
!1331 = !DILexicalBlockFile(scope: !1324, file: !141, discriminator: 1)
!1332 = !DILocation(line: 763, column: 10, scope: !1324)
!1333 = !DILocation(line: 763, column: 3, scope: !1331)
!1334 = !DILocation(line: 767, column: 11, scope: !1324)
!1335 = !DILocation(line: 767, column: 19, scope: !1324)
!1336 = !DILocation(line: 767, column: 3, scope: !1331)
!1337 = !DILocation(line: 769, column: 3, scope: !1324)
!1338 = !DILocation(line: 770, column: 1, scope: !1324)
!1339 = distinct !DISubprogram(name: "str_is_unset", scope: !1340, file: !1340, line: 41, type: !1341, isLocal: true, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !177)
!1340 = !DIFile(filename: "../lib/dpkg/string.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg-query")
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!302, !142}
!1343 = !DILocalVariable(name: "str", arg: 1, scope: !1339, file: !1340, line: 41, type: !142)
!1344 = !DILocation(line: 41, column: 26, scope: !1339)
!1345 = !DILocation(line: 43, column: 9, scope: !1339)
!1346 = !DILocation(line: 43, column: 13, scope: !1339)
!1347 = !DILocation(line: 43, column: 20, scope: !1339)
!1348 = !DILocation(line: 43, column: 23, scope: !1349)
!1349 = !DILexicalBlockFile(scope: !1339, file: !1340, discriminator: 1)
!1350 = !DILocation(line: 43, column: 30, scope: !1349)
!1351 = !DILocation(line: 43, column: 20, scope: !1349)
!1352 = !DILocation(line: 43, column: 2, scope: !1353)
!1353 = !DILexicalBlockFile(scope: !1339, file: !1340, discriminator: 2)
!1354 = distinct !DISubprogram(name: "pkg_array_list_item", scope: !141, file: !141, line: 226, type: !1355, isLocal: true, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !177)
!1355 = !DISubroutineType(types: !1356)
!1356 = !{null, !1357, !255, !138}
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64, align: 64)
!1358 = !DILocalVariable(name: "array", arg: 1, scope: !1354, file: !141, line: 226, type: !1357)
!1359 = !DILocation(line: 226, column: 39, scope: !1354)
!1360 = !DILocalVariable(name: "pkg", arg: 2, scope: !1354, file: !141, line: 226, type: !255)
!1361 = !DILocation(line: 226, column: 62, scope: !1354)
!1362 = !DILocalVariable(name: "pkg_data", arg: 3, scope: !1354, file: !141, line: 226, type: !138)
!1363 = !DILocation(line: 226, column: 73, scope: !1354)
!1364 = !DILocalVariable(name: "fmt", scope: !1354, file: !141, line: 228, type: !1365)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64, align: 64)
!1366 = !DILocation(line: 228, column: 23, scope: !1354)
!1367 = !DILocation(line: 228, column: 29, scope: !1354)
!1368 = !DILocalVariable(name: "l", scope: !1354, file: !141, line: 229, type: !154)
!1369 = !DILocation(line: 229, column: 7, scope: !1354)
!1370 = !DILocalVariable(name: "pdesc", scope: !1354, file: !141, line: 230, type: !142)
!1371 = !DILocation(line: 230, column: 15, scope: !1354)
!1372 = !DILocation(line: 232, column: 20, scope: !1354)
!1373 = !DILocation(line: 232, column: 25, scope: !1354)
!1374 = !DILocation(line: 232, column: 3, scope: !1354)
!1375 = !DILocation(line: 233, column: 28, scope: !1354)
!1376 = !DILocation(line: 233, column: 3, scope: !1354)
!1377 = !DILocation(line: 235, column: 27, scope: !1354)
!1378 = !DILocation(line: 235, column: 33, scope: !1354)
!1379 = !DILocation(line: 235, column: 38, scope: !1354)
!1380 = !DILocation(line: 235, column: 11, scope: !1354)
!1381 = !DILocation(line: 235, column: 9, scope: !1354)
!1382 = !DILocation(line: 236, column: 9, scope: !1354)
!1383 = !DILocation(line: 236, column: 15, scope: !1354)
!1384 = !DILocation(line: 236, column: 20, scope: !1354)
!1385 = !DILocation(line: 236, column: 12, scope: !1354)
!1386 = !DILocation(line: 236, column: 8, scope: !1354)
!1387 = !DILocation(line: 236, column: 27, scope: !1388)
!1388 = !DILexicalBlockFile(scope: !1354, file: !141, discriminator: 1)
!1389 = !DILocation(line: 236, column: 8, scope: !1388)
!1390 = !DILocation(line: 236, column: 33, scope: !1391)
!1391 = !DILexicalBlockFile(scope: !1354, file: !141, discriminator: 2)
!1392 = !DILocation(line: 236, column: 38, scope: !1391)
!1393 = !DILocation(line: 236, column: 8, scope: !1391)
!1394 = !DILocation(line: 236, column: 8, scope: !1395)
!1395 = !DILexicalBlockFile(scope: !1354, file: !141, discriminator: 3)
!1396 = !DILocation(line: 236, column: 5, scope: !1395)
!1397 = !DILocation(line: 238, column: 21, scope: !1354)
!1398 = !DILocation(line: 239, column: 37, scope: !1354)
!1399 = !DILocation(line: 239, column: 21, scope: !1354)
!1400 = !DILocation(line: 240, column: 39, scope: !1354)
!1401 = !DILocation(line: 240, column: 21, scope: !1354)
!1402 = !DILocation(line: 241, column: 38, scope: !1354)
!1403 = !DILocation(line: 241, column: 21, scope: !1354)
!1404 = !DILocation(line: 242, column: 30, scope: !1354)
