; ModuleID = './procMgrPosix.o.i'
source_filename = "./procMgrPosix.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.DynBuf = type { i8*, i64, i64 }
%struct.DynArray = type { %struct.DynBuf, i64 }
%struct.ProcMgrProcInfo = type { i32, i8*, i8*, i8*, i64 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.ProcMgr_ProcArgs = type { i8**, i8* }
%struct.ProcMgr_AsyncProc = type { i32, i32, i32, i8, i32 }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.__sigset_t = type { [16 x i64] }
%union.anon.8 = type { i32 }
%union.anon.9 = type { i32 }
%union.anon.10 = type { i32 }
%union.anon.11 = type { i32 }
%struct.fd_set = type { [16 x i64] }
%struct.timeval = type { i64, i64 }

@.str = private unnamed_addr constant [1 x i8] zeroinitializer, align 1

!516 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!517 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!518 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!519 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!520 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!521 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!522 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!523 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!524 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!525 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!526 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!527 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!528 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!529 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!530 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!531 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!532 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!533 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!534 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!535 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!536 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!537 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!538 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!539 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!540 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!541 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!542 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!543 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!544 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!545 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!546 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!547 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!548 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!549 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!550 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!551 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!552 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!553 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!554 = !{!555, !556, !561, !562, !564, !566, !568, !569, !570, !565, !573, !578, !580, !596, !598, !599, !610, !616}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !557, line: 75, baseType: !558)
!557 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !559, line: 139, baseType: !560)
!559 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!560 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!561 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64, align: 64)
!565 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !571, line: 263, baseType: !572)
!571 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !559, line: 133, baseType: !565)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !574, line: 85, baseType: !575)
!574 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64, align: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !565}
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !579, line: 54, baseType: !560)
!579 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "DynArray", file: !582, line: 42, baseType: !583)
!582 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dynarray.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynArray", file: !582, line: 39, size: 256, align: 64, elements: !584)
!584 = !{!585, !595}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !583, file: !582, line: 40, baseType: !586, size: 192, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "DynBuf", file: !587, line: 40, baseType: !588)
!587 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dynbuf.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynBuf", file: !587, line: 36, size: 192, align: 64, elements: !589)
!589 = !{!590, !591, !594}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !588, file: !587, line: 37, baseType: !562, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !588, file: !587, line: 38, baseType: !592, size: 64, align: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !593, line: 216, baseType: !567)
!593 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!594 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !588, file: !587, line: 39, baseType: !592, size: 64, align: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !583, file: !582, line: 41, baseType: !592, size: 64, align: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !581)
!598 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProcMgrProcInfo", file: !601, line: 65, baseType: !602)
!601 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/procMgr.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ProcMgrProcInfo", file: !601, line: 56, size: 320, align: 64, elements: !603)
!603 = !{!604, !606, !607, !608, !609}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "procId", scope: !602, file: !601, line: 57, baseType: !605, size: 32, align: 32)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProcMgr_Pid", file: !601, line: 47, baseType: !570)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "procCmdName", scope: !602, file: !601, line: 58, baseType: !562, size: 64, align: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "procCmdLine", scope: !602, file: !601, line: 59, baseType: !562, size: 64, align: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "procOwner", scope: !602, file: !601, line: 60, baseType: !562, size: 64, align: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "procStartTime", scope: !602, file: !601, line: 64, baseType: !556, size: 64, align: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !612, line: 177, baseType: !613)
!612 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !614, line: 48, baseType: !615)
!614 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!615 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!617 = !{!618, !626, !627, !632, !643}
!618 = distinct !DIGlobalVariable(name: "hostStartTime", scope: !619, file: !620, line: 252, type: !556, isLocal: true, isDefinition: true, variable: i64* @ProcMgr_ListProcesses.hostStartTime)
!619 = distinct !DISubprogram(name: "ProcMgr_ListProcesses", scope: !620, file: !620, line: 245, type: !621, isLocal: false, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !625)
!620 = !DIFile(filename: "procMgrPosix.c", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!621 = !DISubroutineType(types: !622)
!622 = !{!623}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProcMgrProcInfoArray", file: !601, line: 67, baseType: !581)
!625 = !{}
!626 = distinct !DIGlobalVariable(name: "hertz", scope: !619, file: !620, line: 253, type: !561, isLocal: true, isDefinition: true, variable: i64* @ProcMgr_ListProcesses.hertz)
!627 = distinct !DIGlobalVariable(name: "cSignals", scope: !0, file: !620, line: 95, type: !628, isLocal: true, isDefinition: true, variable: [6 x i32]* @cSignals)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 192, align: 32, elements: !630)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!630 = !{!631}
!631 = !DISubrange(count: 6)
!632 = distinct !DIGlobalVariable(name: "bashShellPath", scope: !633, file: !620, line: 1416, type: !640, isLocal: true, isDefinition: true, variable: [10 x i8]* @ProcMgrStartProcess.bashShellPath)
!633 = distinct !DISubprogram(name: "ProcMgrStartProcess", scope: !620, file: !620, line: 1345, type: !634, isLocal: true, isDefinition: true, scopeLine: 1348, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !625)
!634 = !DISubroutineType(types: !635)
!635 = !{!570, !636, !638, !636}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !562)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 80, align: 8, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 10)
!643 = distinct !DIGlobalVariable(name: "bourneShellPath", scope: !633, file: !620, line: 1418, type: !644, isLocal: true, isDefinition: true, variable: [8 x i8]* @ProcMgrStartProcess.bourneShellPath)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 64, align: 8, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 8)
!647 = !{i32 2, !"Dwarf Version", i32 4}
!648 = !{i32 2, !"Debug Info Version", i32 3}
!649 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!650 = distinct !DISubprogram(name: "ProcMgr_ReadProcFile", scope: !620, file: !620, line: 173, type: !651, isLocal: false, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !625)
!651 = !DISubroutineType(types: !652)
!652 = !{!565, !565, !653}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!654 = !DILocalVariable(name: "fd", arg: 1, scope: !650, file: !620, line: 173, type: !565)
!655 = !DIExpression()
!656 = !DILocation(line: 173, column: 26, scope: !650)
!657 = !DILocalVariable(name: "contents", arg: 2, scope: !650, file: !620, line: 174, type: !653)
!658 = !DILocation(line: 174, column: 29, scope: !650)
!659 = !DILocalVariable(name: "size", scope: !650, file: !620, line: 176, type: !565)
!660 = !DILocation(line: 176, column: 8, scope: !650)
!661 = !DILocalVariable(name: "tmp", scope: !650, file: !620, line: 177, type: !662)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 4096, align: 8, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 512)
!665 = !DILocation(line: 177, column: 9, scope: !650)
!666 = !DILocalVariable(name: "numRead", scope: !650, file: !620, line: 178, type: !565)
!667 = !DILocation(line: 178, column: 8, scope: !650)
!668 = !DILocation(line: 180, column: 5, scope: !650)
!669 = !DILocation(line: 180, column: 14, scope: !650)
!670 = !DILocation(line: 181, column: 19, scope: !650)
!671 = !DILocation(line: 181, column: 23, scope: !650)
!672 = !DILocation(line: 181, column: 14, scope: !650)
!673 = !DILocation(line: 181, column: 12, scope: !650)
!674 = !DILocation(line: 182, column: 11, scope: !650)
!675 = !DILocation(line: 182, column: 9, scope: !650)
!676 = !DILocation(line: 184, column: 8, scope: !677)
!677 = distinct !DILexicalBlock(scope: !650, file: !620, line: 184, column: 8)
!678 = !DILocation(line: 184, column: 16, scope: !677)
!679 = !DILocation(line: 184, column: 8, scope: !650)
!680 = !DILocation(line: 185, column: 7, scope: !681)
!681 = distinct !DILexicalBlock(scope: !677, file: !620, line: 184, column: 22)
!682 = !DILocation(line: 191, column: 22, scope: !683)
!683 = distinct !DILexicalBlock(scope: !650, file: !620, line: 191, column: 8)
!684 = !DILocation(line: 191, column: 20, scope: !683)
!685 = !DILocation(line: 191, column: 8, scope: !650)
!686 = !DILocalVariable(name: "result", scope: !687, file: !620, line: 192, type: !562)
!687 = distinct !DILexicalBlock(scope: !683, file: !620, line: 191, column: 31)
!688 = !DILocation(line: 192, column: 13, scope: !687)
!689 = !DILocation(line: 194, column: 23, scope: !687)
!690 = !DILocation(line: 194, column: 31, scope: !687)
!691 = !DILocation(line: 194, column: 16, scope: !687)
!692 = !DILocation(line: 194, column: 14, scope: !687)
!693 = !DILocation(line: 195, column: 18, scope: !694)
!694 = distinct !DILexicalBlock(scope: !687, file: !620, line: 195, column: 10)
!695 = !DILocation(line: 195, column: 15, scope: !694)
!696 = !DILocation(line: 195, column: 10, scope: !687)
!697 = !DILocation(line: 196, column: 15, scope: !698)
!698 = distinct !DILexicalBlock(scope: !694, file: !620, line: 195, column: 26)
!699 = !DILocation(line: 197, column: 10, scope: !698)
!700 = !DILocation(line: 199, column: 14, scope: !687)
!701 = !DILocation(line: 199, column: 7, scope: !687)
!702 = !DILocation(line: 199, column: 27, scope: !687)
!703 = !DILocation(line: 200, column: 14, scope: !687)
!704 = !DILocation(line: 200, column: 7, scope: !687)
!705 = !DILocation(line: 200, column: 23, scope: !687)
!706 = !DILocation(line: 201, column: 19, scope: !687)
!707 = !DILocation(line: 201, column: 8, scope: !687)
!708 = !DILocation(line: 201, column: 17, scope: !687)
!709 = !DILocation(line: 202, column: 7, scope: !687)
!710 = !DILocalVariable(name: "dbuf", scope: !711, file: !620, line: 204, type: !586)
!711 = distinct !DILexicalBlock(scope: !683, file: !620, line: 203, column: 11)
!712 = !DILocation(line: 204, column: 14, scope: !711)
!713 = !DILocation(line: 206, column: 7, scope: !711)
!714 = !DILocation(line: 207, column: 28, scope: !711)
!715 = !DILocation(line: 207, column: 33, scope: !711)
!716 = !DILocation(line: 207, column: 7, scope: !711)
!717 = !DILocation(line: 208, column: 7, scope: !711)
!718 = distinct !{!718, !717}
!719 = !DILocation(line: 209, column: 25, scope: !720)
!720 = distinct !DILexicalBlock(scope: !711, file: !620, line: 208, column: 10)
!721 = !DILocation(line: 209, column: 29, scope: !720)
!722 = !DILocation(line: 209, column: 20, scope: !720)
!723 = !DILocation(line: 209, column: 18, scope: !720)
!724 = !DILocation(line: 210, column: 14, scope: !725)
!725 = distinct !DILexicalBlock(scope: !720, file: !620, line: 210, column: 14)
!726 = !DILocation(line: 210, column: 22, scope: !725)
!727 = !DILocation(line: 210, column: 14, scope: !720)
!728 = !DILocation(line: 211, column: 34, scope: !729)
!729 = distinct !DILexicalBlock(scope: !725, file: !620, line: 210, column: 27)
!730 = !DILocation(line: 211, column: 39, scope: !729)
!731 = !DILocation(line: 211, column: 13, scope: !729)
!732 = !DILocation(line: 212, column: 10, scope: !729)
!733 = !DILocation(line: 213, column: 18, scope: !720)
!734 = !DILocation(line: 213, column: 15, scope: !720)
!735 = !DILocation(line: 214, column: 7, scope: !720)
!736 = !DILocation(line: 214, column: 16, scope: !737)
!737 = !DILexicalBlockFile(scope: !711, file: !620, discriminator: 1)
!738 = !DILocation(line: 214, column: 24, scope: !737)
!739 = !DILocation(line: 214, column: 7, scope: !737)
!740 = !DILocation(line: 216, column: 7, scope: !711)
!741 = !DILocation(line: 217, column: 7, scope: !711)
!742 = !DILocation(line: 218, column: 19, scope: !711)
!743 = !DILocation(line: 218, column: 8, scope: !711)
!744 = !DILocation(line: 218, column: 17, scope: !711)
!745 = !DILocation(line: 219, column: 7, scope: !711)
!746 = !DILocation(line: 191, column: 22, scope: !747)
!747 = !DILexicalBlockFile(scope: !683, file: !620, discriminator: 1)
!748 = !DILocation(line: 222, column: 11, scope: !650)
!749 = !DILocation(line: 222, column: 4, scope: !650)
!750 = !DILocalVariable(name: "procList", scope: !619, file: !620, line: 247, type: !623)
!751 = !DILocation(line: 247, column: 26, scope: !619)
!752 = !DILocalVariable(name: "procInfo", scope: !619, file: !620, line: 248, type: !600)
!753 = !DILocation(line: 248, column: 20, scope: !619)
!754 = !DILocalVariable(name: "failed", scope: !619, file: !620, line: 249, type: !755)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !612, line: 230, baseType: !563)
!756 = !DILocation(line: 249, column: 9, scope: !619)
!757 = !DILocalVariable(name: "dir", scope: !619, file: !620, line: 250, type: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !760, line: 127, baseType: !761)
!760 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !760, line: 127, flags: DIFlagFwdDecl)
!762 = !DILocation(line: 250, column: 9, scope: !619)
!763 = !DILocalVariable(name: "ent", scope: !619, file: !620, line: 251, type: !764)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64, align: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !766, line: 22, size: 2240, align: 64, elements: !767)
!766 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!767 = !{!768, !770, !772, !774, !775}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !765, file: !766, line: 28, baseType: !769, size: 64, align: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !559, line: 128, baseType: !567)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !765, file: !766, line: 29, baseType: !771, size: 64, align: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !559, line: 132, baseType: !560)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !765, file: !766, line: 31, baseType: !773, size: 16, align: 16, offset: 128)
!773 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !765, file: !766, line: 32, baseType: !615, size: 8, align: 8, offset: 144)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !765, file: !766, line: 33, baseType: !776, size: 2048, align: 8, offset: 152)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 2048, align: 8, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 256)
!779 = !DILocation(line: 251, column: 19, scope: !619)
!780 = !DILocalVariable(name: "numberFound", scope: !619, file: !620, line: 254, type: !565)
!781 = !DILocation(line: 254, column: 8, scope: !619)
!782 = !DILocation(line: 256, column: 15, scope: !619)
!783 = !DILocation(line: 256, column: 13, scope: !619)
!784 = !DILocation(line: 257, column: 30, scope: !619)
!785 = !DILocation(line: 257, column: 4, scope: !619)
!786 = !DILocation(line: 258, column: 13, scope: !619)
!787 = !DILocation(line: 258, column: 25, scope: !619)
!788 = !DILocation(line: 259, column: 13, scope: !619)
!789 = !DILocation(line: 259, column: 25, scope: !619)
!790 = !DILocation(line: 260, column: 13, scope: !619)
!791 = !DILocation(line: 260, column: 23, scope: !619)
!792 = !DILocation(line: 269, column: 13, scope: !793)
!793 = distinct !DILexicalBlock(scope: !619, file: !620, line: 269, column: 8)
!794 = !DILocation(line: 269, column: 10, scope: !793)
!795 = !DILocation(line: 269, column: 8, scope: !619)
!796 = !DILocalVariable(name: "uptimeFile", scope: !797, file: !620, line: 270, type: !798)
!797 = distinct !DILexicalBlock(scope: !793, file: !620, line: 269, column: 28)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !800, line: 48, baseType: !801)
!800 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !802, line: 241, size: 1728, align: 64, elements: !803)
!802 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!803 = !{!804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !824, !825, !826, !827, !829, !830, !832, !836, !839, !840, !841, !842, !843, !844, !845, !846}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !801, file: !802, line: 242, baseType: !565, size: 32, align: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !801, file: !802, line: 247, baseType: !562, size: 64, align: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !801, file: !802, line: 248, baseType: !562, size: 64, align: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !801, file: !802, line: 249, baseType: !562, size: 64, align: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !801, file: !802, line: 250, baseType: !562, size: 64, align: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !801, file: !802, line: 251, baseType: !562, size: 64, align: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !801, file: !802, line: 252, baseType: !562, size: 64, align: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !801, file: !802, line: 253, baseType: !562, size: 64, align: 64, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !801, file: !802, line: 254, baseType: !562, size: 64, align: 64, offset: 512)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !801, file: !802, line: 256, baseType: !562, size: 64, align: 64, offset: 576)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !801, file: !802, line: 257, baseType: !562, size: 64, align: 64, offset: 640)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !801, file: !802, line: 258, baseType: !562, size: 64, align: 64, offset: 704)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !801, file: !802, line: 260, baseType: !817, size: 64, align: 64, offset: 768)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64, align: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !802, line: 156, size: 192, align: 64, elements: !819)
!819 = !{!820, !821, !823}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !818, file: !802, line: 157, baseType: !817, size: 64, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !818, file: !802, line: 158, baseType: !822, size: 64, align: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64, align: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !818, file: !802, line: 162, baseType: !565, size: 32, align: 32, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !801, file: !802, line: 262, baseType: !822, size: 64, align: 64, offset: 832)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !801, file: !802, line: 264, baseType: !565, size: 32, align: 32, offset: 896)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !801, file: !802, line: 268, baseType: !565, size: 32, align: 32, offset: 928)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !801, file: !802, line: 270, baseType: !828, size: 64, align: 64, offset: 960)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !559, line: 131, baseType: !560)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !801, file: !802, line: 274, baseType: !773, size: 16, align: 16, offset: 1024)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !801, file: !802, line: 275, baseType: !831, size: 8, align: 8, offset: 1040)
!831 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !801, file: !802, line: 276, baseType: !833, size: 8, align: 8, offset: 1048)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 8, align: 8, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 1)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !801, file: !802, line: 280, baseType: !837, size: 64, align: 64, offset: 1088)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64, align: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !802, line: 150, baseType: null)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !801, file: !802, line: 289, baseType: !771, size: 64, align: 64, offset: 1152)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !801, file: !802, line: 297, baseType: !555, size: 64, align: 64, offset: 1216)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !801, file: !802, line: 298, baseType: !555, size: 64, align: 64, offset: 1280)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !801, file: !802, line: 299, baseType: !555, size: 64, align: 64, offset: 1344)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !801, file: !802, line: 300, baseType: !555, size: 64, align: 64, offset: 1408)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !801, file: !802, line: 302, baseType: !592, size: 64, align: 64, offset: 1472)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !801, file: !802, line: 303, baseType: !565, size: 32, align: 32, offset: 1536)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !801, file: !802, line: 305, baseType: !847, size: 160, align: 8, offset: 1568)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 160, align: 8, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 20)
!850 = !DILocation(line: 270, column: 13, scope: !797)
!851 = !DILocation(line: 272, column: 20, scope: !797)
!852 = !DILocation(line: 272, column: 18, scope: !797)
!853 = !DILocation(line: 273, column: 18, scope: !854)
!854 = distinct !DILexicalBlock(scope: !797, file: !620, line: 273, column: 10)
!855 = !DILocation(line: 273, column: 15, scope: !854)
!856 = !DILocation(line: 273, column: 10, scope: !797)
!857 = !DILocalVariable(name: "secondsSinceBoot", scope: !858, file: !620, line: 274, type: !859)
!858 = distinct !DILexicalBlock(scope: !854, file: !620, line: 273, column: 30)
!859 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!860 = !DILocation(line: 274, column: 17, scope: !858)
!861 = !DILocalVariable(name: "realLocale", scope: !858, file: !620, line: 275, type: !562)
!862 = !DILocation(line: 275, column: 16, scope: !858)
!863 = !DILocalVariable(name: "savedLocale", scope: !858, file: !620, line: 276, type: !562)
!864 = !DILocation(line: 276, column: 16, scope: !858)
!865 = !DILocation(line: 281, column: 23, scope: !858)
!866 = !DILocation(line: 281, column: 21, scope: !858)
!867 = !DILocation(line: 286, column: 41, scope: !858)
!868 = !DILocation(line: 286, column: 24, scope: !858)
!869 = !DILocation(line: 286, column: 22, scope: !858)
!870 = !DILocation(line: 287, column: 10, scope: !858)
!871 = !DILocation(line: 288, column: 31, scope: !858)
!872 = !DILocation(line: 288, column: 24, scope: !858)
!873 = !DILocation(line: 288, column: 22, scope: !858)
!874 = !DILocation(line: 289, column: 31, scope: !858)
!875 = !DILocation(line: 289, column: 10, scope: !858)
!876 = !DILocation(line: 290, column: 15, scope: !858)
!877 = !DILocation(line: 290, column: 10, scope: !858)
!878 = !DILocation(line: 295, column: 14, scope: !879)
!879 = distinct !DILexicalBlock(scope: !858, file: !620, line: 295, column: 14)
!880 = !DILocation(line: 295, column: 14, scope: !858)
!881 = !DILocation(line: 296, column: 29, scope: !882)
!882 = distinct !DILexicalBlock(scope: !879, file: !620, line: 295, column: 27)
!883 = !DILocation(line: 296, column: 50, scope: !882)
!884 = !DILocation(line: 296, column: 41, scope: !882)
!885 = !DILocation(line: 296, column: 39, scope: !882)
!886 = !DILocation(line: 296, column: 27, scope: !882)
!887 = !DILocation(line: 297, column: 10, scope: !882)
!888 = !DILocation(line: 298, column: 17, scope: !858)
!889 = !DILocation(line: 298, column: 10, scope: !858)
!890 = !DILocation(line: 299, column: 7, scope: !858)
!891 = !DILocation(line: 308, column: 13, scope: !797)
!892 = !DILocation(line: 314, column: 4, scope: !797)
!893 = !DILocation(line: 320, column: 10, scope: !619)
!894 = !DILocation(line: 320, column: 8, scope: !619)
!895 = !DILocation(line: 321, column: 15, scope: !896)
!896 = distinct !DILexicalBlock(scope: !619, file: !620, line: 321, column: 7)
!897 = !DILocation(line: 321, column: 12, scope: !896)
!898 = !DILocation(line: 321, column: 7, scope: !619)
!899 = !DILocation(line: 322, column: 7, scope: !900)
!900 = distinct !DILexicalBlock(scope: !896, file: !620, line: 321, column: 20)
!901 = !DILocation(line: 323, column: 7, scope: !900)
!902 = !DILocation(line: 326, column: 4, scope: !619)
!903 = !DILocation(line: 326, column: 26, scope: !904)
!904 = !DILexicalBlockFile(scope: !619, file: !620, discriminator: 1)
!905 = !DILocation(line: 326, column: 18, scope: !904)
!906 = !DILocation(line: 326, column: 16, scope: !904)
!907 = !DILocation(line: 326, column: 4, scope: !904)
!908 = !DILocalVariable(name: "fileStat", scope: !909, file: !620, line: 327, type: !910)
!909 = distinct !DILexicalBlock(scope: !619, file: !620, line: 326, column: 33)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !911, line: 46, size: 1152, align: 64, elements: !912)
!911 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!912 = !{!913, !915, !917, !919, !921, !923, !925, !926, !927, !928, !930, !932, !938, !939, !940}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !910, file: !911, line: 48, baseType: !914, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !559, line: 124, baseType: !567)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !910, file: !911, line: 53, baseType: !916, size: 64, align: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !559, line: 127, baseType: !567)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !910, file: !911, line: 61, baseType: !918, size: 64, align: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !559, line: 130, baseType: !567)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !910, file: !911, line: 62, baseType: !920, size: 32, align: 32, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !559, line: 129, baseType: !598)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !910, file: !911, line: 64, baseType: !922, size: 32, align: 32, offset: 224)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !559, line: 125, baseType: !598)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !910, file: !911, line: 65, baseType: !924, size: 32, align: 32, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !559, line: 126, baseType: !598)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !910, file: !911, line: 67, baseType: !565, size: 32, align: 32, offset: 288)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !910, file: !911, line: 69, baseType: !914, size: 64, align: 64, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !910, file: !911, line: 74, baseType: !828, size: 64, align: 64, offset: 384)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !910, file: !911, line: 78, baseType: !929, size: 64, align: 64, offset: 448)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !559, line: 153, baseType: !560)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !910, file: !911, line: 80, baseType: !931, size: 64, align: 64, offset: 512)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !559, line: 158, baseType: !560)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !910, file: !911, line: 91, baseType: !933, size: 128, align: 64, offset: 576)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !557, line: 120, size: 128, align: 64, elements: !934)
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !933, file: !557, line: 122, baseType: !558, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !933, file: !557, line: 123, baseType: !937, size: 64, align: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !559, line: 175, baseType: !560)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !910, file: !911, line: 92, baseType: !933, size: 128, align: 64, offset: 704)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !910, file: !911, line: 93, baseType: !933, size: 128, align: 64, offset: 832)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !910, file: !911, line: 106, baseType: !941, size: 192, align: 64, offset: 960)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 192, align: 64, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 3)
!944 = !DILocation(line: 327, column: 19, scope: !909)
!945 = !DILocalVariable(name: "cmdFilePath", scope: !909, file: !620, line: 328, type: !946)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 8192, align: 8, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 1024)
!949 = !DILocation(line: 328, column: 12, scope: !909)
!950 = !DILocalVariable(name: "statResult", scope: !909, file: !620, line: 329, type: !565)
!951 = !DILocation(line: 329, column: 11, scope: !909)
!952 = !DILocalVariable(name: "numRead", scope: !909, file: !620, line: 330, type: !565)
!953 = !DILocation(line: 330, column: 11, scope: !909)
!954 = !DILocalVariable(name: "cmdFd", scope: !909, file: !620, line: 331, type: !565)
!955 = !DILocation(line: 331, column: 11, scope: !909)
!956 = !DILocalVariable(name: "replaceLoop", scope: !909, file: !620, line: 332, type: !565)
!957 = !DILocation(line: 332, column: 11, scope: !909)
!958 = !DILocalVariable(name: "pwd", scope: !909, file: !620, line: 333, type: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !961, line: 49, size: 384, align: 64, elements: !962)
!961 = !DIFile(filename: "/usr/include/pwd.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!962 = !{!963, !964, !965, !966, !967, !968, !969}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !960, file: !961, line: 51, baseType: !562, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !960, file: !961, line: 52, baseType: !562, size: 64, align: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !960, file: !961, line: 53, baseType: !922, size: 32, align: 32, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !960, file: !961, line: 54, baseType: !924, size: 32, align: 32, offset: 160)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !960, file: !961, line: 55, baseType: !562, size: 64, align: 64, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !960, file: !961, line: 56, baseType: !562, size: 64, align: 64, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !960, file: !961, line: 57, baseType: !562, size: 64, align: 64, offset: 320)
!970 = !DILocation(line: 333, column: 22, scope: !909)
!971 = !DILocalVariable(name: "cmdLineTemp", scope: !909, file: !620, line: 334, type: !562)
!972 = !DILocation(line: 334, column: 13, scope: !909)
!973 = !DILocalVariable(name: "cmdStatTemp", scope: !909, file: !620, line: 335, type: !562)
!974 = !DILocation(line: 335, column: 13, scope: !909)
!975 = !DILocalVariable(name: "strLen", scope: !909, file: !620, line: 336, type: !592)
!976 = !DILocation(line: 336, column: 14, scope: !909)
!977 = !DILocalVariable(name: "dummy", scope: !909, file: !620, line: 337, type: !561)
!978 = !DILocation(line: 337, column: 26, scope: !909)
!979 = !DILocalVariable(name: "relativeStartTime", scope: !909, file: !620, line: 338, type: !561)
!980 = !DILocation(line: 338, column: 26, scope: !909)
!981 = !DILocalVariable(name: "stringBegin", scope: !909, file: !620, line: 339, type: !562)
!982 = !DILocation(line: 339, column: 13, scope: !909)
!983 = !DILocalVariable(name: "cmdNameBegin", scope: !909, file: !620, line: 340, type: !562)
!984 = !DILocation(line: 340, column: 13, scope: !909)
!985 = !DILocalVariable(name: "cmdNameLookup", scope: !909, file: !620, line: 341, type: !755)
!986 = !DILocation(line: 341, column: 12, scope: !909)
!987 = !DILocation(line: 346, column: 18, scope: !988)
!988 = distinct !DILexicalBlock(scope: !909, file: !620, line: 346, column: 11)
!989 = !DILocation(line: 346, column: 23, scope: !988)
!990 = !DILocation(line: 346, column: 11, scope: !988)
!991 = !DILocation(line: 346, column: 55, scope: !988)
!992 = !DILocation(line: 346, column: 60, scope: !988)
!993 = !DILocation(line: 346, column: 48, scope: !994)
!994 = !DILexicalBlockFile(scope: !988, file: !620, discriminator: 1)
!995 = !DILocation(line: 346, column: 45, scope: !988)
!996 = !DILocation(line: 346, column: 11, scope: !909)
!997 = !DILocation(line: 347, column: 10, scope: !998)
!998 = distinct !DILexicalBlock(scope: !988, file: !620, line: 346, column: 69)
!999 = distinct !{!999, !902}
!1000 = !DILocation(line: 350, column: 20, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !909, file: !620, line: 350, column: 11)
!1002 = !DILocation(line: 353, column: 20, scope: !1001)
!1003 = !DILocation(line: 353, column: 25, scope: !1001)
!1004 = !DILocation(line: 350, column: 11, scope: !1001)
!1005 = !DILocation(line: 353, column: 33, scope: !1001)
!1006 = !DILocation(line: 350, column: 11, scope: !909)
!1007 = !DILocation(line: 354, column: 43, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1001, file: !620, line: 353, column: 40)
!1009 = !DILocation(line: 354, column: 48, scope: !1008)
!1010 = !DILocation(line: 354, column: 10, scope: !1008)
!1011 = !DILocation(line: 355, column: 10, scope: !1008)
!1012 = !DILocation(line: 358, column: 20, scope: !909)
!1013 = !DILocation(line: 358, column: 15, scope: !909)
!1014 = !DILocation(line: 358, column: 13, scope: !909)
!1015 = !DILocation(line: 359, column: 17, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !909, file: !620, line: 359, column: 11)
!1017 = !DILocation(line: 359, column: 14, scope: !1016)
!1018 = !DILocation(line: 359, column: 11, scope: !909)
!1019 = !DILocation(line: 364, column: 10, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1016, file: !620, line: 359, column: 24)
!1021 = !DILocation(line: 380, column: 38, scope: !909)
!1022 = !DILocation(line: 380, column: 17, scope: !909)
!1023 = !DILocation(line: 380, column: 15, scope: !909)
!1024 = !DILocation(line: 381, column: 13, scope: !909)
!1025 = !DILocation(line: 381, column: 7, scope: !909)
!1026 = !DILocation(line: 383, column: 11, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !909, file: !620, line: 383, column: 11)
!1028 = !DILocation(line: 383, column: 19, scope: !1027)
!1029 = !DILocation(line: 383, column: 11, scope: !909)
!1030 = !DILocation(line: 384, column: 10, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1027, file: !620, line: 383, column: 24)
!1032 = !DILocation(line: 387, column: 11, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !909, file: !620, line: 387, column: 11)
!1034 = !DILocation(line: 387, column: 19, scope: !1033)
!1035 = !DILocation(line: 387, column: 11, scope: !909)
!1036 = !DILocation(line: 391, column: 27, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !620, line: 391, column: 10)
!1038 = distinct !DILexicalBlock(scope: !1033, file: !620, line: 387, column: 24)
!1039 = !DILocation(line: 391, column: 15, scope: !1037)
!1040 = !DILocation(line: 391, column: 33, scope: !1041)
!1041 = !DILexicalBlockFile(scope: !1042, file: !620, discriminator: 1)
!1042 = distinct !DILexicalBlock(scope: !1037, file: !620, line: 391, column: 10)
!1043 = !DILocation(line: 391, column: 48, scope: !1041)
!1044 = !DILocation(line: 391, column: 56, scope: !1041)
!1045 = !DILocation(line: 391, column: 45, scope: !1041)
!1046 = !DILocation(line: 391, column: 10, scope: !1041)
!1047 = !DILocation(line: 392, column: 37, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !620, line: 392, column: 17)
!1049 = distinct !DILexicalBlock(scope: !1042, file: !620, line: 391, column: 78)
!1050 = !DILocation(line: 392, column: 25, scope: !1048)
!1051 = !DILocation(line: 392, column: 22, scope: !1048)
!1052 = !DILocation(line: 392, column: 17, scope: !1049)
!1053 = !DILocation(line: 393, column: 20, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1055, file: !620, line: 393, column: 20)
!1055 = distinct !DILexicalBlock(scope: !1048, file: !620, line: 392, column: 51)
!1056 = !DILocation(line: 393, column: 20, scope: !1055)
!1057 = !DILocation(line: 399, column: 42, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1054, file: !620, line: 393, column: 35)
!1059 = !DILocation(line: 399, column: 34, scope: !1058)
!1060 = !DILocation(line: 399, column: 32, scope: !1058)
!1061 = !DILocation(line: 400, column: 30, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1058, file: !620, line: 400, column: 22)
!1063 = !DILocation(line: 400, column: 27, scope: !1062)
!1064 = !DILocation(line: 400, column: 22, scope: !1058)
!1065 = !DILocation(line: 401, column: 37, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1062, file: !620, line: 400, column: 44)
!1067 = !DILocation(line: 401, column: 35, scope: !1066)
!1068 = !DILocation(line: 402, column: 19, scope: !1066)
!1069 = !DILocation(line: 406, column: 34, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1062, file: !620, line: 402, column: 26)
!1071 = !DILocation(line: 408, column: 56, scope: !1058)
!1072 = !DILocation(line: 408, column: 42, scope: !1058)
!1073 = !DILocation(line: 408, column: 28, scope: !1058)
!1074 = !DILocation(line: 408, column: 40, scope: !1058)
!1075 = !DILocation(line: 409, column: 33, scope: !1058)
!1076 = !DILocation(line: 410, column: 16, scope: !1058)
!1077 = !DILocation(line: 411, column: 28, scope: !1055)
!1078 = !DILocation(line: 411, column: 16, scope: !1055)
!1079 = !DILocation(line: 411, column: 41, scope: !1055)
!1080 = !DILocation(line: 412, column: 13, scope: !1055)
!1081 = !DILocation(line: 413, column: 10, scope: !1049)
!1082 = !DILocation(line: 391, column: 74, scope: !1083)
!1083 = !DILexicalBlockFile(scope: !1042, file: !620, discriminator: 2)
!1084 = !DILocation(line: 391, column: 10, scope: !1083)
!1085 = distinct !{!1085, !1086}
!1086 = !DILocation(line: 391, column: 10, scope: !1038)
!1087 = !DILocation(line: 414, column: 7, scope: !1038)
!1088 = !DILocation(line: 421, column: 16, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1033, file: !620, line: 414, column: 14)
!1090 = !DILocation(line: 422, column: 18, scope: !1089)
!1091 = !DILocation(line: 424, column: 23, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1089, file: !620, line: 424, column: 14)
!1093 = !DILocation(line: 427, column: 23, scope: !1092)
!1094 = !DILocation(line: 427, column: 28, scope: !1092)
!1095 = !DILocation(line: 424, column: 14, scope: !1092)
!1096 = !DILocation(line: 427, column: 36, scope: !1092)
!1097 = !DILocation(line: 424, column: 14, scope: !1089)
!1098 = !DILocation(line: 428, column: 26, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1092, file: !620, line: 427, column: 43)
!1100 = !DILocation(line: 428, column: 21, scope: !1099)
!1101 = !DILocation(line: 428, column: 19, scope: !1099)
!1102 = !DILocation(line: 429, column: 10, scope: !1099)
!1103 = !DILocation(line: 430, column: 14, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1089, file: !620, line: 430, column: 14)
!1105 = !DILocation(line: 430, column: 20, scope: !1104)
!1106 = !DILocation(line: 430, column: 14, scope: !1089)
!1107 = !DILocation(line: 431, column: 44, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1104, file: !620, line: 430, column: 27)
!1109 = !DILocation(line: 431, column: 23, scope: !1108)
!1110 = !DILocation(line: 431, column: 21, scope: !1108)
!1111 = !DILocation(line: 432, column: 19, scope: !1108)
!1112 = !DILocation(line: 432, column: 13, scope: !1108)
!1113 = !DILocation(line: 433, column: 10, scope: !1108)
!1114 = !DILocation(line: 434, column: 14, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1089, file: !620, line: 434, column: 14)
!1116 = !DILocation(line: 434, column: 22, scope: !1115)
!1117 = !DILocation(line: 434, column: 14, scope: !1089)
!1118 = !DILocalVariable(name: "nameStart", scope: !1119, file: !620, line: 443, type: !636)
!1119 = distinct !DILexicalBlock(scope: !1115, file: !620, line: 434, column: 27)
!1120 = !DILocation(line: 443, column: 25, scope: !1119)
!1121 = !DILocalVariable(name: "copyItr", scope: !1119, file: !620, line: 444, type: !562)
!1122 = !DILocation(line: 444, column: 19, scope: !1119)
!1123 = !DILocation(line: 447, column: 30, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1119, file: !620, line: 447, column: 13)
!1125 = !DILocation(line: 447, column: 28, scope: !1124)
!1126 = !DILocation(line: 447, column: 18, scope: !1124)
!1127 = !DILocation(line: 447, column: 44, scope: !1128)
!1128 = !DILexicalBlockFile(scope: !1129, file: !620, discriminator: 1)
!1129 = distinct !DILexicalBlock(scope: !1124, file: !620, line: 447, column: 13)
!1130 = !DILocation(line: 447, column: 43, scope: !1128)
!1131 = !DILocation(line: 447, column: 54, scope: !1128)
!1132 = !DILocation(line: 448, column: 44, scope: !1129)
!1133 = !DILocation(line: 448, column: 43, scope: !1129)
!1134 = !DILocation(line: 448, column: 54, scope: !1129)
!1135 = !DILocation(line: 448, column: 61, scope: !1129)
!1136 = !DILocation(line: 449, column: 44, scope: !1129)
!1137 = !DILocation(line: 449, column: 43, scope: !1129)
!1138 = !DILocation(line: 449, column: 54, scope: !1129)
!1139 = !DILocation(line: 449, column: 62, scope: !1129)
!1140 = !DILocation(line: 450, column: 44, scope: !1129)
!1141 = !DILocation(line: 450, column: 43, scope: !1129)
!1142 = !DILocation(line: 450, column: 54, scope: !1129)
!1143 = !DILocation(line: 447, column: 13, scope: !1144)
!1144 = !DILexicalBlockFile(scope: !1124, file: !620, discriminator: 2)
!1145 = !DILocation(line: 447, column: 13, scope: !1146)
!1146 = !DILexicalBlockFile(scope: !1124, file: !620, discriminator: 3)
!1147 = !DILocation(line: 450, column: 63, scope: !1128)
!1148 = !DILocation(line: 447, column: 13, scope: !1149)
!1149 = !DILexicalBlockFile(scope: !1129, file: !620, discriminator: 4)
!1150 = distinct !{!1150, !1151}
!1151 = !DILocation(line: 447, column: 13, scope: !1119)
!1152 = !DILocation(line: 452, column: 13, scope: !1119)
!1153 = !DILocation(line: 452, column: 20, scope: !1154)
!1154 = !DILexicalBlockFile(scope: !1155, file: !620, discriminator: 1)
!1155 = distinct !DILexicalBlock(scope: !1156, file: !620, line: 452, column: 13)
!1156 = distinct !DILexicalBlock(scope: !1119, file: !620, line: 452, column: 13)
!1157 = !DILocation(line: 452, column: 19, scope: !1154)
!1158 = !DILocation(line: 452, column: 30, scope: !1154)
!1159 = !DILocation(line: 453, column: 21, scope: !1155)
!1160 = !DILocation(line: 453, column: 20, scope: !1155)
!1161 = !DILocation(line: 453, column: 31, scope: !1155)
!1162 = !DILocation(line: 453, column: 38, scope: !1155)
!1163 = !DILocation(line: 454, column: 21, scope: !1155)
!1164 = !DILocation(line: 454, column: 20, scope: !1155)
!1165 = !DILocation(line: 454, column: 31, scope: !1155)
!1166 = !DILocation(line: 454, column: 39, scope: !1155)
!1167 = !DILocation(line: 455, column: 21, scope: !1155)
!1168 = !DILocation(line: 455, column: 20, scope: !1155)
!1169 = !DILocation(line: 455, column: 31, scope: !1155)
!1170 = !DILocation(line: 454, column: 39, scope: !1154)
!1171 = !DILocation(line: 452, column: 13, scope: !1172)
!1172 = !DILexicalBlockFile(scope: !1156, file: !620, discriminator: 2)
!1173 = !DILocation(line: 452, column: 13, scope: !1174)
!1174 = !DILexicalBlockFile(scope: !1156, file: !620, discriminator: 3)
!1175 = !DILocation(line: 455, column: 41, scope: !1154)
!1176 = !DILocation(line: 452, column: 13, scope: !1177)
!1177 = !DILexicalBlockFile(scope: !1155, file: !620, discriminator: 4)
!1178 = distinct !{!1178, !1152}
!1179 = !DILocation(line: 457, column: 28, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1119, file: !620, line: 457, column: 13)
!1181 = !DILocation(line: 457, column: 26, scope: !1180)
!1182 = !DILocation(line: 457, column: 18, scope: !1180)
!1183 = !DILocation(line: 457, column: 42, scope: !1184)
!1184 = !DILexicalBlockFile(scope: !1185, file: !620, discriminator: 1)
!1185 = distinct !DILexicalBlock(scope: !1180, file: !620, line: 457, column: 13)
!1186 = !DILocation(line: 457, column: 41, scope: !1184)
!1187 = !DILocation(line: 457, column: 52, scope: !1184)
!1188 = !DILocation(line: 457, column: 56, scope: !1189)
!1189 = !DILexicalBlockFile(scope: !1185, file: !620, discriminator: 2)
!1190 = !DILocation(line: 457, column: 55, scope: !1189)
!1191 = !DILocation(line: 457, column: 66, scope: !1189)
!1192 = !DILocation(line: 457, column: 13, scope: !1193)
!1193 = !DILexicalBlockFile(scope: !1180, file: !620, discriminator: 3)
!1194 = !DILocation(line: 458, column: 42, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1185, file: !620, line: 457, column: 76)
!1196 = !DILocation(line: 458, column: 31, scope: !1195)
!1197 = !DILocation(line: 458, column: 25, scope: !1195)
!1198 = !DILocation(line: 458, column: 29, scope: !1195)
!1199 = !DILocation(line: 457, column: 13, scope: !1200)
!1200 = !DILexicalBlockFile(scope: !1185, file: !620, discriminator: 4)
!1201 = distinct !{!1201, !1202}
!1202 = !DILocation(line: 457, column: 13, scope: !1119)
!1203 = !DILocation(line: 460, column: 14, scope: !1119)
!1204 = !DILocation(line: 460, column: 22, scope: !1119)
!1205 = !DILocation(line: 464, column: 50, scope: !1119)
!1206 = !DILocation(line: 464, column: 36, scope: !1119)
!1207 = !DILocation(line: 464, column: 22, scope: !1119)
!1208 = !DILocation(line: 464, column: 34, scope: !1119)
!1209 = !DILocation(line: 465, column: 10, scope: !1119)
!1210 = !DILocation(line: 472, column: 20, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !909, file: !620, line: 472, column: 11)
!1212 = !DILocation(line: 475, column: 20, scope: !1211)
!1213 = !DILocation(line: 475, column: 25, scope: !1211)
!1214 = !DILocation(line: 472, column: 11, scope: !1211)
!1215 = !DILocation(line: 475, column: 33, scope: !1211)
!1216 = !DILocation(line: 472, column: 11, scope: !909)
!1217 = !DILocation(line: 476, column: 43, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1211, file: !620, line: 475, column: 40)
!1219 = !DILocation(line: 476, column: 48, scope: !1218)
!1220 = !DILocation(line: 476, column: 10, scope: !1218)
!1221 = !DILocation(line: 477, column: 10, scope: !1218)
!1222 = !DILocation(line: 485, column: 25, scope: !909)
!1223 = !DILocation(line: 485, column: 20, scope: !909)
!1224 = !DILocation(line: 485, column: 18, scope: !909)
!1225 = !DILocation(line: 486, column: 16, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !909, file: !620, line: 486, column: 11)
!1227 = !DILocation(line: 486, column: 13, scope: !1226)
!1228 = !DILocation(line: 486, column: 11, scope: !909)
!1229 = !DILocation(line: 487, column: 10, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1226, file: !620, line: 486, column: 28)
!1231 = !DILocation(line: 494, column: 20, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !909, file: !620, line: 494, column: 11)
!1233 = !DILocation(line: 497, column: 20, scope: !1232)
!1234 = !DILocation(line: 497, column: 25, scope: !1232)
!1235 = !DILocation(line: 494, column: 11, scope: !1232)
!1236 = !DILocation(line: 497, column: 33, scope: !1232)
!1237 = !DILocation(line: 494, column: 11, scope: !909)
!1238 = !DILocation(line: 498, column: 43, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1232, file: !620, line: 497, column: 40)
!1240 = !DILocation(line: 498, column: 48, scope: !1239)
!1241 = !DILocation(line: 498, column: 10, scope: !1239)
!1242 = !DILocation(line: 499, column: 10, scope: !1239)
!1243 = !DILocation(line: 501, column: 20, scope: !909)
!1244 = !DILocation(line: 501, column: 15, scope: !909)
!1245 = !DILocation(line: 501, column: 13, scope: !909)
!1246 = !DILocation(line: 502, column: 17, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !909, file: !620, line: 502, column: 11)
!1248 = !DILocation(line: 502, column: 14, scope: !1247)
!1249 = !DILocation(line: 502, column: 11, scope: !909)
!1250 = !DILocation(line: 503, column: 10, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !1247, file: !620, line: 502, column: 24)
!1252 = !DILocation(line: 505, column: 38, scope: !909)
!1253 = !DILocation(line: 505, column: 17, scope: !909)
!1254 = !DILocation(line: 505, column: 15, scope: !909)
!1255 = !DILocation(line: 506, column: 13, scope: !909)
!1256 = !DILocation(line: 506, column: 7, scope: !909)
!1257 = !DILocation(line: 507, column: 16, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !909, file: !620, line: 507, column: 11)
!1259 = !DILocation(line: 507, column: 13, scope: !1258)
!1260 = !DILocation(line: 507, column: 11, scope: !909)
!1261 = !DILocation(line: 508, column: 10, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1258, file: !620, line: 507, column: 25)
!1263 = !DILocation(line: 513, column: 28, scope: !909)
!1264 = !DILocation(line: 513, column: 21, scope: !909)
!1265 = !DILocation(line: 513, column: 46, scope: !909)
!1266 = !DILocation(line: 513, column: 19, scope: !909)
!1267 = !DILocation(line: 515, column: 28, scope: !909)
!1268 = !DILocation(line: 518, column: 28, scope: !909)
!1269 = !DILocation(line: 518, column: 45, scope: !909)
!1270 = !DILocation(line: 518, column: 61, scope: !909)
!1271 = !DILocation(line: 519, column: 28, scope: !909)
!1272 = !DILocation(line: 519, column: 44, scope: !909)
!1273 = !DILocation(line: 519, column: 60, scope: !909)
!1274 = !DILocation(line: 528, column: 28, scope: !909)
!1275 = !DILocation(line: 515, column: 21, scope: !909)
!1276 = !DILocation(line: 515, column: 19, scope: !909)
!1277 = !DILocation(line: 530, column: 17, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !909, file: !620, line: 530, column: 11)
!1279 = !DILocation(line: 530, column: 14, scope: !1278)
!1280 = !DILocation(line: 530, column: 11, scope: !909)
!1281 = !DILocation(line: 531, column: 10, scope: !1282)
!1282 = distinct !DILexicalBlock(scope: !1278, file: !620, line: 530, column: 30)
!1283 = !DILocation(line: 537, column: 11, scope: !1284)
!1284 = distinct !DILexicalBlock(scope: !909, file: !620, line: 537, column: 11)
!1285 = !DILocation(line: 537, column: 11, scope: !909)
!1286 = !DILocation(line: 538, column: 47, scope: !1287)
!1287 = distinct !DILexicalBlock(scope: !1284, file: !620, line: 537, column: 24)
!1288 = !DILocation(line: 538, column: 33, scope: !1287)
!1289 = !DILocation(line: 538, column: 19, scope: !1287)
!1290 = !DILocation(line: 538, column: 31, scope: !1287)
!1291 = !DILocation(line: 539, column: 7, scope: !1287)
!1292 = !DILocation(line: 540, column: 33, scope: !1293)
!1293 = distinct !DILexicalBlock(scope: !1284, file: !620, line: 539, column: 14)
!1294 = !DILocation(line: 540, column: 19, scope: !1293)
!1295 = !DILocation(line: 540, column: 31, scope: !1293)
!1296 = !DILocation(line: 546, column: 38, scope: !909)
!1297 = !DILocation(line: 546, column: 43, scope: !909)
!1298 = !DILocation(line: 546, column: 33, scope: !909)
!1299 = !DILocation(line: 546, column: 16, scope: !909)
!1300 = !DILocation(line: 546, column: 23, scope: !909)
!1301 = !DILocation(line: 551, column: 31, scope: !909)
!1302 = !DILocation(line: 551, column: 13, scope: !909)
!1303 = !DILocation(line: 551, column: 11, scope: !909)
!1304 = !DILocation(line: 552, column: 36, scope: !909)
!1305 = !DILocation(line: 552, column: 33, scope: !909)
!1306 = !DILocation(line: 552, column: 28, scope: !909)
!1307 = !DILocation(line: 553, column: 77, scope: !909)
!1308 = !DILocation(line: 553, column: 30, scope: !909)
!1309 = !DILocation(line: 552, column: 28, scope: !1310)
!1310 = !DILexicalBlockFile(scope: !909, file: !620, discriminator: 1)
!1311 = !DILocation(line: 554, column: 44, scope: !909)
!1312 = !DILocation(line: 554, column: 49, scope: !909)
!1313 = !DILocation(line: 554, column: 30, scope: !909)
!1314 = !DILocation(line: 552, column: 28, scope: !1315)
!1315 = !DILexicalBlockFile(scope: !909, file: !620, discriminator: 2)
!1316 = !DILocation(line: 552, column: 28, scope: !1317)
!1317 = !DILexicalBlockFile(scope: !909, file: !620, discriminator: 3)
!1318 = !DILocation(line: 552, column: 16, scope: !1317)
!1319 = !DILocation(line: 552, column: 26, scope: !1317)
!1320 = !DILocation(line: 559, column: 32, scope: !909)
!1321 = !DILocation(line: 559, column: 49, scope: !909)
!1322 = !DILocation(line: 559, column: 69, scope: !909)
!1323 = !DILocation(line: 559, column: 67, scope: !909)
!1324 = !DILocation(line: 559, column: 46, scope: !909)
!1325 = !DILocation(line: 559, column: 16, scope: !909)
!1326 = !DILocation(line: 559, column: 30, scope: !909)
!1327 = !DILocation(line: 564, column: 38, scope: !1328)
!1328 = distinct !DILexicalBlock(scope: !909, file: !620, line: 564, column: 11)
!1329 = !DILocation(line: 564, column: 12, scope: !1328)
!1330 = !DILocation(line: 564, column: 11, scope: !909)
!1331 = !DILocation(line: 565, column: 10, scope: !1332)
!1332 = distinct !DILexicalBlock(scope: !1328, file: !620, line: 564, column: 59)
!1333 = !DILocation(line: 567, column: 10, scope: !1332)
!1334 = !DILocation(line: 569, column: 16, scope: !909)
!1335 = !DILocation(line: 569, column: 28, scope: !909)
!1336 = !DILocation(line: 570, column: 16, scope: !909)
!1337 = !DILocation(line: 570, column: 28, scope: !909)
!1338 = !DILocation(line: 571, column: 16, scope: !909)
!1339 = !DILocation(line: 571, column: 26, scope: !909)
!1340 = !DILocation(line: 571, column: 7, scope: !909)
!1341 = !DILocation(line: 574, column: 12, scope: !909)
!1342 = !DILocation(line: 574, column: 7, scope: !909)
!1343 = !DILocation(line: 575, column: 12, scope: !909)
!1344 = !DILocation(line: 575, column: 7, scope: !909)
!1345 = !DILocation(line: 326, column: 4, scope: !1346)
!1346 = !DILexicalBlockFile(scope: !619, file: !620, discriminator: 2)
!1347 = !DILocation(line: 578, column: 39, scope: !1348)
!1348 = distinct !DILexicalBlock(scope: !619, file: !620, line: 578, column: 8)
!1349 = !DILocation(line: 578, column: 12, scope: !1348)
!1350 = !DILocation(line: 578, column: 10, scope: !1348)
!1351 = !DILocation(line: 578, column: 8, scope: !619)
!1352 = !DILocation(line: 579, column: 14, scope: !1353)
!1353 = distinct !DILexicalBlock(scope: !1348, file: !620, line: 578, column: 50)
!1354 = !DILocation(line: 580, column: 4, scope: !1353)
!1355 = !DILocation(line: 578, column: 47, scope: !1356)
!1356 = !DILexicalBlockFile(scope: !1348, file: !620, discriminator: 1)
!1357 = !DILocation(line: 583, column: 13, scope: !619)
!1358 = !DILocation(line: 583, column: 4, scope: !619)
!1359 = !DILocation(line: 585, column: 18, scope: !619)
!1360 = !DILocation(line: 585, column: 4, scope: !619)
!1361 = !DILocation(line: 586, column: 18, scope: !619)
!1362 = !DILocation(line: 586, column: 4, scope: !619)
!1363 = !DILocation(line: 587, column: 18, scope: !619)
!1364 = !DILocation(line: 587, column: 4, scope: !619)
!1365 = !DILocation(line: 589, column: 8, scope: !1366)
!1366 = distinct !DILexicalBlock(scope: !619, file: !620, line: 589, column: 8)
!1367 = !DILocation(line: 589, column: 8, scope: !619)
!1368 = !DILocation(line: 590, column: 28, scope: !1369)
!1369 = distinct !DILexicalBlock(scope: !1366, file: !620, line: 589, column: 16)
!1370 = !DILocation(line: 590, column: 7, scope: !1369)
!1371 = !DILocation(line: 591, column: 16, scope: !1369)
!1372 = !DILocation(line: 592, column: 4, scope: !1369)
!1373 = !DILocation(line: 594, column: 11, scope: !619)
!1374 = !DILocation(line: 594, column: 4, scope: !619)
!1375 = distinct !DISubprogram(name: "ProcMgrProcInfoArray_Init", scope: !601, file: !601, line: 67, type: !1376, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !625)
!1376 = !DISubroutineType(types: !1377)
!1377 = !{!755, !623, !598}
!1378 = !DILocalVariable(name: "a", arg: 1, scope: !1375, file: !601, line: 67, type: !623)
!1379 = !DILocation(line: 67, column: 201, scope: !1375)
!1380 = !DILocalVariable(name: "count", arg: 2, scope: !1375, file: !601, line: 67, type: !598)
!1381 = !DILocation(line: 67, column: 217, scope: !1375)
!1382 = !DILocation(line: 67, column: 259, scope: !1375)
!1383 = !DILocation(line: 67, column: 262, scope: !1375)
!1384 = !DILocation(line: 67, column: 233, scope: !1375)
!1385 = !DILocation(line: 67, column: 226, scope: !1375)
!1386 = distinct !DISubprogram(name: "Unicode_Alloc", scope: !1387, file: !1387, line: 111, type: !1388, isLocal: true, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !625)
!1387 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/unicodeBase.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!1388 = !DISubroutineType(types: !1389)
!1389 = !{!562, !1390, !1392}
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringEncoding", file: !4, line: 445, baseType: !3)
!1393 = !DILocalVariable(name: "buffer", arg: 1, scope: !1386, file: !1387, line: 111, type: !1390)
!1394 = !DILocation(line: 111, column: 27, scope: !1386)
!1395 = !DILocalVariable(name: "encoding", arg: 2, scope: !1386, file: !1387, line: 112, type: !1392)
!1396 = !DILocation(line: 112, column: 30, scope: !1386)
!1397 = !DILocation(line: 114, column: 35, scope: !1386)
!1398 = !DILocation(line: 114, column: 47, scope: !1386)
!1399 = !DILocation(line: 114, column: 11, scope: !1386)
!1400 = !DILocation(line: 114, column: 4, scope: !1386)
!1401 = distinct !DISubprogram(name: "ProcMgrProcInfoArray_Push", scope: !601, file: !601, line: 67, type: !1402, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !625)
!1402 = !DISubroutineType(types: !1403)
!1403 = !{!755, !623, !600}
!1404 = !DILocalVariable(name: "a", arg: 1, scope: !1401, file: !601, line: 67, type: !623)
!1405 = !DILocation(line: 67, column: 1097, scope: !1401)
!1406 = !DILocalVariable(name: "val", arg: 2, scope: !1401, file: !601, line: 67, type: !600)
!1407 = !DILocation(line: 67, column: 1116, scope: !1401)
!1408 = !DILocalVariable(name: "count", scope: !1401, file: !601, line: 67, type: !598)
!1409 = !DILocation(line: 67, column: 1136, scope: !1401)
!1410 = !DILocation(line: 67, column: 1171, scope: !1401)
!1411 = !DILocation(line: 67, column: 1144, scope: !1401)
!1412 = !DILocation(line: 67, column: 1210, scope: !1413)
!1413 = distinct !DILexicalBlock(scope: !1401, file: !601, line: 67, column: 1179)
!1414 = !DILocation(line: 67, column: 1213, scope: !1413)
!1415 = !DILocation(line: 67, column: 1219, scope: !1413)
!1416 = !DILocation(line: 67, column: 1180, scope: !1417)
!1417 = !DILexicalBlockFile(scope: !1413, file: !601, discriminator: 4)
!1418 = !DILocation(line: 67, column: 1180, scope: !1413)
!1419 = !DILocation(line: 67, column: 1179, scope: !1401)
!1420 = !DILocation(line: 67, column: 1227, scope: !1421)
!1421 = !DILexicalBlockFile(scope: !1422, file: !601, discriminator: 1)
!1422 = distinct !DILexicalBlock(scope: !1413, file: !601, line: 67, column: 1225)
!1423 = !DILocation(line: 67, column: 1271, scope: !1424)
!1424 = !DILexicalBlockFile(scope: !1401, file: !601, discriminator: 2)
!1425 = !DILocation(line: 67, column: 1274, scope: !1424)
!1426 = !DILocation(line: 67, column: 1240, scope: !1424)
!1427 = !DILocation(line: 67, column: 1283, scope: !1424)
!1428 = !DILocation(line: 67, column: 1283, scope: !1429)
!1429 = !DILexicalBlockFile(scope: !1424, file: !601, discriminator: 5)
!1430 = !DILocation(line: 67, column: 1288, scope: !1424)
!1431 = !DILocation(line: 67, column: 1298, scope: !1432)
!1432 = !DILexicalBlockFile(scope: !1401, file: !601, discriminator: 3)
!1433 = distinct !DISubprogram(name: "ProcMgrProcInfoArray_Count", scope: !601, file: !601, line: 67, type: !1434, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !625)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{!598, !1436}
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!1438 = !DILocalVariable(name: "a", arg: 1, scope: !1433, file: !601, line: 67, type: !1436)
!1439 = !DILocation(line: 67, column: 841, scope: !1433)
!1440 = !DILocation(line: 67, column: 886, scope: !1433)
!1441 = !DILocation(line: 67, column: 853, scope: !1433)
!1442 = !DILocation(line: 67, column: 846, scope: !1433)
!1443 = distinct !DISubprogram(name: "ProcMgr_FreeProcList", scope: !620, file: !620, line: 1177, type: !1444, isLocal: false, isDefinition: true, scopeLine: 1178, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !625)
!1444 = !DISubroutineType(types: !1445)
!1445 = !{null, !623}
!1446 = !DILocalVariable(name: "procList", arg: 1, scope: !1443, file: !620, line: 1177, type: !623)
!1447 = !DILocation(line: 1177, column: 44, scope: !1443)
!1448 = !DILocalVariable(name: "i", scope: !1443, file: !620, line: 1179, type: !565)
!1449 = !DILocation(line: 1179, column: 8, scope: !1443)
!1450 = !DILocalVariable(name: "procCount", scope: !1443, file: !620, line: 1180, type: !592)
!1451 = !DILocation(line: 1180, column: 11, scope: !1443)
!1452 = !DILocation(line: 1182, column: 15, scope: !1453)
!1453 = distinct !DILexicalBlock(scope: !1443, file: !620, line: 1182, column: 7)
!1454 = !DILocation(line: 1182, column: 12, scope: !1453)
!1455 = !DILocation(line: 1182, column: 7, scope: !1443)
!1456 = !DILocation(line: 1183, column: 7, scope: !1457)
!1457 = distinct !DILexicalBlock(scope: !1453, file: !620, line: 1182, column: 25)
!1458 = !DILocation(line: 1186, column: 43, scope: !1443)
!1459 = !DILocation(line: 1186, column: 16, scope: !1443)
!1460 = !DILocation(line: 1186, column: 14, scope: !1443)
!1461 = !DILocation(line: 1187, column: 11, scope: !1462)
!1462 = distinct !DILexicalBlock(scope: !1443, file: !620, line: 1187, column: 4)
!1463 = !DILocation(line: 1187, column: 9, scope: !1462)
!1464 = !DILocation(line: 1187, column: 16, scope: !1465)
!1465 = !DILexicalBlockFile(scope: !1466, file: !620, discriminator: 1)
!1466 = distinct !DILexicalBlock(scope: !1462, file: !620, line: 1187, column: 4)
!1467 = !DILocation(line: 1187, column: 20, scope: !1465)
!1468 = !DILocation(line: 1187, column: 18, scope: !1465)
!1469 = !DILocation(line: 1187, column: 4, scope: !1465)
!1470 = !DILocalVariable(name: "procInfo", scope: !1471, file: !620, line: 1188, type: !599)
!1471 = distinct !DILexicalBlock(scope: !1466, file: !620, line: 1187, column: 36)
!1472 = !DILocation(line: 1188, column: 24, scope: !1471)
!1473 = !DILocation(line: 1188, column: 66, scope: !1471)
!1474 = !DILocation(line: 1188, column: 76, scope: !1471)
!1475 = !DILocation(line: 1188, column: 35, scope: !1471)
!1476 = !DILocation(line: 1189, column: 12, scope: !1471)
!1477 = !DILocation(line: 1189, column: 22, scope: !1471)
!1478 = !DILocation(line: 1189, column: 7, scope: !1471)
!1479 = !DILocation(line: 1190, column: 12, scope: !1471)
!1480 = !DILocation(line: 1190, column: 22, scope: !1471)
!1481 = !DILocation(line: 1190, column: 7, scope: !1471)
!1482 = !DILocation(line: 1191, column: 12, scope: !1471)
!1483 = !DILocation(line: 1191, column: 22, scope: !1471)
!1484 = !DILocation(line: 1191, column: 7, scope: !1471)
!1485 = !DILocation(line: 1192, column: 4, scope: !1471)
!1486 = !DILocation(line: 1187, column: 32, scope: !1487)
!1487 = !DILexicalBlockFile(scope: !1466, file: !620, discriminator: 2)
!1488 = !DILocation(line: 1187, column: 4, scope: !1487)
!1489 = distinct !{!1489, !1490}
!1490 = !DILocation(line: 1187, column: 4, scope: !1443)
!1491 = !DILocation(line: 1194, column: 33, scope: !1443)
!1492 = !DILocation(line: 1194, column: 4, scope: !1443)
!1493 = !DILocation(line: 1195, column: 9, scope: !1443)
!1494 = !DILocation(line: 1195, column: 4, scope: !1443)
!1495 = !DILocation(line: 1196, column: 1, scope: !1443)
!1496 = !DILocation(line: 1196, column: 1, scope: !1497)
!1497 = !DILexicalBlockFile(scope: !1443, file: !620, discriminator: 1)
!1498 = distinct !DISubprogram(name: "ProcMgrProcInfoArray_AddressOf", scope: !601, file: !601, line: 67, type: !1499, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !625)
!1499 = !DISubroutineType(types: !1500)
!1500 = !{!599, !623, !598}
!1501 = !DILocalVariable(name: "a", arg: 1, scope: !1498, file: !601, line: 67, type: !623)
!1502 = !DILocation(line: 67, column: 491, scope: !1498)
!1503 = !DILocalVariable(name: "i", arg: 2, scope: !1498, file: !601, line: 67, type: !598)
!1504 = !DILocation(line: 67, column: 507, scope: !1498)
!1505 = !DILocation(line: 67, column: 568, scope: !1498)
!1506 = !DILocation(line: 67, column: 571, scope: !1498)
!1507 = !DILocation(line: 67, column: 537, scope: !1498)
!1508 = !DILocation(line: 67, column: 519, scope: !1498)
!1509 = !DILocation(line: 67, column: 512, scope: !1498)
!1510 = distinct !DISubprogram(name: "ProcMgrProcInfoArray_Destroy", scope: !601, file: !601, line: 67, type: !1444, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !625)
!1511 = !DILocalVariable(name: "a", arg: 1, scope: !1510, file: !601, line: 67, type: !623)
!1512 = !DILocation(line: 67, column: 367, scope: !1510)
!1513 = !DILocation(line: 67, column: 401, scope: !1510)
!1514 = !DILocation(line: 67, column: 372, scope: !1510)
!1515 = !DILocation(line: 67, column: 405, scope: !1510)
!1516 = distinct !DISubprogram(name: "ProcMgr_ExecSync", scope: !620, file: !620, line: 1272, type: !1517, isLocal: false, isDefinition: true, scopeLine: 1274, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !625)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{!755, !636, !1519}
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProcMgr_ProcArgs", file: !601, line: 123, baseType: !1521)
!1521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ProcMgr_ProcArgs", file: !601, line: 70, size: 128, align: 64, elements: !1522)
!1522 = !{!1523, !1524}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !1521, file: !601, line: 115, baseType: !653, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "workingDirectory", scope: !1521, file: !601, line: 121, baseType: !562, size: 64, align: 64, offset: 64)
!1525 = !DILocalVariable(name: "cmd", arg: 1, scope: !1516, file: !620, line: 1272, type: !636)
!1526 = !DILocation(line: 1272, column: 30, scope: !1516)
!1527 = !DILocalVariable(name: "userArgs", arg: 2, scope: !1516, file: !620, line: 1273, type: !1519)
!1528 = !DILocation(line: 1273, column: 36, scope: !1516)
!1529 = !DILocation(line: 1275, column: 27, scope: !1516)
!1530 = !DILocation(line: 1275, column: 32, scope: !1516)
!1531 = !DILocation(line: 1275, column: 11, scope: !1516)
!1532 = !DILocation(line: 1275, column: 4, scope: !1516)
!1533 = distinct !DISubprogram(name: "ProcMgrExecSync", scope: !620, file: !620, line: 1230, type: !1534, isLocal: true, isDefinition: true, scopeLine: 1234, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !625)
!1534 = !DISubroutineType(types: !1535)
!1535 = !{!755, !636, !1519, !1536, !564}
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64, align: 64)
!1537 = !DILocalVariable(name: "cmd", arg: 1, scope: !1533, file: !620, line: 1230, type: !636)
!1538 = !DILocation(line: 1230, column: 29, scope: !1533)
!1539 = !DILocalVariable(name: "userArgs", arg: 2, scope: !1533, file: !620, line: 1231, type: !1519)
!1540 = !DILocation(line: 1231, column: 35, scope: !1533)
!1541 = !DILocalVariable(name: "validExitCode", arg: 3, scope: !1533, file: !620, line: 1232, type: !1536)
!1542 = !DILocation(line: 1232, column: 23, scope: !1533)
!1543 = !DILocalVariable(name: "exitCode", arg: 4, scope: !1533, file: !620, line: 1233, type: !564)
!1544 = !DILocation(line: 1233, column: 22, scope: !1533)
!1545 = !DILocalVariable(name: "pid", scope: !1533, file: !620, line: 1235, type: !570)
!1546 = !DILocation(line: 1235, column: 10, scope: !1533)
!1547 = !DILocation(line: 1237, column: 42, scope: !1533)
!1548 = !DILocation(line: 1237, column: 4, scope: !1533)
!1549 = !DILocation(line: 1239, column: 8, scope: !1550)
!1550 = distinct !DILexicalBlock(scope: !1533, file: !620, line: 1239, column: 8)
!1551 = !DILocation(line: 1239, column: 22, scope: !1550)
!1552 = !DILocation(line: 1239, column: 8, scope: !1533)
!1553 = !DILocation(line: 1240, column: 8, scope: !1554)
!1554 = distinct !DILexicalBlock(scope: !1550, file: !620, line: 1239, column: 30)
!1555 = !DILocation(line: 1240, column: 22, scope: !1554)
!1556 = !DILocation(line: 1241, column: 4, scope: !1554)
!1557 = !DILocation(line: 1243, column: 30, scope: !1533)
!1558 = !DILocation(line: 1243, column: 35, scope: !1533)
!1559 = !DILocation(line: 1243, column: 46, scope: !1560)
!1560 = !DILexicalBlockFile(scope: !1533, file: !620, discriminator: 1)
!1561 = !DILocation(line: 1243, column: 56, scope: !1560)
!1562 = !DILocation(line: 1243, column: 35, scope: !1560)
!1563 = !DILocation(line: 1243, column: 35, scope: !1564)
!1564 = !DILexicalBlockFile(scope: !1533, file: !620, discriminator: 2)
!1565 = !DILocation(line: 1243, column: 35, scope: !1566)
!1566 = !DILexicalBlockFile(scope: !1533, file: !620, discriminator: 3)
!1567 = !DILocation(line: 1244, column: 30, scope: !1533)
!1568 = !DILocation(line: 1244, column: 41, scope: !1560)
!1569 = !DILocation(line: 1244, column: 51, scope: !1560)
!1570 = !DILocation(line: 1244, column: 30, scope: !1560)
!1571 = !DILocation(line: 1244, column: 30, scope: !1564)
!1572 = !DILocation(line: 1244, column: 30, scope: !1566)
!1573 = !DILocation(line: 1243, column: 10, scope: !1574)
!1574 = !DILexicalBlockFile(scope: !1533, file: !620, discriminator: 4)
!1575 = !DILocation(line: 1243, column: 8, scope: !1574)
!1576 = !DILocation(line: 1246, column: 8, scope: !1577)
!1577 = distinct !DILexicalBlock(scope: !1533, file: !620, line: 1246, column: 8)
!1578 = !DILocation(line: 1246, column: 12, scope: !1577)
!1579 = !DILocation(line: 1246, column: 8, scope: !1533)
!1580 = !DILocation(line: 1247, column: 7, scope: !1581)
!1581 = distinct !DILexicalBlock(scope: !1577, file: !620, line: 1246, column: 19)
!1582 = !DILocation(line: 1250, column: 40, scope: !1533)
!1583 = !DILocation(line: 1250, column: 45, scope: !1533)
!1584 = !DILocation(line: 1250, column: 60, scope: !1533)
!1585 = !DILocation(line: 1250, column: 11, scope: !1533)
!1586 = !DILocation(line: 1250, column: 4, scope: !1533)
!1587 = !DILocation(line: 1251, column: 1, scope: !1533)
!1588 = distinct !DISubprogram(name: "ProcMgr_ExecSyncWithExitCode", scope: !620, file: !620, line: 1309, type: !1534, isLocal: false, isDefinition: true, scopeLine: 1313, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !625)
!1589 = !DILocalVariable(name: "cmd", arg: 1, scope: !1588, file: !620, line: 1309, type: !636)
!1590 = !DILocation(line: 1309, column: 42, scope: !1588)
!1591 = !DILocalVariable(name: "userArgs", arg: 2, scope: !1588, file: !620, line: 1310, type: !1519)
!1592 = !DILocation(line: 1310, column: 48, scope: !1588)
!1593 = !DILocalVariable(name: "validExitCode", arg: 3, scope: !1588, file: !620, line: 1311, type: !1536)
!1594 = !DILocation(line: 1311, column: 36, scope: !1588)
!1595 = !DILocalVariable(name: "exitCode", arg: 4, scope: !1588, file: !620, line: 1312, type: !564)
!1596 = !DILocation(line: 1312, column: 35, scope: !1588)
!1597 = !DILocalVariable(name: "result", scope: !1588, file: !620, line: 1314, type: !755)
!1598 = !DILocation(line: 1314, column: 9, scope: !1588)
!1599 = !DILocation(line: 1318, column: 29, scope: !1588)
!1600 = !DILocation(line: 1318, column: 34, scope: !1588)
!1601 = !DILocation(line: 1318, column: 44, scope: !1588)
!1602 = !DILocation(line: 1318, column: 59, scope: !1588)
!1603 = !DILocation(line: 1318, column: 13, scope: !1588)
!1604 = !DILocation(line: 1318, column: 11, scope: !1588)
!1605 = !DILocation(line: 1321, column: 10, scope: !1588)
!1606 = !DILocation(line: 1321, column: 15, scope: !1588)
!1607 = !DILocation(line: 1321, column: 24, scope: !1588)
!1608 = !DILocation(line: 1321, column: 23, scope: !1588)
!1609 = !DILocation(line: 1321, column: 41, scope: !1610)
!1610 = !DILexicalBlockFile(scope: !1588, file: !620, discriminator: 1)
!1611 = !DILocation(line: 1321, column: 40, scope: !1610)
!1612 = !DILocation(line: 1321, column: 23, scope: !1610)
!1613 = !DILocation(line: 1321, column: 23, scope: !1614)
!1614 = !DILexicalBlockFile(scope: !1588, file: !620, discriminator: 2)
!1615 = !DILocation(line: 1321, column: 23, scope: !1616)
!1616 = !DILexicalBlockFile(scope: !1588, file: !620, discriminator: 3)
!1617 = !DILocation(line: 1320, column: 4, scope: !1588)
!1618 = !DILocation(line: 1322, column: 11, scope: !1588)
!1619 = !DILocation(line: 1322, column: 4, scope: !1588)
!1620 = distinct !DISubprogram(name: "ProcMgr_ExecAsync", scope: !620, file: !620, line: 1579, type: !1621, isLocal: false, isDefinition: true, scopeLine: 1581, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !625)
!1621 = !DISubroutineType(types: !1622)
!1622 = !{!1623, !636, !1519}
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProcMgr_AsyncProc", file: !601, line: 42, baseType: !1625)
!1625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ProcMgr_AsyncProc", file: !620, line: 108, size: 160, align: 32, elements: !1626)
!1626 = !{!1627, !1628, !1629, !1630, !1631}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "waiterPid", scope: !1625, file: !620, line: 109, baseType: !570, size: 32, align: 32)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "resultPid", scope: !1625, file: !620, line: 110, baseType: !570, size: 32, align: 32, offset: 32)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1625, file: !620, line: 111, baseType: !565, size: 32, align: 32, offset: 64)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "validExitCode", scope: !1625, file: !620, line: 112, baseType: !755, size: 8, align: 8, offset: 96)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "exitCode", scope: !1625, file: !620, line: 113, baseType: !565, size: 32, align: 32, offset: 128)
!1632 = !DILocalVariable(name: "cmd", arg: 1, scope: !1620, file: !620, line: 1579, type: !636)
!1633 = !DILocation(line: 1579, column: 31, scope: !1620)
!1634 = !DILocalVariable(name: "userArgs", arg: 2, scope: !1620, file: !620, line: 1580, type: !1519)
!1635 = !DILocation(line: 1580, column: 37, scope: !1620)
!1636 = !DILocalVariable(name: "asyncProc", scope: !1620, file: !620, line: 1582, type: !1623)
!1637 = !DILocation(line: 1582, column: 23, scope: !1620)
!1638 = !DILocalVariable(name: "pid", scope: !1620, file: !620, line: 1583, type: !570)
!1639 = !DILocation(line: 1583, column: 10, scope: !1620)
!1640 = !DILocalVariable(name: "fds", scope: !1620, file: !620, line: 1584, type: !1641)
!1641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 64, align: 32, elements: !1642)
!1642 = !{!1643}
!1643 = !DISubrange(count: 2)
!1644 = !DILocation(line: 1584, column: 8, scope: !1620)
!1645 = !DILocalVariable(name: "validExitCode", scope: !1620, file: !620, line: 1585, type: !755)
!1646 = !DILocation(line: 1585, column: 9, scope: !1620)
!1647 = !DILocalVariable(name: "exitCode", scope: !1620, file: !620, line: 1586, type: !565)
!1648 = !DILocation(line: 1586, column: 8, scope: !1620)
!1649 = !DILocalVariable(name: "resultPid", scope: !1620, file: !620, line: 1587, type: !570)
!1650 = !DILocation(line: 1587, column: 10, scope: !1620)
!1651 = !DILocalVariable(name: "readFd", scope: !1620, file: !620, line: 1588, type: !565)
!1652 = !DILocation(line: 1588, column: 8, scope: !1620)
!1653 = !DILocalVariable(name: "writeFd", scope: !1620, file: !620, line: 1588, type: !565)
!1654 = !DILocation(line: 1588, column: 16, scope: !1620)
!1655 = !DILocation(line: 1591, column: 10, scope: !1620)
!1656 = !DILocation(line: 1591, column: 16, scope: !1620)
!1657 = !DILocation(line: 1591, column: 25, scope: !1620)
!1658 = !DILocation(line: 1591, column: 28, scope: !1659)
!1659 = !DILexicalBlockFile(scope: !1620, file: !620, discriminator: 1)
!1660 = !DILocation(line: 1591, column: 38, scope: !1659)
!1661 = !DILocation(line: 1591, column: 15, scope: !1659)
!1662 = !DILocation(line: 1591, column: 58, scope: !1663)
!1663 = !DILexicalBlockFile(scope: !1620, file: !620, discriminator: 2)
!1664 = !DILocation(line: 1591, column: 68, scope: !1663)
!1665 = !DILocation(line: 1591, column: 15, scope: !1663)
!1666 = !DILocation(line: 1591, column: 15, scope: !1667)
!1667 = !DILexicalBlockFile(scope: !1620, file: !620, discriminator: 3)
!1668 = !DILocation(line: 1591, column: 15, scope: !1669)
!1669 = !DILexicalBlockFile(scope: !1620, file: !620, discriminator: 4)
!1670 = !DILocation(line: 1590, column: 4, scope: !1620)
!1671 = !DILocation(line: 1593, column: 13, scope: !1672)
!1672 = distinct !DILexicalBlock(scope: !1620, file: !620, line: 1593, column: 8)
!1673 = !DILocation(line: 1593, column: 8, scope: !1672)
!1674 = !DILocation(line: 1593, column: 18, scope: !1672)
!1675 = !DILocation(line: 1593, column: 8, scope: !1620)
!1676 = !DILocation(line: 1594, column: 69, scope: !1677)
!1677 = distinct !DILexicalBlock(scope: !1672, file: !620, line: 1593, column: 25)
!1678 = !DILocation(line: 1594, column: 7, scope: !1677)
!1679 = !DILocation(line: 1595, column: 7, scope: !1677)
!1680 = !DILocation(line: 1598, column: 13, scope: !1620)
!1681 = !DILocation(line: 1598, column: 11, scope: !1620)
!1682 = !DILocation(line: 1599, column: 14, scope: !1620)
!1683 = !DILocation(line: 1599, column: 12, scope: !1620)
!1684 = !DILocation(line: 1601, column: 10, scope: !1620)
!1685 = !DILocation(line: 1601, column: 8, scope: !1620)
!1686 = !DILocation(line: 1603, column: 8, scope: !1687)
!1687 = distinct !DILexicalBlock(scope: !1620, file: !620, line: 1603, column: 8)
!1688 = !DILocation(line: 1603, column: 12, scope: !1687)
!1689 = !DILocation(line: 1603, column: 8, scope: !1620)
!1690 = !DILocation(line: 1604, column: 52, scope: !1691)
!1691 = distinct !DILexicalBlock(scope: !1687, file: !620, line: 1603, column: 19)
!1692 = !DILocation(line: 1604, column: 51, scope: !1691)
!1693 = !DILocation(line: 1604, column: 42, scope: !1694)
!1694 = !DILexicalBlockFile(scope: !1691, file: !620, discriminator: 1)
!1695 = !DILocation(line: 1604, column: 7, scope: !1696)
!1696 = !DILexicalBlockFile(scope: !1691, file: !620, discriminator: 2)
!1697 = !DILocation(line: 1605, column: 7, scope: !1691)
!1698 = !DILocation(line: 1606, column: 15, scope: !1699)
!1699 = distinct !DILexicalBlock(scope: !1687, file: !620, line: 1606, column: 15)
!1700 = !DILocation(line: 1606, column: 19, scope: !1699)
!1701 = !DILocation(line: 1606, column: 15, scope: !1687)
!1702 = !DILocalVariable(name: "olds", scope: !1703, file: !620, line: 1607, type: !1704)
!1703 = distinct !DILexicalBlock(scope: !1699, file: !620, line: 1606, column: 25)
!1704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1705, size: 7296, align: 64, elements: !630)
!1705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !1706, line: 24, size: 1216, align: 64, elements: !1707)
!1706 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!1707 = !{!1708, !1785, !1794, !1795}
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !1705, file: !1706, line: 35, baseType: !1709, size: 64, align: 64)
!1709 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1705, file: !1706, line: 28, size: 64, align: 64, elements: !1710)
!1710 = !{!1711, !1712}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !1709, file: !1706, line: 31, baseType: !573, size: 64, align: 64)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !1709, file: !1706, line: 33, baseType: !1713, size: 64, align: 64)
!1713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1714, size: 64, align: 64)
!1714 = !DISubroutineType(types: !1715)
!1715 = !{null, !565, !1716, !555}
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !1718, line: 133, baseType: !1719)
!1718 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/siginfo.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!1719 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1718, line: 62, size: 1024, align: 64, elements: !1720)
!1720 = !{!1721, !1722, !1723, !1724}
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !1719, file: !1718, line: 64, baseType: !565, size: 32, align: 32)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !1719, file: !1718, line: 65, baseType: !565, size: 32, align: 32, offset: 32)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !1719, file: !1718, line: 67, baseType: !565, size: 32, align: 32, offset: 64)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !1719, file: !1718, line: 132, baseType: !1725, size: 896, align: 64, offset: 128)
!1725 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1719, file: !1718, line: 69, size: 896, align: 64, elements: !1726)
!1726 = !{!1727, !1731, !1736, !1747, !1753, !1763, !1774, !1779}
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !1725, file: !1718, line: 71, baseType: !1728, size: 896, align: 32)
!1728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 896, align: 32, elements: !1729)
!1729 = !{!1730}
!1730 = !DISubrange(count: 28)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !1725, file: !1718, line: 78, baseType: !1732, size: 64, align: 32)
!1732 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1725, file: !1718, line: 74, size: 64, align: 32, elements: !1733)
!1733 = !{!1734, !1735}
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1732, file: !1718, line: 76, baseType: !572, size: 32, align: 32)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1732, file: !1718, line: 77, baseType: !922, size: 32, align: 32, offset: 32)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !1725, file: !1718, line: 86, baseType: !1737, size: 128, align: 64)
!1737 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1725, file: !1718, line: 81, size: 128, align: 64, elements: !1738)
!1738 = !{!1739, !1740, !1741}
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !1737, file: !1718, line: 83, baseType: !565, size: 32, align: 32)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !1737, file: !1718, line: 84, baseType: !565, size: 32, align: 32, offset: 32)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !1737, file: !1718, line: 85, baseType: !1742, size: 64, align: 64, offset: 64)
!1742 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !1718, line: 36, baseType: !1743)
!1743 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !1718, line: 32, size: 64, align: 64, elements: !1744)
!1744 = !{!1745, !1746}
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !1743, file: !1718, line: 34, baseType: !565, size: 32, align: 32)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !1743, file: !1718, line: 35, baseType: !555, size: 64, align: 64)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !1725, file: !1718, line: 94, baseType: !1748, size: 128, align: 64)
!1748 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1725, file: !1718, line: 89, size: 128, align: 64, elements: !1749)
!1749 = !{!1750, !1751, !1752}
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1748, file: !1718, line: 91, baseType: !572, size: 32, align: 32)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1748, file: !1718, line: 92, baseType: !922, size: 32, align: 32, offset: 32)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !1748, file: !1718, line: 93, baseType: !1742, size: 64, align: 64, offset: 64)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !1725, file: !1718, line: 104, baseType: !1754, size: 256, align: 64)
!1754 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1725, file: !1718, line: 97, size: 256, align: 64, elements: !1755)
!1755 = !{!1756, !1757, !1758, !1759, !1762}
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1754, file: !1718, line: 99, baseType: !572, size: 32, align: 32)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1754, file: !1718, line: 100, baseType: !922, size: 32, align: 32, offset: 32)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !1754, file: !1718, line: 101, baseType: !565, size: 32, align: 32, offset: 64)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !1754, file: !1718, line: 102, baseType: !1760, size: 64, align: 64, offset: 128)
!1760 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !1718, line: 58, baseType: !1761)
!1761 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !559, line: 135, baseType: !560)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !1754, file: !1718, line: 103, baseType: !1760, size: 64, align: 64, offset: 192)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !1725, file: !1718, line: 116, baseType: !1764, size: 256, align: 64)
!1764 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1725, file: !1718, line: 107, size: 256, align: 64, elements: !1765)
!1765 = !{!1766, !1767, !1769}
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !1764, file: !1718, line: 109, baseType: !555, size: 64, align: 64)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !1764, file: !1718, line: 110, baseType: !1768, size: 16, align: 16, offset: 64)
!1768 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_bnd", scope: !1764, file: !1718, line: 115, baseType: !1770, size: 128, align: 64, offset: 128)
!1770 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1764, file: !1718, line: 111, size: 128, align: 64, elements: !1771)
!1771 = !{!1772, !1773}
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !1770, file: !1718, line: 113, baseType: !555, size: 64, align: 64)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !1770, file: !1718, line: 114, baseType: !555, size: 64, align: 64, offset: 64)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !1725, file: !1718, line: 123, baseType: !1775, size: 128, align: 64)
!1775 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1725, file: !1718, line: 119, size: 128, align: 64, elements: !1776)
!1776 = !{!1777, !1778}
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !1775, file: !1718, line: 121, baseType: !560, size: 64, align: 64)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !1775, file: !1718, line: 122, baseType: !565, size: 32, align: 32, offset: 64)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !1725, file: !1718, line: 131, baseType: !1780, size: 128, align: 64)
!1780 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1725, file: !1718, line: 126, size: 128, align: 64, elements: !1781)
!1781 = !{!1782, !1783, !1784}
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !1780, file: !1718, line: 128, baseType: !555, size: 64, align: 64)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !1780, file: !1718, line: 129, baseType: !565, size: 32, align: 32, offset: 64)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !1780, file: !1718, line: 130, baseType: !598, size: 32, align: 32, offset: 96)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !1705, file: !1706, line: 43, baseType: !1786, size: 1024, align: 64, offset: 64)
!1786 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !1787, line: 30, baseType: !1788)
!1787 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "/home/lichi/Desktop/open-vm-tools/line802")
!1788 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1787, line: 27, size: 1024, align: 64, elements: !1789)
!1789 = !{!1790}
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !1788, file: !1787, line: 29, baseType: !1791, size: 1024, align: 64)
!1791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 1024, align: 64, elements: !1792)
!1792 = !{!1793}
!1793 = !DISubrange(count: 16)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !1705, file: !1706, line: 46, baseType: !565, size: 32, align: 32, offset: 1088)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !1705, file: !1706, line: 49, baseType: !1796, size: 64, align: 64, offset: 1152)
!1796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1797, size: 64, align: 64)
!1797 = !DISubroutineType(types: !1798)
!1798 = !{null}
!1799 = !DILocation(line: 1607, column: 24, scope: !1703)
!1800 = !DILocalVariable(name: "i", scope: !1703, file: !620, line: 1608, type: !565)
!1801 = !DILocation(line: 1608, column: 11, scope: !1703)
!1802 = !DILocalVariable(name: "maxfd", scope: !1703, file: !620, line: 1608, type: !565)
!1803 = !DILocation(line: 1608, column: 14, scope: !1703)
!1804 = !DILocalVariable(name: "status", scope: !1703, file: !620, line: 1609, type: !755)
!1805 = !DILocation(line: 1609, column: 12, scope: !1703)
!1806 = !DILocalVariable(name: "childPid", scope: !1703, file: !620, line: 1610, type: !570)
!1807 = !DILocation(line: 1610, column: 13, scope: !1703)
!1808 = !DILocation(line: 1624, column: 15, scope: !1703)
!1809 = !DILocation(line: 1624, column: 13, scope: !1703)
!1810 = !DILocation(line: 1625, column: 14, scope: !1811)
!1811 = distinct !DILexicalBlock(scope: !1703, file: !620, line: 1625, column: 7)
!1812 = !DILocation(line: 1625, column: 12, scope: !1811)
!1813 = !DILocation(line: 1625, column: 34, scope: !1814)
!1814 = !DILexicalBlockFile(scope: !1815, file: !620, discriminator: 1)
!1815 = distinct !DILexicalBlock(scope: !1811, file: !620, line: 1625, column: 7)
!1816 = !DILocation(line: 1625, column: 38, scope: !1814)
