; ModuleID = './vmstdio.o.i'
source_filename = "./vmstdio.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.DynBuf = type { i8*, i64, i64 }

@.str = private unnamed_addr constant [1 x i8] zeroinitializer, align 1

; Function Attrs: nounwind uwtable
define i32 @StdIO_ReadNextLine(%struct._IO_FILE*, i8**, i64, i64*) #0 !dbg !14 {
  %5 = alloca i32, align 4
  %6 = alloca %struct._IO_FILE*, align 8
  %7 = alloca i8**, align 8
  %8 = alloca i64, align 8
  %9 = alloca i64*, align 8
  %10 = alloca %struct.DynBuf, align 8
  %11 = alloca i8*, align 8
  %12 = alloca i64, align 8
  %13 = alloca i64, align 8
  %14 = alloca i64, align 8
  store %struct._IO_FILE* %0, %struct._IO_FILE** %6, align 8
  call void @llvm.dbg.declare(metadata %struct._IO_FILE** %6, metadata !84, metadata !85), !dbg !86
  store i8** %1, i8*** %7, align 8
  call void @llvm.dbg.declare(metadata i8*** %7, metadata !87, metadata !85), !dbg !88
  store i64 %2, i64* %8, align 8
  call void @llvm.dbg.declare(metadata i64* %8, metadata !89, metadata !85), !dbg !90
  store i64* %3, i64** %9, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9)
!1 = !DIFile(filename: "vmstdio.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line711")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 34, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmstdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line711")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "StdIO_Error", value: 0)
!7 = !DIEnumerator(name: "StdIO_EOF", value: 1)
!8 = !DIEnumerator(name: "StdIO_Success", value: 2)
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !{i32 2, !"Dwarf Version", i32 4}
!12 = !{i32 2, !"Debug Info Version", i32 3}
!13 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!14 = distinct !DISubprogram(name: "StdIO_ReadNextLine", scope: !15, file: !15, line: 187, type: !16, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !83)
!15 = !DIFile(filename: "vmstdio.c", directory: "/home/lichi/Desktop/open-vm-tools/line711")
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !19, !81, !73, !82}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "StdIO_Status", file: !4, line: 38, baseType: !3)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 48, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line711")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !23, line: 241, size: 1728, align: 64, elements: !24)
!23 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line711")
!24 = !{!25, !27, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !48, !49, !50, !51, !55, !57, !59, !63, !66, !68, !69, !70, !71, !72, !76, !77}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !22, file: !23, line: 242, baseType: !26, size: 32, align: 32)
!26 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !22, file: !23, line: 247, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !22, file: !23, line: 248, baseType: !28, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !22, file: !23, line: 249, baseType: !28, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !22, file: !23, line: 250, baseType: !28, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !22, file: !23, line: 251, baseType: !28, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !22, file: !23, line: 252, baseType: !28, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !22, file: !23, line: 253, baseType: !28, size: 64, align: 64, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !22, file: !23, line: 254, baseType: !28, size: 64, align: 64, offset: 512)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !22, file: !23, line: 256, baseType: !28, size: 64, align: 64, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !22, file: !23, line: 257, baseType: !28, size: 64, align: 64, offset: 640)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !22, file: !23, line: 258, baseType: !28, size: 64, align: 64, offset: 704)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !22, file: !23, line: 260, baseType: !41, size: 64, align: 64, offset: 768)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !23, line: 156, size: 192, align: 64, elements: !43)
!43 = !{!44, !45, !47}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !42, file: !23, line: 157, baseType: !41, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !42, file: !23, line: 158, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !42, file: !23, line: 162, baseType: !26, size: 32, align: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !22, file: !23, line: 262, baseType: !46, size: 64, align: 64, offset: 832)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !22, file: !23, line: 264, baseType: !26, size: 32, align: 32, offset: 896)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !22, file: !23, line: 268, baseType: !26, size: 32, align: 32, offset: 928)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !22, file: !23, line: 270, baseType: !52, size: 64, align: 64, offset: 960)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !53, line: 131, baseType: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line711")
!54 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !22, file: !23, line: 274, baseType: !56, size: 16, align: 16, offset: 1024)
!56 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !22, file: !23, line: 275, baseType: !58, size: 8, align: 8, offset: 1040)
!58 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !22, file: !23, line: 276, baseType: !60, size: 8, align: 8, offset: 1048)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 8, align: 8, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 1)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !22, file: !23, line: 280, baseType: !64, size: 64, align: 64, offset: 1088)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !23, line: 150, baseType: null)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !22, file: !23, line: 289, baseType: !67, size: 64, align: 64, offset: 1152)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !53, line: 132, baseType: !54)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !22, file: !23, line: 297, baseType: !10, size: 64, align: 64, offset: 1216)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !22, file: !23, line: 298, baseType: !10, size: 64, align: 64, offset: 1280)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !22, file: !23, line: 299, baseType: !10, size: 64, align: 64, offset: 1344)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !22, file: !23, line: 300, baseType: !10, size: 64, align: 64, offset: 1408)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !22, file: !23, line: 302, baseType: !73, size: 64, align: 64, offset: 1472)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !74, line: 216, baseType: !75)
!74 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line711")
!75 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !22, file: !23, line: 303, baseType: !26, size: 32, align: 32, offset: 1536)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !22, file: !23, line: 305, baseType: !78, size: 160, align: 8, offset: 1568)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 160, align: 8, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 20)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!83 = !{}
!84 = !DILocalVariable(name: "stream", arg: 1, scope: !14, file: !15, line: 187, type: !19)
!85 = !DIExpression()
!86 = !DILocation(line: 187, column: 26, scope: !14)
!87 = !DILocalVariable(name: "buf", arg: 2, scope: !14, file: !15, line: 188, type: !81)
!88 = !DILocation(line: 188, column: 27, scope: !14)
!89 = !DILocalVariable(name: "maxBufLength", arg: 3, scope: !14, file: !15, line: 189, type: !73)
!90 = !DILocation(line: 189, column: 27, scope: !14)
!91 = !DILocalVariable(name: "count", arg: 4, scope: !14, file: !15, line: 190, type: !82)
!92 = !DILocation(line: 190, column: 28, scope: !14)
!93 = !DILocalVariable(name: "b", scope: !14, file: !15, line: 192, type: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "DynBuf", file: !95, line: 40, baseType: !96)
!95 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dynbuf.h", directory: "/home/lichi/Desktop/open-vm-tools/line711")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynBuf", file: !95, line: 36, size: 192, align: 64, elements: !97)
!97 = !{!98, !99, !100}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !95, line: 37, baseType: !28, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !96, file: !95, line: 38, baseType: !73, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !96, file: !95, line: 39, baseType: !73, size: 64, align: 64, offset: 128)
!101 = !DILocation(line: 192, column: 11, scope: !14)
!102 = !DILocation(line: 197, column: 4, scope: !14)
!103 = !DILocation(line: 199, column: 4, scope: !14)
!104 = !DILocalVariable(name: "data", scope: !105, file: !15, line: 200, type: !28)
!105 = distinct !DILexicalBlock(scope: !106, file: !15, line: 199, column: 13)
!106 = distinct !DILexicalBlock(scope: !107, file: !15, line: 199, column: 4)
!107 = distinct !DILexicalBlock(scope: !14, file: !15, line: 199, column: 4)
!108 = !DILocation(line: 200, column: 13, scope: !105)
!109 = !DILocalVariable(name: "size", scope: !105, file: !15, line: 201, type: !73)
!110 = !DILocation(line: 201, column: 14, scope: !105)
!111 = !DILocalVariable(name: "max", scope: !105, file: !15, line: 202, type: !73)
!112 = !DILocation(line: 202, column: 14, scope: !105)
!113 = !DILocalVariable(name: "nr", scope: !105, file: !15, line: 203, type: !73)
!114 = !DILocation(line: 203, column: 14, scope: !105)
!115 = !DILocation(line: 210, column: 11, scope: !116)
!116 = distinct !DILexicalBlock(scope: !105, file: !15, line: 210, column: 11)
!117 = !DILocation(line: 210, column: 33, scope: !116)
!118 = !DILocation(line: 210, column: 11, scope: !105)
!119 = !DILocation(line: 211, column: 11, scope: !120)
!120 = distinct !DILexicalBlock(scope: !116, file: !15, line: 210, column: 39)
!121 = !DILocation(line: 211, column: 15, scope: !120)
!122 = !DILocation(line: 212, column: 1, scope: !120)
!123 = !DILocation(line: 213, column: 10, scope: !120)
!124 = !DILocation(line: 218, column: 14, scope: !105)
!125 = !DILocation(line: 218, column: 12, scope: !105)
!126 = !DILocation(line: 219, column: 14, scope: !105)
!127 = !DILocation(line: 219, column: 12, scope: !105)
!128 = !DILocation(line: 221, column: 13, scope: !105)
!129 = !DILocation(line: 221, column: 11, scope: !105)
!130 = !DILocation(line: 222, column: 12, scope: !105)
!131 = !DILocation(line: 222, column: 18, scope: !105)
!132 = !DILocation(line: 222, column: 16, scope: !105)
!133 = !DILocation(line: 222, column: 10, scope: !105)
!134 = !DILocation(line: 224, column: 22, scope: !135)
!135 = distinct !DILexicalBlock(scope: !105, file: !15, line: 224, column: 11)
!136 = !DILocation(line: 224, column: 35, scope: !135)
!137 = !DILocation(line: 224, column: 42, scope: !135)
!138 = !DILocation(line: 224, column: 40, scope: !135)
!139 = !DILocation(line: 224, column: 11, scope: !135)
!140 = !DILocation(line: 224, column: 48, scope: !135)
!141 = !DILocation(line: 224, column: 11, scope: !105)
!142 = !DILocation(line: 224, column: 1, scope: !143)
!143 = !DILexicalBlockFile(scope: !144, file: !15, discriminator: 1)
!144 = distinct !DILexicalBlock(scope: !135, file: !15, line: 223, column: 56)
!145 = !DILocation(line: 225, column: 10, scope: !144)
!146 = !DILocation(line: 228, column: 15, scope: !105)
!147 = !DILocation(line: 228, column: 12, scope: !105)
!148 = !DILocation(line: 229, column: 26, scope: !105)
!149 = !DILocation(line: 229, column: 7, scope: !105)
!150 = !DILocation(line: 231, column: 11, scope: !151)
!151 = distinct !DILexicalBlock(scope: !105, file: !15, line: 231, column: 11)
!152 = !DILocation(line: 231, column: 24, scope: !151)
!153 = !DILocation(line: 231, column: 29, scope: !151)
!154 = !DILocation(line: 231, column: 32, scope: !155)
!155 = !DILexicalBlockFile(scope: !151, file: !15, discriminator: 1)
!156 = !DILocation(line: 231, column: 40, scope: !155)
!157 = !DILocation(line: 231, column: 37, scope: !155)
!158 = !DILocation(line: 231, column: 11, scope: !155)
!159 = !DILocation(line: 231, column: 11, scope: !160)
!160 = !DILexicalBlockFile(scope: !161, file: !15, discriminator: 2)
!161 = distinct !DILexicalBlock(scope: !151, file: !15, line: 231, column: 54)
!162 = !DILocation(line: 231, column: 15, scope: !160)
!163 = !DILocation(line: 232, column: 1, scope: !161)
!164 = !DILocation(line: 233, column: 10, scope: !161)
