; ModuleID = './libvix_la-foundryToolsDaemon.o.i'
source_filename = "./libvix_la-foundryToolsDaemon.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.HgfsServerMgrData = type { i8*, i8*, i8*, i8* }
%struct.SyncHandle = type opaque
%struct.RpcInData = type { i8*, i8*, i64, i8*, i64, i32, i8*, i8* }
%struct._GMainLoop = type opaque
%struct.ToolsAppCtx = type { i32, i8*, i32, i32, %struct._GMainLoop*, %struct._RpcChannel*, %struct._GKeyFile*, i32, i32, i8**, i8* }
%struct._RpcChannel = type opaque
%struct._GKeyFile = type opaque
%struct._GSource = type { i8*, %struct._GSourceCallbackFuncs*, %struct._GSourceFuncs*, i32, %struct._GMainContext*, i32, i32, i32, %struct._GSList*, %struct._GSource*, %struct._GSource*, i8*, %struct._GSourcePrivate* }
%struct._GSourceCallbackFuncs = type { void (i8*)*, void (i8*)*, void (i8*, %struct._GSource*, i32 (i8*)**, i8**)* }
%struct._GSourceFuncs = type { i32 (%struct._GSource*, i32*)*, i32 (%struct._GSource*)*, i32 (%struct._GSource*, i32 (i8*)*, i8*)*, void (%struct._GSource*)*, i32 (i8*)*, void ()* }
%struct._GMainContext = type opaque
%struct._GSList = type { i8*, %struct._GSList* }
%struct._GSourcePrivate = type opaque
%struct.ProcMgr_ProcArgs = type { i8**, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }

!255 = !DIEnumerator(name: "VIX_E_MNTAPI_CREATE_PARTITIONTABLE_ERROR", value: 24320)
!256 = !DIEnumerator(name: "VIX_E_MNTAPI_OPEN_FAILURE", value: 24321)
!257 = !DIEnumerator(name: "VIX_E_MNTAPI_VOLUME_NOT_WRITABLE", value: 24322)
!258 = !DIEnumerator(name: "VIX_ASYNC", value: 25000)
!259 = !DIEnumerator(name: "VIX_E_ASYNC_MIXEDMODE_UNSUPPORTED", value: 26000)
!260 = !DIEnumerator(name: "VIX_E_NET_HTTP_UNSUPPORTED_PROTOCOL", value: 30001)
!261 = !DIEnumerator(name: "VIX_E_NET_HTTP_URL_MALFORMAT", value: 30003)
!262 = !DIEnumerator(name: "VIX_E_NET_HTTP_COULDNT_RESOLVE_PROXY", value: 30005)
!263 = !DIEnumerator(name: "VIX_E_NET_HTTP_COULDNT_RESOLVE_HOST", value: 30006)
!264 = !DIEnumerator(name: "VIX_E_NET_HTTP_COULDNT_CONNECT", value: 30007)
!265 = !DIEnumerator(name: "VIX_E_NET_HTTP_HTTP_RETURNED_ERROR", value: 30022)
!266 = !DIEnumerator(name: "VIX_E_NET_HTTP_OPERATION_TIMEDOUT", value: 30028)
!267 = !DIEnumerator(name: "VIX_E_NET_HTTP_SSL_CONNECT_ERROR", value: 30035)
!268 = !DIEnumerator(name: "VIX_E_NET_HTTP_TOO_MANY_REDIRECTS", value: 30047)
!269 = !DIEnumerator(name: "VIX_E_NET_HTTP_TRANSFER", value: 30200)
!270 = !DIEnumerator(name: "VIX_E_NET_HTTP_SSL_SECURITY", value: 30201)
!271 = !DIEnumerator(name: "VIX_E_NET_HTTP_GENERIC", value: 30202)
!272 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !273, line: 232, size: 32, align: 32, elements: !274)
!273 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/plugin.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!274 = !{!275}
!275 = !DIEnumerator(name: "TOOLS_CORE_API_V1", value: 1)
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !277, line: 51, size: 32, align: 32, elements: !278)
!277 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287}
!279 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!280 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!281 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!282 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!283 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!284 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!285 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!286 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!287 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !289, line: 45, size: 32, align: 32, elements: !290)
!289 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/syncDriver.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!290 = !{!291, !292, !293}
!291 = !DIEnumerator(name: "SYNCDRIVER_IDLE", value: 0)
!292 = !DIEnumerator(name: "SYNCDRIVER_BUSY", value: 1)
!293 = !DIEnumerator(name: "SYNCDRIVER_ERROR", value: 2)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 191, size: 32, align: 32, elements: !296)
!295 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vixOpenSource.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!297 = !DIEnumerator(name: "VIX_E_OP_NOT_SUPPORTED_ON_NON_VMWARE_VM", value: 3038)
!298 = !DIEnumerator(name: "VIX_E_VI_OP_NOT_SUPPORTED_ON_GUEST", value: 3048)
!299 = !DIEnumerator(name: "VIX_E_INVALID_LOGIN_CREDENTIALS", value: 3050)
!300 = !DIEnumerator(name: "VIX_E_GUEST_AUTHTYPE_DISABLED", value: 3051)
!301 = !DIEnumerator(name: "VIX_E_DIRECTORY_NOT_EMPTY", value: 20006)
!302 = !DIEnumerator(name: "VIX_E_GUEST_AUTH_MULIPLE_MAPPINGS", value: 20007)
!303 = !DIEnumerator(name: "VIX_E_REG_KEY_INVALID", value: 20008)
!304 = !DIEnumerator(name: "VIX_E_REG_KEY_HAS_SUBKEYS", value: 20009)
!305 = !DIEnumerator(name: "VIX_E_REG_VALUE_NOT_FOUND", value: 20010)
!306 = !DIEnumerator(name: "VIX_E_REG_KEY_ALREADY_EXISTS", value: 20011)
!307 = !DIEnumerator(name: "VIX_E_REG_KEY_PARENT_VOLATILE", value: 20012)
!308 = !DIEnumerator(name: "VIX_E_HGFS_MOUNT_FAIL", value: 20050)
!309 = !DIEnumerator(name: "VIX_E_REG_INCORRECT_VALUE_TYPE", value: 25000)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "VixCommonCommandOptionValues", file: !311, line: 88, size: 32, align: 32, elements: !312)
!311 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vixCommands.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!312 = !{!313, !314, !315, !316, !317, !318, !319}
!313 = !DIEnumerator(name: "VIX_COMMAND_REQUEST", value: 1)
!314 = !DIEnumerator(name: "VIX_COMMAND_REPORT_EVENT", value: 2)
!315 = !DIEnumerator(name: "VIX_COMMAND_FORWARD_TO_GUEST", value: 4)
!316 = !DIEnumerator(name: "VIX_COMMAND_GUEST_RETURNS_STRING", value: 8)
!317 = !DIEnumerator(name: "VIX_COMMAND_GUEST_RETURNS_INTEGER_STRING", value: 16)
!318 = !DIEnumerator(name: "VIX_COMMAND_GUEST_RETURNS_PROPERTY_LIST", value: 64)
!319 = !DIEnumerator(name: "VIX_COMMAND_GUEST_RETURNS_BINARY", value: 128)
!320 = !{!321, !322, !362, !363, !368, !372, !373}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCtx", file: !273, line: 274, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCtx", file: !273, line: 241, size: 576, align: 64, elements: !325)
!325 = !{!326, !328, !334, !338, !339, !344, !349, !354, !355, !356, !360}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !324, file: !273, line: 243, baseType: !327, size: 32, align: 32)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreAPI", file: !273, line: 234, baseType: !272)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !324, file: !273, line: 245, baseType: !329, size: 64, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !332, line: 46, baseType: !333)
!332 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!333 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "isVMware", scope: !324, file: !273, line: 247, baseType: !335, size: 32, align: 32, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !332, line: 50, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !332, line: 49, baseType: !337)
!337 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "errorCode", scope: !324, file: !273, line: 249, baseType: !337, size: 32, align: 32, offset: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "mainLoop", scope: !324, file: !273, line: 251, baseType: !340, size: 64, align: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !342, line: 56, baseType: !343)
!342 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !342, line: 56, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !324, file: !273, line: 253, baseType: !345, size: 64, align: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !347, line: 48, baseType: !348)
!347 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !347, line: 48, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !324, file: !273, line: 255, baseType: !350, size: 64, align: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !352, line: 48, baseType: !353)
!352 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !352, line: 48, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "blockFD", scope: !324, file: !273, line: 261, baseType: !337, size: 32, align: 32, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "uinputFD", scope: !324, file: !273, line: 263, baseType: !337, size: 32, align: 32, offset: 416)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !324, file: !273, line: 265, baseType: !357, size: 64, align: 64, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !333)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "serviceObj", scope: !324, file: !273, line: 273, baseType: !361, size: 64, align: 64, offset: 512)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !332, line: 77, baseType: !321)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !364, line: 172, baseType: !365)
!364 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !366, line: 197, baseType: !367)
!366 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!367 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !342, line: 155, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!335, !361}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixCommandRequestHeader", file: !311, line: 196, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixCommandRequestHeader", file: !311, line: 182, size: 408, align: 8, elements: !376)
!376 = !{!377, !398, !399, !400, !401, !405, !406}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "commonHeader", scope: !375, file: !311, line: 183, baseType: !378, size: 184, align: 8)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixMsgHeader", file: !311, line: 170, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixMsgHeader", file: !311, line: 158, size: 184, align: 8, elements: !380)
!380 = !{!381, !386, !390, !391, !392, !393, !394}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !379, file: !311, line: 159, baseType: !382, size: 32, align: 32)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !364, line: 173, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !384, line: 51, baseType: !385)
!384 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!385 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "messageVersion", scope: !379, file: !311, line: 160, baseType: !387, size: 16, align: 16, offset: 32)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !364, line: 175, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !384, line: 49, baseType: !389)
!389 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "totalMessageLength", scope: !379, file: !311, line: 162, baseType: !382, size: 32, align: 32, offset: 48)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "headerLength", scope: !379, file: !311, line: 163, baseType: !382, size: 32, align: 32, offset: 80)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "bodyLength", scope: !379, file: !311, line: 164, baseType: !382, size: 32, align: 32, offset: 112)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "credentialLength", scope: !379, file: !311, line: 165, baseType: !382, size: 32, align: 32, offset: 144)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "commonFlags", scope: !379, file: !311, line: 167, baseType: !395, size: 8, align: 8, offset: 176)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !364, line: 177, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !384, line: 48, baseType: !397)
!397 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "opCode", scope: !375, file: !311, line: 185, baseType: !382, size: 32, align: 32, offset: 184)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "requestFlags", scope: !375, file: !311, line: 186, baseType: !382, size: 32, align: 32, offset: 216)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "timeOut", scope: !375, file: !311, line: 188, baseType: !382, size: 32, align: 32, offset: 248)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !375, file: !311, line: 190, baseType: !402, size: 64, align: 64, offset: 280)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !364, line: 171, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !384, line: 55, baseType: !404)
!404 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "clientHandleId", scope: !375, file: !311, line: 191, baseType: !382, size: 32, align: 32, offset: 344)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "userCredentialType", scope: !375, file: !311, line: 193, baseType: !382, size: 32, align: 32, offset: 376)
!407 = !{!408, !431, !433, !435, !437, !439, !444, !449, !458, !460}
!408 = distinct !DIGlobalVariable(name: "resultBuffer", scope: !409, file: !410, line: 176, type: !428, isLocal: true, isDefinition: true, variable: [1024 x i8]* @FoundryToolsDaemonRunProgram.resultBuffer)
!409 = distinct !DISubprogram(name: "FoundryToolsDaemonRunProgram", scope: !410, file: !410, line: 166, type: !411, isLocal: false, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !427)
!410 = !DIFile(filename: "foundryToolsDaemon.c", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!411 = !DISubroutineType(types: !412)
!412 = !{!335, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcInData", file: !347, line: 77, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcInData", file: !347, line: 51, size: 512, align: 64, elements: !416)
!416 = !{!417, !418, !419, !422, !423, !424, !425, !426}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !415, file: !347, line: 53, baseType: !358, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !415, file: !347, line: 58, baseType: !358, size: 64, align: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "argsSize", scope: !415, file: !347, line: 60, baseType: !420, size: 64, align: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !421, line: 216, baseType: !404)
!421 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!422 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !415, file: !347, line: 65, baseType: !372, size: 64, align: 64, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "resultLen", scope: !415, file: !347, line: 67, baseType: !420, size: 64, align: 64, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "freeResult", scope: !415, file: !347, line: 72, baseType: !335, size: 32, align: 32, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "appCtx", scope: !415, file: !347, line: 74, baseType: !321, size: 64, align: 64, offset: 384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !415, file: !347, line: 76, baseType: !321, size: 64, align: 64, offset: 448)
!427 = !{}
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 8192, align: 8, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 1024)
!431 = distinct !DIGlobalVariable(name: "resultBuffer", scope: !432, file: !410, line: 291, type: !428, isLocal: true, isDefinition: true, variable: [1024 x i8]* @FoundryToolsDaemonGetToolsProperties.resultBuffer)
!432 = distinct !DISubprogram(name: "FoundryToolsDaemonGetToolsProperties", scope: !410, file: !410, line: 287, type: !411, isLocal: false, isDefinition: true, scopeLine: 288, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !427)
!433 = distinct !DIGlobalVariable(name: "resultBuffer", scope: !434, file: !410, line: 548, type: !428, isLocal: true, isDefinition: true, variable: [1024 x i8]* @ToolsDaemonTcloSyncDriverFreeze.resultBuffer)
!434 = distinct !DISubprogram(name: "ToolsDaemonTcloSyncDriverFreeze", scope: !410, file: !410, line: 546, type: !411, isLocal: false, isDefinition: true, scopeLine: 547, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !427)
!435 = distinct !DIGlobalVariable(name: "resultBuffer", scope: !436, file: !410, line: 696, type: !428, isLocal: true, isDefinition: true, variable: [1024 x i8]* @ToolsDaemonTcloSyncDriverThaw.resultBuffer)
!436 = distinct !DISubprogram(name: "ToolsDaemonTcloSyncDriverThaw", scope: !410, file: !410, line: 694, type: !411, isLocal: false, isDefinition: true, scopeLine: 695, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !427)
!437 = distinct !DIGlobalVariable(name: "resultBuffer", scope: !438, file: !410, line: 815, type: !428, isLocal: true, isDefinition: true, variable: [1024 x i8]* @ToolsDaemonTcloMountHGFS.resultBuffer)
!438 = distinct !DISubprogram(name: "ToolsDaemonTcloMountHGFS", scope: !410, file: !410, line: 812, type: !411, isLocal: false, isDefinition: true, scopeLine: 813, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !427)
!439 = distinct !DIGlobalVariable(name: "resultPacket", scope: !440, file: !410, line: 991, type: !441, isLocal: true, isDefinition: true, variable: [63512 x i8]* @ToolsDaemonHgfsImpersonated.resultPacket)
!440 = distinct !DISubprogram(name: "ToolsDaemonHgfsImpersonated", scope: !410, file: !410, line: 978, type: !411, isLocal: false, isDefinition: true, scopeLine: 979, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !427)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 508096, align: 8, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 63512)
!444 = distinct !DIGlobalVariable(name: "tcloBuffer", scope: !445, file: !410, line: 1225, type: !446, isLocal: true, isDefinition: true, variable: [65536 x i8]* @ToolsDaemonTcloReceiveVixCommand.tcloBuffer)
!445 = distinct !DISubprogram(name: "ToolsDaemonTcloReceiveVixCommand", scope: !410, file: !410, line: 1204, type: !411, isLocal: false, isDefinition: true, scopeLine: 1205, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !427)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 524288, align: 8, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 65536)
!449 = distinct !DIGlobalVariable(name: "gFoundryHgfsBkdrConn", scope: !0, file: !410, line: 121, type: !450, isLocal: true, isDefinition: true, variable: %struct.HgfsServerMgrData* @gFoundryHgfsBkdrConn)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerMgrData", file: !451, line: 49, baseType: !452)
!451 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hgfsServerManager.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerMgrData", file: !451, line: 44, size: 256, align: 64, elements: !453)
!453 = !{!454, !455, !456, !457}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "appName", scope: !452, file: !451, line: 45, baseType: !358, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !452, file: !451, line: 46, baseType: !321, size: 64, align: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "rpcCallback", scope: !452, file: !451, line: 47, baseType: !321, size: 64, align: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !452, file: !451, line: 48, baseType: !321, size: 64, align: 64, offset: 192)
!458 = distinct !DIGlobalVariable(name: "thisProcessRunsAsRoot", scope: !0, file: !410, line: 145, type: !459, isLocal: true, isDefinition: true, variable: i8* @thisProcessRunsAsRoot)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !364, line: 230, baseType: !333)
!460 = distinct !DIGlobalVariable(name: "gSyncDriverHandle", scope: !0, file: !410, line: 107, type: !461, isLocal: true, isDefinition: true, variable: %struct.SyncHandle** @gSyncDriverHandle)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyncDriverHandle", file: !289, line: 41, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "SyncHandle", file: !289, line: 41, flags: DIFlagFwdDecl)
!464 = !{i32 2, !"Dwarf Version", i32 4}
!465 = !{i32 2, !"Debug Info Version", i32 3}
!466 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!467 = !DILocalVariable(name: "data", arg: 1, scope: !409, file: !410, line: 166, type: !413)
!468 = !DIExpression()
!469 = !DILocation(line: 166, column: 41, scope: !409)
!470 = !DILocalVariable(name: "err", scope: !409, file: !410, line: 168, type: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixError", file: !4, line: 79, baseType: !402)
!472 = !DILocation(line: 168, column: 13, scope: !409)
!473 = !DILocalVariable(name: "requestName", scope: !409, file: !410, line: 169, type: !372)
!474 = !DILocation(line: 169, column: 10, scope: !409)
!475 = !DILocalVariable(name: "commandLine", scope: !409, file: !410, line: 170, type: !372)
!476 = !DILocation(line: 170, column: 10, scope: !409)
!477 = !DILocalVariable(name: "commandLineArgs", scope: !409, file: !410, line: 171, type: !372)
!478 = !DILocation(line: 171, column: 10, scope: !409)
!479 = !DILocalVariable(name: "credentialTypeStr", scope: !409, file: !410, line: 172, type: !372)
!480 = !DILocation(line: 172, column: 10, scope: !409)
!481 = !DILocalVariable(name: "obfuscatedNamePassword", scope: !409, file: !410, line: 173, type: !372)
!482 = !DILocation(line: 173, column: 10, scope: !409)
!483 = !DILocalVariable(name: "directoryPath", scope: !409, file: !410, line: 174, type: !372)
!484 = !DILocation(line: 174, column: 10, scope: !409)
!485 = !DILocalVariable(name: "environmentVariables", scope: !409, file: !410, line: 175, type: !372)
!486 = !DILocation(line: 175, column: 10, scope: !409)
!487 = !DILocalVariable(name: "impersonatingVMWareUser", scope: !409, file: !410, line: 177, type: !459)
!488 = !DILocation(line: 177, column: 9, scope: !409)
!489 = !DILocalVariable(name: "userToken", scope: !409, file: !410, line: 178, type: !321)
!490 = !DILocation(line: 178, column: 10, scope: !409)
!491 = !DILocalVariable(name: "pid", scope: !409, file: !410, line: 179, type: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProcMgr_Pid", file: !493, line: 47, baseType: !494)
!493 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/procMgr.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !366, line: 98, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !496, line: 133, baseType: !337)
!496 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!497 = !DILocation(line: 179, column: 16, scope: !409)
!498 = !DILocalVariable(name: "eventQueue", scope: !409, file: !410, line: 180, type: !340)
!499 = !DILocation(line: 180, column: 15, scope: !409)
!500 = !DILocation(line: 180, column: 44, scope: !409)
!501 = !DILocation(line: 180, column: 50, scope: !409)
!502 = !DILocation(line: 180, column: 29, scope: !409)
!503 = !DILocation(line: 180, column: 59, scope: !409)
!504 = !DILocation(line: 186, column: 49, scope: !409)
!505 = !DILocation(line: 186, column: 55, scope: !409)
!506 = !DILocation(line: 186, column: 62, scope: !409)
!507 = !DILocation(line: 186, column: 68, scope: !409)
!508 = !DILocation(line: 186, column: 18, scope: !409)
!509 = !DILocation(line: 186, column: 16, scope: !409)
!510 = !DILocation(line: 188, column: 48, scope: !409)
!511 = !DILocation(line: 188, column: 54, scope: !409)
!512 = !DILocation(line: 188, column: 61, scope: !409)
!513 = !DILocation(line: 188, column: 67, scope: !409)
!514 = !DILocation(line: 188, column: 10, scope: !409)
!515 = !DILocation(line: 188, column: 8, scope: !409)
!516 = !DILocation(line: 190, column: 8, scope: !517)
!517 = distinct !DILexicalBlock(scope: !409, file: !410, line: 190, column: 8)
!518 = !DILocation(line: 190, column: 12, scope: !517)
!519 = !DILocation(line: 190, column: 8, scope: !409)
!520 = !DILocation(line: 191, column: 7, scope: !521)
!521 = distinct !DILexicalBlock(scope: !517, file: !410, line: 190, column: 23)
!522 = !DILocation(line: 194, column: 48, scope: !409)
!523 = !DILocation(line: 194, column: 54, scope: !409)
!524 = !DILocation(line: 194, column: 61, scope: !409)
!525 = !DILocation(line: 194, column: 67, scope: !409)
!526 = !DILocation(line: 194, column: 10, scope: !409)
!527 = !DILocation(line: 194, column: 8, scope: !409)
!528 = !DILocation(line: 196, column: 8, scope: !529)
!529 = distinct !DILexicalBlock(scope: !409, file: !410, line: 196, column: 8)
!530 = !DILocation(line: 196, column: 12, scope: !529)
!531 = !DILocation(line: 196, column: 8, scope: !409)
!532 = !DILocation(line: 197, column: 7, scope: !533)
!533 = distinct !DILexicalBlock(scope: !529, file: !410, line: 196, column: 23)
!534 = !DILocation(line: 200, column: 55, scope: !409)
!535 = !DILocation(line: 200, column: 61, scope: !409)
!536 = !DILocation(line: 200, column: 68, scope: !409)
!537 = !DILocation(line: 200, column: 74, scope: !409)
!538 = !DILocation(line: 200, column: 24, scope: !409)
!539 = !DILocation(line: 200, column: 22, scope: !409)
!540 = !DILocation(line: 201, column: 60, scope: !409)
!541 = !DILocation(line: 201, column: 66, scope: !409)
!542 = !DILocation(line: 201, column: 73, scope: !409)
!543 = !DILocation(line: 201, column: 79, scope: !409)
!544 = !DILocation(line: 201, column: 29, scope: !409)
!545 = !DILocation(line: 201, column: 27, scope: !409)
!546 = !DILocation(line: 202, column: 51, scope: !409)
!547 = !DILocation(line: 202, column: 57, scope: !409)
!548 = !DILocation(line: 202, column: 64, scope: !409)
!549 = !DILocation(line: 202, column: 70, scope: !409)
!550 = !DILocation(line: 202, column: 20, scope: !409)
!551 = !DILocation(line: 202, column: 18, scope: !409)
!552 = !DILocation(line: 203, column: 58, scope: !409)
!553 = !DILocation(line: 203, column: 64, scope: !409)
!554 = !DILocation(line: 203, column: 71, scope: !409)
!555 = !DILocation(line: 203, column: 77, scope: !409)
!556 = !DILocation(line: 203, column: 27, scope: !409)
!557 = !DILocation(line: 203, column: 25, scope: !409)
!558 = !DILocation(line: 210, column: 16, scope: !559)
!559 = distinct !DILexicalBlock(scope: !409, file: !410, line: 210, column: 8)
!560 = !DILocation(line: 210, column: 13, scope: !559)
!561 = !DILocation(line: 210, column: 29, scope: !559)
!562 = !DILocation(line: 210, column: 41, scope: !563)
!563 = !DILexicalBlockFile(scope: !559, file: !410, discriminator: 1)
!564 = !DILocation(line: 210, column: 38, scope: !563)
!565 = !DILocation(line: 210, column: 8, scope: !563)
!566 = !DILocation(line: 211, column: 11, scope: !567)
!567 = distinct !DILexicalBlock(scope: !559, file: !410, line: 210, column: 55)
!568 = !DILocation(line: 212, column: 7, scope: !567)
!569 = !DILocation(line: 215, column: 16, scope: !570)
!570 = distinct !DILexicalBlock(scope: !409, file: !410, line: 215, column: 8)
!571 = !DILocation(line: 215, column: 13, scope: !570)
!572 = !DILocation(line: 216, column: 10, scope: !570)
!573 = !DILocation(line: 216, column: 15, scope: !574)
!574 = !DILexicalBlockFile(scope: !570, file: !410, discriminator: 1)
!575 = !DILocation(line: 216, column: 14, scope: !574)
!576 = !DILocation(line: 216, column: 13, scope: !574)
!577 = !DILocation(line: 217, column: 10, scope: !570)
!578 = !DILocation(line: 217, column: 14, scope: !574)
!579 = !DILocation(line: 217, column: 13, scope: !574)
!580 = !DILocation(line: 215, column: 8, scope: !581)
!581 = !DILexicalBlockFile(scope: !409, file: !410, discriminator: 1)
!582 = !DILocation(line: 218, column: 61, scope: !583)
!583 = distinct !DILexicalBlock(scope: !570, file: !410, line: 217, column: 38)
!584 = !DILocation(line: 220, column: 61, scope: !583)
!585 = !DILocation(line: 218, column: 33, scope: !583)
!586 = !DILocation(line: 218, column: 31, scope: !583)
!587 = !DILocation(line: 222, column: 12, scope: !588)
!588 = distinct !DILexicalBlock(scope: !583, file: !410, line: 222, column: 11)
!589 = !DILocation(line: 222, column: 11, scope: !583)
!590 = !DILocation(line: 223, column: 14, scope: !591)
!591 = distinct !DILexicalBlock(scope: !588, file: !410, line: 222, column: 37)
!592 = !DILocation(line: 224, column: 10, scope: !591)
!593 = !DILocation(line: 226, column: 4, scope: !583)
!594 = !DILocation(line: 228, column: 33, scope: !409)
!595 = !DILocation(line: 229, column: 33, scope: !409)
!596 = !DILocation(line: 230, column: 33, scope: !409)
!597 = !DILocation(line: 232, column: 33, scope: !409)
!598 = !DILocation(line: 233, column: 33, scope: !409)
!599 = !DILocation(line: 234, column: 33, scope: !409)
!600 = !DILocation(line: 228, column: 10, scope: !409)
!601 = !DILocation(line: 228, column: 8, scope: !409)
!602 = !DILocation(line: 228, column: 4, scope: !409)
!603 = !DILocation(line: 237, column: 8, scope: !604)
!604 = distinct !DILexicalBlock(scope: !409, file: !410, line: 237, column: 8)
!605 = !DILocation(line: 237, column: 8, scope: !409)
!606 = !DILocation(line: 238, column: 33, scope: !607)
!607 = distinct !DILexicalBlock(scope: !604, file: !410, line: 237, column: 33)
!608 = !DILocation(line: 238, column: 7, scope: !607)
!609 = !DILocation(line: 239, column: 4, scope: !607)
!610 = !DILocation(line: 240, column: 23, scope: !409)
!611 = !DILocation(line: 240, column: 4, scope: !409)
!612 = !DILocation(line: 249, column: 16, scope: !409)
!613 = !DILocation(line: 250, column: 17, scope: !409)
!614 = !DILocation(line: 250, column: 16, scope: !409)
!615 = !DILocation(line: 251, column: 24, scope: !409)
!616 = !DILocation(line: 251, column: 16, scope: !409)
!617 = !DILocation(line: 246, column: 4, scope: !409)
!618 = !DILocation(line: 252, column: 26, scope: !409)
!619 = !DILocation(line: 252, column: 4, scope: !409)
!620 = !DILocation(line: 257, column: 9, scope: !409)
!621 = !DILocation(line: 257, column: 4, scope: !409)
!622 = !DILocation(line: 258, column: 9, scope: !409)
!623 = !DILocation(line: 258, column: 4, scope: !409)
!624 = !DILocation(line: 259, column: 9, scope: !409)
!625 = !DILocation(line: 259, column: 4, scope: !409)
!626 = !DILocation(line: 260, column: 9, scope: !409)
!627 = !DILocation(line: 260, column: 4, scope: !409)
!628 = !DILocation(line: 261, column: 9, scope: !409)
!629 = !DILocation(line: 261, column: 4, scope: !409)
!630 = !DILocation(line: 262, column: 9, scope: !409)
!631 = !DILocation(line: 262, column: 4, scope: !409)
!632 = !DILocation(line: 263, column: 9, scope: !409)
!633 = !DILocation(line: 263, column: 4, scope: !409)
!634 = !DILocation(line: 265, column: 4, scope: !409)
!635 = distinct !DISubprogram(name: "ToolsDaemonTcloGetQuotedString", scope: !410, file: !410, line: 446, type: !636, isLocal: true, isDefinition: true, scopeLine: 448, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !427)
!636 = !DISubroutineType(types: !637)
!637 = !{!372, !358, !357}
!638 = !DILocalVariable(name: "args", arg: 1, scope: !635, file: !410, line: 446, type: !358)
!639 = !DILocation(line: 446, column: 44, scope: !635)
!640 = !DILocalVariable(name: "endOfArg", arg: 2, scope: !635, file: !410, line: 447, type: !357)
!641 = !DILocation(line: 447, column: 45, scope: !635)
!642 = !DILocalVariable(name: "resultStr", scope: !635, file: !410, line: 449, type: !372)
!643 = !DILocation(line: 449, column: 10, scope: !635)
!644 = !DILocalVariable(name: "endStr", scope: !635, file: !410, line: 450, type: !372)
!645 = !DILocation(line: 450, column: 10, scope: !635)
!646 = !DILocation(line: 452, column: 4, scope: !635)
!647 = !DILocation(line: 452, column: 13, scope: !648)
!648 = !DILexicalBlockFile(scope: !635, file: !410, discriminator: 1)
!649 = !DILocation(line: 452, column: 12, scope: !648)
!650 = !DILocation(line: 452, column: 11, scope: !648)
!651 = !DILocation(line: 452, column: 19, scope: !648)
!652 = !DILocation(line: 452, column: 32, scope: !653)
!653 = !DILexicalBlockFile(scope: !635, file: !410, discriminator: 2)
!654 = !DILocation(line: 452, column: 31, scope: !653)
!655 = !DILocation(line: 452, column: 28, scope: !653)
!656 = !DILocation(line: 452, column: 4, scope: !657)
!657 = !DILexicalBlockFile(scope: !635, file: !410, discriminator: 3)
!658 = !DILocation(line: 453, column: 11, scope: !659)
!659 = distinct !DILexicalBlock(scope: !635, file: !410, line: 452, column: 39)
!660 = !DILocation(line: 452, column: 4, scope: !661)
!661 = !DILexicalBlockFile(scope: !635, file: !410, discriminator: 4)
!662 = distinct !{!662, !646}
!663 = !DILocation(line: 455, column: 17, scope: !664)
!664 = distinct !DILexicalBlock(scope: !635, file: !410, line: 455, column: 8)
!665 = !DILocation(line: 455, column: 16, scope: !664)
!666 = !DILocation(line: 455, column: 13, scope: !664)
!667 = !DILocation(line: 455, column: 8, scope: !635)
!668 = !DILocation(line: 456, column: 11, scope: !669)
!669 = distinct !DILexicalBlock(scope: !664, file: !410, line: 455, column: 23)
!670 = !DILocation(line: 457, column: 4, scope: !669)
!671 = !DILocation(line: 459, column: 33, scope: !635)
!672 = !DILocation(line: 459, column: 16, scope: !635)
!673 = !DILocation(line: 459, column: 14, scope: !635)
!674 = !DILocation(line: 461, column: 13, scope: !635)
!675 = !DILocation(line: 461, column: 11, scope: !635)
!676 = !DILocation(line: 462, column: 4, scope: !635)
!677 = !DILocation(line: 462, column: 12, scope: !648)
!678 = !DILocation(line: 462, column: 11, scope: !648)
!679 = !DILocation(line: 462, column: 4, scope: !648)
!680 = !DILocation(line: 463, column: 21, scope: !681)
!681 = distinct !DILexicalBlock(scope: !682, file: !410, line: 463, column: 11)
!682 = distinct !DILexicalBlock(scope: !635, file: !410, line: 462, column: 20)
!683 = !DILocation(line: 463, column: 20, scope: !681)
!684 = !DILocation(line: 463, column: 17, scope: !681)
!685 = !DILocation(line: 463, column: 29, scope: !681)
!686 = !DILocation(line: 463, column: 35, scope: !687)
!687 = !DILexicalBlockFile(scope: !681, file: !410, discriminator: 1)
!688 = !DILocation(line: 463, column: 42, scope: !687)
!689 = !DILocation(line: 463, column: 33, scope: !687)
!690 = !DILocation(line: 463, column: 32, scope: !687)
!691 = !DILocation(line: 463, column: 11, scope: !687)
!692 = !DILocation(line: 464, column: 17, scope: !693)
!693 = distinct !DILexicalBlock(scope: !681, file: !410, line: 463, column: 49)
!694 = !DILocation(line: 465, column: 7, scope: !693)
!695 = !DILocation(line: 465, column: 27, scope: !696)
!696 = !DILexicalBlockFile(scope: !697, file: !410, discriminator: 1)
!697 = distinct !DILexicalBlock(scope: !681, file: !410, line: 465, column: 18)
!698 = !DILocation(line: 465, column: 26, scope: !696)
!699 = !DILocation(line: 465, column: 23, scope: !696)
!700 = !DILocation(line: 465, column: 18, scope: !696)
!701 = !DILocation(line: 466, column: 11, scope: !702)
!702 = distinct !DILexicalBlock(scope: !697, file: !410, line: 465, column: 35)
!703 = !DILocation(line: 466, column: 18, scope: !702)
!704 = !DILocation(line: 467, column: 16, scope: !702)
!705 = !DILocation(line: 468, column: 10, scope: !702)
!706 = !DILocation(line: 470, column: 16, scope: !707)
!707 = distinct !DILexicalBlock(scope: !697, file: !410, line: 469, column: 14)
!708 = !DILocation(line: 462, column: 4, scope: !653)
!709 = distinct !{!709, !676}
!710 = !DILocation(line: 474, column: 15, scope: !711)
!711 = distinct !DILexicalBlock(scope: !635, file: !410, line: 474, column: 7)
!712 = !DILocation(line: 474, column: 12, scope: !711)
!713 = !DILocation(line: 474, column: 7, scope: !635)
!714 = !DILocation(line: 475, column: 16, scope: !715)
!715 = distinct !DILexicalBlock(scope: !711, file: !410, line: 474, column: 25)
!716 = !DILocation(line: 475, column: 25, scope: !715)
!717 = !DILocation(line: 475, column: 23, scope: !715)
!718 = !DILocation(line: 475, column: 12, scope: !715)
!719 = !DILocation(line: 476, column: 7, scope: !715)
!720 = !DILocation(line: 476, column: 22, scope: !721)
!721 = !DILexicalBlockFile(scope: !715, file: !410, discriminator: 1)
!722 = !DILocation(line: 476, column: 21, scope: !721)
!723 = !DILocation(line: 476, column: 18, scope: !721)
!724 = !DILocation(line: 476, column: 7, scope: !721)
!725 = !DILocation(line: 477, column: 14, scope: !726)
!726 = distinct !DILexicalBlock(scope: !715, file: !410, line: 476, column: 28)
!727 = !DILocation(line: 476, column: 7, scope: !728)
!728 = !DILexicalBlockFile(scope: !715, file: !410, discriminator: 2)
!729 = distinct !{!729, !719}
!730 = !DILocation(line: 479, column: 19, scope: !715)
!731 = !DILocation(line: 479, column: 8, scope: !715)
!732 = !DILocation(line: 479, column: 17, scope: !715)
!733 = !DILocation(line: 480, column: 4, scope: !715)
!734 = !DILocation(line: 482, column: 11, scope: !635)
!735 = !DILocation(line: 482, column: 4, scope: !635)
!736 = distinct !DISubprogram(name: "ToolsDaemonTcloGetEncodedQuotedString", scope: !410, file: !410, line: 504, type: !737, isLocal: true, isDefinition: true, scopeLine: 507, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !427)
!737 = !DISubroutineType(types: !738)
!738 = !{!471, !358, !357, !739}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!740 = !DILocalVariable(name: "args", arg: 1, scope: !736, file: !410, line: 504, type: !358)
!741 = !DILocation(line: 504, column: 51, scope: !736)
!742 = !DILocalVariable(name: "endOfArg", arg: 2, scope: !736, file: !410, line: 505, type: !357)
!743 = !DILocation(line: 505, column: 52, scope: !736)
!744 = !DILocalVariable(name: "result", arg: 3, scope: !736, file: !410, line: 506, type: !739)
!745 = !DILocation(line: 506, column: 46, scope: !736)
!746 = !DILocalVariable(name: "err", scope: !736, file: !410, line: 508, type: !471)
!747 = !DILocation(line: 508, column: 13, scope: !736)
!748 = !DILocalVariable(name: "rawResultStr", scope: !736, file: !410, line: 509, type: !372)
!749 = !DILocation(line: 509, column: 10, scope: !736)
!750 = !DILocalVariable(name: "resultStr", scope: !736, file: !410, line: 510, type: !372)
!751 = !DILocation(line: 510, column: 10, scope: !736)
!752 = !DILocation(line: 512, column: 50, scope: !736)
!753 = !DILocation(line: 512, column: 56, scope: !736)
!754 = !DILocation(line: 512, column: 19, scope: !736)
!755 = !DILocation(line: 512, column: 17, scope: !736)
!756 = !DILocation(line: 513, column: 15, scope: !757)
!757 = distinct !DILexicalBlock(scope: !736, file: !410, line: 513, column: 7)
!758 = !DILocation(line: 513, column: 12, scope: !757)
!759 = !DILocation(line: 513, column: 7, scope: !736)
!760 = !DILocation(line: 514, column: 7, scope: !761)
!761 = distinct !DILexicalBlock(scope: !757, file: !410, line: 513, column: 29)
!762 = !DILocation(line: 517, column: 30, scope: !736)
!763 = !DILocation(line: 517, column: 10, scope: !736)
!764 = !DILocation(line: 517, column: 8, scope: !736)
!765 = !DILocation(line: 517, column: 4, scope: !736)
!766 = !DILocation(line: 520, column: 9, scope: !736)
!767 = !DILocation(line: 520, column: 4, scope: !736)
!768 = !DILocation(line: 521, column: 14, scope: !736)
!769 = !DILocation(line: 521, column: 5, scope: !736)
!770 = !DILocation(line: 521, column: 12, scope: !736)
!771 = !DILocation(line: 523, column: 11, scope: !736)
!772 = !DILocation(line: 523, column: 4, scope: !736)
!773 = !DILocalVariable(name: "data", arg: 1, scope: !432, file: !410, line: 287, type: !413)
!774 = !DILocation(line: 287, column: 49, scope: !432)
!775 = !DILocalVariable(name: "err", scope: !432, file: !410, line: 289, type: !471)
!776 = !DILocation(line: 289, column: 13, scope: !432)
!777 = !DILocalVariable(name: "additionalError", scope: !432, file: !410, line: 290, type: !337)
!778 = !DILocation(line: 290, column: 8, scope: !432)
!779 = !DILocalVariable(name: "serializedBuffer", scope: !432, file: !410, line: 292, type: !372)
!780 = !DILocation(line: 292, column: 10, scope: !432)
!781 = !DILocalVariable(name: "serializedBufferLength", scope: !432, file: !410, line: 293, type: !420)
!782 = !DILocation(line: 293, column: 11, scope: !432)
!783 = !DILocalVariable(name: "base64Buffer", scope: !432, file: !410, line: 294, type: !372)
!784 = !DILocation(line: 294, column: 10, scope: !432)
!785 = !DILocalVariable(name: "base64BufferLength", scope: !432, file: !410, line: 295, type: !420)
!786 = !DILocation(line: 295, column: 11, scope: !432)
!787 = !DILocalVariable(name: "success", scope: !432, file: !410, line: 296, type: !459)
!788 = !DILocation(line: 296, column: 9, scope: !432)
!789 = !DILocalVariable(name: "returnBuffer", scope: !432, file: !410, line: 297, type: !372)
!790 = !DILocation(line: 297, column: 10, scope: !432)
!791 = !DILocalVariable(name: "confDictRef", scope: !432, file: !410, line: 298, type: !350)
!792 = !DILocation(line: 298, column: 14, scope: !432)
!793 = !DILocation(line: 303, column: 18, scope: !432)
!794 = !DILocation(line: 303, column: 24, scope: !432)
!795 = !DILocation(line: 303, column: 16, scope: !432)
!796 = !DILocation(line: 305, column: 42, scope: !432)
!797 = !DILocation(line: 305, column: 10, scope: !432)
!798 = !DILocation(line: 305, column: 8, scope: !432)
!799 = !DILocation(line: 308, column: 18, scope: !800)
!800 = distinct !DILexicalBlock(scope: !432, file: !410, line: 308, column: 8)
!801 = !DILocation(line: 308, column: 15, scope: !800)
!802 = !DILocation(line: 308, column: 8, scope: !432)
!803 = !DILocation(line: 309, column: 49, scope: !804)
!804 = distinct !DILexicalBlock(scope: !800, file: !410, line: 308, column: 23)
!805 = !DILocation(line: 309, column: 67, scope: !804)
!806 = !DILocation(line: 309, column: 28, scope: !804)
!807 = !DILocation(line: 309, column: 91, scope: !804)
!808 = !DILocation(line: 309, column: 26, scope: !804)
!809 = !DILocation(line: 310, column: 39, scope: !804)
!810 = !DILocation(line: 310, column: 22, scope: !804)
!811 = !DILocation(line: 310, column: 20, scope: !804)
!812 = !DILocation(line: 311, column: 31, scope: !804)
!813 = !DILocation(line: 312, column: 31, scope: !804)
!814 = !DILocation(line: 313, column: 31, scope: !804)
!815 = !DILocation(line: 314, column: 31, scope: !804)
!816 = !DILocation(line: 311, column: 17, scope: !804)
!817 = !DILocation(line: 311, column: 15, scope: !804)
!818 = !DILocation(line: 316, column: 12, scope: !819)
!819 = distinct !DILexicalBlock(scope: !804, file: !410, line: 316, column: 11)
!820 = !DILocation(line: 316, column: 11, scope: !804)
!821 = !DILocation(line: 317, column: 10, scope: !822)
!822 = distinct !DILexicalBlock(scope: !819, file: !410, line: 316, column: 21)
!823 = !DILocation(line: 317, column: 26, scope: !822)
!824 = !DILocation(line: 318, column: 14, scope: !822)
!825 = !DILocation(line: 319, column: 10, scope: !822)
!826 = !DILocation(line: 321, column: 20, scope: !804)
!827 = !DILocation(line: 321, column: 7, scope: !804)
!828 = !DILocation(line: 321, column: 40, scope: !804)
!829 = !DILocation(line: 322, column: 4, scope: !804)
!830 = !DILocation(line: 308, column: 18, scope: !831)
!831 = !DILexicalBlockFile(scope: !800, file: !410, discriminator: 1)
!832 = !DILocation(line: 326, column: 19, scope: !432)
!833 = !DILocation(line: 326, column: 17, scope: !432)
!834 = !DILocation(line: 327, column: 15, scope: !835)
!835 = distinct !DILexicalBlock(scope: !432, file: !410, line: 327, column: 7)
!836 = !DILocation(line: 327, column: 12, scope: !835)
!837 = !DILocation(line: 327, column: 7, scope: !432)
!838 = !DILocation(line: 328, column: 20, scope: !839)
!839 = distinct !DILexicalBlock(scope: !835, file: !410, line: 327, column: 29)
!840 = !DILocation(line: 329, column: 4, scope: !839)
!841 = !DILocation(line: 330, column: 18, scope: !842)
!842 = distinct !DILexicalBlock(scope: !432, file: !410, line: 330, column: 8)
!843 = !DILocation(line: 330, column: 15, scope: !842)
!844 = !DILocation(line: 330, column: 8, scope: !432)
!845 = !DILocation(line: 331, column: 26, scope: !846)
!846 = distinct !DILexicalBlock(scope: !842, file: !410, line: 330, column: 23)
!847 = !DILocation(line: 331, column: 25, scope: !846)
!848 = !DILocation(line: 331, column: 23, scope: !846)
!849 = !DILocation(line: 332, column: 4, scope: !846)
!850 = !DILocation(line: 341, column: 16, scope: !432)
!851 = !DILocation(line: 342, column: 16, scope: !432)
!852 = !DILocation(line: 343, column: 16, scope: !432)
!853 = !DILocation(line: 338, column: 4, scope: !432)
!854 = !DILocation(line: 344, column: 26, scope: !432)
!855 = !DILocation(line: 344, column: 4, scope: !432)
!856 = !DILocation(line: 346, column: 9, scope: !432)
!857 = !DILocation(line: 346, column: 4, scope: !432)
!858 = !DILocation(line: 347, column: 9, scope: !432)
!859 = !DILocation(line: 347, column: 4, scope: !432)
!860 = !DILocation(line: 349, column: 4, scope: !432)
!861 = distinct !DISubprogram(name: "FoundryToolsDaemon_Initialize", scope: !410, file: !410, line: 360, type: !862, isLocal: false, isDefinition: true, scopeLine: 361, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !427)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !322}
!864 = !DILocalVariable(name: "ctx", arg: 1, scope: !861, file: !410, line: 360, type: !322)
!865 = !DILocation(line: 360, column: 44, scope: !861)
!866 = !DILocation(line: 362, column: 37, scope: !861)
!867 = !DILocation(line: 362, column: 43, scope: !861)
!868 = !DILocation(line: 362, column: 29, scope: !861)
!869 = !DILocation(line: 362, column: 58, scope: !861)
!870 = !DILocation(line: 362, column: 28, scope: !861)
!871 = !DILocation(line: 362, column: 26, scope: !861)
!872 = !DILocation(line: 369, column: 31, scope: !861)
!873 = !DILocation(line: 376, column: 31, scope: !861)
!874 = !DILocation(line: 369, column: 11, scope: !861)
!875 = !DILocation(line: 379, column: 8, scope: !876)
!876 = distinct !DILexicalBlock(scope: !861, file: !410, line: 379, column: 8)
!877 = !DILocation(line: 379, column: 8, scope: !861)
!878 = !DILocation(line: 380, column: 7, scope: !879)
!879 = distinct !DILexicalBlock(scope: !876, file: !410, line: 379, column: 31)
!880 = !DILocation(line: 381, column: 4, scope: !879)
!881 = !DILocation(line: 385, column: 4, scope: !861)
!882 = distinct !{!882, !881}
!883 = !DILocation(line: 385, column: 42, scope: !884)
!884 = !DILexicalBlockFile(scope: !885, file: !410, discriminator: 1)
!885 = distinct !DILexicalBlock(scope: !861, file: !410, line: 385, column: 7)
!886 = !DILocation(line: 385, column: 103, scope: !884)
!887 = !DILocation(line: 385, column: 43, scope: !884)
!888 = !DILocation(line: 385, column: 5, scope: !884)
!889 = !DILocation(line: 389, column: 4, scope: !861)
!890 = !DILocation(line: 391, column: 1, scope: !861)
!891 = distinct !DISubprogram(name: "ToolsDaemonTcloReportProgramCompleted", scope: !410, file: !410, line: 1161, type: !892, isLocal: false, isDefinition: true, scopeLine: 1166, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !427)
!892 = !DISubroutineType(types: !893)
!893 = !{null, !358, !471, !337, !363, !321}
!894 = !DILocalVariable(name: "requestName", arg: 1, scope: !891, file: !410, line: 1161, type: !358)
!895 = !DILocation(line: 1161, column: 51, scope: !891)
!896 = !DILocalVariable(name: "err", arg: 2, scope: !891, file: !410, line: 1162, type: !471)
!897 = !DILocation(line: 1162, column: 48, scope: !891)
!898 = !DILocalVariable(name: "exitCode", arg: 3, scope: !891, file: !410, line: 1163, type: !337)
!899 = !DILocation(line: 1163, column: 43, scope: !891)
!900 = !DILocalVariable(name: "pid", arg: 4, scope: !891, file: !410, line: 1164, type: !363)
!901 = !DILocation(line: 1164, column: 45, scope: !891)
!902 = !DILocalVariable(name: "clientData", arg: 5, scope: !891, file: !410, line: 1165, type: !321)
!903 = !DILocation(line: 1165, column: 45, scope: !891)
!904 = !DILocalVariable(name: "sentResult", scope: !891, file: !410, line: 1167, type: !459)
!905 = !DILocation(line: 1167, column: 9, scope: !891)
!906 = !DILocalVariable(name: "ctx", scope: !891, file: !410, line: 1168, type: !322)
!907 = !DILocation(line: 1168, column: 17, scope: !891)
!908 = !DILocation(line: 1168, column: 23, scope: !891)
!909 = !DILocalVariable(name: "msg", scope: !891, file: !410, line: 1169, type: !910)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!911 = !DILocation(line: 1169, column: 11, scope: !891)
!912 = !DILocation(line: 1171, column: 33, scope: !891)
!913 = !DILocation(line: 1172, column: 33, scope: !891)
!914 = !DILocation(line: 1173, column: 34, scope: !891)
!915 = !DILocation(line: 1173, column: 33, scope: !891)
!916 = !DILocation(line: 1174, column: 33, scope: !891)
!917 = !DILocation(line: 1175, column: 41, scope: !891)
!918 = !DILocation(line: 1169, column: 17, scope: !891)
!919 = !DILocation(line: 1177, column: 33, scope: !891)
!920 = !DILocation(line: 1177, column: 38, scope: !891)
!921 = !DILocation(line: 1177, column: 43, scope: !891)
!922 = !DILocation(line: 1177, column: 55, scope: !891)
!923 = !DILocation(line: 1177, column: 48, scope: !891)
!924 = !DILocation(line: 1177, column: 60, scope: !891)
!925 = !DILocation(line: 1177, column: 17, scope: !926)
!926 = !DILexicalBlockFile(scope: !891, file: !410, discriminator: 1)
!927 = !DILocation(line: 1177, column: 17, scope: !891)
!928 = !DILocation(line: 1177, column: 15, scope: !891)
!929 = !DILocation(line: 1178, column: 11, scope: !891)
!930 = !DILocation(line: 1178, column: 4, scope: !891)
!931 = !DILocation(line: 1180, column: 9, scope: !932)
!932 = distinct !DILexicalBlock(scope: !891, file: !410, line: 1180, column: 8)
!933 = !DILocation(line: 1180, column: 8, scope: !891)
!934 = !DILocation(line: 1181, column: 7, scope: !935)
!935 = distinct !DILexicalBlock(scope: !932, file: !410, line: 1180, column: 21)
!936 = !DILocation(line: 1183, column: 4, scope: !935)
!937 = !DILocation(line: 1184, column: 1, scope: !891)
!938 = distinct !DISubprogram(name: "FoundryToolsDaemon_Uninitialize", scope: !410, file: !410, line: 401, type: !862, isLocal: false, isDefinition: true, scopeLine: 402, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !427)
!939 = !DILocalVariable(name: "ctx", arg: 1, scope: !938, file: !410, line: 401, type: !322)
!940 = !DILocation(line: 401, column: 46, scope: !938)
!941 = !DILocation(line: 403, column: 4, scope: !938)
!942 = !DILocation(line: 404, column: 4, scope: !938)
!943 = !DILocation(line: 405, column: 1, scope: !938)
!944 = distinct !DISubprogram(name: "FoundryToolsDaemon_RestrictVixCommands", scope: !410, file: !410, line: 416, type: !945, isLocal: false, isDefinition: true, scopeLine: 417, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !427)
!945 = !DISubroutineType(types: !946)
!946 = !{null, !322, !335}
!947 = !DILocalVariable(name: "ctx", arg: 1, scope: !944, file: !410, line: 416, type: !322)
!948 = !DILocation(line: 416, column: 53, scope: !944)
!949 = !DILocalVariable(name: "restricted", arg: 2, scope: !944, file: !410, line: 416, type: !335)
!950 = !DILocation(line: 416, column: 67, scope: !944)
!951 = !DILocation(line: 418, column: 30, scope: !944)
!952 = !DILocation(line: 418, column: 4, scope: !944)
!953 = !DILocation(line: 419, column: 1, scope: !944)
!954 = !DILocalVariable(name: "data", arg: 1, scope: !434, file: !410, line: 546, type: !413)
!955 = !DILocation(line: 546, column: 44, scope: !434)
!956 = !DILocalVariable(name: "err", scope: !434, file: !410, line: 549, type: !471)
!957 = !DILocation(line: 549, column: 13, scope: !434)
!958 = !DILocalVariable(name: "driveList", scope: !434, file: !410, line: 550, type: !372)
!959 = !DILocation(line: 550, column: 10, scope: !434)
!960 = !DILocalVariable(name: "timeout", scope: !434, file: !410, line: 551, type: !372)
!961 = !DILocation(line: 551, column: 10, scope: !434)
!962 = !DILocalVariable(name: "timeoutVal", scope: !434, file: !410, line: 552, type: !337)
!963 = !DILocation(line: 552, column: 8, scope: !434)
!964 = !DILocalVariable(name: "sysError", scope: !434, file: !410, line: 553, type: !337)
!965 = !DILocation(line: 553, column: 8, scope: !434)
!966 = !DILocalVariable(name: "ctx", scope: !434, file: !410, line: 554, type: !322)
!967 = !DILocation(line: 554, column: 17, scope: !434)
!968 = !DILocation(line: 554, column: 23, scope: !434)
!969 = !DILocation(line: 554, column: 29, scope: !434)
!970 = !DILocalVariable(name: "confDictRef", scope: !434, file: !410, line: 555, type: !350)
!971 = !DILocation(line: 555, column: 14, scope: !434)
!972 = !DILocation(line: 555, column: 28, scope: !434)
!973 = !DILocation(line: 555, column: 33, scope: !434)
!974 = !DILocalVariable(name: "enableNullDriver", scope: !434, file: !410, line: 556, type: !459)
!975 = !DILocation(line: 556, column: 9, scope: !434)
!976 = !DILocalVariable(name: "timer", scope: !434, file: !410, line: 557, type: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !342, line: 64, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !342, line: 171, size: 768, align: 64, elements: !980)
!980 = !{!981, !982, !998, !1027, !1029, !1033, !1034, !1035, !1036, !1044, !1045, !1046, !1047}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !979, file: !342, line: 174, baseType: !361, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !979, file: !342, line: 175, baseType: !983, size: 64, align: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !342, line: 77, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !342, line: 196, size: 192, align: 64, elements: !986)
!986 = !{!987, !991, !992}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !985, file: !342, line: 198, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{null, !361}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !985, file: !342, line: 199, baseType: !988, size: 64, align: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !985, file: !342, line: 200, baseType: !993, size: 64, align: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{null, !361, !977, !996, !997}
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !979, file: !342, line: 177, baseType: !999, size: 64, align: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !342, line: 130, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !342, line: 214, size: 384, align: 64, elements: !1003)
!1003 = !{!1004, !1009, !1013, !1017, !1021, !1022}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !1002, file: !342, line: 216, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!335, !977, !1008}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !1002, file: !342, line: 218, baseType: !1010, size: 64, align: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!335, !977}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !1002, file: !342, line: 219, baseType: !1014, size: 64, align: 64, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!335, !977, !368, !361}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !1002, file: !342, line: 222, baseType: !1018, size: 64, align: 64, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{null, !977}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !1002, file: !342, line: 226, baseType: !368, size: 64, align: 64, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !1002, file: !342, line: 227, baseType: !1023, size: 64, align: 64, offset: 320)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !342, line: 212, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !979, file: !342, line: 178, baseType: !1028, size: 32, align: 32, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !332, line: 55, baseType: !385)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !979, file: !342, line: 180, baseType: !1030, size: 64, align: 64, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !342, line: 48, baseType: !1032)
!1032 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !342, line: 48, flags: DIFlagFwdDecl)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !979, file: !342, line: 182, baseType: !336, size: 32, align: 32, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !979, file: !342, line: 183, baseType: !1028, size: 32, align: 32, offset: 352)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !979, file: !342, line: 184, baseType: !1028, size: 32, align: 32, offset: 384)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !979, file: !342, line: 186, baseType: !1037, size: 64, align: 64, offset: 448)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !1039, line: 37, baseType: !1040)
!1039 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !1039, line: 39, size: 128, align: 64, elements: !1041)
!1041 = !{!1042, !1043}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1040, file: !1039, line: 41, baseType: !361, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1040, file: !1039, line: 42, baseType: !1037, size: 64, align: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !979, file: !342, line: 188, baseType: !977, size: 64, align: 64, offset: 512)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !979, file: !342, line: 189, baseType: !977, size: 64, align: 64, offset: 576)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !979, file: !342, line: 191, baseType: !372, size: 64, align: 64, offset: 640)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !979, file: !342, line: 193, baseType: !1048, size: 64, align: 64, offset: 704)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !342, line: 65, baseType: !1050)
!1050 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !342, line: 65, flags: DIFlagFwdDecl)
!1051 = !DILocation(line: 557, column: 13, scope: !434)
!1052 = !DILocation(line: 562, column: 47, scope: !434)
!1053 = !DILocation(line: 562, column: 53, scope: !434)
!1054 = !DILocation(line: 562, column: 60, scope: !434)
!1055 = !DILocation(line: 562, column: 66, scope: !434)
!1056 = !DILocation(line: 562, column: 16, scope: !434)
!1057 = !DILocation(line: 562, column: 14, scope: !434)
!1058 = !DILocation(line: 563, column: 45, scope: !434)
!1059 = !DILocation(line: 563, column: 51, scope: !434)
!1060 = !DILocation(line: 563, column: 58, scope: !434)
!1061 = !DILocation(line: 563, column: 64, scope: !434)
!1062 = !DILocation(line: 563, column: 14, scope: !434)
!1063 = !DILocation(line: 563, column: 12, scope: !434)
!1064 = !DILocation(line: 568, column: 15, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !434, file: !410, line: 568, column: 7)
!1066 = !DILocation(line: 568, column: 12, scope: !1065)
!1067 = !DILocation(line: 568, column: 25, scope: !1065)
!1068 = !DILocation(line: 568, column: 36, scope: !1069)
!1069 = !DILexicalBlockFile(scope: !1065, file: !410, discriminator: 1)
!1070 = !DILocation(line: 568, column: 33, scope: !1069)
!1071 = !DILocation(line: 568, column: 7, scope: !1069)
!1072 = !DILocation(line: 569, column: 11, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1065, file: !410, line: 568, column: 45)
!1074 = !DILocation(line: 570, column: 7, scope: !1073)
!1075 = !DILocation(line: 571, column: 7, scope: !1073)
!1076 = !DILocation(line: 574, column: 39, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !434, file: !410, line: 574, column: 8)
!1078 = !DILocation(line: 574, column: 9, scope: !1077)
!1079 = !DILocation(line: 574, column: 48, scope: !1077)
!1080 = !DILocation(line: 574, column: 51, scope: !1081)
!1081 = !DILexicalBlockFile(scope: !1077, file: !410, discriminator: 1)
!1082 = !DILocation(line: 574, column: 62, scope: !1081)
!1083 = !DILocation(line: 574, column: 8, scope: !1081)
!1084 = !DILocation(line: 575, column: 88, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1077, file: !410, line: 574, column: 67)
!1086 = !DILocation(line: 575, column: 7, scope: !1085)
!1087 = !DILocation(line: 577, column: 11, scope: !1085)
!1088 = !DILocation(line: 578, column: 7, scope: !1085)
!1089 = !DILocation(line: 581, column: 99, scope: !434)
!1090 = !DILocation(line: 581, column: 110, scope: !434)
!1091 = !DILocation(line: 581, column: 4, scope: !434)
!1092 = !DILocation(line: 585, column: 8, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !434, file: !410, line: 585, column: 8)
!1094 = !DILocation(line: 585, column: 26, scope: !1093)
!1095 = !DILocation(line: 585, column: 8, scope: !434)
!1096 = !DILocation(line: 586, column: 11, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1093, file: !410, line: 585, column: 55)
!1098 = !DILocation(line: 587, column: 7, scope: !1097)
!1099 = !DILocation(line: 590, column: 49, scope: !434)
!1100 = !DILocation(line: 590, column: 23, scope: !434)
!1101 = !DILocation(line: 590, column: 21, scope: !434)
!1102 = !DILocation(line: 596, column: 27, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !434, file: !410, line: 596, column: 8)
!1104 = !DILocation(line: 596, column: 38, scope: !1103)
!1105 = !DILocation(line: 596, column: 9, scope: !1103)
!1106 = !DILocation(line: 597, column: 32, scope: !1103)
!1107 = !DILocation(line: 598, column: 31, scope: !1103)
!1108 = !DILocation(line: 598, column: 8, scope: !1103)
!1109 = !DILocation(line: 598, column: 54, scope: !1103)
!1110 = !DILocation(line: 596, column: 8, scope: !1111)
!1111 = !DILexicalBlockFile(scope: !434, file: !410, discriminator: 1)
!1112 = !DILocation(line: 599, column: 94, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1103, file: !410, line: 598, column: 74)
!1114 = !DILocation(line: 599, column: 7, scope: !1113)
!1115 = !DILocation(line: 601, column: 11, scope: !1113)
!1116 = !DILocation(line: 602, column: 19, scope: !1113)
!1117 = !DILocation(line: 602, column: 18, scope: !1113)
!1118 = !DILocation(line: 602, column: 16, scope: !1113)
!1119 = !DILocation(line: 603, column: 11, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1113, file: !410, line: 603, column: 11)
!1121 = !DILocation(line: 603, column: 29, scope: !1120)
!1122 = !DILocation(line: 603, column: 11, scope: !1113)
!1123 = !DILocation(line: 604, column: 26, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1120, file: !410, line: 603, column: 58)
!1125 = !DILocation(line: 604, column: 10, scope: !1124)
!1126 = !DILocation(line: 605, column: 10, scope: !1124)
!1127 = !DILocation(line: 606, column: 7, scope: !1124)
!1128 = !DILocation(line: 607, column: 7, scope: !1113)
!1129 = !DILocation(line: 611, column: 13, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !434, file: !410, line: 611, column: 8)
!1131 = !DILocation(line: 611, column: 10, scope: !1130)
!1132 = !DILocation(line: 611, column: 8, scope: !434)
!1133 = !DILocation(line: 612, column: 90, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1130, file: !410, line: 611, column: 25)
!1135 = !DILocation(line: 612, column: 7, scope: !1134)
!1136 = !DILocation(line: 614, column: 36, scope: !1134)
!1137 = !DILocation(line: 614, column: 47, scope: !1134)
!1138 = !DILocation(line: 614, column: 15, scope: !1134)
!1139 = !DILocation(line: 614, column: 13, scope: !1134)
!1140 = !DILocation(line: 615, column: 7, scope: !1134)
!1141 = distinct !{!1141, !1140}
!1142 = !DILocalVariable(name: "__src", scope: !1143, file: !410, line: 615, type: !977)
!1143 = distinct !DILexicalBlock(scope: !1134, file: !410, line: 615, column: 10)
!1144 = !DILocation(line: 615, column: 21, scope: !1143)
!1145 = !DILocation(line: 615, column: 30, scope: !1146)
!1146 = !DILexicalBlockFile(scope: !1143, file: !410, discriminator: 1)
!1147 = !DILocation(line: 615, column: 21, scope: !1146)
!1148 = !DILocation(line: 615, column: 60, scope: !1146)
!1149 = !DILocation(line: 615, column: 38, scope: !1146)
!1150 = !DILocation(line: 615, column: 26, scope: !1146)
!1151 = !DILocation(line: 615, column: 58, scope: !1146)
!1152 = !DILocation(line: 615, column: 64, scope: !1146)
!1153 = !DILocation(line: 615, column: 33, scope: !1154)
!1154 = !DILexicalBlockFile(scope: !1146, file: !410, discriminator: 2)
!1155 = !DILocation(line: 615, column: 10, scope: !1156)
!1156 = !DILexicalBlockFile(scope: !1146, file: !410, discriminator: 3)
!1157 = !DILocation(line: 615, column: 76, scope: !1146)
!1158 = !DILocation(line: 616, column: 22, scope: !1134)
!1159 = !DILocation(line: 616, column: 7, scope: !1134)
!1160 = !DILocation(line: 617, column: 4, scope: !1134)
!1161 = !DILocation(line: 611, column: 13, scope: !1162)
!1162 = !DILexicalBlockFile(scope: !1130, file: !410, discriminator: 1)
!1163 = !DILocation(line: 623, column: 9, scope: !434)
!1164 = !DILocation(line: 623, column: 4, scope: !434)
!1165 = !DILocation(line: 624, column: 9, scope: !434)
!1166 = !DILocation(line: 624, column: 4, scope: !434)
!1167 = !DILocation(line: 630, column: 65, scope: !434)
!1168 = !DILocation(line: 630, column: 70, scope: !434)
!1169 = !DILocation(line: 630, column: 4, scope: !434)
!1170 = !DILocation(line: 631, column: 4, scope: !434)
!1171 = !DILocation(line: 632, column: 33, scope: !434)
!1172 = !DILocation(line: 632, column: 11, scope: !434)
!1173 = !DILocation(line: 632, column: 4, scope: !434)
!1174 = distinct !DISubprogram(name: "ToolsDaemonSyncDriverThawCallback", scope: !410, file: !410, line: 656, type: !1175, isLocal: true, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !427)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!459, !321}
!1177 = !DILocalVariable(name: "clientData", arg: 1, scope: !1174, file: !410, line: 656, type: !321)
!1178 = !DILocation(line: 656, column: 41, scope: !1174)
!1179 = !DILocation(line: 658, column: 4, scope: !1174)
!1180 = !DILocation(line: 660, column: 8, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1174, file: !410, line: 660, column: 8)
!1182 = !DILocation(line: 660, column: 26, scope: !1181)
!1183 = !DILocation(line: 660, column: 8, scope: !1174)
!1184 = !DILocation(line: 661, column: 7, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1181, file: !410, line: 660, column: 55)
!1186 = !DILocation(line: 662, column: 7, scope: !1185)
!1187 = !DILocation(line: 664, column: 25, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1174, file: !410, line: 664, column: 8)
!1189 = !DILocation(line: 664, column: 9, scope: !1188)
!1190 = !DILocation(line: 664, column: 8, scope: !1174)
!1191 = !DILocation(line: 665, column: 7, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1188, file: !410, line: 664, column: 45)
!1193 = !DILocation(line: 666, column: 4, scope: !1192)
!1194 = !DILocation(line: 664, column: 42, scope: !1195)
!1195 = !DILexicalBlockFile(scope: !1188, file: !410, discriminator: 1)
!1196 = !DILocation(line: 669, column: 4, scope: !1174)
!1197 = !DILocation(line: 670, column: 4, scope: !1174)
!1198 = !DILocalVariable(name: "data", arg: 1, scope: !436, file: !410, line: 694, type: !413)
!1199 = !DILocation(line: 694, column: 42, scope: !436)
!1200 = !DILocalVariable(name: "err", scope: !436, file: !410, line: 697, type: !471)
!1201 = !DILocation(line: 697, column: 13, scope: !436)
!1202 = !DILocalVariable(name: "sysError", scope: !436, file: !410, line: 698, type: !337)
!1203 = !DILocation(line: 698, column: 8, scope: !436)
!1204 = !DILocation(line: 704, column: 4, scope: !436)
!1205 = !DILocation(line: 706, column: 8, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !436, file: !410, line: 706, column: 8)
!1207 = !DILocation(line: 706, column: 26, scope: !1206)
!1208 = !DILocation(line: 706, column: 8, scope: !436)
!1209 = !DILocation(line: 707, column: 11, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1206, file: !410, line: 706, column: 55)
!1211 = !DILocation(line: 708, column: 19, scope: !1210)
!1212 = !DILocation(line: 708, column: 18, scope: !1210)
!1213 = !DILocation(line: 708, column: 16, scope: !1210)
!1214 = !DILocation(line: 709, column: 7, scope: !1210)
!1215 = !DILocation(line: 710, column: 4, scope: !1210)
!1216 = !DILocation(line: 710, column: 32, scope: !1217)
!1217 = !DILexicalBlockFile(scope: !1218, file: !410, discriminator: 1)
!1218 = distinct !DILexicalBlock(scope: !1206, file: !410, line: 710, column: 15)
!1219 = !DILocation(line: 710, column: 16, scope: !1217)
!1220 = !DILocation(line: 710, column: 15, scope: !1217)
!1221 = !DILocation(line: 711, column: 11, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1218, file: !410, line: 710, column: 52)
!1223 = !DILocation(line: 712, column: 19, scope: !1222)
!1224 = !DILocation(line: 712, column: 18, scope: !1222)
!1225 = !DILocation(line: 712, column: 16, scope: !1222)
!1226 = !DILocation(line: 713, column: 7, scope: !1222)
!1227 = !DILocation(line: 714, column: 4, scope: !1222)
!1228 = !DILocation(line: 716, column: 4, scope: !436)
!1229 = !DILocation(line: 722, column: 65, scope: !436)
!1230 = !DILocation(line: 722, column: 70, scope: !436)
!1231 = !DILocation(line: 722, column: 4, scope: !436)
!1232 = !DILocation(line: 723, column: 4, scope: !436)
!1233 = !DILocation(line: 724, column: 33, scope: !436)
!1234 = !DILocation(line: 724, column: 11, scope: !436)
!1235 = !DILocation(line: 724, column: 4, scope: !436)
!1236 = !DILocalVariable(name: "data", arg: 1, scope: !438, file: !410, line: 812, type: !413)
!1237 = !DILocation(line: 812, column: 37, scope: !438)
!1238 = !DILocalVariable(name: "err", scope: !438, file: !410, line: 814, type: !471)
!1239 = !DILocation(line: 814, column: 13, scope: !438)
!1240 = !DILocalVariable(name: "vmhgfsExecProcArgs", scope: !438, file: !410, line: 828, type: !1241)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProcMgr_ProcArgs", file: !493, line: 123, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ProcMgr_ProcArgs", file: !493, line: 70, size: 128, align: 64, elements: !1243)
!1243 = !{!1244, !1245}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !1242, file: !493, line: 115, baseType: !739, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "workingDirectory", scope: !1242, file: !493, line: 121, baseType: !372, size: 64, align: 64, offset: 64)
!1246 = !DILocation(line: 828, column: 21, scope: !438)
!1247 = !DILocalVariable(name: "execRes", scope: !438, file: !410, line: 829, type: !459)
!1248 = !DILocation(line: 829, column: 9, scope: !438)
!1249 = !DILocalVariable(name: "mountCmd", scope: !438, file: !410, line: 830, type: !358)
!1250 = !DILocation(line: 830, column: 16, scope: !438)
!1251 = !DILocalVariable(name: "isFuseEnabled", scope: !438, file: !410, line: 831, type: !459)
!1252 = !DILocation(line: 831, column: 9, scope: !438)
!1253 = !DILocalVariable(name: "vmhgfsMntFound", scope: !438, file: !410, line: 832, type: !459)
!1254 = !DILocation(line: 832, column: 9, scope: !438)
!1255 = !DILocalVariable(name: "vmhgfsMntPointCreated", scope: !438, file: !410, line: 833, type: !459)
!1256 = !DILocation(line: 833, column: 9, scope: !438)
!1257 = !DILocalVariable(name: "validFuseExitCode", scope: !438, file: !410, line: 834, type: !459)
!1258 = !DILocation(line: 834, column: 9, scope: !438)
!1259 = !DILocalVariable(name: "fuseExitCode", scope: !438, file: !410, line: 835, type: !337)
!1260 = !DILocation(line: 835, column: 8, scope: !438)
!1261 = !DILocalVariable(name: "ret", scope: !438, file: !410, line: 836, type: !337)
!1262 = !DILocation(line: 836, column: 8, scope: !438)
!1263 = !DILocation(line: 838, column: 23, scope: !438)
!1264 = !DILocation(line: 838, column: 28, scope: !438)
!1265 = !DILocation(line: 839, column: 23, scope: !438)
!1266 = !DILocation(line: 839, column: 40, scope: !438)
!1267 = !DILocation(line: 841, column: 14, scope: !438)
!1268 = !DILocation(line: 841, column: 12, scope: !438)
!1269 = !DILocation(line: 845, column: 9, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !438, file: !410, line: 845, column: 8)
!1271 = !DILocation(line: 845, column: 8, scope: !438)
!1272 = !DILocation(line: 846, column: 11, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1274, file: !410, line: 846, column: 11)
!1274 = distinct !DILexicalBlock(scope: !1270, file: !410, line: 845, column: 18)
!1275 = !DILocation(line: 846, column: 29, scope: !1273)
!1276 = !DILocation(line: 846, column: 32, scope: !1277)
!1277 = !DILexicalBlockFile(scope: !1273, file: !410, discriminator: 1)
!1278 = !DILocation(line: 846, column: 45, scope: !1277)
!1279 = !DILocation(line: 846, column: 11, scope: !1277)
!1280 = !DILocation(line: 847, column: 10, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !1273, file: !410, line: 846, column: 51)
!1282 = !DILocation(line: 848, column: 14, scope: !1281)
!1283 = !DILocation(line: 849, column: 10, scope: !1281)
!1284 = !DILocation(line: 851, column: 121, scope: !1274)
!1285 = !DILocation(line: 851, column: 141, scope: !1286)
!1286 = !DILexicalBlockFile(scope: !1274, file: !410, discriminator: 1)
!1287 = !DILocation(line: 851, column: 121, scope: !1286)
!1288 = !DILocation(line: 851, column: 121, scope: !1289)
!1289 = !DILexicalBlockFile(scope: !1274, file: !410, discriminator: 2)
!1290 = !DILocation(line: 851, column: 121, scope: !1291)
!1291 = !DILexicalBlockFile(scope: !1274, file: !410, discriminator: 3)
!1292 = !DILocation(line: 851, column: 7, scope: !1291)
!1293 = !DILocation(line: 853, column: 21, scope: !1274)
!1294 = !DILocation(line: 854, column: 4, scope: !1274)
!1295 = !DILocation(line: 856, column: 38, scope: !438)
!1296 = !DILocation(line: 856, column: 10, scope: !438)
!1297 = !DILocation(line: 856, column: 8, scope: !438)
!1298 = !DILocation(line: 857, column: 8, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !438, file: !410, line: 857, column: 8)
!1300 = !DILocation(line: 857, column: 12, scope: !1299)
!1301 = !DILocation(line: 857, column: 8, scope: !438)
!1302 = !DILocation(line: 858, column: 7, scope: !1303)
!1303 = distinct !DILexicalBlock(scope: !1299, file: !410, line: 857, column: 23)
!1304 = !DILocation(line: 861, column: 8, scope: !1305)
!1305 = distinct !DILexicalBlock(scope: !438, file: !410, line: 861, column: 8)
!1306 = !DILocation(line: 861, column: 8, scope: !438)
!1307 = !DILocation(line: 862, column: 7, scope: !1308)
!1308 = distinct !DILexicalBlock(scope: !1305, file: !410, line: 861, column: 24)
!1309 = !DILocation(line: 863, column: 7, scope: !1308)
!1310 = !DILocation(line: 867, column: 10, scope: !438)
!1311 = !DILocation(line: 867, column: 8, scope: !438)
!1312 = !DILocation(line: 868, column: 8, scope: !1313)
!1313 = distinct !DILexicalBlock(scope: !438, file: !410, line: 868, column: 8)
!1314 = !DILocation(line: 868, column: 12, scope: !1313)
!1315 = !DILocation(line: 868, column: 8, scope: !438)
!1316 = !DILocation(line: 869, column: 7, scope: !1317)
!1317 = distinct !DILexicalBlock(scope: !1313, file: !410, line: 868, column: 18)
!1318 = !DILocation(line: 870, column: 13, scope: !1317)
!1319 = !DILocation(line: 870, column: 11, scope: !1317)
!1320 = !DILocation(line: 871, column: 11, scope: !1321)
!1321 = distinct !DILexicalBlock(scope: !1317, file: !410, line: 871, column: 11)
!1322 = !DILocation(line: 871, column: 15, scope: !1321)
!1323 = !DILocation(line: 871, column: 11, scope: !1317)
!1324 = !DILocation(line: 872, column: 14, scope: !1325)
!1325 = distinct !DILexicalBlock(scope: !1321, file: !410, line: 871, column: 21)
!1326 = !DILocation(line: 873, column: 11, scope: !1325)
!1327 = !DILocation(line: 873, column: 10, scope: !1325)
!1328 = !DILocation(line: 873, column: 10, scope: !1329)
!1329 = !DILexicalBlockFile(scope: !1325, file: !410, discriminator: 1)
!1330 = !DILocation(line: 874, column: 10, scope: !1325)
!1331 = !DILocation(line: 876, column: 29, scope: !1317)
!1332 = !DILocation(line: 877, column: 4, scope: !1317)
!1333 = !DILocation(line: 880, column: 8, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !438, file: !410, line: 880, column: 8)
!1335 = !DILocation(line: 880, column: 8, scope: !438)
!1336 = !DILocation(line: 881, column: 16, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1334, file: !410, line: 880, column: 23)
!1338 = !DILocation(line: 882, column: 4, scope: !1337)
!1339 = !DILocation(line: 889, column: 13, scope: !1340)
!1340 = distinct !DILexicalBlock(scope: !1334, file: !410, line: 882, column: 11)
!1341 = !DILocation(line: 889, column: 11, scope: !1340)
!1342 = !DILocation(line: 890, column: 11, scope: !1343)
!1343 = distinct !DILexicalBlock(scope: !1340, file: !410, line: 890, column: 11)
!1344 = !DILocation(line: 890, column: 15, scope: !1343)
!1345 = !DILocation(line: 890, column: 11, scope: !1340)
!1346 = !DILocation(line: 891, column: 19, scope: !1347)
!1347 = distinct !DILexicalBlock(scope: !1343, file: !410, line: 890, column: 21)
!1348 = !DILocation(line: 892, column: 7, scope: !1347)
!1349 = !DILocation(line: 893, column: 16, scope: !1350)
!1350 = distinct !DILexicalBlock(scope: !1343, file: !410, line: 892, column: 14)
!1351 = !DILocation(line: 893, column: 14, scope: !1350)
!1352 = !DILocation(line: 894, column: 14, scope: !1353)
!1353 = distinct !DILexicalBlock(scope: !1350, file: !410, line: 894, column: 14)
!1354 = !DILocation(line: 894, column: 18, scope: !1353)
!1355 = !DILocation(line: 894, column: 14, scope: !1350)
!1356 = !DILocation(line: 895, column: 22, scope: !1357)
!1357 = distinct !DILexicalBlock(scope: !1353, file: !410, line: 894, column: 24)
!1358 = !DILocation(line: 896, column: 10, scope: !1357)
!1359 = !DILocation(line: 897, column: 14, scope: !1360)
!1360 = distinct !DILexicalBlock(scope: !1353, file: !410, line: 896, column: 17)
!1361 = !DILocation(line: 897, column: 13, scope: !1360)
!1362 = !DILocation(line: 897, column: 13, scope: !1363)
!1363 = !DILexicalBlockFile(scope: !1360, file: !410, discriminator: 1)
!1364 = !DILocation(line: 898, column: 17, scope: !1360)
!1365 = !DILocation(line: 899, column: 13, scope: !1360)
!1366 = !DILocation(line: 904, column: 73, scope: !438)
!1367 = !DILocation(line: 904, column: 4, scope: !438)
!1368 = !DILocation(line: 905, column: 31, scope: !438)
!1369 = !DILocation(line: 905, column: 14, scope: !438)
!1370 = !DILocation(line: 905, column: 12, scope: !438)
!1371 = !DILocation(line: 906, column: 9, scope: !1372)
!1372 = distinct !DILexicalBlock(scope: !438, file: !410, line: 906, column: 8)
!1373 = !DILocation(line: 906, column: 8, scope: !438)
!1374 = !DILocation(line: 907, column: 11, scope: !1375)
!1375 = distinct !DILexicalBlock(scope: !1372, file: !410, line: 906, column: 18)
!1376 = !DILocation(line: 908, column: 7, scope: !1375)
!1377 = !DILocation(line: 909, column: 4, scope: !1375)
!1378 = !DILocation(line: 906, column: 9, scope: !1379)
!1379 = !DILexicalBlockFile(scope: !1372, file: !410, discriminator: 1)
!1380 = !DILocation(line: 911, column: 8, scope: !1381)
!1381 = distinct !DILexicalBlock(scope: !438, file: !410, line: 911, column: 8)
!1382 = !DILocation(line: 911, column: 12, scope: !1381)
!1383 = !DILocation(line: 911, column: 8, scope: !438)
!1384 = !DILocation(line: 912, column: 11, scope: !1385)
!1385 = distinct !DILexicalBlock(scope: !1386, file: !410, line: 912, column: 11)
!1386 = distinct !DILexicalBlock(scope: !1381, file: !410, line: 911, column: 23)
!1387 = !DILocation(line: 912, column: 11, scope: !1386)
!1388 = !DILocation(line: 913, column: 16, scope: !1389)
!1389 = distinct !DILexicalBlock(scope: !1385, file: !410, line: 912, column: 34)
!1390 = !DILocation(line: 913, column: 14, scope: !1389)
!1391 = !DILocation(line: 914, column: 14, scope: !1392)
!1392 = distinct !DILexicalBlock(scope: !1389, file: !410, line: 914, column: 14)
!1393 = !DILocation(line: 914, column: 18, scope: !1392)
!1394 = !DILocation(line: 914, column: 14, scope: !1389)
!1395 = !DILocation(line: 915, column: 14, scope: !1396)
!1396 = distinct !DILexicalBlock(scope: !1392, file: !410, line: 914, column: 24)
!1397 = !DILocation(line: 915, column: 13, scope: !1396)
!1398 = !DILocation(line: 915, column: 13, scope: !1399)
!1399 = !DILexicalBlockFile(scope: !1396, file: !410, discriminator: 1)
!1400 = !DILocation(line: 916, column: 10, scope: !1396)
!1401 = !DILocation(line: 917, column: 7, scope: !1389)
!1402 = !DILocation(line: 918, column: 4, scope: !1386)
!1403 = !DILocation(line: 928, column: 16, scope: !438)
!1404 = !DILocation(line: 929, column: 17, scope: !438)
!1405 = !DILocation(line: 929, column: 16, scope: !438)
!1406 = !DILocation(line: 925, column: 4, scope: !438)
!1407 = !DILocation(line: 930, column: 26, scope: !438)
!1408 = !DILocation(line: 930, column: 4, scope: !438)
!1409 = !DILocation(line: 932, column: 4, scope: !438)
!1410 = !DILocation(line: 934, column: 4, scope: !438)
!1411 = distinct !DISubprogram(name: "ToolsDaemonCheckMountedHGFS", scope: !410, file: !410, line: 748, type: !1412, isLocal: true, isDefinition: true, scopeLine: 750, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !427)
!1412 = !DISubroutineType(types: !1413)
!1413 = !{!471, !459, !1414}
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!1415 = !DILocalVariable(name: "isFuseEnabled", arg: 1, scope: !1411, file: !410, line: 748, type: !459)
!1416 = !DILocation(line: 748, column: 34, scope: !1411)
!1417 = !DILocalVariable(name: "vmhgfsMntFound", arg: 2, scope: !1411, file: !410, line: 749, type: !1414)
!1418 = !DILocation(line: 749, column: 35, scope: !1411)
!1419 = !DILocalVariable(name: "mtab", scope: !1411, file: !410, line: 751, type: !1420)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1422, line: 48, baseType: !1423)
!1422 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1424, line: 241, size: 1728, align: 64, elements: !1425)
!1424 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!1425 = !{!1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1446, !1447, !1448, !1449, !1451, !1452, !1454, !1458, !1461, !1463, !1464, !1465, !1466, !1467, !1468, !1469}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1423, file: !1424, line: 242, baseType: !337, size: 32, align: 32)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1423, file: !1424, line: 247, baseType: !372, size: 64, align: 64, offset: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1423, file: !1424, line: 248, baseType: !372, size: 64, align: 64, offset: 128)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1423, file: !1424, line: 249, baseType: !372, size: 64, align: 64, offset: 192)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1423, file: !1424, line: 250, baseType: !372, size: 64, align: 64, offset: 256)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1423, file: !1424, line: 251, baseType: !372, size: 64, align: 64, offset: 320)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1423, file: !1424, line: 252, baseType: !372, size: 64, align: 64, offset: 384)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1423, file: !1424, line: 253, baseType: !372, size: 64, align: 64, offset: 448)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1423, file: !1424, line: 254, baseType: !372, size: 64, align: 64, offset: 512)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1423, file: !1424, line: 256, baseType: !372, size: 64, align: 64, offset: 576)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1423, file: !1424, line: 257, baseType: !372, size: 64, align: 64, offset: 640)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1423, file: !1424, line: 258, baseType: !372, size: 64, align: 64, offset: 704)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1423, file: !1424, line: 260, baseType: !1439, size: 64, align: 64, offset: 768)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1424, line: 156, size: 192, align: 64, elements: !1441)
!1441 = !{!1442, !1443, !1445}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1440, file: !1424, line: 157, baseType: !1439, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1440, file: !1424, line: 158, baseType: !1444, size: 64, align: 64, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1440, file: !1424, line: 162, baseType: !337, size: 32, align: 32, offset: 128)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1423, file: !1424, line: 262, baseType: !1444, size: 64, align: 64, offset: 832)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1423, file: !1424, line: 264, baseType: !337, size: 32, align: 32, offset: 896)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1423, file: !1424, line: 268, baseType: !337, size: 32, align: 32, offset: 928)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1423, file: !1424, line: 270, baseType: !1450, size: 64, align: 64, offset: 960)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !496, line: 131, baseType: !367)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1423, file: !1424, line: 274, baseType: !389, size: 16, align: 16, offset: 1024)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1423, file: !1424, line: 275, baseType: !1453, size: 8, align: 8, offset: 1040)
!1453 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1423, file: !1424, line: 276, baseType: !1455, size: 8, align: 8, offset: 1048)
!1455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 8, align: 8, elements: !1456)
!1456 = !{!1457}
!1457 = !DISubrange(count: 1)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1423, file: !1424, line: 280, baseType: !1459, size: 64, align: 64, offset: 1088)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1424, line: 150, baseType: null)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1423, file: !1424, line: 289, baseType: !1462, size: 64, align: 64, offset: 1152)
!1462 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !496, line: 132, baseType: !367)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1423, file: !1424, line: 297, baseType: !321, size: 64, align: 64, offset: 1216)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1423, file: !1424, line: 298, baseType: !321, size: 64, align: 64, offset: 1280)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1423, file: !1424, line: 299, baseType: !321, size: 64, align: 64, offset: 1344)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1423, file: !1424, line: 300, baseType: !321, size: 64, align: 64, offset: 1408)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1423, file: !1424, line: 302, baseType: !420, size: 64, align: 64, offset: 1472)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1423, file: !1424, line: 303, baseType: !337, size: 32, align: 32, offset: 1536)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1423, file: !1424, line: 305, baseType: !1470, size: 160, align: 8, offset: 1568)
!1470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 160, align: 8, elements: !1471)
!1471 = !{!1472}
!1472 = !DISubrange(count: 20)
!1473 = !DILocation(line: 751, column: 11, scope: !1411)
!1474 = !DILocalVariable(name: "mnt", scope: !1411, file: !410, line: 752, type: !1475)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mntent", file: !1477, line: 53, size: 320, align: 64, elements: !1478)
!1477 = !DIFile(filename: "/usr/include/mntent.h", directory: "/home/lichi/Desktop/open-vm-tools/line1538")
!1478 = !{!1479, !1480, !1481, !1482, !1483, !1484}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_fsname", scope: !1476, file: !1477, line: 55, baseType: !372, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_dir", scope: !1476, file: !1477, line: 56, baseType: !372, size: 64, align: 64, offset: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_type", scope: !1476, file: !1477, line: 57, baseType: !372, size: 64, align: 64, offset: 128)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_opts", scope: !1476, file: !1477, line: 58, baseType: !372, size: 64, align: 64, offset: 192)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_freq", scope: !1476, file: !1477, line: 59, baseType: !337, size: 32, align: 32, offset: 256)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_passno", scope: !1476, file: !1477, line: 60, baseType: !337, size: 32, align: 32, offset: 288)
!1485 = !DILocation(line: 752, column: 19, scope: !1411)
!1486 = !DILocalVariable(name: "fsName", scope: !1411, file: !410, line: 753, type: !358)
!1487 = !DILocation(line: 753, column: 16, scope: !1411)
!1488 = !DILocalVariable(name: "fsType", scope: !1411, file: !410, line: 754, type: !358)
!1489 = !DILocation(line: 754, column: 16, scope: !1411)
!1490 = !DILocalVariable(name: "err", scope: !1411, file: !410, line: 755, type: !471)
!1491 = !DILocation(line: 755, column: 13, scope: !1411)
!1492 = !DILocation(line: 757, column: 16, scope: !1493)
!1493 = distinct !DILexicalBlock(scope: !1411, file: !410, line: 757, column: 8)
!1494 = !DILocation(line: 757, column: 14, scope: !1493)
!1495 = !DILocation(line: 757, column: 23, scope: !1493)
!1496 = !DILocation(line: 757, column: 8, scope: !1411)
!1497 = !DILocation(line: 758, column: 11, scope: !1498)
!1498 = distinct !DILexicalBlock(scope: !1493, file: !410, line: 757, column: 43)
!1499 = !DILocation(line: 759, column: 8, scope: !1498)
!1500 = !DILocation(line: 759, column: 7, scope: !1498)
!1501 = !DILocation(line: 759, column: 7, scope: !1502)
!1502 = !DILexicalBlockFile(scope: !1498, file: !410, discriminator: 1)
!1503 = !DILocation(line: 760, column: 7, scope: !1498)
!1504 = !DILocation(line: 763, column: 5, scope: !1411)
!1505 = !DILocation(line: 763, column: 20, scope: !1411)
!1506 = !DILocation(line: 764, column: 8, scope: !1507)
!1507 = distinct !DILexicalBlock(scope: !1411, file: !410, line: 764, column: 8)
!1508 = !DILocation(line: 764, column: 8, scope: !1411)
!1509 = !DILocation(line: 765, column: 14, scope: !1510)
!1510 = distinct !DILexicalBlock(scope: !1507, file: !410, line: 764, column: 23)
!1511 = !DILocation(line: 766, column: 14, scope: !1510)
!1512 = !DILocation(line: 767, column: 4, scope: !1510)
!1513 = !DILocation(line: 768, column: 14, scope: !1514)
!1514 = distinct !DILexicalBlock(scope: !1507, file: !410, line: 767, column: 11)
!1515 = !DILocation(line: 769, column: 14, scope: !1514)
!1516 = !DILocation(line: 771, column: 4, scope: !1411)
!1517 = !DILocation(line: 771, column: 35, scope: !1518)
!1518 = !DILexicalBlockFile(scope: !1411, file: !410, discriminator: 1)
!1519 = !DILocation(line: 771, column: 19, scope: !1518)
!1520 = !DILocation(line: 771, column: 17, scope: !1518)
!1521 = !DILocation(line: 771, column: 42, scope: !1518)
!1522 = !DILocation(line: 771, column: 4, scope: !1518)
!1523 = !DILocation(line: 772, column: 19, scope: !1524)
!1524 = distinct !DILexicalBlock(scope: !1525, file: !410, line: 772, column: 11)
!1525 = distinct !DILexicalBlock(scope: !1411, file: !410, line: 771, column: 13)
!1526 = !DILocation(line: 772, column: 24, scope: !1524)
!1527 = !DILocation(line: 772, column: 36, scope: !1524)
!1528 = !DILocation(line: 772, column: 12, scope: !1524)
!1529 = !DILocation(line: 772, column: 44, scope: !1524)
!1530 = !DILocation(line: 772, column: 50, scope: !1524)
!1531 = !DILocation(line: 773, column: 21, scope: !1524)
!1532 = !DILocation(line: 773, column: 26, scope: !1524)
!1533 = !DILocation(line: 773, column: 36, scope: !1524)
!1534 = !DILocation(line: 773, column: 14, scope: !1524)
!1535 = !DILocation(line: 773, column: 44, scope: !1524)
!1536 = !DILocation(line: 773, column: 50, scope: !1524)
!1537 = !DILocation(line: 774, column: 21, scope: !1524)
!1538 = !DILocation(line: 774, column: 26, scope: !1524)
!1539 = !DILocation(line: 774, column: 14, scope: !1524)
!1540 = !DILocation(line: 774, column: 48, scope: !1524)
!1541 = !DILocation(line: 772, column: 11, scope: !1542)
!1542 = !DILexicalBlockFile(scope: !1525, file: !410, discriminator: 1)
!1543 = !DILocation(line: 775, column: 11, scope: !1544)
!1544 = distinct !DILexicalBlock(scope: !1524, file: !410, line: 774, column: 55)
!1545 = !DILocation(line: 775, column: 26, scope: !1544)
!1546 = !DILocation(line: 776, column: 103, scope: !1544)
