; ModuleID = './ulBarrier.o.i'
source_filename = "./ulBarrier.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.MXUserBarrier = type { %struct.MXUserHeader, %struct.MXUserExclLock*, i32, i32, [2 x %struct.BarrierContext] }
%struct.MXUserHeader = type { i32, i8*, i32, %struct.anon, void (%struct.MXUserHeader*)*, void (%struct.MXUserHeader*)*, %struct.ListItem }
%struct.anon = type { i32 }
%struct.ListItem = type { %struct.ListItem*, %struct.ListItem* }
%struct.MXUserExclLock = type opaque
%struct.BarrierContext = type { i32, %struct.MXUserCondVar* }
%struct.MXUserCondVar = type opaque
%struct.Atomic_uint64 = type { i64 }

@.str = private unnamed_addr constant [11 x i8] c"Barrier-%p\00", align 1
@.str.1 = private unnamed_addr constant [47 x i8] c"%s: Attempted destroy on barrier while in use\0A\00", align 1
@__FUNCTION__.MXUser_DestroyBarrier = private unnamed_addr constant [22 x i8] c"MXUser_DestroyBarrier\00", align 1
@.str.2 = private unnamed_addr constant [20 x i8] c"%s: Barrier @ 0x%p\0A\00", align 1
@__FUNCTION__.MXUserDumpBarrier = private unnamed_addr constant [18 x i8] c"MXUserDumpBarrier\00", align 1
@.str.3 = private unnamed_addr constant [17 x i8] c"\09signature 0x%X\0A\00", align 1
@.str.4 = private unnamed_addr constant [10 x i8] c"\09name %s\0A\00", align 1
@.str.5 = private unnamed_addr constant [12 x i8] c"\09rank 0x%X\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15)
!1 = !DIFile(filename: "ulBarrier.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line514")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 440, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "ulInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line514")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "MXUSER_TYPE_NEVER_USE", value: 0)
!7 = !DIEnumerator(name: "MXUSER_TYPE_RW", value: 1)
!8 = !DIEnumerator(name: "MXUSER_TYPE_REC", value: 2)
!9 = !DIEnumerator(name: "MXUSER_TYPE_RANK", value: 3)
!10 = !DIEnumerator(name: "MXUSER_TYPE_EXCL", value: 4)
!11 = !DIEnumerator(name: "MXUSER_TYPE_SEMA", value: 5)
!12 = !DIEnumerator(name: "MXUSER_TYPE_CONDVAR", value: 6)
!13 = !DIEnumerator(name: "MXUSER_TYPE_BARRIER", value: 7)
!14 = !DIEnumerator(name: "MXUSER_TYPE_EVENT", value: 8)
!15 = !{!16, !17, !76, !78}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserBarrier", file: !19, line: 45, baseType: !20)
!19 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/userlock.h", directory: "/home/lichi/Desktop/open-vm-tools/line514")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserBarrier", file: !21, line: 33, size: 832, align: 64, elements: !22)
!21 = !DIFile(filename: "ulBarrier.c", directory: "/home/lichi/Desktop/open-vm-tools/line514")
!22 = !{!23, !57, !61, !62, !64}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !20, file: !21, line: 35, baseType: !24, size: 448, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserHeader", file: !4, line: 469, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserHeader", file: !4, line: 456, size: 448, align: 64, elements: !26)
!26 = !{!27, !33, !36, !38, !43, !48, !49}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !25, file: !4, line: 457, baseType: !28, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !29, line: 173, baseType: !30)
!29 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line514")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !31, line: 51, baseType: !32)
!31 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line514")
!32 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !25, file: !4, line: 458, baseType: !34, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !25, file: !4, line: 459, baseType: !37, size: 32, align: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "MX_Rank", file: !29, line: 1167, baseType: !28)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !25, file: !4, line: 464, baseType: !39, size: 32, align: 32, offset: 160)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !25, file: !4, line: 461, size: 32, align: 32, elements: !40)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !39, file: !4, line: 462, baseType: !32, size: 24, align: 32, flags: DIFlagBitField, extraData: i64 0)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "badHeader", scope: !39, file: !4, line: 463, baseType: !32, size: 1, align: 32, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "dumpFunc", scope: !25, file: !4, line: 466, baseType: !44, size: 64, align: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "statsFunc", scope: !25, file: !4, line: 467, baseType: !44, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !25, file: !4, line: 468, baseType: !50, size: 128, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem", file: !51, line: 45, baseType: !52)
!51 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/circList.h", directory: "/home/lichi/Desktop/open-vm-tools/line514")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListItem", file: !51, line: 42, size: 128, align: 64, elements: !53)
!53 = !{!54, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !52, file: !51, line: 43, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !51, line: 44, baseType: !55, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !20, file: !21, line: 36, baseType: !58, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserExclLock", file: !19, line: 38, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserExclLock", file: !19, line: 38, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "configCount", scope: !20, file: !21, line: 37, baseType: !28, size: 32, align: 32, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "curContext", scope: !20, file: !21, line: 38, baseType: !63, size: 32, align: 32, offset: 544)
!63 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !28)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "contexts", scope: !20, file: !21, line: 39, baseType: !65, size: 256, align: 64, offset: 576)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 256, align: 64, elements: !74)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "BarrierContext", file: !21, line: 31, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BarrierContext", file: !21, line: 25, size: 128, align: 64, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !67, file: !21, line: 27, baseType: !28, size: 32, align: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "condVar", scope: !67, file: !21, line: 28, baseType: !71, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserCondVar", file: !19, line: 42, baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserCondVar", file: !19, line: 42, flags: DIFlagFwdDecl)
!74 = !{!75}
!75 = !DISubrange(count: 2)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !31, line: 122, baseType: !77)
!77 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !29, line: 171, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !31, line: 55, baseType: !77)
!80 = !{i32 2, !"Dwarf Version", i32 4}
!81 = !{i32 2, !"Debug Info Version", i32 3}
!82 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!83 = distinct !DISubprogram(name: "MXUser_CreateBarrier", scope: !21, file: !21, line: 112, type: !84, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !88)
!84 = !DISubroutineType(types: !85)
!85 = !{!17, !86, !37, !28}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!88 = !{}
!89 = !DILocalVariable(name: "userName", arg: 1, scope: !83, file: !21, line: 112, type: !86)
!90 = !DIExpression()
!91 = !DILocation(line: 112, column: 34, scope: !83)
!92 = !DILocalVariable(name: "rank", arg: 2, scope: !83, file: !21, line: 113, type: !37)
!93 = !DILocation(line: 113, column: 30, scope: !83)
!94 = !DILocalVariable(name: "count", arg: 3, scope: !83, file: !21, line: 114, type: !28)
!95 = !DILocation(line: 114, column: 29, scope: !83)
!96 = !DILocalVariable(name: "properName", scope: !83, file: !21, line: 116, type: !34)
!97 = !DILocation(line: 116, column: 10, scope: !83)
!98 = !DILocalVariable(name: "barrier", scope: !83, file: !21, line: 117, type: !17)
!99 = !DILocation(line: 117, column: 19, scope: !83)
!100 = !DILocation(line: 121, column: 14, scope: !83)
!101 = !DILocation(line: 121, column: 12, scope: !83)
!102 = !DILocation(line: 123, column: 8, scope: !103)
!103 = distinct !DILexicalBlock(scope: !83, file: !21, line: 123, column: 8)
!104 = !DILocation(line: 123, column: 17, scope: !103)
!105 = !DILocation(line: 123, column: 8, scope: !83)
!106 = !DILocation(line: 124, column: 56, scope: !107)
!107 = distinct !DILexicalBlock(scope: !103, file: !21, line: 123, column: 25)
!108 = !DILocation(line: 124, column: 20, scope: !109)
!109 = !DILexicalBlockFile(scope: !107, file: !21, discriminator: 1)
!110 = !DILocation(line: 124, column: 18, scope: !107)
!111 = !DILocation(line: 125, column: 4, scope: !107)
!112 = !DILocation(line: 126, column: 37, scope: !113)
!113 = distinct !DILexicalBlock(scope: !103, file: !21, line: 125, column: 11)
!114 = !DILocation(line: 126, column: 20, scope: !113)
!115 = !DILocation(line: 126, column: 18, scope: !113)
!116 = !DILocation(line: 129, column: 42, scope: !83)
!117 = !DILocation(line: 129, column: 54, scope: !83)
!118 = !DILocation(line: 129, column: 20, scope: !83)
!119 = !DILocation(line: 129, column: 4, scope: !83)
!120 = !DILocation(line: 129, column: 13, scope: !83)
!121 = !DILocation(line: 129, column: 18, scope: !83)
!122 = !DILocation(line: 130, column: 64, scope: !83)
!123 = !DILocation(line: 130, column: 73, scope: !83)
!124 = !DILocation(line: 130, column: 35, scope: !83)
!125 = !DILocation(line: 130, column: 4, scope: !83)
!126 = !DILocation(line: 130, column: 13, scope: !83)
!127 = !DILocation(line: 130, column: 25, scope: !83)
!128 = !DILocation(line: 130, column: 33, scope: !83)
!129 = !DILocation(line: 131, column: 64, scope: !83)
!130 = !DILocation(line: 131, column: 73, scope: !83)
!131 = !DILocation(line: 131, column: 35, scope: !83)
