; ModuleID = './message.o.i'
source_filename = "./message.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Message_Channel = type { i16, i8*, i64, i8, i32, i32 }
%union.Backdoor_proto = type { %struct.anon }
%struct.anon = type { %union.anon, i64, %union.anon.2, %union.anon.5, %union.anon.8, %union.anon.11 }
%union.anon = type { i64 }
%union.anon.2 = type { i64 }
%union.anon.5 = type { i64 }
%union.anon.8 = type { i64 }
%union.anon.11 = type { i64 }
%struct.anon.3 = type { i16, i16 }
%struct.anon.6 = type { i16, i16 }
%struct.anon.14 = type { %union.anon.15, %union.anon.18, %union.anon.21, %union.anon.24, %union.anon.27, %union.anon.30 }
%union.anon.15 = type { i64 }
%union.anon.18 = type { i64 }
%union.anon.21 = type { i64 }
%union.anon.24 = type { i64 }
%union.anon.27 = type { i64 }
%union.anon.30 = type { i64 }
%union.Backdoor_proto_hb = type { %struct.anon.33 }
%struct.anon.33 = type { %union.anon.34, %union.anon.37, i64, %union.anon.40, i64, i64, %union.anon.43 }
%union.anon.34 = type { i64 }
%union.anon.37 = type { i64 }
%union.anon.40 = type { i64 }
%union.anon.43 = type { i64 }
%struct.anon.38 = type { i16, i16 }
%struct.anon.41 = type { i16, i16 }

; Function Attrs: nounwind uwtable
define signext i8 @Message_OpenAllocated(i32, %struct.Message_Channel*, i8*, i64) #0 !dbg !30 {
  %5 = alloca i8, align 1
  %6 = alloca i32, align 4
  %7 = alloca %struct.Message_Channel*, align 8
  %8 = alloca i8*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13)
!1 = !DIFile(filename: "message.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line531")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 51, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/guest_msg_def.h", directory: "/home/lichi/Desktop/open-vm-tools/line531")
!5 = !{!6, !7, !8, !9, !10, !11, !12}
!6 = !DIEnumerator(name: "MESSAGE_TYPE_OPEN", value: 0)
!7 = !DIEnumerator(name: "MESSAGE_TYPE_SENDSIZE", value: 1)
!8 = !DIEnumerator(name: "MESSAGE_TYPE_SENDPAYLOAD", value: 2)
!9 = !DIEnumerator(name: "MESSAGE_TYPE_RECVSIZE", value: 3)
!10 = !DIEnumerator(name: "MESSAGE_TYPE_RECVPAYLOAD", value: 4)
!11 = !DIEnumerator(name: "MESSAGE_TYPE_RECVSTATUS", value: 5)
!12 = !DIEnumerator(name: "MESSAGE_TYPE_CLOSE", value: 6)
!13 = !{!14, !16, !17, !20, !26}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !18, line: 122, baseType: !19)
!18 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line531")
!19 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !23, line: 173, baseType: !24)
!23 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line531")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 51, baseType: !25)
!25 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!27 = !{i32 2, !"Dwarf Version", i32 4}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!30 = distinct !DISubprogram(name: "Message_OpenAllocated", scope: !31, file: !31, line: 102, type: !32, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !53)
!31 = !DIFile(filename: "message.c", directory: "/home/lichi/Desktop/open-vm-tools/line531")
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !22, !36, !52, !47}
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !23, line: 230, baseType: !35)
!35 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "Message_Channel", file: !38, line: 65, baseType: !39)
!38 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/message.h", directory: "/home/lichi/Desktop/open-vm-tools/line531")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Message_Channel", file: !38, line: 51, size: 320, align: 64, elements: !40)
!40 = !{!41, !45, !46, !49, !50, !51}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !39, file: !38, line: 53, baseType: !42, size: 16, align: 16)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !23, line: 175, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 49, baseType: !44)
!44 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !39, file: !38, line: 57, baseType: !14, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "inAlloc", scope: !39, file: !38, line: 59, baseType: !47, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 216, baseType: !19)
!48 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line531")
!49 = !DIDerivedType(tag: DW_TAG_member, name: "inPreallocated", scope: !39, file: !38, line: 60, baseType: !34, size: 8, align: 8, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "cookieHigh", scope: !39, file: !38, line: 63, baseType: !22, size: 32, align: 32, offset: 224)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "cookieLow", scope: !39, file: !38, line: 64, baseType: !22, size: 32, align: 32, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!53 = !{}
!54 = !DILocalVariable(name: "proto", arg: 1, scope: !30, file: !31, line: 102, type: !22)
!55 = !DIExpression()
!56 = !DILocation(line: 102, column: 30, scope: !30)
!57 = !DILocalVariable(name: "chan", arg: 2, scope: !30, file: !31, line: 102, type: !36)
!58 = !DILocation(line: 102, column: 54, scope: !30)
!59 = !DILocalVariable(name: "receiveBuffer", arg: 3, scope: !30, file: !31, line: 103, type: !52)
!60 = !DILocation(line: 103, column: 29, scope: !30)
!61 = !DILocalVariable(name: "receiveBufferSize", arg: 4, scope: !30, file: !31, line: 103, type: !47)
!62 = !DILocation(line: 103, column: 51, scope: !30)
!63 = !DILocalVariable(name: "flags", scope: !30, file: !31, line: 105, type: !22)
!64 = !DILocation(line: 105, column: 11, scope: !30)
!65 = !DILocalVariable(name: "bp", scope: !30, file: !31, line: 106, type: !66)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "Backdoor_proto", file: !67, line: 102, baseType: !68)
!67 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/backdoor_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line531")
!68 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !67, line: 85, size: 384, align: 64, elements: !69)
!69 = !{!70, !151}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !68, file: !67, line: 93, baseType: !71, size: 384, align: 64)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !68, file: !67, line: 86, size: 384, align: 64, elements: !72)
!72 = !{!73, !90, !91, !106, !121, !136}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !71, file: !67, line: 87, baseType: !74, size: 64, align: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !71, file: !67, line: 87, size: 64, align: 64, elements: !75)
!75 = !{!76, !81, !82, !87}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !74, file: !67, line: 87, baseType: !77, size: 32, align: 16)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !74, file: !67, line: 87, size: 32, align: 16, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !77, file: !67, line: 87, baseType: !42, size: 16, align: 16)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !77, file: !67, line: 87, baseType: !42, size: 16, align: 16, offset: 16)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !74, file: !67, line: 87, baseType: !22, size: 32, align: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !74, file: !67, line: 87, baseType: !83, size: 64, align: 32)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !74, file: !67, line: 87, size: 64, align: 32, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !83, file: !67, line: 87, baseType: !22, size: 32, align: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !83, file: !67, line: 87, baseType: !22, size: 32, align: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !74, file: !67, line: 87, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !23, line: 171, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 55, baseType: !19)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !71, file: !67, line: 88, baseType: !47, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !71, file: !67, line: 89, baseType: !92, size: 64, align: 64, offset: 128)
!92 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !71, file: !67, line: 89, size: 64, align: 64, elements: !93)
!93 = !{!94, !99, !100, !105}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !92, file: !67, line: 89, baseType: !95, size: 32, align: 16)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !92, file: !67, line: 89, size: 32, align: 16, elements: !96)
!96 = !{!97, !98}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !95, file: !67, line: 89, baseType: !42, size: 16, align: 16)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !95, file: !67, line: 89, baseType: !42, size: 16, align: 16, offset: 16)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !92, file: !67, line: 89, baseType: !22, size: 32, align: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !92, file: !67, line: 89, baseType: !101, size: 64, align: 32)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !92, file: !67, line: 89, size: 64, align: 32, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !101, file: !67, line: 89, baseType: !22, size: 32, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !101, file: !67, line: 89, baseType: !22, size: 32, align: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !92, file: !67, line: 89, baseType: !88, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !71, file: !67, line: 90, baseType: !107, size: 64, align: 64, offset: 192)
!107 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !71, file: !67, line: 90, size: 64, align: 64, elements: !108)
!108 = !{!109, !114, !115, !120}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !107, file: !67, line: 90, baseType: !110, size: 32, align: 16)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !107, file: !67, line: 90, size: 32, align: 16, elements: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !110, file: !67, line: 90, baseType: !42, size: 16, align: 16)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !110, file: !67, line: 90, baseType: !42, size: 16, align: 16, offset: 16)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !107, file: !67, line: 90, baseType: !22, size: 32, align: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !107, file: !67, line: 90, baseType: !116, size: 64, align: 32)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !107, file: !67, line: 90, size: 64, align: 32, elements: !117)
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !116, file: !67, line: 90, baseType: !22, size: 32, align: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !116, file: !67, line: 90, baseType: !22, size: 32, align: 32, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !107, file: !67, line: 90, baseType: !88, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "si", scope: !71, file: !67, line: 91, baseType: !122, size: 64, align: 64, offset: 256)
!122 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !71, file: !67, line: 91, size: 64, align: 64, elements: !123)
!123 = !{!124, !129, !130, !135}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !122, file: !67, line: 91, baseType: !125, size: 32, align: 16)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !122, file: !67, line: 91, size: 32, align: 16, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !125, file: !67, line: 91, baseType: !42, size: 16, align: 16)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !125, file: !67, line: 91, baseType: !42, size: 16, align: 16, offset: 16)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !122, file: !67, line: 91, baseType: !22, size: 32, align: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !122, file: !67, line: 91, baseType: !131, size: 64, align: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !122, file: !67, line: 91, size: 64, align: 32, elements: !132)
!132 = !{!133, !134}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !131, file: !67, line: 91, baseType: !22, size: 32, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !131, file: !67, line: 91, baseType: !22, size: 32, align: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !122, file: !67, line: 91, baseType: !88, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !71, file: !67, line: 92, baseType: !137, size: 64, align: 64, offset: 320)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !71, file: !67, line: 92, size: 64, align: 64, elements: !138)
!138 = !{!139, !144, !145, !150}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !137, file: !67, line: 92, baseType: !140, size: 32, align: 16)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !137, file: !67, line: 92, size: 32, align: 16, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !140, file: !67, line: 92, baseType: !42, size: 16, align: 16)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !140, file: !67, line: 92, baseType: !42, size: 16, align: 16, offset: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !137, file: !67, line: 92, baseType: !22, size: 32, align: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !137, file: !67, line: 92, baseType: !146, size: 64, align: 32)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !137, file: !67, line: 92, size: 64, align: 32, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !146, file: !67, line: 92, baseType: !22, size: 32, align: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !146, file: !67, line: 92, baseType: !22, size: 32, align: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !137, file: !67, line: 92, baseType: !88, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !68, file: !67, line: 101, baseType: !152, size: 384, align: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !68, file: !67, line: 94, size: 384, align: 64, elements: !153)
!153 = !{!154, !169, !184, !199, !214, !229}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !152, file: !67, line: 95, baseType: !155, size: 64, align: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !67, line: 95, size: 64, align: 64, elements: !156)
!156 = !{!157, !162, !163, !168}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !155, file: !67, line: 95, baseType: !158, size: 32, align: 16)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !155, file: !67, line: 95, size: 32, align: 16, elements: !159)
!159 = !{!160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !158, file: !67, line: 95, baseType: !42, size: 16, align: 16)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !158, file: !67, line: 95, baseType: !42, size: 16, align: 16, offset: 16)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !155, file: !67, line: 95, baseType: !22, size: 32, align: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !155, file: !67, line: 95, baseType: !164, size: 64, align: 32)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !155, file: !67, line: 95, size: 64, align: 32, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !164, file: !67, line: 95, baseType: !22, size: 32, align: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !164, file: !67, line: 95, baseType: !22, size: 32, align: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !155, file: !67, line: 95, baseType: !88, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "bx", scope: !152, file: !67, line: 96, baseType: !170, size: 64, align: 64, offset: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !67, line: 96, size: 64, align: 64, elements: !171)
!171 = !{!172, !177, !178, !183}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !170, file: !67, line: 96, baseType: !173, size: 32, align: 16)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !170, file: !67, line: 96, size: 32, align: 16, elements: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !173, file: !67, line: 96, baseType: !42, size: 16, align: 16)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !173, file: !67, line: 96, baseType: !42, size: 16, align: 16, offset: 16)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !170, file: !67, line: 96, baseType: !22, size: 32, align: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !170, file: !67, line: 96, baseType: !179, size: 64, align: 32)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !170, file: !67, line: 96, size: 64, align: 32, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !179, file: !67, line: 96, baseType: !22, size: 32, align: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !179, file: !67, line: 96, baseType: !22, size: 32, align: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !170, file: !67, line: 96, baseType: !88, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !152, file: !67, line: 97, baseType: !185, size: 64, align: 64, offset: 128)
!185 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !67, line: 97, size: 64, align: 64, elements: !186)
!186 = !{!187, !192, !193, !198}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !185, file: !67, line: 97, baseType: !188, size: 32, align: 16)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !185, file: !67, line: 97, size: 32, align: 16, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !188, file: !67, line: 97, baseType: !42, size: 16, align: 16)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !188, file: !67, line: 97, baseType: !42, size: 16, align: 16, offset: 16)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !185, file: !67, line: 97, baseType: !22, size: 32, align: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !185, file: !67, line: 97, baseType: !194, size: 64, align: 32)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !185, file: !67, line: 97, size: 64, align: 32, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !194, file: !67, line: 97, baseType: !22, size: 32, align: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !194, file: !67, line: 97, baseType: !22, size: 32, align: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !185, file: !67, line: 97, baseType: !88, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !152, file: !67, line: 98, baseType: !200, size: 64, align: 64, offset: 192)
!200 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !67, line: 98, size: 64, align: 64, elements: !201)
!201 = !{!202, !207, !208, !213}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !200, file: !67, line: 98, baseType: !203, size: 32, align: 16)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !200, file: !67, line: 98, size: 32, align: 16, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !203, file: !67, line: 98, baseType: !42, size: 16, align: 16)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !203, file: !67, line: 98, baseType: !42, size: 16, align: 16, offset: 16)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !200, file: !67, line: 98, baseType: !22, size: 32, align: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !200, file: !67, line: 98, baseType: !209, size: 64, align: 32)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !200, file: !67, line: 98, size: 64, align: 32, elements: !210)
!210 = !{!211, !212}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !209, file: !67, line: 98, baseType: !22, size: 32, align: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !209, file: !67, line: 98, baseType: !22, size: 32, align: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !200, file: !67, line: 98, baseType: !88, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "si", scope: !152, file: !67, line: 99, baseType: !215, size: 64, align: 64, offset: 256)
!215 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !67, line: 99, size: 64, align: 64, elements: !216)
!216 = !{!217, !222, !223, !228}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !215, file: !67, line: 99, baseType: !218, size: 32, align: 16)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !215, file: !67, line: 99, size: 32, align: 16, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !218, file: !67, line: 99, baseType: !42, size: 16, align: 16)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !218, file: !67, line: 99, baseType: !42, size: 16, align: 16, offset: 16)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !215, file: !67, line: 99, baseType: !22, size: 32, align: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !215, file: !67, line: 99, baseType: !224, size: 64, align: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !215, file: !67, line: 99, size: 64, align: 32, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !224, file: !67, line: 99, baseType: !22, size: 32, align: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !224, file: !67, line: 99, baseType: !22, size: 32, align: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !215, file: !67, line: 99, baseType: !88, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !152, file: !67, line: 100, baseType: !230, size: 64, align: 64, offset: 320)
!230 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !67, line: 100, size: 64, align: 64, elements: !231)
!231 = !{!232, !237, !238, !243}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !230, file: !67, line: 100, baseType: !233, size: 32, align: 16)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !230, file: !67, line: 100, size: 32, align: 16, elements: !234)
!234 = !{!235, !236}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !233, file: !67, line: 100, baseType: !42, size: 16, align: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !233, file: !67, line: 100, baseType: !42, size: 16, align: 16, offset: 16)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !230, file: !67, line: 100, baseType: !22, size: 32, align: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !230, file: !67, line: 100, baseType: !239, size: 64, align: 32)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !230, file: !67, line: 100, size: 64, align: 32, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !239, file: !67, line: 100, baseType: !22, size: 32, align: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !239, file: !67, line: 100, baseType: !22, size: 32, align: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !230, file: !67, line: 100, baseType: !88, size: 64, align: 64)
!244 = !DILocation(line: 106, column: 19, scope: !30)
!245 = !DILocation(line: 108, column: 10, scope: !30)
!246 = !DILocation(line: 108, column: 4, scope: !30)
!247 = !DILocation(line: 111, column: 7, scope: !30)
!248 = !DILocation(line: 111, column: 10, scope: !30)
!249 = !DILocation(line: 111, column: 13, scope: !30)
!250 = !DILocation(line: 111, column: 19, scope: !30)
!251 = !DILocation(line: 111, column: 24, scope: !30)
!252 = !DILocation(line: 113, column: 17, scope: !30)
!253 = !DILocation(line: 113, column: 25, scope: !30)
!254 = !DILocation(line: 113, column: 23, scope: !30)
!255 = !DILocation(line: 113, column: 7, scope: !30)
!256 = !DILocation(line: 113, column: 10, scope: !30)
!257 = !DILocation(line: 113, column: 15, scope: !30)
!258 = !DILocation(line: 115, column: 7, scope: !30)
!259 = !DILocation(line: 115, column: 10, scope: !30)
!260 = !DILocation(line: 115, column: 13, scope: !30)
!261 = !DILocation(line: 115, column: 19, scope: !30)
!262 = !DILocation(line: 115, column: 23, scope: !30)
!263 = !DILocation(line: 116, column: 4, scope: !30)
!264 = !DILocation(line: 119, column: 12, scope: !265)
!265 = distinct !DILexicalBlock(scope: !30, file: !31, line: 119, column: 8)
!266 = !DILocation(line: 119, column: 15, scope: !265)
!267 = !DILocation(line: 119, column: 18, scope: !265)
!268 = !DILocation(line: 119, column: 24, scope: !265)
!269 = !DILocation(line: 119, column: 9, scope: !265)
!270 = !DILocation(line: 119, column: 29, scope: !265)
!271 = !DILocation(line: 119, column: 39, scope: !265)
!272 = !DILocation(line: 119, column: 8, scope: !30)
!273 = !DILocation(line: 120, column: 11, scope: !274)
!274 = distinct !DILexicalBlock(scope: !275, file: !31, line: 120, column: 11)
!275 = distinct !DILexicalBlock(scope: !265, file: !31, line: 119, column: 45)
!276 = !DILocation(line: 120, column: 11, scope: !275)
!277 = !DILocation(line: 122, column: 16, scope: !278)
!278 = distinct !DILexicalBlock(scope: !274, file: !31, line: 120, column: 18)
!279 = !DILocation(line: 123, column: 10, scope: !278)
!280 = !DILocation(line: 127, column: 7, scope: !275)
!281 = !DILocation(line: 131, column: 18, scope: !30)
!282 = !DILocation(line: 131, column: 21, scope: !30)
!283 = !DILocation(line: 131, column: 24, scope: !30)
!284 = !DILocation(line: 131, column: 30, scope: !30)
!285 = !DILocation(line: 131, column: 4, scope: !30)
!286 = !DILocation(line: 131, column: 10, scope: !30)
!287 = !DILocation(line: 131, column: 13, scope: !30)
!288 = !DILocation(line: 132, column: 26, scope: !30)
!289 = !DILocation(line: 132, column: 30, scope: !30)
!290 = !DILocation(line: 132, column: 33, scope: !30)
!291 = !DILocation(line: 132, column: 4, scope: !30)
!292 = !DILocation(line: 132, column: 10, scope: !30)
!293 = !DILocation(line: 132, column: 21, scope: !30)
!294 = !DILocation(line: 133, column: 25, scope: !30)
!295 = !DILocation(line: 133, column: 29, scope: !30)
!296 = !DILocation(line: 133, column: 32, scope: !30)
!297 = !DILocation(line: 133, column: 4, scope: !30)
!298 = !DILocation(line: 133, column: 10, scope: !30)
!299 = !DILocation(line: 133, column: 20, scope: !30)
!300 = !DILocation(line: 136, column: 32, scope: !30)
!301 = !DILocation(line: 136, column: 4, scope: !30)
!302 = !DILocation(line: 136, column: 10, scope: !30)
!303 = !DILocation(line: 136, column: 13, scope: !30)
!304 = !DILocation(line: 137, column: 20, scope: !30)
!305 = !DILocation(line: 137, column: 4, scope: !30)
!306 = !DILocation(line: 137, column: 10, scope: !30)
!307 = !DILocation(line: 137, column: 18, scope: !30)
!308 = !DILocation(line: 140, column: 27, scope: !30)
!309 = !DILocation(line: 140, column: 41, scope: !30)
!310 = !DILocation(line: 140, column: 4, scope: !30)
!311 = !DILocation(line: 140, column: 10, scope: !30)
!312 = !DILocation(line: 140, column: 25, scope: !30)
!313 = !DILocation(line: 142, column: 4, scope: !30)
!314 = !DILocation(line: 143, column: 1, scope: !30)
!315 = distinct !DISubprogram(name: "Message_Open", scope: !31, file: !31, line: 164, type: !316, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !53)
!316 = !DISubroutineType(types: !317)
!317 = !{!36, !22}
!318 = !DILocalVariable(name: "proto", arg: 1, scope: !315, file: !31, line: 164, type: !22)
!319 = !DILocation(line: 164, column: 21, scope: !315)
!320 = !DILocalVariable(name: "chan", scope: !315, file: !31, line: 166, type: !36)
!321 = !DILocation(line: 166, column: 21, scope: !315)
!322 = !DILocation(line: 166, column: 28, scope: !315)
!323 = !DILocation(line: 168, column: 8, scope: !324)
!324 = distinct !DILexicalBlock(scope: !315, file: !31, line: 168, column: 8)
!325 = !DILocation(line: 168, column: 13, scope: !324)
!326 = !DILocation(line: 168, column: 20, scope: !324)
!327 = !DILocation(line: 168, column: 46, scope: !328)
!328 = !DILexicalBlockFile(scope: !324, file: !31, discriminator: 1)
!329 = !DILocation(line: 168, column: 53, scope: !328)
!330 = !DILocation(line: 168, column: 24, scope: !328)
!331 = !DILocation(line: 168, column: 8, scope: !328)
!332 = !DILocation(line: 169, column: 12, scope: !333)
!333 = distinct !DILexicalBlock(scope: !324, file: !31, line: 168, column: 69)
!334 = !DILocation(line: 169, column: 7, scope: !333)
!335 = !DILocation(line: 170, column: 12, scope: !333)
!336 = !DILocation(line: 171, column: 4, scope: !333)
!337 = !DILocation(line: 172, column: 11, scope: !315)
!338 = !DILocation(line: 172, column: 4, scope: !315)
!339 = distinct !DISubprogram(name: "Message_Send", scope: !31, file: !31, line: 194, type: !340, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !53)
!340 = !DISubroutineType(types: !341)
!341 = !{!34, !36, !342, !47}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!344 = !DILocalVariable(name: "chan", arg: 1, scope: !339, file: !31, line: 194, type: !36)
!345 = !DILocation(line: 194, column: 31, scope: !339)
!346 = !DILocalVariable(name: "buf", arg: 2, scope: !339, file: !31, line: 195, type: !342)
!347 = !DILocation(line: 195, column: 35, scope: !339)
!348 = !DILocalVariable(name: "bufSize", arg: 3, scope: !339, file: !31, line: 196, type: !47)
!349 = !DILocation(line: 196, column: 21, scope: !339)
!350 = !DILocalVariable(name: "myBuf", scope: !339, file: !31, line: 198, type: !342)
!351 = !DILocation(line: 198, column: 25, scope: !339)
!352 = !DILocalVariable(name: "myBufSize", scope: !339, file: !31, line: 199, type: !47)
!353 = !DILocation(line: 199, column: 11, scope: !339)
!354 = !DILocalVariable(name: "bp", scope: !339, file: !31, line: 200, type: !66)
!355 = !DILocation(line: 200, column: 19, scope: !339)
!356 = !DILocation(line: 200, column: 4, scope: !339)
!357 = !DILocation(line: 203, column: 12, scope: !339)
!358 = !DILocation(line: 203, column: 10, scope: !339)
!359 = !DILocation(line: 204, column: 16, scope: !339)
!360 = !DILocation(line: 204, column: 14, scope: !339)
!361 = !DILocation(line: 211, column: 7, scope: !339)
!362 = !DILocation(line: 211, column: 10, scope: !339)
!363 = !DILocation(line: 211, column: 13, scope: !339)
!364 = !DILocation(line: 211, column: 19, scope: !339)
!365 = !DILocation(line: 211, column: 24, scope: !339)
!366 = !DILocation(line: 213, column: 26, scope: !339)
!367 = !DILocation(line: 213, column: 32, scope: !339)
!368 = !DILocation(line: 213, column: 7, scope: !339)
!369 = !DILocation(line: 213, column: 10, scope: !339)
!370 = !DILocation(line: 213, column: 13, scope: !339)
!371 = !DILocation(line: 213, column: 19, scope: !339)
!372 = !DILocation(line: 213, column: 24, scope: !339)
!373 = !DILocation(line: 214, column: 20, scope: !339)
!374 = !DILocation(line: 214, column: 26, scope: !339)
!375 = !DILocation(line: 214, column: 7, scope: !339)
!376 = !DILocation(line: 214, column: 10, scope: !339)
!377 = !DILocation(line: 214, column: 13, scope: !339)
!378 = !DILocation(line: 214, column: 18, scope: !339)
!379 = !DILocation(line: 215, column: 20, scope: !339)
!380 = !DILocation(line: 215, column: 26, scope: !339)
!381 = !DILocation(line: 215, column: 7, scope: !339)
!382 = !DILocation(line: 215, column: 10, scope: !339)
!383 = !DILocation(line: 215, column: 13, scope: !339)
!384 = !DILocation(line: 215, column: 18, scope: !339)
!385 = !DILocation(line: 217, column: 17, scope: !339)
!386 = !DILocation(line: 217, column: 7, scope: !339)
!387 = !DILocation(line: 217, column: 10, scope: !339)
!388 = !DILocation(line: 217, column: 15, scope: !339)
!389 = !DILocation(line: 219, column: 7, scope: !339)
!390 = !DILocation(line: 219, column: 10, scope: !339)
!391 = !DILocation(line: 219, column: 13, scope: !339)
!392 = !DILocation(line: 219, column: 19, scope: !339)
!393 = !DILocation(line: 219, column: 23, scope: !339)
!394 = !DILocation(line: 220, column: 4, scope: !339)
!395 = !DILocation(line: 223, column: 12, scope: !396)
!396 = distinct !DILexicalBlock(scope: !339, file: !31, line: 223, column: 8)
!397 = !DILocation(line: 223, column: 15, scope: !396)
!398 = !DILocation(line: 223, column: 18, scope: !396)
!399 = !DILocation(line: 223, column: 24, scope: !396)
!400 = !DILocation(line: 223, column: 9, scope: !396)
!401 = !DILocation(line: 223, column: 29, scope: !396)
!402 = !DILocation(line: 223, column: 39, scope: !396)
!403 = !DILocation(line: 223, column: 8, scope: !339)
!404 = !DILocation(line: 226, column: 7, scope: !405)
!405 = distinct !DILexicalBlock(scope: !396, file: !31, line: 223, column: 45)
!406 = !DILocation(line: 229, column: 11, scope: !407)
!407 = distinct !DILexicalBlock(scope: !339, file: !31, line: 229, column: 8)
!408 = !DILocation(line: 229, column: 14, scope: !407)
!409 = !DILocation(line: 229, column: 17, scope: !407)
!410 = !DILocation(line: 229, column: 23, scope: !407)
!411 = !DILocation(line: 229, column: 8, scope: !407)
!412 = !DILocation(line: 229, column: 28, scope: !407)
!413 = !DILocation(line: 229, column: 8, scope: !339)
!414 = !DILocation(line: 235, column: 11, scope: !415)
!415 = distinct !DILexicalBlock(scope: !416, file: !31, line: 235, column: 11)
!416 = distinct !DILexicalBlock(scope: !407, file: !31, line: 229, column: 38)
!417 = !DILocation(line: 235, column: 11, scope: !416)
!418 = !DILocalVariable(name: "bphb", scope: !419, file: !31, line: 236, type: !420)
!419 = distinct !DILexicalBlock(scope: !415, file: !31, line: 235, column: 22)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "Backdoor_proto_hb", file: !67, line: 123, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !67, line: 104, size: 448, align: 64, elements: !422)
!422 = !{!423, !489}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !421, file: !67, line: 113, baseType: !424, size: 448, align: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !421, file: !67, line: 105, size: 448, align: 64, elements: !425)
!425 = !{!426, !441, !456, !457, !472, !473, !474}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !424, file: !67, line: 106, baseType: !427, size: 64, align: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !424, file: !67, line: 106, size: 64, align: 64, elements: !428)
!428 = !{!429, !434, !435, !440}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !427, file: !67, line: 106, baseType: !430, size: 32, align: 16)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !427, file: !67, line: 106, size: 32, align: 16, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !430, file: !67, line: 106, baseType: !42, size: 16, align: 16)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !430, file: !67, line: 106, baseType: !42, size: 16, align: 16, offset: 16)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !427, file: !67, line: 106, baseType: !22, size: 32, align: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !427, file: !67, line: 106, baseType: !436, size: 64, align: 32)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !427, file: !67, line: 106, size: 64, align: 32, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !436, file: !67, line: 106, baseType: !22, size: 32, align: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !436, file: !67, line: 106, baseType: !22, size: 32, align: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !427, file: !67, line: 106, baseType: !88, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "bx", scope: !424, file: !67, line: 107, baseType: !442, size: 64, align: 64, offset: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !424, file: !67, line: 107, size: 64, align: 64, elements: !443)
!443 = !{!444, !449, !450, !455}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !442, file: !67, line: 107, baseType: !445, size: 32, align: 16)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !442, file: !67, line: 107, size: 32, align: 16, elements: !446)
!446 = !{!447, !448}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !445, file: !67, line: 107, baseType: !42, size: 16, align: 16)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !445, file: !67, line: 107, baseType: !42, size: 16, align: 16, offset: 16)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !442, file: !67, line: 107, baseType: !22, size: 32, align: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !442, file: !67, line: 107, baseType: !451, size: 64, align: 32)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !442, file: !67, line: 107, size: 64, align: 32, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !451, file: !67, line: 107, baseType: !22, size: 32, align: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !451, file: !67, line: 107, baseType: !22, size: 32, align: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !442, file: !67, line: 107, baseType: !88, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !424, file: !67, line: 108, baseType: !47, size: 64, align: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !424, file: !67, line: 109, baseType: !458, size: 64, align: 64, offset: 192)
!458 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !424, file: !67, line: 109, size: 64, align: 64, elements: !459)
!459 = !{!460, !465, !466, !471}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !458, file: !67, line: 109, baseType: !461, size: 32, align: 16)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !67, line: 109, size: 32, align: 16, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !461, file: !67, line: 109, baseType: !42, size: 16, align: 16)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !461, file: !67, line: 109, baseType: !42, size: 16, align: 16, offset: 16)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !458, file: !67, line: 109, baseType: !22, size: 32, align: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !458, file: !67, line: 109, baseType: !467, size: 64, align: 32)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !67, line: 109, size: 64, align: 32, elements: !468)
!468 = !{!469, !470}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !467, file: !67, line: 109, baseType: !22, size: 32, align: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !467, file: !67, line: 109, baseType: !22, size: 32, align: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !458, file: !67, line: 109, baseType: !88, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "srcAddr", scope: !424, file: !67, line: 110, baseType: !17, size: 64, align: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dstAddr", scope: !424, file: !67, line: 111, baseType: !17, size: 64, align: 64, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "bp", scope: !424, file: !67, line: 112, baseType: !475, size: 64, align: 64, offset: 384)
!475 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !424, file: !67, line: 112, size: 64, align: 64, elements: !476)
!476 = !{!477, !482, !483, !488}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !475, file: !67, line: 112, baseType: !478, size: 32, align: 16)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !475, file: !67, line: 112, size: 32, align: 16, elements: !479)
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !478, file: !67, line: 112, baseType: !42, size: 16, align: 16)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !478, file: !67, line: 112, baseType: !42, size: 16, align: 16, offset: 16)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !475, file: !67, line: 112, baseType: !22, size: 32, align: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !475, file: !67, line: 112, baseType: !484, size: 64, align: 32)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !475, file: !67, line: 112, size: 64, align: 32, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !484, file: !67, line: 112, baseType: !22, size: 32, align: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !484, file: !67, line: 112, baseType: !22, size: 32, align: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !475, file: !67, line: 112, baseType: !88, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !421, file: !67, line: 122, baseType: !490, size: 448, align: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !421, file: !67, line: 114, size: 448, align: 64, elements: !491)
!491 = !{!492, !507, !522, !537, !552, !567, !582}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !490, file: !67, line: 115, baseType: !493, size: 64, align: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !490, file: !67, line: 115, size: 64, align: 64, elements: !494)
!494 = !{!495, !500, !501, !506}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !493, file: !67, line: 115, baseType: !496, size: 32, align: 16)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !493, file: !67, line: 115, size: 32, align: 16, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !496, file: !67, line: 115, baseType: !42, size: 16, align: 16)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !496, file: !67, line: 115, baseType: !42, size: 16, align: 16, offset: 16)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !493, file: !67, line: 115, baseType: !22, size: 32, align: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !493, file: !67, line: 115, baseType: !502, size: 64, align: 32)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !493, file: !67, line: 115, size: 64, align: 32, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !502, file: !67, line: 115, baseType: !22, size: 32, align: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !502, file: !67, line: 115, baseType: !22, size: 32, align: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !493, file: !67, line: 115, baseType: !88, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "bx", scope: !490, file: !67, line: 116, baseType: !508, size: 64, align: 64, offset: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !490, file: !67, line: 116, size: 64, align: 64, elements: !509)
!509 = !{!510, !515, !516, !521}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !508, file: !67, line: 116, baseType: !511, size: 32, align: 16)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !508, file: !67, line: 116, size: 32, align: 16, elements: !512)
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !511, file: !67, line: 116, baseType: !42, size: 16, align: 16)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !511, file: !67, line: 116, baseType: !42, size: 16, align: 16, offset: 16)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !508, file: !67, line: 116, baseType: !22, size: 32, align: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !508, file: !67, line: 116, baseType: !517, size: 64, align: 32)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !508, file: !67, line: 116, size: 64, align: 32, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !517, file: !67, line: 116, baseType: !22, size: 32, align: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !517, file: !67, line: 116, baseType: !22, size: 32, align: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !508, file: !67, line: 116, baseType: !88, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !490, file: !67, line: 117, baseType: !523, size: 64, align: 64, offset: 128)
!523 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !490, file: !67, line: 117, size: 64, align: 64, elements: !524)
!524 = !{!525, !530, !531, !536}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !523, file: !67, line: 117, baseType: !526, size: 32, align: 16)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !523, file: !67, line: 117, size: 32, align: 16, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !526, file: !67, line: 117, baseType: !42, size: 16, align: 16)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !526, file: !67, line: 117, baseType: !42, size: 16, align: 16, offset: 16)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !523, file: !67, line: 117, baseType: !22, size: 32, align: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !523, file: !67, line: 117, baseType: !532, size: 64, align: 32)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !523, file: !67, line: 117, size: 64, align: 32, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !532, file: !67, line: 117, baseType: !22, size: 32, align: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !532, file: !67, line: 117, baseType: !22, size: 32, align: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !523, file: !67, line: 117, baseType: !88, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !490, file: !67, line: 118, baseType: !538, size: 64, align: 64, offset: 192)
!538 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !490, file: !67, line: 118, size: 64, align: 64, elements: !539)
!539 = !{!540, !545, !546, !551}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !538, file: !67, line: 118, baseType: !541, size: 32, align: 16)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !538, file: !67, line: 118, size: 32, align: 16, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !541, file: !67, line: 118, baseType: !42, size: 16, align: 16)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !541, file: !67, line: 118, baseType: !42, size: 16, align: 16, offset: 16)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !538, file: !67, line: 118, baseType: !22, size: 32, align: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !538, file: !67, line: 118, baseType: !547, size: 64, align: 32)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !538, file: !67, line: 118, size: 64, align: 32, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !547, file: !67, line: 118, baseType: !22, size: 32, align: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !547, file: !67, line: 118, baseType: !22, size: 32, align: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !538, file: !67, line: 118, baseType: !88, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "si", scope: !490, file: !67, line: 119, baseType: !553, size: 64, align: 64, offset: 256)
!553 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !490, file: !67, line: 119, size: 64, align: 64, elements: !554)
!554 = !{!555, !560, !561, !566}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !553, file: !67, line: 119, baseType: !556, size: 32, align: 16)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !553, file: !67, line: 119, size: 32, align: 16, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !556, file: !67, line: 119, baseType: !42, size: 16, align: 16)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !556, file: !67, line: 119, baseType: !42, size: 16, align: 16, offset: 16)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !553, file: !67, line: 119, baseType: !22, size: 32, align: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !553, file: !67, line: 119, baseType: !562, size: 64, align: 32)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !553, file: !67, line: 119, size: 64, align: 32, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !562, file: !67, line: 119, baseType: !22, size: 32, align: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !562, file: !67, line: 119, baseType: !22, size: 32, align: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !553, file: !67, line: 119, baseType: !88, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !490, file: !67, line: 120, baseType: !568, size: 64, align: 64, offset: 320)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !490, file: !67, line: 120, size: 64, align: 64, elements: !569)
!569 = !{!570, !575, !576, !581}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !568, file: !67, line: 120, baseType: !571, size: 32, align: 16)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !568, file: !67, line: 120, size: 32, align: 16, elements: !572)
!572 = !{!573, !574}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !571, file: !67, line: 120, baseType: !42, size: 16, align: 16)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !571, file: !67, line: 120, baseType: !42, size: 16, align: 16, offset: 16)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !568, file: !67, line: 120, baseType: !22, size: 32, align: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !568, file: !67, line: 120, baseType: !577, size: 64, align: 32)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !568, file: !67, line: 120, size: 64, align: 32, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !577, file: !67, line: 120, baseType: !22, size: 32, align: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !577, file: !67, line: 120, baseType: !22, size: 32, align: 32, offset: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !568, file: !67, line: 120, baseType: !88, size: 64, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "bp", scope: !490, file: !67, line: 121, baseType: !583, size: 64, align: 64, offset: 384)
!583 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !490, file: !67, line: 121, size: 64, align: 64, elements: !584)
!584 = !{!585, !590, !591, !596}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !583, file: !67, line: 121, baseType: !586, size: 32, align: 16)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !67, line: 121, size: 32, align: 16, elements: !587)
!587 = !{!588, !589}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !586, file: !67, line: 121, baseType: !42, size: 16, align: 16)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !586, file: !67, line: 121, baseType: !42, size: 16, align: 16, offset: 16)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !583, file: !67, line: 121, baseType: !22, size: 32, align: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !583, file: !67, line: 121, baseType: !592, size: 64, align: 32)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !67, line: 121, size: 64, align: 32, elements: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !592, file: !67, line: 121, baseType: !22, size: 32, align: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !592, file: !67, line: 121, baseType: !22, size: 32, align: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !583, file: !67, line: 121, baseType: !88, size: 64, align: 64)
!597 = !DILocation(line: 236, column: 28, scope: !419)
!598 = !DILocation(line: 238, column: 15, scope: !419)
!599 = !DILocation(line: 238, column: 18, scope: !419)
!600 = !DILocation(line: 238, column: 21, scope: !419)
!601 = !DILocation(line: 238, column: 27, scope: !419)
!602 = !DILocation(line: 238, column: 31, scope: !419)
!603 = !DILocation(line: 239, column: 15, scope: !419)
!604 = !DILocation(line: 239, column: 18, scope: !419)
!605 = !DILocation(line: 239, column: 21, scope: !419)
!606 = !DILocation(line: 239, column: 27, scope: !419)
!607 = !DILocation(line: 239, column: 32, scope: !419)
!608 = !DILocation(line: 240, column: 34, scope: !419)
!609 = !DILocation(line: 240, column: 40, scope: !419)
!610 = !DILocation(line: 240, column: 15, scope: !419)
!611 = !DILocation(line: 240, column: 18, scope: !419)
!612 = !DILocation(line: 240, column: 21, scope: !419)
!613 = !DILocation(line: 240, column: 27, scope: !419)
!614 = !DILocation(line: 240, column: 32, scope: !419)
!615 = !DILocation(line: 241, column: 28, scope: !419)
!616 = !DILocation(line: 241, column: 34, scope: !419)
!617 = !DILocation(line: 241, column: 15, scope: !419)
!618 = !DILocation(line: 241, column: 18, scope: !419)
!619 = !DILocation(line: 241, column: 21, scope: !419)
!620 = !DILocation(line: 241, column: 26, scope: !419)
!621 = !DILocation(line: 242, column: 28, scope: !419)
!622 = !DILocation(line: 242, column: 34, scope: !419)
!623 = !DILocation(line: 242, column: 15, scope: !419)
!624 = !DILocation(line: 242, column: 18, scope: !419)
!625 = !DILocation(line: 242, column: 26, scope: !419)
!626 = !DILocation(line: 243, column: 25, scope: !419)
!627 = !DILocation(line: 243, column: 15, scope: !419)
!628 = !DILocation(line: 243, column: 18, scope: !419)
!629 = !DILocation(line: 243, column: 23, scope: !419)
!630 = !DILocation(line: 244, column: 40, scope: !419)
!631 = !DILocation(line: 244, column: 28, scope: !419)
!632 = !DILocation(line: 244, column: 15, scope: !419)
!633 = !DILocation(line: 244, column: 18, scope: !419)
!634 = !DILocation(line: 244, column: 26, scope: !419)
!635 = !DILocation(line: 245, column: 10, scope: !419)
!636 = !DILocation(line: 246, column: 20, scope: !637)
!637 = distinct !DILexicalBlock(scope: !419, file: !31, line: 246, column: 14)
!638 = !DILocation(line: 246, column: 23, scope: !637)
!639 = !DILocation(line: 246, column: 26, scope: !637)
!640 = !DILocation(line: 246, column: 32, scope: !637)
!641 = !DILocation(line: 246, column: 15, scope: !637)
!642 = !DILocation(line: 246, column: 37, scope: !637)
!643 = !DILocation(line: 246, column: 47, scope: !637)
!644 = !DILocation(line: 246, column: 14, scope: !419)
!645 = !DILocation(line: 247, column: 23, scope: !646)
!646 = distinct !DILexicalBlock(scope: !647, file: !31, line: 247, column: 17)
!647 = distinct !DILexicalBlock(scope: !637, file: !31, line: 246, column: 53)
!648 = !DILocation(line: 247, column: 26, scope: !646)
!649 = !DILocation(line: 247, column: 29, scope: !646)
!650 = !DILocation(line: 247, column: 35, scope: !646)
!651 = !DILocation(line: 247, column: 18, scope: !646)
!652 = !DILocation(line: 247, column: 40, scope: !646)
!653 = !DILocation(line: 247, column: 50, scope: !646)
!654 = !DILocation(line: 247, column: 17, scope: !647)
!655 = !DILocation(line: 249, column: 16, scope: !656)
!656 = distinct !DILexicalBlock(scope: !646, file: !31, line: 247, column: 56)
!657 = !DILocation(line: 254, column: 13, scope: !647)
!658 = !DILocation(line: 256, column: 7, scope: !419)
!659 = !DILocation(line: 257, column: 4, scope: !416)
!660 = !DILocation(line: 263, column: 7, scope: !661)
!661 = distinct !DILexicalBlock(scope: !407, file: !31, line: 257, column: 11)
!662 = !DILocation(line: 264, column: 14, scope: !663)
