; ModuleID = './hgfsChannelGuestBd.o.i'
source_filename = "./hgfsChannelGuestBd.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.HgfsGuestChannelCBTable = type { i8 (%struct.HgfsServerSessionCallbacks*, i8*, i8*, %struct.HgfsGuestConn**)*, void (%struct.HgfsGuestConn*)*, i8 (%struct.HgfsGuestConn*, i8*, i64, i8*, i64*)*, i32 (%struct.HgfsGuestConn*)* }
%struct.HgfsServerSessionCallbacks = type { i8 (i8*, %struct.HgfsServerChannelCallbacks*, %struct.HgfsServerChannelData*, i8**)*, void (i8*)*, void (i8*)*, void (%struct.HgfsPacket*, i8*)*, void (i8*, %struct.DblLnkLst_Links*)*, i32 (i8*)*, void (%struct.HgfsPacket*, i8*)*, void (i8*, i32)* }
%struct.HgfsServerChannelCallbacks = type { void ()*, void ()*, i8* (i64, i32, i8**)*, i8* (i64, i32, i8**)*, void (i8**)*, i8 (i8*, %struct.HgfsPacket*, i32)* }
%struct.HgfsPacket = type { i64, i64, i8*, i64, i32, i64, i8, i32, i8*, i64, i32, i64, i32, i8, i32, i8*, i64, i64, i8, [2 x %struct.HgfsVmxIov], i32, [1 x %struct.HgfsVmxIov] }
%struct.HgfsVmxIov = type { i8*, i64, i32, i8* }
%struct.HgfsServerChannelData = type { i32, i32 }
%struct.DblLnkLst_Links = type { %struct.DblLnkLst_Links*, %struct.DblLnkLst_Links* }
%struct.HgfsGuestConn = type { %struct.Atomic_uint32, i32, %struct.HgfsServerSessionCallbacks*, %struct.HgfsServerChannelCallbacks, i8*, i64, i8*, [63488 x i8] }
%struct.Atomic_uint32 = type { i32 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19, globals: !26)
!1 = !DIFile(filename: "hgfsChannelGuestBd.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line436")
!2 = !{!3, !9, !13}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 36, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hgfsServer.h", directory: "/home/lichi/Desktop/open-vm-tools/line436")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "BUF_READABLE", value: 0)
!7 = !DIEnumerator(name: "BUF_WRITEABLE", value: 1)
!8 = !DIEnumerator(name: "BUF_READWRITEABLE", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 164, size: 32, align: 32, elements: !10)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "HGFS_QUIESCE_FREEZE", value: 0)
!12 = !DIEnumerator(name: "HGFS_QUIESCE_THAW", value: 1)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 35, size: 32, align: 32, elements: !15)
!14 = !DIFile(filename: "hgfsChannelGuestBd.c", directory: "/home/lichi/Desktop/open-vm-tools/line436")
!15 = !{!16, !17, !18}
!16 = !DIEnumerator(name: "HGFS_GST_CONN_UNINITIALIZED", value: 0)
!17 = !DIEnumerator(name: "HGFS_GST_CONN_NOTCONNECTED", value: 1)
!18 = !DIEnumerator(name: "HGFS_GST_CONN_CONNECTED", value: 2)
!19 = !{!20, !21}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !22, line: 173, baseType: !23)
!22 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line436")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !24, line: 51, baseType: !25)
!24 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line436")
!25 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!26 = !{!27, !201}
!27 = distinct !DIGlobalVariable(name: "gGuestBackdoorOps", scope: !0, file: !14, line: 71, type: !28, isLocal: false, isDefinition: true, variable: %struct.HgfsGuestChannelCBTable* @gGuestBackdoorOps)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsGuestChannelCBTable", file: !30, line: 55, baseType: !31)
!30 = !DIFile(filename: "hgfsChannelGuestInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line436")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsGuestChannelCBTable", file: !30, line: 50, size: 256, align: 64, elements: !32)
!32 = !{!33, !185, !189, !197}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !31, file: !30, line: 51, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !39, !20, !20, !161}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !22, line: 230, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerSessionCallbacks", file: !4, line: 201, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerSessionCallbacks", file: !4, line: 192, size: 512, align: 64, elements: !43)
!43 = !{!44, !130, !134, !135, !139, !151, !155, !156}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "connect", scope: !42, file: !4, line: 193, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!37, !20, !48, !123, !67}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerChannelCallbacks", file: !4, line: 190, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerChannelCallbacks", file: !4, line: 183, size: 384, align: 64, elements: !51)
!51 = !{!52, !57, !59, !68, !69, !74}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "registerThread", scope: !50, file: !4, line: 184, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelRegisterThreadFunc", file: !4, line: 180, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "unregisterThread", scope: !50, file: !4, line: 185, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelUnregisterThreadFunc", file: !4, line: 181, baseType: !54)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "getReadVa", scope: !50, file: !4, line: 186, baseType: !60, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelMapVirtAddrFunc", file: !4, line: 178, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!20, !64, !21, !67}
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !22, line: 171, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !24, line: 55, baseType: !66)
!66 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "getWriteVa", scope: !50, file: !4, line: 187, baseType: !60, size: 64, align: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "putVa", scope: !50, file: !4, line: 188, baseType: !70, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelUnmapVirtAddrFunc", file: !4, line: 179, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !67}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !50, file: !4, line: 189, baseType: !75, size: 64, align: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelSendFunc", file: !4, line: 175, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!37, !20, !79, !122}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsPacket", file: !4, line: 78, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsPacket", file: !4, line: 45, size: 1920, align: 64, elements: !82)
!82 = !{!83, !84, !86, !87, !90, !91, !92, !93, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !117, !118}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !81, file: !4, line: 46, baseType: !64, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !81, file: !4, line: 48, baseType: !85, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsStateFlags", file: !4, line: 42, baseType: !64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacket", scope: !81, file: !4, line: 51, baseType: !20, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacketSize", scope: !81, file: !4, line: 52, baseType: !88, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !89, line: 216, baseType: !66)
!89 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line436")
!90 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacketMappedIov", scope: !81, file: !4, line: 53, baseType: !21, size: 32, align: 32, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacketDataSize", scope: !81, file: !4, line: 54, baseType: !88, size: 64, align: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacketIsAllocated", scope: !81, file: !4, line: 55, baseType: !37, size: 8, align: 8, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "metaMappingType", scope: !81, file: !4, line: 56, baseType: !94, size: 32, align: 32, offset: 416)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "MappingType", file: !4, line: 40, baseType: !3)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacket", scope: !81, file: !4, line: 58, baseType: !20, size: 64, align: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketSize", scope: !81, file: !4, line: 59, baseType: !88, size: 64, align: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketMappedIov", scope: !81, file: !4, line: 60, baseType: !21, size: 32, align: 32, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketDataSize", scope: !81, file: !4, line: 61, baseType: !88, size: 64, align: 64, offset: 640)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketIovIndex", scope: !81, file: !4, line: 62, baseType: !21, size: 32, align: 32, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketIsAllocated", scope: !81, file: !4, line: 63, baseType: !37, size: 8, align: 8, offset: 736)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "dataMappingType", scope: !81, file: !4, line: 65, baseType: !94, size: 32, align: 32, offset: 768)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "replyPacket", scope: !81, file: !4, line: 67, baseType: !20, size: 64, align: 64, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "replyPacketSize", scope: !81, file: !4, line: 68, baseType: !88, size: 64, align: 64, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "replyPacketDataSize", scope: !81, file: !4, line: 69, baseType: !88, size: 64, align: 64, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "replyPacketIsAllocated", scope: !81, file: !4, line: 70, baseType: !37, size: 8, align: 8, offset: 1024)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "channelIov", scope: !81, file: !4, line: 73, baseType: !107, size: 512, align: 64, offset: 1088)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 512, align: 64, elements: !115)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsVmxIov", file: !4, line: 34, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsVmxIov", file: !4, line: 29, size: 256, align: 64, elements: !110)
!110 = !{!111, !112, !113, !114}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "va", scope: !109, file: !4, line: 30, baseType: !20, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pa", scope: !109, file: !4, line: 31, baseType: !64, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !109, file: !4, line: 32, baseType: !21, size: 32, align: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !109, file: !4, line: 33, baseType: !20, size: 64, align: 64, offset: 192)
!115 = !{!116}
!116 = !DISubrange(count: 2)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "iovCount", scope: !81, file: !4, line: 75, baseType: !21, size: 32, align: 32, offset: 1600)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !81, file: !4, line: 76, baseType: !119, size: 256, align: 64, offset: 1664)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 256, align: 64, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 1)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSendFlags", file: !4, line: 98, baseType: !21)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerChannelData", file: !4, line: 111, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerChannelData", file: !4, line: 108, size: 64, align: 32, elements: !126)
!126 = !{!127, !129}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !125, file: !4, line: 109, baseType: !128, size: 32, align: 32)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelFlags", file: !4, line: 104, baseType: !21)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "maxPacketSize", scope: !125, file: !4, line: 110, baseType: !21, size: 32, align: 32, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !42, file: !4, line: 194, baseType: !131, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !20}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !42, file: !4, line: 195, baseType: !131, size: 64, align: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "receive", scope: !42, file: !4, line: 196, baseType: !136, size: 64, align: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !79, !20}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "invalidateObjects", scope: !42, file: !4, line: 197, baseType: !140, size: 64, align: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !20, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "DblLnkLst_Links", file: !145, line: 94, baseType: !146)
!145 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dbllnklst.h", directory: "/home/lichi/Desktop/open-vm-tools/line436")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DblLnkLst_Links", file: !145, line: 91, size: 128, align: 64, elements: !147)
!147 = !{!148, !150}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !146, file: !145, line: 92, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !146, file: !145, line: 93, baseType: !149, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "invalidateInactiveSessions", scope: !42, file: !4, line: 198, baseType: !152, size: 64, align: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!21, !20}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sendComplete", scope: !42, file: !4, line: 199, baseType: !136, size: 64, align: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "quiesce", scope: !42, file: !4, line: 200, baseType: !157, size: 64, align: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !20, !160}
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsQuiesceOp", file: !4, line: 167, baseType: !9)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsGuestConn", file: !14, line: 43, size: 508608, align: 64, elements: !164)
!164 = !{!165, !172, !174, !175, !176, !177, !178, !181}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", scope: !163, file: !14, line: 44, baseType: !166, size: 32, align: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint32", file: !167, line: 135, baseType: !168)
!167 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_atomic.h", directory: "/home/lichi/Desktop/open-vm-tools/line436")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint32", file: !167, line: 133, size: 32, align: 32, elements: !169)
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !168, file: !167, line: 134, baseType: !171, size: 32, align: 32)
!171 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !21)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !163, file: !14, line: 45, baseType: !173, size: 32, align: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsGuestConnState", file: !14, line: 39, baseType: !13)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "serverCbTable", scope: !163, file: !14, line: 46, baseType: !39, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "channelCbTable", scope: !163, file: !14, line: 47, baseType: !49, size: 384, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "serverSession", scope: !163, file: !14, line: 48, baseType: !20, size: 64, align: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "packetOutLen", scope: !163, file: !14, line: 49, baseType: !88, size: 64, align: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "clientPacketOut", scope: !163, file: !14, line: 50, baseType: !179, size: 64, align: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "packetOut", scope: !163, file: !14, line: 51, baseType: !182, size: 507904, align: 8, offset: 704)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 507904, align: 8, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 63488)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !31, file: !30, line: 52, baseType: !186, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !162}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "receive", scope: !31, file: !30, line: 53, baseType: !190, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!37, !162, !193, !88, !195, !196}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "invalidateInactiveSessions", scope: !31, file: !30, line: 54, baseType: !198, size: 64, align: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!21, !162}
!201 = distinct !DIGlobalVariable(name: "HgfsBdCapData", scope: !202, file: !14, line: 345, type: !124, isLocal: true, isDefinition: true, variable: %struct.HgfsServerChannelData* @HgfsChannelGuestConnConnect.HgfsBdCapData)
!202 = distinct !DISubprogram(name: "HgfsChannelGuestConnConnect", scope: !14, file: !14, line: 342, type: !203, isLocal: true, isDefinition: true, scopeLine: 343, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !207)
!203 = !DISubroutineType(types: !204)
!204 = !{!37, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsGuestConn", file: !14, line: 52, baseType: !163)
!207 = !{}
!208 = !{i32 2, !"Dwarf Version", i32 4}
!209 = !{i32 2, !"Debug Info Version", i32 3}
!210 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!211 = distinct !DISubprogram(name: "HgfsChannelGuestBdInit", scope: !14, file: !14, line: 679, type: !212, isLocal: true, isDefinition: true, scopeLine: 683, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !207)
!212 = !DISubroutineType(types: !213)
!213 = !{!37, !39, !20, !20, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!215 = !DILocalVariable(name: "serverCBTable", arg: 1, scope: !211, file: !14, line: 679, type: !39)
!216 = !DIExpression()
!217 = !DILocation(line: 679, column: 58, scope: !211)
!218 = !DILocalVariable(name: "rpc", arg: 2, scope: !211, file: !14, line: 680, type: !20)
!219 = !DILocation(line: 680, column: 30, scope: !211)
!220 = !DILocalVariable(name: "rpcCallback", arg: 3, scope: !211, file: !14, line: 681, type: !20)
!221 = !DILocation(line: 681, column: 30, scope: !211)
!222 = !DILocalVariable(name: "connection", arg: 4, scope: !211, file: !14, line: 682, type: !214)
!223 = !DILocation(line: 682, column: 40, scope: !211)
!224 = !DILocalVariable(name: "connData", scope: !211, file: !14, line: 684, type: !205)
!225 = !DILocation(line: 684, column: 19, scope: !211)
!226 = !DILocalVariable(name: "result", scope: !211, file: !14, line: 685, type: !37)
!227 = !DILocation(line: 685, column: 9, scope: !211)
!228 = !DILocation(line: 691, column: 38, scope: !211)
!229 = !DILocation(line: 690, column: 13, scope: !211)
!230 = !DILocation(line: 690, column: 11, scope: !211)
!231 = !DILocation(line: 692, column: 9, scope: !232)
!232 = distinct !DILexicalBlock(scope: !211, file: !14, line: 692, column: 8)
!233 = !DILocation(line: 692, column: 8, scope: !211)
!234 = !DILocation(line: 693, column: 7, scope: !235)
!235 = distinct !DILexicalBlock(scope: !232, file: !14, line: 692, column: 17)
!236 = !DILocation(line: 694, column: 7, scope: !235)
!237 = !DILocation(line: 700, column: 31, scope: !211)
!238 = !DILocation(line: 701, column: 31, scope: !211)
!239 = !DILocation(line: 702, column: 31, scope: !211)
!240 = !DILocation(line: 700, column: 4, scope: !211)
!241 = !DILocation(line: 705, column: 9, scope: !242)
!242 = distinct !DILexicalBlock(scope: !211, file: !14, line: 705, column: 8)
!243 = !DILocation(line: 705, column: 8, scope: !211)
!244 = !DILocation(line: 706, column: 18, scope: !245)
!245 = distinct !DILexicalBlock(scope: !246, file: !14, line: 706, column: 10)
!246 = distinct !DILexicalBlock(scope: !242, file: !14, line: 705, column: 17)
!247 = !DILocation(line: 706, column: 15, scope: !245)
!248 = !DILocation(line: 706, column: 10, scope: !246)
!249 = !DILocation(line: 707, column: 33, scope: !250)
!250 = distinct !DILexicalBlock(scope: !245, file: !14, line: 706, column: 28)
!251 = !DILocation(line: 707, column: 10, scope: !250)
!252 = !DILocation(line: 708, column: 19, scope: !250)
