; ModuleID = './vmware_guestproxycerttool-cert_key.o.i'
source_filename = "./vmware_guestproxycerttool-cert_key.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._GString = type { i8*, i64, i64 }
%struct.x509_st = type { %struct.x509_cinf_st*, %struct.X509_algor_st*, %struct.asn1_string_st*, i32, i32, i8*, %struct.crypto_ex_data_st, i64, i64, i64, i64, i64, i64, %struct.asn1_string_st*, %struct.AUTHORITY_KEYID_st*, %struct.X509_POLICY_CACHE_st*, %struct.stack_st_DIST_POINT*, %struct.stack_st_GENERAL_NAME*, %struct.NAME_CONSTRAINTS_st*, [20 x i8], %struct.x509_cert_aux_st* }
%struct.x509_cinf_st = type { %struct.asn1_string_st*, %struct.asn1_string_st*, %struct.X509_algor_st*, %struct.X509_name_st*, %struct.X509_val_st*, %struct.X509_name_st*, %struct.X509_pubkey_st*, %struct.asn1_string_st*, %struct.asn1_string_st*, %struct.stack_st_X509_EXTENSION*, %struct.ASN1_ENCODING_st }
%struct.X509_val_st = type { %struct.asn1_string_st*, %struct.asn1_string_st* }
%struct.X509_name_st = type { %struct.stack_st_X509_NAME_ENTRY*, i32, %struct.buf_mem_st*, i8*, i32 }
%struct.stack_st_X509_NAME_ENTRY = type { %struct.stack_st }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "vmware_guestproxycerttool-cert_key.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!2 = !{}
!3 = !{!4, !5, !7, !24, !32}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "_STACK", file: !9, line: 72, baseType: !10)
!9 = !DIFile(filename: "/usr/include/openssl/stack.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !9, line: 66, size: 256, align: 64, elements: !11)
!11 = !{!12, !14, !16, !17, !18}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !10, file: !9, line: 67, baseType: !13, size: 32, align: 32)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !10, file: !9, line: 68, baseType: !15, size: 64, align: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !10, file: !9, line: 69, baseType: !13, size: 32, align: 32, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "num_alloc", scope: !10, file: !9, line: 70, baseType: !13, size: 32, align: 32, offset: 160)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !10, file: !9, line: 71, baseType: !19, size: 64, align: 64, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!13, !22, !22}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_VALUE", file: !26, line: 78, baseType: !27)
!26 = !DIFile(filename: "/usr/include/openssl/conf.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 74, size: 192, align: 64, elements: !28)
!28 = !{!29, !30, !31}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !27, file: !26, line: 75, baseType: !5, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !27, file: !26, line: 76, baseType: !5, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !27, file: !26, line: 77, baseType: !5, size: 64, align: 64, offset: 128)
!32 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!33 = !{i32 2, !"Dwarf Version", i32 4}
!34 = !{i32 2, !"Debug Info Version", i32 3}
!35 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!36 = distinct !DISubprogram(name: "GetSSLError", scope: !37, file: !37, line: 59, type: !38, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!37 = !DIFile(filename: "cert_key.c", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !43}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !42, line: 46, baseType: !6)
!42 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!44 = !DILocalVariable(name: "errorStr", arg: 1, scope: !36, file: !37, line: 59, type: !43)
!45 = !DIExpression()
!46 = !DILocation(line: 59, column: 21, scope: !36)
!47 = !DILocalVariable(name: "code", scope: !36, file: !37, line: 61, type: !48)
!48 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!49 = !DILocation(line: 61, column: 18, scope: !36)
!50 = !DILocalVariable(name: "str", scope: !36, file: !37, line: 62, type: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !53, line: 39, baseType: !54)
!53 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !53, line: 41, size: 192, align: 64, elements: !55)
!55 = !{!56, !57, !60}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !54, file: !53, line: 43, baseType: !40, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !54, file: !53, line: 44, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !59, line: 66, baseType: !48)
!59 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!60 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !54, file: !53, line: 45, baseType: !58, size: 64, align: 64, offset: 128)
!61 = !DILocation(line: 62, column: 13, scope: !36)
!62 = !DILocation(line: 62, column: 19, scope: !36)
!63 = !DILocalVariable(name: "first", scope: !36, file: !37, line: 63, type: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !42, line: 50, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !42, line: 49, baseType: !13)
!66 = !DILocation(line: 63, column: 13, scope: !36)
!67 = !DILocalVariable(name: "buf", scope: !36, file: !37, line: 64, type: !68)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32768, align: 8, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 4096)
!71 = !DILocation(line: 64, column: 9, scope: !36)
!72 = !DILocation(line: 66, column: 4, scope: !36)
!73 = !DILocation(line: 66, column: 19, scope: !74)
!74 = !DILexicalBlockFile(scope: !36, file: !37, discriminator: 1)
!75 = !DILocation(line: 66, column: 17, scope: !74)
!76 = !DILocation(line: 66, column: 36, scope: !74)
!77 = !DILocation(line: 66, column: 4, scope: !74)
!78 = !DILocation(line: 67, column: 26, scope: !79)
!79 = distinct !DILexicalBlock(scope: !36, file: !37, line: 66, column: 42)
!80 = !DILocation(line: 67, column: 32, scope: !79)
!81 = !DILocation(line: 67, column: 7, scope: !79)
!82 = !DILocation(line: 68, column: 30, scope: !79)
!83 = !DILocation(line: 68, column: 43, scope: !79)
!84 = !DILocation(line: 68, column: 62, scope: !79)
!85 = !DILocation(line: 68, column: 7, scope: !79)
!86 = !DILocation(line: 69, column: 13, scope: !79)
!87 = !DILocation(line: 66, column: 4, scope: !88)
!88 = !DILexicalBlockFile(scope: !36, file: !37, discriminator: 2)
!89 = distinct !{!89, !72}
!90 = !DILocation(line: 72, column: 30, scope: !36)
!91 = !DILocation(line: 72, column: 16, scope: !36)
!92 = !DILocation(line: 72, column: 5, scope: !36)
!93 = !DILocation(line: 72, column: 14, scope: !36)
!94 = !DILocation(line: 74, column: 12, scope: !36)
!95 = !DILocation(line: 74, column: 11, scope: !36)
!96 = !DILocation(line: 74, column: 4, scope: !36)
!97 = distinct !DISubprogram(name: "CertKey_InitOpenSSLLib", scope: !37, file: !37, line: 95, type: !98, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!98 = !DISubroutineType(types: !99)
!99 = !{null}
!100 = !DILocation(line: 97, column: 4, scope: !97)
!101 = !DILocation(line: 98, column: 4, scope: !97)
!102 = !DILocation(line: 99, column: 1, scope: !97)
!103 = distinct !DISubprogram(name: "CertKey_ComputeCertPemFileHash", scope: !37, file: !37, line: 120, type: !104, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!104 = !DISubroutineType(types: !105)
!105 = !{!40, !106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!108 = !DILocalVariable(name: "certPemFile", arg: 1, scope: !103, file: !37, line: 120, type: !106)
!109 = !DILocation(line: 120, column: 45, scope: !103)
!110 = !DILocalVariable(name: "file", scope: !103, file: !37, line: 122, type: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !113, line: 48, baseType: !114)
!113 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !115, line: 241, size: 1728, align: 64, elements: !116)
!115 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !137, !138, !139, !140, !143, !145, !147, !151, !154, !156, !157, !158, !159, !160, !163, !164}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !114, file: !115, line: 242, baseType: !13, size: 32, align: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !114, file: !115, line: 247, baseType: !5, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !114, file: !115, line: 248, baseType: !5, size: 64, align: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !114, file: !115, line: 249, baseType: !5, size: 64, align: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !114, file: !115, line: 250, baseType: !5, size: 64, align: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !114, file: !115, line: 251, baseType: !5, size: 64, align: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !114, file: !115, line: 252, baseType: !5, size: 64, align: 64, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !114, file: !115, line: 253, baseType: !5, size: 64, align: 64, offset: 448)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !114, file: !115, line: 254, baseType: !5, size: 64, align: 64, offset: 512)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !114, file: !115, line: 256, baseType: !5, size: 64, align: 64, offset: 576)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !114, file: !115, line: 257, baseType: !5, size: 64, align: 64, offset: 640)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !114, file: !115, line: 258, baseType: !5, size: 64, align: 64, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !114, file: !115, line: 260, baseType: !130, size: 64, align: 64, offset: 768)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !115, line: 156, size: 192, align: 64, elements: !132)
!132 = !{!133, !134, !136}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !131, file: !115, line: 157, baseType: !130, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !131, file: !115, line: 158, baseType: !135, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !131, file: !115, line: 162, baseType: !13, size: 32, align: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !114, file: !115, line: 262, baseType: !135, size: 64, align: 64, offset: 832)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !114, file: !115, line: 264, baseType: !13, size: 32, align: 32, offset: 896)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !114, file: !115, line: 268, baseType: !13, size: 32, align: 32, offset: 928)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !114, file: !115, line: 270, baseType: !141, size: 64, align: 64, offset: 960)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !142, line: 131, baseType: !32)
!142 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !114, file: !115, line: 274, baseType: !144, size: 16, align: 16, offset: 1024)
!144 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !114, file: !115, line: 275, baseType: !146, size: 8, align: 8, offset: 1040)
!146 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !114, file: !115, line: 276, baseType: !148, size: 8, align: 8, offset: 1048)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 8, align: 8, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 1)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !114, file: !115, line: 280, baseType: !152, size: 64, align: 64, offset: 1088)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !115, line: 150, baseType: null)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !114, file: !115, line: 289, baseType: !155, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !142, line: 132, baseType: !32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !114, file: !115, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !114, file: !115, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !114, file: !115, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !114, file: !115, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !114, file: !115, line: 302, baseType: !161, size: 64, align: 64, offset: 1472)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !162, line: 216, baseType: !48)
!162 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !114, file: !115, line: 303, baseType: !13, size: 32, align: 32, offset: 1536)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !114, file: !115, line: 305, baseType: !165, size: 160, align: 8, offset: 1568)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 160, align: 8, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 20)
!168 = !DILocation(line: 122, column: 10, scope: !103)
!169 = !DILocalVariable(name: "hash", scope: !103, file: !37, line: 123, type: !40)
!170 = !DILocation(line: 123, column: 11, scope: !103)
!171 = !DILocalVariable(name: "cert", scope: !103, file: !37, line: 124, type: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !174, line: 154, baseType: !175)
!174 = !DIFile(filename: "/usr/include/openssl/ossl_typ.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !176, line: 270, size: 1472, align: 64, elements: !177)
!176 = !DIFile(filename: "/usr/include/openssl/x509.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!177 = !{!178, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !642, !646, !651, !653, !664, !666}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "cert_info", scope: !175, file: !176, line: 271, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CINF", file: !176, line: 254, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_cinf_st", file: !176, line: 242, size: 832, align: 64, elements: !182)
!182 = !{!183, !195, !196, !278, !300, !309, !310, !601, !602, !603, !608}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !181, file: !176, line: 243, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !174, line: 83, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !187, line: 247, size: 192, align: 64, elements: !188)
!187 = !DIFile(filename: "/usr/include/openssl/asn1.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!188 = !{!189, !190, !191, !194}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !186, file: !187, line: 248, baseType: !13, size: 32, align: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !186, file: !187, line: 249, baseType: !13, size: 32, align: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !186, file: !187, line: 250, baseType: !192, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !186, file: !187, line: 256, baseType: !32, size: 64, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !181, file: !176, line: 244, baseType: !184, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !181, file: !176, line: 245, baseType: !197, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !174, line: 155, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !176, line: 143, size: 128, align: 64, elements: !200)
!200 = !{!201, !216}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !199, file: !176, line: 144, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !174, line: 103, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !187, line: 218, size: 320, align: 64, elements: !205)
!205 = !{!206, !209, !210, !211, !212, !215}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sn", scope: !204, file: !187, line: 219, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ln", scope: !204, file: !187, line: 219, baseType: !207, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "nid", scope: !204, file: !187, line: 220, baseType: !13, size: 32, align: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !204, file: !187, line: 221, baseType: !13, size: 32, align: 32, offset: 160)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !204, file: !187, line: 222, baseType: !213, size: 64, align: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !204, file: !187, line: 223, baseType: !13, size: 32, align: 32, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !199, file: !176, line: 145, baseType: !217, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !187, line: 561, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !187, line: 532, size: 128, align: 64, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !219, file: !187, line: 533, baseType: !13, size: 32, align: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !219, file: !187, line: 560, baseType: !223, size: 64, align: 64, offset: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !219, file: !187, line: 534, size: 64, align: 64, elements: !224)
!224 = !{!225, !226, !228, !231, !232, !233, !236, !239, !242, !245, !248, !251, !254, !257, !260, !263, !266, !269, !272, !273, !274}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !223, file: !187, line: 535, baseType: !5, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !223, file: !187, line: 536, baseType: !227, size: 32, align: 32)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !174, line: 99, baseType: !13)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !223, file: !187, line: 537, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !174, line: 98, baseType: !186)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !223, file: !187, line: 538, baseType: !202, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !223, file: !187, line: 539, baseType: !184, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !223, file: !187, line: 540, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !174, line: 84, baseType: !186)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !223, file: !187, line: 541, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !174, line: 85, baseType: !186)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !223, file: !187, line: 542, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !174, line: 86, baseType: !186)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !223, file: !187, line: 543, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !174, line: 87, baseType: !186)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !223, file: !187, line: 544, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !174, line: 88, baseType: !186)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !223, file: !187, line: 545, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !174, line: 89, baseType: !186)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !223, file: !187, line: 546, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !174, line: 90, baseType: !186)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !223, file: !187, line: 547, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !174, line: 92, baseType: !186)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !223, file: !187, line: 548, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !174, line: 91, baseType: !186)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !223, file: !187, line: 549, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !174, line: 93, baseType: !186)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !223, file: !187, line: 550, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !174, line: 95, baseType: !186)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !223, file: !187, line: 551, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !174, line: 96, baseType: !186)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !223, file: !187, line: 552, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !174, line: 97, baseType: !186)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !223, file: !187, line: 557, baseType: !229, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !223, file: !187, line: 558, baseType: !229, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !223, file: !187, line: 559, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !187, line: 307, baseType: !277)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !187, line: 307, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !181, file: !176, line: 246, baseType: !279, size: 64, align: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !174, line: 159, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !176, line: 179, size: 320, align: 64, elements: !282)
!282 = !{!283, !288, !289, !298, !299}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !281, file: !176, line: 180, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_NAME_ENTRY", file: !176, line: 175, size: 256, align: 64, elements: !286)
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !285, file: !176, line: 175, baseType: !8, size: 256, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !281, file: !176, line: 181, baseType: !13, size: 32, align: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !281, file: !176, line: 183, baseType: !290, size: 64, align: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUF_MEM", file: !174, line: 127, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_mem_st", file: !293, line: 77, size: 192, align: 64, elements: !294)
!293 = !DIFile(filename: "/usr/include/openssl/buffer.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!294 = !{!295, !296, !297}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !292, file: !293, line: 78, baseType: !161, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !292, file: !293, line: 79, baseType: !5, size: 64, align: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !292, file: !293, line: 80, baseType: !161, size: 64, align: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "canon_enc", scope: !281, file: !176, line: 188, baseType: !192, size: 64, align: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "canon_enclen", scope: !281, file: !176, line: 189, baseType: !13, size: 32, align: 32, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "validity", scope: !181, file: !176, line: 247, baseType: !301, size: 64, align: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_VAL", file: !176, line: 155, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_val_st", file: !176, line: 152, size: 128, align: 64, elements: !304)
!304 = !{!305, !308}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "notBefore", scope: !303, file: !176, line: 153, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TIME", file: !174, line: 94, baseType: !186)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "notAfter", scope: !303, file: !176, line: 154, baseType: !306, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "subject", scope: !181, file: !176, line: 248, baseType: !279, size: 64, align: 64, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !181, file: !176, line: 249, baseType: !311, size: 64, align: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_PUBKEY", file: !174, line: 160, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_pubkey_st", file: !176, line: 157, size: 192, align: 64, elements: !314)
!314 = !{!315, !316, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "algor", scope: !313, file: !176, line: 158, baseType: !197, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "public_key", scope: !313, file: !176, line: 159, baseType: !237, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !313, file: !176, line: 160, baseType: !318, size: 64, align: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !174, line: 133, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !321, line: 129, size: 448, align: 64, elements: !322)
!321 = !DIFile(filename: "/usr/include/openssl/evp.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!322 = !{!323, !324, !325, !326, !331, !335, !595, !596}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !320, file: !321, line: 130, baseType: !13, size: 32, align: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "save_type", scope: !320, file: !321, line: 131, baseType: !13, size: 32, align: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !320, file: !321, line: 132, baseType: !13, size: 32, align: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ameth", scope: !320, file: !321, line: 133, baseType: !327, size: 64, align: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY_ASN1_METHOD", file: !174, line: 135, baseType: !330)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_asn1_method_st", file: !174, line: 135, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !320, file: !321, line: 134, baseType: !332, size: 64, align: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENGINE", file: !174, line: 177, baseType: !334)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "engine_st", file: !174, line: 177, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !320, file: !321, line: 149, baseType: !336, size: 64, align: 64, offset: 256)
!336 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !320, file: !321, line: 135, size: 64, align: 64, elements: !337)
!337 = !{!338, !339, !470, !539, !592}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !336, file: !321, line: 136, baseType: !5, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "rsa", scope: !336, file: !321, line: 138, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rsa_st", file: !342, line: 132, size: 1344, align: 64, elements: !343)
!342 = !DIFile(filename: "/usr/include/openssl/rsa.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!343 = !{!344, !345, !346, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !459, !460, !461, !462, !463, !464, !465, !469}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !341, file: !342, line: 137, baseType: !13, size: 32, align: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !341, file: !342, line: 138, baseType: !32, size: 64, align: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !341, file: !342, line: 139, baseType: !347, size: 64, align: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "RSA_METHOD", file: !174, line: 147, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rsa_meth_st", file: !342, line: 85, size: 896, align: 64, elements: !351)
!351 = !{!352, !353, !359, !360, !361, !362, !382, !399, !403, !404, !405, !406, !414, !418}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !350, file: !342, line: 86, baseType: !207, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_pub_enc", scope: !350, file: !342, line: 87, baseType: !354, size: 64, align: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!13, !13, !213, !192, !357, !13}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "RSA", file: !174, line: 146, baseType: !341)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_pub_dec", scope: !350, file: !342, line: 89, baseType: !354, size: 64, align: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_priv_enc", scope: !350, file: !342, line: 91, baseType: !354, size: 64, align: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_priv_dec", scope: !350, file: !342, line: 93, baseType: !354, size: 64, align: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_mod_exp", scope: !350, file: !342, line: 96, baseType: !363, size: 64, align: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!13, !366, !377, !357, !379}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIGNUM", file: !174, line: 120, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_st", file: !369, line: 313, size: 192, align: 64, elements: !370)
!369 = !DIFile(filename: "/usr/include/openssl/bn.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!370 = !{!371, !373, !374, !375, !376}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !368, file: !369, line: 314, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !368, file: !369, line: 316, baseType: !13, size: 32, align: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !368, file: !369, line: 318, baseType: !13, size: 32, align: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "neg", scope: !368, file: !369, line: 319, baseType: !13, size: 32, align: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !368, file: !369, line: 320, baseType: !13, size: 32, align: 32, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_CTX", file: !174, line: 121, baseType: !381)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_ctx", file: !174, line: 121, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "bn_mod_exp", scope: !350, file: !342, line: 98, baseType: !383, size: 64, align: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!13, !366, !377, !377, !377, !379, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_MONT_CTX", file: !174, line: 123, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_mont_ctx_st", file: !369, line: 324, size: 832, align: 64, elements: !389)
!389 = !{!390, !391, !392, !393, !394, !398}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !388, file: !369, line: 325, baseType: !13, size: 32, align: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "RR", scope: !388, file: !369, line: 326, baseType: !367, size: 192, align: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !388, file: !369, line: 327, baseType: !367, size: 192, align: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Ni", scope: !388, file: !369, line: 328, baseType: !367, size: 192, align: 64, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "n0", scope: !388, file: !369, line: 330, baseType: !395, size: 128, align: 64, offset: 640)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 128, align: 64, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 2)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !388, file: !369, line: 333, baseType: !13, size: 32, align: 32, offset: 768)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !350, file: !342, line: 101, baseType: !400, size: 64, align: 64, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!13, !357}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !350, file: !342, line: 103, baseType: !400, size: 64, align: 64, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !350, file: !342, line: 105, baseType: !13, size: 32, align: 32, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !350, file: !342, line: 107, baseType: !5, size: 64, align: 64, offset: 640)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_sign", scope: !350, file: !342, line: 116, baseType: !407, size: 64, align: 64, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!13, !13, !213, !410, !192, !411, !412}
!410 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_verify", scope: !350, file: !342, line: 120, baseType: !415, size: 64, align: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!13, !13, !213, !410, !213, !410, !412}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_keygen", scope: !350, file: !342, line: 129, baseType: !419, size: 64, align: 64, offset: 832)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!13, !357, !13, !366, !422}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_GENCB", file: !174, line: 125, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_gencb_st", file: !369, line: 349, size: 192, align: 64, elements: !425)
!425 = !{!426, !427, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ver", scope: !424, file: !369, line: 350, baseType: !410, size: 32, align: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !424, file: !369, line: 351, baseType: !4, size: 64, align: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !424, file: !369, line: 357, baseType: !429, size: 64, align: 64, offset: 128)
!429 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !424, file: !369, line: 352, size: 64, align: 64, elements: !430)
!430 = !{!431, !435}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "cb_1", scope: !429, file: !369, line: 354, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !13, !13, !4}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "cb_2", scope: !429, file: !369, line: 356, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!13, !13, !13, !422}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !341, file: !342, line: 141, baseType: !332, size: 64, align: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !341, file: !342, line: 142, baseType: !366, size: 64, align: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !341, file: !342, line: 143, baseType: !366, size: 64, align: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !341, file: !342, line: 144, baseType: !366, size: 64, align: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !341, file: !342, line: 145, baseType: !366, size: 64, align: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !341, file: !342, line: 146, baseType: !366, size: 64, align: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dmp1", scope: !341, file: !342, line: 147, baseType: !366, size: 64, align: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "dmq1", scope: !341, file: !342, line: 148, baseType: !366, size: 64, align: 64, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "iqmp", scope: !341, file: !342, line: 149, baseType: !366, size: 64, align: 64, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !341, file: !342, line: 151, baseType: !449, size: 128, align: 64, offset: 768)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_EX_DATA", file: !174, line: 195, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_ex_data_st", file: !451, line: 292, size: 128, align: 64, elements: !452)
!451 = !DIFile(filename: "/usr/include/openssl/crypto.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!452 = !{!453, !458}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !450, file: !451, line: 293, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_void", file: !451, line: 297, size: 256, align: 64, elements: !456)
!456 = !{!457}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !455, file: !451, line: 297, baseType: !8, size: 256, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !450, file: !451, line: 295, baseType: !13, size: 32, align: 32, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !341, file: !342, line: 152, baseType: !13, size: 32, align: 32, offset: 896)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !341, file: !342, line: 153, baseType: !13, size: 32, align: 32, offset: 928)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_method_mod_n", scope: !341, file: !342, line: 155, baseType: !386, size: 64, align: 64, offset: 960)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_method_mod_p", scope: !341, file: !342, line: 156, baseType: !386, size: 64, align: 64, offset: 1024)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_method_mod_q", scope: !341, file: !342, line: 157, baseType: !386, size: 64, align: 64, offset: 1088)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "bignum_data", scope: !341, file: !342, line: 162, baseType: !5, size: 64, align: 64, offset: 1152)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "blinding", scope: !341, file: !342, line: 163, baseType: !466, size: 64, align: 64, offset: 1216)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_BLINDING", file: !174, line: 122, baseType: !468)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "bn_blinding_st", file: !174, line: 122, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mt_blinding", scope: !341, file: !342, line: 164, baseType: !466, size: 64, align: 64, offset: 1280)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "dsa", scope: !336, file: !321, line: 141, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dsa_st", file: !473, line: 155, size: 1088, align: 64, elements: !474)
!473 = !DIFile(filename: "/usr/include/openssl/dsa.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !538}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !472, file: !473, line: 160, baseType: !13, size: 32, align: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !472, file: !473, line: 161, baseType: !32, size: 64, align: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "write_params", scope: !472, file: !473, line: 162, baseType: !13, size: 32, align: 32, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !472, file: !473, line: 163, baseType: !366, size: 64, align: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !472, file: !473, line: 164, baseType: !366, size: 64, align: 64, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !472, file: !473, line: 165, baseType: !366, size: 64, align: 64, offset: 320)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pub_key", scope: !472, file: !473, line: 166, baseType: !366, size: 64, align: 64, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "priv_key", scope: !472, file: !473, line: 167, baseType: !366, size: 64, align: 64, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "kinv", scope: !472, file: !473, line: 168, baseType: !366, size: 64, align: 64, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !472, file: !473, line: 169, baseType: !366, size: 64, align: 64, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !472, file: !473, line: 170, baseType: !13, size: 32, align: 32, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "method_mont_p", scope: !472, file: !473, line: 172, baseType: !386, size: 64, align: 64, offset: 704)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !472, file: !473, line: 173, baseType: !13, size: 32, align: 32, offset: 768)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !472, file: !473, line: 174, baseType: !449, size: 128, align: 64, offset: 832)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !472, file: !473, line: 175, baseType: !490, size: 64, align: 64, offset: 960)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSA_METHOD", file: !174, line: 144, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dsa_method", file: !473, line: 129, size: 768, align: 64, elements: !494)
!494 = !{!495, !496, !508, !513, !517, !521, !525, !529, !530, !531, !532, !537}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !493, file: !473, line: 130, baseType: !207, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_do_sign", scope: !493, file: !473, line: 131, baseType: !497, size: 64, align: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!500, !213, !13, !506}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSA_SIG", file: !473, line: 127, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DSA_SIG_st", file: !473, line: 124, size: 128, align: 64, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !502, file: !473, line: 125, baseType: !366, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !502, file: !473, line: 126, baseType: !366, size: 64, align: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSA", file: !174, line: 143, baseType: !472)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_sign_setup", scope: !493, file: !473, line: 132, baseType: !509, size: 64, align: 64, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!13, !506, !379, !512, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_do_verify", scope: !493, file: !473, line: 134, baseType: !514, size: 64, align: 64, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64, align: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!13, !213, !13, !500, !506}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_mod_exp", scope: !493, file: !473, line: 136, baseType: !518, size: 64, align: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!13, !506, !366, !366, !366, !366, !366, !366, !379, !386}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bn_mod_exp", scope: !493, file: !473, line: 140, baseType: !522, size: 64, align: 64, offset: 320)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64, align: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!13, !506, !366, !366, !377, !377, !379, !386}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !493, file: !473, line: 142, baseType: !526, size: 64, align: 64, offset: 384)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!13, !506}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !493, file: !473, line: 143, baseType: !526, size: 64, align: 64, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !493, file: !473, line: 144, baseType: !13, size: 32, align: 32, offset: 512)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !493, file: !473, line: 145, baseType: !5, size: 64, align: 64, offset: 576)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_paramgen", scope: !493, file: !473, line: 147, baseType: !533, size: 64, align: 64, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!13, !506, !13, !213, !13, !536, !372, !422}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_keygen", scope: !493, file: !473, line: 152, baseType: !526, size: 64, align: 64, offset: 704)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !472, file: !473, line: 177, baseType: !332, size: 64, align: 64, offset: 1024)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dh", scope: !336, file: !321, line: 144, baseType: !540, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dh_st", file: !542, line: 135, size: 1152, align: 64, elements: !543)
!542 = !DIFile(filename: "/usr/include/openssl/dh.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !591}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !541, file: !542, line: 140, baseType: !13, size: 32, align: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !541, file: !542, line: 141, baseType: !13, size: 32, align: 32, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !541, file: !542, line: 142, baseType: !366, size: 64, align: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !541, file: !542, line: 143, baseType: !366, size: 64, align: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !541, file: !542, line: 144, baseType: !32, size: 64, align: 64, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pub_key", scope: !541, file: !542, line: 145, baseType: !366, size: 64, align: 64, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "priv_key", scope: !541, file: !542, line: 146, baseType: !366, size: 64, align: 64, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !541, file: !542, line: 147, baseType: !13, size: 32, align: 32, offset: 384)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "method_mont_p", scope: !541, file: !542, line: 148, baseType: !386, size: 64, align: 64, offset: 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !541, file: !542, line: 150, baseType: !366, size: 64, align: 64, offset: 512)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !541, file: !542, line: 151, baseType: !366, size: 64, align: 64, offset: 576)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !541, file: !542, line: 152, baseType: !192, size: 64, align: 64, offset: 640)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "seedlen", scope: !541, file: !542, line: 153, baseType: !13, size: 32, align: 32, offset: 704)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !541, file: !542, line: 154, baseType: !366, size: 64, align: 64, offset: 768)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !541, file: !542, line: 155, baseType: !13, size: 32, align: 32, offset: 832)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !541, file: !542, line: 156, baseType: !449, size: 128, align: 64, offset: 896)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !541, file: !542, line: 157, baseType: !561, size: 64, align: 64, offset: 1024)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "DH_METHOD", file: !174, line: 141, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dh_method", file: !542, line: 117, size: 576, align: 64, elements: !565)
!565 = !{!566, !567, !573, !577, !583, !584, !585, !586, !587}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !564, file: !542, line: 118, baseType: !207, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "generate_key", scope: !564, file: !542, line: 120, baseType: !568, size: 64, align: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64, align: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!13, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "DH", file: !174, line: 140, baseType: !541)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "compute_key", scope: !564, file: !542, line: 121, baseType: !574, size: 64, align: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64, align: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!13, !192, !377, !571}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "bn_mod_exp", scope: !564, file: !542, line: 123, baseType: !578, size: 64, align: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64, align: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!13, !581, !366, !377, !377, !377, !379, !386}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !572)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !564, file: !542, line: 126, baseType: !568, size: 64, align: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !564, file: !542, line: 127, baseType: !568, size: 64, align: 64, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !564, file: !542, line: 128, baseType: !13, size: 32, align: 32, offset: 384)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !564, file: !542, line: 129, baseType: !5, size: 64, align: 64, offset: 448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "generate_params", scope: !564, file: !542, line: 131, baseType: !588, size: 64, align: 64, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64, align: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!13, !571, !13, !13, !422}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !541, file: !542, line: 158, baseType: !332, size: 64, align: 64, offset: 1088)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ec", scope: !336, file: !321, line: 147, baseType: !593, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "ec_key_st", file: !321, line: 147, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "save_parameters", scope: !320, file: !321, line: 150, baseType: !13, size: 32, align: 32, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !320, file: !321, line: 151, baseType: !597, size: 64, align: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ATTRIBUTE", file: !176, line: 223, size: 256, align: 64, elements: !599)
!599 = !{!600}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !598, file: !176, line: 223, baseType: !8, size: 256, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "issuerUID", scope: !181, file: !176, line: 250, baseType: !237, size: 64, align: 64, offset: 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "subjectUID", scope: !181, file: !176, line: 251, baseType: !237, size: 64, align: 64, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !181, file: !176, line: 252, baseType: !604, size: 64, align: 64, offset: 576)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64, align: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_EXTENSION", file: !176, line: 204, size: 256, align: 64, elements: !606)
!606 = !{!607}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !605, file: !176, line: 204, baseType: !8, size: 256, align: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !181, file: !176, line: 253, baseType: !609, size: 192, align: 64, offset: 640)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENCODING", file: !187, line: 269, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ENCODING_st", file: !187, line: 265, size: 192, align: 64, elements: !611)
!611 = !{!612, !613, !614}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !610, file: !187, line: 266, baseType: !192, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !610, file: !187, line: 267, baseType: !32, size: 64, align: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !610, file: !187, line: 268, baseType: !13, size: 32, align: 32, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "sig_alg", scope: !175, file: !176, line: 272, baseType: !197, size: 64, align: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !175, file: !176, line: 273, baseType: !237, size: 64, align: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !175, file: !176, line: 274, baseType: !13, size: 32, align: 32, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !175, file: !176, line: 275, baseType: !13, size: 32, align: 32, offset: 224)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !176, line: 276, baseType: !5, size: 64, align: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !175, file: !176, line: 277, baseType: !449, size: 128, align: 64, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ex_pathlen", scope: !175, file: !176, line: 279, baseType: !32, size: 64, align: 64, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ex_pcpathlen", scope: !175, file: !176, line: 280, baseType: !32, size: 64, align: 64, offset: 512)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ex_flags", scope: !175, file: !176, line: 281, baseType: !48, size: 64, align: 64, offset: 576)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ex_kusage", scope: !175, file: !176, line: 282, baseType: !48, size: 64, align: 64, offset: 640)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ex_xkusage", scope: !175, file: !176, line: 283, baseType: !48, size: 64, align: 64, offset: 704)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ex_nscert", scope: !175, file: !176, line: 284, baseType: !48, size: 64, align: 64, offset: 768)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "skid", scope: !175, file: !176, line: 285, baseType: !240, size: 64, align: 64, offset: 832)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "akid", scope: !175, file: !176, line: 286, baseType: !629, size: 64, align: 64, offset: 896)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "AUTHORITY_KEYID", file: !174, line: 186, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AUTHORITY_KEYID_st", file: !632, line: 262, size: 192, align: 64, elements: !633)
!632 = !DIFile(filename: "/usr/include/openssl/x509v3.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!633 = !{!634, !635, !641}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "keyid", scope: !631, file: !632, line: 263, baseType: !240, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !631, file: !632, line: 264, baseType: !636, size: 64, align: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "GENERAL_NAMES", file: !632, line: 209, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_GENERAL_NAME", file: !632, line: 220, size: 256, align: 64, elements: !639)
!639 = !{!640}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !638, file: !632, line: 220, baseType: !8, size: 256, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !631, file: !632, line: 265, baseType: !184, size: 64, align: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "policy_cache", scope: !175, file: !176, line: 287, baseType: !643, size: 64, align: 64, offset: 960)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_CACHE", file: !174, line: 184, baseType: !645)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_CACHE_st", file: !174, line: 184, flags: DIFlagFwdDecl)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "crldp", scope: !175, file: !176, line: 288, baseType: !647, size: 64, align: 64, offset: 1024)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_DIST_POINT", file: !632, line: 259, size: 256, align: 64, elements: !649)
!649 = !{!650}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !648, file: !632, line: 259, baseType: !8, size: 256, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "altname", scope: !175, file: !176, line: 289, baseType: !652, size: 64, align: 64, offset: 1088)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !175, file: !176, line: 290, baseType: !654, size: 64, align: 64, offset: 1152)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "NAME_CONSTRAINTS", file: !174, line: 189, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NAME_CONSTRAINTS_st", file: !632, line: 332, size: 128, align: 64, elements: !657)
!657 = !{!658, !663}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "permittedSubtrees", scope: !656, file: !632, line: 333, baseType: !659, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_GENERAL_SUBTREE", file: !632, line: 330, size: 256, align: 64, elements: !661)
!661 = !{!662}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !660, file: !632, line: 330, baseType: !8, size: 256, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "excludedSubtrees", scope: !656, file: !632, line: 334, baseType: !659, size: 64, align: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "sha1_hash", scope: !175, file: !176, line: 296, baseType: !665, size: 160, align: 8, offset: 1216)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 160, align: 8, elements: !166)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !175, file: !176, line: 298, baseType: !667, size: 64, align: 64, offset: 1408)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CERT_AUX", file: !176, line: 268, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_cert_aux_st", file: !176, line: 262, size: 320, align: 64, elements: !670)
!670 = !{!671, !676, !677, !678, !679}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !669, file: !176, line: 263, baseType: !672, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ASN1_OBJECT", file: !187, line: 801, size: 256, align: 64, elements: !674)
!674 = !{!675}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !673, file: !187, line: 801, baseType: !8, size: 256, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "reject", scope: !669, file: !176, line: 264, baseType: !672, size: 64, align: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !669, file: !176, line: 265, baseType: !270, size: 64, align: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "keyid", scope: !669, file: !176, line: 266, baseType: !240, size: 64, align: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !669, file: !176, line: 267, baseType: !680, size: 64, align: 64, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64, align: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !187, line: 170, size: 256, align: 64, elements: !682)
!682 = !{!683}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !681, file: !187, line: 170, baseType: !8, size: 256, align: 64)
!684 = !DILocation(line: 124, column: 10, scope: !103)
!685 = !DILocalVariable(name: "err", scope: !103, file: !37, line: 125, type: !40)
!686 = !DILocation(line: 125, column: 11, scope: !103)
!687 = !DILocation(line: 127, column: 17, scope: !103)
!688 = !DILocation(line: 127, column: 11, scope: !103)
!689 = !DILocation(line: 127, column: 9, scope: !103)
!690 = !DILocation(line: 128, column: 9, scope: !691)
!691 = distinct !DILexicalBlock(scope: !103, file: !37, line: 128, column: 8)
!692 = !DILocation(line: 128, column: 8, scope: !103)
!693 = !DILocation(line: 129, column: 6, scope: !694)
!694 = distinct !DILexicalBlock(scope: !691, file: !37, line: 128, column: 15)
!695 = !DILocation(line: 129, column: 43, scope: !694)
!696 = !DILocation(line: 129, column: 60, scope: !694)
!697 = !DILocation(line: 129, column: 8, scope: !698)
!698 = !DILexicalBlockFile(scope: !694, file: !37, discriminator: 1)
!699 = !DILocation(line: 129, column: 7, scope: !694)
!700 = !DILocation(line: 129, column: 73, scope: !701)
!701 = !DILexicalBlockFile(scope: !694, file: !37, discriminator: 2)
!702 = !DILocation(line: 129, column: 7, scope: !703)
!703 = !DILexicalBlockFile(scope: !694, file: !37, discriminator: 3)
!704 = !DILocation(line: 130, column: 7, scope: !694)
!705 = !DILocation(line: 133, column: 25, scope: !103)
!706 = !DILocation(line: 133, column: 11, scope: !103)
!707 = !DILocation(line: 133, column: 9, scope: !103)
!708 = !DILocation(line: 134, column: 9, scope: !709)
!709 = distinct !DILexicalBlock(scope: !103, file: !37, line: 134, column: 8)
!710 = !DILocation(line: 134, column: 8, scope: !103)
!711 = !DILocation(line: 135, column: 6, scope: !712)
!712 = distinct !DILexicalBlock(scope: !709, file: !37, line: 134, column: 15)
!713 = !DILocation(line: 135, column: 59, scope: !712)
!714 = !DILocation(line: 135, column: 76, scope: !712)
!715 = !DILocation(line: 135, column: 89, scope: !716)
!716 = !DILexicalBlockFile(scope: !712, file: !37, discriminator: 1)
!717 = !DILocation(line: 135, column: 7, scope: !718)
!718 = !DILexicalBlockFile(scope: !712, file: !37, discriminator: 2)
!719 = !DILocation(line: 137, column: 7, scope: !712)
!720 = !DILocation(line: 140, column: 59, scope: !103)
!721 = !DILocation(line: 140, column: 36, scope: !103)
!722 = !DILocation(line: 140, column: 11, scope: !723)
!723 = !DILexicalBlockFile(scope: !103, file: !37, discriminator: 1)
!724 = !DILocation(line: 140, column: 9, scope: !103)
!725 = !DILocation(line: 140, column: 4, scope: !103)
!726 = !DILocation(line: 143, column: 8, scope: !727)
!727 = distinct !DILexicalBlock(scope: !103, file: !37, line: 143, column: 8)
!728 = !DILocation(line: 143, column: 8, scope: !103)
!729 = !DILocation(line: 144, column: 14, scope: !730)
!730 = distinct !DILexicalBlock(scope: !727, file: !37, line: 143, column: 14)
!731 = !DILocation(line: 144, column: 7, scope: !730)
!732 = !DILocation(line: 145, column: 4, scope: !730)
!733 = !DILocation(line: 146, column: 14, scope: !103)
!734 = !DILocation(line: 146, column: 4, scope: !103)
!735 = !DILocation(line: 147, column: 11, scope: !103)
!736 = !DILocation(line: 147, column: 4, scope: !103)
!737 = !DILocation(line: 149, column: 11, scope: !103)
!738 = !DILocation(line: 149, column: 4, scope: !103)
!739 = distinct !DISubprogram(name: "WritePemFile", scope: !37, file: !37, line: 604, type: !740, isLocal: false, isDefinition: true, scopeLine: 608, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!740 = !DISubroutineType(types: !741)
!741 = !{!64, !318, !106, !172, !106}
!742 = !DILocalVariable(name: "pkey", arg: 1, scope: !739, file: !37, line: 604, type: !318)
!743 = !DILocation(line: 604, column: 24, scope: !739)
!744 = !DILocalVariable(name: "keyFile", arg: 2, scope: !739, file: !37, line: 605, type: !106)
!745 = !DILocation(line: 605, column: 27, scope: !739)
!746 = !DILocalVariable(name: "cert", arg: 3, scope: !739, file: !37, line: 606, type: !172)
!747 = !DILocation(line: 606, column: 20, scope: !739)
!748 = !DILocalVariable(name: "certFile", arg: 4, scope: !739, file: !37, line: 607, type: !106)
!749 = !DILocation(line: 607, column: 27, scope: !739)
!750 = !DILocalVariable(name: "file", scope: !739, file: !37, line: 609, type: !111)
!751 = !DILocation(line: 609, column: 10, scope: !739)
!752 = !DILocalVariable(name: "ret", scope: !739, file: !37, line: 610, type: !64)
!753 = !DILocation(line: 610, column: 13, scope: !739)
!754 = !DILocalVariable(name: "err", scope: !739, file: !37, line: 611, type: !40)
!755 = !DILocation(line: 611, column: 11, scope: !739)
!756 = !DILocalVariable(name: "mode", scope: !739, file: !37, line: 612, type: !757)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !758, line: 70, baseType: !759)
!758 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !142, line: 129, baseType: !410)
!760 = !DILocation(line: 612, column: 11, scope: !739)
!761 = !DILocation(line: 614, column: 11, scope: !739)
!762 = !DILocation(line: 614, column: 9, scope: !739)
!763 = !DILocation(line: 615, column: 17, scope: !739)
!764 = !DILocation(line: 615, column: 11, scope: !739)
!765 = !DILocation(line: 615, column: 9, scope: !739)
!766 = !DILocation(line: 616, column: 9, scope: !767)
!767 = distinct !DILexicalBlock(scope: !739, file: !37, line: 616, column: 8)
!768 = !DILocation(line: 616, column: 8, scope: !739)
!769 = !DILocation(line: 617, column: 6, scope: !770)
!770 = distinct !DILexicalBlock(scope: !767, file: !37, line: 616, column: 15)
!771 = !DILocation(line: 617, column: 43, scope: !770)
!772 = !DILocation(line: 617, column: 60, scope: !770)
!773 = !DILocation(line: 617, column: 8, scope: !774)
!774 = !DILexicalBlockFile(scope: !770, file: !37, discriminator: 1)
!775 = !DILocation(line: 617, column: 7, scope: !770)
!776 = !DILocation(line: 617, column: 69, scope: !777)
!777 = !DILexicalBlockFile(scope: !770, file: !37, discriminator: 2)
!778 = !DILocation(line: 617, column: 7, scope: !779)
!779 = !DILexicalBlockFile(scope: !770, file: !37, discriminator: 3)
!780 = !DILocation(line: 618, column: 7, scope: !770)
!781 = !DILocation(line: 621, column: 30, scope: !782)
!782 = distinct !DILexicalBlock(scope: !739, file: !37, line: 621, column: 8)
!783 = !DILocation(line: 621, column: 36, scope: !782)
!784 = !DILocation(line: 621, column: 9, scope: !782)
!785 = !DILocation(line: 621, column: 8, scope: !739)
!786 = !DILocation(line: 622, column: 6, scope: !787)
!787 = distinct !DILexicalBlock(scope: !782, file: !37, line: 621, column: 69)
!788 = !DILocation(line: 622, column: 65, scope: !787)
!789 = !DILocation(line: 622, column: 82, scope: !787)
!790 = !DILocation(line: 622, column: 91, scope: !791)
!791 = !DILexicalBlockFile(scope: !787, file: !37, discriminator: 1)
!792 = !DILocation(line: 622, column: 7, scope: !793)
!793 = !DILexicalBlockFile(scope: !787, file: !37, discriminator: 2)
!794 = !DILocation(line: 624, column: 7, scope: !787)
!795 = !DILocation(line: 627, column: 11, scope: !739)
!796 = !DILocation(line: 627, column: 4, scope: !739)
!797 = !DILocation(line: 629, column: 4, scope: !739)
!798 = !DILocation(line: 630, column: 17, scope: !739)
!799 = !DILocation(line: 630, column: 11, scope: !739)
!800 = !DILocation(line: 630, column: 9, scope: !739)
!801 = !DILocation(line: 631, column: 9, scope: !802)
!802 = distinct !DILexicalBlock(scope: !739, file: !37, line: 631, column: 8)
!803 = !DILocation(line: 631, column: 8, scope: !739)
!804 = !DILocation(line: 632, column: 6, scope: !805)
!805 = distinct !DILexicalBlock(scope: !802, file: !37, line: 631, column: 15)
!806 = !DILocation(line: 632, column: 43, scope: !805)
!807 = !DILocation(line: 632, column: 60, scope: !805)
!808 = !DILocation(line: 632, column: 8, scope: !809)
!809 = !DILexicalBlockFile(scope: !805, file: !37, discriminator: 1)
!810 = !DILocation(line: 632, column: 7, scope: !805)
!811 = !DILocation(line: 632, column: 70, scope: !812)
!812 = !DILexicalBlockFile(scope: !805, file: !37, discriminator: 2)
!813 = !DILocation(line: 632, column: 7, scope: !814)
!814 = !DILexicalBlockFile(scope: !805, file: !37, discriminator: 3)
!815 = !DILocation(line: 633, column: 7, scope: !805)
!816 = !DILocation(line: 636, column: 24, scope: !817)
!817 = distinct !DILexicalBlock(scope: !739, file: !37, line: 636, column: 8)
!818 = !DILocation(line: 636, column: 30, scope: !817)
!819 = !DILocation(line: 636, column: 9, scope: !817)
!820 = !DILocation(line: 636, column: 8, scope: !739)
!821 = !DILocation(line: 637, column: 6, scope: !822)
!822 = distinct !DILexicalBlock(scope: !817, file: !37, line: 636, column: 37)
!823 = !DILocation(line: 637, column: 65, scope: !822)
!824 = !DILocation(line: 637, column: 82, scope: !822)
!825 = !DILocation(line: 637, column: 92, scope: !826)
!826 = !DILexicalBlockFile(scope: !822, file: !37, discriminator: 1)
!827 = !DILocation(line: 637, column: 7, scope: !828)
!828 = !DILexicalBlockFile(scope: !822, file: !37, discriminator: 2)
!829 = !DILocation(line: 639, column: 7, scope: !822)
!830 = !DILocation(line: 642, column: 8, scope: !739)
!831 = !DILocation(line: 642, column: 4, scope: !739)
!832 = !DILocation(line: 645, column: 8, scope: !833)
!833 = distinct !DILexicalBlock(scope: !739, file: !37, line: 645, column: 8)
!834 = !DILocation(line: 645, column: 8, scope: !739)
!835 = !DILocation(line: 646, column: 14, scope: !836)
!836 = distinct !DILexicalBlock(scope: !833, file: !37, line: 645, column: 14)
!837 = !DILocation(line: 646, column: 7, scope: !836)
!838 = !DILocation(line: 647, column: 4, scope: !836)
!839 = !DILocation(line: 648, column: 11, scope: !739)
!840 = !DILocation(line: 648, column: 4, scope: !739)
!841 = !DILocation(line: 649, column: 10, scope: !739)
!842 = !DILocation(line: 649, column: 4, scope: !739)
!843 = !DILocation(line: 651, column: 11, scope: !739)
!844 = !DILocation(line: 651, column: 4, scope: !739)
!845 = distinct !DISubprogram(name: "CertKey_GenerateKeyCert", scope: !37, file: !37, line: 674, type: !846, isLocal: false, isDefinition: true, scopeLine: 679, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!846 = !DISubroutineType(types: !847)
!847 = !{!64, !13, !13, !106, !106, !106}
!848 = !DILocalVariable(name: "bits", arg: 1, scope: !845, file: !37, line: 674, type: !13)
!849 = !DILocation(line: 674, column: 29, scope: !845)
!850 = !DILocalVariable(name: "days", arg: 2, scope: !845, file: !37, line: 675, type: !13)
!851 = !DILocation(line: 675, column: 29, scope: !845)
!852 = !DILocalVariable(name: "confFile", arg: 3, scope: !845, file: !37, line: 676, type: !106)
!853 = !DILocation(line: 676, column: 38, scope: !845)
!854 = !DILocalVariable(name: "keyFile", arg: 4, scope: !845, file: !37, line: 677, type: !106)
!855 = !DILocation(line: 677, column: 38, scope: !845)
!856 = !DILocalVariable(name: "certFile", arg: 5, scope: !845, file: !37, line: 678, type: !106)
!857 = !DILocation(line: 678, column: 38, scope: !845)
!858 = !DILocalVariable(name: "ret", scope: !845, file: !37, line: 680, type: !64)
!859 = !DILocation(line: 680, column: 13, scope: !845)
!860 = !DILocalVariable(name: "cert", scope: !845, file: !37, line: 681, type: !172)
!861 = !DILocation(line: 681, column: 10, scope: !845)
!862 = !DILocalVariable(name: "req", scope: !845, file: !37, line: 682, type: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64, align: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_REQ", file: !176, line: 240, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_req_st", file: !176, line: 235, size: 256, align: 64, elements: !866)
!866 = !{!867, !877, !878, !879}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "req_info", scope: !865, file: !176, line: 236, baseType: !868, size: 64, align: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64, align: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_REQ_INFO", file: !176, line: 233, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_req_info_st", file: !176, line: 226, size: 448, align: 64, elements: !871)
!871 = !{!872, !873, !874, !875, !876}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !870, file: !176, line: 227, baseType: !609, size: 192, align: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !870, file: !176, line: 228, baseType: !184, size: 64, align: 64, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "subject", scope: !870, file: !176, line: 229, baseType: !279, size: 64, align: 64, offset: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "pubkey", scope: !870, file: !176, line: 230, baseType: !311, size: 64, align: 64, offset: 320)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !870, file: !176, line: 232, baseType: !597, size: 64, align: 64, offset: 384)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "sig_alg", scope: !865, file: !176, line: 237, baseType: !197, size: 64, align: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !865, file: !176, line: 238, baseType: !237, size: 64, align: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !865, file: !176, line: 239, baseType: !13, size: 32, align: 32, offset: 192)
!880 = !DILocation(line: 682, column: 14, scope: !845)
!881 = !DILocalVariable(name: "pkey", scope: !845, file: !37, line: 683, type: !318)
!882 = !DILocation(line: 683, column: 14, scope: !845)
!883 = !DILocalVariable(name: "config", scope: !845, file: !37, line: 684, type: !884)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64, align: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF", file: !174, line: 167, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_st", file: !26, line: 147, size: 192, align: 64, elements: !887)
!887 = !{!888, !984, !985}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !886, file: !26, line: 148, baseType: !889, size: 64, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64, align: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONF_METHOD", file: !26, line: 85, baseType: !891)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conf_method_st", file: !26, line: 87, size: 640, align: 64, elements: !892)
!892 = !{!893, !894, !898, !902, !903, !904, !969, !975, !979, !980}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !891, file: !26, line: 88, baseType: !207, size: 64, align: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !891, file: !26, line: 89, baseType: !895, size: 64, align: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64, align: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!884, !889}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !891, file: !26, line: 90, baseType: !899, size: 64, align: 64, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64, align: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!13, !884}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !891, file: !26, line: 91, baseType: !899, size: 64, align: 64, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_data", scope: !891, file: !26, line: 92, baseType: !899, size: 64, align: 64, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "load_bio", scope: !891, file: !26, line: 93, baseType: !905, size: 64, align: 64, offset: 320)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64, align: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!13, !884, !908, !968}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !910, line: 238, baseType: !911)
!910 = !DIFile(filename: "/usr/include/openssl/bio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1362")
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !910, line: 325, size: 896, align: 64, elements: !912)
!912 = !{!913, !951, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !911, file: !910, line: 326, baseType: !914, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO_METHOD", file: !910, line: 323, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bio_method_st", file: !910, line: 312, size: 640, align: 64, elements: !917)
!917 = !{!918, !919, !920, !924, !928, !932, !933, !937, !941, !942}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !916, file: !910, line: 313, baseType: !13, size: 32, align: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !916, file: !910, line: 314, baseType: !207, size: 64, align: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "bwrite", scope: !916, file: !910, line: 315, baseType: !921, size: 64, align: 64, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!13, !908, !207, !13}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "bread", scope: !916, file: !910, line: 316, baseType: !925, size: 64, align: 64, offset: 192)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!13, !908, !5, !13}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "bputs", scope: !916, file: !910, line: 317, baseType: !929, size: 64, align: 64, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!13, !908, !207}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "bgets", scope: !916, file: !910, line: 318, baseType: !925, size: 64, align: 64, offset: 320)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !916, file: !910, line: 319, baseType: !934, size: 64, align: 64, offset: 384)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!32, !908, !13, !32, !4}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !916, file: !910, line: 320, baseType: !938, size: 64, align: 64, offset: 448)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!13, !908}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !916, file: !910, line: 321, baseType: !938, size: 64, align: 64, offset: 512)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "callback_ctrl", scope: !916, file: !910, line: 322, baseType: !943, size: 64, align: 64, offset: 576)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!32, !908, !13, !946}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "bio_info_cb", file: !910, line: 309, baseType: !948)
!948 = !DISubroutineType(types: !949)
!949 = !{null, !950, !13, !207, !13, !32, !32}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !911, file: !910, line: 328, baseType: !952, size: 64, align: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!32, !950, !13, !207, !13, !32, !32}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "cb_arg", scope: !911, file: !910, line: 329, baseType: !5, size: 64, align: 64, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !911, file: !910, line: 330, baseType: !13, size: 32, align: 32, offset: 192)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !911, file: !910, line: 331, baseType: !13, size: 32, align: 32, offset: 224)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !911, file: !910, line: 332, baseType: !13, size: 32, align: 32, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "retry_reason", scope: !911, file: !910, line: 333, baseType: !13, size: 32, align: 32, offset: 288)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !911, file: !910, line: 334, baseType: !13, size: 32, align: 32, offset: 320)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !911, file: !910, line: 335, baseType: !4, size: 64, align: 64, offset: 384)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "next_bio", scope: !911, file: !910, line: 336, baseType: !950, size: 64, align: 64, offset: 448)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bio", scope: !911, file: !910, line: 337, baseType: !950, size: 64, align: 64, offset: 512)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !911, file: !910, line: 338, baseType: !13, size: 32, align: 32, offset: 576)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "num_read", scope: !911, file: !910, line: 339, baseType: !48, size: 64, align: 64, offset: 640)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "num_write", scope: !911, file: !910, line: 340, baseType: !48, size: 64, align: 64, offset: 704)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !911, file: !910, line: 341, baseType: !449, size: 128, align: 64, offset: 768)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !891, file: !26, line: 94, baseType: !970, size: 64, align: 64, offset: 384)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!13, !973, !908}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !885)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "is_number", scope: !891, file: !26, line: 95, baseType: !976, size: 64, align: 64, offset: 448)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!13, !973, !6}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "to_int", scope: !891, file: !26, line: 96, baseType: !976, size: 64, align: 64, offset: 512)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !891, file: !26, line: 97, baseType: !981, size: 64, align: 64, offset: 576)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!13, !884, !207, !968}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "meth_data", scope: !886, file: !26, line: 149, baseType: !4, size: 64, align: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !886, file: !26, line: 150, baseType: !986, size: 64, align: 64, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st_CONF_VALUE", file: !26, line: 81, size: 32, align: 32, elements: !988)
!988 = !{!989}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !987, file: !26, line: 81, baseType: !13, size: 32, align: 32)
!990 = !DILocation(line: 684, column: 10, scope: !845)
!991 = !DILocalVariable(name: "err", scope: !845, file: !37, line: 685, type: !40)
!992 = !DILocation(line: 685, column: 11, scope: !845)
!993 = !DILocation(line: 687, column: 29, scope: !845)
!994 = !DILocation(line: 687, column: 13, scope: !845)
!995 = !DILocation(line: 687, column: 11, scope: !845)
!996 = !DILocation(line: 688, column: 9, scope: !997)
!997 = distinct !DILexicalBlock(scope: !845, file: !37, line: 688, column: 8)
!998 = !DILocation(line: 688, column: 8, scope: !845)
!999 = !DILocation(line: 689, column: 7, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !997, file: !37, line: 688, column: 17)
!1001 = !DILocation(line: 692, column: 37, scope: !845)
!1002 = !DILocation(line: 692, column: 45, scope: !845)
!1003 = !DILocation(line: 692, column: 10, scope: !845)
!1004 = !DILocation(line: 692, column: 8, scope: !845)
!1005 = !DILocation(line: 693, column: 9, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !845, file: !37, line: 693, column: 8)
!1007 = !DILocation(line: 693, column: 8, scope: !845)
!1008 = !DILocation(line: 694, column: 7, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1006, file: !37, line: 693, column: 14)
!1010 = !DILocation(line: 697, column: 28, scope: !845)
!1011 = !DILocation(line: 697, column: 33, scope: !845)
!1012 = !DILocation(line: 697, column: 41, scope: !845)
!1013 = !DILocation(line: 697, column: 11, scope: !845)
!1014 = !DILocation(line: 697, column: 9, scope: !845)
!1015 = !DILocation(line: 698, column: 9, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !845, file: !37, line: 698, column: 8)
!1017 = !DILocation(line: 698, column: 8, scope: !845)
!1018 = !DILocation(line: 699, column: 7, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1016, file: !37, line: 698, column: 15)
!1020 = !DILocation(line: 702, column: 25, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !845, file: !37, line: 702, column: 8)
!1022 = !DILocation(line: 702, column: 31, scope: !1021)
!1023 = !DILocation(line: 702, column: 9, scope: !1021)
!1024 = !DILocation(line: 702, column: 8, scope: !845)
!1025 = !DILocation(line: 703, column: 6, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1021, file: !37, line: 702, column: 38)
!1027 = !DILocation(line: 703, column: 62, scope: !1026)
!1028 = !DILocation(line: 703, column: 79, scope: !1029)
!1029 = !DILexicalBlockFile(scope: !1026, file: !37, discriminator: 1)
!1030 = !DILocation(line: 703, column: 7, scope: !1031)
!1031 = !DILexicalBlockFile(scope: !1026, file: !37, discriminator: 2)
!1032 = !DILocation(line: 705, column: 7, scope: !1026)
!1033 = !DILocation(line: 708, column: 19, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !845, file: !37, line: 708, column: 8)
