; ModuleID = '/home/lichi/Desktop/genwqe/[task]lib--__libDDCB.o/[inter]lib--libddcb.o.i'
source_filename = "/home/lichi/Desktop/genwqe/[task]lib--__libDDCB.o/[inter]lib--libddcb.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.ddcb_accel_funcs = type { i32, i8*, i8* (i32, i32, i32*, i64, i64)*, i32 (i8*)*, i32 (i8*, %struct.ddcb_cmd*)*, i8* (i8*, i32)*, i64 (i8*, i32, i32*)*, i32 (i8*, i32, i32*)*, i32 (i8*, i32, i64)*, i32 (i8*, i32, i32)*, i64 (i8*)*, i64 (i8*)*, i64 (i8*)*, void (i8*, %struct._IO_FILE*)*, i32 (i8*, i8*, i64, i32)*, i32 (i8*, i8*, i64)*, i8* (i8*, i64)*, i32 (i8*, i8*, i64)*, i32 (%struct._IO_FILE*)*, %union.pthread_mutex_t, i64, i64, i64, i64, i64, i64, i8* }
%struct.ddcb_cmd = type { i64, i64, i8, i8, i8, i8, i16, i16, i16, i16, i32, i64, i64, i64, i64, [64 x i8], %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i64, [96 x i8] }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !18, globals: !30)
!1 = !DIFile(filename: "/home/lichi/Desktop/genwqe/[task]lib--__libDDCB.o/[inter]lib--libddcb.o.i", directory: "/home/lichi/Desktop")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "_ISupper", value: 256)
!7 = !DIEnumerator(name: "_ISlower", value: 512)
!8 = !DIEnumerator(name: "_ISalpha", value: 1024)
!9 = !DIEnumerator(name: "_ISdigit", value: 2048)
!10 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!11 = !DIEnumerator(name: "_ISspace", value: 8192)
!12 = !DIEnumerator(name: "_ISprint", value: 16384)
!13 = !DIEnumerator(name: "_ISgraph", value: 32768)
!14 = !DIEnumerator(name: "_ISblank", value: 1)
!15 = !DIEnumerator(name: "_IScntrl", value: 2)
!16 = !DIEnumerator(name: "_ISpunct", value: 4)
!17 = !DIEnumerator(name: "_ISalnum", value: 8)
!18 = !{!19, !23, !24, !25, !26, !29}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !21, line: 48, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop")
!22 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!24 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!25 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!29 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!30 = !{!31, !33, !35, !36, !95, !102, !106, !108}
!31 = distinct !DIGlobalVariable(name: "libddcb_verbose", scope: !0, file: !32, line: 83, type: !24, isLocal: false, isDefinition: true, variable: i32* @libddcb_verbose)
!32 = !DIFile(filename: "libddcb.c", directory: "/home/lichi/Desktop")
!33 = distinct !DIGlobalVariable(name: "retc_nerr", scope: !0, file: !32, line: 118, type: !34, isLocal: true, isDefinition: true, variable: i32 512)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!35 = distinct !DIGlobalVariable(name: "ddcb_nerr", scope: !0, file: !32, line: 142, type: !34, isLocal: true, isDefinition: true, variable: i32 420)
!36 = distinct !DIGlobalVariable(name: "libddcb_fd_out", scope: !0, file: !32, line: 84, type: !37, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @libddcb_fd_out)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !39, line: 48, baseType: !40)
!39 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !41, line: 241, size: 1728, align: 64, elements: !42)
!41 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop")
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !63, !64, !65, !66, !70, !71, !73, !77, !80, !82, !83, !84, !85, !86, !90, !91}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !40, file: !41, line: 242, baseType: !24, size: 32, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !40, file: !41, line: 247, baseType: !27, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !40, file: !41, line: 248, baseType: !27, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !40, file: !41, line: 249, baseType: !27, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !40, file: !41, line: 250, baseType: !27, size: 64, align: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !40, file: !41, line: 251, baseType: !27, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !40, file: !41, line: 252, baseType: !27, size: 64, align: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !40, file: !41, line: 253, baseType: !27, size: 64, align: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !40, file: !41, line: 254, baseType: !27, size: 64, align: 64, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !40, file: !41, line: 256, baseType: !27, size: 64, align: 64, offset: 576)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !40, file: !41, line: 257, baseType: !27, size: 64, align: 64, offset: 640)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !40, file: !41, line: 258, baseType: !27, size: 64, align: 64, offset: 704)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !40, file: !41, line: 260, baseType: !56, size: 64, align: 64, offset: 768)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !41, line: 156, size: 192, align: 64, elements: !58)
!58 = !{!59, !60, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !57, file: !41, line: 157, baseType: !56, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !57, file: !41, line: 158, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !57, file: !41, line: 162, baseType: !24, size: 32, align: 32, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !40, file: !41, line: 262, baseType: !61, size: 64, align: 64, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !40, file: !41, line: 264, baseType: !24, size: 32, align: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !40, file: !41, line: 268, baseType: !24, size: 32, align: 32, offset: 928)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !40, file: !41, line: 270, baseType: !67, size: 64, align: 64, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !68, line: 131, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop")
!69 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !40, file: !41, line: 274, baseType: !25, size: 16, align: 16, offset: 1024)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !40, file: !41, line: 275, baseType: !72, size: 8, align: 8, offset: 1040)
!72 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !40, file: !41, line: 276, baseType: !74, size: 8, align: 8, offset: 1048)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8, align: 8, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 1)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !40, file: !41, line: 280, baseType: !78, size: 64, align: 64, offset: 1088)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !41, line: 150, baseType: null)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !40, file: !41, line: 289, baseType: !81, size: 64, align: 64, offset: 1152)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !68, line: 132, baseType: !69)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !40, file: !41, line: 297, baseType: !23, size: 64, align: 64, offset: 1216)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !40, file: !41, line: 298, baseType: !23, size: 64, align: 64, offset: 1280)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !40, file: !41, line: 299, baseType: !23, size: 64, align: 64, offset: 1344)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !40, file: !41, line: 300, baseType: !23, size: 64, align: 64, offset: 1408)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !40, file: !41, line: 302, baseType: !87, size: 64, align: 64, offset: 1472)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !88, line: 216, baseType: !89)
!88 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop")
!89 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !40, file: !41, line: 303, baseType: !24, size: 32, align: 32, offset: 1536)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !40, file: !41, line: 305, baseType: !92, size: 160, align: 8, offset: 1568)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 160, align: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 20)
!95 = distinct !DIGlobalVariable(name: "retc_errlist", scope: !0, file: !32, line: 105, type: !96, isLocal: true, isDefinition: true, variable: [512 x i8*]* @retc_errlist)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 32768, align: 64, elements: !100)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!100 = !{!101}
!101 = !DISubrange(count: 512)
!102 = distinct !DIGlobalVariable(name: "ddcb_errlist", scope: !0, file: !32, line: 127, type: !103, isLocal: true, isDefinition: true, variable: [420 x i8*]* @ddcb_errlist)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 26880, align: 64, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 420)
!106 = distinct !DIGlobalVariable(name: "ddcb_trace", scope: !0, file: !32, line: 77, type: !107, isLocal: true, isDefinition: true, variable: i32* @ddcb_trace)
!107 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!108 = distinct !DIGlobalVariable(name: "accel_list", scope: !0, file: !32, line: 82, type: !109, isLocal: true, isDefinition: true, variable: %struct.ddcb_accel_funcs** @accel_list)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ddcb_accel_funcs", file: !111, line: 325, size: 1984, align: 64, elements: !112)
!111 = !DIFile(filename: "../include/libddcb.h", directory: "/home/lichi/Desktop")
!112 = !{!113, !114, !115, !121, !125, !172, !176, !181, !185, !189, !193, !197, !198, !199, !203, !209, !213, !217, !221, !225, !253, !254, !255, !256, !257, !258, !259}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "card_type", scope: !110, file: !111, line: 326, baseType: !24, size: 32, align: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "card_name", scope: !110, file: !111, line: 327, baseType: !98, size: 64, align: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "card_open", scope: !110, file: !111, line: 330, baseType: !116, size: 64, align: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!23, !24, !107, !119, !120, !120}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !21, line: 55, baseType: !89)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "card_close", scope: !110, file: !111, line: 332, baseType: !122, size: 64, align: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!24, !23}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ddcb_execute", scope: !110, file: !111, line: 333, baseType: !126, size: 64, align: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!24, !23, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ddcb_cmd", file: !111, line: 154, size: 1856, align: 64, elements: !131)
!131 = !{!132, !136, !137, !139, !140, !141, !142, !144, !145, !146, !147, !149, !150, !151, !152, !153, !157}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "next_addr", scope: !130, file: !111, line: 155, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !134, line: 30, baseType: !135)
!134 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop")
!135 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !130, file: !111, line: 156, baseType: !133, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "acfunc", scope: !130, file: !111, line: 158, baseType: !138, size: 8, align: 8, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !134, line: 20, baseType: !22)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !130, file: !111, line: 159, baseType: !138, size: 8, align: 8, offset: 136)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "asiv_length", scope: !130, file: !111, line: 160, baseType: !138, size: 8, align: 8, offset: 144)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "asv_length", scope: !130, file: !111, line: 161, baseType: !138, size: 8, align: 8, offset: 152)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "cmdopts", scope: !130, file: !111, line: 162, baseType: !143, size: 16, align: 16, offset: 160)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !134, line: 23, baseType: !25)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "retc", scope: !130, file: !111, line: 163, baseType: !143, size: 16, align: 16, offset: 176)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "attn", scope: !130, file: !111, line: 165, baseType: !143, size: 16, align: 16, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "vcrc", scope: !130, file: !111, line: 166, baseType: !143, size: 16, align: 16, offset: 208)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !130, file: !111, line: 167, baseType: !148, size: 32, align: 32, offset: 224)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !134, line: 26, baseType: !107)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "deque_ts", scope: !130, file: !111, line: 169, baseType: !133, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cmplt_ts", scope: !130, file: !111, line: 170, baseType: !133, size: 64, align: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "disp_ts", scope: !130, file: !111, line: 171, baseType: !133, size: 64, align: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ddata_addr", scope: !130, file: !111, line: 173, baseType: !133, size: 64, align: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "asv", scope: !130, file: !111, line: 175, baseType: !154, size: 512, align: 8, offset: 512)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 512, align: 8, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !111, line: 177, baseType: !158, size: 832, align: 64, offset: 1024)
!158 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !111, line: 177, size: 832, align: 64, elements: !159)
!159 = !{!160, !168}
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !158, file: !111, line: 179, baseType: !161, size: 832, align: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !158, file: !111, line: 179, size: 832, align: 64, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ats", scope: !161, file: !111, line: 180, baseType: !133, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "asiv", scope: !161, file: !111, line: 181, baseType: !165, size: 768, align: 8, offset: 64)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 768, align: 8, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__asiv", scope: !158, file: !111, line: 184, baseType: !169, size: 832, align: 8)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 832, align: 8, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 104)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "card_strerror", scope: !110, file: !111, line: 335, baseType: !173, size: 64, align: 64, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!98, !23, !24}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "card_read_reg64", scope: !110, file: !111, line: 339, baseType: !177, size: 64, align: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!120, !23, !180, !119}
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !21, line: 51, baseType: !107)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "card_read_reg32", scope: !110, file: !111, line: 341, baseType: !182, size: 64, align: 64, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!180, !23, !180, !119}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "card_write_reg64", scope: !110, file: !111, line: 343, baseType: !186, size: 64, align: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!24, !23, !180, !120}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "card_write_reg32", scope: !110, file: !111, line: 345, baseType: !190, size: 64, align: 64, offset: 576)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!24, !23, !180, !180}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "card_get_app_id", scope: !110, file: !111, line: 353, baseType: !194, size: 64, align: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!120, !23}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "card_get_queue_work_time", scope: !110, file: !111, line: 354, baseType: !194, size: 64, align: 64, offset: 704)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "card_get_frequency", scope: !110, file: !111, line: 355, baseType: !194, size: 64, align: 64, offset: 768)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "card_dump_hardware_version", scope: !110, file: !111, line: 356, baseType: !200, size: 64, align: 64, offset: 832)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !23, !37}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "card_pin_memory", scope: !110, file: !111, line: 361, baseType: !204, size: 64, align: 64, offset: 896)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!24, !23, !207, !87, !24}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "card_unpin_memory", scope: !110, file: !111, line: 363, baseType: !210, size: 64, align: 64, offset: 960)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!24, !23, !207, !87}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "card_malloc", scope: !110, file: !111, line: 365, baseType: !214, size: 64, align: 64, offset: 1024)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!23, !23, !87}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "card_free", scope: !110, file: !111, line: 366, baseType: !218, size: 64, align: 64, offset: 1088)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!24, !23, !23, !87}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "dump_statistics", scope: !110, file: !111, line: 369, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!24, !37}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "slock", scope: !110, file: !111, line: 371, baseType: !226, size: 320, align: 64, offset: 1216)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !227, line: 128, baseType: !228)
!227 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop")
!228 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !227, line: 90, size: 320, align: 64, elements: !229)
!229 = !{!230, !248, !252}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !228, file: !227, line: 125, baseType: !231, size: 320, align: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !227, line: 92, size: 320, align: 64, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238, !240, !241}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !231, file: !227, line: 94, baseType: !24, size: 32, align: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !231, file: !227, line: 95, baseType: !107, size: 32, align: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !231, file: !227, line: 96, baseType: !24, size: 32, align: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !231, file: !227, line: 98, baseType: !107, size: 32, align: 32, offset: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !231, file: !227, line: 102, baseType: !24, size: 32, align: 32, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !231, file: !227, line: 104, baseType: !239, size: 16, align: 16, offset: 160)
!239 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !231, file: !227, line: 105, baseType: !239, size: 16, align: 16, offset: 176)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !231, file: !227, line: 106, baseType: !242, size: 128, align: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !227, line: 79, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !227, line: 75, size: 128, align: 64, elements: !244)
!244 = !{!245, !247}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !243, file: !227, line: 77, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !243, file: !227, line: 78, baseType: !246, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !228, file: !227, line: 126, baseType: !249, size: 320, align: 8)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 320, align: 8, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 40)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !228, file: !227, line: 127, baseType: !69, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "num_open", scope: !110, file: !111, line: 372, baseType: !89, size: 64, align: 64, offset: 1536)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "num_execute", scope: !110, file: !111, line: 373, baseType: !89, size: 64, align: 64, offset: 1600)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "num_close", scope: !110, file: !111, line: 374, baseType: !89, size: 64, align: 64, offset: 1664)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "time_open", scope: !110, file: !111, line: 376, baseType: !89, size: 64, align: 64, offset: 1728)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "time_execute", scope: !110, file: !111, line: 377, baseType: !89, size: 64, align: 64, offset: 1792)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "time_close", scope: !110, file: !111, line: 378, baseType: !89, size: 64, align: 64, offset: 1856)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !110, file: !111, line: 381, baseType: !23, size: 64, align: 64, offset: 1920)
!260 = !{i32 2, !"Dwarf Version", i32 4}
!261 = !{i32 2, !"Debug Info Version", i32 3}
!262 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!263 = distinct !DISubprogram(name: "ddcb_retc_strerror", scope: !32, file: !32, line: 120, type: !264, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !266)
!264 = !DISubroutineType(types: !265)
!265 = !{!98, !24}
!266 = !{}
!267 = !DILocalVariable(name: "errnum", arg: 1, scope: !263, file: !32, line: 120, type: !24)
!268 = !DIExpression()
!269 = !DILocation(line: 120, column: 36, scope: !263)
!270 = !DILocation(line: 122, column: 9, scope: !271)
!271 = distinct !DILexicalBlock(scope: !263, file: !32, line: 122, column: 6)
!272 = !DILocation(line: 122, column: 17, scope: !271)
!273 = !DILocation(line: 122, column: 7, scope: !271)
!274 = !DILocation(line: 122, column: 26, scope: !275)
!275 = !DILexicalBlockFile(scope: !271, file: !32, discriminator: 1)
!276 = !DILocation(line: 122, column: 24, scope: !275)
!277 = !DILocation(line: 122, column: 7, scope: !275)
!278 = !DILocation(line: 122, column: 37, scope: !279)
!279 = !DILexicalBlockFile(scope: !271, file: !32, discriminator: 2)
!280 = !DILocation(line: 122, column: 7, scope: !279)
!281 = !DILocation(line: 122, column: 7, scope: !282)
!282 = !DILexicalBlockFile(scope: !271, file: !32, discriminator: 3)
!283 = !DILocation(line: 122, column: 46, scope: !282)
!284 = !DILocation(line: 122, column: 6, scope: !282)
!285 = !DILocation(line: 123, column: 3, scope: !271)
!286 = !DILocation(line: 124, column: 25, scope: !263)
!287 = !DILocation(line: 124, column: 33, scope: !263)
!288 = !DILocation(line: 124, column: 23, scope: !263)
!289 = !DILocation(line: 124, column: 42, scope: !290)
!290 = !DILexicalBlockFile(scope: !263, file: !32, discriminator: 1)
!291 = !DILocation(line: 124, column: 40, scope: !290)
!292 = !DILocation(line: 124, column: 23, scope: !290)
!293 = !DILocation(line: 124, column: 53, scope: !294)
!294 = !DILexicalBlockFile(scope: !263, file: !32, discriminator: 2)
!295 = !DILocation(line: 124, column: 23, scope: !294)
!296 = !DILocation(line: 124, column: 23, scope: !297)
!297 = !DILexicalBlockFile(scope: !263, file: !32, discriminator: 3)
!298 = !DILocation(line: 124, column: 9, scope: !297)
!299 = !DILocation(line: 124, column: 2, scope: !297)
!300 = !DILocation(line: 125, column: 1, scope: !263)
!301 = distinct !DISubprogram(name: "ddcb_strerror", scope: !32, file: !32, line: 144, type: !264, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !266)
!302 = !DILocalVariable(name: "errnum", arg: 1, scope: !301, file: !32, line: 144, type: !24)
!303 = !DILocation(line: 144, column: 31, scope: !301)
!304 = !DILocation(line: 146, column: 9, scope: !305)
!305 = distinct !DILexicalBlock(scope: !301, file: !32, line: 146, column: 6)
!306 = !DILocation(line: 146, column: 17, scope: !305)
!307 = !DILocation(line: 146, column: 7, scope: !305)
!308 = !DILocation(line: 146, column: 26, scope: !309)
!309 = !DILexicalBlockFile(scope: !305, file: !32, discriminator: 1)
!310 = !DILocation(line: 146, column: 24, scope: !309)
!311 = !DILocation(line: 146, column: 7, scope: !309)
!312 = !DILocation(line: 146, column: 37, scope: !313)
!313 = !DILexicalBlockFile(scope: !305, file: !32, discriminator: 2)
!314 = !DILocation(line: 146, column: 7, scope: !313)
!315 = !DILocation(line: 146, column: 7, scope: !316)
!316 = !DILexicalBlockFile(scope: !305, file: !32, discriminator: 3)
!317 = !DILocation(line: 146, column: 46, scope: !316)
!318 = !DILocation(line: 146, column: 6, scope: !316)
!319 = !DILocation(line: 147, column: 3, scope: !305)
!320 = !DILocation(line: 148, column: 25, scope: !301)
!321 = !DILocation(line: 148, column: 33, scope: !301)
!322 = !DILocation(line: 148, column: 23, scope: !301)
!323 = !DILocation(line: 148, column: 42, scope: !324)
!324 = !DILexicalBlockFile(scope: !301, file: !32, discriminator: 1)
!325 = !DILocation(line: 148, column: 40, scope: !324)
!326 = !DILocation(line: 148, column: 23, scope: !324)
!327 = !DILocation(line: 148, column: 53, scope: !328)
!328 = !DILexicalBlockFile(scope: !301, file: !32, discriminator: 2)
!329 = !DILocation(line: 148, column: 23, scope: !328)
!330 = !DILocation(line: 148, column: 23, scope: !331)
!331 = !DILexicalBlockFile(scope: !301, file: !32, discriminator: 3)
!332 = !DILocation(line: 148, column: 9, scope: !331)
!333 = !DILocation(line: 148, column: 2, scope: !331)
!334 = !DILocation(line: 149, column: 1, scope: !301)
!335 = distinct !DISubprogram(name: "ddcb_hexdump", scope: !32, file: !32, line: 151, type: !336, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !266)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !37, !207, !107}
!338 = !DILocalVariable(name: "fp", arg: 1, scope: !335, file: !32, line: 151, type: !37)
!339 = !DILocation(line: 151, column: 25, scope: !335)
!340 = !DILocalVariable(name: "buff", arg: 2, scope: !335, file: !32, line: 151, type: !207)
!341 = !DILocation(line: 151, column: 41, scope: !335)
!342 = !DILocalVariable(name: "size", arg: 3, scope: !335, file: !32, line: 151, type: !107)
!343 = !DILocation(line: 151, column: 60, scope: !335)
!344 = !DILocalVariable(name: "i", scope: !335, file: !32, line: 153, type: !107)
!345 = !DILocation(line: 153, column: 15, scope: !335)
!346 = !DILocalVariable(name: "j", scope: !335, file: !32, line: 153, type: !107)
!347 = !DILocation(line: 153, column: 18, scope: !335)
!348 = !DILocalVariable(name: "b", scope: !335, file: !32, line: 154, type: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!351 = !DILocation(line: 154, column: 17, scope: !335)
!352 = !DILocation(line: 154, column: 32, scope: !335)
!353 = !DILocalVariable(name: "ascii", scope: !335, file: !32, line: 155, type: !354)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 136, align: 8, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 17)
!357 = !DILocation(line: 155, column: 7, scope: !335)
!358 = !DILocation(line: 157, column: 6, scope: !359)
!359 = distinct !DILexicalBlock(scope: !335, file: !32, line: 157, column: 6)
!360 = !DILocation(line: 157, column: 9, scope: !359)
!361 = !DILocation(line: 157, column: 6, scope: !335)
!362 = !DILocation(line: 158, column: 3, scope: !359)
!363 = !DILocation(line: 160, column: 9, scope: !364)
!364 = distinct !DILexicalBlock(scope: !335, file: !32, line: 160, column: 2)
!365 = !DILocation(line: 160, column: 7, scope: !364)
!366 = !DILocation(line: 160, column: 14, scope: !367)
!367 = !DILexicalBlockFile(scope: !368, file: !32, discriminator: 1)
!368 = distinct !DILexicalBlock(scope: !364, file: !32, line: 160, column: 2)
!369 = !DILocation(line: 160, column: 18, scope: !367)
!370 = !DILocation(line: 160, column: 16, scope: !367)
!371 = !DILocation(line: 160, column: 2, scope: !367)
!372 = !DILocation(line: 161, column: 8, scope: !373)
!373 = distinct !DILexicalBlock(scope: !374, file: !32, line: 161, column: 7)
!374 = distinct !DILexicalBlock(scope: !368, file: !32, line: 160, column: 29)
!375 = !DILocation(line: 161, column: 10, scope: !373)
!376 = !DILocation(line: 161, column: 18, scope: !373)
!377 = !DILocation(line: 161, column: 7, scope: !374)
!378 = !DILocation(line: 162, column: 12, scope: !379)
!379 = distinct !DILexicalBlock(scope: !373, file: !32, line: 161, column: 27)
!380 = !DILocation(line: 162, column: 26, scope: !379)
!381 = !DILocation(line: 162, column: 4, scope: !379)
!382 = !DILocation(line: 163, column: 4, scope: !379)
!383 = !DILocation(line: 164, column: 6, scope: !379)
!384 = !DILocation(line: 165, column: 3, scope: !379)
!385 = !DILocation(line: 166, column: 11, scope: !374)
!386 = !DILocation(line: 166, column: 26, scope: !374)
!387 = !DILocation(line: 166, column: 24, scope: !374)
!388 = !DILocation(line: 166, column: 3, scope: !374)
!389 = !DILocation(line: 167, column: 17, scope: !374)
!390 = !DILocation(line: 167, column: 15, scope: !374)
!391 = !DILocation(line: 167, column: 36, scope: !374)
!392 = !DILocation(line: 167, column: 16, scope: !374)
!393 = !DILocation(line: 167, column: 18, scope: !374)
!394 = !DILocation(line: 167, column: 19, scope: !374)
!395 = !DILocation(line: 167, column: 33, scope: !396)
!396 = !DILexicalBlockFile(scope: !374, file: !32, discriminator: 1)
!397 = !DILocation(line: 167, column: 31, scope: !396)
!398 = !DILocation(line: 167, column: 15, scope: !396)
!399 = !DILocation(line: 167, column: 15, scope: !400)
!400 = !DILexicalBlockFile(scope: !374, file: !32, discriminator: 2)
!401 = !DILocation(line: 167, column: 15, scope: !402)
!402 = !DILexicalBlockFile(scope: !374, file: !32, discriminator: 3)
!403 = !DILocation(line: 167, column: 10, scope: !402)
!404 = !DILocation(line: 167, column: 3, scope: !402)
!405 = !DILocation(line: 167, column: 14, scope: !402)
!406 = !DILocation(line: 169, column: 8, scope: !407)
!407 = distinct !DILexicalBlock(scope: !374, file: !32, line: 169, column: 7)
!408 = !DILocation(line: 169, column: 10, scope: !407)
!409 = !DILocation(line: 169, column: 18, scope: !407)
!410 = !DILocation(line: 169, column: 7, scope: !374)
!411 = !DILocation(line: 170, column: 12, scope: !407)
!412 = !DILocation(line: 170, column: 27, scope: !407)
!413 = !DILocation(line: 170, column: 4, scope: !407)
!414 = !DILocation(line: 171, column: 2, scope: !374)
!415 = !DILocation(line: 160, column: 25, scope: !416)
!416 = !DILexicalBlockFile(scope: !368, file: !32, discriminator: 2)
!417 = !DILocation(line: 160, column: 2, scope: !416)
!418 = distinct !{!418, !419}
!419 = !DILocation(line: 160, column: 2, scope: !335)
!420 = !DILocation(line: 174, column: 2, scope: !335)
!421 = !DILocation(line: 174, column: 9, scope: !422)
!422 = !DILexicalBlockFile(scope: !423, file: !32, discriminator: 1)
!423 = distinct !DILexicalBlock(scope: !424, file: !32, line: 174, column: 2)
!424 = distinct !DILexicalBlock(scope: !335, file: !32, line: 174, column: 2)
!425 = !DILocation(line: 174, column: 15, scope: !422)
!426 = !DILocation(line: 174, column: 20, scope: !422)
!427 = !DILocation(line: 174, column: 27, scope: !422)
!428 = !DILocation(line: 174, column: 11, scope: !422)
!429 = !DILocation(line: 174, column: 2, scope: !422)
!430 = !DILocation(line: 175, column: 11, scope: !431)
!431 = distinct !DILexicalBlock(scope: !423, file: !32, line: 174, column: 41)
!432 = !DILocation(line: 175, column: 3, scope: !431)
!433 = !DILocation(line: 176, column: 10, scope: !431)
!434 = !DILocation(line: 176, column: 3, scope: !431)
!435 = !DILocation(line: 176, column: 14, scope: !431)
!436 = !DILocation(line: 178, column: 8, scope: !437)
!437 = distinct !DILexicalBlock(scope: !431, file: !32, line: 178, column: 7)
!438 = !DILocation(line: 178, column: 10, scope: !437)
!439 = !DILocation(line: 178, column: 18, scope: !437)
!440 = !DILocation(line: 178, column: 7, scope: !431)
!441 = !DILocation(line: 179, column: 12, scope: !437)
!442 = !DILocation(line: 179, column: 27, scope: !437)
!443 = !DILocation(line: 179, column: 4, scope: !437)
!444 = !DILocation(line: 180, column: 2, scope: !431)
!445 = !DILocation(line: 174, column: 37, scope: !446)
!446 = !DILexicalBlockFile(scope: !423, file: !32, discriminator: 2)
!447 = !DILocation(line: 174, column: 2, scope: !446)
!448 = distinct !{!448, !420}
!449 = !DILocation(line: 182, column: 10, scope: !335)
!450 = !DILocation(line: 182, column: 2, scope: !335)
!451 = !DILocation(line: 183, column: 1, scope: !335)
!452 = !DILocation(line: 183, column: 1, scope: !453)
!453 = !DILexicalBlockFile(scope: !335, file: !32, discriminator: 1)
!454 = distinct !DISubprogram(name: "ddcb_debug", scope: !32, file: !32, line: 185, type: !455, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !266)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !24}
!457 = !DILocalVariable(name: "verbosity", arg: 1, scope: !454, file: !32, line: 185, type: !24)
!458 = !DILocation(line: 185, column: 21, scope: !454)
!459 = !DILocation(line: 187, column: 20, scope: !454)
!460 = !DILocation(line: 187, column: 18, scope: !454)
!461 = !DILocation(line: 188, column: 1, scope: !454)
!462 = distinct !DISubprogram(name: "ddcb_set_logfile", scope: !32, file: !32, line: 190, type: !463, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !266)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !37}
!465 = !DILocalVariable(name: "fd_out", arg: 1, scope: !462, file: !32, line: 190, type: !37)
!466 = !DILocation(line: 190, column: 29, scope: !462)
!467 = !DILocation(line: 192, column: 19, scope: !462)
!468 = !DILocation(line: 192, column: 17, scope: !462)
!469 = !DILocation(line: 193, column: 1, scope: !462)
!470 = distinct !DISubprogram(name: "accel_open", scope: !32, file: !32, line: 195, type: !471, isLocal: false, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !266)
!471 = !DISubroutineType(types: !472)
!472 = !{!473, !24, !107, !107, !119, !120, !120}
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "accel_t", file: !111, line: 198, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "card_dev_t", file: !32, line: 67, size: 320, align: 64, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482, !483}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "card_no", scope: !475, file: !32, line: 68, baseType: !24, size: 32, align: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "card_type", scope: !475, file: !32, line: 69, baseType: !24, size: 32, align: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !475, file: !32, line: 70, baseType: !24, size: 32, align: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "card_data", scope: !475, file: !32, line: 71, baseType: !23, size: 64, align: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "card_rc", scope: !475, file: !32, line: 72, baseType: !24, size: 32, align: 32, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "card_errno", scope: !475, file: !32, line: 73, baseType: !24, size: 32, align: 32, offset: 224)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "accel", scope: !475, file: !32, line: 74, baseType: !109, size: 64, align: 64, offset: 256)
!484 = !DILocalVariable(name: "card_no", arg: 1, scope: !470, file: !32, line: 195, type: !24)
!485 = !DILocation(line: 195, column: 24, scope: !470)
!486 = !DILocalVariable(name: "card_type", arg: 2, scope: !470, file: !32, line: 195, type: !107)
!487 = !DILocation(line: 195, column: 46, scope: !470)
!488 = !DILocalVariable(name: "mode", arg: 3, scope: !470, file: !32, line: 196, type: !107)
!489 = !DILocation(line: 196, column: 19, scope: !470)
!490 = !DILocalVariable(name: "err_code", arg: 4, scope: !470, file: !32, line: 196, type: !119)
!491 = !DILocation(line: 196, column: 30, scope: !470)
!492 = !DILocalVariable(name: "appl_id", arg: 5, scope: !470, file: !32, line: 197, type: !120)
!493 = !DILocation(line: 197, column: 15, scope: !470)
!494 = !DILocalVariable(name: "appl_id_mask", arg: 6, scope: !470, file: !32, line: 197, type: !120)
!495 = !DILocation(line: 197, column: 33, scope: !470)
!496 = !DILocalVariable(name: "rc", scope: !470, file: !32, line: 199, type: !24)
!497 = !DILocation(line: 199, column: 6, scope: !470)
!498 = !DILocalVariable(name: "card", scope: !470, file: !32, line: 200, type: !474)
!499 = !DILocation(line: 200, column: 21, scope: !470)
!500 = !DILocalVariable(name: "accel", scope: !470, file: !32, line: 201, type: !109)
!501 = !DILocation(line: 201, column: 27, scope: !470)
!502 = !DILocalVariable(name: "s", scope: !470, file: !32, line: 202, type: !120)
!503 = !DILocation(line: 202, column: 11, scope: !470)
!504 = !DILocalVariable(name: "e", scope: !470, file: !32, line: 202, type: !120)
!505 = !DILocation(line: 202, column: 18, scope: !470)
!506 = !DILocation(line: 204, column: 7, scope: !507)
!507 = distinct !DILexicalBlock(scope: !470, file: !32, line: 204, column: 6)
!508 = !DILocation(line: 204, column: 18, scope: !507)
!509 = !DILocation(line: 204, column: 6, scope: !470)
!510 = !DILocation(line: 205, column: 7, scope: !507)
!511 = !DILocation(line: 205, column: 5, scope: !507)
!512 = !DILocation(line: 205, column: 3, scope: !507)
!513 = !DILocation(line: 207, column: 9, scope: !470)
!514 = !DILocation(line: 207, column: 7, scope: !470)
!515 = !DILocation(line: 208, column: 6, scope: !516)
!516 = distinct !DILexicalBlock(scope: !470, file: !32, line: 208, column: 6)
!517 = !DILocation(line: 208, column: 11, scope: !516)
!518 = !DILocation(line: 208, column: 6, scope: !470)
!519 = !DILocation(line: 209, column: 6, scope: !520)
!520 = distinct !DILexicalBlock(scope: !516, file: !32, line: 208, column: 19)
!521 = !DILocation(line: 210, column: 3, scope: !520)
!522 = !DILocation(line: 213, column: 27, scope: !470)
!523 = !DILocation(line: 213, column: 10, scope: !470)
!524 = !DILocation(line: 213, column: 8, scope: !470)
!525 = !DILocation(line: 214, column: 6, scope: !526)
!526 = distinct !DILexicalBlock(scope: !470, file: !32, line: 214, column: 6)
!527 = !DILocation(line: 214, column: 12, scope: !526)
!528 = !DILocation(line: 214, column: 6, scope: !470)
!529 = !DILocation(line: 215, column: 6, scope: !530)
!530 = distinct !DILexicalBlock(scope: !526, file: !32, line: 214, column: 20)
!531 = !DILocation(line: 216, column: 3, scope: !530)
!532 = !DILocation(line: 219, column: 18, scope: !470)
!533 = !DILocation(line: 219, column: 2, scope: !470)
!534 = !DILocation(line: 219, column: 8, scope: !470)
!535 = !DILocation(line: 219, column: 16, scope: !470)
!536 = !DILocation(line: 220, column: 20, scope: !470)
!537 = !DILocation(line: 220, column: 2, scope: !470)
!538 = !DILocation(line: 220, column: 8, scope: !470)
!539 = !DILocation(line: 220, column: 18, scope: !470)
!540 = !DILocation(line: 221, column: 15, scope: !470)
!541 = !DILocation(line: 221, column: 2, scope: !470)
!542 = !DILocation(line: 221, column: 8, scope: !470)
!543 = !DILocation(line: 221, column: 13, scope: !470)
!544 = !DILocation(line: 222, column: 16, scope: !470)
!545 = !DILocation(line: 222, column: 2, scope: !470)
!546 = !DILocation(line: 222, column: 8, scope: !470)
!547 = !DILocation(line: 222, column: 14, scope: !470)
!548 = !DILocation(line: 224, column: 6, scope: !549)
!549 = distinct !DILexicalBlock(scope: !470, file: !32, line: 224, column: 6)
!550 = !DILocation(line: 224, column: 12, scope: !549)
!551 = !DILocation(line: 224, column: 19, scope: !549)
!552 = !DILocation(line: 224, column: 29, scope: !549)
!553 = !DILocation(line: 224, column: 6, scope: !470)
!554 = !DILocation(line: 225, column: 6, scope: !555)
!555 = distinct !DILexicalBlock(scope: !549, file: !32, line: 224, column: 37)
!556 = !DILocation(line: 226, column: 3, scope: !555)
!557 = !DILocation(line: 229, column: 20, scope: !470)
!558 = !DILocation(line: 229, column: 26, scope: !470)
!559 = !DILocation(line: 229, column: 33, scope: !470)
!560 = !DILocation(line: 229, column: 43, scope: !470)
!561 = !DILocation(line: 229, column: 52, scope: !470)
!562 = !DILocation(line: 229, column: 59, scope: !470)
!563 = !DILocation(line: 229, column: 65, scope: !470)
!564 = !DILocation(line: 230, column: 8, scope: !470)
!565 = !DILocation(line: 230, column: 17, scope: !470)
!566 = !DILocation(line: 229, column: 2, scope: !470)
!567 = !DILocation(line: 229, column: 8, scope: !470)
!568 = !DILocation(line: 229, column: 18, scope: !470)
!569 = !DILocation(line: 231, column: 6, scope: !570)
!570 = distinct !DILexicalBlock(scope: !470, file: !32, line: 231, column: 6)
!571 = !DILocation(line: 231, column: 12, scope: !570)
!572 = !DILocation(line: 231, column: 22, scope: !570)
!573 = !DILocation(line: 231, column: 6, scope: !470)
!574 = !DILocation(line: 232, column: 6, scope: !575)
!575 = distinct !DILexicalBlock(scope: !570, file: !32, line: 231, column: 30)
!576 = !DILocation(line: 233, column: 3, scope: !575)
!577 = !DILocation(line: 235, column: 6, scope: !578)
!578 = distinct !DILexicalBlock(scope: !470, file: !32, line: 235, column: 6)
!579 = !DILocation(line: 235, column: 6, scope: !470)
!580 = !DILocation(line: 236, column: 4, scope: !578)
!581 = !DILocation(line: 236, column: 13, scope: !578)
!582 = !DILocation(line: 236, column: 3, scope: !578)
!583 = !DILocation(line: 238, column: 7, scope: !584)
!584 = distinct !DILexicalBlock(scope: !470, file: !32, line: 238, column: 6)
!585 = !DILocation(line: 238, column: 18, scope: !584)
!586 = !DILocation(line: 238, column: 6, scope: !470)
!587 = !DILocation(line: 239, column: 7, scope: !588)
!588 = distinct !DILexicalBlock(scope: !584, file: !32, line: 238, column: 29)
!589 = !DILocation(line: 239, column: 5, scope: !588)
!590 = !DILocation(line: 240, column: 23, scope: !588)
!591 = !DILocation(line: 240, column: 30, scope: !588)
!592 = !DILocation(line: 240, column: 3, scope: !588)
!593 = !DILocation(line: 241, column: 3, scope: !588)
!594 = !DILocation(line: 241, column: 10, scope: !588)
!595 = !DILocation(line: 241, column: 18, scope: !588)
!596 = !DILocation(line: 242, column: 24, scope: !588)
!597 = !DILocation(line: 242, column: 28, scope: !588)
!598 = !DILocation(line: 242, column: 26, scope: !588)
!599 = !DILocation(line: 242, column: 3, scope: !588)
!600 = !DILocation(line: 242, column: 10, scope: !588)
!601 = !DILocation(line: 242, column: 20, scope: !588)
!602 = !DILocation(line: 243, column: 25, scope: !588)
!603 = !DILocation(line: 243, column: 32, scope: !588)
!604 = !DILocation(line: 243, column: 3, scope: !588)
!605 = !DILocation(line: 244, column: 2, scope: !588)
!606 = !DILocation(line: 246, column: 9, scope: !470)
!607 = !DILocation(line: 246, column: 2, scope: !470)
!608 = !DILocation(line: 249, column: 7, scope: !470)
!609 = !DILocation(line: 249, column: 2, scope: !470)
!610 = !DILocation(line: 251, column: 6, scope: !611)
!611 = distinct !DILexicalBlock(scope: !470, file: !32, line: 251, column: 6)
!612 = !DILocation(line: 251, column: 6, scope: !470)
!613 = !DILocation(line: 252, column: 15, scope: !611)
!614 = !DILocation(line: 252, column: 4, scope: !611)
!615 = !DILocation(line: 252, column: 13, scope: !611)
!616 = !DILocation(line: 252, column: 3, scope: !611)
!617 = !DILocation(line: 253, column: 2, scope: !470)
!618 = !DILocation(line: 254, column: 1, scope: !470)
!619 = distinct !DISubprogram(name: "get_usec", scope: !32, file: !32, line: 86, type: !620, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !266)
!620 = !DISubroutineType(types: !621)
!621 = !{!120}
!622 = !DILocalVariable(name: "t", scope: !619, file: !32, line: 88, type: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !624, line: 30, size: 128, align: 64, elements: !625)
!624 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop")
!625 = !{!626, !628}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !623, file: !624, line: 32, baseType: !627, size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !68, line: 139, baseType: !69)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !623, file: !624, line: 33, baseType: !629, size: 64, align: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !68, line: 141, baseType: !69)
!630 = !DILocation(line: 88, column: 17, scope: !619)
!631 = !DILocation(line: 90, column: 2, scope: !619)
!632 = !DILocation(line: 91, column: 11, scope: !619)
!633 = !DILocation(line: 91, column: 18, scope: !619)
!634 = !DILocation(line: 91, column: 32, scope: !619)
!635 = !DILocation(line: 91, column: 28, scope: !619)
!636 = !DILocation(line: 91, column: 2, scope: !619)
!637 = distinct !DISubprogram(name: "find_accelerator", scope: !32, file: !32, line: 94, type: !638, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !266)
!638 = !DISubroutineType(types: !639)
!639 = !{!109, !24}
!640 = !DILocalVariable(name: "card_type", arg: 1, scope: !637, file: !32, line: 94, type: !24)
!641 = !DILocation(line: 94, column: 54, scope: !637)
!642 = !DILocalVariable(name: "accel", scope: !637, file: !32, line: 96, type: !109)
!643 = !DILocation(line: 96, column: 27, scope: !637)
!644 = !DILocation(line: 98, column: 15, scope: !645)
!645 = distinct !DILexicalBlock(scope: !637, file: !32, line: 98, column: 2)
!646 = !DILocation(line: 98, column: 13, scope: !645)
!647 = !DILocation(line: 98, column: 7, scope: !645)
!648 = !DILocation(line: 98, column: 27, scope: !649)
!649 = !DILexicalBlockFile(scope: !650, file: !32, discriminator: 1)
!650 = distinct !DILexicalBlock(scope: !645, file: !32, line: 98, column: 2)
!651 = !DILocation(line: 98, column: 33, scope: !649)
!652 = !DILocation(line: 98, column: 2, scope: !649)
!653 = !DILocation(line: 99, column: 7, scope: !654)
!654 = distinct !DILexicalBlock(scope: !655, file: !32, line: 99, column: 7)
!655 = distinct !DILexicalBlock(scope: !650, file: !32, line: 98, column: 67)
!656 = !DILocation(line: 99, column: 14, scope: !654)
!657 = !DILocation(line: 99, column: 27, scope: !654)
!658 = !DILocation(line: 99, column: 24, scope: !654)
!659 = !DILocation(line: 99, column: 7, scope: !655)
!660 = !DILocation(line: 100, column: 11, scope: !654)
!661 = !DILocation(line: 100, column: 4, scope: !654)
!662 = !DILocation(line: 101, column: 2, scope: !655)
!663 = !DILocation(line: 98, column: 49, scope: !664)
!664 = !DILexicalBlockFile(scope: !650, file: !32, discriminator: 2)
!665 = !DILocation(line: 98, column: 56, scope: !664)
!666 = !DILocation(line: 98, column: 47, scope: !664)
!667 = !DILocation(line: 98, column: 2, scope: !664)
!668 = distinct !{!668, !669}
!669 = !DILocation(line: 98, column: 2, scope: !637)
!670 = !DILocation(line: 102, column: 2, scope: !637)
!671 = !DILocation(line: 103, column: 1, scope: !637)
!672 = distinct !DISubprogram(name: "accel_close", scope: !32, file: !32, line: 256, type: !673, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !266)
!673 = !DISubroutineType(types: !674)
!674 = !{!24, !473}
!675 = !DILocalVariable(name: "card", arg: 1, scope: !672, file: !32, line: 256, type: !473)
!676 = !DILocation(line: 256, column: 25, scope: !672)
!677 = !DILocalVariable(name: "rc", scope: !672, file: !32, line: 258, type: !24)
!678 = !DILocation(line: 258, column: 6, scope: !672)
!679 = !DILocalVariable(name: "accel", scope: !672, file: !32, line: 259, type: !109)
!680 = !DILocation(line: 259, column: 27, scope: !672)
!681 = !DILocalVariable(name: "s", scope: !672, file: !32, line: 260, type: !120)
!682 = !DILocation(line: 260, column: 11, scope: !672)
!683 = !DILocalVariable(name: "e", scope: !672, file: !32, line: 260, type: !120)
!684 = !DILocation(line: 260, column: 18, scope: !672)
!685 = !DILocation(line: 262, column: 6, scope: !686)
!686 = distinct !DILexicalBlock(scope: !672, file: !32, line: 262, column: 6)
!687 = !DILocation(line: 262, column: 11, scope: !686)
!688 = !DILocation(line: 262, column: 6, scope: !672)
