; ModuleID = './fileLockPrimitive.o.i'
source_filename = "./fileLockPrimitive.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.lock_values = type { i8*, i8*, i8*, i8*, i8*, i32, i8, i64, i32, %struct.active_lock* }
%struct.active_lock = type { %struct.active_lock*, i32, i8, i8* }
%struct.FileData = type { i64, i64, i64, i64, i32, i32, i32, i32 }
%struct.FileIODescriptor = type { i32, i32, i8*, %struct.FileLockToken* }
%struct.FileLockToken = type { i32, i8, i8*, %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { %struct.FileIODescriptor }
%struct.parse_table = type { i32, i8*, i8* }
%struct.anon.0 = type { i8* }

@.str = private unnamed_addr constant [3 x i8] c"lc\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"/\00", align 1
@__FUNCTION__.FileLockMemberValues = private unnamed_addr constant [21 x i8] c"FileLockMemberValues\00", align 1
@.str.2 = private unnamed_addr constant [35 x i8] c"FILE: %s open failure on '%s': %s\0A\00", align 1
@.str.3 = private unnamed_addr constant [40 x i8] c"FILE: %s file size failure on '%s': %s\0A\00", align 1
@.str.4 = private unnamed_addr constant [49 x i8] c"FILE: %s file '%s': size %lu, required size %zd\0A\00", align 1
@.str.5 = private unnamed_addr constant [35 x i8] c"FILE: %s read failure on '%s': %s\0A\00", align 1
@.str.6 = private unnamed_addr constant [49 x i8] c"FILE: %s read length issue on '%s': %zd and %zd\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !30, globals: !42)
!1 = !DIFile(filename: "fileLockPrimitive.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line213")
!2 = !{!3, !19, !26}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 264, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/fileIO.h", directory: "/home/lichi/Desktop/open-vm-tools/line213")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!6 = !DIEnumerator(name: "FILEIO_SUCCESS", value: 0)
!7 = !DIEnumerator(name: "FILEIO_CANCELLED", value: 1)
!8 = !DIEnumerator(name: "FILEIO_ERROR", value: 2)
!9 = !DIEnumerator(name: "FILEIO_OPEN_ERROR_EXIST", value: 3)
!10 = !DIEnumerator(name: "FILEIO_LOCK_FAILED", value: 4)
!11 = !DIEnumerator(name: "FILEIO_READ_ERROR_EOF", value: 5)
!12 = !DIEnumerator(name: "FILEIO_FILE_NOT_FOUND", value: 6)
!13 = !DIEnumerator(name: "FILEIO_NO_PERMISSION", value: 7)
!14 = !DIEnumerator(name: "FILEIO_FILE_NAME_TOO_LONG", value: 8)
!15 = !DIEnumerator(name: "FILEIO_WRITE_ERROR_FBIG", value: 9)
!16 = !DIEnumerator(name: "FILEIO_WRITE_ERROR_NOSPC", value: 10)
!17 = !DIEnumerator(name: "FILEIO_WRITE_ERROR_DQUOT", value: 11)
!18 = !DIEnumerator(name: "FILEIO_ERROR_LAST", value: 12)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 256, size: 32, align: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25}
!21 = !DIEnumerator(name: "FILEIO_OPEN", value: 0)
!22 = !DIEnumerator(name: "FILEIO_OPEN_EMPTY", value: 1)
!23 = !DIEnumerator(name: "FILEIO_OPEN_CREATE", value: 2)
!24 = !DIEnumerator(name: "FILEIO_OPEN_CREATE_SAFE", value: 3)
!25 = !DIEnumerator(name: "FILEIO_OPEN_CREATE_EMPTY", value: 4)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 46, size: 32, align: 32, elements: !28)
!27 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/unicodeTypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line213")
!28 = !{!29}
!29 = !DIEnumerator(name: "UNICODE_INDEX_NOT_FOUND", value: -1)
!30 = !{!31, !32, !34, !40, !41}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !36, line: 173, baseType: !37)
!36 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line213")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !38, line: 51, baseType: !39)
!38 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line213")
!39 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!42 = !{!43}
!43 = distinct !DIGlobalVariable(name: "implicitReadToken", scope: !0, file: !44, line: 68, type: !33, isLocal: true, isDefinition: true, variable: i8* @implicitReadToken)
!44 = !DIFile(filename: "fileLockPrimitive.c", directory: "/home/lichi/Desktop/open-vm-tools/line213")
!45 = !{i32 2, !"Dwarf Version", i32 4}
!46 = !{i32 2, !"Debug Info Version", i32 3}
!47 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!48 = distinct !DISubprogram(name: "FileLockMemberValues", scope: !44, file: !44, line: 295, type: !49, isLocal: false, isDefinition: true, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !87)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !52, !52, !32, !54, !57}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !55, line: 216, baseType: !56)
!55 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line213")
!56 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "LockValues", file: !59, line: 207, baseType: !60)
!59 = !DIFile(filename: "fileInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line213")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_values", file: !59, line: 195, size: 576, align: 64, elements: !61)
!61 = !{!62, !63, !64, !65, !66, !67, !68, !70, !76, !77}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "machineID", scope: !60, file: !59, line: 197, baseType: !32, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "executionID", scope: !60, file: !59, line: 198, baseType: !32, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "lockType", scope: !60, file: !59, line: 199, baseType: !32, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "locationChecksum", scope: !60, file: !59, line: 200, baseType: !32, size: 64, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "memberName", scope: !60, file: !59, line: 201, baseType: !32, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "lamportNumber", scope: !60, file: !59, line: 202, baseType: !39, size: 32, align: 32, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "exclusivity", scope: !60, file: !59, line: 203, baseType: !69, size: 8, align: 8, offset: 352)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !36, line: 230, baseType: !33)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "startTimeMsec", scope: !60, file: !59, line: 204, baseType: !71, size: 64, align: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmTimeType", file: !36, line: 354, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !36, line: 172, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !74, line: 197, baseType: !75)
!74 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line213")
!75 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "maxWaitTimeMsec", scope: !60, file: !59, line: 205, baseType: !35, size: 32, align: 32, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "lockList", scope: !60, file: !59, line: 206, baseType: !78, size: 64, align: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ActiveLock", file: !59, line: 193, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "active_lock", file: !59, line: 187, size: 192, align: 64, elements: !81)
!81 = !{!82, !84, !85, !86}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !80, file: !59, line: 189, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "age", scope: !80, file: !59, line: 190, baseType: !35, size: 32, align: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "marked", scope: !80, file: !59, line: 191, baseType: !69, size: 8, align: 8, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "dirName", scope: !80, file: !59, line: 192, baseType: !32, size: 64, align: 64, offset: 128)
!87 = !{}
!88 = !DILocalVariable(name: "lockDir", arg: 1, scope: !48, file: !44, line: 295, type: !52)
!89 = !DIExpression()
!90 = !DILocation(line: 295, column: 34, scope: !48)
!91 = !DILocalVariable(name: "fileName", arg: 2, scope: !48, file: !44, line: 296, type: !52)
!92 = !DILocation(line: 296, column: 34, scope: !48)
!93 = !DILocalVariable(name: "buffer", arg: 3, scope: !48, file: !44, line: 297, type: !32)
!94 = !DILocation(line: 297, column: 28, scope: !48)
!95 = !DILocalVariable(name: "requiredSize", arg: 4, scope: !48, file: !44, line: 298, type: !54)
!96 = !DILocation(line: 298, column: 29, scope: !48)
!97 = !DILocalVariable(name: "memberValues", arg: 5, scope: !48, file: !44, line: 299, type: !57)
!98 = !DILocation(line: 299, column: 34, scope: !48)
!99 = !DILocalVariable(name: "len", scope: !48, file: !44, line: 301, type: !54)
!100 = !DILocation(line: 301, column: 11, scope: !48)
!101 = !DILocalVariable(name: "access", scope: !48, file: !44, line: 302, type: !51)
!102 = !DILocation(line: 302, column: 8, scope: !48)
!103 = !DILocalVariable(name: "path", scope: !48, file: !44, line: 303, type: !32)
!104 = !DILocation(line: 303, column: 10, scope: !48)
!105 = !DILocalVariable(name: "fileData", scope: !48, file: !44, line: 304, type: !106)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "FileData", file: !59, line: 108, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !59, line: 99, size: 384, align: 64, elements: !108)
!108 = !{!109, !112, !113, !114, !115, !116, !117, !118}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "fileAccessTime", scope: !107, file: !59, line: 100, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !36, line: 171, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !38, line: 55, baseType: !56)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "fileCreationTime", scope: !107, file: !59, line: 101, baseType: !110, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "fileModificationTime", scope: !107, file: !59, line: 102, baseType: !110, size: 64, align: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "fileSize", scope: !107, file: !59, line: 103, baseType: !110, size: 64, align: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "fileType", scope: !107, file: !59, line: 104, baseType: !51, size: 32, align: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "fileMode", scope: !107, file: !59, line: 105, baseType: !51, size: 32, align: 32, offset: 288)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "fileOwner", scope: !107, file: !59, line: 106, baseType: !51, size: 32, align: 32, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "fileGroup", scope: !107, file: !59, line: 107, baseType: !51, size: 32, align: 32, offset: 352)
!119 = !DILocation(line: 304, column: 13, scope: !48)
!120 = !DILocalVariable(name: "result", scope: !48, file: !44, line: 305, type: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "FileIOResult", file: !4, line: 318, baseType: !3)
!122 = !DILocation(line: 305, column: 17, scope: !48)
!123 = !DILocalVariable(name: "desc", scope: !48, file: !44, line: 306, type: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "FileIODescriptor", file: !4, line: 79, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileIODescriptor", file: !4, line: 74, size: 192, align: 64, elements: !126)
!126 = !{!127, !128, !129, !130}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "posix", scope: !125, file: !4, line: 75, baseType: !51, size: 32, align: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !125, file: !4, line: 76, baseType: !51, size: 32, align: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "fileName", scope: !125, file: !4, line: 77, baseType: !32, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "lockToken", scope: !125, file: !4, line: 78, baseType: !131, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileLockToken", file: !44, line: 87, size: 320, align: 64, elements: !133)
!133 = !{!134, !135, !136, !137}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !132, file: !44, line: 89, baseType: !35, size: 32, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "portable", scope: !132, file: !44, line: 90, baseType: !69, size: 8, align: 8, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pathName", scope: !132, file: !44, line: 91, baseType: !32, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !132, file: !44, line: 99, baseType: !138, size: 192, align: 64, offset: 128)
!138 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !132, file: !44, line: 92, size: 192, align: 64, elements: !139)
!139 = !{!140, !144}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mandatory", scope: !138, file: !44, line: 95, baseType: !141, size: 192, align: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !44, line: 93, size: 192, align: 64, elements: !142)
!142 = !{!143}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "lockFd", scope: !141, file: !44, line: 94, baseType: !124, size: 192, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "portable", scope: !138, file: !44, line: 98, baseType: !145, size: 64, align: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !44, line: 96, size: 64, align: 64, elements: !146)
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "lockFilePath", scope: !145, file: !44, line: 97, baseType: !32, size: 64, align: 64)
!148 = !DILocation(line: 306, column: 21, scope: !48)
!149 = !DILocalVariable(name: "argv", scope: !48, file: !44, line: 307, type: !150)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1024, align: 64, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 16)
!153 = !DILocation(line: 307, column: 10, scope: !48)
!154 = !DILocalVariable(name: "err", scope: !48, file: !44, line: 309, type: !51)
!155 = !DILocation(line: 309, column: 8, scope: !48)
!156 = !DILocalVariable(name: "argc", scope: !48, file: !44, line: 310, type: !35)
!157 = !DILocation(line: 310, column: 11, scope: !48)
!158 = !DILocalVariable(name: "saveptr", scope: !48, file: !44, line: 311, type: !32)
!159 = !DILocation(line: 311, column: 10, scope: !48)
!160 = !DILocalVariable(name: "table", scope: !48, file: !44, line: 313, type: !161)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 192, align: 64, elements: !168)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParseTable", file: !44, line: 78, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parse_table", file: !44, line: 73, size: 192, align: 64, elements: !164)
!164 = !{!165, !166, !167}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !163, file: !44, line: 75, baseType: !51, size: 32, align: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !163, file: !44, line: 76, baseType: !32, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "valuePtr", scope: !163, file: !44, line: 77, baseType: !31, size: 64, align: 64, offset: 128)
!168 = !{!169}
!169 = !DISubrange(count: 1)
!170 = !DILocation(line: 313, column: 15, scope: !48)
!171 = !DILocation(line: 313, column: 25, scope: !48)
!172 = !DILocation(line: 314, column: 28, scope: !48)
!173 = !DILocation(line: 316, column: 40, scope: !48)
!174 = !DILocation(line: 316, column: 54, scope: !48)
!175 = !DILocation(line: 316, column: 30, scope: !48)
!176 = !DILocation(line: 323, column: 24, scope: !48)
!177 = !DILocation(line: 323, column: 38, scope: !48)
!178 = !DILocation(line: 323, column: 11, scope: !48)
!179 = !DILocation(line: 323, column: 9, scope: !48)
!180 = !DILocation(line: 325, column: 4, scope: !48)
!181 = !DILocation(line: 327, column: 11, scope: !48)
!182 = !DILocation(line: 333, column: 38, scope: !48)
!183 = !DILocation(line: 333, column: 44, scope: !48)
!184 = !DILocation(line: 333, column: 13, scope: !48)
!185 = !DILocation(line: 333, column: 11, scope: !48)
!186 = !DILocation(line: 336, column: 26, scope: !187)
!187 = distinct !DILexicalBlock(scope: !48, file: !44, line: 336, column: 8)
!188 = !DILocation(line: 336, column: 9, scope: !187)
!189 = !DILocation(line: 336, column: 8, scope: !48)
!190 = !DILocation(line: 337, column: 48, scope: !191)
!191 = distinct !DILexicalBlock(scope: !187, file: !44, line: 336, column: 35)
!192 = !DILocation(line: 337, column: 47, scope: !191)
!193 = !DILocation(line: 337, column: 13, scope: !194)
!194 = !DILexicalBlockFile(scope: !191, file: !44, discriminator: 1)
!195 = !DILocation(line: 337, column: 11, scope: !191)
!196 = !DILocation(line: 346, column: 11, scope: !197)
!197 = distinct !DILexicalBlock(scope: !191, file: !44, line: 346, column: 11)
!198 = !DILocation(line: 346, column: 15, scope: !197)
!199 = !DILocation(line: 346, column: 11, scope: !191)
!200 = !DILocation(line: 348, column: 18, scope: !201)
!201 = distinct !DILexicalBlock(scope: !197, file: !44, line: 346, column: 25)
!202 = !DILocation(line: 348, column: 41, scope: !201)
!203 = !DILocation(line: 348, column: 24, scope: !201)
!204 = !DILocation(line: 347, column: 10, scope: !201)
!205 = !DILocation(line: 349, column: 7, scope: !201)
!206 = !DILocation(line: 351, column: 7, scope: !191)
!207 = !DILocation(line: 355, column: 26, scope: !48)
!208 = !DILocation(line: 355, column: 10, scope: !48)
!209 = !DILocation(line: 355, column: 8, scope: !48)
!210 = !DILocation(line: 357, column: 8, scope: !211)
!211 = distinct !DILexicalBlock(scope: !48, file: !44, line: 357, column: 8)
!212 = !DILocation(line: 357, column: 12, scope: !211)
!213 = !DILocation(line: 357, column: 8, scope: !48)
!214 = !DILocation(line: 365, column: 11, scope: !215)
!215 = distinct !DILexicalBlock(scope: !216, file: !44, line: 365, column: 11)
!216 = distinct !DILexicalBlock(scope: !211, file: !44, line: 357, column: 18)
!217 = !DILocation(line: 365, column: 15, scope: !215)
!218 = !DILocation(line: 365, column: 11, scope: !216)
!219 = !DILocation(line: 367, column: 18, scope: !220)
!220 = distinct !DILexicalBlock(scope: !215, file: !44, line: 365, column: 25)
!221 = !DILocation(line: 367, column: 41, scope: !220)
!222 = !DILocation(line: 367, column: 24, scope: !220)
!223 = !DILocation(line: 366, column: 10, scope: !220)
!224 = !DILocation(line: 368, column: 7, scope: !220)
!225 = !DILocation(line: 370, column: 7, scope: !216)
!226 = !DILocation(line: 372, column: 7, scope: !216)
!227 = !DILocation(line: 376, column: 17, scope: !228)
!228 = distinct !DILexicalBlock(scope: !48, file: !44, line: 376, column: 8)
!229 = !DILocation(line: 376, column: 29, scope: !228)
!230 = !DILocation(line: 376, column: 26, scope: !228)
!231 = !DILocation(line: 376, column: 8, scope: !48)
!232 = !DILocation(line: 378, column: 29, scope: !233)
!233 = distinct !DILexicalBlock(scope: !228, file: !44, line: 376, column: 43)
!234 = !DILocation(line: 378, column: 44, scope: !233)
