; ModuleID = './libguestlib_la-vmGuestLib.o.i'
source_filename = "./libguestlib_la-vmGuestLib.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._VMGuestLibHandle = type opaque
%struct.VMGuestLibHandleType = type { i32, i64, i64, i8* }
%struct.VMGuestLibStatisticsV3 = type { i32, [0 x %struct.GuestLibV3Stat] }
%struct.GuestLibV3Stat = type { i32, %union.anon }
%union.anon = type { %struct.GuestLibV3ByteArray }
%struct.GuestLibV3ByteArray = type { i8, %struct.anon }
%struct.anon = type { i32, i8* }
%struct.XDR = type { i32, %struct.xdr_ops*, i8*, i8*, i8*, i32 }
%struct.xdr_ops = type { i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*)*, i32 (%struct.XDR*, i32)*, i32* (%struct.XDR*, i32)*, void (%struct.XDR*)*, i32 (%struct.XDR*, i32*)*, i32 (%struct.XDR*, i32*)* }
%struct.VMGuestLibDataV2 = type <{ %struct.VMGuestLibHeader, %struct.StatUint32, %struct.StatUint32, %struct.StatUint32, %struct.StatUint64, %struct.StatUint32, %struct.StatUint32, %struct.StatUint32, %struct.StatUint32, %struct.StatUint32, %struct.StatUint32, %struct.StatUint32, %struct.StatUint32, %struct.StatUint32, %struct.StatUint32, %struct.StatUint32, %struct.StatUint32, %struct.StatUint64, %struct.anon.0 }>
%struct.VMGuestLibHeader = type <{ i32, i64 }>
%struct.StatUint32 = type { i8, i32 }
%struct.StatUint64 = type <{ i8, [3 x i8], i64 }>

!8 = !DIEnumerator(name: "VMGUESTLIB_ERROR_NOT_RUNNING_IN_VM", value: 2)
!9 = !DIEnumerator(name: "VMGUESTLIB_ERROR_NOT_ENABLED", value: 3)
!10 = !DIEnumerator(name: "VMGUESTLIB_ERROR_NOT_AVAILABLE", value: 4)
!11 = !DIEnumerator(name: "VMGUESTLIB_ERROR_NO_INFO", value: 5)
!12 = !DIEnumerator(name: "VMGUESTLIB_ERROR_MEMORY", value: 6)
!13 = !DIEnumerator(name: "VMGUESTLIB_ERROR_BUFFER_TOO_SMALL", value: 7)
!14 = !DIEnumerator(name: "VMGUESTLIB_ERROR_INVALID_HANDLE", value: 8)
!15 = !DIEnumerator(name: "VMGUESTLIB_ERROR_INVALID_ARG", value: 9)
!16 = !DIEnumerator(name: "VMGUESTLIB_ERROR_UNSUPPORTED_VERSION", value: 10)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GuestLibV3TypeIds", file: !18, line: 47, size: 32, align: 32, elements: !19)
!18 = !DIFile(filename: "guestlibV3.h", directory: "/home/lichi/Desktop/open-vm-tools/line1332")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!20 = !DIEnumerator(name: "GUESTLIB_TYPE_RESERVED", value: 0)
!21 = !DIEnumerator(name: "GUESTLIB_CPU_RESERVATION_MHZ", value: 1)
!22 = !DIEnumerator(name: "GUESTLIB_CPU_LIMIT_MHZ", value: 2)
!23 = !DIEnumerator(name: "GUESTLIB_CPU_SHARES", value: 3)
!24 = !DIEnumerator(name: "GUESTLIB_CPU_USED_MS", value: 4)
!25 = !DIEnumerator(name: "GUESTLIB_HOST_MHZ", value: 5)
!26 = !DIEnumerator(name: "GUESTLIB_MEM_RESERVATION_MB", value: 6)
!27 = !DIEnumerator(name: "GUESTLIB_MEM_LIMIT_MB", value: 7)
!28 = !DIEnumerator(name: "GUESTLIB_MEM_SHARES", value: 8)
!29 = !DIEnumerator(name: "GUESTLIB_MEM_MAPPED_MB", value: 9)
!30 = !DIEnumerator(name: "GUESTLIB_MEM_ACTIVE_MB", value: 10)
!31 = !DIEnumerator(name: "GUESTLIB_MEM_OVERHEAD_MB", value: 11)
!32 = !DIEnumerator(name: "GUESTLIB_MEM_BALLOONED_MB", value: 12)
!33 = !DIEnumerator(name: "GUESTLIB_MEM_SWAPPED_MB", value: 13)
!34 = !DIEnumerator(name: "GUESTLIB_MEM_SHARED_MB", value: 14)
!35 = !DIEnumerator(name: "GUESTLIB_MEM_SHARED_SAVED_MB", value: 15)
!36 = !DIEnumerator(name: "GUESTLIB_MEM_USED_MB", value: 16)
!37 = !DIEnumerator(name: "GUESTLIB_ELAPSED_MS", value: 17)
!38 = !DIEnumerator(name: "GUESTLIB_RESOURCE_POOL_PATH", value: 18)
!39 = !DIEnumerator(name: "GUESTLIB_CPU_STOLEN_MS", value: 19)
!40 = !DIEnumerator(name: "GUESTLIB_MEM_TARGET_SIZE_MB", value: 20)
!41 = !DIEnumerator(name: "GUESTLIB_HOST_CPU_NUM_CORES", value: 21)
!42 = !DIEnumerator(name: "GUESTLIB_HOST_CPU_USED_MS", value: 22)
!43 = !DIEnumerator(name: "GUESTLIB_HOST_MEM_SWAPPED_MB", value: 23)
!44 = !DIEnumerator(name: "GUESTLIB_HOST_MEM_SHARED_MB", value: 24)
!45 = !DIEnumerator(name: "GUESTLIB_HOST_MEM_USED_MB", value: 25)
!46 = !DIEnumerator(name: "GUESTLIB_HOST_MEM_PHYS_MB", value: 26)
!47 = !DIEnumerator(name: "GUESTLIB_HOST_MEM_PHYS_FREE_MB", value: 27)
!48 = !DIEnumerator(name: "GUESTLIB_HOST_MEM_KERN_OVHD_MB", value: 28)
!49 = !DIEnumerator(name: "GUESTLIB_HOST_MEM_MAPPED_MB", value: 29)
!50 = !DIEnumerator(name: "GUESTLIB_HOST_MEM_UNMAPPED_MB", value: 30)
!51 = !DIEnumerator(name: "GUESTLIB_MEM_ZIPPED_MB", value: 31)
!52 = !DIEnumerator(name: "GUESTLIB_MEM_ZIPSAVED_MB", value: 32)
!53 = !DIEnumerator(name: "GUESTLIB_MEM_LLSWAPPED_MB", value: 33)
!54 = !DIEnumerator(name: "GUESTLIB_MEM_SWAP_TARGET_MB", value: 34)
!55 = !DIEnumerator(name: "GUESTLIB_MEM_BALLOON_TARGET_MB", value: 35)
!56 = !DIEnumerator(name: "GUESTLIB_MEM_BALLOON_MAX_MB", value: 36)
!57 = !DIEnumerator(name: "GUESTLIB_RESOURCE_POOL_PATH_LONG", value: 37)
!58 = !DIEnumerator(name: "GUESTLIB_MAX_STATISTIC_ID", value: 38)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdr_op", file: !60, line: 81, size: 32, align: 32, elements: !61)
!60 = !DIFile(filename: "/usr/include/rpc/xdr.h", directory: "/home/lichi/Desktop/open-vm-tools/line1332")
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "XDR_ENCODE", value: 0)
!63 = !DIEnumerator(name: "XDR_DECODE", value: 1)
!64 = !DIEnumerator(name: "XDR_FREE", value: 2)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GuestLibIoctlId", file: !66, line: 28, size: 32, align: 32, elements: !67)
!66 = !DIFile(filename: "guestlibIoctl.h", directory: "/home/lichi/Desktop/open-vm-tools/line1332")
!67 = !{!68, !69}
!68 = !DIEnumerator(name: "GUESTLIB_IOCTL_ATOMIC_UPDATE_COOKIE", value: 1)
!69 = !DIEnumerator(name: "GUESTLIB_IOCTL_MAX", value: 2)
!70 = !{!71, !72, !75, !96, !132, !176, !230, !240}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMGuestLibHandle", file: !4, line: 74, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_VMGuestLibHandle", file: !4, line: 73, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMGuestLibHandleType", file: !77, line: 70, baseType: !78)
!77 = !DIFile(filename: "vmGuestLib.c", directory: "/home/lichi/Desktop/open-vm-tools/line1332")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 55, size: 256, align: 64, elements: !79)
!79 = !{!80, !86, !92, !95}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !78, file: !77, line: 56, baseType: !81, size: 32, align: 32)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !82, line: 173, baseType: !83)
!82 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1332")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !84, line: 51, baseType: !85)
!84 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line1332")
!85 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "sessionId", scope: !78, file: !77, line: 57, baseType: !87, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMSessionId", file: !88, line: 28, baseType: !89)
!88 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmSessionId.h", directory: "/home/lichi/Desktop/open-vm-tools/line1332")
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !82, line: 171, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !84, line: 55, baseType: !91)
!91 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "dataSize", scope: !78, file: !77, line: 68, baseType: !93, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 216, baseType: !91)
!94 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1332")
!95 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !78, file: !77, line: 69, baseType: !71, size: 64, align: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdrproc_t", file: !60, line: 152, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !103, !71, null}
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool_t", file: !101, line: 37, baseType: !102)
!101 = !DIFile(filename: "/usr/include/rpc/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1332")
!102 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDR", file: !60, line: 109, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "XDR", file: !60, line: 110, size: 384, align: 64, elements: !106)
!106 = !{!107, !108, !172, !173, !174, !175}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "x_op", scope: !105, file: !60, line: 112, baseType: !59, size: 32, align: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "x_ops", scope: !105, file: !60, line: 136, baseType: !109, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdr_ops", file: !60, line: 113, size: 640, align: 64, elements: !111)
!111 = !{!112, !118, !124, !136, !142, !148, !152, !158, !162, !166}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "x_getlong", scope: !110, file: !60, line: 115, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!100, !103, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "x_putlong", scope: !110, file: !60, line: 117, baseType: !119, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!100, !103, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "x_getbytes", scope: !110, file: !60, line: 119, baseType: !125, size: 64, align: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!100, !103, !128, !134}
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !129, line: 116, baseType: !130)
!129 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1332")
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__caddr_t", file: !131, line: 183, baseType: !132)
!131 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1332")
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !129, line: 35, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !131, line: 32, baseType: !85)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "x_putbytes", scope: !110, file: !60, line: 121, baseType: !137, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!100, !103, !140, !134}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "x_getpostn", scope: !110, file: !60, line: 123, baseType: !143, size: 64, align: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!134, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "x_setpostn", scope: !110, file: !60, line: 125, baseType: !149, size: 64, align: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!100, !103, !134}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "x_inline", scope: !110, file: !60, line: 127, baseType: !153, size: 64, align: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!156, !103, !134}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !129, line: 196, baseType: !102)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "x_destroy", scope: !110, file: !60, line: 129, baseType: !159, size: 64, align: 64, offset: 448)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !103}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "x_getint32", scope: !110, file: !60, line: 131, baseType: !163, size: 64, align: 64, offset: 512)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!100, !103, !156}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "x_putint32", scope: !110, file: !60, line: 133, baseType: !167, size: 64, align: 64, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!100, !103, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "x_public", scope: !105, file: !60, line: 137, baseType: !128, size: 64, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "x_private", scope: !105, file: !60, line: 138, baseType: !128, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "x_base", scope: !105, file: !60, line: 139, baseType: !128, size: 64, align: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "x_handy", scope: !105, file: !60, line: 140, baseType: !134, size: 32, align: 32, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMGuestLibDataV2", file: !178, line: 180, baseType: !179)
!178 = !DIFile(filename: "vmGuestLibInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line1332")
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VMGuestLibDataV2", file: !178, line: 138, size: 5352, align: 8, elements: !180)
!180 = !{!181, !187, !194, !195, !196, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !179, file: !178, line: 140, baseType: !182, size: 96, align: 8)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMGuestLibHeader", file: !178, line: 128, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 123, size: 96, align: 8, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !183, file: !178, line: 124, baseType: !81, size: 32, align: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sessionId", scope: !183, file: !178, line: 125, baseType: !87, size: 64, align: 64, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "cpuReservationMHz", scope: !179, file: !178, line: 145, baseType: !188, size: 64, align: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "StatUint32", file: !178, line: 52, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 49, size: 64, align: 32, elements: !190)
!190 = !{!191, !193}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !189, file: !178, line: 50, baseType: !192, size: 8, align: 8)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !82, line: 230, baseType: !133)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !189, file: !178, line: 51, baseType: !81, size: 32, align: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cpuLimitMHz", scope: !179, file: !178, line: 146, baseType: !188, size: 64, align: 32, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cpuShares", scope: !179, file: !178, line: 147, baseType: !188, size: 64, align: 32, offset: 224)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cpuUsedMs", scope: !179, file: !178, line: 148, baseType: !197, size: 96, align: 8, offset: 288)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "StatUint64", file: !178, line: 69, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 63, size: 96, align: 8, elements: !199)
!199 = !{!200, !201, !208}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !198, file: !178, line: 64, baseType: !192, size: 8, align: 8)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !198, file: !178, line: 65, baseType: !202, size: 24, align: 8, offset: 8)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 24, align: 8, elements: !206)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !82, line: 177, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !84, line: 48, baseType: !205)
!205 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!206 = !{!207}
!207 = !DISubrange(count: 3)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !198, file: !178, line: 66, baseType: !89, size: 64, align: 64, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "hostMHz", scope: !179, file: !178, line: 151, baseType: !188, size: 64, align: 32, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "memReservationMB", scope: !179, file: !178, line: 154, baseType: !188, size: 64, align: 32, offset: 448)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "memLimitMB", scope: !179, file: !178, line: 155, baseType: !188, size: 64, align: 32, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "memShares", scope: !179, file: !178, line: 156, baseType: !188, size: 64, align: 32, offset: 576)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "memMappedMB", scope: !179, file: !178, line: 157, baseType: !188, size: 64, align: 32, offset: 640)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "memActiveMB", scope: !179, file: !178, line: 158, baseType: !188, size: 64, align: 32, offset: 704)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "memOverheadMB", scope: !179, file: !178, line: 159, baseType: !188, size: 64, align: 32, offset: 768)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "memBalloonedMB", scope: !179, file: !178, line: 160, baseType: !188, size: 64, align: 32, offset: 832)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "memSwappedMB", scope: !179, file: !178, line: 161, baseType: !188, size: 64, align: 32, offset: 896)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "memSharedMB", scope: !179, file: !178, line: 162, baseType: !188, size: 64, align: 32, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "memSharedSavedMB", scope: !179, file: !178, line: 163, baseType: !188, size: 64, align: 32, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "memUsedMB", scope: !179, file: !178, line: 164, baseType: !188, size: 64, align: 32, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "elapsedMs", scope: !179, file: !178, line: 167, baseType: !197, size: 96, align: 8, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "resourcePoolPath", scope: !179, file: !178, line: 177, baseType: !223, size: 4104, align: 8, offset: 1248)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !179, file: !178, line: 174, size: 4104, align: 8, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !223, file: !178, line: 175, baseType: !192, size: 8, align: 8)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !223, file: !178, line: 176, baseType: !227, size: 4096, align: 8, offset: 8)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 4096, align: 8, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 512)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMGuestLibDataV3", file: !178, line: 213, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VMGuestLibDataV3", file: !178, line: 204, size: 128, align: 8, elements: !233)
!233 = !{!234, !235, !236}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !232, file: !178, line: 206, baseType: !182, size: 96, align: 8)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "dataSize", scope: !232, file: !178, line: 209, baseType: !81, size: 32, align: 32, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !232, file: !178, line: 210, baseType: !237, align: 8, offset: 128)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, align: 8, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 0)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestLibIoctlParam", file: !66, line: 46, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestLibIoctlParam", file: !66, line: 40, size: 192, align: 64, elements: !243)
!243 = !{!244, !246}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !242, file: !66, line: 41, baseType: !245, size: 32, align: 32)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestLibIoctlId", file: !66, line: 32, baseType: !65)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "GuestLibIoctlParam_u", scope: !242, file: !66, line: 44, baseType: !247, size: 128, align: 64, offset: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !242, file: !66, line: 42, size: 128, align: 64, elements: !248)
!248 = !{!249}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "atomicUpdateCookie", scope: !247, file: !66, line: 43, baseType: !250, size: 128, align: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestLibIoctlAtomicUpdateCookie", file: !66, line: 34, size: 128, align: 64, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !250, file: !66, line: 35, baseType: !132, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !250, file: !66, line: 36, baseType: !132, size: 64, align: 64, offset: 64)
!254 = !{!255}
!255 = distinct !DIGlobalVariable(name: "request", scope: !256, file: !77, line: 1788, type: !140, isLocal: true, isDefinition: true, variable: i8** @VMGuestLibIoctl.request)
!256 = distinct !DISubprogram(name: "VMGuestLibIoctl", scope: !77, file: !77, line: 1782, type: !257, isLocal: true, isDefinition: true, scopeLine: 1785, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!257 = !DISubroutineType(types: !258)
!258 = !{!192, !259, !261, !262}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!263 = !{}
!264 = !{i32 2, !"Dwarf Version", i32 4}
!265 = !{i32 2, !"Debug Info Version", i32 3}
!266 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!267 = distinct !DISubprogram(name: "VMGuestLib_GetErrorText", scope: !77, file: !77, line: 150, type: !268, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!268 = !DISubroutineType(types: !269)
!269 = !{!140, !270}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMGuestLibError", file: !4, line: 55, baseType: !3)
!271 = !DILocalVariable(name: "error", arg: 1, scope: !267, file: !77, line: 150, type: !270)
!272 = !DIExpression()
!273 = !DILocation(line: 150, column: 41, scope: !267)
!274 = !DILocation(line: 152, column: 12, scope: !267)
!275 = !DILocation(line: 152, column: 4, scope: !267)
!276 = !DILocation(line: 154, column: 7, scope: !277)
!277 = distinct !DILexicalBlock(scope: !267, file: !77, line: 152, column: 19)
!278 = !DILocation(line: 157, column: 7, scope: !277)
!279 = !DILocation(line: 160, column: 7, scope: !277)
!280 = !DILocation(line: 163, column: 7, scope: !277)
!281 = !DILocation(line: 166, column: 7, scope: !277)
!282 = !DILocation(line: 169, column: 7, scope: !277)
!283 = !DILocation(line: 172, column: 7, scope: !277)
!284 = !DILocation(line: 175, column: 7, scope: !277)
!285 = !DILocation(line: 178, column: 7, scope: !277)
!286 = !DILocation(line: 181, column: 7, scope: !277)
!287 = !DILocation(line: 184, column: 7, scope: !277)
!288 = !DILocation(line: 188, column: 7, scope: !277)
!289 = !DILocation(line: 192, column: 1, scope: !267)
!290 = distinct !DISubprogram(name: "VMGuestLib_OpenHandle", scope: !77, file: !77, line: 258, type: !291, isLocal: false, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!291 = !DISubroutineType(types: !292)
!292 = !{!270, !293}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!294 = !DILocalVariable(name: "handle", arg: 1, scope: !290, file: !77, line: 258, type: !293)
!295 = !DILocation(line: 258, column: 41, scope: !290)
!296 = !DILocalVariable(name: "data", scope: !290, file: !77, line: 260, type: !75)
!297 = !DILocation(line: 260, column: 26, scope: !290)
!298 = !DILocation(line: 262, column: 9, scope: !299)
!299 = distinct !DILexicalBlock(scope: !290, file: !77, line: 262, column: 8)
!300 = !DILocation(line: 262, column: 8, scope: !290)
!301 = !DILocation(line: 263, column: 7, scope: !302)
!302 = distinct !DILexicalBlock(scope: !299, file: !77, line: 262, column: 35)
!303 = !DILocation(line: 264, column: 7, scope: !302)
!304 = !DILocation(line: 267, column: 15, scope: !305)
!305 = distinct !DILexicalBlock(scope: !290, file: !77, line: 267, column: 7)
!306 = !DILocation(line: 267, column: 12, scope: !305)
!307 = !DILocation(line: 267, column: 7, scope: !290)
!308 = !DILocation(line: 268, column: 7, scope: !309)
!309 = distinct !DILexicalBlock(scope: !305, file: !77, line: 267, column: 23)
!310 = !DILocation(line: 271, column: 11, scope: !290)
!311 = !DILocation(line: 271, column: 9, scope: !290)
!312 = !DILocation(line: 272, column: 9, scope: !313)
!313 = distinct !DILexicalBlock(scope: !290, file: !77, line: 272, column: 8)
!314 = !DILocation(line: 272, column: 8, scope: !290)
!315 = !DILocation(line: 273, column: 7, scope: !316)
!316 = distinct !DILexicalBlock(scope: !313, file: !77, line: 272, column: 15)
!317 = !DILocation(line: 274, column: 7, scope: !316)
!318 = !DILocation(line: 277, column: 32, scope: !290)
!319 = !DILocation(line: 277, column: 14, scope: !290)
!320 = !DILocation(line: 277, column: 5, scope: !290)
!321 = !DILocation(line: 277, column: 12, scope: !290)
!322 = !DILocation(line: 278, column: 4, scope: !290)
!323 = !DILocation(line: 279, column: 1, scope: !290)
!324 = distinct !DISubprogram(name: "VMGuestLib_CloseHandle", scope: !77, file: !77, line: 301, type: !325, isLocal: false, isDefinition: true, scopeLine: 302, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!325 = !DISubroutineType(types: !326)
!326 = !{!270, !72}
!327 = !DILocalVariable(name: "handle", arg: 1, scope: !324, file: !77, line: 301, type: !72)
!328 = !DILocation(line: 301, column: 41, scope: !324)
!329 = !DILocalVariable(name: "data", scope: !324, file: !77, line: 303, type: !71)
!330 = !DILocation(line: 303, column: 10, scope: !324)
!331 = !DILocation(line: 305, column: 15, scope: !332)
!332 = distinct !DILexicalBlock(scope: !324, file: !77, line: 305, column: 7)
!333 = !DILocation(line: 305, column: 12, scope: !332)
!334 = !DILocation(line: 305, column: 7, scope: !324)
!335 = !DILocation(line: 306, column: 7, scope: !336)
!336 = distinct !DILexicalBlock(scope: !332, file: !77, line: 305, column: 23)
!337 = !DILocation(line: 309, column: 38, scope: !324)
!338 = !DILocation(line: 309, column: 48, scope: !324)
!339 = !DILocation(line: 309, column: 9, scope: !324)
!340 = !DILocation(line: 310, column: 8, scope: !341)
!341 = distinct !DILexicalBlock(scope: !324, file: !77, line: 310, column: 8)
!342 = !DILocation(line: 310, column: 13, scope: !341)
!343 = !DILocation(line: 310, column: 20, scope: !341)
!344 = !DILocation(line: 311, column: 35, scope: !341)
!345 = !DILocation(line: 311, column: 45, scope: !341)
!346 = !DILocation(line: 311, column: 56, scope: !341)
!347 = !DILocation(line: 311, column: 61, scope: !341)
!348 = !DILocation(line: 312, column: 35, scope: !341)
!349 = !DILocation(line: 312, column: 45, scope: !341)
!350 = !DILocation(line: 312, column: 54, scope: !341)
!351 = !DILocation(line: 310, column: 8, scope: !352)
!352 = !DILexicalBlockFile(scope: !324, file: !77, discriminator: 1)
!353 = !DILocalVariable(name: "v3stats", scope: !354, file: !77, line: 313, type: !355)
!354 = distinct !DILexicalBlock(scope: !341, file: !77, line: 312, column: 60)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMGuestLibStatisticsV3", file: !77, line: 52, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 49, size: 64, align: 64, elements: !358)
!358 = !{!359, !361}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "numStats", scope: !357, file: !77, line: 50, baseType: !360, size: 32, align: 32)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestLibV3StatCount", file: !18, line: 45, baseType: !81)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !357, file: !77, line: 51, baseType: !362, align: 64, offset: 64)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, align: 64, elements: !238)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestLibV3Stat", file: !18, line: 132, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestLibV3Stat", file: !18, line: 90, size: 256, align: 64, elements: !365)
!365 = !{!366, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !364, file: !18, line: 91, baseType: !367, size: 32, align: 32)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestLibV3TypeIds", file: !18, line: 88, baseType: !17)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "GuestLibV3Stat_u", scope: !364, file: !18, line: 130, baseType: !369, size: 192, align: 64, offset: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !364, file: !18, line: 92, size: 192, align: 64, elements: !370)
!370 = !{!371, !376, !377, !378, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "cpuReservationMHz", scope: !369, file: !18, line: 93, baseType: !372, size: 64, align: 32)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestLibV3StatUint32", file: !18, line: 17, size: 64, align: 32, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !372, file: !18, line: 18, baseType: !192, size: 8, align: 8)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !372, file: !18, line: 19, baseType: !81, size: 32, align: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "cpuLimitMHz", scope: !369, file: !18, line: 94, baseType: !372, size: 64, align: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "cpuShares", scope: !369, file: !18, line: 95, baseType: !372, size: 64, align: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "cpuUsedMs", scope: !369, file: !18, line: 96, baseType: !379, size: 128, align: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestLibV3StatUint64", file: !18, line: 23, size: 128, align: 64, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !379, file: !18, line: 24, baseType: !192, size: 8, align: 8)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !379, file: !18, line: 25, baseType: !89, size: 64, align: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "hostMHz", scope: !369, file: !18, line: 97, baseType: !372, size: 64, align: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "memReservationMB", scope: !369, file: !18, line: 98, baseType: !372, size: 64, align: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "memLimitMB", scope: !369, file: !18, line: 99, baseType: !372, size: 64, align: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "memShares", scope: !369, file: !18, line: 100, baseType: !372, size: 64, align: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "memMappedMB", scope: !369, file: !18, line: 101, baseType: !372, size: 64, align: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "memActiveMB", scope: !369, file: !18, line: 102, baseType: !372, size: 64, align: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "memOverheadMB", scope: !369, file: !18, line: 103, baseType: !372, size: 64, align: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "memBalloonedMB", scope: !369, file: !18, line: 104, baseType: !372, size: 64, align: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "memSwappedMB", scope: !369, file: !18, line: 105, baseType: !372, size: 64, align: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "memSharedMB", scope: !369, file: !18, line: 106, baseType: !372, size: 64, align: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "memSharedSavedMB", scope: !369, file: !18, line: 107, baseType: !372, size: 64, align: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "memUsedMB", scope: !369, file: !18, line: 108, baseType: !372, size: 64, align: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "elapsedMs", scope: !369, file: !18, line: 109, baseType: !379, size: 128, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "resourcePoolPath", scope: !369, file: !18, line: 110, baseType: !397, size: 128, align: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestLibV3String", file: !18, line: 30, size: 128, align: 64, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !397, file: !18, line: 31, baseType: !192, size: 8, align: 8)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !397, file: !18, line: 32, baseType: !132, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "cpuStolenMs", scope: !369, file: !18, line: 111, baseType: !379, size: 128, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "memTargetSizeMB", scope: !369, file: !18, line: 112, baseType: !379, size: 128, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "hostCpuNumCores", scope: !369, file: !18, line: 113, baseType: !372, size: 64, align: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "hostCpuUsedMs", scope: !369, file: !18, line: 114, baseType: !379, size: 128, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "hostMemSwappedMB", scope: !369, file: !18, line: 115, baseType: !379, size: 128, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "hostMemSharedMB", scope: !369, file: !18, line: 116, baseType: !379, size: 128, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "hostMemUsedMB", scope: !369, file: !18, line: 117, baseType: !379, size: 128, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "hostMemPhysMB", scope: !369, file: !18, line: 118, baseType: !379, size: 128, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "hostMemPhysFreeMB", scope: !369, file: !18, line: 119, baseType: !379, size: 128, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "hostMemKernOvhdMB", scope: !369, file: !18, line: 120, baseType: !379, size: 128, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "hostMemMappedMB", scope: !369, file: !18, line: 121, baseType: !379, size: 128, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "hostMemUnmappedMB", scope: !369, file: !18, line: 122, baseType: !379, size: 128, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "memZippedMB", scope: !369, file: !18, line: 123, baseType: !372, size: 64, align: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "memZipSavedMB", scope: !369, file: !18, line: 124, baseType: !372, size: 64, align: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "memLLSwappedMB", scope: !369, file: !18, line: 125, baseType: !372, size: 64, align: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "memSwapTargetMB", scope: !369, file: !18, line: 126, baseType: !372, size: 64, align: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "memBalloonTargetMB", scope: !369, file: !18, line: 127, baseType: !372, size: 64, align: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "memBalloonMaxMB", scope: !369, file: !18, line: 128, baseType: !372, size: 64, align: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "resourcePoolPathLong", scope: !369, file: !18, line: 129, baseType: !420, size: 192, align: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestLibV3ByteArray", file: !18, line: 36, size: 192, align: 64, elements: !421)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !420, file: !18, line: 37, baseType: !192, size: 8, align: 8)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !420, file: !18, line: 41, baseType: !424, size: 128, align: 64, offset: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !420, file: !18, line: 38, size: 128, align: 64, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "value_len", scope: !424, file: !18, line: 39, baseType: !134, size: 32, align: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "value_val", scope: !424, file: !18, line: 40, baseType: !132, size: 64, align: 64, offset: 64)
!428 = !DILocation(line: 313, column: 31, scope: !354)
!429 = !DILocation(line: 313, column: 41, scope: !354)
!430 = !DILocalVariable(name: "count", scope: !354, file: !77, line: 314, type: !360)
!431 = !DILocation(line: 314, column: 27, scope: !354)
!432 = !DILocation(line: 316, column: 18, scope: !433)
!433 = distinct !DILexicalBlock(scope: !354, file: !77, line: 316, column: 7)
!434 = !DILocation(line: 316, column: 12, scope: !433)
!435 = !DILocation(line: 316, column: 23, scope: !436)
!436 = !DILexicalBlockFile(scope: !437, file: !77, discriminator: 1)
!437 = distinct !DILexicalBlock(scope: !433, file: !77, line: 316, column: 7)
!438 = !DILocation(line: 316, column: 31, scope: !436)
!439 = !DILocation(line: 316, column: 40, scope: !436)
!440 = !DILocation(line: 316, column: 29, scope: !436)
!441 = !DILocation(line: 316, column: 7, scope: !436)
!442 = !DILocation(line: 317, column: 77, scope: !443)
!443 = distinct !DILexicalBlock(scope: !437, file: !77, line: 316, column: 59)
!444 = !DILocation(line: 317, column: 62, scope: !443)
!445 = !DILocation(line: 317, column: 71, scope: !443)
!446 = !DILocation(line: 317, column: 52, scope: !443)
!447 = !DILocation(line: 317, column: 10, scope: !443)
!448 = !DILocation(line: 318, column: 7, scope: !443)
!449 = !DILocation(line: 316, column: 55, scope: !450)
!450 = !DILexicalBlockFile(scope: !437, file: !77, discriminator: 2)
!451 = !DILocation(line: 316, column: 7, scope: !450)
!452 = distinct !{!452, !453}
!453 = !DILocation(line: 316, column: 7, scope: !354)
!454 = !DILocation(line: 319, column: 4, scope: !354)
!455 = !DILocation(line: 320, column: 9, scope: !324)
!456 = !DILocation(line: 320, column: 4, scope: !324)
!457 = !DILocation(line: 323, column: 31, scope: !324)
!458 = !DILocation(line: 323, column: 41, scope: !324)
!459 = !DILocation(line: 323, column: 47, scope: !324)
!460 = !DILocation(line: 324, column: 9, scope: !324)
!461 = !DILocation(line: 324, column: 4, scope: !324)
!462 = !DILocation(line: 326, column: 4, scope: !324)
!463 = !DILocation(line: 327, column: 1, scope: !324)
!464 = distinct !DISubprogram(name: "VMGuestLib_UpdateInfo", scope: !77, file: !77, line: 591, type: !325, isLocal: false, isDefinition: true, scopeLine: 592, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !263)
!465 = !DILocalVariable(name: "handle", arg: 1, scope: !464, file: !77, line: 591, type: !72)
!466 = !DILocation(line: 591, column: 40, scope: !464)
!467 = !DILocalVariable(name: "error", scope: !464, file: !77, line: 593, type: !270)
!468 = !DILocation(line: 593, column: 20, scope: !464)
!469 = !DILocation(line: 595, column: 15, scope: !470)
!470 = distinct !DILexicalBlock(scope: !464, file: !77, line: 595, column: 7)
!471 = !DILocation(line: 595, column: 12, scope: !470)
!472 = !DILocation(line: 595, column: 7, scope: !464)
!473 = !DILocation(line: 596, column: 7, scope: !474)
!474 = distinct !DILexicalBlock(scope: !470, file: !77, line: 595, column: 23)
!475 = !DILocation(line: 604, column: 33, scope: !464)
!476 = !DILocation(line: 604, column: 12, scope: !464)
!477 = !DILocation(line: 604, column: 10, scope: !464)
!478 = !DILocation(line: 605, column: 8, scope: !479)
!479 = distinct !DILexicalBlock(scope: !464, file: !77, line: 605, column: 8)
!480 = !DILocation(line: 605, column: 14, scope: !479)
!481 = !DILocation(line: 605, column: 8, scope: !464)
!482 = !DILocation(line: 606, column: 50, scope: !483)
!483 = distinct !DILexicalBlock(scope: !479, file: !77, line: 605, column: 43)
!484 = !DILocation(line: 606, column: 7, scope: !483)
!485 = !DILocation(line: 607, column: 34, scope: !483)
!486 = !DILocation(line: 607, column: 44, scope: !483)
!487 = !DILocation(line: 607, column: 55, scope: !483)
!488 = !DILocation(line: 608, column: 14, scope: !483)
!489 = !DILocation(line: 608, column: 7, scope: !483)
