; ModuleID = './hashTable.o.i'
source_filename = "./hashTable.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.HashTable = type { i32, i32, i32, i8, i8, void (i8*)*, %struct.Atomic_uint64*, i64 }
%struct.Atomic_uint64 = type { i64 }
%struct.HashTableEntry = type { %struct.Atomic_uint64, i8*, %struct.Atomic_uint64 }

@.str = private unnamed_addr constant [28 x i8] c"%s only takes powers of 2 \0A\00", align 1
@__FUNCTION__.HashTable_Alloc = private unnamed_addr constant [16 x i8] c"HashTable_Alloc\00", align 1
@.str.1 = private unnamed_addr constant [19 x i8] c"NOT_REACHED %s:%d\0A\00", align 1
@.str.2 = private unnamed_addr constant [12 x i8] c"hashTable.c\00", align 1

; Function Attrs: nounwind uwtable
define %struct.HashTable* @HashTable_Alloc(i32, i32, void (i8*)*) #0 !dbg !40 {
  %4 = alloca i32, align 4
  %5 = alloca i32, align 4
  %6 = alloca void (i8*)*, align 8
  %7 = alloca %struct.HashTable*, align 8
  store i32 %0, i32* %4, align 4
  call void @llvm.dbg.declare(metadata i32* %4, metadata !65, metadata !66), !dbg !67
  store i32 %1, i32* %5, align 4
  call void @llvm.dbg.declare(metadata i32* %5, metadata !68, metadata !66), !dbg !69
  store void (i8*)* %2, void (i8*)** %6, align 8
  call void @llvm.dbg.declare(metadata void (i8*)** %6, metadata !70, metadata !66), !dbg !71
  call void @llvm.dbg.declare(metadata %struct.HashTable** %7, metadata !72, metadata !66), !dbg !73

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "hashTable.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line592")
!2 = !{}
!3 = !{!4, !5, !28, !19, !29, !31, !34}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashTableEntry", file: !7, line: 74, baseType: !8)
!7 = !DIFile(filename: "hashTable.c", directory: "/home/lichi/Desktop/open-vm-tools/line592")
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HashTableEntry", file: !7, line: 70, size: 192, align: 64, elements: !9)
!9 = !{!10, !24, !27}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !8, file: !7, line: 71, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashTableLink", file: !7, line: 55, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_Ptr", file: !13, line: 3829, baseType: !14)
!13 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_atomic.h", directory: "/home/lichi/Desktop/open-vm-tools/line592")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint64", file: !13, line: 139, baseType: !15)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint64", file: !13, line: 137, size: 64, align: 64, elements: !16)
!16 = !{!17}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !15, file: !13, line: 138, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !20, line: 171, baseType: !21)
!20 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line592")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !22, line: 55, baseType: !23)
!22 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line592")
!23 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "keyStr", scope: !8, file: !7, line: 72, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !8, file: !7, line: 73, baseType: !12, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !22, line: 122, baseType: !23)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !20, line: 173, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !22, line: 51, baseType: !33)
!33 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!37 = !{i32 2, !"Dwarf Version", i32 4}
!38 = !{i32 2, !"Debug Info Version", i32 3}
!39 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!40 = distinct !DISubprogram(name: "HashTable_Alloc", scope: !7, file: !7, line: 224, type: !41, isLocal: false, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !31, !51, !56}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashTable", file: !45, line: 40, baseType: !46)
!45 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hashTable.h", directory: "/home/lichi/Desktop/open-vm-tools/line592")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HashTable", file: !7, line: 80, size: 320, align: 64, elements: !47)
!47 = !{!48, !49, !50, !52, !54, !55, !60, !62}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "numEntries", scope: !46, file: !7, line: 81, baseType: !31, size: 32, align: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "numBits", scope: !46, file: !7, line: 82, baseType: !31, size: 32, align: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "keyType", scope: !46, file: !7, line: 83, baseType: !51, size: 32, align: 32, offset: 64)
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "atomic", scope: !46, file: !7, line: 84, baseType: !53, size: 8, align: 8, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !20, line: 230, baseType: !36)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "copyKey", scope: !46, file: !7, line: 85, baseType: !53, size: 8, align: 8, offset: 104)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "freeEntryFn", scope: !46, file: !7, line: 86, baseType: !56, size: 64, align: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashTableFreeEntryFn", file: !45, line: 43, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !4}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !46, file: !7, line: 87, baseType: !61, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "numElements", scope: !46, file: !7, line: 89, baseType: !63, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !64, line: 216, baseType: !23)
!64 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line592")
!65 = !DILocalVariable(name: "numEntries", arg: 1, scope: !40, file: !7, line: 224, type: !31)
!66 = !DIExpression()
!67 = !DILocation(line: 224, column: 24, scope: !40)
!68 = !DILocalVariable(name: "keyType", arg: 2, scope: !40, file: !7, line: 225, type: !51)
!69 = !DILocation(line: 225, column: 21, scope: !40)
!70 = !DILocalVariable(name: "fn", arg: 3, scope: !40, file: !7, line: 226, type: !56)
!71 = !DILocation(line: 226, column: 38, scope: !40)
!72 = !DILocalVariable(name: "ht", scope: !40, file: !7, line: 228, type: !43)
!73 = !DILocation(line: 228, column: 15, scope: !40)
!74 = !DILocation(line: 231, column: 9, scope: !75)
!75 = distinct !DILexicalBlock(scope: !40, file: !7, line: 231, column: 8)
!76 = !DILocation(line: 231, column: 23, scope: !75)
!77 = !DILocation(line: 231, column: 34, scope: !75)
!78 = !DILocation(line: 231, column: 20, scope: !75)
!79 = !DILocation(line: 231, column: 40, scope: !75)
!80 = !DILocation(line: 231, column: 8, scope: !40)
!81 = !DILocation(line: 232, column: 7, scope: !82)
!82 = distinct !DILexicalBlock(scope: !75, file: !7, line: 231, column: 46)
!83 = !DILocation(line: 241, column: 9, scope: !40)
!84 = !DILocation(line: 241, column: 7, scope: !40)
!85 = !DILocation(line: 243, column: 27, scope: !40)
!86 = !DILocation(line: 243, column: 18, scope: !40)
!87 = !DILocation(line: 243, column: 4, scope: !40)
!88 = !DILocation(line: 243, column: 8, scope: !40)
!89 = !DILocation(line: 243, column: 16, scope: !40)
!90 = !DILocation(line: 244, column: 21, scope: !40)
!91 = !DILocation(line: 244, column: 4, scope: !40)
!92 = !DILocation(line: 244, column: 8, scope: !40)
!93 = !DILocation(line: 244, column: 19, scope: !40)
!94 = !DILocation(line: 245, column: 18, scope: !40)
!95 = !DILocation(line: 245, column: 26, scope: !40)
!96 = !DILocation(line: 245, column: 4, scope: !40)
!97 = !DILocation(line: 245, column: 8, scope: !40)
!98 = !DILocation(line: 245, column: 16, scope: !40)
!99 = !DILocation(line: 246, column: 18, scope: !40)
!100 = !DILocation(line: 246, column: 26, scope: !40)
!101 = !DILocation(line: 246, column: 34, scope: !40)
!102 = !DILocation(line: 246, column: 17, scope: !40)
!103 = !DILocation(line: 246, column: 4, scope: !40)
!104 = !DILocation(line: 246, column: 8, scope: !40)
!105 = !DILocation(line: 246, column: 15, scope: !40)
!106 = !DILocation(line: 247, column: 19, scope: !40)
!107 = !DILocation(line: 247, column: 27, scope: !40)
!108 = !DILocation(line: 247, column: 35, scope: !40)
!109 = !DILocation(line: 247, column: 18, scope: !40)
!110 = !DILocation(line: 247, column: 4, scope: !40)
!111 = !DILocation(line: 247, column: 8, scope: !40)
!112 = !DILocation(line: 247, column: 16, scope: !40)
!113 = !DILocation(line: 248, column: 22, scope: !40)
!114 = !DILocation(line: 248, column: 4, scope: !40)
!115 = !DILocation(line: 248, column: 8, scope: !40)
!116 = !DILocation(line: 248, column: 20, scope: !40)
!117 = !DILocation(line: 249, column: 35, scope: !40)
!118 = !DILocation(line: 249, column: 39, scope: !40)
!119 = !DILocation(line: 249, column: 34, scope: !40)
!120 = !DILocation(line: 249, column: 18, scope: !40)
!121 = !DILocation(line: 249, column: 4, scope: !40)
!122 = !DILocation(line: 249, column: 8, scope: !40)
!123 = !DILocation(line: 249, column: 16, scope: !40)
!124 = !DILocation(line: 250, column: 4, scope: !40)
!125 = !DILocation(line: 250, column: 8, scope: !40)
!126 = !DILocation(line: 250, column: 20, scope: !40)
!127 = !DILocation(line: 252, column: 11, scope: !40)
!128 = !DILocation(line: 252, column: 4, scope: !40)
