; ModuleID = '/home/lichi/Desktop/genwqe/[task]tools--genwqe_vpdupdate/[inter]tools--genwqe_vpdupdate.o.i'
source_filename = "/home/lichi/Desktop/genwqe/[task]tools--genwqe_vpdupdate/[inter]tools--genwqe_vpdupdate.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.card_dev_t = type opaque
%struct.genwqe_vpd = type { [512 x i8] }

@verbose_flag = global i32 0, align 4
@_dbg_flag = global i32 0, align 4
@.str = private unnamed_addr constant [11 x i8] c"vdusC:f:Vh\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !12)
!1 = !DIFile(filename: "/home/lichi/Desktop/genwqe/[task]tools--genwqe_vpdupdate/[inter]tools--genwqe_vpdupdate.o.i", directory: "/home/lichi/Desktop")
!2 = !{}
!3 = !{!4, !7, !8}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !10, line: 48, baseType: !11)
!10 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop")
!11 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!12 = !{!13, !16, !17, !31}
!13 = distinct !DIGlobalVariable(name: "verbose_flag", scope: !0, file: !14, line: 35, type: !15, isLocal: false, isDefinition: true, variable: i32* @verbose_flag)
!14 = !DIFile(filename: "genwqe_vpdupdate.c", directory: "/home/lichi/Desktop")
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = distinct !DIGlobalVariable(name: "_dbg_flag", scope: !0, file: !14, line: 36, type: !15, isLocal: false, isDefinition: true, variable: i32* @_dbg_flag)
!17 = distinct !DIGlobalVariable(name: "long_options", scope: !0, file: !14, line: 126, type: !18, isLocal: true, isDefinition: true, variable: [10 x %struct.option]* @long_options)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 2560, align: 64, elements: !29)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 104, size: 256, align: 64, elements: !21)
!20 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/lichi/Desktop")
!21 = !{!22, !25, !26, !28}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !19, file: !20, line: 106, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !19, file: !20, line: 109, baseType: !15, size: 32, align: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !19, file: !20, line: 110, baseType: !27, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !19, file: !20, line: 111, baseType: !15, size: 32, align: 32, offset: 192)
!29 = !{!30}
!30 = !DISubrange(count: 10)
!31 = distinct !DIGlobalVariable(name: "version", scope: !0, file: !14, line: 38, type: !23, isLocal: true, isDefinition: true, variable: i8** @version)
!32 = !{i32 2, !"Dwarf Version", i32 4}
!33 = !{i32 2, !"Debug Info Version", i32 3}
!34 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!35 = distinct !DISubprogram(name: "main", scope: !14, file: !14, line: 144, type: !36, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!36 = !DISubroutineType(types: !37)
!37 = !{!15, !15, !4}
!38 = !DILocalVariable(name: "argc", arg: 1, scope: !35, file: !14, line: 144, type: !15)
!39 = !DIExpression()
!40 = !DILocation(line: 144, column: 14, scope: !35)
!41 = !DILocalVariable(name: "argv", arg: 2, scope: !35, file: !14, line: 144, type: !4)
!42 = !DILocation(line: 144, column: 26, scope: !35)
!43 = !DILocalVariable(name: "ch", scope: !35, file: !14, line: 146, type: !15)
!44 = !DILocation(line: 146, column: 6, scope: !35)
!45 = !DILocalVariable(name: "rc", scope: !35, file: !14, line: 146, type: !15)
!46 = !DILocation(line: 146, column: 10, scope: !35)
!47 = !DILocalVariable(name: "err_code", scope: !35, file: !14, line: 146, type: !15)
!48 = !DILocation(line: 146, column: 16, scope: !35)
!49 = !DILocalVariable(name: "card_no", scope: !35, file: !14, line: 147, type: !15)
!50 = !DILocation(line: 147, column: 6, scope: !35)
!51 = !DILocalVariable(name: "update_vpd", scope: !35, file: !14, line: 148, type: !15)
!52 = !DILocation(line: 148, column: 6, scope: !35)
!53 = !DILocalVariable(name: "show_vpd", scope: !35, file: !14, line: 149, type: !15)
!54 = !DILocation(line: 149, column: 6, scope: !35)
!55 = !DILocalVariable(name: "card", scope: !35, file: !14, line: 150, type: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "card_handle_t", file: !57, line: 95, baseType: !58)
!57 = !DIFile(filename: "../include/libcard.h", directory: "/home/lichi/Desktop")
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "card_dev_t", file: !57, line: 95, flags: DIFlagFwdDecl)
!60 = !DILocation(line: 150, column: 16, scope: !35)
!61 = !DILocalVariable(name: "env", scope: !35, file: !14, line: 151, type: !5)
!62 = !DILocation(line: 151, column: 8, scope: !35)
!63 = !DILocalVariable(name: "fname", scope: !35, file: !14, line: 152, type: !5)
!64 = !DILocation(line: 152, column: 8, scope: !35)
!65 = !DILocalVariable(name: "fp_in", scope: !35, file: !14, line: 153, type: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !68, line: 48, baseType: !69)
!68 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop")
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !70, line: 241, size: 1728, align: 64, elements: !71)
!70 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop")
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !92, !93, !94, !95, !99, !101, !103, !107, !110, !112, !113, !114, !115, !116, !120, !121}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !69, file: !70, line: 242, baseType: !15, size: 32, align: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !69, file: !70, line: 247, baseType: !5, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !69, file: !70, line: 248, baseType: !5, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !69, file: !70, line: 249, baseType: !5, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !69, file: !70, line: 250, baseType: !5, size: 64, align: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !69, file: !70, line: 251, baseType: !5, size: 64, align: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !69, file: !70, line: 252, baseType: !5, size: 64, align: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !69, file: !70, line: 253, baseType: !5, size: 64, align: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !69, file: !70, line: 254, baseType: !5, size: 64, align: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !69, file: !70, line: 256, baseType: !5, size: 64, align: 64, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !69, file: !70, line: 257, baseType: !5, size: 64, align: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !69, file: !70, line: 258, baseType: !5, size: 64, align: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !69, file: !70, line: 260, baseType: !85, size: 64, align: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !70, line: 156, size: 192, align: 64, elements: !87)
!87 = !{!88, !89, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !86, file: !70, line: 157, baseType: !85, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !86, file: !70, line: 158, baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !86, file: !70, line: 162, baseType: !15, size: 32, align: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !69, file: !70, line: 262, baseType: !90, size: 64, align: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !69, file: !70, line: 264, baseType: !15, size: 32, align: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !69, file: !70, line: 268, baseType: !15, size: 32, align: 32, offset: 928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !69, file: !70, line: 270, baseType: !96, size: 64, align: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !97, line: 131, baseType: !98)
!97 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop")
!98 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !69, file: !70, line: 274, baseType: !100, size: 16, align: 16, offset: 1024)
!100 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !69, file: !70, line: 275, baseType: !102, size: 8, align: 8, offset: 1040)
!102 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !69, file: !70, line: 276, baseType: !104, size: 8, align: 8, offset: 1048)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 8, align: 8, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 1)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !69, file: !70, line: 280, baseType: !108, size: 64, align: 64, offset: 1088)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !70, line: 150, baseType: null)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !69, file: !70, line: 289, baseType: !111, size: 64, align: 64, offset: 1152)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !97, line: 132, baseType: !98)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !69, file: !70, line: 297, baseType: !7, size: 64, align: 64, offset: 1216)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !69, file: !70, line: 298, baseType: !7, size: 64, align: 64, offset: 1280)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !69, file: !70, line: 299, baseType: !7, size: 64, align: 64, offset: 1344)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !69, file: !70, line: 300, baseType: !7, size: 64, align: 64, offset: 1408)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !69, file: !70, line: 302, baseType: !117, size: 64, align: 64, offset: 1472)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !118, line: 216, baseType: !119)
!118 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop")
!119 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !69, file: !70, line: 303, baseType: !15, size: 32, align: 32, offset: 1536)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !69, file: !70, line: 305, baseType: !122, size: 160, align: 8, offset: 1568)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 160, align: 8, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 20)
!125 = !DILocation(line: 153, column: 8, scope: !35)
!126 = !DILocalVariable(name: "fp_out", scope: !35, file: !14, line: 154, type: !66)
!127 = !DILocation(line: 154, column: 8, scope: !35)
!128 = !DILocation(line: 156, column: 2, scope: !35)
!129 = !DILocalVariable(name: "option_index", scope: !130, file: !14, line: 157, type: !15)
!130 = distinct !DILexicalBlock(scope: !35, file: !14, line: 156, column: 12)
!131 = !DILocation(line: 157, column: 7, scope: !130)
!132 = !DILocation(line: 158, column: 20, scope: !130)
!133 = !DILocation(line: 158, column: 26, scope: !130)
!134 = !DILocation(line: 158, column: 8, scope: !130)
!135 = !DILocation(line: 158, column: 6, scope: !130)
!136 = !DILocation(line: 162, column: 7, scope: !137)
!137 = distinct !DILexicalBlock(scope: !130, file: !14, line: 162, column: 7)
!138 = !DILocation(line: 162, column: 10, scope: !137)
!139 = !DILocation(line: 162, column: 7, scope: !130)
!140 = !DILocation(line: 163, column: 4, scope: !137)
!141 = !DILocation(line: 165, column: 11, scope: !130)
!142 = !DILocation(line: 165, column: 3, scope: !130)
!143 = !DILocation(line: 168, column: 21, scope: !144)
!144 = distinct !DILexicalBlock(scope: !130, file: !14, line: 165, column: 15)
!145 = !DILocation(line: 168, column: 14, scope: !144)
!146 = !DILocation(line: 168, column: 12, scope: !144)
!147 = !DILocation(line: 169, column: 4, scope: !144)
!148 = !DILocation(line: 171, column: 12, scope: !144)
!149 = !DILocation(line: 171, column: 10, scope: !144)
!150 = !DILocation(line: 172, column: 4, scope: !144)
!151 = !DILocation(line: 174, column: 15, scope: !144)
!152 = !DILocation(line: 175, column: 4, scope: !144)
!153 = !DILocation(line: 177, column: 13, scope: !144)
!154 = !DILocation(line: 178, column: 4, scope: !144)
!155 = !DILocation(line: 180, column: 10, scope: !144)
!156 = !DILocation(line: 180, column: 4, scope: !144)
!157 = !DILocation(line: 181, column: 4, scope: !144)
!158 = !DILocation(line: 184, column: 11, scope: !144)
!159 = !DILocation(line: 184, column: 27, scope: !144)
!160 = !DILocation(line: 184, column: 4, scope: !144)
!161 = !DILocation(line: 185, column: 4, scope: !144)
!162 = !DILocation(line: 187, column: 16, scope: !144)
!163 = !DILocation(line: 188, column: 4, scope: !144)
!164 = !DILocation(line: 190, column: 13, scope: !144)
!165 = !DILocation(line: 191, column: 4, scope: !144)
!166 = !DILocation(line: 193, column: 10, scope: !144)
!167 = !DILocation(line: 193, column: 4, scope: !144)
!168 = !DILocation(line: 194, column: 4, scope: !144)
!169 = !DILocation(line: 156, column: 2, scope: !170)
!170 = !DILexicalBlockFile(scope: !35, file: !14, discriminator: 1)
!171 = distinct !{!171, !128}
!172 = !DILocation(line: 198, column: 6, scope: !173)
!173 = distinct !DILexicalBlock(scope: !35, file: !14, line: 198, column: 6)
!174 = !DILocation(line: 198, column: 17, scope: !173)
!175 = !DILocation(line: 198, column: 20, scope: !176)
!176 = !DILexicalBlockFile(scope: !173, file: !14, discriminator: 1)
!177 = !DILocation(line: 198, column: 6, scope: !176)
!178 = !DILocation(line: 199, column: 10, scope: !179)
!179 = distinct !DILexicalBlock(scope: !173, file: !14, line: 198, column: 30)
!180 = !DILocation(line: 199, column: 3, scope: !179)
!181 = !DILocation(line: 200, column: 3, scope: !179)
!182 = !DILocation(line: 203, column: 6, scope: !183)
!183 = distinct !DILexicalBlock(scope: !35, file: !14, line: 203, column: 6)
!184 = !DILocation(line: 203, column: 6, scope: !35)
!185 = !DILocation(line: 204, column: 14, scope: !186)
!186 = distinct !DILexicalBlock(scope: !187, file: !14, line: 204, column: 6)
!187 = distinct !DILexicalBlock(scope: !183, file: !14, line: 203, column: 18)
