; ModuleID = './ul.o.i'
source_filename = "./ul.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.MX_MutexRec = type opaque
%struct.Atomic_uint32 = type { i32 }
%struct.MXRecLock = type { %union.pthread_mutex_t, i32, i64 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.Atomic_uint64 = type { i64 }
%struct.MXUserHeader = type { i32, i8*, i32, %struct.anon, void (%struct.MXUserHeader*)*, void (%struct.MXUserHeader*)*, %struct.ListItem }
%struct.anon = type { i32 }
%struct.ListItem = type { %struct.ListItem*, %struct.ListItem* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%union.pthread_mutexattr_t = type { i32 }

@MXUserTryAcquireForceFail = global i8 (...)* null, align 8
@MXUserMX_LockRec = global void (%struct.MX_MutexRec*)* null, align 8
@MXUserMX_UnlockRec = global void (%struct.MX_MutexRec*)* null, align 8
@MXUserMX_TryLockRec = global i8 (%struct.MX_MutexRec*)* null, align 8
@MXUserMX_IsLockedByCurThreadRec = global i8 (%struct.MX_MutexRec*)* null, align 8
@MXUserMX_NameRec = global i8* (%struct.MX_MutexRec*)* null, align 8
@mxUserCollectLockingTree = internal global i8 0, align 1
@mxInPanic = internal global i8 0, align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15, globals: !23)
!1 = !DIFile(filename: "ul.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line477")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 440, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "ulInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line477")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "MXUSER_TYPE_NEVER_USE", value: 0)
!7 = !DIEnumerator(name: "MXUSER_TYPE_RW", value: 1)
!8 = !DIEnumerator(name: "MXUSER_TYPE_REC", value: 2)
!9 = !DIEnumerator(name: "MXUSER_TYPE_RANK", value: 3)
!10 = !DIEnumerator(name: "MXUSER_TYPE_EXCL", value: 4)
!11 = !DIEnumerator(name: "MXUSER_TYPE_SEMA", value: 5)
!12 = !DIEnumerator(name: "MXUSER_TYPE_CONDVAR", value: 6)
!13 = !DIEnumerator(name: "MXUSER_TYPE_BARRIER", value: 7)
!14 = !DIEnumerator(name: "MXUSER_TYPE_EVENT", value: 8)
!15 = !{!16, !17, !20}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !18, line: 122, baseType: !19)
!18 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line477")
!19 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !21, line: 171, baseType: !22)
!21 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line477")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 55, baseType: !19)
!23 = !{!24, !31, !38, !39, !43, !49, !54, !91, !92, !102, !103, !107, !111, !112}
!24 = distinct !DIGlobalVariable(name: "MXUserTryAcquireForceFail", scope: !0, file: !25, line: 31, type: !26, isLocal: false, isDefinition: true, variable: i8 (...)** @MXUserTryAcquireForceFail)
!25 = !DIFile(filename: "ul.c", directory: "/home/lichi/Desktop/open-vm-tools/line477")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DISubroutineType(types: !28)
!28 = !{!29, null}
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !21, line: 230, baseType: !30)
!30 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!31 = distinct !DIGlobalVariable(name: "MXUserMX_LockRec", scope: !0, file: !25, line: 35, type: !32, isLocal: false, isDefinition: true, variable: void (%struct.MX_MutexRec*)** @MXUserMX_LockRec)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "MX_MutexRec", file: !37, line: 327, flags: DIFlagFwdDecl)
!37 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/userlock.h", directory: "/home/lichi/Desktop/open-vm-tools/line477")
!38 = distinct !DIGlobalVariable(name: "MXUserMX_UnlockRec", scope: !0, file: !25, line: 36, type: !32, isLocal: false, isDefinition: true, variable: void (%struct.MX_MutexRec*)** @MXUserMX_UnlockRec)
!39 = distinct !DIGlobalVariable(name: "MXUserMX_TryLockRec", scope: !0, file: !25, line: 37, type: !40, isLocal: false, isDefinition: true, variable: i8 (%struct.MX_MutexRec*)** @MXUserMX_TryLockRec)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!29, !35}
!43 = distinct !DIGlobalVariable(name: "MXUserMX_IsLockedByCurThreadRec", scope: !0, file: !25, line: 38, type: !44, isLocal: false, isDefinition: true, variable: i8 (%struct.MX_MutexRec*)** @MXUserMX_IsLockedByCurThreadRec)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!29, !47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!49 = distinct !DIGlobalVariable(name: "MXUserMX_NameRec", scope: !0, file: !25, line: 39, type: !50, isLocal: false, isDefinition: true, variable: i8* (%struct.MX_MutexRec*)** @MXUserMX_NameRec)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !47}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!54 = distinct !DIGlobalVariable(name: "loopCounter", scope: !55, file: !25, line: 300, type: !63, isLocal: true, isDefinition: true, variable: i32* @MXUserDumpAndPanic.loopCounter)
!55 = distinct !DISubprogram(name: "MXUserDumpAndPanic", scope: !25, file: !25, line: 294, type: !56, isLocal: false, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !58, !88, null}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserHeader", file: !4, line: 469, baseType: !60)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserHeader", file: !4, line: 456, size: 448, align: 64, elements: !61)
!61 = !{!62, !66, !67, !69, !74, !79, !80}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !60, file: !4, line: 457, baseType: !63, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !21, line: 173, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 51, baseType: !65)
!65 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !60, file: !4, line: 458, baseType: !53, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !60, file: !4, line: 459, baseType: !68, size: 32, align: 32, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "MX_Rank", file: !21, line: 1167, baseType: !63)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !60, file: !4, line: 464, baseType: !70, size: 32, align: 32, offset: 160)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !60, file: !4, line: 461, size: 32, align: 32, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !70, file: !4, line: 462, baseType: !65, size: 24, align: 32, flags: DIFlagBitField, extraData: i64 0)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "badHeader", scope: !70, file: !4, line: 463, baseType: !65, size: 1, align: 32, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "dumpFunc", scope: !60, file: !4, line: 466, baseType: !75, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !78}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "statsFunc", scope: !60, file: !4, line: 467, baseType: !75, size: 64, align: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !60, file: !4, line: 468, baseType: !81, size: 128, align: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem", file: !82, line: 45, baseType: !83)
!82 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/circList.h", directory: "/home/lichi/Desktop/open-vm-tools/line477")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListItem", file: !82, line: 42, size: 128, align: 64, elements: !84)
!84 = !{!85, !87}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !83, file: !82, line: 43, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !83, file: !82, line: 44, baseType: !86, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!90 = !{}
!91 = distinct !DIGlobalVariable(name: "mxUserCollectLockingTree", scope: !0, file: !25, line: 29, type: !29, isLocal: true, isDefinition: true, variable: i8* @mxUserCollectLockingTree)
!92 = distinct !DIGlobalVariable(name: "syndromeMem", scope: !93, file: !25, line: 174, type: !96, isLocal: true, isDefinition: true, variable: %struct.Atomic_uint32* @MXUserSyndrome.syndromeMem)
!93 = distinct !DISubprogram(name: "MXUserSyndrome", scope: !25, file: !25, line: 171, type: !94, isLocal: true, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!94 = !DISubroutineType(types: !95)
!95 = !{!63}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint32", file: !97, line: 135, baseType: !98)
!97 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_atomic.h", directory: "/home/lichi/Desktop/open-vm-tools/line477")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint32", file: !97, line: 133, size: 32, align: 32, elements: !99)
!99 = !{!100}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !98, file: !97, line: 134, baseType: !101, size: 32, align: 32)
!101 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !63)
!102 = distinct !DIGlobalVariable(name: "mxInPanic", scope: !0, file: !25, line: 28, type: !29, isLocal: true, isDefinition: true, variable: i8* @mxInPanic)
!103 = distinct !DIGlobalVariable(name: "MXUserMX_SetInPanic", scope: !0, file: !25, line: 40, type: !104, isLocal: true, isDefinition: true, variable: void ()** @MXUserMX_SetInPanic)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{null}
!107 = distinct !DIGlobalVariable(name: "MXUserMX_InPanic", scope: !0, file: !25, line: 41, type: !108, isLocal: true, isDefinition: true, variable: i8 ()** @MXUserMX_InPanic)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!29}
!111 = distinct !DIGlobalVariable(name: "MXUserMxLockLister", scope: !0, file: !25, line: 34, type: !104, isLocal: true, isDefinition: true, variable: void ()** @MXUserMxLockLister)
!112 = distinct !DIGlobalVariable(name: "MXUserMxCheckRank", scope: !0, file: !25, line: 33, type: !113, isLocal: true, isDefinition: true, variable: i32 ()** @MXUserMxCheckRank)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!68}
!116 = !{i32 2, !"Dwarf Version", i32 4}
!117 = !{i32 2, !"Debug Info Version", i32 3}
!118 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!119 = distinct !DISubprogram(name: "MXUser_IsLockingTreeAvailable", scope: !25, file: !25, line: 64, type: !109, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!120 = !DILocation(line: 66, column: 11, scope: !119)
!121 = !DILocation(line: 66, column: 4, scope: !119)
!122 = distinct !DISubprogram(name: "MXUser_LockingTreeCollection", scope: !25, file: !25, line: 87, type: !123, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !29}
!125 = !DILocalVariable(name: "enabled", arg: 1, scope: !122, file: !25, line: 87, type: !29)
!126 = !DIExpression()
!127 = !DILocation(line: 87, column: 35, scope: !122)
!128 = !DILocation(line: 89, column: 29, scope: !122)
!129 = !DILocation(line: 90, column: 1, scope: !122)
!130 = distinct !DISubprogram(name: "MXUserInternalSingleton", scope: !25, file: !25, line: 114, type: !131, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!131 = !DISubroutineType(types: !132)
!132 = !{!133, !171}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXRecLock", file: !4, line: 67, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 58, size: 448, align: 64, elements: !136)
!136 = !{!137, !167, !168}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nativeLock", scope: !135, file: !4, line: 62, baseType: !138, size: 320, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !139, line: 128, baseType: !140)
!139 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line477")
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !139, line: 90, size: 320, align: 64, elements: !141)
!141 = !{!142, !161, !165}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !140, file: !139, line: 125, baseType: !143, size: 320, align: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !139, line: 92, size: 320, align: 64, elements: !144)
!144 = !{!145, !147, !148, !149, !150, !151, !153, !154}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !143, file: !139, line: 94, baseType: !146, size: 32, align: 32)
!146 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !143, file: !139, line: 95, baseType: !65, size: 32, align: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !143, file: !139, line: 96, baseType: !146, size: 32, align: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !143, file: !139, line: 98, baseType: !65, size: 32, align: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !143, file: !139, line: 102, baseType: !146, size: 32, align: 32, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !143, file: !139, line: 104, baseType: !152, size: 16, align: 16, offset: 160)
!152 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !143, file: !139, line: 105, baseType: !152, size: 16, align: 16, offset: 176)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !143, file: !139, line: 106, baseType: !155, size: 128, align: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !139, line: 79, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !139, line: 75, size: 128, align: 64, elements: !157)
!157 = !{!158, !160}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !156, file: !139, line: 77, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !156, file: !139, line: 78, baseType: !159, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !140, file: !139, line: 126, baseType: !162, size: 320, align: 8)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 320, align: 8, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 40)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !140, file: !139, line: 127, baseType: !166, size: 64, align: 64)
!166 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "referenceCount", scope: !135, file: !4, line: 65, baseType: !146, size: 32, align: 32, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nativeThreadID", scope: !135, file: !4, line: 66, baseType: !169, size: 64, align: 64, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserThreadID", file: !4, line: 39, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !139, line: 60, baseType: !19)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_Ptr", file: !97, line: 3829, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint64", file: !97, line: 139, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint64", file: !97, line: 137, size: 64, align: 64, elements: !175)
!175 = !{!176}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !174, file: !97, line: 138, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !20)
!178 = !DILocalVariable(name: "storage", arg: 1, scope: !130, file: !25, line: 114, type: !171)
!179 = !DILocation(line: 114, column: 37, scope: !130)
!180 = !DILocalVariable(name: "lock", scope: !130, file: !25, line: 116, type: !133)
!181 = !DILocation(line: 116, column: 15, scope: !130)
!182 = !DILocation(line: 116, column: 37, scope: !130)
!183 = !DILocation(line: 116, column: 22, scope: !130)
!184 = !DILocation(line: 118, column: 26, scope: !185)
!185 = distinct !DILexicalBlock(scope: !130, file: !25, line: 118, column: 8)
!186 = !DILocation(line: 118, column: 31, scope: !185)
!187 = !DILocation(line: 118, column: 25, scope: !185)
!188 = !DILocation(line: 118, column: 8, scope: !185)
!189 = !DILocation(line: 118, column: 8, scope: !130)
!190 = !DILocalVariable(name: "newLock", scope: !191, file: !25, line: 119, type: !133)
!191 = distinct !DILexicalBlock(scope: !185, file: !25, line: 118, column: 14)
!192 = !DILocation(line: 119, column: 18, scope: !191)
!193 = !DILocation(line: 119, column: 28, scope: !191)
!194 = !DILocation(line: 121, column: 25, scope: !195)
!195 = distinct !DILexicalBlock(scope: !191, file: !25, line: 121, column: 11)
!196 = !DILocation(line: 121, column: 11, scope: !195)
!197 = !DILocation(line: 121, column: 11, scope: !191)
!198 = !DILocation(line: 122, column: 44, scope: !199)
!199 = distinct !DILexicalBlock(scope: !195, file: !25, line: 121, column: 35)
!200 = !DILocation(line: 122, column: 67, scope: !199)
!201 = !DILocation(line: 122, column: 58, scope: !199)
!202 = !DILocation(line: 122, column: 17, scope: !199)
!203 = !DILocation(line: 122, column: 15, scope: !199)
!204 = !DILocation(line: 124, column: 14, scope: !205)
!205 = distinct !DILexicalBlock(scope: !199, file: !25, line: 124, column: 14)
!206 = !DILocation(line: 124, column: 14, scope: !199)
!207 = !DILocation(line: 125, column: 30, scope: !208)
!208 = distinct !DILexicalBlock(scope: !205, file: !25, line: 124, column: 20)
!209 = !DILocation(line: 125, column: 13, scope: !208)
!210 = !DILocation(line: 126, column: 18, scope: !208)
!211 = !DILocation(line: 126, column: 13, scope: !208)
!212 = !DILocation(line: 127, column: 10, scope: !208)
!213 = !DILocation(line: 128, column: 35, scope: !214)
!214 = distinct !DILexicalBlock(scope: !205, file: !25, line: 127, column: 17)
!215 = !DILocation(line: 128, column: 20, scope: !214)
!216 = !DILocation(line: 128, column: 18, scope: !214)
!217 = !DILocation(line: 130, column: 7, scope: !199)
!218 = !DILocation(line: 131, column: 15, scope: !219)
!219 = distinct !DILexicalBlock(scope: !195, file: !25, line: 130, column: 14)
!220 = !DILocation(line: 131, column: 10, scope: !219)
!221 = !DILocation(line: 132, column: 32, scope: !219)
!222 = !DILocation(line: 132, column: 17, scope: !219)
!223 = !DILocation(line: 132, column: 15, scope: !219)
!224 = !DILocation(line: 134, column: 4, scope: !191)
!225 = !DILocation(line: 136, column: 11, scope: !130)
!226 = !DILocation(line: 136, column: 4, scope: !130)
!227 = distinct !DISubprogram(name: "Atomic_ReadPtr", scope: !97, file: !97, line: 3829, type: !228, isLocal: true, isDefinition: true, scopeLine: 3829, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!228 = !DISubroutineType(types: !229)
!229 = !{!16, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!232 = !DILocalVariable(name: "var", arg: 1, scope: !227, file: !97, line: 3829, type: !230)
!233 = !DILocation(line: 3829, column: 368, scope: !227)
!234 = !DILocation(line: 3829, column: 415, scope: !227)
!235 = !DILocation(line: 3829, column: 401, scope: !227)
!236 = !DILocation(line: 3829, column: 382, scope: !227)
!237 = !DILocation(line: 3829, column: 375, scope: !227)
!238 = distinct !DISubprogram(name: "MXRecLockInit", scope: !4, file: !4, line: 264, type: !239, isLocal: true, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!239 = !DISubroutineType(types: !240)
!240 = !{!29, !133}
!241 = !DILocalVariable(name: "lock", arg: 1, scope: !238, file: !4, line: 264, type: !133)
!242 = !DILocation(line: 264, column: 26, scope: !238)
!243 = !DILocalVariable(name: "success", scope: !238, file: !4, line: 266, type: !29)
!244 = !DILocation(line: 266, column: 9, scope: !238)
!245 = !DILocation(line: 266, column: 44, scope: !238)
!246 = !DILocation(line: 266, column: 20, scope: !238)
!247 = !DILocation(line: 266, column: 50, scope: !238)
!248 = !DILocation(line: 266, column: 19, scope: !238)
!249 = !DILocation(line: 268, column: 8, scope: !250)
!250 = distinct !DILexicalBlock(scope: !238, file: !4, line: 268, column: 8)
!251 = !DILocation(line: 268, column: 8, scope: !238)
!252 = !DILocation(line: 269, column: 27, scope: !253)
!253 = distinct !DILexicalBlock(scope: !250, file: !4, line: 268, column: 17)
!254 = !DILocation(line: 269, column: 7, scope: !253)
!255 = !DILocation(line: 271, column: 7, scope: !253)
!256 = !DILocation(line: 271, column: 13, scope: !253)
!257 = !DILocation(line: 271, column: 28, scope: !253)
!258 = !DILocation(line: 272, column: 4, scope: !253)
!259 = !DILocation(line: 274, column: 11, scope: !238)
!260 = !DILocation(line: 274, column: 4, scope: !238)
!261 = distinct !DISubprogram(name: "Atomic_ReadIfEqualWritePtr", scope: !97, file: !97, line: 3829, type: !262, isLocal: true, isDefinition: true, scopeLine: 3829, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!262 = !DISubroutineType(types: !263)
!263 = !{!16, !171, !264, !264}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!266 = !DILocalVariable(name: "var", arg: 1, scope: !261, file: !97, line: 3829, type: !171)
!267 = !DILocation(line: 3829, column: 757, scope: !261)
!268 = !DILocalVariable(name: "oldVal", arg: 2, scope: !261, file: !97, line: 3829, type: !264)
!269 = !DILocation(line: 3829, column: 775, scope: !261)
!270 = !DILocalVariable(name: "newVal", arg: 3, scope: !261, file: !97, line: 3829, type: !264)
!271 = !DILocation(line: 3829, column: 796, scope: !261)
!272 = !DILocation(line: 3829, column: 858, scope: !261)
!273 = !DILocation(line: 3829, column: 882, scope: !261)
!274 = !DILocation(line: 3829, column: 871, scope: !261)
!275 = !DILocation(line: 3829, column: 909, scope: !261)
!276 = !DILocation(line: 3829, column: 898, scope: !261)
!277 = !DILocation(line: 3829, column: 832, scope: !261)
!278 = !DILocation(line: 3829, column: 813, scope: !261)
!279 = !DILocation(line: 3829, column: 806, scope: !261)
!280 = distinct !DISubprogram(name: "MXRecLockDestroy", scope: !4, file: !4, line: 279, type: !281, isLocal: true, isDefinition: true, scopeLine: 280, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !133}
!283 = !DILocalVariable(name: "lock", arg: 1, scope: !280, file: !4, line: 279, type: !133)
!284 = !DILocation(line: 279, column: 29, scope: !280)
!285 = !DILocalVariable(name: "err", scope: !280, file: !4, line: 281, type: !146)
!286 = !DILocation(line: 281, column: 8, scope: !280)
!287 = !DILocation(line: 281, column: 39, scope: !280)
!288 = !DILocation(line: 281, column: 14, scope: !280)
!289 = !DILocation(line: 286, column: 1, scope: !280)
!290 = distinct !DISubprogram(name: "MXUserGetSignature", scope: !25, file: !25, line: 226, type: !291, isLocal: false, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!291 = !DISubroutineType(types: !292)
!292 = !{!63, !293}
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserObjectType", file: !4, line: 450, baseType: !3)
!294 = !DILocalVariable(name: "objectType", arg: 1, scope: !290, file: !25, line: 226, type: !293)
!295 = !DILocation(line: 226, column: 37, scope: !290)
!296 = !DILocalVariable(name: "signature", scope: !290, file: !25, line: 228, type: !63)
!297 = !DILocation(line: 228, column: 11, scope: !290)
!298 = !DILocation(line: 241, column: 17, scope: !290)
!299 = !DILocation(line: 241, column: 34, scope: !290)
!300 = !DILocation(line: 241, column: 51, scope: !290)
!301 = !DILocation(line: 241, column: 62, scope: !290)
!302 = !DILocation(line: 241, column: 48, scope: !290)
!303 = !DILocation(line: 241, column: 14, scope: !290)
!304 = !DILocation(line: 245, column: 11, scope: !290)
!305 = !DILocation(line: 245, column: 4, scope: !290)
!306 = !DILocalVariable(name: "syndrome", scope: !93, file: !25, line: 173, type: !63)
!307 = !DILocation(line: 173, column: 11, scope: !93)
!308 = !DILocation(line: 176, column: 15, scope: !93)
!309 = !DILocation(line: 176, column: 13, scope: !93)
!310 = !DILocation(line: 178, column: 8, scope: !311)
!311 = distinct !DILexicalBlock(scope: !93, file: !25, line: 178, column: 8)
!312 = !DILocation(line: 178, column: 17, scope: !311)
!313 = !DILocation(line: 178, column: 8, scope: !93)
!314 = !DILocation(line: 186, column: 18, scope: !315)
!315 = distinct !DILexicalBlock(scope: !311, file: !25, line: 178, column: 23)
!316 = !DILocation(line: 186, column: 28, scope: !315)
!317 = !DILocation(line: 186, column: 16, scope: !315)
!318 = !DILocation(line: 193, column: 11, scope: !319)
!319 = distinct !DILexicalBlock(scope: !315, file: !25, line: 193, column: 11)
!320 = !DILocation(line: 193, column: 20, scope: !319)
!321 = !DILocation(line: 193, column: 11, scope: !315)
!322 = !DILocation(line: 194, column: 18, scope: !323)
!323 = distinct !DILexicalBlock(scope: !319, file: !25, line: 193, column: 26)
!324 = !DILocation(line: 195, column: 7, scope: !323)
!325 = !DILocation(line: 198, column: 50, scope: !315)
!326 = !DILocation(line: 198, column: 7, scope: !315)
!327 = !DILocation(line: 200, column: 18, scope: !315)
!328 = !DILocation(line: 200, column: 16, scope: !315)
!329 = !DILocation(line: 201, column: 4, scope: !315)
!330 = !DILocation(line: 205, column: 11, scope: !93)
!331 = !DILocation(line: 205, column: 4, scope: !93)
!332 = distinct !DISubprogram(name: "MXUser_SetInPanic", scope: !25, file: !25, line: 267, type: !105, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!333 = !DILocation(line: 269, column: 14, scope: !332)
!334 = !DILocation(line: 271, column: 8, scope: !335)
!335 = distinct !DILexicalBlock(scope: !332, file: !25, line: 271, column: 8)
!336 = !DILocation(line: 271, column: 28, scope: !335)
!337 = !DILocation(line: 271, column: 8, scope: !332)
!338 = !DILocation(line: 272, column: 7, scope: !339)
!339 = distinct !DILexicalBlock(scope: !335, file: !25, line: 271, column: 36)
!340 = !DILocation(line: 273, column: 4, scope: !339)
!341 = !DILocation(line: 274, column: 1, scope: !332)
!342 = !DILocalVariable(name: "header", arg: 1, scope: !55, file: !25, line: 294, type: !58)
!343 = !DILocation(line: 294, column: 34, scope: !55)
!344 = !DILocalVariable(name: "fmt", arg: 2, scope: !55, file: !25, line: 295, type: !88)
!345 = !DILocation(line: 295, column: 32, scope: !55)
!346 = !DILocalVariable(name: "msg", scope: !55, file: !25, line: 298, type: !53)
!347 = !DILocation(line: 298, column: 10, scope: !55)
!348 = !DILocalVariable(name: "ap", scope: !55, file: !25, line: 299, type: !349)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !350, line: 98, baseType: !351)
!350 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/open-vm-tools/line477")
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !350, line: 40, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 299, baseType: !353)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 192, align: 64, elements: !360)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 299, size: 192, align: 64, elements: !355)
!355 = !{!356, !357, !358, !359}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !354, file: !1, line: 299, baseType: !65, size: 32, align: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !354, file: !1, line: 299, baseType: !65, size: 32, align: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !354, file: !1, line: 299, baseType: !16, size: 64, align: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !354, file: !1, line: 299, baseType: !16, size: 64, align: 64, offset: 128)
!360 = !{!361}
!361 = !DISubrange(count: 1)
!362 = !DILocation(line: 299, column: 12, scope: !55)
!363 = !DILocation(line: 304, column: 8, scope: !364)
!364 = distinct !DILexicalBlock(scope: !55, file: !25, line: 304, column: 8)
!365 = !DILocation(line: 304, column: 22, scope: !364)
!366 = !DILocation(line: 304, column: 8, scope: !55)
!367 = !DILocation(line: 310, column: 7, scope: !368)
!368 = distinct !DILexicalBlock(scope: !364, file: !25, line: 304, column: 27)
!369 = !DILocation(line: 311, column: 4, scope: !368)
!370 = !DILocation(line: 313, column: 6, scope: !55)
!371 = !DILocation(line: 313, column: 14, scope: !55)
!372 = !DILocation(line: 313, column: 24, scope: !55)
!373 = !DILocation(line: 313, column: 4, scope: !55)
!374 = !DILocation(line: 315, column: 3, scope: !55)
!375 = !DILocation(line: 316, column: 33, scope: !55)
!376 = !DILocation(line: 316, column: 38, scope: !55)
!377 = !DILocation(line: 316, column: 10, scope: !55)
!378 = !DILocation(line: 316, column: 8, scope: !55)
!379 = !DILocation(line: 317, column: 3, scope: !55)
!380 = !DILocation(line: 319, column: 16, scope: !55)
!381 = !DILocation(line: 319, column: 4, scope: !55)
!382 = !DILocation(line: 320, column: 1, scope: !55)
!383 = distinct !DISubprogram(name: "MXUser_InPanic", scope: !25, file: !25, line: 341, type: !109, isLocal: false, isDefinition: true, scopeLine: 342, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!384 = !DILocation(line: 343, column: 11, scope: !383)
!385 = !DILocation(line: 343, column: 21, scope: !383)
!386 = !DILocation(line: 343, column: 25, scope: !387)
!387 = !DILexicalBlockFile(scope: !383, file: !25, discriminator: 1)
!388 = !DILocation(line: 343, column: 42, scope: !387)
!389 = !DILocation(line: 343, column: 49, scope: !387)
!390 = !DILocation(line: 343, column: 52, scope: !391)
!391 = !DILexicalBlockFile(scope: !383, file: !25, discriminator: 2)
!392 = !DILocation(line: 343, column: 49, scope: !391)
!393 = !DILocation(line: 343, column: 21, scope: !394)
!394 = !DILexicalBlockFile(scope: !383, file: !25, discriminator: 3)
!395 = !DILocation(line: 343, column: 21, scope: !396)
!396 = !DILexicalBlockFile(scope: !383, file: !25, discriminator: 4)
!397 = !DILocation(line: 343, column: 11, scope: !396)
!398 = !DILocation(line: 343, column: 4, scope: !396)
!399 = distinct !DISubprogram(name: "MXUserInstallMxHooks", scope: !25, file: !25, line: 366, type: !400, isLocal: false, isDefinition: true, scopeLine: 375, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !104, !113, !32, !32, !40, !44, !50, !104, !108}
!402 = !DILocalVariable(name: "theLockListFunc", arg: 1, scope: !399, file: !25, line: 366, type: !104)
!403 = !DILocation(line: 366, column: 29, scope: !399)
!404 = !DILocalVariable(name: "theRankFunc", arg: 2, scope: !399, file: !25, line: 367, type: !113)
!405 = !DILocation(line: 367, column: 32, scope: !399)
!406 = !DILocalVariable(name: "theLockFunc", arg: 3, scope: !399, file: !25, line: 368, type: !32)
!407 = !DILocation(line: 368, column: 29, scope: !399)
!408 = !DILocalVariable(name: "theUnlockFunc", arg: 4, scope: !399, file: !25, line: 369, type: !32)
!409 = !DILocation(line: 369, column: 29, scope: !399)
!410 = !DILocalVariable(name: "theTryLockFunc", arg: 5, scope: !399, file: !25, line: 370, type: !40)
!411 = !DILocation(line: 370, column: 29, scope: !399)
!412 = !DILocalVariable(name: "theIsLockedFunc", arg: 6, scope: !399, file: !25, line: 371, type: !44)
!413 = !DILocation(line: 371, column: 29, scope: !399)
!414 = !DILocalVariable(name: "theNameFunc", arg: 7, scope: !399, file: !25, line: 372, type: !50)
!415 = !DILocation(line: 372, column: 30, scope: !399)
!416 = !DILocalVariable(name: "theSetInPanicFunc", arg: 8, scope: !399, file: !25, line: 373, type: !104)
