; ModuleID = './asyncSocketInterface.o.i'
source_filename = "./asyncSocketInterface.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.AsyncSocket = type { i32, i32, %struct.AsyncSocketPollParams, i32, i8, i8, void (i32, %struct.AsyncSocket*, i8*)*, i8*, i8*, i32, i32, void (i8*, i32, %struct.AsyncSocket*, i8*)*, i8*, i8, %struct.AsyncSocketVTable* }
%struct.AsyncSocketPollParams = type { i32, %struct.MXUserRecLock*, %struct.PollClassSet, %struct.IVmdbPoll* }
%struct.MXUserRecLock = type opaque
%struct.PollClassSet = type { i64 }
%struct.IVmdbPoll = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !47)
!1 = !DIFile(filename: "asyncSocketInterface.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line64")
!2 = !{!3, !11, !15, !44}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AsyncSocketState", file: !4, line: 184, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/asyncsocket.h", directory: "/home/lichi/Desktop/open-vm-tools/line64")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "AsyncSocketListening", value: 0)
!7 = !DIEnumerator(name: "AsyncSocketConnecting", value: 1)
!8 = !DIEnumerator(name: "AsyncSocketConnected", value: 2)
!9 = !DIEnumerator(name: "AsyncSocketCBCancelled", value: 3)
!10 = !DIEnumerator(name: "AsyncSocketClosed", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 303, size: 32, align: 32, elements: !12)
!12 = !{!13, !14}
!13 = !DIEnumerator(name: "ASYNC_SOCKET_OPTS_LAYER_BASE", value: 1001)
!14 = !DIEnumerator(name: "ASYNC_SOCKET_OPTS_LAYER_BLAST_PROXY", value: 1002)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 40, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/open-vm-tools/line64")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!18 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!19 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!20 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!21 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!22 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!23 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!24 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!25 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!26 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!27 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!28 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!29 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!30 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!31 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!32 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!33 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!34 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!35 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!36 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!37 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!38 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!39 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!40 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!41 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!42 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!43 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 326, size: 32, align: 32, elements: !45)
!45 = !{!46}
!46 = !DIEnumerator(name: "ASYNC_SOCKET_OPT_SEND_LOW_LATENCY_MODE", value: 0)
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !49, line: 173, baseType: !50)
!49 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line64")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !51, line: 51, baseType: !52)
!51 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line64")
!52 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!53 = !{i32 2, !"Dwarf Version", i32 4}
!54 = !{i32 2, !"Debug Info Version", i32 3}
!55 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!56 = distinct !DISubprogram(name: "AsyncSocket_SetCloseOptions", scope: !57, file: !57, line: 95, type: !58, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !280)
!57 = !DIFile(filename: "asyncSocketInterface.c", directory: "/home/lichi/Desktop/open-vm-tools/line64")
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !61, !60, !276}
!60 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocket", file: !4, line: 155, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AsyncSocket", file: !64, line: 47, size: 896, align: 64, elements: !65)
!64 = !DIFile(filename: "asyncSocketBase.h", directory: "/home/lichi/Desktop/open-vm-tools/line64")
!65 = !{!66, !67, !68, !89, !91, !94, !95, !101, !102, !103, !104, !105, !110, !111, !112}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !63, file: !64, line: 48, baseType: !48, size: 32, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", scope: !63, file: !64, line: 49, baseType: !48, size: 32, align: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "pollParams", scope: !63, file: !64, line: 50, baseType: !69, size: 256, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketPollParams", file: !4, line: 174, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AsyncSocketPollParams", file: !4, line: 169, size: 256, align: 64, elements: !71)
!71 = !{!72, !73, !78, !86}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !70, file: !4, line: 170, baseType: !60, size: 32, align: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !70, file: !4, line: 171, baseType: !74, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserRecLock", file: !76, line: 39, baseType: !77)
!76 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/userlock.h", directory: "/home/lichi/Desktop/open-vm-tools/line64")
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserRecLock", file: !76, line: 39, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pollClass", scope: !70, file: !4, line: 172, baseType: !79, size: 64, align: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "PollClassSet", file: !80, line: 128, baseType: !81)
!80 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/poll.h", directory: "/home/lichi/Desktop/open-vm-tools/line64")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PollClassSet", file: !80, line: 126, size: 64, align: 64, elements: !82)
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !81, file: !80, line: 127, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !51, line: 122, baseType: !85)
!85 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "iPoll", scope: !70, file: !4, line: 173, baseType: !87, size: 64, align: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "IVmdbPoll", file: !4, line: 168, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !63, file: !64, line: 51, baseType: !90, size: 32, align: 32, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketState", file: !4, line: 190, baseType: !3)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "inited", scope: !63, file: !64, line: 53, baseType: !92, size: 8, align: 8, offset: 352)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !49, line: 230, baseType: !93)
!93 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "errorSeen", scope: !63, file: !64, line: 54, baseType: !92, size: 8, align: 8, offset: 360)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "errorFn", scope: !63, file: !64, line: 55, baseType: !96, size: 64, align: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketErrorFn", file: !4, line: 401, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !60, !61, !100}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "errorClientData", scope: !63, file: !64, line: 56, baseType: !100, size: 64, align: 64, offset: 448)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "recvBuf", scope: !63, file: !64, line: 58, baseType: !100, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "recvPos", scope: !63, file: !64, line: 59, baseType: !60, size: 32, align: 32, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "recvLen", scope: !63, file: !64, line: 60, baseType: !60, size: 32, align: 32, offset: 608)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "recvFn", scope: !63, file: !64, line: 61, baseType: !106, size: 64, align: 64, offset: 640)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketRecvFn", file: !4, line: 389, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !100, !60, !61, !100}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "recvClientData", scope: !63, file: !64, line: 62, baseType: !100, size: 64, align: 64, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "recvFireOnPartial", scope: !63, file: !64, line: 63, baseType: !92, size: 8, align: 8, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "vt", scope: !63, file: !64, line: 65, baseType: !113, size: 64, align: 64, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketVTable", file: !116, line: 138, baseType: !117)
!116 = !DIFile(filename: "asyncSocketVTable.h", directory: "/home/lichi/Desktop/open-vm-tools/line64")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AsyncSocketVTable", file: !116, line: 52, size: 2432, align: 64, elements: !118)
!118 = !{!119, !123, !135, !140, !144, !145, !152, !158, !162, !164, !170, !178, !182, !187, !191, !195, !199, !200, !205, !206, !221, !222, !228, !229, !234, !235, !236, !240, !241, !248, !252, !256, !260, !261, !262, !266, !267, !272}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "getState", scope: !117, file: !116, line: 53, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!90, !61}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "setOption", scope: !117, file: !116, line: 63, baseType: !124, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!60, !61, !127, !128, !129, !131}
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketOpts_Layer", file: !4, line: 319, baseType: !11)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketOpts_ID", file: !4, line: 284, baseType: !60)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !132, line: 33, baseType: !133)
!132 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/open-vm-tools/line64")
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !134, line: 189, baseType: !52)
!134 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line64")
!135 = !DIDerivedType(tag: DW_TAG_member, name: "getOption", scope: !117, file: !116, line: 75, baseType: !136, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!60, !61, !127, !128, !100, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "getGenericErrno", scope: !117, file: !116, line: 81, baseType: !141, size: 64, align: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!60, !61}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "getFd", scope: !117, file: !116, line: 82, baseType: !141, size: 64, align: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "getRemoteIPStr", scope: !117, file: !116, line: 83, baseType: !146, size: 64, align: 64, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!60, !61, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "getINETIPStr", scope: !117, file: !116, line: 84, baseType: !153, size: 64, align: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!60, !61, !60, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "getPort", scope: !117, file: !116, line: 85, baseType: !159, size: 64, align: 64, offset: 448)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!52, !61}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "setCloseOptions", scope: !117, file: !116, line: 86, baseType: !163, size: 64, align: 64, offset: 512)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "connectSSL", scope: !117, file: !116, line: 88, baseType: !165, size: 64, align: 64, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!92, !61, !168, !100}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SSLVerifyParam", file: !4, line: 150, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "startSslConnect", scope: !117, file: !116, line: 90, baseType: !171, size: 64, align: 64, offset: 640)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!60, !61, !168, !100, !174, !100}
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketSslConnectFn", file: !4, line: 408, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !92, !61, !100}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "acceptSSL", scope: !117, file: !116, line: 94, baseType: !179, size: 64, align: 64, offset: 704)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!92, !61, !100}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "startSslAccept", scope: !117, file: !116, line: 95, baseType: !183, size: 64, align: 64, offset: 768)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!60, !61, !100, !186, !100}
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketSslAcceptFn", file: !4, line: 406, baseType: !175)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !117, file: !116, line: 98, baseType: !188, size: 64, align: 64, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!60, !61, !60}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !117, file: !116, line: 99, baseType: !192, size: 64, align: 64, offset: 896)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!60, !61, !100, !60, !92, !100, !100}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "recvPassedFd", scope: !117, file: !116, line: 101, baseType: !196, size: 64, align: 64, offset: 960)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!60, !61, !100, !60, !100, !100}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "getReceivedFd", scope: !117, file: !116, line: 103, baseType: !141, size: 64, align: 64, offset: 1024)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !117, file: !116, line: 104, baseType: !201, size: 64, align: 64, offset: 1088)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!60, !61, !100, !60, !204, !100}
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketSendFn", file: !4, line: 395, baseType: !107)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "isSendBufferFull", scope: !117, file: !116, line: 106, baseType: !141, size: 64, align: 64, offset: 1152)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "getNetworkStats", scope: !117, file: !116, line: 107, baseType: !207, size: 64, align: 64, offset: 1216)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!60, !61, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketNetworkStats", file: !4, line: 200, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AsyncSocketNetworkStats", file: !4, line: 193, size: 256, align: 64, elements: !213)
!213 = !{!214, !215, !216, !217, !218, !219}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "cwndBytes", scope: !212, file: !4, line: 194, baseType: !48, size: 32, align: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "rttSmoothedAvgMillis", scope: !212, file: !4, line: 195, baseType: !48, size: 32, align: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "rttSmoothedVarMillis", scope: !212, file: !4, line: 196, baseType: !48, size: 32, align: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "queuedBytes", scope: !212, file: !4, line: 197, baseType: !48, size: 32, align: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "inflightBytes", scope: !212, file: !4, line: 198, baseType: !48, size: 32, align: 32, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "packetLossPercent", scope: !212, file: !4, line: 199, baseType: !220, size: 64, align: 64, offset: 192)
!220 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !117, file: !116, line: 109, baseType: !141, size: 64, align: 64, offset: 1280)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "cancelRecv", scope: !117, file: !116, line: 110, baseType: !223, size: 64, align: 64, offset: 1344)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!60, !61, !226, !227, !227, !92}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "cancelCbForClose", scope: !117, file: !116, line: 112, baseType: !141, size: 64, align: 64, offset: 1408)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "getLocalVMCIAddress", scope: !117, file: !116, line: 113, baseType: !230, size: 64, align: 64, offset: 1472)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!60, !61, !233, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "getRemoteVMCIAddress", scope: !117, file: !116, line: 114, baseType: !230, size: 64, align: 64, offset: 1536)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "getWebSocketError", scope: !117, file: !116, line: 115, baseType: !141, size: 64, align: 64, offset: 1600)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "getWebSocketURI", scope: !117, file: !116, line: 116, baseType: !237, size: 64, align: 64, offset: 1664)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!157, !61}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "getWebSocketCookie", scope: !117, file: !116, line: 117, baseType: !237, size: 64, align: 64, offset: 1728)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "getWebSocketCloseStatus", scope: !117, file: !116, line: 118, baseType: !242, size: 64, align: 64, offset: 1792)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!245, !61}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !49, line: 175, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !51, line: 49, baseType: !247)
!247 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "getWebSocketProtocol", scope: !117, file: !116, line: 119, baseType: !249, size: 64, align: 64, offset: 1856)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!150, !61}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "setWebSocketCookie", scope: !117, file: !116, line: 120, baseType: !253, size: 64, align: 64, offset: 1920)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!60, !61, !100, !150, !150}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "recvBlocking", scope: !117, file: !116, line: 122, baseType: !257, size: 64, align: 64, offset: 1984)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!60, !61, !100, !60, !226, !60}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "recvPartialBlocking", scope: !117, file: !116, line: 124, baseType: !257, size: 64, align: 64, offset: 2048)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sendBlocking", scope: !117, file: !116, line: 126, baseType: !257, size: 64, align: 64, offset: 2112)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "doOneMsg", scope: !117, file: !116, line: 128, baseType: !263, size: 64, align: 64, offset: 2176)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!60, !61, !92, !60}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "waitForConnection", scope: !117, file: !116, line: 129, baseType: !188, size: 64, align: 64, offset: 2240)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "waitForReadMultiple", scope: !117, file: !116, line: 130, baseType: !268, size: 64, align: 64, offset: 2304)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!60, !271, !60, !60, !226}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !117, file: !116, line: 137, baseType: !273, size: 64, align: 64, offset: 2368)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !61}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketCloseFn", file: !4, line: 410, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !61, !100}
!280 = !{}
!281 = !DILocalVariable(name: "asock", arg: 1, scope: !56, file: !57, line: 95, type: !61)
!282 = !DIExpression()
!283 = !DILocation(line: 95, column: 42, scope: !56)
!284 = !DILocalVariable(name: "flushEnabledMaxWaitMsec", arg: 2, scope: !56, file: !57, line: 96, type: !60)
!285 = !DILocation(line: 96, column: 33, scope: !56)
!286 = !DILocalVariable(name: "closeCb", arg: 3, scope: !56, file: !57, line: 97, type: !276)
!287 = !DILocation(line: 97, column: 48, scope: !56)
!288 = !DILocalVariable(name: "ret", scope: !56, file: !57, line: 99, type: !60)
!289 = !DILocation(line: 99, column: 8, scope: !56)
!290 = !DILocation(line: 100, column: 28, scope: !291)
!291 = distinct !DILexicalBlock(scope: !56, file: !57, line: 100, column: 8)
!292 = !DILocation(line: 100, column: 34, scope: !291)
!293 = !DILocation(line: 100, column: 39, scope: !294)
!294 = !DILexicalBlockFile(scope: !291, file: !57, discriminator: 1)
!295 = !DILocation(line: 100, column: 47, scope: !294)
!296 = !DILocation(line: 100, column: 52, scope: !294)
!297 = !DILocation(line: 100, column: 34, scope: !294)
!298 = !DILocation(line: 100, column: 26, scope: !299)
!299 = !DILexicalBlockFile(scope: !291, file: !57, discriminator: 2)
!300 = !DILocation(line: 100, column: 25, scope: !299)
!301 = !DILocation(line: 100, column: 8, scope: !299)
!302 = !DILocation(line: 101, column: 23, scope: !303)
!303 = distinct !DILexicalBlock(scope: !291, file: !57, line: 100, column: 74)
!304 = !DILocation(line: 101, column: 7, scope: !303)
!305 = !DILocation(line: 102, column: 15, scope: !303)
!306 = !DILocation(line: 102, column: 23, scope: !303)
!307 = !DILocation(line: 102, column: 28, scope: !303)
!308 = !DILocation(line: 102, column: 44, scope: !303)
!309 = !DILocation(line: 102, column: 51, scope: !303)
!310 = !DILocation(line: 102, column: 76, scope: !303)
!311 = !DILocation(line: 102, column: 13, scope: !303)
!312 = !DILocation(line: 102, column: 11, scope: !303)
!313 = !DILocation(line: 103, column: 25, scope: !303)
!314 = !DILocation(line: 103, column: 7, scope: !303)
!315 = !DILocation(line: 104, column: 4, scope: !303)
!316 = !DILocation(line: 105, column: 11, scope: !317)
!317 = distinct !DILexicalBlock(scope: !291, file: !57, line: 104, column: 11)
!318 = !DILocation(line: 107, column: 11, scope: !56)
!319 = !DILocation(line: 107, column: 4, scope: !56)
!320 = distinct !DISubprogram(name: "AsyncSocket_GetState", scope: !57, file: !57, line: 130, type: !121, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !280)
!321 = !DILocalVariable(name: "asock", arg: 1, scope: !320, file: !57, line: 130, type: !61)
!322 = !DILocation(line: 130, column: 35, scope: !320)
!323 = !DILocalVariable(name: "ret", scope: !320, file: !57, line: 132, type: !90)
!324 = !DILocation(line: 132, column: 21, scope: !320)
!325 = !DILocation(line: 133, column: 28, scope: !326)
!326 = distinct !DILexicalBlock(scope: !320, file: !57, line: 133, column: 8)
!327 = !DILocation(line: 133, column: 34, scope: !326)
!328 = !DILocation(line: 133, column: 39, scope: !329)
!329 = !DILexicalBlockFile(scope: !326, file: !57, discriminator: 1)
!330 = !DILocation(line: 133, column: 47, scope: !329)
!331 = !DILocation(line: 133, column: 52, scope: !329)
!332 = !DILocation(line: 133, column: 34, scope: !329)
!333 = !DILocation(line: 133, column: 26, scope: !334)
!334 = !DILexicalBlockFile(scope: !326, file: !57, discriminator: 2)
