; ModuleID = './libSslDirect_la-sslDirect.o.i'
source_filename = "./libSslDirect_la-sslDirect.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.SSLSockStruct = type { %struct.ssl_st*, i32, i8, i8, i8, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !12, globals: !1705)
!1 = !DIFile(filename: "libSslDirect_la-sslDirect.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!2 = !{!3, !8}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "sslDirect.c", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "SSL_SOCK_WANT_RETRY", value: 0)
!7 = !DIEnumerator(name: "SSL_SOCK_LOST_CONNECTION", value: 1)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 303, size: 32, align: 32, elements: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!10 = !{!11}
!11 = !DIEnumerator(name: "SCM_RIGHTS", value: 1)
!12 = !{!13, !26, !50, !288, !1695, !66}
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSLSock", file: !14, line: 33, baseType: !15)
!14 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/sslDirect.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SSLSockStruct", file: !4, line: 57, size: 192, align: 64, elements: !17)
!17 = !{!18, !1688, !1689, !1692, !1693, !1694}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "sslCnx", scope: !16, file: !4, line: 58, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !21, line: 178, baseType: !22)
!21 = !DIFile(filename: "/usr/include/openssl/ossl_typ.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !23, line: 1422, size: 6592, align: 64, elements: !24)
!23 = !DIFile(filename: "/usr/include/openssl/ssl.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!24 = !{!25, !27, !28, !1217, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1347, !1502, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1628, !1629, !1630, !1631, !1632, !1633, !1636, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1656, !1661, !1662, !1669, !1670, !1671, !1672, !1673, !1674, !1681, !1682, !1683, !1684, !1685, !1686, !1687}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !22, file: !23, line: 1427, baseType: !26, size: 32, align: 32)
!26 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !22, file: !23, line: 1429, baseType: !26, size: 32, align: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !22, file: !23, line: 1431, baseType: !29, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_METHOD", file: !23, line: 374, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_method_st", file: !23, line: 438, size: 1856, align: 64, elements: !33)
!33 = !{!34, !35, !39, !43, !44, !45, !46, !51, !52, !58, !59, !60, !61, !67, !73, !77, !78, !82, !1172, !1176, !1180, !1184, !1188, !1192, !1198, !1202, !1205, !1206, !1213}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !32, file: !23, line: 439, baseType: !26, size: 32, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_new", scope: !32, file: !23, line: 440, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!26, !19}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_clear", scope: !32, file: !23, line: 441, baseType: !40, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !19}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_free", scope: !32, file: !23, line: 442, baseType: !40, size: 64, align: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_accept", scope: !32, file: !23, line: 443, baseType: !36, size: 64, align: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_connect", scope: !32, file: !23, line: 444, baseType: !36, size: 64, align: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_read", scope: !32, file: !23, line: 445, baseType: !47, size: 64, align: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!26, !19, !50, !26}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_peek", scope: !32, file: !23, line: 446, baseType: !47, size: 64, align: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_write", scope: !32, file: !23, line: 447, baseType: !53, size: 64, align: 64, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!26, !19, !56, !26}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_shutdown", scope: !32, file: !23, line: 448, baseType: !36, size: 64, align: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_renegotiate", scope: !32, file: !23, line: 449, baseType: !36, size: 64, align: 64, offset: 640)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_renegotiate_check", scope: !32, file: !23, line: 450, baseType: !36, size: 64, align: 64, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_get_message", scope: !32, file: !23, line: 451, baseType: !62, size: 64, align: 64, offset: 768)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !19, !26, !26, !26, !65, !66}
!65 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_read_bytes", scope: !32, file: !23, line: 453, baseType: !68, size: 64, align: 64, offset: 832)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!26, !19, !26, !71, !26, !26}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_write_bytes", scope: !32, file: !23, line: 455, baseType: !74, size: 64, align: 64, offset: 896)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!26, !19, !26, !56, !26}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_dispatch_alert", scope: !32, file: !23, line: 456, baseType: !36, size: 64, align: 64, offset: 960)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_ctrl", scope: !32, file: !23, line: 457, baseType: !79, size: 64, align: 64, offset: 1024)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!65, !19, !26, !65, !50}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_ctx_ctrl", scope: !32, file: !23, line: 458, baseType: !83, size: 64, align: 64, offset: 1088)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!65, !86, !26, !65, !50}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !21, line: 179, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !23, line: 925, size: 6400, align: 64, elements: !89)
!89 = !{!90, !91, !111, !112, !780, !785, !786, !852, !853, !854, !855, !862, !867, !871, !885, !886, !890, !891, !897, !898, !903, !907, !911, !912, !972, !973, !974, !975, !980, !986, !991, !992, !993, !994, !997, !998, !1002, !1003, !1004, !1005, !1006, !1007, !1012, !1013, !1014, !1015, !1016, !1020, !1021, !1025, !1026, !1027, !1097, !1101, !1102, !1106, !1107, !1108, !1112, !1116, !1117, !1120, !1121, !1144, !1149, !1150, !1155, !1156, !1161, !1165, !1166, !1167, !1168, !1169, !1170, !1171}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !88, file: !23, line: 926, baseType: !29, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_list", scope: !88, file: !23, line: 927, baseType: !92, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_SSL_CIPHER", file: !23, line: 380, size: 256, align: 64, elements: !94)
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !93, file: !23, line: 380, baseType: !96, size: 256, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "_STACK", file: !97, line: 72, baseType: !98)
!97 = !DIFile(filename: "/usr/include/openssl/stack.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !97, line: 66, size: 256, align: 64, elements: !99)
!99 = !{!100, !101, !105, !106, !107}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !98, file: !97, line: 67, baseType: !26, size: 32, align: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !98, file: !97, line: 68, baseType: !102, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !98, file: !97, line: 69, baseType: !26, size: 32, align: 32, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "num_alloc", scope: !98, file: !97, line: 70, baseType: !26, size: 32, align: 32, offset: 160)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !98, file: !97, line: 71, baseType: !108, size: 64, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!26, !56, !56}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_list_by_id", scope: !88, file: !23, line: 929, baseType: !92, size: 64, align: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "cert_store", scope: !88, file: !23, line: 930, baseType: !113, size: 64, align: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_store_st", file: !115, line: 186, size: 1152, align: 64, elements: !116)
!115 = !DIFile(filename: "/usr/include/openssl/x509_vfy.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!116 = !{!117, !118, !123, !128, !155, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !114, file: !115, line: 188, baseType: !26, size: 32, align: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "objs", scope: !114, file: !115, line: 189, baseType: !119, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_OBJECT", file: !115, line: 137, size: 256, align: 64, elements: !121)
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !120, file: !115, line: 137, baseType: !96, size: 256, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "get_cert_methods", scope: !114, file: !115, line: 191, baseType: !124, size: 64, align: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_LOOKUP", file: !115, line: 136, size: 256, align: 64, elements: !126)
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !125, file: !115, line: 136, baseType: !96, size: 256, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !114, file: !115, line: 192, baseType: !129, size: 64, align: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_VERIFY_PARAM", file: !115, line: 177, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_VERIFY_PARAM_st", file: !115, line: 167, size: 512, align: 64, elements: !132)
!132 = !{!133, !134, !139, !141, !142, !143, !144, !145, !151}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !115, line: 168, baseType: !103, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "check_time", scope: !131, file: !115, line: 169, baseType: !135, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !136, line: 75, baseType: !137)
!136 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !138, line: 139, baseType: !65)
!138 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "inh_flags", scope: !131, file: !115, line: 170, baseType: !140, size: 64, align: 64, offset: 128)
!140 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !131, file: !115, line: 171, baseType: !140, size: 64, align: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !131, file: !115, line: 172, baseType: !26, size: 32, align: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !131, file: !115, line: 173, baseType: !26, size: 32, align: 32, offset: 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !131, file: !115, line: 174, baseType: !26, size: 32, align: 32, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "policies", scope: !131, file: !115, line: 175, baseType: !146, size: 64, align: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ASN1_OBJECT", file: !148, line: 801, size: 256, align: 64, elements: !149)
!148 = !DIFile(filename: "/usr/include/openssl/asn1.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!149 = !{!150}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !147, file: !148, line: 801, baseType: !96, size: 256, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !131, file: !115, line: 176, baseType: !152, size: 64, align: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_VERIFY_PARAM_ID", file: !115, line: 159, baseType: !154)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_VERIFY_PARAM_ID_st", file: !115, line: 159, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "verify", scope: !114, file: !115, line: 195, baseType: !156, size: 64, align: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!26, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_STORE_CTX", file: !21, line: 162, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_store_ctx_st", file: !115, line: 236, size: 1984, align: 64, elements: !162)
!162 = !{!163, !166, !167, !657, !662, !667, !668, !669, !670, !674, !679, !683, !684, !733, !737, !741, !742, !746, !750, !751, !752, !753, !754, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !161, file: !115, line: 237, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_STORE", file: !21, line: 161, baseType: !114)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "current_method", scope: !161, file: !115, line: 239, baseType: !26, size: 32, align: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !161, file: !115, line: 242, baseType: !168, size: 64, align: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !21, line: 154, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !171, line: 270, size: 1472, align: 64, elements: !172)
!171 = !DIFile(filename: "/usr/include/openssl/x509.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!172 = !{!173, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !625, !629, !632, !635, !639, !643}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "cert_info", scope: !170, file: !171, line: 271, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CINF", file: !171, line: 254, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_cinf_st", file: !171, line: 242, size: 832, align: 64, elements: !177)
!177 = !{!178, !187, !188, !270, !294, !303, !304, !594, !595, !596, !601}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !176, file: !171, line: 243, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !21, line: 83, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !148, line: 247, size: 192, align: 64, elements: !182)
!182 = !{!183, !184, !185, !186}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !181, file: !148, line: 248, baseType: !26, size: 32, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !181, file: !148, line: 249, baseType: !26, size: 32, align: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !148, line: 250, baseType: !71, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !181, file: !148, line: 256, baseType: !65, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !176, file: !171, line: 244, baseType: !179, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !176, file: !171, line: 245, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !21, line: 155, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !171, line: 143, size: 128, align: 64, elements: !192)
!192 = !{!193, !208}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !191, file: !171, line: 144, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !21, line: 103, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !148, line: 218, size: 320, align: 64, elements: !197)
!197 = !{!198, !201, !202, !203, !204, !207}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sn", scope: !196, file: !148, line: 219, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ln", scope: !196, file: !148, line: 219, baseType: !199, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "nid", scope: !196, file: !148, line: 220, baseType: !26, size: 32, align: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !196, file: !148, line: 221, baseType: !26, size: 32, align: 32, offset: 160)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !196, file: !148, line: 222, baseType: !205, size: 64, align: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !196, file: !148, line: 223, baseType: !26, size: 32, align: 32, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !191, file: !171, line: 145, baseType: !209, size: 64, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !148, line: 561, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !148, line: 532, size: 128, align: 64, elements: !212)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !211, file: !148, line: 533, baseType: !26, size: 32, align: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !211, file: !148, line: 560, baseType: !215, size: 64, align: 64, offset: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !211, file: !148, line: 534, size: 64, align: 64, elements: !216)
!216 = !{!217, !218, !220, !223, !224, !225, !228, !231, !234, !237, !240, !243, !246, !249, !252, !255, !258, !261, !264, !265, !266}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !215, file: !148, line: 535, baseType: !103, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !215, file: !148, line: 536, baseType: !219, size: 32, align: 32)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !21, line: 99, baseType: !26)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !215, file: !148, line: 537, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !21, line: 98, baseType: !181)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !215, file: !148, line: 538, baseType: !194, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !215, file: !148, line: 539, baseType: !179, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !215, file: !148, line: 540, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !21, line: 84, baseType: !181)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !215, file: !148, line: 541, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !21, line: 85, baseType: !181)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !215, file: !148, line: 542, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !21, line: 86, baseType: !181)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !215, file: !148, line: 543, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !21, line: 87, baseType: !181)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !215, file: !148, line: 544, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !21, line: 88, baseType: !181)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !215, file: !148, line: 545, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !21, line: 89, baseType: !181)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !215, file: !148, line: 546, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !21, line: 90, baseType: !181)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !215, file: !148, line: 547, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !21, line: 92, baseType: !181)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !215, file: !148, line: 548, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !21, line: 91, baseType: !181)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !215, file: !148, line: 549, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !21, line: 93, baseType: !181)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !215, file: !148, line: 550, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !21, line: 95, baseType: !181)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !215, file: !148, line: 551, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !21, line: 96, baseType: !181)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !215, file: !148, line: 552, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !21, line: 97, baseType: !181)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !215, file: !148, line: 557, baseType: !221, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !215, file: !148, line: 558, baseType: !221, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !215, file: !148, line: 559, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !148, line: 307, baseType: !269)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !148, line: 307, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !176, file: !171, line: 246, baseType: !271, size: 64, align: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !21, line: 159, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !171, line: 179, size: 320, align: 64, elements: !274)
!274 = !{!275, !280, !281, !292, !293}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !273, file: !171, line: 180, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_NAME_ENTRY", file: !171, line: 175, size: 256, align: 64, elements: !278)
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !277, file: !171, line: 175, baseType: !96, size: 256, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !273, file: !171, line: 181, baseType: !26, size: 32, align: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !273, file: !171, line: 183, baseType: !282, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUF_MEM", file: !21, line: 127, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_mem_st", file: !285, line: 77, size: 192, align: 64, elements: !286)
!285 = !DIFile(filename: "/usr/include/openssl/buffer.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!286 = !{!287, !290, !291}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !284, file: !285, line: 78, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !289, line: 216, baseType: !140)
!289 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!290 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !284, file: !285, line: 79, baseType: !103, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !284, file: !285, line: 80, baseType: !288, size: 64, align: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "canon_enc", scope: !273, file: !171, line: 188, baseType: !71, size: 64, align: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "canon_enclen", scope: !273, file: !171, line: 189, baseType: !26, size: 32, align: 32, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "validity", scope: !176, file: !171, line: 247, baseType: !295, size: 64, align: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_VAL", file: !171, line: 155, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_val_st", file: !171, line: 152, size: 128, align: 64, elements: !298)
!298 = !{!299, !302}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "notBefore", scope: !297, file: !171, line: 153, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TIME", file: !21, line: 94, baseType: !181)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "notAfter", scope: !297, file: !171, line: 154, baseType: !300, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "subject", scope: !176, file: !171, line: 248, baseType: !271, size: 64, align: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !176, file: !171, line: 249, baseType: !305, size: 64, align: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_PUBKEY", file: !21, line: 160, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_pubkey_st", file: !171, line: 157, size: 192, align: 64, elements: !308)
!308 = !{!309, !310, !311}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "algor", scope: !307, file: !171, line: 158, baseType: !189, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "public_key", scope: !307, file: !171, line: 159, baseType: !229, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !307, file: !171, line: 160, baseType: !312, size: 64, align: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !21, line: 133, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !315, line: 129, size: 448, align: 64, elements: !316)
!315 = !DIFile(filename: "/usr/include/openssl/evp.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!316 = !{!317, !318, !319, !320, !325, !329, !588, !589}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !314, file: !315, line: 130, baseType: !26, size: 32, align: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "save_type", scope: !314, file: !315, line: 131, baseType: !26, size: 32, align: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !314, file: !315, line: 132, baseType: !26, size: 32, align: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ameth", scope: !314, file: !315, line: 133, baseType: !321, size: 64, align: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY_ASN1_METHOD", file: !21, line: 135, baseType: !324)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_asn1_method_st", file: !21, line: 135, flags: DIFlagFwdDecl)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !314, file: !315, line: 134, baseType: !326, size: 64, align: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENGINE", file: !21, line: 177, baseType: !328)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "engine_st", file: !21, line: 177, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !314, file: !315, line: 149, baseType: !330, size: 64, align: 64, offset: 256)
!330 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !314, file: !315, line: 135, size: 64, align: 64, elements: !331)
!331 = !{!332, !333, !464, !532, !585}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !330, file: !315, line: 136, baseType: !103, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rsa", scope: !330, file: !315, line: 138, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rsa_st", file: !336, line: 132, size: 1344, align: 64, elements: !337)
!336 = !DIFile(filename: "/usr/include/openssl/rsa.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!337 = !{!338, !339, !340, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !453, !454, !455, !456, !457, !458, !459, !463}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !335, file: !336, line: 137, baseType: !26, size: 32, align: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !335, file: !336, line: 138, baseType: !65, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !335, file: !336, line: 139, baseType: !341, size: 64, align: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "RSA_METHOD", file: !21, line: 147, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rsa_meth_st", file: !336, line: 85, size: 896, align: 64, elements: !345)
!345 = !{!346, !347, !353, !354, !355, !356, !376, !393, !397, !398, !399, !400, !408, !412}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !344, file: !336, line: 86, baseType: !199, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_pub_enc", scope: !344, file: !336, line: 87, baseType: !348, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!26, !26, !205, !71, !351, !26}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "RSA", file: !21, line: 146, baseType: !335)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_pub_dec", scope: !344, file: !336, line: 89, baseType: !348, size: 64, align: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_priv_enc", scope: !344, file: !336, line: 91, baseType: !348, size: 64, align: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_priv_dec", scope: !344, file: !336, line: 93, baseType: !348, size: 64, align: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_mod_exp", scope: !344, file: !336, line: 96, baseType: !357, size: 64, align: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!26, !360, !371, !351, !373}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIGNUM", file: !21, line: 120, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_st", file: !363, line: 313, size: 192, align: 64, elements: !364)
!363 = !DIFile(filename: "/usr/include/openssl/bn.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!364 = !{!365, !367, !368, !369, !370}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !362, file: !363, line: 314, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !362, file: !363, line: 316, baseType: !26, size: 32, align: 32, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !362, file: !363, line: 318, baseType: !26, size: 32, align: 32, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "neg", scope: !362, file: !363, line: 319, baseType: !26, size: 32, align: 32, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !362, file: !363, line: 320, baseType: !26, size: 32, align: 32, offset: 160)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_CTX", file: !21, line: 121, baseType: !375)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_ctx", file: !21, line: 121, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "bn_mod_exp", scope: !344, file: !336, line: 98, baseType: !377, size: 64, align: 64, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!26, !360, !371, !371, !371, !373, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_MONT_CTX", file: !21, line: 123, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_mont_ctx_st", file: !363, line: 324, size: 832, align: 64, elements: !383)
!383 = !{!384, !385, !386, !387, !388, !392}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !382, file: !363, line: 325, baseType: !26, size: 32, align: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "RR", scope: !382, file: !363, line: 326, baseType: !361, size: 192, align: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !382, file: !363, line: 327, baseType: !361, size: 192, align: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Ni", scope: !382, file: !363, line: 328, baseType: !361, size: 192, align: 64, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "n0", scope: !382, file: !363, line: 330, baseType: !389, size: 128, align: 64, offset: 640)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 128, align: 64, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 2)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !382, file: !363, line: 333, baseType: !26, size: 32, align: 32, offset: 768)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !344, file: !336, line: 101, baseType: !394, size: 64, align: 64, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!26, !351}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !344, file: !336, line: 103, baseType: !394, size: 64, align: 64, offset: 512)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !344, file: !336, line: 105, baseType: !26, size: 32, align: 32, offset: 576)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !344, file: !336, line: 107, baseType: !103, size: 64, align: 64, offset: 640)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_sign", scope: !344, file: !336, line: 116, baseType: !401, size: 64, align: 64, offset: 704)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!26, !26, !205, !404, !71, !405, !406}
!404 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_verify", scope: !344, file: !336, line: 120, baseType: !409, size: 64, align: 64, offset: 768)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!26, !26, !205, !404, !205, !404, !406}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_keygen", scope: !344, file: !336, line: 129, baseType: !413, size: 64, align: 64, offset: 832)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!26, !351, !26, !360, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_GENCB", file: !21, line: 125, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_gencb_st", file: !363, line: 349, size: 192, align: 64, elements: !419)
!419 = !{!420, !421, !422}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ver", scope: !418, file: !363, line: 350, baseType: !404, size: 32, align: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !418, file: !363, line: 351, baseType: !50, size: 64, align: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !418, file: !363, line: 357, baseType: !423, size: 64, align: 64, offset: 128)
!423 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !418, file: !363, line: 352, size: 64, align: 64, elements: !424)
!424 = !{!425, !429}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "cb_1", scope: !423, file: !363, line: 354, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !26, !26, !50}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "cb_2", scope: !423, file: !363, line: 356, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!26, !26, !26, !416}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !335, file: !336, line: 141, baseType: !326, size: 64, align: 64, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !335, file: !336, line: 142, baseType: !360, size: 64, align: 64, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !335, file: !336, line: 143, baseType: !360, size: 64, align: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !335, file: !336, line: 144, baseType: !360, size: 64, align: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !335, file: !336, line: 145, baseType: !360, size: 64, align: 64, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !335, file: !336, line: 146, baseType: !360, size: 64, align: 64, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dmp1", scope: !335, file: !336, line: 147, baseType: !360, size: 64, align: 64, offset: 576)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dmq1", scope: !335, file: !336, line: 148, baseType: !360, size: 64, align: 64, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "iqmp", scope: !335, file: !336, line: 149, baseType: !360, size: 64, align: 64, offset: 704)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !335, file: !336, line: 151, baseType: !443, size: 128, align: 64, offset: 768)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_EX_DATA", file: !21, line: 195, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_ex_data_st", file: !445, line: 292, size: 128, align: 64, elements: !446)
!445 = !DIFile(filename: "/usr/include/openssl/crypto.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!446 = !{!447, !452}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !444, file: !445, line: 293, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_void", file: !445, line: 297, size: 256, align: 64, elements: !450)
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !449, file: !445, line: 297, baseType: !96, size: 256, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !444, file: !445, line: 295, baseType: !26, size: 32, align: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !335, file: !336, line: 152, baseType: !26, size: 32, align: 32, offset: 896)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !335, file: !336, line: 153, baseType: !26, size: 32, align: 32, offset: 928)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_method_mod_n", scope: !335, file: !336, line: 155, baseType: !380, size: 64, align: 64, offset: 960)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_method_mod_p", scope: !335, file: !336, line: 156, baseType: !380, size: 64, align: 64, offset: 1024)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_method_mod_q", scope: !335, file: !336, line: 157, baseType: !380, size: 64, align: 64, offset: 1088)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "bignum_data", scope: !335, file: !336, line: 162, baseType: !103, size: 64, align: 64, offset: 1152)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "blinding", scope: !335, file: !336, line: 163, baseType: !460, size: 64, align: 64, offset: 1216)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_BLINDING", file: !21, line: 122, baseType: !462)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "bn_blinding_st", file: !21, line: 122, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "mt_blinding", scope: !335, file: !336, line: 164, baseType: !460, size: 64, align: 64, offset: 1280)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dsa", scope: !330, file: !315, line: 141, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dsa_st", file: !467, line: 155, size: 1088, align: 64, elements: !468)
!467 = !DIFile(filename: "/usr/include/openssl/dsa.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!468 = !{!469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !531}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !466, file: !467, line: 160, baseType: !26, size: 32, align: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !466, file: !467, line: 161, baseType: !65, size: 64, align: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "write_params", scope: !466, file: !467, line: 162, baseType: !26, size: 32, align: 32, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !466, file: !467, line: 163, baseType: !360, size: 64, align: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !466, file: !467, line: 164, baseType: !360, size: 64, align: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !466, file: !467, line: 165, baseType: !360, size: 64, align: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pub_key", scope: !466, file: !467, line: 166, baseType: !360, size: 64, align: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "priv_key", scope: !466, file: !467, line: 167, baseType: !360, size: 64, align: 64, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "kinv", scope: !466, file: !467, line: 168, baseType: !360, size: 64, align: 64, offset: 512)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !466, file: !467, line: 169, baseType: !360, size: 64, align: 64, offset: 576)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !466, file: !467, line: 170, baseType: !26, size: 32, align: 32, offset: 640)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "method_mont_p", scope: !466, file: !467, line: 172, baseType: !380, size: 64, align: 64, offset: 704)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !466, file: !467, line: 173, baseType: !26, size: 32, align: 32, offset: 768)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !466, file: !467, line: 174, baseType: !443, size: 128, align: 64, offset: 832)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !466, file: !467, line: 175, baseType: !484, size: 64, align: 64, offset: 960)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSA_METHOD", file: !21, line: 144, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dsa_method", file: !467, line: 129, size: 768, align: 64, elements: !488)
!488 = !{!489, !490, !502, !507, !511, !515, !519, !523, !524, !525, !526, !530}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !487, file: !467, line: 130, baseType: !199, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_do_sign", scope: !487, file: !467, line: 131, baseType: !491, size: 64, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!494, !205, !26, !500}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSA_SIG", file: !467, line: 127, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DSA_SIG_st", file: !467, line: 124, size: 128, align: 64, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !496, file: !467, line: 125, baseType: !360, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !496, file: !467, line: 126, baseType: !360, size: 64, align: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSA", file: !21, line: 143, baseType: !466)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_sign_setup", scope: !487, file: !467, line: 132, baseType: !503, size: 64, align: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!26, !500, !373, !506, !506}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_do_verify", scope: !487, file: !467, line: 134, baseType: !508, size: 64, align: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!26, !205, !26, !494, !500}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_mod_exp", scope: !487, file: !467, line: 136, baseType: !512, size: 64, align: 64, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!26, !500, !360, !360, !360, !360, !360, !360, !373, !380}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "bn_mod_exp", scope: !487, file: !467, line: 140, baseType: !516, size: 64, align: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!26, !500, !360, !360, !371, !371, !373, !380}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !487, file: !467, line: 142, baseType: !520, size: 64, align: 64, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!26, !500}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !487, file: !467, line: 143, baseType: !520, size: 64, align: 64, offset: 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !487, file: !467, line: 144, baseType: !26, size: 32, align: 32, offset: 512)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !487, file: !467, line: 145, baseType: !103, size: 64, align: 64, offset: 576)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_paramgen", scope: !487, file: !467, line: 147, baseType: !527, size: 64, align: 64, offset: 640)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!26, !500, !26, !205, !26, !66, !366, !416}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_keygen", scope: !487, file: !467, line: 152, baseType: !520, size: 64, align: 64, offset: 704)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !466, file: !467, line: 177, baseType: !326, size: 64, align: 64, offset: 1024)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dh", scope: !330, file: !315, line: 144, baseType: !533, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dh_st", file: !535, line: 135, size: 1152, align: 64, elements: !536)
!535 = !DIFile(filename: "/usr/include/openssl/dh.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !584}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !534, file: !535, line: 140, baseType: !26, size: 32, align: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !534, file: !535, line: 141, baseType: !26, size: 32, align: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !534, file: !535, line: 142, baseType: !360, size: 64, align: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !534, file: !535, line: 143, baseType: !360, size: 64, align: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !534, file: !535, line: 144, baseType: !65, size: 64, align: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pub_key", scope: !534, file: !535, line: 145, baseType: !360, size: 64, align: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "priv_key", scope: !534, file: !535, line: 146, baseType: !360, size: 64, align: 64, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !534, file: !535, line: 147, baseType: !26, size: 32, align: 32, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "method_mont_p", scope: !534, file: !535, line: 148, baseType: !380, size: 64, align: 64, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !534, file: !535, line: 150, baseType: !360, size: 64, align: 64, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !534, file: !535, line: 151, baseType: !360, size: 64, align: 64, offset: 576)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !534, file: !535, line: 152, baseType: !71, size: 64, align: 64, offset: 640)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "seedlen", scope: !534, file: !535, line: 153, baseType: !26, size: 32, align: 32, offset: 704)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !534, file: !535, line: 154, baseType: !360, size: 64, align: 64, offset: 768)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !534, file: !535, line: 155, baseType: !26, size: 32, align: 32, offset: 832)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !534, file: !535, line: 156, baseType: !443, size: 128, align: 64, offset: 896)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !534, file: !535, line: 157, baseType: !554, size: 64, align: 64, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "DH_METHOD", file: !21, line: 141, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dh_method", file: !535, line: 117, size: 576, align: 64, elements: !558)
!558 = !{!559, !560, !566, !570, !576, !577, !578, !579, !580}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !557, file: !535, line: 118, baseType: !199, size: 64, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "generate_key", scope: !557, file: !535, line: 120, baseType: !561, size: 64, align: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!26, !564}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "DH", file: !21, line: 140, baseType: !534)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "compute_key", scope: !557, file: !535, line: 121, baseType: !567, size: 64, align: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64, align: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!26, !71, !371, !564}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "bn_mod_exp", scope: !557, file: !535, line: 123, baseType: !571, size: 64, align: 64, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!26, !574, !360, !371, !371, !371, !373, !380}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !557, file: !535, line: 126, baseType: !561, size: 64, align: 64, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !557, file: !535, line: 127, baseType: !561, size: 64, align: 64, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !557, file: !535, line: 128, baseType: !26, size: 32, align: 32, offset: 384)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !557, file: !535, line: 129, baseType: !103, size: 64, align: 64, offset: 448)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "generate_params", scope: !557, file: !535, line: 131, baseType: !581, size: 64, align: 64, offset: 512)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64, align: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{!26, !564, !26, !26, !416}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !534, file: !535, line: 158, baseType: !326, size: 64, align: 64, offset: 1088)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ec", scope: !330, file: !315, line: 147, baseType: !586, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, align: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "ec_key_st", file: !315, line: 147, flags: DIFlagFwdDecl)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "save_parameters", scope: !314, file: !315, line: 150, baseType: !26, size: 32, align: 32, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !314, file: !315, line: 151, baseType: !590, size: 64, align: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64, align: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ATTRIBUTE", file: !171, line: 223, size: 256, align: 64, elements: !592)
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !591, file: !171, line: 223, baseType: !96, size: 256, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "issuerUID", scope: !176, file: !171, line: 250, baseType: !229, size: 64, align: 64, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "subjectUID", scope: !176, file: !171, line: 251, baseType: !229, size: 64, align: 64, offset: 512)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !176, file: !171, line: 252, baseType: !597, size: 64, align: 64, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_EXTENSION", file: !171, line: 204, size: 256, align: 64, elements: !599)
!599 = !{!600}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !598, file: !171, line: 204, baseType: !96, size: 256, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !176, file: !171, line: 253, baseType: !602, size: 192, align: 64, offset: 640)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENCODING", file: !148, line: 269, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ENCODING_st", file: !148, line: 265, size: 192, align: 64, elements: !604)
!604 = !{!605, !606, !607}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !603, file: !148, line: 266, baseType: !71, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !603, file: !148, line: 267, baseType: !65, size: 64, align: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !603, file: !148, line: 268, baseType: !26, size: 32, align: 32, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "sig_alg", scope: !170, file: !171, line: 272, baseType: !189, size: 64, align: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !170, file: !171, line: 273, baseType: !229, size: 64, align: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !170, file: !171, line: 274, baseType: !26, size: 32, align: 32, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !170, file: !171, line: 275, baseType: !26, size: 32, align: 32, offset: 224)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !170, file: !171, line: 276, baseType: !103, size: 64, align: 64, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !170, file: !171, line: 277, baseType: !443, size: 128, align: 64, offset: 320)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ex_pathlen", scope: !170, file: !171, line: 279, baseType: !65, size: 64, align: 64, offset: 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ex_pcpathlen", scope: !170, file: !171, line: 280, baseType: !65, size: 64, align: 64, offset: 512)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ex_flags", scope: !170, file: !171, line: 281, baseType: !140, size: 64, align: 64, offset: 576)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ex_kusage", scope: !170, file: !171, line: 282, baseType: !140, size: 64, align: 64, offset: 640)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ex_xkusage", scope: !170, file: !171, line: 283, baseType: !140, size: 64, align: 64, offset: 704)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ex_nscert", scope: !170, file: !171, line: 284, baseType: !140, size: 64, align: 64, offset: 768)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "skid", scope: !170, file: !171, line: 285, baseType: !232, size: 64, align: 64, offset: 832)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "akid", scope: !170, file: !171, line: 286, baseType: !622, size: 64, align: 64, offset: 896)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "AUTHORITY_KEYID", file: !21, line: 186, baseType: !624)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "AUTHORITY_KEYID_st", file: !21, line: 186, flags: DIFlagFwdDecl)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "policy_cache", scope: !170, file: !171, line: 287, baseType: !626, size: 64, align: 64, offset: 960)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_CACHE", file: !21, line: 184, baseType: !628)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_CACHE_st", file: !21, line: 184, flags: DIFlagFwdDecl)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "crldp", scope: !170, file: !171, line: 288, baseType: !630, size: 64, align: 64, offset: 1024)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_DIST_POINT", file: !171, line: 288, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "altname", scope: !170, file: !171, line: 289, baseType: !633, size: 64, align: 64, offset: 1088)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_GENERAL_NAME", file: !171, line: 289, flags: DIFlagFwdDecl)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !170, file: !171, line: 290, baseType: !636, size: 64, align: 64, offset: 1152)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "NAME_CONSTRAINTS", file: !21, line: 189, baseType: !638)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "NAME_CONSTRAINTS_st", file: !21, line: 189, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "sha1_hash", scope: !170, file: !171, line: 296, baseType: !640, size: 160, align: 8, offset: 1216)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 160, align: 8, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 20)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !170, file: !171, line: 298, baseType: !644, size: 64, align: 64, offset: 1408)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CERT_AUX", file: !171, line: 268, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_cert_aux_st", file: !171, line: 262, size: 320, align: 64, elements: !647)
!647 = !{!648, !649, !650, !651, !652}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !646, file: !171, line: 263, baseType: !146, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "reject", scope: !646, file: !171, line: 264, baseType: !146, size: 64, align: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !646, file: !171, line: 265, baseType: !262, size: 64, align: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "keyid", scope: !646, file: !171, line: 266, baseType: !232, size: 64, align: 64, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !646, file: !171, line: 267, baseType: !653, size: 64, align: 64, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !148, line: 170, size: 256, align: 64, elements: !655)
!655 = !{!656}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !654, file: !148, line: 170, baseType: !96, size: 256, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "untrusted", scope: !161, file: !115, line: 244, baseType: !658, size: 64, align: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !171, line: 301, size: 256, align: 64, elements: !660)
!660 = !{!661}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !659, file: !171, line: 301, baseType: !96, size: 256, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "crls", scope: !161, file: !115, line: 246, baseType: !663, size: 64, align: 64, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64, align: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_CRL", file: !171, line: 476, size: 256, align: 64, elements: !665)
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !664, file: !171, line: 476, baseType: !96, size: 256, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !161, file: !115, line: 247, baseType: !129, size: 64, align: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "other_ctx", scope: !161, file: !115, line: 249, baseType: !50, size: 64, align: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "verify", scope: !161, file: !115, line: 252, baseType: !156, size: 64, align: 64, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "verify_cb", scope: !161, file: !115, line: 254, baseType: !671, size: 64, align: 64, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64, align: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!26, !26, !159}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "get_issuer", scope: !161, file: !115, line: 256, baseType: !675, size: 64, align: 64, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64, align: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!26, !678, !159, !168}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "check_issued", scope: !161, file: !115, line: 258, baseType: !680, size: 64, align: 64, offset: 640)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64, align: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!26, !159, !168, !168}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "check_revocation", scope: !161, file: !115, line: 260, baseType: !156, size: 64, align: 64, offset: 704)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "get_crl", scope: !161, file: !115, line: 262, baseType: !685, size: 64, align: 64, offset: 768)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, align: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{!26, !159, !688, !168}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !21, line: 156, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !171, line: 452, size: 960, align: 64, elements: !692)
!692 = !{!693, !710, !711, !712, !713, !714, !715, !719, !720, !721, !722, !723, !724, !727, !732}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !691, file: !171, line: 454, baseType: !694, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL_INFO", file: !171, line: 450, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_info_st", file: !171, line: 441, size: 640, align: 64, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !708, !709}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !696, file: !171, line: 442, baseType: !179, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "sig_alg", scope: !696, file: !171, line: 443, baseType: !189, size: 64, align: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !696, file: !171, line: 444, baseType: !271, size: 64, align: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "lastUpdate", scope: !696, file: !171, line: 445, baseType: !300, size: 64, align: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "nextUpdate", scope: !696, file: !171, line: 446, baseType: !300, size: 64, align: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "revoked", scope: !696, file: !171, line: 447, baseType: !704, size: 64, align: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64, align: 64)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_REVOKED", file: !171, line: 438, size: 256, align: 64, elements: !706)
!706 = !{!707}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !705, file: !171, line: 438, baseType: !96, size: 256, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !696, file: !171, line: 448, baseType: !597, size: 64, align: 64, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !696, file: !171, line: 449, baseType: !602, size: 192, align: 64, offset: 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "sig_alg", scope: !691, file: !171, line: 455, baseType: !189, size: 64, align: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !691, file: !171, line: 456, baseType: !229, size: 64, align: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !691, file: !171, line: 457, baseType: !26, size: 32, align: 32, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !691, file: !171, line: 458, baseType: !26, size: 32, align: 32, offset: 224)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "akid", scope: !691, file: !171, line: 460, baseType: !622, size: 64, align: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "idp", scope: !691, file: !171, line: 461, baseType: !716, size: 64, align: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64, align: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISSUING_DIST_POINT", file: !21, line: 188, baseType: !718)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "ISSUING_DIST_POINT_st", file: !21, line: 188, flags: DIFlagFwdDecl)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "idp_flags", scope: !691, file: !171, line: 463, baseType: !26, size: 32, align: 32, offset: 384)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "idp_reasons", scope: !691, file: !171, line: 464, baseType: !26, size: 32, align: 32, offset: 416)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "crl_number", scope: !691, file: !171, line: 466, baseType: !179, size: 64, align: 64, offset: 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "base_crl_number", scope: !691, file: !171, line: 467, baseType: !179, size: 64, align: 64, offset: 512)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "sha1_hash", scope: !691, file: !171, line: 469, baseType: !640, size: 160, align: 8, offset: 576)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "issuers", scope: !691, file: !171, line: 471, baseType: !725, size: 64, align: 64, offset: 768)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64, align: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_GENERAL_NAMES", file: !171, line: 471, flags: DIFlagFwdDecl)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !691, file: !171, line: 472, baseType: !728, size: 64, align: 64, offset: 832)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL_METHOD", file: !21, line: 157, baseType: !731)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "x509_crl_method_st", file: !21, line: 157, flags: DIFlagFwdDecl)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "meth_data", scope: !691, file: !171, line: 473, baseType: !50, size: 64, align: 64, offset: 896)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "check_crl", scope: !161, file: !115, line: 264, baseType: !734, size: 64, align: 64, offset: 832)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!26, !159, !689}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "cert_crl", scope: !161, file: !115, line: 266, baseType: !738, size: 64, align: 64, offset: 896)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, align: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!26, !159, !689, !168}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "check_policy", scope: !161, file: !115, line: 267, baseType: !156, size: 64, align: 64, offset: 960)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_certs", scope: !161, file: !115, line: 268, baseType: !743, size: 64, align: 64, offset: 1024)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64, align: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!658, !159, !271}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_crls", scope: !161, file: !115, line: 269, baseType: !747, size: 64, align: 64, offset: 1088)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64, align: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!663, !159, !271}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !161, file: !115, line: 270, baseType: !156, size: 64, align: 64, offset: 1152)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !161, file: !115, line: 273, baseType: !26, size: 32, align: 32, offset: 1216)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "last_untrusted", scope: !161, file: !115, line: 275, baseType: !26, size: 32, align: 32, offset: 1248)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !161, file: !115, line: 277, baseType: !658, size: 64, align: 64, offset: 1280)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !161, file: !115, line: 279, baseType: !755, size: 64, align: 64, offset: 1344)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_TREE", file: !21, line: 183, baseType: !757)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_TREE_st", file: !21, line: 183, flags: DIFlagFwdDecl)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_policy", scope: !161, file: !115, line: 281, baseType: !26, size: 32, align: 32, offset: 1408)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "error_depth", scope: !161, file: !115, line: 283, baseType: !26, size: 32, align: 32, offset: 1440)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !161, file: !115, line: 284, baseType: !26, size: 32, align: 32, offset: 1472)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "current_cert", scope: !161, file: !115, line: 285, baseType: !168, size: 64, align: 64, offset: 1536)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "current_issuer", scope: !161, file: !115, line: 287, baseType: !168, size: 64, align: 64, offset: 1600)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "current_crl", scope: !161, file: !115, line: 289, baseType: !689, size: 64, align: 64, offset: 1664)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "current_crl_score", scope: !161, file: !115, line: 291, baseType: !26, size: 32, align: 32, offset: 1728)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "current_reasons", scope: !161, file: !115, line: 293, baseType: !404, size: 32, align: 32, offset: 1760)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !161, file: !115, line: 295, baseType: !159, size: 64, align: 64, offset: 1792)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !161, file: !115, line: 296, baseType: !443, size: 128, align: 64, offset: 1856)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "verify_cb", scope: !114, file: !115, line: 197, baseType: !671, size: 64, align: 64, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "get_issuer", scope: !114, file: !115, line: 199, baseType: !675, size: 64, align: 64, offset: 384)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "check_issued", scope: !114, file: !115, line: 201, baseType: !680, size: 64, align: 64, offset: 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "check_revocation", scope: !114, file: !115, line: 203, baseType: !156, size: 64, align: 64, offset: 512)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "get_crl", scope: !114, file: !115, line: 205, baseType: !685, size: 64, align: 64, offset: 576)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "check_crl", scope: !114, file: !115, line: 207, baseType: !734, size: 64, align: 64, offset: 640)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "cert_crl", scope: !114, file: !115, line: 209, baseType: !738, size: 64, align: 64, offset: 704)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_certs", scope: !114, file: !115, line: 210, baseType: !743, size: 64, align: 64, offset: 768)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "lookup_crls", scope: !114, file: !115, line: 211, baseType: !747, size: 64, align: 64, offset: 832)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !114, file: !115, line: 212, baseType: !156, size: 64, align: 64, offset: 896)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !114, file: !115, line: 213, baseType: !443, size: 128, align: 64, offset: 960)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !114, file: !115, line: 214, baseType: !26, size: 32, align: 32, offset: 1088)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "sessions", scope: !88, file: !23, line: 931, baseType: !781, size: 64, align: 64, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64, align: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lhash_st_SSL_SESSION", file: !23, line: 923, size: 32, align: 32, elements: !783)
!783 = !{!784}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !782, file: !23, line: 923, baseType: !26, size: 32, align: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "session_cache_size", scope: !88, file: !23, line: 936, baseType: !140, size: 64, align: 64, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "session_cache_head", scope: !88, file: !23, line: 937, baseType: !787, size: 64, align: 64, offset: 384)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64, align: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_session_st", file: !23, line: 498, size: 2816, align: 64, elements: !789)
!789 = !{!790, !791, !792, !796, !797, !801, !802, !806, !807, !808, !809, !810, !811, !814, !815, !816, !817, !818, !819, !820, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_version", scope: !788, file: !23, line: 499, baseType: !26, size: 32, align: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "key_arg_length", scope: !788, file: !23, line: 502, baseType: !404, size: 32, align: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "key_arg", scope: !788, file: !23, line: 503, baseType: !793, size: 64, align: 8, offset: 64)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 64, align: 8, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 8)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "master_key_length", scope: !788, file: !23, line: 504, baseType: !26, size: 32, align: 32, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "master_key", scope: !788, file: !23, line: 505, baseType: !798, size: 384, align: 8, offset: 160)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 384, align: 8, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 48)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "session_id_length", scope: !788, file: !23, line: 507, baseType: !404, size: 32, align: 32, offset: 544)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "session_id", scope: !788, file: !23, line: 508, baseType: !803, size: 256, align: 8, offset: 576)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 256, align: 8, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "sid_ctx_length", scope: !788, file: !23, line: 514, baseType: !404, size: 32, align: 32, offset: 832)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "sid_ctx", scope: !788, file: !23, line: 515, baseType: !803, size: 256, align: 8, offset: 864)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "psk_identity_hint", scope: !788, file: !23, line: 521, baseType: !103, size: 64, align: 64, offset: 1152)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "psk_identity", scope: !788, file: !23, line: 522, baseType: !103, size: 64, align: 64, offset: 1216)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "not_resumable", scope: !788, file: !23, line: 529, baseType: !26, size: 32, align: 32, offset: 1280)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "sess_cert", scope: !788, file: !23, line: 531, baseType: !812, size: 64, align: 64, offset: 1344)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64, align: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "sess_cert_st", file: !23, line: 531, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !788, file: !23, line: 538, baseType: !168, size: 64, align: 64, offset: 1408)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "verify_result", scope: !788, file: !23, line: 543, baseType: !65, size: 64, align: 64, offset: 1472)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !788, file: !23, line: 544, baseType: !26, size: 32, align: 32, offset: 1536)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !788, file: !23, line: 545, baseType: !65, size: 64, align: 64, offset: 1600)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !788, file: !23, line: 546, baseType: !65, size: 64, align: 64, offset: 1664)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "compress_meth", scope: !788, file: !23, line: 547, baseType: !404, size: 32, align: 32, offset: 1728)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !788, file: !23, line: 548, baseType: !821, size: 64, align: 64, offset: 1792)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CIPHER", file: !23, line: 375, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_cipher_st", file: !23, line: 418, size: 704, align: 64, elements: !825)
!825 = !{!826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !824, file: !23, line: 419, baseType: !26, size: 32, align: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !824, file: !23, line: 420, baseType: !199, size: 64, align: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !824, file: !23, line: 421, baseType: !140, size: 64, align: 64, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_mkey", scope: !824, file: !23, line: 426, baseType: !140, size: 64, align: 64, offset: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_auth", scope: !824, file: !23, line: 427, baseType: !140, size: 64, align: 64, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_enc", scope: !824, file: !23, line: 428, baseType: !140, size: 64, align: 64, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_mac", scope: !824, file: !23, line: 429, baseType: !140, size: 64, align: 64, offset: 384)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_ssl", scope: !824, file: !23, line: 430, baseType: !140, size: 64, align: 64, offset: 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "algo_strength", scope: !824, file: !23, line: 431, baseType: !140, size: 64, align: 64, offset: 512)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm2", scope: !824, file: !23, line: 432, baseType: !140, size: 64, align: 64, offset: 576)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "strength_bits", scope: !824, file: !23, line: 433, baseType: !26, size: 32, align: 32, offset: 640)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "alg_bits", scope: !824, file: !23, line: 434, baseType: !26, size: 32, align: 32, offset: 672)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_id", scope: !788, file: !23, line: 549, baseType: !140, size: 64, align: 64, offset: 1856)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ciphers", scope: !788, file: !23, line: 551, baseType: !92, size: 64, align: 64, offset: 1920)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !788, file: !23, line: 552, baseType: !443, size: 128, align: 64, offset: 1984)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !788, file: !23, line: 557, baseType: !787, size: 64, align: 64, offset: 2112)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !788, file: !23, line: 557, baseType: !787, size: 64, align: 64, offset: 2176)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "tlsext_hostname", scope: !788, file: !23, line: 559, baseType: !103, size: 64, align: 64, offset: 2240)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "tlsext_ecpointformatlist_length", scope: !788, file: !23, line: 561, baseType: !288, size: 64, align: 64, offset: 2304)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "tlsext_ecpointformatlist", scope: !788, file: !23, line: 562, baseType: !71, size: 64, align: 64, offset: 2368)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "tlsext_ellipticcurvelist_length", scope: !788, file: !23, line: 563, baseType: !288, size: 64, align: 64, offset: 2432)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "tlsext_ellipticcurvelist", scope: !788, file: !23, line: 564, baseType: !71, size: 64, align: 64, offset: 2496)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "tlsext_tick", scope: !788, file: !23, line: 567, baseType: !71, size: 64, align: 64, offset: 2560)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "tlsext_ticklen", scope: !788, file: !23, line: 568, baseType: !288, size: 64, align: 64, offset: 2624)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tlsext_tick_lifetime_hint", scope: !788, file: !23, line: 569, baseType: !65, size: 64, align: 64, offset: 2688)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "srp_username", scope: !788, file: !23, line: 572, baseType: !103, size: 64, align: 64, offset: 2752)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "session_cache_tail", scope: !88, file: !23, line: 938, baseType: !787, size: 64, align: 64, offset: 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "session_cache_mode", scope: !88, file: !23, line: 944, baseType: !26, size: 32, align: 32, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "session_timeout", scope: !88, file: !23, line: 950, baseType: !65, size: 64, align: 64, offset: 576)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "new_session_cb", scope: !88, file: !23, line: 960, baseType: !856, size: 64, align: 64, offset: 640)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64, align: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!26, !859, !860}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64, align: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_SESSION", file: !23, line: 376, baseType: !788)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "remove_session_cb", scope: !88, file: !23, line: 961, baseType: !863, size: 64, align: 64, offset: 704)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64, align: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{null, !866, !860}
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "get_session_cb", scope: !88, file: !23, line: 962, baseType: !868, size: 64, align: 64, offset: 768)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64, align: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!860, !859, !71, !26, !66}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !88, file: !23, line: 980, baseType: !872, size: 352, align: 32, offset: 832)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !88, file: !23, line: 964, size: 352, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "sess_connect", scope: !872, file: !23, line: 965, baseType: !26, size: 32, align: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "sess_connect_renegotiate", scope: !872, file: !23, line: 966, baseType: !26, size: 32, align: 32, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "sess_connect_good", scope: !872, file: !23, line: 967, baseType: !26, size: 32, align: 32, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "sess_accept", scope: !872, file: !23, line: 968, baseType: !26, size: 32, align: 32, offset: 96)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "sess_accept_renegotiate", scope: !872, file: !23, line: 969, baseType: !26, size: 32, align: 32, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "sess_accept_good", scope: !872, file: !23, line: 970, baseType: !26, size: 32, align: 32, offset: 160)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "sess_miss", scope: !872, file: !23, line: 971, baseType: !26, size: 32, align: 32, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "sess_timeout", scope: !872, file: !23, line: 972, baseType: !26, size: 32, align: 32, offset: 224)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "sess_cache_full", scope: !872, file: !23, line: 973, baseType: !26, size: 32, align: 32, offset: 256)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "sess_hit", scope: !872, file: !23, line: 974, baseType: !26, size: 32, align: 32, offset: 288)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "sess_cb_hit", scope: !872, file: !23, line: 975, baseType: !26, size: 32, align: 32, offset: 320)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !88, file: !23, line: 982, baseType: !26, size: 32, align: 32, offset: 1184)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "app_verify_callback", scope: !88, file: !23, line: 985, baseType: !887, size: 64, align: 64, offset: 1216)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64, align: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!26, !159, !50}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "app_verify_arg", scope: !88, file: !23, line: 986, baseType: !50, size: 64, align: 64, offset: 1280)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "default_passwd_callback", scope: !88, file: !23, line: 993, baseType: !892, size: 64, align: 64, offset: 1344)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "pem_password_cb", file: !894, line: 389, baseType: !895)
!894 = !DIFile(filename: "/usr/include/openssl/pem.h", directory: "/home/lichi/Desktop/open-vm-tools/line76")
!895 = !DISubroutineType(types: !896)
