; ModuleID = './ulExcl.o.i'
source_filename = "./ulExcl.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.MXUserExclLock = type { %struct.MXUserHeader, %struct.MXRecLock, %struct.Atomic_uint64, %struct.Atomic_uint64 }
%struct.MXUserHeader = type { i32, i8*, i32, %struct.anon, void (%struct.MXUserHeader*)*, void (%struct.MXUserHeader*)*, %struct.ListItem }
%struct.anon = type { i32 }
%struct.ListItem = type { %struct.ListItem*, %struct.ListItem* }
%struct.MXRecLock = type { %union.pthread_mutex_t, i32, i64 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.Atomic_uint64 = type { i64 }
%struct.MXUserHeldStats = type { i64, %struct.MXUserBasicStats, %struct.Atomic_uint64 }
%struct.MXUserBasicStats = type { i8*, i64, i64, i64, i64, double }
%struct.MXUserAcquireStats = type { %struct.MXUserAcquisitionStats, %struct.Atomic_uint64 }
%struct.MXUserAcquisitionStats = type { double, i64, i64, i64, i64, i64, i64, i64, %struct.MXUserBasicStats }
%struct.MXUserHisto = type opaque
%struct.MXUserCondVar = type opaque
%union.pthread_mutexattr_t = type { i32 }

@.str = private unnamed_addr constant [5 x i8] c"X-%p\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15)
!1 = !DIFile(filename: "ulExcl.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line489")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 440, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "ulInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line489")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "MXUSER_TYPE_NEVER_USE", value: 0)
!7 = !DIEnumerator(name: "MXUSER_TYPE_RW", value: 1)
!8 = !DIEnumerator(name: "MXUSER_TYPE_REC", value: 2)
!9 = !DIEnumerator(name: "MXUSER_TYPE_RANK", value: 3)
!10 = !DIEnumerator(name: "MXUSER_TYPE_EXCL", value: 4)
!11 = !DIEnumerator(name: "MXUSER_TYPE_SEMA", value: 5)
!12 = !DIEnumerator(name: "MXUSER_TYPE_CONDVAR", value: 6)
!13 = !DIEnumerator(name: "MXUSER_TYPE_BARRIER", value: 7)
!14 = !DIEnumerator(name: "MXUSER_TYPE_EVENT", value: 8)
!15 = !{!16, !17, !107, !104}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserExclLock", file: !19, line: 38, baseType: !20)
!19 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/userlock.h", directory: "/home/lichi/Desktop/open-vm-tools/line489")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserExclLock", file: !21, line: 26, size: 1024, align: 64, elements: !22)
!21 = !DIFile(filename: "ulExcl.c", directory: "/home/lichi/Desktop/open-vm-tools/line489")
!22 = !{!23, !57, !96, !106}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !20, file: !21, line: 28, baseType: !24, size: 448, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserHeader", file: !4, line: 469, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserHeader", file: !4, line: 456, size: 448, align: 64, elements: !26)
!26 = !{!27, !33, !36, !38, !43, !48, !49}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !25, file: !4, line: 457, baseType: !28, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !29, line: 173, baseType: !30)
!29 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line489")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !31, line: 51, baseType: !32)
!31 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line489")
!32 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !25, file: !4, line: 458, baseType: !34, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !25, file: !4, line: 459, baseType: !37, size: 32, align: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "MX_Rank", file: !29, line: 1167, baseType: !28)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !25, file: !4, line: 464, baseType: !39, size: 32, align: 32, offset: 160)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !25, file: !4, line: 461, size: 32, align: 32, elements: !40)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !39, file: !4, line: 462, baseType: !32, size: 24, align: 32, flags: DIFlagBitField, extraData: i64 0)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "badHeader", scope: !39, file: !4, line: 463, baseType: !32, size: 1, align: 32, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "dumpFunc", scope: !25, file: !4, line: 466, baseType: !44, size: 64, align: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "statsFunc", scope: !25, file: !4, line: 467, baseType: !44, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !25, file: !4, line: 468, baseType: !50, size: 128, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem", file: !51, line: 45, baseType: !52)
!51 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/circList.h", directory: "/home/lichi/Desktop/open-vm-tools/line489")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListItem", file: !51, line: 42, size: 128, align: 64, elements: !53)
!53 = !{!54, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !52, file: !51, line: 43, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !51, line: 44, baseType: !55, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "recursiveLock", scope: !20, file: !21, line: 29, baseType: !58, size: 448, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXRecLock", file: !4, line: 67, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 58, size: 448, align: 64, elements: !60)
!60 = !{!61, !91, !92}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "nativeLock", scope: !59, file: !4, line: 62, baseType: !62, size: 320, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !63, line: 128, baseType: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line489")
!64 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !63, line: 90, size: 320, align: 64, elements: !65)
!65 = !{!66, !85, !89}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !64, file: !63, line: 125, baseType: !67, size: 320, align: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !63, line: 92, size: 320, align: 64, elements: !68)
!68 = !{!69, !71, !72, !73, !74, !75, !77, !78}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !67, file: !63, line: 94, baseType: !70, size: 32, align: 32)
!70 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !67, file: !63, line: 95, baseType: !32, size: 32, align: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !67, file: !63, line: 96, baseType: !70, size: 32, align: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !67, file: !63, line: 98, baseType: !32, size: 32, align: 32, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !67, file: !63, line: 102, baseType: !70, size: 32, align: 32, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !67, file: !63, line: 104, baseType: !76, size: 16, align: 16, offset: 160)
!76 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !67, file: !63, line: 105, baseType: !76, size: 16, align: 16, offset: 176)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !67, file: !63, line: 106, baseType: !79, size: 128, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !63, line: 79, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !63, line: 75, size: 128, align: 64, elements: !81)
!81 = !{!82, !84}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !80, file: !63, line: 77, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !80, file: !63, line: 78, baseType: !83, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !64, file: !63, line: 126, baseType: !86, size: 320, align: 8)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 320, align: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 40)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !64, file: !63, line: 127, baseType: !90, size: 64, align: 64)
!90 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "referenceCount", scope: !59, file: !4, line: 65, baseType: !70, size: 32, align: 32, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "nativeThreadID", scope: !59, file: !4, line: 66, baseType: !93, size: 64, align: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserThreadID", file: !4, line: 39, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !63, line: 60, baseType: !95)
!95 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "heldStatsMem", scope: !20, file: !21, line: 30, baseType: !97, size: 64, align: 64, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_Ptr", file: !98, line: 3829, baseType: !99)
!98 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_atomic.h", directory: "/home/lichi/Desktop/open-vm-tools/line489")
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint64", file: !98, line: 139, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint64", file: !98, line: 137, size: 64, align: 64, elements: !101)
!101 = !{!102}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !100, file: !98, line: 138, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !29, line: 171, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !31, line: 55, baseType: !95)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "acquireStatsMem", scope: !20, file: !21, line: 31, baseType: !97, size: 64, align: 64, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !31, line: 122, baseType: !95)
!108 = !{i32 2, !"Dwarf Version", i32 4}
!109 = !{i32 2, !"Debug Info Version", i32 3}
!110 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!111 = distinct !DISubprogram(name: "MXUser_EnableStatsExclLock", scope: !21, file: !21, line: 125, type: !112, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !115)
!112 = !DISubroutineType(types: !113)
!113 = !{!114, !17, !114, !114}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !29, line: 230, baseType: !35)
!115 = !{}
!116 = !DILocalVariable(name: "lock", arg: 1, scope: !111, file: !21, line: 125, type: !17)
!117 = !DIExpression()
!118 = !DILocation(line: 125, column: 44, scope: !111)
!119 = !DILocalVariable(name: "trackAcquisitionTime", arg: 2, scope: !111, file: !21, line: 126, type: !114)
!120 = !DILocation(line: 126, column: 33, scope: !111)
!121 = !DILocalVariable(name: "trackHeldTime", arg: 3, scope: !111, file: !21, line: 127, type: !114)
!122 = !DILocation(line: 127, column: 33, scope: !111)
!123 = !DILocation(line: 130, column: 26, scope: !111)
!124 = !DILocation(line: 130, column: 32, scope: !111)
!125 = !DILocation(line: 130, column: 4, scope: !111)
!126 = !DILocation(line: 137, column: 4, scope: !111)
!127 = distinct !DISubprogram(name: "MXUserValidateHeader", scope: !4, file: !4, line: 507, type: !128, isLocal: true, isDefinition: true, scopeLine: 509, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !115)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !130, !131}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserObjectType", file: !4, line: 450, baseType: !3)
!132 = !DILocalVariable(name: "header", arg: 1, scope: !127, file: !4, line: 507, type: !130)
!133 = !DILocation(line: 507, column: 36, scope: !127)
!134 = !DILocalVariable(name: "objectType", arg: 2, scope: !127, file: !4, line: 508, type: !131)
!135 = !DILocation(line: 508, column: 39, scope: !127)
!136 = !DILocation(line: 510, column: 4, scope: !127)
!137 = distinct !DISubprogram(name: "MXUser_DisableStatsExclLock", scope: !21, file: !21, line: 159, type: !138, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !115)
!138 = !DISubroutineType(types: !139)
!139 = !{!114, !17}
!140 = !DILocalVariable(name: "lock", arg: 1, scope: !137, file: !21, line: 159, type: !17)
!141 = !DILocation(line: 159, column: 45, scope: !137)
!142 = !DILocation(line: 162, column: 26, scope: !137)
!143 = !DILocation(line: 162, column: 32, scope: !137)
!144 = !DILocation(line: 162, column: 4, scope: !137)
!145 = !DILocation(line: 168, column: 4, scope: !137)
!146 = distinct !DISubprogram(name: "MXUser_SetContentionRatioFloorExclLock", scope: !21, file: !21, line: 190, type: !147, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !115)
!147 = !DISubroutineType(types: !148)
!148 = !{!114, !17, !149}
!149 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!150 = !DILocalVariable(name: "lock", arg: 1, scope: !146, file: !21, line: 190, type: !17)
!151 = !DILocation(line: 190, column: 56, scope: !146)
!152 = !DILocalVariable(name: "ratio", arg: 2, scope: !146, file: !21, line: 191, type: !149)
!153 = !DILocation(line: 191, column: 47, scope: !146)
!154 = !DILocalVariable(name: "result", scope: !146, file: !21, line: 193, type: !114)
!155 = !DILocation(line: 193, column: 9, scope: !146)
!156 = !DILocation(line: 196, column: 26, scope: !146)
!157 = !DILocation(line: 196, column: 32, scope: !146)
!158 = !DILocation(line: 196, column: 4, scope: !146)
!159 = !DILocation(line: 201, column: 14, scope: !160)
!160 = distinct !DILexicalBlock(scope: !161, file: !21, line: 200, column: 11)
!161 = distinct !DILexicalBlock(scope: !146, file: !21, line: 198, column: 8)
!162 = !DILocation(line: 204, column: 11, scope: !146)
!163 = !DILocation(line: 204, column: 4, scope: !146)
!164 = distinct !DISubprogram(name: "MXUser_SetContentionCountFloorExclLock", scope: !21, file: !21, line: 226, type: !165, isLocal: false, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !115)
!165 = !DISubroutineType(types: !166)
!166 = !{!114, !17, !104}
!167 = !DILocalVariable(name: "lock", arg: 1, scope: !164, file: !21, line: 226, type: !17)
!168 = !DILocation(line: 226, column: 56, scope: !164)
!169 = !DILocalVariable(name: "count", arg: 2, scope: !164, file: !21, line: 227, type: !104)
!170 = !DILocation(line: 227, column: 47, scope: !164)
!171 = !DILocalVariable(name: "result", scope: !164, file: !21, line: 229, type: !114)
!172 = !DILocation(line: 229, column: 9, scope: !164)
!173 = !DILocation(line: 232, column: 26, scope: !164)
!174 = !DILocation(line: 232, column: 32, scope: !164)
!175 = !DILocation(line: 232, column: 4, scope: !164)
!176 = !DILocation(line: 237, column: 14, scope: !177)
!177 = distinct !DILexicalBlock(scope: !178, file: !21, line: 236, column: 11)
!178 = distinct !DILexicalBlock(scope: !164, file: !21, line: 234, column: 8)
!179 = !DILocation(line: 240, column: 11, scope: !164)
!180 = !DILocation(line: 240, column: 4, scope: !164)
!181 = distinct !DISubprogram(name: "MXUser_SetContentionDurationFloorExclLock", scope: !21, file: !21, line: 262, type: !165, isLocal: false, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !115)
!182 = !DILocalVariable(name: "lock", arg: 1, scope: !181, file: !21, line: 262, type: !17)
!183 = !DILocation(line: 262, column: 59, scope: !181)
!184 = !DILocalVariable(name: "duration", arg: 2, scope: !181, file: !21, line: 263, type: !104)
!185 = !DILocation(line: 263, column: 50, scope: !181)
!186 = !DILocalVariable(name: "result", scope: !181, file: !21, line: 265, type: !114)
!187 = !DILocation(line: 265, column: 9, scope: !181)
!188 = !DILocation(line: 268, column: 26, scope: !181)
!189 = !DILocation(line: 268, column: 32, scope: !181)
!190 = !DILocation(line: 268, column: 4, scope: !181)
!191 = !DILocation(line: 274, column: 14, scope: !192)
!192 = distinct !DILexicalBlock(scope: !193, file: !21, line: 273, column: 11)
!193 = distinct !DILexicalBlock(scope: !181, file: !21, line: 270, column: 8)
!194 = !DILocation(line: 277, column: 11, scope: !181)
!195 = !DILocation(line: 277, column: 4, scope: !181)
!196 = distinct !DISubprogram(name: "MXUser_CreateExclLock", scope: !21, file: !21, line: 333, type: !197, isLocal: false, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !115)
!197 = !DISubroutineType(types: !198)
!198 = !{!17, !199, !37}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!201 = !DILocalVariable(name: "userName", arg: 1, scope: !196, file: !21, line: 333, type: !199)
!202 = !DILocation(line: 333, column: 35, scope: !196)
!203 = !DILocalVariable(name: "rank", arg: 2, scope: !196, file: !21, line: 334, type: !37)
!204 = !DILocation(line: 334, column: 31, scope: !196)
!205 = !DILocalVariable(name: "statsMode", scope: !196, file: !21, line: 336, type: !28)
!206 = !DILocation(line: 336, column: 11, scope: !196)
!207 = !DILocalVariable(name: "properName", scope: !196, file: !21, line: 337, type: !34)
!208 = !DILocation(line: 337, column: 10, scope: !196)
!209 = !DILocalVariable(name: "lock", scope: !196, file: !21, line: 338, type: !17)
!210 = !DILocation(line: 338, column: 20, scope: !196)
!211 = !DILocation(line: 338, column: 27, scope: !196)
!212 = !DILocation(line: 340, column: 8, scope: !213)
!213 = distinct !DILexicalBlock(scope: !196, file: !21, line: 340, column: 8)
!214 = !DILocation(line: 340, column: 17, scope: !213)
!215 = !DILocation(line: 340, column: 8, scope: !196)
!216 = !DILocation(line: 341, column: 50, scope: !217)
!217 = distinct !DILexicalBlock(scope: !213, file: !21, line: 340, column: 25)
!218 = !DILocation(line: 341, column: 20, scope: !219)
!219 = !DILexicalBlockFile(scope: !217, file: !21, discriminator: 1)
!220 = !DILocation(line: 341, column: 18, scope: !217)
!221 = !DILocation(line: 342, column: 4, scope: !217)
!222 = !DILocation(line: 343, column: 37, scope: !223)
!223 = distinct !DILexicalBlock(scope: !213, file: !21, line: 342, column: 11)
!224 = !DILocation(line: 343, column: 20, scope: !223)
!225 = !DILocation(line: 343, column: 18, scope: !223)
!226 = !DILocation(line: 346, column: 42, scope: !227)
!227 = distinct !DILexicalBlock(scope: !196, file: !21, line: 346, column: 8)
!228 = !DILocation(line: 346, column: 48, scope: !227)
!229 = !DILocation(line: 346, column: 27, scope: !227)
!230 = !DILocation(line: 346, column: 26, scope: !227)
!231 = !DILocation(line: 346, column: 25, scope: !227)
!232 = !DILocation(line: 346, column: 8, scope: !227)
!233 = !DILocation(line: 346, column: 8, scope: !196)
!234 = !DILocation(line: 347, column: 7, scope: !235)
!235 = distinct !DILexicalBlock(scope: !227, file: !21, line: 346, column: 69)
!236 = !DILocation(line: 350, column: 29, scope: !196)
!237 = !DILocation(line: 350, column: 4, scope: !196)
!238 = !DILocation(line: 350, column: 10, scope: !196)
!239 = !DILocation(line: 350, column: 17, scope: !196)
!240 = !DILocation(line: 350, column: 27, scope: !196)
!241 = !DILocation(line: 351, column: 24, scope: !196)
!242 = !DILocation(line: 351, column: 4, scope: !196)
!243 = !DILocation(line: 351, column: 10, scope: !196)
!244 = !DILocation(line: 351, column: 17, scope: !196)
!245 = !DILocation(line: 351, column: 22, scope: !196)
!246 = !DILocation(line: 352, column: 24, scope: !196)
!247 = !DILocation(line: 352, column: 4, scope: !196)
!248 = !DILocation(line: 352, column: 10, scope: !196)
!249 = !DILocation(line: 352, column: 17, scope: !196)
!250 = !DILocation(line: 352, column: 22, scope: !196)
!251 = !DILocation(line: 353, column: 37, scope: !196)
!252 = !DILocation(line: 353, column: 4, scope: !196)
!253 = !DILocation(line: 353, column: 10, scope: !196)
!254 = !DILocation(line: 353, column: 17, scope: !196)
!255 = !DILocation(line: 353, column: 22, scope: !196)
!256 = !DILocation(line: 353, column: 35, scope: !196)
!257 = !DILocation(line: 354, column: 4, scope: !196)
!258 = !DILocation(line: 354, column: 10, scope: !196)
!259 = !DILocation(line: 354, column: 17, scope: !196)
!260 = !DILocation(line: 354, column: 26, scope: !196)
!261 = !DILocation(line: 356, column: 16, scope: !196)
!262 = !DILocation(line: 356, column: 14, scope: !196)
!263 = !DILocation(line: 358, column: 12, scope: !196)
!264 = !DILocation(line: 358, column: 4, scope: !196)
!265 = !DILocation(line: 360, column: 27, scope: !266)
!266 = distinct !DILexicalBlock(scope: !196, file: !21, line: 358, column: 31)
!267 = !DILocation(line: 360, column: 33, scope: !266)
!268 = !DILocation(line: 360, column: 51, scope: !266)
!269 = !DILocation(line: 360, column: 57, scope: !266)
!270 = !DILocation(line: 360, column: 7, scope: !266)
!271 = !DILocation(line: 361, column: 7, scope: !266)
!272 = !DILocation(line: 361, column: 13, scope: !266)
!273 = !DILocation(line: 361, column: 20, scope: !266)
!274 = !DILocation(line: 361, column: 30, scope: !266)
!275 = !DILocation(line: 362, column: 7, scope: !266)
!276 = !DILocation(line: 365, column: 26, scope: !266)
!277 = !DILocation(line: 365, column: 32, scope: !266)
!278 = !DILocation(line: 365, column: 7, scope: !266)
!279 = !DILocation(line: 366, column: 7, scope: !266)
!280 = !DILocation(line: 366, column: 13, scope: !266)
!281 = !DILocation(line: 366, column: 20, scope: !266)
!282 = !DILocation(line: 366, column: 30, scope: !266)
!283 = !DILocation(line: 367, column: 7, scope: !266)
!284 = !DILocation(line: 370, column: 26, scope: !266)
!285 = !DILocation(line: 370, column: 32, scope: !266)
!286 = !DILocation(line: 370, column: 50, scope: !266)
!287 = !DILocation(line: 370, column: 56, scope: !266)
!288 = !DILocation(line: 370, column: 7, scope: !266)
!289 = !DILocation(line: 371, column: 7, scope: !266)
!290 = !DILocation(line: 371, column: 13, scope: !266)
!291 = !DILocation(line: 371, column: 20, scope: !266)
!292 = !DILocation(line: 371, column: 30, scope: !266)
!293 = !DILocation(line: 372, column: 7, scope: !266)
!294 = !DILocation(line: 375, column: 60, scope: !266)
!295 = !DILocation(line: 375, column: 7, scope: !266)
!296 = !DILocation(line: 378, column: 21, scope: !196)
!297 = !DILocation(line: 378, column: 27, scope: !196)
!298 = !DILocation(line: 378, column: 4, scope: !196)
!299 = !DILocation(line: 380, column: 11, scope: !196)
!300 = !DILocation(line: 380, column: 4, scope: !196)
!301 = distinct !DISubprogram(name: "MXRecLockInit", scope: !4, file: !4, line: 264, type: !302, isLocal: true, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !115)
!302 = !DISubroutineType(types: !303)
!303 = !{!114, !304}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!305 = !DILocalVariable(name: "lock", arg: 1, scope: !301, file: !4, line: 264, type: !304)
!306 = !DILocation(line: 264, column: 26, scope: !301)
!307 = !DILocalVariable(name: "success", scope: !301, file: !4, line: 266, type: !114)
!308 = !DILocation(line: 266, column: 9, scope: !301)
!309 = !DILocation(line: 266, column: 44, scope: !301)
!310 = !DILocation(line: 266, column: 20, scope: !301)
!311 = !DILocation(line: 266, column: 50, scope: !301)
!312 = !DILocation(line: 266, column: 19, scope: !301)
!313 = !DILocation(line: 268, column: 8, scope: !314)
!314 = distinct !DILexicalBlock(scope: !301, file: !4, line: 268, column: 8)
!315 = !DILocation(line: 268, column: 8, scope: !301)
!316 = !DILocation(line: 269, column: 27, scope: !317)
!317 = distinct !DILexicalBlock(scope: !314, file: !4, line: 268, column: 17)
!318 = !DILocation(line: 269, column: 7, scope: !317)
!319 = !DILocation(line: 271, column: 7, scope: !317)
!320 = !DILocation(line: 271, column: 13, scope: !317)
!321 = !DILocation(line: 271, column: 28, scope: !317)
!322 = !DILocation(line: 272, column: 4, scope: !317)
!323 = !DILocation(line: 274, column: 11, scope: !301)
!324 = !DILocation(line: 274, column: 4, scope: !301)
!325 = distinct !DISubprogram(name: "MXUserDumpExclLock", scope: !21, file: !21, line: 298, type: !326, isLocal: true, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !115)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !130}
!328 = !DILocalVariable(name: "header", arg: 1, scope: !325, file: !21, line: 298, type: !130)
!329 = !DILocation(line: 298, column: 34, scope: !325)
!330 = !DILocalVariable(name: "lock", scope: !325, file: !21, line: 300, type: !17)
!331 = !DILocation(line: 300, column: 20, scope: !325)
!332 = !DILocation(line: 300, column: 46, scope: !325)
!333 = !DILocation(line: 300, column: 27, scope: !325)
!334 = !DILocation(line: 302, column: 55, scope: !325)
!335 = !DILocation(line: 302, column: 4, scope: !325)
!336 = !DILocation(line: 304, column: 34, scope: !325)
!337 = !DILocation(line: 304, column: 40, scope: !325)
!338 = !DILocation(line: 304, column: 47, scope: !325)
!339 = !DILocation(line: 304, column: 4, scope: !325)
!340 = !DILocation(line: 305, column: 27, scope: !325)
!341 = !DILocation(line: 305, column: 33, scope: !325)
!342 = !DILocation(line: 305, column: 40, scope: !325)
!343 = !DILocation(line: 305, column: 4, scope: !325)
!344 = !DILocation(line: 306, column: 29, scope: !325)
!345 = !DILocation(line: 306, column: 35, scope: !325)
!346 = !DILocation(line: 306, column: 42, scope: !325)
!347 = !DILocation(line: 306, column: 4, scope: !325)
!348 = !DILocation(line: 307, column: 36, scope: !325)
!349 = !DILocation(line: 307, column: 42, scope: !325)
!350 = !DILocation(line: 307, column: 49, scope: !325)
!351 = !DILocation(line: 307, column: 54, scope: !325)
!352 = !DILocation(line: 307, column: 4, scope: !325)
!353 = !DILocation(line: 309, column: 49, scope: !325)
!354 = !DILocation(line: 309, column: 55, scope: !325)
!355 = !DILocation(line: 309, column: 33, scope: !325)
!356 = !DILocation(line: 309, column: 4, scope: !357)
!357 = !DILexicalBlockFile(scope: !325, file: !21, discriminator: 1)
!358 = !DILocation(line: 312, column: 13, scope: !325)
!359 = !DILocation(line: 312, column: 19, scope: !325)
!360 = !DILocation(line: 312, column: 33, scope: !325)
!361 = !DILocation(line: 311, column: 4, scope: !325)
!362 = !DILocation(line: 313, column: 1, scope: !325)
!363 = distinct !DISubprogram(name: "MXUserStatsActionExcl", scope: !21, file: !21, line: 52, type: !326, isLocal: true, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !115)
!364 = !DILocalVariable(name: "header", arg: 1, scope: !363, file: !21, line: 52, type: !130)
!365 = !DILocation(line: 52, column: 37, scope: !363)
!366 = !DILocalVariable(name: "lock", scope: !363, file: !21, line: 54, type: !17)
!367 = !DILocation(line: 54, column: 20, scope: !363)
!368 = !DILocation(line: 54, column: 46, scope: !363)
!369 = !DILocation(line: 54, column: 27, scope: !363)
!370 = !DILocalVariable(name: "heldStats", scope: !363, file: !21, line: 55, type: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserHeldStats", file: !4, line: 569, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 564, size: 512, align: 64, elements: !374)
!374 = !{!375, !379, !389}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "holdStart", scope: !373, file: !4, line: 566, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmTimeType", file: !29, line: 354, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !29, line: 172, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !31, line: 40, baseType: !90)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !373, file: !4, line: 567, baseType: !380, size: 384, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserBasicStats", file: !4, line: 539, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 532, size: 384, align: 64, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "typeName", scope: !381, file: !4, line: 533, baseType: !34, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "numSamples", scope: !381, file: !4, line: 534, baseType: !104, size: 64, align: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "minTime", scope: !381, file: !4, line: 535, baseType: !104, size: 64, align: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "maxTime", scope: !381, file: !4, line: 536, baseType: !104, size: 64, align: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "timeSum", scope: !381, file: !4, line: 537, baseType: !104, size: 64, align: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "timeSquaredSum", scope: !381, file: !4, line: 538, baseType: !149, size: 64, align: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "histo", scope: !373, file: !4, line: 568, baseType: !97, size: 64, align: 64, offset: 448)
!390 = !DILocation(line: 55, column: 21, scope: !363)
!391 = !DILocation(line: 55, column: 49, scope: !363)
!392 = !DILocation(line: 55, column: 55, scope: !363)
!393 = !DILocation(line: 55, column: 33, scope: !363)
!394 = !DILocalVariable(name: "acquireStats", scope: !363, file: !21, line: 56, type: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserAcquireStats", file: !4, line: 562, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 558, size: 960, align: 64, elements: !398)
!398 = !{!399, !412}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !397, file: !4, line: 560, baseType: !400, size: 896, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserAcquisitionStats", file: !4, line: 552, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 541, size: 896, align: 64, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408, !409, !410, !411}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "contentionRatioFloor", scope: !401, file: !4, line: 542, baseType: !149, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "contentionCountFloor", scope: !401, file: !4, line: 543, baseType: !104, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "contentionDurationFloor", scope: !401, file: !4, line: 544, baseType: !104, size: 64, align: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "numAttempts", scope: !401, file: !4, line: 545, baseType: !104, size: 64, align: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "numSuccesses", scope: !401, file: !4, line: 546, baseType: !104, size: 64, align: 64, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "numSuccessesContended", scope: !401, file: !4, line: 547, baseType: !104, size: 64, align: 64, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "successContentionTime", scope: !401, file: !4, line: 548, baseType: !104, size: 64, align: 64, offset: 384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "totalContentionTime", scope: !401, file: !4, line: 549, baseType: !104, size: 64, align: 64, offset: 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "basicStats", scope: !401, file: !4, line: 551, baseType: !380, size: 384, align: 64, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "histo", scope: !397, file: !4, line: 561, baseType: !97, size: 64, align: 64, offset: 896)
!413 = !DILocation(line: 56, column: 24, scope: !363)
!414 = !DILocation(line: 56, column: 55, scope: !363)
!415 = !DILocation(line: 56, column: 61, scope: !363)
!416 = !DILocation(line: 56, column: 39, scope: !363)
!417 = !DILocation(line: 58, column: 26, scope: !418)
!418 = distinct !DILexicalBlock(scope: !363, file: !21, line: 58, column: 8)
!419 = !DILocation(line: 58, column: 36, scope: !418)
!420 = !DILocation(line: 58, column: 25, scope: !418)
!421 = !DILocation(line: 58, column: 8, scope: !418)
!422 = !DILocation(line: 58, column: 8, scope: !363)
!423 = !DILocation(line: 59, column: 29, scope: !424)
!424 = distinct !DILexicalBlock(scope: !418, file: !21, line: 58, column: 14)
!425 = !DILocation(line: 59, column: 40, scope: !424)
!426 = !DILocation(line: 59, column: 46, scope: !424)
!427 = !DILocation(line: 59, column: 7, scope: !424)
!428 = !DILocation(line: 61, column: 27, scope: !429)
!429 = distinct !DILexicalBlock(scope: !424, file: !21, line: 61, column: 11)
!430 = !DILocation(line: 61, column: 38, scope: !429)
!431 = !DILocation(line: 61, column: 11, scope: !429)
!432 = !DILocation(line: 61, column: 45, scope: !429)
!433 = !DILocation(line: 61, column: 11, scope: !424)
!434 = !DILocation(line: 62, column: 42, scope: !435)
!435 = distinct !DILexicalBlock(scope: !429, file: !21, line: 61, column: 53)
!436 = !DILocation(line: 62, column: 53, scope: !435)
!437 = !DILocation(line: 62, column: 26, scope: !435)
!438 = !DILocation(line: 62, column: 61, scope: !435)
!439 = !DILocation(line: 62, column: 10, scope: !440)
!440 = !DILexicalBlockFile(scope: !435, file: !21, discriminator: 1)
!441 = !DILocation(line: 63, column: 7, scope: !435)
!442 = !DILocation(line: 64, column: 4, scope: !424)
!443 = !DILocation(line: 66, column: 28, scope: !444)
!444 = distinct !DILexicalBlock(scope: !363, file: !21, line: 66, column: 8)
!445 = !DILocation(line: 66, column: 41, scope: !444)
!446 = !DILocation(line: 66, column: 26, scope: !444)
!447 = !DILocation(line: 66, column: 25, scope: !444)
!448 = !DILocation(line: 66, column: 8, scope: !444)
!449 = !DILocation(line: 66, column: 8, scope: !363)
!450 = !DILocalVariable(name: "isHot", scope: !451, file: !21, line: 67, type: !114)
!451 = distinct !DILexicalBlock(scope: !444, file: !21, line: 66, column: 14)
!452 = !DILocation(line: 67, column: 12, scope: !451)
!453 = !DILocalVariable(name: "doLog", scope: !451, file: !21, line: 68, type: !114)
!454 = !DILocation(line: 68, column: 12, scope: !451)
!455 = !DILocalVariable(name: "contentionRatio", scope: !451, file: !21, line: 69, type: !149)
!456 = !DILocation(line: 69, column: 14, scope: !451)
!457 = !DILocation(line: 75, column: 35, scope: !451)
!458 = !DILocation(line: 75, column: 49, scope: !451)
!459 = !DILocation(line: 75, column: 55, scope: !451)
!460 = !DILocation(line: 75, column: 7, scope: !451)
!461 = !DILocation(line: 77, column: 27, scope: !462)
!462 = distinct !DILexicalBlock(scope: !451, file: !21, line: 77, column: 11)
!463 = !DILocation(line: 77, column: 41, scope: !462)
!464 = !DILocation(line: 77, column: 11, scope: !462)
!465 = !DILocation(line: 77, column: 48, scope: !462)
!466 = !DILocation(line: 77, column: 11, scope: !451)
!467 = !DILocation(line: 78, column: 42, scope: !468)
!468 = distinct !DILexicalBlock(scope: !462, file: !21, line: 77, column: 56)
!469 = !DILocation(line: 78, column: 56, scope: !468)
!470 = !DILocation(line: 78, column: 26, scope: !468)
!471 = !DILocation(line: 78, column: 64, scope: !468)
!472 = !DILocation(line: 78, column: 10, scope: !473)
!473 = !DILexicalBlockFile(scope: !468, file: !21, discriminator: 1)
!474 = !DILocation(line: 79, column: 7, scope: !468)
!475 = !DILocation(line: 85, column: 22, scope: !451)
!476 = !DILocation(line: 85, column: 36, scope: !451)
!477 = !DILocation(line: 85, column: 7, scope: !451)
!478 = !DILocation(line: 87, column: 29, scope: !479)
