; ModuleID = './[inter]third-party--bzip2-1.0.6--blocksort.o.i'
source_filename = "./[inter]third-party--bzip2-1.0.6--blocksort.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.EState = type { %struct.bz_stream*, i32, i32, i32, i32*, i32*, i32*, i32, i32*, i8*, i16*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i8], [256 x i8], i32, i32, i32, i32, i32, i32, i32, i32, [258 x i32], [18002 x i8], [18002 x i8], [6 x [258 x i8]], [6 x [258 x i32]], [6 x [258 x i32]], [258 x [4 x i32]] }
%struct.bz_stream = type { i8*, i32, i32, i32, i8*, i32, i32, i32, i8*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8* }

@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [38 x i8] c"      %d work, %d block, ratio %5.2f\0A\00", align 1
@.str.1 = private unnamed_addr constant [54 x i8] c"    too repetitive; using fallback sorting algorithm\0A\00", align 1
@.str.2 = private unnamed_addr constant [28 x i8] c"        bucket sorting ...\0A\00", align 1
@.str.3 = private unnamed_addr constant [23 x i8] c"        depth %6d has \00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !15)
!1 = !DIFile(filename: "[inter]third-party--bzip2-1.0.6--blocksort.o.i", directory: "/home/lichi/Desktop/bedops/[lib]third-party--bzip2-1.0.6--libbz2.a")
!2 = !{}
!3 = !{!4, !8, !9, !10, !12, !5, !14}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt16", file: !6, line: 47, baseType: !7)
!6 = !DIFile(filename: "bzlib_private.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--bzip2-1.0.6--libbz2.a")
!7 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "UChar", file: !6, line: 43, baseType: !11)
!11 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !6, line: 44, baseType: !13)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !6, line: 42, baseType: !11)
!15 = !{!16}
!16 = distinct !DIGlobalVariable(name: "incs", scope: !0, file: !17, line: 480, type: !18, isLocal: true, isDefinition: true, variable: [14 x i32]* @incs)
!17 = !DIFile(filename: "blocksort.c", directory: "/home/lichi/Desktop/bedops/[lib]third-party--bzip2-1.0.6--libbz2.a")
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 448, align: 32, elements: !19)
!19 = !{!20}
!20 = !DISubrange(count: 14)
!21 = !{i32 2, !"Dwarf Version", i32 4}
!22 = !{i32 2, !"Debug Info Version", i32 3}
!23 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!24 = distinct !DISubprogram(name: "BZ2_blockSort", scope: !17, file: !17, line: 1031, type: !25, isLocal: false, isDefinition: true, scopeLine: 1032, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!25 = !DISubroutineType(types: !26)
!26 = !{null, !27}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "EState", file: !6, line: 266, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 197, size: 446144, align: 64, elements: !30)
!30 = !{!31, !59, !60, !61, !63, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !86, !88, !89, !90, !91, !92, !93, !94, !95, !96, !100, !104, !105, !109, !111, !112}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !29, file: !6, line: 199, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "bz_stream", file: !34, line: 66, baseType: !35)
!34 = !DIFile(filename: "bzlib.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--bzip2-1.0.6--libbz2.a")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 49, size: 640, align: 64, elements: !36)
!36 = !{!37, !40, !42, !43, !44, !45, !46, !47, !48, !50, !54, !58}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !35, file: !34, line: 50, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !35, file: !34, line: 51, baseType: !41, size: 32, align: 32, offset: 64)
!41 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_lo32", scope: !35, file: !34, line: 52, baseType: !41, size: 32, align: 32, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_hi32", scope: !35, file: !34, line: 53, baseType: !41, size: 32, align: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !35, file: !34, line: 55, baseType: !38, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !35, file: !34, line: 56, baseType: !41, size: 32, align: 32, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_lo32", scope: !35, file: !34, line: 57, baseType: !41, size: 32, align: 32, offset: 288)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_hi32", scope: !35, file: !34, line: 58, baseType: !41, size: 32, align: 32, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !35, file: !34, line: 60, baseType: !49, size: 64, align: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "bzalloc", scope: !35, file: !34, line: 62, baseType: !51, size: 64, align: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!49, !49, !13, !13}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "bzfree", scope: !35, file: !34, line: 63, baseType: !55, size: 64, align: 64, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !49, !49}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !35, file: !34, line: 64, baseType: !49, size: 64, align: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !29, file: !6, line: 203, baseType: !12, size: 32, align: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !29, file: !6, line: 204, baseType: !12, size: 32, align: 32, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in_expect", scope: !29, file: !6, line: 207, baseType: !62, size: 32, align: 32, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !6, line: 45, baseType: !41)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "arr1", scope: !29, file: !6, line: 210, baseType: !64, size: 64, align: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "arr2", scope: !29, file: !6, line: 211, baseType: !64, size: 64, align: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ftab", scope: !29, file: !6, line: 212, baseType: !64, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !29, file: !6, line: 213, baseType: !12, size: 32, align: 32, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !29, file: !6, line: 216, baseType: !64, size: 64, align: 64, offset: 448)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !29, file: !6, line: 217, baseType: !9, size: 64, align: 64, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "mtfv", scope: !29, file: !6, line: 218, baseType: !4, size: 64, align: 64, offset: 576)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "zbits", scope: !29, file: !6, line: 219, baseType: !9, size: 64, align: 64, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "workFactor", scope: !29, file: !6, line: 222, baseType: !12, size: 32, align: 32, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_ch", scope: !29, file: !6, line: 225, baseType: !62, size: 32, align: 32, offset: 736)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_len", scope: !29, file: !6, line: 226, baseType: !12, size: 32, align: 32, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !29, file: !6, line: 227, baseType: !12, size: 32, align: 32, offset: 800)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !29, file: !6, line: 227, baseType: !12, size: 32, align: 32, offset: 832)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "nblock", scope: !29, file: !6, line: 230, baseType: !12, size: 32, align: 32, offset: 864)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "nblockMAX", scope: !29, file: !6, line: 231, baseType: !12, size: 32, align: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "numZ", scope: !29, file: !6, line: 232, baseType: !12, size: 32, align: 32, offset: 928)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_pos", scope: !29, file: !6, line: 233, baseType: !12, size: 32, align: 32, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !29, file: !6, line: 236, baseType: !12, size: 32, align: 32, offset: 992)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !29, file: !6, line: 237, baseType: !83, size: 2048, align: 8, offset: 1024)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, align: 8, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "unseqToSeq", scope: !29, file: !6, line: 238, baseType: !87, size: 2048, align: 8, offset: 3072)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, align: 8, elements: !84)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !29, file: !6, line: 241, baseType: !62, size: 32, align: 32, offset: 5120)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !29, file: !6, line: 242, baseType: !12, size: 32, align: 32, offset: 5152)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "blockCRC", scope: !29, file: !6, line: 245, baseType: !62, size: 32, align: 32, offset: 5184)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "combinedCRC", scope: !29, file: !6, line: 246, baseType: !62, size: 32, align: 32, offset: 5216)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !29, file: !6, line: 249, baseType: !12, size: 32, align: 32, offset: 5248)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "blockNo", scope: !29, file: !6, line: 250, baseType: !12, size: 32, align: 32, offset: 5280)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !29, file: !6, line: 251, baseType: !12, size: 32, align: 32, offset: 5312)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "nMTF", scope: !29, file: !6, line: 254, baseType: !12, size: 32, align: 32, offset: 5344)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "mtfFreq", scope: !29, file: !6, line: 255, baseType: !97, size: 8256, align: 32, offset: 5376)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8256, align: 32, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 258)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !29, file: !6, line: 256, baseType: !101, size: 144016, align: 8, offset: 13632)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 144016, align: 8, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 18002)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !29, file: !6, line: 257, baseType: !101, size: 144016, align: 8, offset: 157648)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !29, file: !6, line: 259, baseType: !106, size: 12384, align: 8, offset: 301664)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 12384, align: 8, elements: !107)
!107 = !{!108, !99}
!108 = !DISubrange(count: 6)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !29, file: !6, line: 260, baseType: !110, size: 49536, align: 32, offset: 314048)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 49536, align: 32, elements: !107)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "rfreq", scope: !29, file: !6, line: 261, baseType: !110, size: 49536, align: 32, offset: 363584)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "len_pack", scope: !29, file: !6, line: 263, baseType: !113, size: 33024, align: 32, offset: 413120)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 33024, align: 32, elements: !114)
!114 = !{!99, !115}
!115 = !DISubrange(count: 4)
!116 = !DILocalVariable(name: "s", arg: 1, scope: !24, file: !17, line: 1031, type: !27)
!117 = !DIExpression()
!118 = !DILocation(line: 1031, column: 30, scope: !24)
!119 = !DILocalVariable(name: "ptr", scope: !24, file: !17, line: 1033, type: !64)
!120 = !DILocation(line: 1033, column: 12, scope: !24)
!121 = !DILocation(line: 1033, column: 18, scope: !24)
!122 = !DILocation(line: 1033, column: 21, scope: !24)
!123 = !DILocalVariable(name: "block", scope: !24, file: !17, line: 1034, type: !9)
!124 = !DILocation(line: 1034, column: 11, scope: !24)
!125 = !DILocation(line: 1034, column: 19, scope: !24)
!126 = !DILocation(line: 1034, column: 22, scope: !24)
!127 = !DILocalVariable(name: "ftab", scope: !24, file: !17, line: 1035, type: !64)
!128 = !DILocation(line: 1035, column: 12, scope: !24)
!129 = !DILocation(line: 1035, column: 19, scope: !24)
!130 = !DILocation(line: 1035, column: 22, scope: !24)
!131 = !DILocalVariable(name: "nblock", scope: !24, file: !17, line: 1036, type: !12)
!132 = !DILocation(line: 1036, column: 10, scope: !24)
!133 = !DILocation(line: 1036, column: 19, scope: !24)
!134 = !DILocation(line: 1036, column: 22, scope: !24)
!135 = !DILocalVariable(name: "verb", scope: !24, file: !17, line: 1037, type: !12)
!136 = !DILocation(line: 1037, column: 10, scope: !24)
!137 = !DILocation(line: 1037, column: 17, scope: !24)
!138 = !DILocation(line: 1037, column: 20, scope: !24)
!139 = !DILocalVariable(name: "wfact", scope: !24, file: !17, line: 1038, type: !12)
!140 = !DILocation(line: 1038, column: 10, scope: !24)
!141 = !DILocation(line: 1038, column: 18, scope: !24)
!142 = !DILocation(line: 1038, column: 21, scope: !24)
!143 = !DILocalVariable(name: "quadrant", scope: !24, file: !17, line: 1039, type: !4)
!144 = !DILocation(line: 1039, column: 12, scope: !24)
!145 = !DILocalVariable(name: "budget", scope: !24, file: !17, line: 1040, type: !12)
!146 = !DILocation(line: 1040, column: 10, scope: !24)
!147 = !DILocalVariable(name: "budgetInit", scope: !24, file: !17, line: 1041, type: !12)
!148 = !DILocation(line: 1041, column: 10, scope: !24)
!149 = !DILocalVariable(name: "i", scope: !24, file: !17, line: 1042, type: !12)
!150 = !DILocation(line: 1042, column: 10, scope: !24)
!151 = !DILocation(line: 1044, column: 8, scope: !152)
!152 = distinct !DILexicalBlock(scope: !24, file: !17, line: 1044, column: 8)
!153 = !DILocation(line: 1044, column: 15, scope: !152)
!154 = !DILocation(line: 1044, column: 8, scope: !24)
!155 = !DILocation(line: 1045, column: 22, scope: !156)
!156 = distinct !DILexicalBlock(scope: !152, file: !17, line: 1044, column: 24)
!157 = !DILocation(line: 1045, column: 25, scope: !156)
!158 = !DILocation(line: 1045, column: 31, scope: !156)
!159 = !DILocation(line: 1045, column: 34, scope: !156)
!160 = !DILocation(line: 1045, column: 40, scope: !156)
!161 = !DILocation(line: 1045, column: 46, scope: !156)
!162 = !DILocation(line: 1045, column: 54, scope: !156)
!163 = !DILocation(line: 1045, column: 7, scope: !156)
!164 = !DILocation(line: 1046, column: 4, scope: !156)
!165 = !DILocation(line: 1052, column: 11, scope: !166)
!166 = distinct !DILexicalBlock(scope: !152, file: !17, line: 1046, column: 11)
!167 = !DILocation(line: 1052, column: 17, scope: !166)
!168 = !DILocation(line: 1052, column: 9, scope: !166)
!169 = !DILocation(line: 1053, column: 11, scope: !170)
!170 = distinct !DILexicalBlock(scope: !166, file: !17, line: 1053, column: 11)
!171 = !DILocation(line: 1053, column: 13, scope: !170)
!172 = !DILocation(line: 1053, column: 11, scope: !166)
!173 = !DILocation(line: 1053, column: 19, scope: !174)
!174 = !DILexicalBlockFile(scope: !170, file: !17, discriminator: 1)
