; ModuleID = './[inter]third-party--bzip2-1.0.6--compress.o.i'
source_filename = "./[inter]third-party--bzip2-1.0.6--compress.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.EState = type { %struct.bz_stream*, i32, i32, i32, i32*, i32*, i32*, i32, i32*, i8*, i16*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i8], [256 x i8], i32, i32, i32, i32, i32, i32, i32, i32, [258 x i32], [18002 x i8], [18002 x i8], [6 x [258 x i8]], [6 x [258 x i32]], [6 x [258 x i32]], [258 x [4 x i32]] }
%struct.bz_stream = type { i8*, i32, i32, i32, i8*, i32, i32, i32, i8*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8* }

@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [62 x i8] c"    block %d: crc = 0x%08x, combined CRC = 0x%08x, size = %d\0A\00", align 1
@.str.1 = private unnamed_addr constant [36 x i8] c"    final combined CRC = 0x%08x\0A   \00", align 1
@.str.2 = private unnamed_addr constant [64 x i8] c"      %d in block, %d after MTF & 1-2 coding, %d+2 syms in use\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "[inter]third-party--bzip2-1.0.6--compress.o.i", directory: "/home/lichi/Desktop/bedops/[lib]third-party--bzip2-1.0.6--libbz2.a")
!2 = !{}
!3 = !{!4, !5, !8, !10, !11}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "UChar", file: !6, line: 43, baseType: !7)
!6 = !DIFile(filename: "bzlib_private.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--bzip2-1.0.6--libbz2.a")
!7 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt32", file: !6, line: 45, baseType: !9)
!9 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !6, line: 42, baseType: !7)
!11 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!12 = !{i32 2, !"Dwarf Version", i32 4}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!15 = distinct !DISubprogram(name: "BZ2_bsInitWrite", scope: !16, file: !16, line: 37, type: !17, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!16 = !DIFile(filename: "compress.c", directory: "/home/lichi/Desktop/bedops/[lib]third-party--bzip2-1.0.6--libbz2.a")
!17 = !DISubroutineType(types: !18)
!18 = !{null, !19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "EState", file: !6, line: 266, baseType: !21)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 197, size: 446144, align: 64, elements: !22)
!22 = !{!23, !51, !53, !54, !55, !57, !58, !59, !60, !61, !62, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !81, !83, !84, !85, !86, !87, !88, !89, !90, !91, !95, !99, !100, !104, !106, !107}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !21, file: !6, line: 199, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "bz_stream", file: !26, line: 66, baseType: !27)
!26 = !DIFile(filename: "bzlib.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--bzip2-1.0.6--libbz2.a")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 49, size: 640, align: 64, elements: !28)
!28 = !{!29, !32, !33, !34, !35, !36, !37, !38, !39, !41, !46, !50}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !27, file: !26, line: 50, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !27, file: !26, line: 51, baseType: !9, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_lo32", scope: !27, file: !26, line: 52, baseType: !9, size: 32, align: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "total_in_hi32", scope: !27, file: !26, line: 53, baseType: !9, size: 32, align: 32, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !27, file: !26, line: 55, baseType: !30, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !27, file: !26, line: 56, baseType: !9, size: 32, align: 32, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_lo32", scope: !27, file: !26, line: 57, baseType: !9, size: 32, align: 32, offset: 288)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "total_out_hi32", scope: !27, file: !26, line: 58, baseType: !9, size: 32, align: 32, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !27, file: !26, line: 60, baseType: !40, size: 64, align: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "bzalloc", scope: !27, file: !26, line: 62, baseType: !42, size: 64, align: 64, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!40, !40, !45, !45}
!45 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "bzfree", scope: !27, file: !26, line: 63, baseType: !47, size: 64, align: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !40, !40}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !27, file: !26, line: 64, baseType: !40, size: 64, align: 64, offset: 576)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !21, file: !6, line: 203, baseType: !52, size: 32, align: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "Int32", file: !6, line: 44, baseType: !45)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !21, file: !6, line: 204, baseType: !52, size: 32, align: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in_expect", scope: !21, file: !6, line: 207, baseType: !8, size: 32, align: 32, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "arr1", scope: !21, file: !6, line: 210, baseType: !56, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "arr2", scope: !21, file: !6, line: 211, baseType: !56, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ftab", scope: !21, file: !6, line: 212, baseType: !56, size: 64, align: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "origPtr", scope: !21, file: !6, line: 213, baseType: !52, size: 32, align: 32, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !21, file: !6, line: 216, baseType: !56, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !21, file: !6, line: 217, baseType: !4, size: 64, align: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "mtfv", scope: !21, file: !6, line: 218, baseType: !63, size: 64, align: 64, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInt16", file: !6, line: 47, baseType: !65)
!65 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "zbits", scope: !21, file: !6, line: 219, baseType: !4, size: 64, align: 64, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "workFactor", scope: !21, file: !6, line: 222, baseType: !52, size: 32, align: 32, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_ch", scope: !21, file: !6, line: 225, baseType: !8, size: 32, align: 32, offset: 736)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_len", scope: !21, file: !6, line: 226, baseType: !52, size: 32, align: 32, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "rNToGo", scope: !21, file: !6, line: 227, baseType: !52, size: 32, align: 32, offset: 800)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "rTPos", scope: !21, file: !6, line: 227, baseType: !52, size: 32, align: 32, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "nblock", scope: !21, file: !6, line: 230, baseType: !52, size: 32, align: 32, offset: 864)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "nblockMAX", scope: !21, file: !6, line: 231, baseType: !52, size: 32, align: 32, offset: 896)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "numZ", scope: !21, file: !6, line: 232, baseType: !52, size: 32, align: 32, offset: 928)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "state_out_pos", scope: !21, file: !6, line: 233, baseType: !52, size: 32, align: 32, offset: 960)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "nInUse", scope: !21, file: !6, line: 236, baseType: !52, size: 32, align: 32, offset: 992)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "inUse", scope: !21, file: !6, line: 237, baseType: !78, size: 2048, align: 8, offset: 1024)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, align: 8, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "unseqToSeq", scope: !21, file: !6, line: 238, baseType: !82, size: 2048, align: 8, offset: 3072)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 2048, align: 8, elements: !79)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "bsBuff", scope: !21, file: !6, line: 241, baseType: !8, size: 32, align: 32, offset: 5120)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "bsLive", scope: !21, file: !6, line: 242, baseType: !52, size: 32, align: 32, offset: 5152)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "blockCRC", scope: !21, file: !6, line: 245, baseType: !8, size: 32, align: 32, offset: 5184)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "combinedCRC", scope: !21, file: !6, line: 246, baseType: !8, size: 32, align: 32, offset: 5216)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !21, file: !6, line: 249, baseType: !52, size: 32, align: 32, offset: 5248)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "blockNo", scope: !21, file: !6, line: 250, baseType: !52, size: 32, align: 32, offset: 5280)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "blockSize100k", scope: !21, file: !6, line: 251, baseType: !52, size: 32, align: 32, offset: 5312)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "nMTF", scope: !21, file: !6, line: 254, baseType: !52, size: 32, align: 32, offset: 5344)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "mtfFreq", scope: !21, file: !6, line: 255, baseType: !92, size: 8256, align: 32, offset: 5376)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8256, align: 32, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 258)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "selector", scope: !21, file: !6, line: 256, baseType: !96, size: 144016, align: 8, offset: 13632)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 144016, align: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 18002)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "selectorMtf", scope: !21, file: !6, line: 257, baseType: !96, size: 144016, align: 8, offset: 157648)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !21, file: !6, line: 259, baseType: !101, size: 12384, align: 8, offset: 301664)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 12384, align: 8, elements: !102)
!102 = !{!103, !94}
!103 = !DISubrange(count: 6)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !21, file: !6, line: 260, baseType: !105, size: 49536, align: 32, offset: 314048)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 49536, align: 32, elements: !102)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "rfreq", scope: !21, file: !6, line: 261, baseType: !105, size: 49536, align: 32, offset: 363584)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "len_pack", scope: !21, file: !6, line: 263, baseType: !108, size: 33024, align: 32, offset: 413120)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 33024, align: 32, elements: !109)
!109 = !{!94, !110}
!110 = !DISubrange(count: 4)
!111 = !DILocalVariable(name: "s", arg: 1, scope: !15, file: !16, line: 37, type: !19)
!112 = !DIExpression()
!113 = !DILocation(line: 37, column: 32, scope: !15)
!114 = !DILocation(line: 39, column: 4, scope: !15)
!115 = !DILocation(line: 39, column: 7, scope: !15)
!116 = !DILocation(line: 39, column: 14, scope: !15)
!117 = !DILocation(line: 40, column: 4, scope: !15)
!118 = !DILocation(line: 40, column: 7, scope: !15)
!119 = !DILocation(line: 40, column: 14, scope: !15)
!120 = !DILocation(line: 41, column: 1, scope: !15)
!121 = distinct !DISubprogram(name: "BZ2_compressBlock", scope: !16, file: !16, line: 602, type: !122, isLocal: false, isDefinition: true, scopeLine: 603, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !19, !10}
!124 = !DILocalVariable(name: "s", arg: 1, scope: !121, file: !16, line: 602, type: !19)
!125 = !DILocation(line: 602, column: 34, scope: !121)
!126 = !DILocalVariable(name: "is_last_block", arg: 2, scope: !121, file: !16, line: 602, type: !10)
!127 = !DILocation(line: 602, column: 42, scope: !121)
!128 = !DILocation(line: 604, column: 8, scope: !129)
!129 = distinct !DILexicalBlock(scope: !121, file: !16, line: 604, column: 8)
!130 = !DILocation(line: 604, column: 11, scope: !129)
!131 = !DILocation(line: 604, column: 18, scope: !129)
!132 = !DILocation(line: 604, column: 8, scope: !121)
!133 = !DILocation(line: 606, column: 25, scope: !134)
!134 = distinct !DILexicalBlock(scope: !135, file: !16, line: 606, column: 7)
!135 = distinct !DILexicalBlock(scope: !129, file: !16, line: 604, column: 23)
!136 = !DILocation(line: 606, column: 28, scope: !134)
!137 = !DILocation(line: 606, column: 23, scope: !134)
!138 = !DILocation(line: 606, column: 9, scope: !134)
!139 = !DILocation(line: 606, column: 12, scope: !134)
!140 = !DILocation(line: 606, column: 21, scope: !134)
!141 = !DILocation(line: 607, column: 25, scope: !135)
!142 = !DILocation(line: 607, column: 28, scope: !135)
!143 = !DILocation(line: 607, column: 40, scope: !135)
!144 = !DILocation(line: 607, column: 49, scope: !135)
!145 = !DILocation(line: 607, column: 52, scope: !135)
!146 = !DILocation(line: 607, column: 64, scope: !135)
!147 = !DILocation(line: 607, column: 46, scope: !135)
!148 = !DILocation(line: 607, column: 7, scope: !135)
!149 = !DILocation(line: 607, column: 10, scope: !135)
!150 = !DILocation(line: 607, column: 22, scope: !135)
!151 = !DILocation(line: 608, column: 25, scope: !135)
!152 = !DILocation(line: 608, column: 28, scope: !135)
!153 = !DILocation(line: 608, column: 7, scope: !135)
!154 = !DILocation(line: 608, column: 10, scope: !135)
!155 = !DILocation(line: 608, column: 22, scope: !135)
!156 = !DILocation(line: 609, column: 11, scope: !157)
!157 = distinct !DILexicalBlock(scope: !135, file: !16, line: 609, column: 11)
!158 = !DILocation(line: 609, column: 14, scope: !157)
!159 = !DILocation(line: 609, column: 22, scope: !157)
!160 = !DILocation(line: 609, column: 11, scope: !135)
!161 = !DILocation(line: 609, column: 27, scope: !162)
!162 = !DILexicalBlockFile(scope: !157, file: !16, discriminator: 1)
!163 = !DILocation(line: 609, column: 30, scope: !162)
!164 = !DILocation(line: 609, column: 35, scope: !162)
!165 = !DILocation(line: 611, column: 11, scope: !166)
!166 = distinct !DILexicalBlock(scope: !135, file: !16, line: 611, column: 11)
!167 = !DILocation(line: 611, column: 14, scope: !166)
!168 = !DILocation(line: 611, column: 24, scope: !166)
!169 = !DILocation(line: 611, column: 11, scope: !135)
!170 = !DILocation(line: 612, column: 9, scope: !166)
!171 = !DILocation(line: 612, column: 78, scope: !166)
!172 = !DILocation(line: 612, column: 81, scope: !166)
