; ModuleID = './libRpcChannel_la-bdoorChannel.o.i'
source_filename = "./libRpcChannel_la-bdoorChannel.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._RpcChannelFuncs = type { i32 (%struct._RpcChannel*)*, void (%struct._RpcChannel*)*, i32 (%struct._RpcChannel*, i8*, i64, i8*, i8**, i64*)*, void (%struct._RpcChannel*, %struct._GMainContext*, i8*, i8*)*, void (%struct._RpcChannel*)*, i32 (%struct._RpcChannel*)*, void (%struct._RpcChannel*)*, i32 (%struct._RpcChannel*)* }
%struct._RpcChannel = type { %struct._RpcChannelFuncs*, i8*, %struct._GMainContext*, i8*, i8*, %struct.GStaticMutex, %struct.RpcIn*, i32, i32 }
%struct._GMainContext = type opaque
%struct.GStaticMutex = type { %union._GMutex*, %union.pthread_mutex_t }
%union._GMutex = type { i8* }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.RpcIn = type opaque
%struct.BackdoorChannel = type { %struct.RpcOut* }
%struct.RpcOut = type opaque


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10, globals: !12)
!1 = !DIFile(filename: "libRpcChannel_la-bdoorChannel.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line813")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RpcChannelType", file: !4, line: 79, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line813")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "RPCCHANNEL_TYPE_INACTIVE", value: 0)
!7 = !DIEnumerator(name: "RPCCHANNEL_TYPE_BKDOOR", value: 1)
!8 = !DIEnumerator(name: "RPCCHANNEL_TYPE_PRIV_VSOCK", value: 2)
!9 = !DIEnumerator(name: "RPCCHANNEL_TYPE_UNPRIV_VSOCK", value: 3)
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !{!13}
!13 = distinct !DIGlobalVariable(name: "funcs", scope: !14, file: !15, line: 233, type: !26, isLocal: true, isDefinition: true, variable: %struct._RpcChannelFuncs* @BackdoorChannelSetCallbacks.funcs)
!14 = distinct !DISubprogram(name: "BackdoorChannelSetCallbacks", scope: !15, file: !15, line: 231, type: !16, isLocal: true, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !128)
!15 = !DIFile(filename: "bdoorChannel.c", directory: "/home/lichi/Desktop/open-vm-tools/line813")
!16 = !DISubroutineType(types: !17)
!17 = !{null, !18}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !4, line: 48, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !21, line: 64, size: 832, align: 64, elements: !22)
!21 = !DIFile(filename: "rpcChannelInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line813")
!22 = !{!23, !72, !73, !74, !75, !76, !123, !126, !127}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !20, file: !21, line: 65, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannelFuncs", file: !21, line: 56, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannelFuncs", file: !21, line: 45, size: 512, align: 64, elements: !28)
!28 = !{!29, !37, !39, !55, !64, !65, !70, !71}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !27, file: !21, line: 46, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{!33, !18}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !34, line: 50, baseType: !35)
!34 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line813")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !34, line: 49, baseType: !36)
!36 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !27, file: !21, line: 47, baseType: !38, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !27, file: !21, line: 48, baseType: !40, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!33, !18, !43, !46, !49, !52, !54}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !47, line: 216, baseType: !48)
!47 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line813")
!48 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !51, line: 230, baseType: !45)
!51 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line813")
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !27, file: !21, line: 50, baseType: !56, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !18, !59, !43, !63}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !61, line: 48, baseType: !62)
!61 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line813")
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !61, line: 48, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !34, line: 77, baseType: !11)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !27, file: !21, line: 52, baseType: !38, size: 64, align: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "getType", scope: !27, file: !21, line: 53, baseType: !66, size: 64, align: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !18}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannelType", file: !4, line: 84, baseType: !3)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "onStartErr", scope: !27, file: !21, line: 54, baseType: !38, size: 64, align: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "stopRpcOut", scope: !27, file: !21, line: 55, baseType: !30, size: 64, align: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !20, file: !21, line: 66, baseType: !63, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "mainCtx", scope: !20, file: !21, line: 68, baseType: !59, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "appName", scope: !20, file: !21, line: 69, baseType: !43, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "appCtx", scope: !20, file: !21, line: 70, baseType: !63, size: 64, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "outLock", scope: !20, file: !21, line: 72, baseType: !77, size: 384, align: 64, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "GStaticMutex", file: !78, line: 140, baseType: !79)
!78 = !DIFile(filename: "/usr/include/glib-2.0/glib/deprecated/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line813")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 133, size: 384, align: 64, elements: !80)
!80 = !{!81, !94}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !79, file: !78, line: 135, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMutex", file: !84, line: 51, baseType: !85)
!84 = !DIFile(filename: "/usr/include/glib-2.0/glib/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line813")
!85 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GMutex", file: !84, line: 58, size: 64, align: 64, elements: !86)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !85, file: !84, line: 61, baseType: !63, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !85, file: !84, line: 62, baseType: !89, size: 64, align: 32)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 64, align: 32, elements: !92)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !34, line: 55, baseType: !91)
!91 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!92 = !{!93}
!93 = !DISubrange(count: 2)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !79, file: !78, line: 138, baseType: !95, size: 320, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !96, line: 128, baseType: !97)
!96 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line813")
!97 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !96, line: 90, size: 320, align: 64, elements: !98)
!98 = !{!99, !117, !121}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !97, file: !96, line: 125, baseType: !100, size: 320, align: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !96, line: 92, size: 320, align: 64, elements: !101)
!101 = !{!102, !103, !104, !105, !106, !107, !109, !110}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !100, file: !96, line: 94, baseType: !36, size: 32, align: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !100, file: !96, line: 95, baseType: !91, size: 32, align: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !100, file: !96, line: 96, baseType: !36, size: 32, align: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !100, file: !96, line: 98, baseType: !91, size: 32, align: 32, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !100, file: !96, line: 102, baseType: !36, size: 32, align: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !100, file: !96, line: 104, baseType: !108, size: 16, align: 16, offset: 160)
!108 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !100, file: !96, line: 105, baseType: !108, size: 16, align: 16, offset: 176)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !100, file: !96, line: 106, baseType: !111, size: 128, align: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !96, line: 79, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !96, line: 75, size: 128, align: 64, elements: !113)
!113 = !{!114, !116}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !112, file: !96, line: 77, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !112, file: !96, line: 78, baseType: !115, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !97, file: !96, line: 126, baseType: !118, size: 320, align: 8)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 320, align: 8, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 40)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !97, file: !96, line: 127, baseType: !122, size: 64, align: 64)
!122 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !20, file: !21, line: 74, baseType: !124, size: 64, align: 64, offset: 704)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "RpcIn", file: !21, line: 41, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "inStarted", scope: !20, file: !21, line: 75, baseType: !33, size: 32, align: 32, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "outStarted", scope: !20, file: !21, line: 77, baseType: !33, size: 32, align: 32, offset: 800)
!128 = !{}
!129 = !{i32 2, !"Dwarf Version", i32 4}
!130 = !{i32 2, !"Debug Info Version", i32 3}
!131 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!132 = distinct !DISubprogram(name: "BackdoorChannel_New", scope: !15, file: !15, line: 256, type: !133, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !128)
!133 = !DISubroutineType(types: !134)
!134 = !{!18}
!135 = !DILocalVariable(name: "ret", scope: !132, file: !15, line: 258, type: !18)
!136 = !DIExpression()
!137 = !DILocation(line: 258, column: 16, scope: !132)
!138 = !DILocalVariable(name: "bdoor", scope: !132, file: !15, line: 259, type: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "BackdoorChannel", file: !15, line: 37, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BackdoorChannel", file: !15, line: 35, size: 64, align: 64, elements: !142)
!142 = !{!143}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !141, file: !15, line: 36, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcOut", file: !146, line: 48, baseType: !147)
!146 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/rpcout.h", directory: "/home/lichi/Desktop/open-vm-tools/line813")
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "RpcOut", file: !146, line: 48, flags: DIFlagFwdDecl)
!148 = !DILocation(line: 259, column: 21, scope: !132)
!149 = !DILocation(line: 261, column: 10, scope: !132)
!150 = !DILocation(line: 261, column: 8, scope: !132)
!151 = !DILocation(line: 262, column: 12, scope: !132)
!152 = !DILocation(line: 262, column: 10, scope: !132)
!153 = !DILocation(line: 264, column: 17, scope: !132)
!154 = !DILocation(line: 264, column: 4, scope: !132)
!155 = !DILocation(line: 264, column: 11, scope: !132)
!156 = !DILocation(line: 264, column: 15, scope: !132)
!157 = !DILocation(line: 268, column: 4, scope: !132)
!158 = !DILocation(line: 268, column: 9, scope: !132)
!159 = !DILocation(line: 268, column: 19, scope: !132)
!160 = !DILocation(line: 270, column: 4, scope: !132)
!161 = !DILocation(line: 270, column: 9, scope: !132)
!162 = !DILocation(line: 270, column: 20, scope: !132)
!163 = !DILocation(line: 272, column: 32, scope: !132)
!164 = !DILocation(line: 272, column: 4, scope: !132)
!165 = !DILocation(line: 273, column: 20, scope: !132)
!166 = !DILocation(line: 273, column: 4, scope: !132)
!167 = !DILocation(line: 273, column: 9, scope: !132)
!168 = !DILocation(line: 273, column: 18, scope: !132)
!169 = !DILocation(line: 275, column: 11, scope: !132)
!170 = !DILocation(line: 275, column: 4, scope: !132)
!171 = !DILocalVariable(name: "chan", arg: 1, scope: !14, file: !15, line: 231, type: !18)
!172 = !DILocation(line: 231, column: 41, scope: !14)
!173 = !DILocation(line: 245, column: 4, scope: !14)
!174 = !DILocation(line: 245, column: 10, scope: !14)
!175 = !DILocation(line: 245, column: 16, scope: !14)
!176 = !DILocation(line: 246, column: 1, scope: !14)
!177 = distinct !DISubprogram(name: "BackdoorChannel_Fallback", scope: !15, file: !15, line: 288, type: !31, isLocal: false, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !128)
!178 = !DILocalVariable(name: "chan", arg: 1, scope: !177, file: !15, line: 288, type: !18)
!179 = !DILocation(line: 288, column: 38, scope: !177)
!180 = !DILocalVariable(name: "bdoor", scope: !177, file: !15, line: 290, type: !139)
!181 = !DILocation(line: 290, column: 21, scope: !177)
!182 = !DILocation(line: 295, column: 12, scope: !177)
