; ModuleID = '/home/lichi/Desktop/genwqe/[task]tools--genwqe_echo/[inter]tools--genwqe_echo.o.i'
source_filename = "/home/lichi/Desktop/genwqe/[task]tools--genwqe_echo/[inter]tools--genwqe_echo.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.card_dev_t = type opaque
%struct.timeval = type { i64, i64 }
%struct.timezone = type { i32, i32 }
%struct.ddcb_cmd = type { i64, i64, i8, i8, i8, i8, i16, i16, i16, i16, i32, i64, i64, i64, i64, [64 x i8], %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i64, [96 x i8] }

@verbose_flag = global i32 0, align 4
@.str = private unnamed_addr constant [34 x i8] c"ABCDEF_echo test [123456789abcde]\00", align 1
@tstring_default = global i8* getelementptr inbounds ([34 x i8], [34 x i8]* @.str, i32 0, i32 0), align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !63)
!1 = !DIFile(filename: "/home/lichi/Desktop/genwqe/[task]tools--genwqe_echo/[inter]tools--genwqe_echo.o.i", directory: "/home/lichi/Desktop")
!2 = !{}
!3 = !{!4, !6, !7, !8, !9, !10, !15, !38, !62}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !11, line: 85, baseType: !12)
!11 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop")
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DISubroutineType(types: !14)
!14 = !{null, !8}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ddcb_cmd", file: !17, line: 154, size: 1856, align: 64, elements: !18)
!17 = !DIFile(filename: "../include/libddcb.h", directory: "/home/lichi/Desktop")
!18 = !{!19, !23, !24, !27, !28, !29, !30, !33, !34, !35, !36, !39, !40, !41, !42, !43, !47}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "next_addr", scope: !16, file: !17, line: 155, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !21, line: 30, baseType: !22)
!21 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop")
!22 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !16, file: !17, line: 156, baseType: !20, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "acfunc", scope: !16, file: !17, line: 158, baseType: !25, size: 8, align: 8, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !21, line: 20, baseType: !26)
!26 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !16, file: !17, line: 159, baseType: !25, size: 8, align: 8, offset: 136)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "asiv_length", scope: !16, file: !17, line: 160, baseType: !25, size: 8, align: 8, offset: 144)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "asv_length", scope: !16, file: !17, line: 161, baseType: !25, size: 8, align: 8, offset: 152)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "cmdopts", scope: !16, file: !17, line: 162, baseType: !31, size: 16, align: 16, offset: 160)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !21, line: 23, baseType: !32)
!32 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "retc", scope: !16, file: !17, line: 163, baseType: !31, size: 16, align: 16, offset: 176)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "attn", scope: !16, file: !17, line: 165, baseType: !31, size: 16, align: 16, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "vcrc", scope: !16, file: !17, line: 166, baseType: !31, size: 16, align: 16, offset: 208)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !16, file: !17, line: 167, baseType: !37, size: 32, align: 32, offset: 224)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !21, line: 26, baseType: !38)
!38 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "deque_ts", scope: !16, file: !17, line: 169, baseType: !20, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "cmplt_ts", scope: !16, file: !17, line: 170, baseType: !20, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "disp_ts", scope: !16, file: !17, line: 171, baseType: !20, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ddata_addr", scope: !16, file: !17, line: 173, baseType: !20, size: 64, align: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "asv", scope: !16, file: !17, line: 175, baseType: !44, size: 512, align: 8, offset: 512)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 512, align: 8, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, scope: !16, file: !17, line: 177, baseType: !48, size: 832, align: 64, offset: 1024)
!48 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !16, file: !17, line: 177, size: 832, align: 64, elements: !49)
!49 = !{!50, !58}
!50 = !DIDerivedType(tag: DW_TAG_member, scope: !48, file: !17, line: 179, baseType: !51, size: 832, align: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !48, file: !17, line: 179, size: 832, align: 64, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ats", scope: !51, file: !17, line: 180, baseType: !20, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "asiv", scope: !51, file: !17, line: 181, baseType: !55, size: 768, align: 8, offset: 64)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 768, align: 8, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 96)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__asiv", scope: !48, file: !17, line: 184, baseType: !59, size: 832, align: 8)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 832, align: 8, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 104)
!62 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!63 = !{!64, !66, !69, !84, !85}
!64 = distinct !DIGlobalVariable(name: "verbose_flag", scope: !0, file: !65, line: 45, type: !8, isLocal: false, isDefinition: true, variable: i32* @verbose_flag)
!65 = !DIFile(filename: "genwqe_echo.c", directory: "/home/lichi/Desktop")
!66 = distinct !DIGlobalVariable(name: "tstring_default", scope: !0, file: !65, line: 48, type: !67, isLocal: false, isDefinition: true, variable: i8** @tstring_default)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!69 = distinct !DIGlobalVariable(name: "long_options", scope: !70, file: !65, line: 249, type: !73, isLocal: true, isDefinition: true, variable: [17 x %struct.option]* @main.long_options)
!70 = distinct !DISubprogram(name: "main", scope: !65, file: !65, line: 225, type: !71, isLocal: false, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!71 = !DISubroutineType(types: !72)
!72 = !{!8, !8, !6}
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 4352, align: 64, elements: !82)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !75, line: 104, size: 256, align: 64, elements: !76)
!75 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/lichi/Desktop")
!76 = !{!77, !78, !79, !81}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !75, line: 106, baseType: !67, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !74, file: !75, line: 109, baseType: !8, size: 32, align: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !74, file: !75, line: 110, baseType: !80, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !74, file: !75, line: 111, baseType: !8, size: 32, align: 32, offset: 192)
!82 = !{!83}
!83 = !DISubrange(count: 17)
!84 = distinct !DIGlobalVariable(name: "version", scope: !0, file: !65, line: 47, type: !67, isLocal: true, isDefinition: true, variable: i8** @version)
!85 = distinct !DIGlobalVariable(name: "stop_echoing", scope: !0, file: !65, line: 86, type: !8, isLocal: true, isDefinition: true, variable: i32* @stop_echoing)
!86 = !{i32 2, !"Dwarf Version", i32 4}
!87 = !{i32 2, !"Debug Info Version", i32 3}
!88 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!89 = !DILocalVariable(name: "argc", arg: 1, scope: !70, file: !65, line: 225, type: !8)
!90 = !DIExpression()
!91 = !DILocation(line: 225, column: 14, scope: !70)
!92 = !DILocalVariable(name: "argv", arg: 2, scope: !70, file: !65, line: 225, type: !6)
!93 = !DILocation(line: 225, column: 26, scope: !70)
!94 = !DILocalVariable(name: "ch", scope: !70, file: !65, line: 227, type: !8)
!95 = !DILocation(line: 227, column: 6, scope: !70)
!96 = !DILocalVariable(name: "rc", scope: !70, file: !65, line: 227, type: !8)
!97 = !DILocation(line: 227, column: 10, scope: !70)
!98 = !DILocalVariable(name: "card_no", scope: !70, file: !65, line: 228, type: !8)
!99 = !DILocation(line: 228, column: 6, scope: !70)
!100 = !DILocalVariable(name: "card_type", scope: !70, file: !65, line: 229, type: !8)
!101 = !DILocation(line: 229, column: 6, scope: !70)
!102 = !DILocalVariable(name: "preload", scope: !70, file: !65, line: 230, type: !8)
!103 = !DILocation(line: 230, column: 6, scope: !70)
!104 = !DILocalVariable(name: "flood", scope: !70, file: !65, line: 231, type: !8)
!105 = !DILocation(line: 231, column: 6, scope: !70)
!106 = !DILocalVariable(name: "print_hardware_version", scope: !70, file: !65, line: 232, type: !107)
!107 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!108 = !DILocation(line: 232, column: 6, scope: !70)
!109 = !DILocalVariable(name: "quiet", scope: !70, file: !65, line: 233, type: !8)
!110 = !DILocation(line: 233, column: 6, scope: !70)
!111 = !DILocalVariable(name: "exit_on_err", scope: !70, file: !65, line: 234, type: !8)
!112 = !DILocation(line: 234, column: 6, scope: !70)
!113 = !DILocalVariable(name: "count", scope: !70, file: !65, line: 235, type: !62)
!114 = !DILocation(line: 235, column: 16, scope: !70)
!115 = !DILocalVariable(name: "run_infinite", scope: !70, file: !65, line: 236, type: !8)
!116 = !DILocation(line: 236, column: 6, scope: !70)
!117 = !DILocalVariable(name: "interval", scope: !70, file: !65, line: 237, type: !62)
!118 = !DILocation(line: 237, column: 16, scope: !70)
!119 = !DILocalVariable(name: "unit", scope: !70, file: !65, line: 238, type: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !121, line: 48, baseType: !26)
!121 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop")
!122 = !DILocation(line: 238, column: 10, scope: !70)
!123 = !DILocalVariable(name: "card", scope: !70, file: !65, line: 239, type: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "accel_t", file: !17, line: 198, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "card_dev_t", file: !17, line: 198, flags: DIFlagFwdDecl)
!127 = !DILocation(line: 239, column: 10, scope: !70)
!128 = !DILocalVariable(name: "teststring", scope: !70, file: !65, line: 240, type: !4)
!129 = !DILocation(line: 240, column: 8, scope: !70)
!130 = !DILocation(line: 240, column: 28, scope: !70)
!131 = !DILocalVariable(name: "packets_send", scope: !70, file: !65, line: 241, type: !62)
!132 = !DILocation(line: 241, column: 16, scope: !70)
!133 = !DILocalVariable(name: "packets_received", scope: !70, file: !65, line: 241, type: !62)
!134 = !DILocation(line: 241, column: 34, scope: !70)
!135 = !DILocalVariable(name: "cpu", scope: !70, file: !65, line: 242, type: !8)
!136 = !DILocation(line: 242, column: 6, scope: !70)
!137 = !DILocalVariable(name: "err_code", scope: !70, file: !65, line: 243, type: !8)
!138 = !DILocation(line: 243, column: 6, scope: !70)
!139 = !DILocalVariable(name: "frequency", scope: !70, file: !65, line: 244, type: !22)
!140 = !DILocation(line: 244, column: 21, scope: !70)
!141 = !DILocalVariable(name: "wtime_usec", scope: !70, file: !65, line: 244, type: !22)
!142 = !DILocation(line: 244, column: 32, scope: !70)
!143 = !DILocalVariable(name: "wtime_s", scope: !70, file: !65, line: 244, type: !22)
!144 = !DILocation(line: 244, column: 48, scope: !70)
!145 = !DILocalVariable(name: "wtime_e", scope: !70, file: !65, line: 244, type: !22)
!146 = !DILocation(line: 244, column: 61, scope: !70)
!147 = !DILocalVariable(name: "mode", scope: !70, file: !65, line: 245, type: !38)
!148 = !DILocation(line: 245, column: 15, scope: !70)
!149 = !DILocation(line: 247, column: 2, scope: !70)
!150 = !DILocalVariable(name: "option_index", scope: !151, file: !65, line: 248, type: !8)
!151 = distinct !DILexicalBlock(scope: !70, file: !65, line: 247, column: 12)
!152 = !DILocation(line: 248, column: 7, scope: !151)
!153 = !DILocation(line: 282, column: 20, scope: !151)
!154 = !DILocation(line: 282, column: 26, scope: !151)
!155 = !DILocation(line: 282, column: 8, scope: !151)
!156 = !DILocation(line: 282, column: 6, scope: !151)
!157 = !DILocation(line: 285, column: 7, scope: !158)
!158 = distinct !DILexicalBlock(scope: !151, file: !65, line: 285, column: 7)
!159 = !DILocation(line: 285, column: 10, scope: !158)
!160 = !DILocation(line: 285, column: 7, scope: !151)
!161 = !DILocation(line: 286, column: 4, scope: !158)
!162 = !DILocation(line: 288, column: 11, scope: !151)
!163 = !DILocation(line: 288, column: 3, scope: !151)
!164 = !DILocation(line: 290, column: 15, scope: !165)
!165 = distinct !DILexicalBlock(scope: !166, file: !65, line: 290, column: 8)
!166 = distinct !DILexicalBlock(scope: !151, file: !65, line: 288, column: 15)
!167 = !DILocation(line: 290, column: 8, scope: !165)
!168 = !DILocation(line: 290, column: 30, scope: !165)
!169 = !DILocation(line: 290, column: 8, scope: !166)
!170 = !DILocation(line: 291, column: 13, scope: !171)
!171 = distinct !DILexicalBlock(scope: !165, file: !65, line: 290, column: 36)
!172 = !DILocation(line: 292, column: 5, scope: !171)
!173 = !DILocation(line: 294, column: 21, scope: !166)
!174 = !DILocation(line: 294, column: 14, scope: !166)
!175 = !DILocation(line: 294, column: 12, scope: !166)
!176 = !DILocation(line: 295, column: 4, scope: !166)
!177 = !DILocation(line: 297, column: 15, scope: !178)
!178 = distinct !DILexicalBlock(scope: !166, file: !65, line: 297, column: 8)
!179 = !DILocation(line: 297, column: 8, scope: !178)
!180 = !DILocation(line: 297, column: 33, scope: !178)
!181 = !DILocation(line: 297, column: 8, scope: !166)
!182 = !DILocation(line: 298, column: 15, scope: !183)
!183 = distinct !DILexicalBlock(scope: !178, file: !65, line: 297, column: 39)
!184 = !DILocation(line: 299, column: 5, scope: !183)
!185 = !DILocation(line: 301, column: 15, scope: !186)
!186 = distinct !DILexicalBlock(scope: !166, file: !65, line: 301, column: 8)
!187 = !DILocation(line: 301, column: 8, scope: !186)
!188 = !DILocation(line: 301, column: 31, scope: !186)
!189 = !DILocation(line: 301, column: 8, scope: !166)
!190 = !DILocation(line: 302, column: 15, scope: !191)
!191 = distinct !DILexicalBlock(scope: !186, file: !65, line: 301, column: 37)
!192 = !DILocation(line: 303, column: 5, scope: !191)
!193 = !DILocation(line: 305, column: 23, scope: !166)
!194 = !DILocation(line: 305, column: 16, scope: !166)
!195 = !DILocation(line: 305, column: 14, scope: !166)
!196 = !DILocation(line: 306, column: 4, scope: !166)
!197 = !DILocation(line: 308, column: 18, scope: !166)
!198 = !DILocation(line: 308, column: 10, scope: !166)
!199 = !DILocation(line: 308, column: 8, scope: !166)
!200 = !DILocation(line: 309, column: 4, scope: !166)
!201 = !DILocation(line: 312, column: 19, scope: !166)
!202 = !DILocation(line: 312, column: 12, scope: !166)
!203 = !DILocation(line: 312, column: 10, scope: !166)
!204 = !DILocation(line: 313, column: 17, scope: !166)
!205 = !DILocation(line: 314, column: 4, scope: !166)
!206 = !DILocation(line: 316, column: 21, scope: !166)
!207 = !DILocation(line: 316, column: 14, scope: !166)
!208 = !DILocation(line: 316, column: 12, scope: !166)
!209 = !DILocation(line: 317, column: 4, scope: !166)
!210 = !DILocation(line: 319, column: 22, scope: !166)
!211 = !DILocation(line: 319, column: 15, scope: !166)
!212 = !DILocation(line: 319, column: 13, scope: !166)
!213 = !DILocation(line: 320, column: 4, scope: !166)
!214 = !DILocation(line: 322, column: 10, scope: !166)
!215 = !DILocation(line: 323, column: 13, scope: !166)
!216 = !DILocation(line: 324, column: 4, scope: !166)
!217 = !DILocation(line: 327, column: 17, scope: !166)
!218 = !DILocation(line: 327, column: 15, scope: !166)
!219 = !DILocation(line: 328, column: 15, scope: !220)
!220 = distinct !DILexicalBlock(scope: !166, file: !65, line: 328, column: 8)
!221 = !DILocation(line: 328, column: 8, scope: !220)
!222 = !DILocation(line: 328, column: 27, scope: !220)
!223 = !DILocation(line: 328, column: 8, scope: !166)
!224 = !DILocation(line: 329, column: 8, scope: !225)
!225 = distinct !DILexicalBlock(scope: !220, file: !65, line: 328, column: 33)
!226 = !DILocation(line: 331, column: 8, scope: !225)
!227 = !DILocation(line: 331, column: 23, scope: !225)
!228 = !DILocation(line: 332, column: 4, scope: !225)
!229 = !DILocation(line: 333, column: 4, scope: !166)
!230 = !DILocation(line: 335, column: 25, scope: !166)
!231 = !DILocation(line: 335, column: 18, scope: !166)
!232 = !DILocation(line: 335, column: 16, scope: !166)
!233 = !DILocation(line: 336, column: 4, scope: !166)
!234 = !DILocation(line: 343, column: 19, scope: !166)
!235 = !DILocation(line: 343, column: 4, scope: !166)
!236 = !DILocation(line: 344, column: 4, scope: !166)
!237 = !DILocation(line: 347, column: 4, scope: !166)
!238 = !DILocation(line: 349, column: 9, scope: !166)
!239 = !DILocation(line: 350, column: 4, scope: !166)
!240 = !DILocation(line: 352, column: 9, scope: !166)
!241 = !DILocation(line: 353, column: 4, scope: !166)
!242 = !DILocation(line: 355, column: 16, scope: !166)
!243 = !DILocation(line: 356, column: 4, scope: !166)
!244 = !DILocation(line: 358, column: 10, scope: !166)
!245 = !DILocation(line: 358, column: 4, scope: !166)
!246 = !DILocation(line: 359, column: 4, scope: !166)
!247 = !DILocation(line: 362, column: 27, scope: !166)
!248 = !DILocation(line: 363, column: 4, scope: !166)
!249 = !DILocation(line: 365, column: 10, scope: !166)
!250 = !DILocation(line: 365, column: 4, scope: !166)
!251 = !DILocation(line: 366, column: 4, scope: !166)
!252 = !DILocation(line: 247, column: 2, scope: !253)
!253 = !DILexicalBlockFile(scope: !70, file: !65, discriminator: 1)
!254 = distinct !{!254, !149}
!255 = !DILocation(line: 370, column: 6, scope: !256)
!256 = distinct !DILexicalBlock(scope: !70, file: !65, line: 370, column: 6)
!257 = !DILocation(line: 370, column: 16, scope: !256)
!258 = !DILocation(line: 370, column: 13, scope: !256)
!259 = !DILocation(line: 370, column: 6, scope: !70)
!260 = !DILocation(line: 371, column: 9, scope: !261)
!261 = distinct !DILexicalBlock(scope: !256, file: !65, line: 370, column: 22)
!262 = !DILocation(line: 371, column: 3, scope: !261)
!263 = !DILocation(line: 372, column: 3, scope: !261)
!264 = !DILocation(line: 375, column: 13, scope: !70)
!265 = !DILocation(line: 375, column: 18, scope: !70)
!266 = !DILocation(line: 375, column: 2, scope: !70)
!267 = !DILocation(line: 376, column: 13, scope: !70)
!268 = !DILocation(line: 376, column: 2, scope: !70)
!269 = !DILocation(line: 379, column: 20, scope: !70)
!270 = !DILocation(line: 379, column: 29, scope: !70)
!271 = !DILocation(line: 379, column: 40, scope: !70)
!272 = !DILocation(line: 379, column: 9, scope: !70)
!273 = !DILocation(line: 379, column: 7, scope: !70)
!274 = !DILocation(line: 381, column: 6, scope: !275)
!275 = distinct !DILexicalBlock(scope: !70, file: !65, line: 381, column: 6)
!276 = !DILocation(line: 381, column: 11, scope: !275)
!277 = !DILocation(line: 381, column: 6, scope: !70)
!278 = !DILocation(line: 382, column: 10, scope: !279)
!279 = distinct !DILexicalBlock(scope: !275, file: !65, line: 381, column: 19)
!280 = !DILocation(line: 383, column: 17, scope: !279)
!281 = !DILocation(line: 383, column: 26, scope: !279)
!282 = !DILocation(line: 383, column: 37, scope: !279)
!283 = !DILocation(line: 384, column: 19, scope: !279)
!284 = !DILocation(line: 384, column: 25, scope: !279)
!285 = !DILocation(line: 384, column: 4, scope: !279)
!286 = !DILocation(line: 382, column: 3, scope: !279)
!287 = !DILocation(line: 385, column: 8, scope: !279)
!288 = !DILocation(line: 385, column: 6, scope: !279)
!289 = !DILocation(line: 386, column: 3, scope: !279)
!290 = !DILocation(line: 388, column: 6, scope: !291)
!291 = distinct !DILexicalBlock(scope: !70, file: !65, line: 388, column: 6)
!292 = !DILocation(line: 388, column: 6, scope: !70)
!293 = !DILocation(line: 389, column: 31, scope: !294)
!294 = distinct !DILexicalBlock(scope: !291, file: !65, line: 388, column: 30)
!295 = !DILocation(line: 389, column: 36, scope: !294)
!296 = !DILocation(line: 389, column: 3, scope: !294)
!297 = !DILocation(line: 390, column: 3, scope: !294)
!298 = !DILocation(line: 396, column: 2, scope: !70)
!299 = distinct !{!299, !298}
!300 = !DILocation(line: 396, column: 11, scope: !301)
!301 = !DILexicalBlockFile(scope: !302, file: !65, discriminator: 1)
!302 = distinct !DILexicalBlock(scope: !303, file: !65, line: 396, column: 11)
!303 = distinct !DILexicalBlock(scope: !70, file: !65, line: 396, column: 5)
!304 = !DILocation(line: 396, column: 1, scope: !305)
!305 = !DILexicalBlockFile(scope: !302, file: !65, discriminator: 2)
!306 = !DILocation(line: 396, column: 42, scope: !305)
!307 = !DILocation(line: 396, column: 54, scope: !305)
!308 = !DILocation(line: 396, column: 25, scope: !305)
!309 = !DILocation(line: 396, column: 61, scope: !310)
!310 = !DILexicalBlockFile(scope: !303, file: !65, discriminator: 3)
!311 = !DILocation(line: 397, column: 6, scope: !312)
!312 = distinct !DILexicalBlock(scope: !70, file: !65, line: 397, column: 6)
!313 = !DILocation(line: 397, column: 14, scope: !312)
!314 = !DILocation(line: 397, column: 6, scope: !70)
!315 = !DILocation(line: 398, column: 11, scope: !312)
!316 = !DILocation(line: 398, column: 3, scope: !312)
!317 = !DILocation(line: 400, column: 2, scope: !70)
!318 = !DILocation(line: 401, column: 38, scope: !70)
!319 = !DILocation(line: 401, column: 12, scope: !70)
!320 = !DILocation(line: 401, column: 10, scope: !70)
!321 = !DILocation(line: 403, column: 2, scope: !70)
!322 = !DILocation(line: 403, column: 10, scope: !253)
!323 = !DILocation(line: 403, column: 9, scope: !253)
!324 = !DILocation(line: 403, column: 2, scope: !253)
!325 = !DILocalVariable(name: "t0", scope: !326, file: !65, line: 404, type: !327)
!326 = distinct !DILexicalBlock(scope: !70, file: !65, line: 403, column: 24)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !328, line: 30, size: 128, align: 64, elements: !329)
!328 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop")
!329 = !{!330, !334}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !327, file: !328, line: 32, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !332, line: 139, baseType: !333)
!332 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop")
!333 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !327, file: !328, line: 33, baseType: !335, size: 64, align: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !332, line: 141, baseType: !333)
!336 = !DILocation(line: 404, column: 18, scope: !326)
!337 = !DILocalVariable(name: "t1", scope: !326, file: !65, line: 404, type: !327)
!338 = !DILocation(line: 404, column: 22, scope: !326)
!339 = !DILocation(line: 406, column: 8, scope: !340)
!340 = distinct !DILexicalBlock(scope: !326, file: !65, line: 406, column: 7)
!341 = !DILocation(line: 406, column: 21, scope: !340)
!342 = !DILocation(line: 406, column: 25, scope: !343)
!343 = !DILexicalBlockFile(scope: !340, file: !65, discriminator: 1)
!344 = !DILocation(line: 406, column: 7, scope: !343)
!345 = !DILocation(line: 407, column: 4, scope: !340)
!346 = !DILocation(line: 409, column: 3, scope: !326)
!347 = !DILocation(line: 410, column: 16, scope: !326)
!348 = !DILocation(line: 410, column: 22, scope: !326)
!349 = !DILocation(line: 410, column: 31, scope: !326)
!350 = !DILocation(line: 410, column: 37, scope: !326)
!351 = !DILocation(line: 410, column: 8, scope: !326)
!352 = !DILocation(line: 410, column: 6, scope: !326)
!353 = !DILocation(line: 411, column: 3, scope: !326)
!354 = !DILocation(line: 413, column: 15, scope: !326)
!355 = !DILocation(line: 414, column: 7, scope: !356)
!356 = distinct !DILexicalBlock(scope: !326, file: !65, line: 414, column: 7)
!357 = !DILocation(line: 414, column: 10, scope: !356)
!358 = !DILocation(line: 414, column: 7, scope: !326)
!359 = !DILocation(line: 415, column: 9, scope: !360)
!360 = distinct !DILexicalBlock(scope: !361, file: !65, line: 415, column: 8)
!361 = distinct !DILexicalBlock(scope: !356, file: !65, line: 414, column: 16)
!362 = !DILocation(line: 415, column: 15, scope: !360)
!363 = !DILocation(line: 415, column: 19, scope: !364)
!364 = !DILexicalBlockFile(scope: !360, file: !65, discriminator: 1)
!365 = !DILocation(line: 415, column: 8, scope: !364)
!366 = !DILocation(line: 418, column: 12, scope: !367)
!367 = distinct !DILexicalBlock(scope: !360, file: !65, line: 415, column: 26)
!368 = !DILocation(line: 418, column: 33, scope: !367)
!369 = !DILocation(line: 418, column: 26, scope: !367)
!370 = !DILocation(line: 418, column: 21, scope: !367)
!371 = !DILocation(line: 419, column: 12, scope: !367)
!372 = !DILocation(line: 419, column: 36, scope: !367)
!373 = !DILocation(line: 419, column: 43, scope: !367)
!374 = !DILocation(line: 419, column: 62, scope: !367)
!375 = !DILocation(line: 419, column: 53, scope: !367)
!376 = !DILocation(line: 419, column: 81, scope: !367)
!377 = !DILocation(line: 419, column: 88, scope: !367)
!378 = !DILocation(line: 419, column: 107, scope: !367)
!379 = !DILocation(line: 419, column: 98, scope: !367)
!380 = !DILocation(line: 419, column: 71, scope: !367)
!381 = !DILocation(line: 419, column: 19, scope: !367)
!382 = !DILocation(line: 416, column: 5, scope: !367)
!383 = !DILocation(line: 420, column: 4, scope: !367)
!384 = !DILocation(line: 421, column: 20, scope: !361)
!385 = !DILocation(line: 422, column: 3, scope: !361)
!386 = !DILocation(line: 424, column: 8, scope: !326)
!387 = !DILocation(line: 425, column: 8, scope: !388)
!388 = distinct !DILexicalBlock(scope: !326, file: !65, line: 425, column: 7)
!389 = !DILocation(line: 425, column: 21, scope: !388)
!390 = !DILocation(line: 425, column: 25, scope: !391)
!391 = !DILexicalBlockFile(scope: !388, file: !65, discriminator: 1)
!392 = !DILocation(line: 425, column: 7, scope: !391)
!393 = !DILocation(line: 426, column: 4, scope: !388)
!394 = !DILocation(line: 428, column: 7, scope: !395)
!395 = distinct !DILexicalBlock(scope: !326, file: !65, line: 428, column: 7)
!396 = !DILocation(line: 428, column: 7, scope: !326)
!397 = !DILocation(line: 429, column: 11, scope: !395)
!398 = !DILocation(line: 429, column: 4, scope: !395)
!399 = !DILocation(line: 431, column: 7, scope: !400)
