; ModuleID = './libvmbackup_la-stateMachine.o.i'
source_filename = "./libvmbackup_la-stateMachine.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.VmBackupState = type { %struct.ToolsAppCtx*, %struct.VmBackupOp*, i8*, %struct.GStaticMutex, i8*, i8*, i32, %struct._GSource*, %struct._GSource*, %struct._GSource*, i8 (%struct.VmBackupState*)*, i8, i8, i8, i8, i8*, i8, i8, i8, i8, i8*, i32, i8*, i8*, i8*, i64, i8*, i32, i32, %struct.VmBackupSyncProvider*, %struct.VmBackupSyncCompleter*, i32, i32, i8, i8, i8 }
%struct.ToolsAppCtx = type { i32, i8*, i32, i32, %struct._GMainLoop*, %struct._RpcChannel*, %struct._GKeyFile*, i32, i32, i8**, i8* }
%struct._GMainLoop = type opaque
%struct._RpcChannel = type opaque
%struct._GKeyFile = type opaque
%struct.VmBackupOp = type { i32 (%struct.VmBackupOp*)*, void (%struct.VmBackupOp*)*, void (%struct.VmBackupOp*)* }
%struct.GStaticMutex = type { %union._GMutex*, %union.pthread_mutex_t }
%union._GMutex = type { i8* }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }

!36 = !DIEnumerator(name: "VMBACKUP_MSTATE_SYNC_FREEZE_WAIT", value: 2)
!37 = !DIEnumerator(name: "VMBACKUP_MSTATE_SYNC_FREEZE", value: 3)
!38 = !DIEnumerator(name: "VMBACKUP_MSTATE_SYNC_THAW", value: 4)
!39 = !DIEnumerator(name: "VMBACKUP_MSTATE_SCRIPT_THAW", value: 5)
!40 = !DIEnumerator(name: "VMBACKUP_MSTATE_COMPLETE_WAIT", value: 6)
!41 = !DIEnumerator(name: "VMBACKUP_MSTATE_SCRIPT_ERROR", value: 7)
!42 = !DIEnumerator(name: "VMBACKUP_MSTATE_SYNC_ERROR", value: 8)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 50, size: 32, align: 32, elements: !44)
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "VMBACKUP_FREEZE_PENDING", value: 0)
!46 = !DIEnumerator(name: "VMBACKUP_FREEZE_FINISHED", value: 1)
!47 = !DIEnumerator(name: "VMBACKUP_FREEZE_CANCELED", value: 2)
!48 = !DIEnumerator(name: "VMBACKUP_FREEZE_ERROR", value: 3)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 78, size: 32, align: 32, elements: !51)
!50 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/guestrpc/vmbackup.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DIEnumerator(name: "VMBACKUP_SUCCESS", value: 0)
!53 = !DIEnumerator(name: "VMBACKUP_INVALID_STATE", value: 1)
!54 = !DIEnumerator(name: "VMBACKUP_SCRIPT_ERROR", value: 2)
!55 = !DIEnumerator(name: "VMBACKUP_SYNC_ERROR", value: 3)
!56 = !DIEnumerator(name: "VMBACKUP_REMOTE_ABORT", value: 4)
!57 = !DIEnumerator(name: "VMBACKUP_UNEXPECTED_ERROR", value: 5)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 57, size: 32, align: 32, elements: !59)
!59 = !{!60, !61, !62}
!60 = !DIEnumerator(name: "VMBACKUP_SCRIPT_FREEZE", value: 0)
!61 = !DIEnumerator(name: "VMBACKUP_SCRIPT_FREEZE_FAIL", value: 1)
!62 = !DIEnumerator(name: "VMBACKUP_SCRIPT_THAW", value: 2)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GuestQuiesceParamsVersion", file: !64, line: 17, size: 32, align: 32, elements: !65)
!64 = !DIFile(filename: "guestQuiesce.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!65 = !{!66, !67}
!66 = !DIEnumerator(name: "GUESTQUIESCEPARAMS_V1", value: 1)
!67 = !DIEnumerator(name: "GUESTQUIESCEPARAMS_V2", value: 2)
!68 = !{!69, !70, !80, !90, !86, !95, !347}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !71, line: 155, baseType: !72)
!71 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!75, !79}
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !76, line: 50, baseType: !77)
!76 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !76, line: 49, baseType: !78)
!78 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !76, line: 77, baseType: !69)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeClass", file: !82, line: 389, baseType: !83)
!82 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gtype.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeClass", file: !82, line: 406, size: 64, align: 64, elements: !84)
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "g_type", scope: !83, file: !82, line: 409, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "GType", file: !82, line: 382, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !88, line: 66, baseType: !89)
!88 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!89 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeInstance", file: !82, line: 391, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeInstance", file: !82, line: 416, size: 64, align: 64, elements: !93)
!93 = !{!94}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "g_class", scope: !92, file: !82, line: 419, baseType: !80, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupState", file: !26, line: 141, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VmBackupState", file: !26, line: 104, size: 1984, align: 64, elements: !98)
!98 = !{!99, !134, !150, !151, !198, !200, !201, !202, !276, !277, !278, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !296, !297, !298, !299, !300, !305, !306, !308, !310, !330, !342, !343, !344, !345, !346}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !97, file: !26, line: 105, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCtx", file: !16, line: 274, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCtx", file: !16, line: 241, size: 576, align: 64, elements: !103)
!103 = !{!104, !106, !111, !112, !113, !117, !122, !127, !128, !129, !133}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !102, file: !16, line: 243, baseType: !105, size: 32, align: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreAPI", file: !16, line: 234, baseType: !15)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !102, file: !16, line: 245, baseType: !107, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !76, line: 46, baseType: !110)
!110 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "isVMware", scope: !102, file: !16, line: 247, baseType: !75, size: 32, align: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "errorCode", scope: !102, file: !16, line: 249, baseType: !78, size: 32, align: 32, offset: 160)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mainLoop", scope: !102, file: !16, line: 251, baseType: !114, size: 64, align: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !71, line: 56, baseType: !116)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !71, line: 56, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !102, file: !16, line: 253, baseType: !118, size: 64, align: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !120, line: 48, baseType: !121)
!120 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !120, line: 48, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !102, file: !16, line: 255, baseType: !123, size: 64, align: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !125, line: 48, baseType: !126)
!125 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !125, line: 48, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "blockFD", scope: !102, file: !16, line: 261, baseType: !78, size: 32, align: 32, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "uinputFD", scope: !102, file: !16, line: 263, baseType: !78, size: 32, align: 32, offset: 416)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !102, file: !16, line: 265, baseType: !130, size: 64, align: 64, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "serviceObj", scope: !102, file: !16, line: 273, baseType: !79, size: 64, align: 64, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "currentOp", scope: !97, file: !26, line: 106, baseType: !135, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupOp", file: !26, line: 86, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VmBackupOp", file: !26, line: 82, size: 192, align: 64, elements: !138)
!138 = !{!139, !145, !149}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "queryFn", scope: !137, file: !26, line: 83, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupOpStatus", file: !26, line: 48, baseType: !25)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "releaseFn", scope: !137, file: !26, line: 84, baseType: !146, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !144}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "cancelFn", scope: !137, file: !26, line: 85, baseType: !146, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "currentOpName", scope: !97, file: !26, line: 107, baseType: !131, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "opLock", scope: !97, file: !26, line: 108, baseType: !152, size: 384, align: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "GStaticMutex", file: !153, line: 140, baseType: !154)
!153 = !DIFile(filename: "/usr/include/glib-2.0/glib/deprecated/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !153, line: 133, size: 384, align: 64, elements: !155)
!155 = !{!156, !169}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !154, file: !153, line: 135, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMutex", file: !159, line: 51, baseType: !160)
!159 = !DIFile(filename: "/usr/include/glib-2.0/glib/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!160 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GMutex", file: !159, line: 58, size: 64, align: 64, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !160, file: !159, line: 61, baseType: !79, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !160, file: !159, line: 62, baseType: !164, size: 64, align: 32)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 64, align: 32, elements: !167)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !76, line: 55, baseType: !166)
!166 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!167 = !{!168}
!168 = !DISubrange(count: 2)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !154, file: !153, line: 138, baseType: !170, size: 320, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !171, line: 128, baseType: !172)
!171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!172 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !171, line: 90, size: 320, align: 64, elements: !173)
!173 = !{!174, !192, !196}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !172, file: !171, line: 125, baseType: !175, size: 320, align: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !171, line: 92, size: 320, align: 64, elements: !176)
!176 = !{!177, !178, !179, !180, !181, !182, !184, !185}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !175, file: !171, line: 94, baseType: !78, size: 32, align: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !175, file: !171, line: 95, baseType: !166, size: 32, align: 32, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !175, file: !171, line: 96, baseType: !78, size: 32, align: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !175, file: !171, line: 98, baseType: !166, size: 32, align: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !175, file: !171, line: 102, baseType: !78, size: 32, align: 32, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !175, file: !171, line: 104, baseType: !183, size: 16, align: 16, offset: 160)
!183 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !175, file: !171, line: 105, baseType: !183, size: 16, align: 16, offset: 176)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !175, file: !171, line: 106, baseType: !186, size: 128, align: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !171, line: 79, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !171, line: 75, size: 128, align: 64, elements: !188)
!188 = !{!189, !191}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !187, file: !171, line: 77, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !187, file: !171, line: 78, baseType: !190, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !172, file: !171, line: 126, baseType: !193, size: 320, align: 8)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 320, align: 8, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 40)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !172, file: !171, line: 127, baseType: !197, size: 64, align: 64)
!197 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "volumes", scope: !97, file: !26, line: 109, baseType: !199, size: 64, align: 64, offset: 576)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "snapshots", scope: !97, file: !26, line: 110, baseType: !199, size: 64, align: 64, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pollPeriod", scope: !97, file: !26, line: 111, baseType: !165, size: 32, align: 32, offset: 704)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "abortTimer", scope: !97, file: !26, line: 112, baseType: !203, size: 64, align: 64, offset: 768)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !71, line: 64, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !71, line: 171, size: 768, align: 64, elements: !206)
!206 = !{!207, !208, !224, !253, !254, !258, !259, !260, !261, !269, !270, !271, !272}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !205, file: !71, line: 174, baseType: !79, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !205, file: !71, line: 175, baseType: !209, size: 64, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !71, line: 77, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !71, line: 196, size: 192, align: 64, elements: !212)
!212 = !{!213, !217, !218}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !211, file: !71, line: 198, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{null, !79}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !211, file: !71, line: 199, baseType: !214, size: 64, align: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !211, file: !71, line: 200, baseType: !219, size: 64, align: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !79, !203, !222, !223}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !205, file: !71, line: 177, baseType: !225, size: 64, align: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !71, line: 130, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !71, line: 214, size: 384, align: 64, elements: !229)
!229 = !{!230, !235, !239, !243, !247, !248}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !228, file: !71, line: 216, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!75, !203, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !228, file: !71, line: 218, baseType: !236, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!75, !203}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !228, file: !71, line: 219, baseType: !240, size: 64, align: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!75, !203, !70, !79}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !228, file: !71, line: 222, baseType: !244, size: 64, align: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !203}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !228, file: !71, line: 226, baseType: !70, size: 64, align: 64, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !228, file: !71, line: 227, baseType: !249, size: 64, align: 64, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !71, line: 212, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{null}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !205, file: !71, line: 178, baseType: !165, size: 32, align: 32, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !205, file: !71, line: 180, baseType: !255, size: 64, align: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !71, line: 48, baseType: !257)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !71, line: 48, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !205, file: !71, line: 182, baseType: !77, size: 32, align: 32, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !205, file: !71, line: 183, baseType: !165, size: 32, align: 32, offset: 352)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !205, file: !71, line: 184, baseType: !165, size: 32, align: 32, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !205, file: !71, line: 186, baseType: !262, size: 64, align: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !264, line: 37, baseType: !265)
!264 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !264, line: 39, size: 128, align: 64, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !265, file: !264, line: 41, baseType: !79, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !265, file: !264, line: 42, baseType: !262, size: 64, align: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !205, file: !71, line: 188, baseType: !203, size: 64, align: 64, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !71, line: 189, baseType: !203, size: 64, align: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !205, file: !71, line: 191, baseType: !199, size: 64, align: 64, offset: 640)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !205, file: !71, line: 193, baseType: !273, size: 64, align: 64, offset: 704)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !71, line: 65, baseType: !275)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !71, line: 65, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "timerEvent", scope: !97, file: !26, line: 113, baseType: !203, size: 64, align: 64, offset: 832)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "keepAlive", scope: !97, file: !26, line: 114, baseType: !203, size: 64, align: 64, offset: 896)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !97, file: !26, line: 115, baseType: !279, size: 64, align: 64, offset: 960)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!282, !284}
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !283, line: 230, baseType: !110)
!283 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "forceRequeue", scope: !97, file: !26, line: 116, baseType: !282, size: 8, align: 8, offset: 1024)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "generateManifests", scope: !97, file: !26, line: 117, baseType: !282, size: 8, align: 8, offset: 1032)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "quiesceApps", scope: !97, file: !26, line: 118, baseType: !282, size: 8, align: 8, offset: 1040)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "quiesceFS", scope: !97, file: !26, line: 119, baseType: !282, size: 8, align: 8, offset: 1048)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "excludedFileSystems", scope: !97, file: !26, line: 120, baseType: !199, size: 64, align: 64, offset: 1088)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "allowHWProvider", scope: !97, file: !26, line: 121, baseType: !282, size: 8, align: 8, offset: 1152)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "execScripts", scope: !97, file: !26, line: 122, baseType: !282, size: 8, align: 8, offset: 1160)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "enableNullDriver", scope: !97, file: !26, line: 123, baseType: !282, size: 8, align: 8, offset: 1168)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "needsPriv", scope: !97, file: !26, line: 124, baseType: !282, size: 8, align: 8, offset: 1176)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "scriptArg", scope: !97, file: !26, line: 125, baseType: !295, size: 64, align: 64, offset: 1216)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !97, file: !26, line: 126, baseType: !165, size: 32, align: 32, offset: 1280)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !97, file: !26, line: 127, baseType: !79, size: 64, align: 64, offset: 1344)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "scripts", scope: !97, file: !26, line: 128, baseType: !69, size: 64, align: 64, offset: 1408)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "configDir", scope: !97, file: !26, line: 129, baseType: !131, size: 64, align: 64, offset: 1472)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "currentScript", scope: !97, file: !26, line: 130, baseType: !301, size: 64, align: 64, offset: 1536)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !302, line: 109, baseType: !303)
!302 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !304, line: 172, baseType: !197)
!304 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!305 = !DIDerivedType(tag: DW_TAG_member, name: "errorMsg", scope: !97, file: !26, line: 131, baseType: !295, size: 64, align: 64, offset: 1600)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "machineState", scope: !97, file: !26, line: 132, baseType: !307, size: 32, align: 32, offset: 1664)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupMState", file: !26, line: 73, baseType: !32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "freezeStatus", scope: !97, file: !26, line: 133, baseType: !309, size: 32, align: 32, offset: 1696)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupFreezeStatus", file: !26, line: 55, baseType: !43)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "provider", scope: !97, file: !26, line: 134, baseType: !311, size: 64, align: 64, offset: 1728)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VmBackupSyncProvider", file: !26, line: 154, size: 256, align: 64, elements: !313)
!313 = !{!314, !320, !325, !329}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !312, file: !26, line: 158, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCorePoolCb", file: !316, line: 54, baseType: !317)
!316 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/threadPool.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !100, !79}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "snapshotDone", scope: !312, file: !26, line: 160, baseType: !321, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupProviderCallback", file: !26, line: 144, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!282, !95, !69}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !312, file: !26, line: 161, baseType: !326, size: 64, align: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !311}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !312, file: !26, line: 162, baseType: !69, size: 64, align: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "completer", scope: !97, file: !26, line: 135, baseType: !331, size: 64, align: 64, offset: 1792)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VmBackupSyncCompleter", file: !26, line: 171, size: 256, align: 64, elements: !333)
!333 = !{!334, !336, !337, !341}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !332, file: !26, line: 172, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupCompleterCallback", file: !26, line: 145, baseType: !322)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "snapshotCompleted", scope: !332, file: !26, line: 173, baseType: !335, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !332, file: !26, line: 174, baseType: !338, size: 64, align: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !331}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !332, file: !26, line: 175, baseType: !69, size: 64, align: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "vssBackupContext", scope: !97, file: !26, line: 136, baseType: !77, size: 32, align: 32, offset: 1856)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "vssBackupType", scope: !97, file: !26, line: 137, baseType: !77, size: 32, align: 32, offset: 1888)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "vssBootableSystemState", scope: !97, file: !26, line: 138, baseType: !282, size: 8, align: 8, offset: 1920)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "vssPartialFileSupport", scope: !97, file: !26, line: 139, baseType: !282, size: 8, align: 8, offset: 1928)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "vssUseDefault", scope: !97, file: !26, line: 140, baseType: !282, size: 8, align: 8, offset: 1936)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestQuiesceParams", file: !64, line: 53, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestQuiesceParams", file: !64, line: 46, size: 128, align: 64, elements: !350)
!350 = !{!351, !353}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ver", scope: !349, file: !64, line: 47, baseType: !352, size: 32, align: 32)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestQuiesceParamsVersion", file: !64, line: 21, baseType: !63)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "GuestQuiesceParams_u", scope: !349, file: !64, line: 51, baseType: !354, size: 64, align: 64, offset: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !349, file: !64, line: 48, size: 64, align: 64, elements: !355)
!355 = !{!356, !371}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "guestQuiesceParamsV1", scope: !354, file: !64, line: 49, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestQuiesceParamsV1", file: !64, line: 25, size: 256, align: 64, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !365, !366, !370}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "createManifest", scope: !358, file: !64, line: 26, baseType: !282, size: 8, align: 8)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "quiesceApps", scope: !358, file: !64, line: 27, baseType: !282, size: 8, align: 8, offset: 8)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "quiesceFS", scope: !358, file: !64, line: 28, baseType: !282, size: 8, align: 8, offset: 16)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "writableSnapshot", scope: !358, file: !64, line: 29, baseType: !282, size: 8, align: 8, offset: 24)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "execScripts", scope: !358, file: !64, line: 30, baseType: !282, size: 8, align: 8, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "scriptArg", scope: !358, file: !64, line: 31, baseType: !199, size: 64, align: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !358, file: !64, line: 32, baseType: !367, size: 32, align: 32, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !283, line: 173, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !369, line: 51, baseType: !166)
!369 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!370 = !DIDerivedType(tag: DW_TAG_member, name: "diskUuids", scope: !358, file: !64, line: 33, baseType: !199, size: 64, align: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "guestQuiesceParamsV2", scope: !354, file: !64, line: 50, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestQuiesceParamsV2", file: !64, line: 37, size: 384, align: 64, elements: !374)
!374 = !{!375, !376, !377, !378, !379}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "paramsV1", scope: !373, file: !64, line: 38, baseType: !358, size: 256, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "vssBackupContext", scope: !373, file: !64, line: 39, baseType: !367, size: 32, align: 32, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "vssBackupType", scope: !373, file: !64, line: 40, baseType: !367, size: 32, align: 32, offset: 288)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "vssBootableSystemState", scope: !373, file: !64, line: 41, baseType: !282, size: 8, align: 8, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "vssPartialFileSupport", scope: !373, file: !64, line: 42, baseType: !282, size: 8, align: 8, offset: 328)
!380 = !{!381, !386, !411}
!381 = distinct !DIGlobalVariable(name: "vm_version", scope: !0, file: !382, line: 57, type: !383, isLocal: false, isDefinition: true, variable: [20 x i8]* @vm_version)
!382 = !DIFile(filename: "stateMachine.c", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 160, align: 8, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 20)
!386 = distinct !DIGlobalVariable(name: "regData", scope: !387, file: !382, line: 1383, type: !391, isLocal: true, isDefinition: true, variable: %struct.ToolsPluginData* @ToolsOnLoad.regData)
!387 = distinct !DISubprogram(name: "ToolsOnLoad", scope: !382, file: !382, line: 1381, type: !388, isLocal: false, isDefinition: true, scopeLine: 1382, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !410)
!388 = !DISubroutineType(types: !389)
!389 = !{!390, !100}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginData", file: !16, line: 545, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginData", file: !16, line: 501, size: 256, align: 64, elements: !393)
!393 = !{!394, !395, !403, !409}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !392, file: !16, line: 503, baseType: !131, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !392, file: !16, line: 508, baseType: !396, size: 64, align: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !398, line: 37, baseType: !399)
!398 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !398, line: 41, size: 128, align: 64, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !399, file: !398, line: 43, baseType: !295, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !399, file: !398, line: 44, baseType: !165, size: 32, align: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "errorCb", scope: !392, file: !16, line: 539, baseType: !404, size: 64, align: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!75, !100, !407, !79, !408}
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppType", file: !16, line: 360, baseType: !19)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !392, file: !16, line: 544, baseType: !79, size: 64, align: 64, offset: 192)
!410 = !{}
!411 = distinct !DIGlobalVariable(name: "gBackupState", scope: !0, file: !382, line: 90, type: !95, isLocal: true, isDefinition: true, variable: %struct.VmBackupState** @gBackupState)
!412 = !{i32 2, !"Dwarf Version", i32 4}
!413 = !{i32 2, !"Debug Info Version", i32 3}
!414 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!415 = distinct !DISubprogram(name: "VmBackup_SendEvent", scope: !382, file: !382, line: 212, type: !416, isLocal: false, isDefinition: true, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !410)
!416 = !DISubroutineType(types: !417)
!417 = !{!282, !131, !418, !131}
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!419 = !DILocalVariable(name: "event", arg: 1, scope: !415, file: !382, line: 212, type: !131)
!420 = !DIExpression()
!421 = !DILocation(line: 212, column: 32, scope: !415)
!422 = !DILocalVariable(name: "code", arg: 2, scope: !415, file: !382, line: 213, type: !418)
!423 = !DILocation(line: 213, column: 33, scope: !415)
!424 = !DILocalVariable(name: "desc", arg: 3, scope: !415, file: !382, line: 214, type: !131)
!425 = !DILocation(line: 214, column: 32, scope: !415)
!426 = !DILocalVariable(name: "success", scope: !415, file: !382, line: 216, type: !282)
!427 = !DILocation(line: 216, column: 9, scope: !415)
!428 = !DILocalVariable(name: "result", scope: !415, file: !382, line: 217, type: !199)
!429 = !DILocation(line: 217, column: 10, scope: !415)
!430 = !DILocalVariable(name: "resultLen", scope: !415, file: !382, line: 218, type: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !432, line: 216, baseType: !89)
!432 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!433 = !DILocation(line: 218, column: 11, scope: !415)
!434 = !DILocalVariable(name: "msg", scope: !415, file: !382, line: 219, type: !295)
!435 = !DILocation(line: 219, column: 11, scope: !415)
!436 = !DILocation(line: 223, column: 4, scope: !415)
!437 = !DILocation(line: 224, column: 8, scope: !438)
!438 = distinct !DILexicalBlock(scope: !415, file: !382, line: 224, column: 8)
!439 = !DILocation(line: 224, column: 22, scope: !438)
!440 = !DILocation(line: 224, column: 32, scope: !438)
!441 = !DILocation(line: 224, column: 8, scope: !415)
!442 = !DILocation(line: 225, column: 24, scope: !443)
!443 = distinct !DILexicalBlock(scope: !438, file: !382, line: 224, column: 40)
!444 = !DILocation(line: 225, column: 38, scope: !443)
!445 = !DILocation(line: 225, column: 7, scope: !443)
!446 = !DILocation(line: 226, column: 22, scope: !443)
!447 = !DILocation(line: 226, column: 36, scope: !443)
!448 = !DILocation(line: 226, column: 7, scope: !443)
!449 = !DILocation(line: 227, column: 4, scope: !443)
!450 = !DILocation(line: 230, column: 26, scope: !415)
!451 = !DILocation(line: 230, column: 33, scope: !415)
!452 = !DILocation(line: 230, column: 39, scope: !415)
!453 = !DILocation(line: 229, column: 10, scope: !415)
!454 = !DILocation(line: 229, column: 8, scope: !415)
!455 = !DILocation(line: 231, column: 74, scope: !415)
!456 = !DILocation(line: 231, column: 4, scope: !415)
!457 = !DILocation(line: 234, column: 8, scope: !458)
!458 = distinct !DILexicalBlock(scope: !415, file: !382, line: 234, column: 8)
!459 = !DILocation(line: 234, column: 22, scope: !458)
!460 = !DILocation(line: 234, column: 8, scope: !415)
!461 = !DILocation(line: 235, column: 37, scope: !462)
!462 = distinct !DILexicalBlock(scope: !458, file: !382, line: 234, column: 33)
!463 = !DILocation(line: 235, column: 17, scope: !462)
!464 = !DILocation(line: 235, column: 15, scope: !462)
!465 = !DILocation(line: 236, column: 4, scope: !462)
!466 = !DILocation(line: 237, column: 33, scope: !467)
!467 = distinct !DILexicalBlock(scope: !458, file: !382, line: 236, column: 11)
!468 = !DILocation(line: 237, column: 47, scope: !467)
!469 = !DILocation(line: 237, column: 52, scope: !467)
!470 = !DILocation(line: 238, column: 33, scope: !467)
!471 = !DILocation(line: 238, column: 45, scope: !467)
!472 = !DILocation(line: 238, column: 38, scope: !467)
!473 = !DILocation(line: 238, column: 50, scope: !467)
!474 = !DILocation(line: 237, column: 17, scope: !467)
!475 = !DILocation(line: 237, column: 15, scope: !467)
!476 = !DILocation(line: 240, column: 12, scope: !477)
!477 = distinct !DILexicalBlock(scope: !467, file: !382, line: 240, column: 11)
!478 = !DILocation(line: 240, column: 11, scope: !467)
!479 = !DILocalVariable(name: "privErr", scope: !480, file: !382, line: 241, type: !131)
!480 = distinct !DILexicalBlock(scope: !477, file: !382, line: 240, column: 21)
!481 = !DILocation(line: 241, column: 22, scope: !480)
!482 = !DILocation(line: 242, column: 14, scope: !483)
!483 = distinct !DILexicalBlock(scope: !480, file: !382, line: 242, column: 14)
!484 = !DILocation(line: 242, column: 33, scope: !483)
!485 = !DILocation(line: 242, column: 26, scope: !483)
!486 = !DILocation(line: 242, column: 24, scope: !483)
!487 = !DILocation(line: 242, column: 42, scope: !483)
!488 = !DILocation(line: 243, column: 22, scope: !483)
!489 = !DILocation(line: 243, column: 30, scope: !483)
!490 = !DILocation(line: 243, column: 46, scope: !483)
!491 = !DILocation(line: 243, column: 39, scope: !483)
!492 = !DILocation(line: 243, column: 14, scope: !493)
!493 = !DILexicalBlockFile(scope: !483, file: !382, discriminator: 1)
!494 = !DILocation(line: 243, column: 56, scope: !483)
!495 = !DILocation(line: 242, column: 14, scope: !496)
!496 = !DILexicalBlockFile(scope: !480, file: !382, discriminator: 1)
!497 = !DILocation(line: 244, column: 81, scope: !498)
!498 = distinct !DILexicalBlock(scope: !483, file: !382, line: 243, column: 62)
!499 = !DILocation(line: 244, column: 13, scope: !498)
!500 = !DILocation(line: 245, column: 21, scope: !498)
!501 = !DILocation(line: 245, column: 13, scope: !498)
!502 = !DILocation(line: 255, column: 13, scope: !498)
!503 = !DILocation(line: 255, column: 27, scope: !498)
!504 = !DILocation(line: 255, column: 37, scope: !498)
!505 = !DILocation(line: 257, column: 84, scope: !498)
!506 = !DILocation(line: 257, column: 13, scope: !498)
!507 = !DILocation(line: 258, column: 43, scope: !498)
!508 = !DILocation(line: 258, column: 23, scope: !498)
!509 = !DILocation(line: 258, column: 21, scope: !498)
!510 = !DILocation(line: 259, column: 10, scope: !498)
!511 = !DILocation(line: 260, column: 13, scope: !512)
!512 = distinct !DILexicalBlock(scope: !483, file: !382, line: 259, column: 17)
!513 = !DILocation(line: 260, column: 27, scope: !512)
!514 = !DILocation(line: 260, column: 37, scope: !512)
!515 = !DILocation(line: 262, column: 7, scope: !480)
!516 = !DILocation(line: 270, column: 9, scope: !517)
!517 = distinct !DILexicalBlock(scope: !415, file: !382, line: 270, column: 8)
!518 = !DILocation(line: 270, column: 8, scope: !415)
!519 = !DILocation(line: 271, column: 99, scope: !520)
!520 = distinct !DILexicalBlock(scope: !517, file: !382, line: 270, column: 18)
!521 = !DILocation(line: 271, column: 104, scope: !520)
!522 = !DILocation(line: 271, column: 7, scope: !520)
!523 = !DILocation(line: 273, column: 4, scope: !520)
!524 = !DILocation(line: 274, column: 12, scope: !415)
!525 = !DILocation(line: 274, column: 4, scope: !415)
!526 = !DILocation(line: 275, column: 11, scope: !415)
!527 = !DILocation(line: 275, column: 4, scope: !415)
!528 = !DILocation(line: 277, column: 30, scope: !415)
!529 = !DILocation(line: 277, column: 4, scope: !415)
!530 = !DILocation(line: 277, column: 18, scope: !415)
!531 = !DILocation(line: 277, column: 28, scope: !415)
!532 = !DILocation(line: 278, column: 4, scope: !415)
!533 = distinct !{!533, !532}
!534 = !DILocalVariable(name: "__src", scope: !535, file: !382, line: 278, type: !203)
!535 = distinct !DILexicalBlock(scope: !415, file: !382, line: 278, column: 7)
!536 = !DILocation(line: 278, column: 18, scope: !535)
!537 = !DILocation(line: 278, column: 27, scope: !538)
!538 = !DILexicalBlockFile(scope: !535, file: !382, discriminator: 1)
!539 = !DILocation(line: 278, column: 41, scope: !538)
!540 = !DILocation(line: 278, column: 18, scope: !538)
!541 = !DILocation(line: 278, column: 75, scope: !538)
!542 = !DILocation(line: 278, column: 53, scope: !538)
!543 = !DILocation(line: 278, column: 23, scope: !538)
!544 = !DILocation(line: 278, column: 55, scope: !538)
!545 = !DILocation(line: 278, column: 69, scope: !538)
!546 = !DILocation(line: 278, column: 30, scope: !547)
!547 = !DILexicalBlockFile(scope: !538, file: !382, discriminator: 2)
!548 = !DILocation(line: 278, column: 7, scope: !549)
!549 = !DILexicalBlockFile(scope: !538, file: !382, discriminator: 3)
!550 = !DILocation(line: 278, column: 87, scope: !538)
!551 = !DILocation(line: 283, column: 11, scope: !415)
!552 = !DILocation(line: 283, column: 4, scope: !415)
!553 = distinct !DISubprogram(name: "VmBackupPrivSendMsg", scope: !382, file: !382, line: 169, type: !554, isLocal: true, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !410)
!554 = !DISubroutineType(types: !555)
!555 = !{!282, !295, !556, !557}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!558 = !DILocalVariable(name: "msg", arg: 1, scope: !553, file: !382, line: 169, type: !295)
!559 = !DILocation(line: 169, column: 28, scope: !553)
!560 = !DILocalVariable(name: "result", arg: 2, scope: !553, file: !382, line: 170, type: !556)
!561 = !DILocation(line: 170, column: 28, scope: !553)
!562 = !DILocalVariable(name: "resultLen", arg: 3, scope: !553, file: !382, line: 171, type: !557)
!563 = !DILocation(line: 171, column: 29, scope: !553)
!564 = !DILocalVariable(name: "success", scope: !553, file: !382, line: 173, type: !282)
!565 = !DILocation(line: 173, column: 9, scope: !553)
!566 = !DILocalVariable(name: "oldLevel", scope: !553, file: !382, line: 174, type: !166)
!567 = !DILocation(line: 174, column: 17, scope: !553)
!568 = !DILocation(line: 178, column: 4, scope: !553)
!569 = !DILocation(line: 180, column: 17, scope: !553)
!570 = !DILocation(line: 180, column: 35, scope: !553)
!571 = !DILocation(line: 180, column: 42, scope: !553)
!572 = !DILocation(line: 180, column: 42, scope: !573)
!573 = !DILexicalBlockFile(scope: !553, file: !382, discriminator: 1)
!574 = !DILocation(line: 180, column: 13, scope: !573)
!575 = !DILocation(line: 182, column: 77, scope: !553)
!576 = !DILocation(line: 182, column: 4, scope: !553)
!577 = !DILocation(line: 183, column: 8, scope: !578)
!578 = distinct !DILexicalBlock(scope: !553, file: !382, line: 183, column: 8)
!579 = !DILocation(line: 183, column: 16, scope: !578)
!580 = !DILocation(line: 183, column: 8, scope: !553)
!581 = !DILocation(line: 184, column: 8, scope: !582)
!582 = distinct !DILexicalBlock(scope: !578, file: !382, line: 183, column: 21)
!583 = !DILocation(line: 184, column: 7, scope: !582)
!584 = !DILocation(line: 184, column: 79, scope: !585)
!585 = !DILexicalBlockFile(scope: !582, file: !382, discriminator: 1)
!586 = !DILocation(line: 184, column: 7, scope: !587)
!587 = !DILexicalBlockFile(scope: !582, file: !382, discriminator: 2)
!588 = !DILocation(line: 185, column: 4, scope: !582)
!589 = !DILocation(line: 187, column: 30, scope: !553)
!590 = !DILocation(line: 187, column: 44, scope: !553)
!591 = !DILocation(line: 187, column: 49, scope: !553)
!592 = !DILocation(line: 187, column: 54, scope: !553)
!593 = !DILocation(line: 188, column: 37, scope: !553)
!594 = !DILocation(line: 188, column: 30, scope: !553)
!595 = !DILocation(line: 188, column: 42, scope: !553)
!596 = !DILocation(line: 189, column: 30, scope: !553)
!597 = !DILocation(line: 189, column: 38, scope: !553)
!598 = !DILocation(line: 187, column: 14, scope: !553)
!599 = !DILocation(line: 187, column: 12, scope: !553)
!600 = !DILocation(line: 191, column: 13, scope: !601)
!601 = distinct !DILexicalBlock(scope: !553, file: !382, line: 191, column: 8)
!602 = !DILocation(line: 191, column: 8, scope: !601)
!603 = !DILocation(line: 191, column: 23, scope: !601)
!604 = !DILocation(line: 191, column: 8, scope: !553)
!605 = !DILocation(line: 192, column: 8, scope: !606)
!606 = distinct !DILexicalBlock(scope: !601, file: !382, line: 191, column: 28)
!607 = !DILocation(line: 192, column: 7, scope: !606)
!608 = !DILocation(line: 192, column: 81, scope: !609)
!609 = !DILexicalBlockFile(scope: !606, file: !382, discriminator: 1)
!610 = !DILocation(line: 192, column: 7, scope: !611)
!611 = !DILexicalBlockFile(scope: !606, file: !382, discriminator: 2)
!612 = !DILocation(line: 193, column: 4, scope: !606)
!613 = !DILocation(line: 195, column: 11, scope: !553)
!614 = !DILocation(line: 195, column: 4, scope: !553)
!615 = distinct !DISubprogram(name: "VmBackupKeepAliveCallback", scope: !382, file: !382, line: 156, type: !616, isLocal: true, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !410)
!616 = !DISubroutineType(types: !617)
!617 = !{!75, !69}
!618 = !DILocalVariable(name: "clientData", arg: 1, scope: !615, file: !382, line: 156, type: !69)
!619 = !DILocation(line: 156, column: 33, scope: !615)
!620 = !DILocation(line: 158, column: 4, scope: !615)
!621 = !DILocation(line: 160, column: 19, scope: !615)
!622 = !DILocation(line: 160, column: 33, scope: !615)
!623 = !DILocation(line: 160, column: 4, scope: !615)
!624 = !DILocation(line: 161, column: 4, scope: !615)
!625 = !DILocation(line: 161, column: 18, scope: !615)
!626 = !DILocation(line: 161, column: 28, scope: !615)
!627 = !DILocation(line: 162, column: 4, scope: !615)
!628 = !DILocation(line: 163, column: 4, scope: !615)
!629 = !DILocalVariable(name: "ctx", arg: 1, scope: !387, file: !382, line: 1381, type: !100)
!630 = !DILocation(line: 1381, column: 26, scope: !387)
!631 = !DILocalVariable(name: "rpcs", scope: !387, file: !382, line: 1389, type: !632)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 1920, align: 64, elements: !658)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannelCallback", file: !120, line: 115, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcChannelCallback", file: !120, line: 94, size: 384, align: 64, elements: !635)
!635 = !{!636, !637, !654, !655, !656, !657}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !634, file: !120, line: 96, baseType: !131, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !634, file: !120, line: 98, baseType: !638, size: 64, align: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcIn_Callback", file: !120, line: 90, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!75, !642}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcInData", file: !120, line: 77, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcInData", file: !120, line: 51, size: 512, align: 64, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !644, file: !120, line: 53, baseType: !131, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !644, file: !120, line: 58, baseType: !131, size: 64, align: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "argsSize", scope: !644, file: !120, line: 60, baseType: !431, size: 64, align: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !644, file: !120, line: 65, baseType: !199, size: 64, align: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "resultLen", scope: !644, file: !120, line: 67, baseType: !431, size: 64, align: 64, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "freeResult", scope: !644, file: !120, line: 72, baseType: !75, size: 32, align: 32, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "appCtx", scope: !644, file: !120, line: 74, baseType: !69, size: 64, align: 64, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !644, file: !120, line: 76, baseType: !69, size: 64, align: 64, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !634, file: !120, line: 100, baseType: !79, size: 64, align: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "xdrIn", scope: !634, file: !120, line: 102, baseType: !79, size: 64, align: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "xdrOut", scope: !634, file: !120, line: 109, baseType: !79, size: 64, align: 64, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "xdrInSize", scope: !634, file: !120, line: 114, baseType: !431, size: 64, align: 64, offset: 320)
!658 = !{!659}
!659 = !DISubrange(count: 5)
!660 = !DILocation(line: 1389, column: 23, scope: !387)
!661 = !DILocalVariable(name: "sigs", scope: !387, file: !382, line: 1399, type: !662)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 576, align: 64, elements: !669)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginSignalCb", file: !16, line: 484, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginSignalCb", file: !16, line: 480, size: 192, align: 64, elements: !665)
!665 = !{!666, !667, !668}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "signame", scope: !664, file: !16, line: 481, baseType: !107, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !664, file: !16, line: 482, baseType: !79, size: 64, align: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !664, file: !16, line: 483, baseType: !79, size: 64, align: 64, offset: 128)
!669 = !{!670}
!670 = !DISubrange(count: 3)
!671 = !DILocation(line: 1399, column: 24, scope: !387)
!672 = !DILocalVariable(name: "regs", scope: !387, file: !382, line: 1404, type: !673)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 256, align: 64, elements: !167)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppReg", file: !16, line: 450, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppReg", file: !16, line: 447, size: 128, align: 64, elements: !676)
!676 = !{!677, !678}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !675, file: !16, line: 448, baseType: !407, size: 32, align: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !675, file: !16, line: 449, baseType: !396, size: 64, align: 64, offset: 64)
!679 = !DILocation(line: 1404, column: 16, scope: !387)
!680 = !DILocation(line: 1404, column: 25, scope: !387)
!681 = !DILocation(line: 1405, column: 7, scope: !387)
!682 = !DILocation(line: 1405, column: 47, scope: !387)
!683 = !DILocation(line: 1405, column: 29, scope: !387)
!684 = !DILocation(line: 1406, column: 7, scope: !387)
!685 = !DILocation(line: 1406, column: 46, scope: !387)
!686 = !DILocation(line: 1406, column: 28, scope: !387)
!687 = !DILocation(line: 1422, column: 37, scope: !387)
!688 = !DILocation(line: 1422, column: 19, scope: !387)
!689 = !DILocation(line: 1422, column: 17, scope: !387)
!690 = !DILocation(line: 1425, column: 55, scope: !387)
!691 = !DILocation(line: 1425, column: 60, scope: !387)
!692 = !DILocation(line: 1425, column: 37, scope: !387)
!693 = !DILocation(line: 1425, column: 74, scope: !387)
!694 = !DILocation(line: 1425, column: 85, scope: !387)
!695 = !DILocation(line: 1424, column: 4, scope: !387)
!696 = !DILocation(line: 1436, column: 4, scope: !387)
!697 = distinct !DISubprogram(name: "VmBackupStart", scope: !382, file: !382, line: 1057, type: !640, isLocal: true, isDefinition: true, scopeLine: 1058, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !410)
!698 = !DILocalVariable(name: "data", arg: 1, scope: !697, file: !382, line: 1057, type: !642)
!699 = !DILocation(line: 1057, column: 26, scope: !697)
!700 = !DILocalVariable(name: "ctx", scope: !697, file: !382, line: 1059, type: !100)
!701 = !DILocation(line: 1059, column: 17, scope: !697)
!702 = !DILocation(line: 1059, column: 23, scope: !697)
!703 = !DILocation(line: 1059, column: 29, scope: !697)
!704 = !DILocation(line: 1061, column: 4, scope: !697)
!705 = !DILocation(line: 1062, column: 8, scope: !706)
!706 = distinct !DILexicalBlock(scope: !697, file: !382, line: 1062, column: 8)
!707 = !DILocation(line: 1062, column: 21, scope: !706)
!708 = !DILocation(line: 1062, column: 8, scope: !697)
!709 = !DILocation(line: 1063, column: 36, scope: !710)
!710 = distinct !DILexicalBlock(scope: !706, file: !382, line: 1062, column: 29)
!711 = !DILocation(line: 1063, column: 14, scope: !710)
!712 = !DILocation(line: 1063, column: 7, scope: !710)
!713 = !DILocation(line: 1066, column: 38, scope: !697)
!714 = !DILocation(line: 1066, column: 20, scope: !697)
!715 = !DILocation(line: 1066, column: 17, scope: !697)
!716 = !DILocation(line: 1067, column: 8, scope: !717)
!717 = distinct !DILexicalBlock(scope: !697, file: !382, line: 1067, column: 8)
!718 = !DILocation(line: 1067, column: 14, scope: !717)
!719 = !DILocation(line: 1067, column: 23, scope: !717)
!720 = !DILocation(line: 1067, column: 8, scope: !697)
!721 = !DILocalVariable(name: "generateManifests", scope: !722, file: !382, line: 1068, type: !78)
!722 = distinct !DILexicalBlock(scope: !717, file: !382, line: 1067, column: 28)
!723 = !DILocation(line: 1068, column: 11, scope: !722)
!724 = !DILocalVariable(name: "index", scope: !722, file: !382, line: 1069, type: !367)
!725 = !DILocation(line: 1069, column: 14, scope: !722)
!726 = !DILocation(line: 1071, column: 63, scope: !727)
!727 = distinct !DILexicalBlock(scope: !722, file: !382, line: 1071, column: 11)
!728 = !DILocation(line: 1071, column: 69, scope: !727)
!729 = !DILocation(line: 1071, column: 11, scope: !727)
!730 = !DILocation(line: 1071, column: 11, scope: !722)
!731 = !DILocation(line: 1072, column: 44, scope: !732)
!732 = distinct !DILexicalBlock(scope: !727, file: !382, line: 1071, column: 81)
!733 = !DILocation(line: 1072, column: 10, scope: !732)
!734 = !DILocation(line: 1072, column: 24, scope: !732)
!735 = !DILocation(line: 1072, column: 42, scope: !732)
!736 = !DILocation(line: 1073, column: 7, scope: !732)
!737 = !DILocation(line: 1074, column: 60, scope: !722)
!738 = !DILocation(line: 1074, column: 65, scope: !722)
!739 = !DILocation(line: 1074, column: 35, scope: !722)
!740 = !DILocation(line: 1074, column: 7, scope: !722)
!741 = !DILocation(line: 1074, column: 21, scope: !722)
!742 = !DILocation(line: 1074, column: 33, scope: !722)
!743 = !DILocation(line: 1077, column: 58, scope: !722)
!744 = !DILocation(line: 1077, column: 63, scope: !722)
!745 = !DILocation(line: 1077, column: 33, scope: !722)
!746 = !DILocation(line: 1077, column: 7, scope: !722)
!747 = !DILocation(line: 1077, column: 21, scope: !722)
!748 = !DILocation(line: 1077, column: 31, scope: !722)
!749 = !DILocation(line: 1080, column: 64, scope: !722)
!750 = !DILocation(line: 1080, column: 69, scope: !722)
!751 = !DILocation(line: 1080, column: 39, scope: !722)
!752 = !DILocation(line: 1080, column: 7, scope: !722)
!753 = !DILocation(line: 1080, column: 21, scope: !722)
!754 = !DILocation(line: 1080, column: 37, scope: !722)
!755 = !DILocation(line: 1083, column: 60, scope: !722)
!756 = !DILocation(line: 1083, column: 65, scope: !722)
!757 = !DILocation(line: 1083, column: 35, scope: !722)
!758 = !DILocation(line: 1083, column: 7, scope: !722)
!759 = !DILocation(line: 1083, column: 21, scope: !722)
!760 = !DILocation(line: 1083, column: 33, scope: !722)
!761 = !DILocation(line: 1086, column: 57, scope: !722)
!762 = !DILocation(line: 1086, column: 62, scope: !722)
!763 = !DILocation(line: 1086, column: 33, scope: !722)
!764 = !DILocation(line: 1086, column: 7, scope: !722)
!765 = !DILocation(line: 1086, column: 21, scope: !722)
!766 = !DILocation(line: 1086, column: 31, scope: !722)
!767 = !DILocation(line: 1089, column: 56, scope: !722)
!768 = !DILocation(line: 1089, column: 61, scope: !722)
!769 = !DILocation(line: 1089, column: 31, scope: !722)
!770 = !DILocation(line: 1089, column: 7, scope: !722)
!771 = !DILocation(line: 1089, column: 21, scope: !722)
!772 = !DILocation(line: 1089, column: 29, scope: !722)
!773 = !DILocation(line: 1091, column: 62, scope: !722)
!774 = !DILocation(line: 1091, column: 67, scope: !722)
!775 = !DILocation(line: 1091, column: 37, scope: !722)
!776 = !DILocation(line: 1091, column: 7, scope: !722)
!777 = !DILocation(line: 1091, column: 21, scope: !722)
!778 = !DILocation(line: 1091, column: 35, scope: !722)
!779 = !DILocation(line: 1096, column: 22, scope: !780)
!780 = distinct !DILexicalBlock(scope: !722, file: !382, line: 1096, column: 11)
!781 = !DILocation(line: 1096, column: 11, scope: !780)
!782 = !DILocation(line: 1096, column: 17, scope: !780)
!783 = !DILocation(line: 1096, column: 29, scope: !780)
!784 = !DILocation(line: 1096, column: 11, scope: !722)
!785 = !DILocation(line: 1097, column: 44, scope: !786)
!786 = distinct !DILexicalBlock(scope: !780, file: !382, line: 1096, column: 38)
!787 = !DILocation(line: 1097, column: 50, scope: !786)
!788 = !DILocation(line: 1097, column: 57, scope: !786)
!789 = !DILocation(line: 1097, column: 55, scope: !786)
!790 = !DILocation(line: 1098, column: 44, scope: !786)
!791 = !DILocation(line: 1098, column: 50, scope: !786)
!792 = !DILocation(line: 1098, column: 61, scope: !786)
!793 = !DILocation(line: 1098, column: 59, scope: !786)
!794 = !DILocation(line: 1097, column: 34, scope: !786)
!795 = !DILocation(line: 1097, column: 10, scope: !786)
!796 = !DILocation(line: 1097, column: 24, scope: !786)
!797 = !DILocation(line: 1097, column: 32, scope: !786)
!798 = !DILocation(line: 1099, column: 7, scope: !786)
!799 = !DILocation(line: 1100, column: 4, scope: !722)
!800 = !DILocation(line: 1101, column: 31, scope: !697)
!801 = !DILocation(line: 1101, column: 62, scope: !697)
!802 = !DILocation(line: 1101, column: 67, scope: !697)
!803 = !DILocation(line: 1101, column: 37, scope: !697)
!804 = !DILocation(line: 1101, column: 11, scope: !805)
!805 = !DILexicalBlockFile(scope: !697, file: !382, discriminator: 1)
!806 = !DILocation(line: 1101, column: 4, scope: !697)
!807 = !DILocation(line: 1104, column: 1, scope: !697)
!808 = distinct !DISubprogram(name: "VmBackupStartWithOpts", scope: !382, file: !382, line: 1139, type: !640, isLocal: true, isDefinition: true, scopeLine: 1140, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !410)
!809 = !DILocalVariable(name: "data", arg: 1, scope: !808, file: !382, line: 1139, type: !642)
!810 = !DILocation(line: 1139, column: 34, scope: !808)
!811 = !DILocalVariable(name: "ctx", scope: !808, file: !382, line: 1141, type: !100)
!812 = !DILocation(line: 1141, column: 17, scope: !808)
!813 = !DILocation(line: 1141, column: 23, scope: !808)
!814 = !DILocation(line: 1141, column: 29, scope: !808)
!815 = !DILocalVariable(name: "params", scope: !808, file: !382, line: 1142, type: !347)
!816 = !DILocation(line: 1142, column: 24, scope: !808)
!817 = !DILocalVariable(name: "paramsV1", scope: !808, file: !382, line: 1143, type: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64, align: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestQuiesceParamsV1", file: !64, line: 35, baseType: !358)
!820 = !DILocation(line: 1143, column: 26, scope: !808)
!821 = !DILocalVariable(name: "paramsV2", scope: !808, file: !382, line: 1144, type: !822)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64, align: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestQuiesceParamsV2", file: !64, line: 44, baseType: !373)
!824 = !DILocation(line: 1144, column: 26, scope: !808)
!825 = !DILocalVariable(name: "retval", scope: !808, file: !382, line: 1145, type: !75)
!826 = !DILocation(line: 1145, column: 13, scope: !808)
!827 = !DILocation(line: 1147, column: 4, scope: !808)
!828 = !DILocation(line: 1148, column: 8, scope: !829)
!829 = distinct !DILexicalBlock(scope: !808, file: !382, line: 1148, column: 8)
!830 = !DILocation(line: 1148, column: 21, scope: !829)
!831 = !DILocation(line: 1148, column: 8, scope: !808)
!832 = !DILocation(line: 1149, column: 36, scope: !833)
!833 = distinct !DILexicalBlock(scope: !829, file: !382, line: 1148, column: 29)
!834 = !DILocation(line: 1149, column: 14, scope: !833)
!835 = !DILocation(line: 1149, column: 7, scope: !833)
!836 = !DILocation(line: 1152, column: 35, scope: !808)
!837 = !DILocation(line: 1152, column: 41, scope: !808)
!838 = !DILocation(line: 1152, column: 13, scope: !808)
!839 = !DILocation(line: 1152, column: 11, scope: !808)
!840 = !DILocation(line: 1162, column: 8, scope: !841)
!841 = distinct !DILexicalBlock(scope: !808, file: !382, line: 1162, column: 8)
!842 = !DILocation(line: 1162, column: 16, scope: !841)
!843 = !DILocation(line: 1162, column: 20, scope: !841)
!844 = !DILocation(line: 1162, column: 8, scope: !808)
!845 = !DILocation(line: 1163, column: 7, scope: !846)
!846 = distinct !DILexicalBlock(scope: !841, file: !382, line: 1162, column: 46)
!847 = !DILocation(line: 1164, column: 36, scope: !846)
!848 = !DILocation(line: 1164, column: 14, scope: !846)
!849 = !DILocation(line: 1164, column: 7, scope: !846)
!850 = !DILocation(line: 1169, column: 38, scope: !808)
!851 = !DILocation(line: 1169, column: 20, scope: !808)
!852 = !DILocation(line: 1169, column: 17, scope: !808)
!853 = !DILocation(line: 1171, column: 8, scope: !854)
!854 = distinct !DILexicalBlock(scope: !808, file: !382, line: 1171, column: 8)
!855 = !DILocation(line: 1171, column: 16, scope: !854)
!856 = !DILocation(line: 1171, column: 20, scope: !854)
!857 = !DILocation(line: 1171, column: 8, scope: !808)
!858 = !DILocation(line: 1172, column: 18, scope: !859)
!859 = distinct !DILexicalBlock(scope: !854, file: !382, line: 1171, column: 46)
!860 = !DILocation(line: 1172, column: 26, scope: !859)
!861 = !DILocation(line: 1172, column: 47, scope: !859)
!862 = !DILocation(line: 1172, column: 16, scope: !859)
!863 = !DILocation(line: 1173, column: 62, scope: !859)
!864 = !DILocation(line: 1173, column: 67, scope: !859)
!865 = !DILocation(line: 1173, column: 37, scope: !859)
!866 = !DILocation(line: 1173, column: 7, scope: !859)
!867 = !DILocation(line: 1173, column: 21, scope: !859)
!868 = !DILocation(line: 1173, column: 35, scope: !859)
!869 = !DILocation(line: 1176, column: 4, scope: !859)
!870 = !DILocation(line: 1176, column: 15, scope: !871)
!871 = !DILexicalBlockFile(scope: !872, file: !382, discriminator: 1)
!872 = distinct !DILexicalBlock(scope: !854, file: !382, line: 1176, column: 15)
!873 = !DILocation(line: 1176, column: 23, scope: !871)
!874 = !DILocation(line: 1176, column: 27, scope: !871)
!875 = !DILocation(line: 1177, column: 18, scope: !876)
!876 = distinct !DILexicalBlock(scope: !872, file: !382, line: 1176, column: 53)
!877 = !DILocation(line: 1177, column: 26, scope: !876)
!878 = !DILocation(line: 1177, column: 47, scope: !876)
!879 = !DILocation(line: 1177, column: 16, scope: !876)
!880 = !DILocation(line: 1178, column: 19, scope: !876)
!881 = !DILocation(line: 1178, column: 29, scope: !876)
!882 = !DILocation(line: 1178, column: 16, scope: !876)
!883 = !DILocation(line: 1179, column: 40, scope: !876)
!884 = !DILocation(line: 1179, column: 50, scope: !876)
!885 = !DILocation(line: 1179, column: 7, scope: !876)
!886 = !DILocation(line: 1179, column: 21, scope: !876)
!887 = !DILocation(line: 1179, column: 38, scope: !876)
!888 = !DILocation(line: 1180, column: 37, scope: !876)
!889 = !DILocation(line: 1180, column: 47, scope: !876)
!890 = !DILocation(line: 1180, column: 7, scope: !876)
!891 = !DILocation(line: 1180, column: 21, scope: !876)
!892 = !DILocation(line: 1180, column: 35, scope: !876)
!893 = !DILocation(line: 1181, column: 46, scope: !876)
!894 = !DILocation(line: 1181, column: 56, scope: !876)
!895 = !DILocation(line: 1181, column: 7, scope: !876)
!896 = !DILocation(line: 1181, column: 21, scope: !876)
!897 = !DILocation(line: 1181, column: 44, scope: !876)
!898 = !DILocation(line: 1182, column: 45, scope: !876)
!899 = !DILocation(line: 1182, column: 55, scope: !876)
!900 = !DILocation(line: 1182, column: 7, scope: !876)
!901 = !DILocation(line: 1182, column: 21, scope: !876)
!902 = !DILocation(line: 1182, column: 43, scope: !876)
!903 = !DILocation(line: 1183, column: 62, scope: !876)
!904 = !DILocation(line: 1183, column: 67, scope: !876)
!905 = !DILocation(line: 1183, column: 37, scope: !876)
!906 = !DILocation(line: 1183, column: 7, scope: !876)
!907 = !DILocation(line: 1183, column: 21, scope: !876)
!908 = !DILocation(line: 1183, column: 35, scope: !876)
!909 = !DILocation(line: 1186, column: 4, scope: !876)
!910 = !DILocation(line: 1188, column: 8, scope: !911)
!911 = distinct !DILexicalBlock(scope: !808, file: !382, line: 1188, column: 8)
!912 = !DILocation(line: 1188, column: 17, scope: !911)
!913 = !DILocation(line: 1188, column: 8, scope: !808)
!914 = !DILocation(line: 1189, column: 41, scope: !915)
!915 = distinct !DILexicalBlock(scope: !911, file: !382, line: 1188, column: 25)
!916 = !DILocation(line: 1189, column: 51, scope: !915)
!917 = !DILocation(line: 1189, column: 7, scope: !915)
!918 = !DILocation(line: 1189, column: 21, scope: !915)
!919 = !DILocation(line: 1189, column: 39, scope: !915)
!920 = !DILocation(line: 1190, column: 35, scope: !915)
!921 = !DILocation(line: 1190, column: 45, scope: !915)
!922 = !DILocation(line: 1190, column: 7, scope: !915)
!923 = !DILocation(line: 1190, column: 21, scope: !915)
!924 = !DILocation(line: 1190, column: 33, scope: !915)
!925 = !DILocation(line: 1191, column: 33, scope: !915)
!926 = !DILocation(line: 1191, column: 43, scope: !915)
!927 = !DILocation(line: 1191, column: 7, scope: !915)
!928 = !DILocation(line: 1191, column: 21, scope: !915)
!929 = !DILocation(line: 1191, column: 31, scope: !915)
!930 = !DILocation(line: 1192, column: 39, scope: !915)
!931 = !DILocation(line: 1192, column: 49, scope: !915)
!932 = !DILocation(line: 1192, column: 7, scope: !915)
!933 = !DILocation(line: 1192, column: 21, scope: !915)
!934 = !DILocation(line: 1192, column: 37, scope: !915)
!935 = !DILocation(line: 1193, column: 35, scope: !915)
!936 = !DILocation(line: 1193, column: 45, scope: !915)
!937 = !DILocation(line: 1193, column: 7, scope: !915)
!938 = !DILocation(line: 1193, column: 21, scope: !915)
!939 = !DILocation(line: 1193, column: 33, scope: !915)
!940 = !DILocation(line: 1194, column: 43, scope: !915)
!941 = !DILocation(line: 1194, column: 53, scope: !915)
!942 = !DILocation(line: 1195, column: 50, scope: !915)
!943 = !DILocation(line: 1195, column: 60, scope: !915)
!944 = !DILocation(line: 1195, column: 43, scope: !915)
!945 = !DILocation(line: 1194, column: 33, scope: !915)
!946 = !DILocation(line: 1194, column: 7, scope: !915)
!947 = !DILocation(line: 1194, column: 21, scope: !915)
!948 = !DILocation(line: 1194, column: 31, scope: !915)
!949 = !DILocation(line: 1196, column: 31, scope: !915)
!950 = !DILocation(line: 1196, column: 41, scope: !915)
!951 = !DILocation(line: 1196, column: 7, scope: !915)
!952 = !DILocation(line: 1196, column: 21, scope: !915)
!953 = !DILocation(line: 1196, column: 29, scope: !915)
!954 = !DILocation(line: 1197, column: 41, scope: !915)
!955 = !DILocation(line: 1197, column: 51, scope: !915)
!956 = !DILocation(line: 1198, column: 48, scope: !915)
!957 = !DILocation(line: 1198, column: 58, scope: !915)
!958 = !DILocation(line: 1198, column: 41, scope: !915)
!959 = !DILocation(line: 1197, column: 31, scope: !915)
!960 = !DILocation(line: 1197, column: 7, scope: !915)
!961 = !DILocation(line: 1197, column: 21, scope: !915)
!962 = !DILocation(line: 1197, column: 29, scope: !915)
!963 = !DILocation(line: 1199, column: 4, scope: !915)
!964 = !DILocation(line: 1201, column: 33, scope: !808)
!965 = !DILocation(line: 1201, column: 64, scope: !808)
!966 = !DILocation(line: 1201, column: 69, scope: !808)
!967 = !DILocation(line: 1201, column: 39, scope: !808)
!968 = !DILocation(line: 1201, column: 13, scope: !969)
!969 = !DILexicalBlockFile(scope: !808, file: !382, discriminator: 1)
!970 = !DILocation(line: 1201, column: 11, scope: !808)
!971 = !DILocation(line: 1204, column: 11, scope: !808)
!972 = !DILocation(line: 1204, column: 4, scope: !808)
!973 = !DILocation(line: 1205, column: 1, scope: !808)
!974 = distinct !DISubprogram(name: "VmBackupAbort", scope: !382, file: !382, line: 1219, type: !640, isLocal: true, isDefinition: true, scopeLine: 1220, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !410)
!975 = !DILocalVariable(name: "data", arg: 1, scope: !974, file: !382, line: 1219, type: !642)
!976 = !DILocation(line: 1219, column: 26, scope: !974)
!977 = !DILocation(line: 1221, column: 4, scope: !974)
!978 = !DILocation(line: 1222, column: 8, scope: !979)
!979 = distinct !DILexicalBlock(scope: !974, file: !382, line: 1222, column: 8)
!980 = !DILocation(line: 1222, column: 21, scope: !979)
!981 = !DILocation(line: 1222, column: 8, scope: !974)
!982 = !DILocation(line: 1223, column: 36, scope: !983)
!983 = distinct !DILexicalBlock(scope: !979, file: !382, line: 1222, column: 29)
!984 = !DILocation(line: 1223, column: 14, scope: !983)
!985 = !DILocation(line: 1223, column: 7, scope: !983)
!986 = !DILocation(line: 1227, column: 4, scope: !974)
!987 = !DILocation(line: 1228, column: 33, scope: !974)
!988 = !DILocation(line: 1228, column: 11, scope: !974)
!989 = !DILocation(line: 1228, column: 4, scope: !974)
!990 = !DILocation(line: 1229, column: 1, scope: !974)
!991 = distinct !DISubprogram(name: "VmBackupSnapshotCompleted", scope: !382, file: !382, line: 1283, type: !640, isLocal: true, isDefinition: true, scopeLine: 1284, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !410)
!992 = !DILocalVariable(name: "data", arg: 1, scope: !991, file: !382, line: 1283, type: !642)
!993 = !DILocation(line: 1283, column: 38, scope: !991)
!994 = !DILocation(line: 1285, column: 4, scope: !991)
!995 = !DILocation(line: 1287, column: 8, scope: !996)
!996 = distinct !DILexicalBlock(scope: !991, file: !382, line: 1287, column: 8)
!997 = !DILocation(line: 1287, column: 21, scope: !996)
!998 = !DILocation(line: 1287, column: 28, scope: !996)
!999 = !DILocation(line: 1288, column: 8, scope: !996)
!1000 = !DILocation(line: 1288, column: 22, scope: !996)
!1001 = !DILocation(line: 1288, column: 32, scope: !996)
!1002 = !DILocation(line: 1287, column: 8, scope: !1003)
!1003 = !DILexicalBlockFile(scope: !991, file: !382, discriminator: 1)
!1004 = !DILocation(line: 1289, column: 36, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !996, file: !382, line: 1288, column: 40)
!1006 = !DILocation(line: 1289, column: 14, scope: !1005)
!1007 = !DILocation(line: 1289, column: 7, scope: !1005)
!1008 = !DILocation(line: 1291, column: 15, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !996, file: !382, line: 1291, column: 15)
!1010 = !DILocation(line: 1291, column: 29, scope: !1009)
!1011 = !DILocation(line: 1291, column: 42, scope: !1009)
!1012 = !DILocation(line: 1291, column: 15, scope: !996)
!1013 = !DILocation(line: 1292, column: 129, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1009, file: !382, line: 1291, column: 76)
!1015 = !DILocation(line: 1292, column: 143, scope: !1014)
!1016 = !DILocation(line: 1292, column: 108, scope: !1014)
!1017 = !DILocation(line: 1292, column: 7, scope: !1018)
!1018 = !DILexicalBlockFile(scope: !1014, file: !382, discriminator: 1)
!1019 = !DILocation(line: 1294, column: 36, scope: !1014)
!1020 = !DILocation(line: 1294, column: 14, scope: !1014)
!1021 = !DILocation(line: 1294, column: 7, scope: !1014)
!1022 = !DILocation(line: 1298, column: 12, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !382, line: 1298, column: 11)
!1024 = distinct !DILexicalBlock(scope: !1009, file: !382, line: 1297, column: 11)
!1025 = !DILocation(line: 1298, column: 26, scope: !1023)
!1026 = !DILocation(line: 1298, column: 37, scope: !1023)
!1027 = !DILocation(line: 1298, column: 55, scope: !1023)
!1028 = !DILocation(line: 1299, column: 14, scope: !1023)
!1029 = !DILocation(line: 1299, column: 28, scope: !1023)
!1030 = !DILocation(line: 1299, column: 39, scope: !1023)
!1031 = !DILocation(line: 1298, column: 11, scope: !1024)
!1032 = !DILocation(line: 1300, column: 10, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1023, file: !382, line: 1299, column: 52)
!1034 = !DILocation(line: 1303, column: 14, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1033, file: !382, line: 1303, column: 14)
!1036 = !DILocation(line: 1303, column: 14, scope: !1033)
!1037 = !DILocation(line: 1304, column: 13, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1035, file: !382, line: 1303, column: 33)
!1039 = !DILocation(line: 1305, column: 10, scope: !1038)
!1040 = !DILocation(line: 1306, column: 7, scope: !1033)
!1041 = !DILocation(line: 1307, column: 36, scope: !1024)
!1042 = !DILocation(line: 1307, column: 14, scope: !1024)
!1043 = !DILocation(line: 1307, column: 7, scope: !1024)
!1044 = !DILocation(line: 1309, column: 1, scope: !991)
!1045 = distinct !DISubprogram(name: "VmBackupSnapshotDone", scope: !382, file: !382, line: 1242, type: !640, isLocal: true, isDefinition: true, scopeLine: 1243, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !410)
!1046 = !DILocalVariable(name: "data", arg: 1, scope: !1045, file: !382, line: 1242, type: !642)
!1047 = !DILocation(line: 1242, column: 33, scope: !1045)
!1048 = !DILocation(line: 1244, column: 4, scope: !1045)
!1049 = !DILocation(line: 1245, column: 8, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1045, file: !382, line: 1245, column: 8)
!1051 = !DILocation(line: 1245, column: 21, scope: !1050)
!1052 = !DILocation(line: 1245, column: 8, scope: !1045)
!1053 = !DILocation(line: 1246, column: 36, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1050, file: !382, line: 1245, column: 29)
!1055 = !DILocation(line: 1246, column: 14, scope: !1054)
!1056 = !DILocation(line: 1246, column: 7, scope: !1054)
!1057 = !DILocation(line: 1247, column: 15, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1050, file: !382, line: 1247, column: 15)
!1059 = !DILocation(line: 1247, column: 29, scope: !1058)
!1060 = !DILocation(line: 1247, column: 42, scope: !1058)
!1061 = !DILocation(line: 1247, column: 15, scope: !1050)
!1062 = !DILocation(line: 1248, column: 125, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1058, file: !382, line: 1247, column: 74)
!1064 = !DILocation(line: 1248, column: 139, scope: !1063)
!1065 = !DILocation(line: 1248, column: 104, scope: !1063)
!1066 = !DILocation(line: 1248, column: 7, scope: !1067)
!1067 = !DILexicalBlockFile(scope: !1063, file: !382, discriminator: 1)
!1068 = !DILocation(line: 1250, column: 36, scope: !1063)
!1069 = !DILocation(line: 1250, column: 14, scope: !1063)
!1070 = !DILocation(line: 1250, column: 7, scope: !1063)
!1071 = !DILocation(line: 1254, column: 11, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1073, file: !382, line: 1254, column: 11)
!1073 = distinct !DILexicalBlock(scope: !1058, file: !382, line: 1253, column: 11)
!1074 = !DILocation(line: 1254, column: 17, scope: !1072)
!1075 = !DILocation(line: 1254, column: 26, scope: !1072)
!1076 = !DILocation(line: 1254, column: 11, scope: !1073)
!1077 = !DILocation(line: 1255, column: 46, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1072, file: !382, line: 1254, column: 31)
!1079 = !DILocation(line: 1255, column: 52, scope: !1078)
!1080 = !DILocation(line: 1255, column: 57, scope: !1078)
!1081 = !DILocation(line: 1255, column: 62, scope: !1078)
!1082 = !DILocation(line: 1255, column: 68, scope: !1078)
!1083 = !DILocation(line: 1255, column: 77, scope: !1078)
!1084 = !DILocation(line: 1255, column: 36, scope: !1078)
!1085 = !DILocation(line: 1255, column: 10, scope: !1078)
!1086 = !DILocation(line: 1255, column: 24, scope: !1078)
!1087 = !DILocation(line: 1255, column: 34, scope: !1078)
!1088 = !DILocation(line: 1256, column: 7, scope: !1078)
!1089 = !DILocation(line: 1257, column: 12, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1073, file: !382, line: 1257, column: 11)
!1091 = !DILocation(line: 1257, column: 26, scope: !1090)
!1092 = !DILocation(line: 1257, column: 36, scope: !1090)
!1093 = !DILocation(line: 1257, column: 49, scope: !1090)
!1094 = !DILocation(line: 1258, column: 49, scope: !1090)
!1095 = !DILocation(line: 1258, column: 63, scope: !1090)
!1096 = !DILocation(line: 1258, column: 73, scope: !1090)
!1097 = !DILocation(line: 1257, column: 11, scope: !1073)
!1098 = !DILocation(line: 1259, column: 10, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1090, file: !382, line: 1258, column: 86)
!1100 = !DILocation(line: 1262, column: 14, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1099, file: !382, line: 1262, column: 14)
!1102 = !DILocation(line: 1262, column: 14, scope: !1099)
!1103 = !DILocation(line: 1263, column: 13, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1101, file: !382, line: 1262, column: 33)
!1105 = !DILocation(line: 1264, column: 10, scope: !1104)
!1106 = !DILocation(line: 1265, column: 7, scope: !1099)
!1107 = !DILocation(line: 1266, column: 10, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1090, file: !382, line: 1265, column: 14)
!1109 = !DILocation(line: 1266, column: 24, scope: !1108)
!1110 = !DILocation(line: 1266, column: 37, scope: !1108)
!1111 = !DILocation(line: 1268, column: 36, scope: !1073)
!1112 = !DILocation(line: 1268, column: 14, scope: !1073)
!1113 = !DILocation(line: 1268, column: 7, scope: !1073)
!1114 = !DILocation(line: 1270, column: 1, scope: !1045)
!1115 = distinct !DISubprogram(name: "VmBackupDumpState", scope: !382, file: !382, line: 1321, type: !1116, isLocal: true, isDefinition: true, scopeLine: 1324, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !410)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{null, !79, !100, !79}
!1118 = !DILocalVariable(name: "src", arg: 1, scope: !1115, file: !382, line: 1321, type: !79)
!1119 = !DILocation(line: 1321, column: 28, scope: !1115)
!1120 = !DILocalVariable(name: "ctx", arg: 2, scope: !1115, file: !382, line: 1322, type: !100)
!1121 = !DILocation(line: 1322, column: 32, scope: !1115)
!1122 = !DILocalVariable(name: "data", arg: 3, scope: !1115, file: !382, line: 1323, type: !79)
!1123 = !DILocation(line: 1323, column: 28, scope: !1115)
!1124 = !DILocation(line: 1325, column: 8, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1115, file: !382, line: 1325, column: 8)
!1126 = !DILocation(line: 1325, column: 21, scope: !1125)
!1127 = !DILocation(line: 1325, column: 8, scope: !1115)
!1128 = !DILocation(line: 1326, column: 7, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1125, file: !382, line: 1325, column: 29)
!1130 = !DILocation(line: 1327, column: 4, scope: !1129)
!1131 = !DILocation(line: 1330, column: 47, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1125, file: !382, line: 1327, column: 11)
!1133 = !DILocation(line: 1330, column: 61, scope: !1132)
!1134 = !DILocation(line: 1330, column: 26, scope: !1132)
!1135 = !DILocation(line: 1328, column: 7, scope: !1132)
!1136 = !DILocation(line: 1332, column: 1, scope: !1115)
!1137 = distinct !DISubprogram(name: "VmBackupReset", scope: !382, file: !382, line: 1344, type: !1116, isLocal: true, isDefinition: true, scopeLine: 1347, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !410)
!1138 = !DILocalVariable(name: "src", arg: 1, scope: !1137, file: !382, line: 1344, type: !79)
!1139 = !DILocation(line: 1344, column: 24, scope: !1137)
!1140 = !DILocalVariable(name: "ctx", arg: 2, scope: !1137, file: !382, line: 1345, type: !100)
!1141 = !DILocation(line: 1345, column: 28, scope: !1137)
!1142 = !DILocalVariable(name: "data", arg: 3, scope: !1137, file: !382, line: 1346, type: !79)
!1143 = !DILocation(line: 1346, column: 24, scope: !1137)
!1144 = !DILocation(line: 1348, column: 1, scope: !1137)
!1145 = distinct !DISubprogram(name: "VmBackupShutdown", scope: !382, file: !382, line: 1360, type: !1116, isLocal: true, isDefinition: true, scopeLine: 1363, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !410)
!1146 = !DILocalVariable(name: "src", arg: 1, scope: !1145, file: !382, line: 1360, type: !79)
!1147 = !DILocation(line: 1360, column: 27, scope: !1145)
!1148 = !DILocalVariable(name: "ctx", arg: 2, scope: !1145, file: !382, line: 1361, type: !100)
!1149 = !DILocation(line: 1361, column: 31, scope: !1145)
!1150 = !DILocalVariable(name: "data", arg: 3, scope: !1145, file: !382, line: 1362, type: !79)
!1151 = !DILocation(line: 1362, column: 27, scope: !1145)
!1152 = !DILocation(line: 1364, column: 4, scope: !1145)
!1153 = !DILocation(line: 1365, column: 8, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1145, file: !382, line: 1365, column: 8)
!1155 = !DILocation(line: 1365, column: 21, scope: !1154)
!1156 = !DILocation(line: 1365, column: 8, scope: !1145)
!1157 = !DILocation(line: 1366, column: 7, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1154, file: !382, line: 1365, column: 29)
!1159 = !DILocation(line: 1367, column: 4, scope: !1158)
!1160 = !DILocation(line: 1368, column: 1, scope: !1145)
!1161 = distinct !DISubprogram(name: "GetCallerEFlags", scope: !1162, file: !1162, line: 200, type: !1163, isLocal: true, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !410)
!1162 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_asm_x86_common.h", directory: "/home/lichi/Desktop/open-vm-tools/line1587")
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!166}
!1165 = !DILocalVariable(name: "flags", scope: !1161, file: !1162, line: 202, type: !89)
!1166 = !DILocation(line: 202, column: 18, scope: !1161)
!1167 = !DILocation(line: 203, column: 4, scope: !1161)
!1168 = !{i32 616685}
!1169 = !DILocation(line: 204, column: 11, scope: !1161)
!1170 = !DILocation(line: 204, column: 4, scope: !1161)
!1171 = distinct !DISubprogram(name: "VmBackupStartCommon", scope: !382, file: !382, line: 861, type: !1172, isLocal: true, isDefinition: true, scopeLine: 863, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !410)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!75, !642, !75}
!1174 = !DILocalVariable(name: "data", arg: 1, scope: !1171, file: !382, line: 861, type: !642)
!1175 = !DILocation(line: 861, column: 32, scope: !1171)
!1176 = !DILocalVariable(name: "forceQuiesce", arg: 2, scope: !1171, file: !382, line: 862, type: !75)
!1177 = !DILocation(line: 862, column: 30, scope: !1171)
!1178 = !DILocalVariable(name: "ctx", scope: !1171, file: !382, line: 864, type: !100)
!1179 = !DILocation(line: 864, column: 17, scope: !1171)
!1180 = !DILocation(line: 864, column: 23, scope: !1171)
!1181 = !DILocation(line: 864, column: 29, scope: !1171)
!1182 = !DILocalVariable(name: "provider", scope: !1171, file: !382, line: 865, type: !1183)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupSyncProvider", file: !26, line: 163, baseType: !312)
!1185 = !DILocation(line: 865, column: 26, scope: !1171)
!1186 = !DILocalVariable(name: "completer", scope: !1171, file: !382, line: 866, type: !1187)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupSyncCompleter", file: !26, line: 176, baseType: !332)
!1189 = !DILocation(line: 866, column: 27, scope: !1171)
!1190 = !DILocalVariable(name: "i", scope: !1171, file: !382, line: 868, type: !431)
!1191 = !DILocation(line: 868, column: 11, scope: !1171)
!1192 = !DILocalVariable(name: "providers", scope: !1171, file: !382, line: 874, type: !1193)
!1193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1194, size: 256, align: 64, elements: !167)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SyncProvider", scope: !1171, file: !382, line: 871, size: 128, align: 64, elements: !1195)
!1195 = !{!1196, !1200}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "ctor", scope: !1194, file: !382, line: 872, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!1183}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "cfgEntry", scope: !1194, file: !382, line: 873, baseType: !107, size: 64, align: 64, offset: 64)
!1201 = !DILocation(line: 874, column: 6, scope: !1171)
!1202 = !DILocation(line: 882, column: 8, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1171, file: !382, line: 882, column: 8)
!1204 = !DILocation(line: 882, column: 8, scope: !1171)
!1205 = !DILocation(line: 883, column: 11, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1207, file: !382, line: 883, column: 11)
!1207 = distinct !DILexicalBlock(scope: !1203, file: !382, line: 882, column: 22)
!1208 = !DILocation(line: 883, column: 25, scope: !1206)
!1209 = !DILocation(line: 883, column: 37, scope: !1206)
!1210 = !DILocation(line: 883, column: 40, scope: !1211)
!1211 = !DILexicalBlockFile(scope: !1206, file: !382, discriminator: 1)
!1212 = !DILocation(line: 883, column: 54, scope: !1211)
!1213 = !DILocation(line: 883, column: 11, scope: !1211)
!1214 = !DILocation(line: 906, column: 14, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1216, file: !382, line: 906, column: 14)
!1216 = distinct !DILexicalBlock(scope: !1206, file: !382, line: 883, column: 65)
!1217 = !DILocation(line: 906, column: 28, scope: !1215)
!1218 = !DILocation(line: 906, column: 38, scope: !1215)
!1219 = !DILocation(line: 907, column: 39, scope: !1215)
!1220 = !DILocation(line: 907, column: 44, scope: !1215)
!1221 = !DILocation(line: 907, column: 14, scope: !1215)
!1222 = !DILocation(line: 906, column: 14, scope: !1223)
!1223 = !DILexicalBlockFile(scope: !1216, file: !382, discriminator: 1)
!1224 = !DILocation(line: 908, column: 24, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1215, file: !382, line: 907, column: 93)
!1226 = !DILocation(line: 908, column: 22, scope: !1225)
!1227 = !DILocation(line: 909, column: 10, scope: !1225)
!1228 = !DILocation(line: 911, column: 7, scope: !1216)
!1229 = !DILocation(line: 913, column: 21, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1206, file: !382, line: 911, column: 14)
!1231 = !DILocation(line: 913, column: 19, scope: !1230)
!1232 = !DILocation(line: 915, column: 4, scope: !1207)
!1233 = !DILocation(line: 917, column: 14, scope: !1234)
!1234 = distinct !DILexicalBlock(scope: !1235, file: !382, line: 917, column: 7)
!1235 = distinct !DILexicalBlock(scope: !1203, file: !382, line: 915, column: 11)
!1236 = !DILocation(line: 917, column: 12, scope: !1234)
!1237 = !DILocation(line: 917, column: 19, scope: !1238)
!1238 = !DILexicalBlockFile(scope: !1239, file: !382, discriminator: 1)
!1239 = distinct !DILexicalBlock(scope: !1234, file: !382, line: 917, column: 7)
!1240 = !DILocation(line: 917, column: 21, scope: !1238)
!1241 = !DILocation(line: 917, column: 7, scope: !1238)
!1242 = !DILocalVariable(name: "sp", scope: !1243, file: !382, line: 918, type: !1244)
!1243 = distinct !DILexicalBlock(scope: !1239, file: !382, line: 917, column: 72)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1245 = !DILocation(line: 918, column: 31, scope: !1243)
!1246 = !DILocation(line: 918, column: 47, scope: !1243)
!1247 = !DILocation(line: 918, column: 37, scope: !1243)
!1248 = !DILocation(line: 920, column: 39, scope: !1249)
!1249 = distinct !DILexicalBlock(scope: !1243, file: !382, line: 920, column: 14)
!1250 = !DILocation(line: 920, column: 44, scope: !1249)
!1251 = !DILocation(line: 920, column: 64, scope: !1249)
!1252 = !DILocation(line: 920, column: 68, scope: !1249)
!1253 = !DILocation(line: 920, column: 14, scope: !1249)
!1254 = !DILocation(line: 920, column: 14, scope: !1243)
!1255 = !DILocation(line: 921, column: 24, scope: !1256)
!1256 = distinct !DILexicalBlock(scope: !1249, file: !382, line: 920, column: 87)
!1257 = !DILocation(line: 921, column: 28, scope: !1256)
!1258 = !DILocation(line: 921, column: 22, scope: !1256)
!1259 = !DILocation(line: 922, column: 17, scope: !1260)
!1260 = distinct !DILexicalBlock(scope: !1256, file: !382, line: 922, column: 17)
!1261 = !DILocation(line: 922, column: 26, scope: !1260)
!1262 = !DILocation(line: 922, column: 17, scope: !1256)
!1263 = !DILocation(line: 936, column: 16, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1260, file: !382, line: 922, column: 34)
!1265 = !DILocation(line: 939, column: 10, scope: !1256)
!1266 = !DILocation(line: 940, column: 7, scope: !1243)
!1267 = !DILocation(line: 917, column: 68, scope: !1268)
!1268 = !DILexicalBlockFile(scope: !1239, file: !382, discriminator: 2)
!1269 = !DILocation(line: 917, column: 7, scope: !1268)
!1270 = distinct !{!1270, !1271}
!1271 = !DILocation(line: 917, column: 7, scope: !1235)
!1272 = !DILocation(line: 943, column: 8, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1171, file: !382, line: 943, column: 8)
!1274 = !DILocation(line: 943, column: 17, scope: !1273)
!1275 = !DILocation(line: 943, column: 8, scope: !1171)
!1276 = !DILocation(line: 944, column: 7, scope: !1277)
!1277 = distinct !DILexicalBlock(scope: !1273, file: !382, line: 943, column: 25)
!1278 = !DILocation(line: 945, column: 1, scope: !1277)
!1279 = !DILocation(line: 946, column: 7, scope: !1277)
!1280 = !DILocation(line: 950, column: 24, scope: !1171)
!1281 = !DILocation(line: 950, column: 30, scope: !1171)
!1282 = !DILocation(line: 950, column: 4, scope: !1171)
!1283 = !DILocation(line: 950, column: 18, scope: !1171)
!1284 = !DILocation(line: 950, column: 22, scope: !1171)
!1285 = !DILocation(line: 951, column: 4, scope: !1171)
!1286 = !DILocation(line: 951, column: 18, scope: !1171)
!1287 = !DILocation(line: 951, column: 29, scope: !1171)
!1288 = !DILocation(line: 952, column: 4, scope: !1171)
!1289 = !DILocation(line: 952, column: 18, scope: !1171)
!1290 = !DILocation(line: 952, column: 31, scope: !1171)
!1291 = !DILocation(line: 953, column: 4, scope: !1171)
!1292 = !DILocation(line: 953, column: 18, scope: !1171)
!1293 = !DILocation(line: 953, column: 31, scope: !1171)
!1294 = !DILocation(line: 954, column: 29, scope: !1171)
!1295 = !DILocation(line: 954, column: 4, scope: !1171)
!1296 = !DILocation(line: 954, column: 18, scope: !1171)
!1297 = !DILocation(line: 954, column: 27, scope: !1171)
!1298 = !DILocation(line: 955, column: 30, scope: !1171)
!1299 = !DILocation(line: 955, column: 4, scope: !1171)
!1300 = !DILocation(line: 955, column: 18, scope: !1171)
!1301 = !DILocation(line: 955, column: 28, scope: !1171)
!1302 = !DILocation(line: 956, column: 4, scope: !1171)
!1303 = !DILocation(line: 956, column: 18, scope: !1171)
!1304 = !DILocation(line: 956, column: 28, scope: !1171)
!1305 = !DILocation(line: 957, column: 25, scope: !1171)
!1306 = !DILocation(line: 957, column: 39, scope: !1171)
!1307 = !DILocation(line: 957, column: 4, scope: !1171)
!1308 = !DILocation(line: 958, column: 62, scope: !1171)
!1309 = !DILocation(line: 958, column: 67, scope: !1171)
!1310 = !DILocation(line: 958, column: 37, scope: !1171)
!1311 = !DILocation(line: 958, column: 4, scope: !1171)
!1312 = !DILocation(line: 958, column: 18, scope: !1171)
!1313 = !DILocation(line: 958, column: 35, scope: !1171)
!1314 = !DILocation(line: 962, column: 204, scope: !1171)
!1315 = !DILocation(line: 962, column: 218, scope: !1171)
!1316 = !DILocation(line: 962, column: 231, scope: !1171)
!1317 = !DILocation(line: 962, column: 245, scope: !1171)
!1318 = !DILocation(line: 962, column: 256, scope: !1171)
