; ModuleID = '/home/lichi/Desktop/genwqe/[task]tools--genwqe_update/[inter]tools--genwqe_update.o.i'
source_filename = "/home/lichi/Desktop/genwqe/[task]tools--genwqe_update/[inter]tools--genwqe_update.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.genwqe_type = type { i8*, i64 }
%struct.card_dev_t = type opaque
%struct.card_upd_params = type { i8*, i32, i32, i16, i8, i64, i64, i16, i16, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@verbose_flag = global i32 0, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !18, globals: !30)
!1 = !DIFile(filename: "/home/lichi/Desktop/genwqe/[task]tools--genwqe_update/[inter]tools--genwqe_update.o.i", directory: "/home/lichi/Desktop")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "_ISupper", value: 256)
!7 = !DIEnumerator(name: "_ISlower", value: 512)
!8 = !DIEnumerator(name: "_ISalpha", value: 1024)
!9 = !DIEnumerator(name: "_ISdigit", value: 2048)
!10 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!11 = !DIEnumerator(name: "_ISspace", value: 8192)
!12 = !DIEnumerator(name: "_ISprint", value: 16384)
!13 = !DIEnumerator(name: "_ISgraph", value: 32768)
!14 = !DIEnumerator(name: "_ISblank", value: 1)
!15 = !DIEnumerator(name: "_IScntrl", value: 2)
!16 = !DIEnumerator(name: "_ISpunct", value: 4)
!17 = !DIEnumerator(name: "_ISalnum", value: 8)
!18 = !{!19, !22, !23, !24, !25}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !26, line: 102, baseType: !27)
!26 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !28, line: 172, baseType: !29)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop")
!29 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!30 = !{!31, !33, !51, !52, !56}
!31 = distinct !DIGlobalVariable(name: "verbose_flag", scope: !0, file: !32, line: 40, type: !23, isLocal: false, isDefinition: true, variable: i32* @verbose_flag)
!32 = !DIFile(filename: "genwqe_update.c", directory: "/home/lichi/Desktop")
!33 = distinct !DIGlobalVariable(name: "long_options", scope: !34, file: !32, line: 270, type: !38, isLocal: true, isDefinition: true, variable: [8 x %struct.option]* @main.long_options)
!34 = distinct !DISubprogram(name: "main", scope: !32, file: !32, line: 252, type: !35, isLocal: false, isDefinition: true, scopeLine: 253, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !37)
!35 = !DISubroutineType(types: !36)
!36 = !{!23, !23, !19}
!37 = !{}
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 2048, align: 64, elements: !49)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !40, line: 104, size: 256, align: 64, elements: !41)
!40 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/lichi/Desktop")
!41 = !{!42, !45, !46, !48}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !39, file: !40, line: 106, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !39, file: !40, line: 109, baseType: !23, size: 32, align: 32, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !39, file: !40, line: 110, baseType: !47, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !39, file: !40, line: 111, baseType: !23, size: 32, align: 32, offset: 192)
!49 = !{!50}
!50 = !DISubrange(count: 8)
!51 = distinct !DIGlobalVariable(name: "version", scope: !0, file: !32, line: 42, type: !43, isLocal: true, isDefinition: true, variable: i8** @version)
!52 = distinct !DIGlobalVariable(name: "sysfs_type", scope: !0, file: !32, line: 43, type: !53, isLocal: true, isDefinition: true, variable: [128 x i8]* @sysfs_type)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1024, align: 8, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 128)
!56 = distinct !DIGlobalVariable(name: "card_types", scope: !0, file: !32, line: 55, type: !57, isLocal: true, isDefinition: true, variable: [5 x %struct.genwqe_type]* @card_types)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 640, align: 64, elements: !66)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "genwqe_type", file: !32, line: 45, size: 128, align: 64, elements: !60)
!60 = !{!61, !62}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "card_id", scope: !59, file: !32, line: 46, baseType: !43, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "rbf_size", scope: !59, file: !32, line: 47, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !64, line: 216, baseType: !65)
!64 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop")
!65 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!66 = !{!67}
!67 = !DISubrange(count: 5)
!68 = !{i32 2, !"Dwarf Version", i32 4}
!69 = !{i32 2, !"Debug Info Version", i32 3}
!70 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!71 = !DILocalVariable(name: "argc", arg: 1, scope: !34, file: !32, line: 252, type: !23)
!72 = !DIExpression()
!73 = !DILocation(line: 252, column: 14, scope: !34)
!74 = !DILocalVariable(name: "argv", arg: 2, scope: !34, file: !32, line: 252, type: !19)
!75 = !DILocation(line: 252, column: 26, scope: !34)
!76 = !DILocalVariable(name: "ch", scope: !34, file: !32, line: 254, type: !23)
!77 = !DILocation(line: 254, column: 6, scope: !34)
!78 = !DILocalVariable(name: "rc", scope: !34, file: !32, line: 254, type: !23)
!79 = !DILocation(line: 254, column: 10, scope: !34)
!80 = !DILocalVariable(name: "err_code", scope: !34, file: !32, line: 254, type: !23)
!81 = !DILocation(line: 254, column: 14, scope: !34)
!82 = !DILocalVariable(name: "card_no", scope: !34, file: !32, line: 255, type: !23)
!83 = !DILocation(line: 255, column: 6, scope: !34)
!84 = !DILocalVariable(name: "read_back", scope: !34, file: !32, line: 256, type: !23)
!85 = !DILocation(line: 256, column: 6, scope: !34)
!86 = !DILocalVariable(name: "verify", scope: !34, file: !32, line: 257, type: !23)
!87 = !DILocation(line: 257, column: 6, scope: !34)
!88 = !DILocalVariable(name: "force", scope: !34, file: !32, line: 258, type: !23)
!89 = !DILocation(line: 258, column: 6, scope: !34)
!90 = !DILocalVariable(name: "card", scope: !34, file: !32, line: 259, type: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "card_handle_t", file: !92, line: 95, baseType: !93)
!92 = !DIFile(filename: "../include/libcard.h", directory: "/home/lichi/Desktop")
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "card_dev_t", file: !92, line: 95, flags: DIFlagFwdDecl)
!95 = !DILocation(line: 259, column: 16, scope: !34)
!96 = !DILocalVariable(name: "upd", scope: !34, file: !32, line: 260, type: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "card_upd_params", file: !92, line: 337, size: 384, align: 64, elements: !98)
!98 = !{!99, !100, !104, !105, !107, !108, !110, !111, !112, !113}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !97, file: !92, line: 338, baseType: !43, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flength", scope: !97, file: !92, line: 339, baseType: !101, size: 32, align: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !102, line: 51, baseType: !103)
!102 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop")
!103 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !97, file: !92, line: 340, baseType: !101, size: 32, align: 32, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !97, file: !92, line: 341, baseType: !106, size: 16, align: 16, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !102, line: 49, baseType: !24)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !97, file: !92, line: 342, baseType: !21, size: 8, align: 8, offset: 144)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "slu_id", scope: !97, file: !92, line: 344, baseType: !109, size: 64, align: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !102, line: 55, baseType: !65)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "app_id", scope: !97, file: !92, line: 345, baseType: !109, size: 64, align: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "retc", scope: !97, file: !92, line: 347, baseType: !106, size: 16, align: 16, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "attn", scope: !97, file: !92, line: 348, baseType: !106, size: 16, align: 16, offset: 336)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !97, file: !92, line: 349, baseType: !101, size: 32, align: 32, offset: 352)
!114 = !DILocation(line: 260, column: 25, scope: !34)
!115 = !DILocalVariable(name: "env", scope: !34, file: !32, line: 261, type: !20)
!116 = !DILocation(line: 261, column: 8, scope: !34)
!117 = !DILocalVariable(name: "pext", scope: !34, file: !32, line: 262, type: !20)
!118 = !DILocation(line: 262, column: 8, scope: !34)
!119 = !DILocalVariable(name: "rbf_size", scope: !34, file: !32, line: 263, type: !63)
!120 = !DILocation(line: 263, column: 9, scope: !34)
!121 = !DILocation(line: 265, column: 2, scope: !34)
!122 = !DILocation(line: 266, column: 6, scope: !34)
!123 = !DILocation(line: 266, column: 16, scope: !34)
!124 = !DILocation(line: 268, column: 2, scope: !34)
!125 = !DILocalVariable(name: "option_index", scope: !126, file: !32, line: 269, type: !23)
!126 = distinct !DILexicalBlock(scope: !34, file: !32, line: 268, column: 12)
!127 = !DILocation(line: 269, column: 7, scope: !126)
!128 = !DILocation(line: 284, column: 20, scope: !126)
!129 = !DILocation(line: 284, column: 26, scope: !126)
!130 = !DILocation(line: 284, column: 8, scope: !126)
!131 = !DILocation(line: 284, column: 6, scope: !126)
!132 = !DILocation(line: 286, column: 7, scope: !133)
!133 = distinct !DILexicalBlock(scope: !126, file: !32, line: 286, column: 7)
!134 = !DILocation(line: 286, column: 10, scope: !133)
!135 = !DILocation(line: 286, column: 7, scope: !126)
!136 = !DILocation(line: 287, column: 4, scope: !133)
!137 = !DILocation(line: 289, column: 11, scope: !126)
!138 = !DILocation(line: 289, column: 3, scope: !126)
!139 = !DILocation(line: 292, column: 21, scope: !140)
!140 = distinct !DILexicalBlock(scope: !126, file: !32, line: 289, column: 15)
!141 = !DILocation(line: 292, column: 14, scope: !140)
!142 = !DILocation(line: 292, column: 12, scope: !140)
!143 = !DILocation(line: 293, column: 4, scope: !140)
!144 = !DILocation(line: 296, column: 16, scope: !140)
!145 = !DILocation(line: 296, column: 8, scope: !140)
!146 = !DILocation(line: 296, column: 14, scope: !140)
!147 = !DILocation(line: 297, column: 4, scope: !140)
!148 = !DILocation(line: 299, column: 21, scope: !140)
!149 = !DILocation(line: 299, column: 20, scope: !140)
!150 = !DILocation(line: 299, column: 8, scope: !140)
!151 = !DILocation(line: 299, column: 18, scope: !140)
!152 = !DILocation(line: 300, column: 4, scope: !140)
!153 = !DILocation(line: 302, column: 20, scope: !140)
!154 = !DILocation(line: 302, column: 13, scope: !140)
!155 = !DILocation(line: 302, column: 11, scope: !140)
!156 = !DILocation(line: 303, column: 4, scope: !140)
!157 = !DILocation(line: 305, column: 10, scope: !140)
!158 = !DILocation(line: 305, column: 4, scope: !140)
!159 = !DILocation(line: 306, column: 4, scope: !140)
!160 = !DILocation(line: 309, column: 19, scope: !140)
!161 = !DILocation(line: 309, column: 4, scope: !140)
!162 = !DILocation(line: 310, column: 4, scope: !140)
!163 = !DILocation(line: 312, column: 16, scope: !140)
!164 = !DILocation(line: 313, column: 4, scope: !140)
!165 = !DILocation(line: 315, column: 10, scope: !140)
!166 = !DILocation(line: 315, column: 4, scope: !140)
!167 = !DILocation(line: 316, column: 4, scope: !140)
!168 = !DILocation(line: 268, column: 2, scope: !169)
!169 = !DILexicalBlockFile(scope: !34, file: !32, discriminator: 1)
!170 = distinct !{!170, !124}
!171 = !DILocation(line: 320, column: 6, scope: !172)
!172 = distinct !DILexicalBlock(scope: !34, file: !32, line: 320, column: 6)
!173 = !DILocation(line: 320, column: 15, scope: !172)
!174 = !DILocation(line: 320, column: 13, scope: !172)
!175 = !DILocation(line: 320, column: 6, scope: !34)
!176 = !DILocation(line: 321, column: 26, scope: !172)
!177 = !DILocation(line: 321, column: 15, scope: !172)
!178 = !DILocation(line: 321, column: 7, scope: !172)
!179 = !DILocation(line: 321, column: 13, scope: !172)
!180 = !DILocation(line: 321, column: 3, scope: !172)
!181 = !DILocation(line: 323, column: 6, scope: !182)
!182 = distinct !DILexicalBlock(scope: !34, file: !32, line: 323, column: 6)
!183 = !DILocation(line: 323, column: 16, scope: !182)
!184 = !DILocation(line: 323, column: 13, scope: !182)
!185 = !DILocation(line: 323, column: 6, scope: !34)
!186 = !DILocation(line: 324, column: 9, scope: !187)
!187 = distinct !DILexicalBlock(scope: !182, file: !32, line: 323, column: 22)
!188 = !DILocation(line: 324, column: 3, scope: !187)
!189 = !DILocation(line: 325, column: 3, scope: !187)
!190 = !DILocation(line: 328, column: 24, scope: !34)
!191 = !DILocation(line: 328, column: 2, scope: !34)
!192 = !DILocation(line: 331, column: 8, scope: !34)
!193 = !DILocation(line: 331, column: 6, scope: !34)
!194 = !DILocation(line: 332, column: 7, scope: !195)
!195 = distinct !DILexicalBlock(scope: !34, file: !32, line: 332, column: 6)
!196 = !DILocation(line: 332, column: 6, scope: !195)
!197 = !DILocation(line: 332, column: 12, scope: !195)
!198 = !DILocation(line: 332, column: 21, scope: !199)
!199 = !DILexicalBlockFile(scope: !195, file: !32, discriminator: 1)
!200 = !DILocation(line: 332, column: 16, scope: !199)
!201 = !DILocation(line: 332, column: 26, scope: !199)
!202 = !DILocation(line: 332, column: 6, scope: !199)
!203 = !DILocation(line: 333, column: 3, scope: !204)
!204 = distinct !DILexicalBlock(scope: !195, file: !32, line: 332, column: 32)
!205 = distinct !{!205, !203}
!206 = !DILocation(line: 333, column: 2, scope: !207)
!207 = !DILexicalBlockFile(scope: !208, file: !32, discriminator: 1)
!208 = distinct !DILexicalBlock(scope: !204, file: !32, line: 333, column: 6)
!209 = !DILocation(line: 333, column: 8, scope: !207)
!210 = !DILocation(line: 333, column: 83, scope: !207)
!211 = !DILocation(line: 334, column: 3, scope: !204)
!212 = !DILocation(line: 337, column: 17, scope: !34)
!213 = !DILocation(line: 337, column: 2, scope: !34)
!214 = !DILocation(line: 338, column: 2, scope: !34)
!215 = !DILocation(line: 340, column: 13, scope: !34)
!216 = !DILocation(line: 340, column: 11, scope: !34)
!217 = !DILocation(line: 341, column: 39, scope: !34)
!218 = !DILocation(line: 341, column: 34, scope: !34)
!219 = !DILocation(line: 341, column: 2, scope: !34)
!220 = !DILocation(line: 342, column: 10, scope: !221)
!221 = distinct !DILexicalBlock(scope: !34, file: !32, line: 342, column: 6)
!222 = !DILocation(line: 342, column: 18, scope: !221)
!223 = !DILocation(line: 342, column: 6, scope: !34)
!224 = !DILocation(line: 343, column: 17, scope: !221)
!225 = !DILocation(line: 343, column: 7, scope: !221)
!226 = !DILocation(line: 343, column: 15, scope: !221)
!227 = !DILocation(line: 343, column: 3, scope: !221)
!228 = !DILocation(line: 346, column: 10, scope: !229)
!229 = distinct !DILexicalBlock(scope: !34, file: !32, line: 346, column: 6)
!230 = !DILocation(line: 346, column: 16, scope: !229)
!231 = !DILocation(line: 346, column: 6, scope: !34)
!232 = !DILocation(line: 347, column: 3, scope: !233)
!233 = distinct !DILexicalBlock(scope: !229, file: !32, line: 346, column: 24)
!234 = distinct !{!234, !232}
!235 = !DILocation(line: 347, column: 2, scope: !236)
!236 = !DILexicalBlockFile(scope: !237, file: !32, discriminator: 1)
!237 = distinct !DILexicalBlock(scope: !233, file: !32, line: 347, column: 6)
!238 = !DILocation(line: 347, column: 8, scope: !236)
!239 = !DILocation(line: 347, column: 73, scope: !236)
!240 = !DILocation(line: 348, column: 3, scope: !233)
!241 = !DILocation(line: 351, column: 21, scope: !34)
!242 = !DILocation(line: 351, column: 9, scope: !34)
!243 = !DILocation(line: 351, column: 7, scope: !34)
!244 = !DILocation(line: 352, column: 7, scope: !245)
!245 = distinct !DILexicalBlock(scope: !34, file: !32, line: 352, column: 6)
!246 = !DILocation(line: 352, column: 13, scope: !245)
!247 = !DILocation(line: 352, column: 18, scope: !248)
!248 = !DILexicalBlockFile(scope: !245, file: !32, discriminator: 1)
!249 = !DILocation(line: 352, column: 23, scope: !248)
!250 = !DILocation(line: 352, column: 31, scope: !248)
!251 = !DILocation(line: 352, column: 43, scope: !252)
!252 = !DILexicalBlockFile(scope: !245, file: !32, discriminator: 2)
!253 = !DILocation(line: 352, column: 35, scope: !252)
!254 = !DILocation(line: 352, column: 60, scope: !252)
!255 = !DILocation(line: 352, column: 6, scope: !252)
!256 = !DILocation(line: 353, column: 3, scope: !257)
!257 = distinct !DILexicalBlock(scope: !245, file: !32, line: 352, column: 68)
!258 = distinct !{!258, !256}
!259 = !DILocation(line: 353, column: 2, scope: !260)
!260 = !DILexicalBlockFile(scope: !261, file: !32, discriminator: 1)
!261 = distinct !DILexicalBlock(scope: !257, file: !32, line: 353, column: 6)
!262 = !DILocation(line: 353, column: 81, scope: !260)
!263 = !DILocation(line: 353, column: 8, scope: !260)
!264 = !DILocation(line: 353, column: 89, scope: !260)
!265 = !DILocation(line: 354, column: 3, scope: !257)
!266 = !DILocation(line: 358, column: 10, scope: !267)
!267 = distinct !DILexicalBlock(scope: !34, file: !32, line: 358, column: 6)
!268 = !DILocation(line: 358, column: 6, scope: !267)
!269 = !DILocation(line: 358, column: 20, scope: !267)
!270 = !DILocation(line: 358, column: 27, scope: !267)
!271 = !DILocation(line: 358, column: 34, scope: !272)
!272 = !DILexicalBlockFile(scope: !267, file: !32, discriminator: 1)
!273 = !DILocation(line: 358, column: 30, scope: !272)
!274 = !DILocation(line: 358, column: 44, scope: !272)
!275 = !DILocation(line: 358, column: 6, scope: !272)
!276 = !DILocation(line: 359, column: 3, scope: !277)
!277 = distinct !DILexicalBlock(scope: !267, file: !32, line: 358, column: 52)
!278 = distinct !{!278, !276}
!279 = !DILocation(line: 359, column: 2, scope: !280)
!280 = !DILexicalBlockFile(scope: !281, file: !32, discriminator: 1)
!281 = distinct !DILexicalBlock(scope: !277, file: !32, line: 359, column: 6)
!282 = !DILocation(line: 359, column: 6, scope: !280)
!283 = !DILocation(line: 359, column: 23, scope: !280)
!284 = !DILocation(line: 359, column: 3, scope: !280)
!285 = !DILocation(line: 359, column: 5, scope: !280)
!286 = !DILocation(line: 359, column: 4, scope: !280)
!287 = !DILocation(line: 359, column: 8, scope: !288)
!288 = !DILexicalBlockFile(scope: !281, file: !32, discriminator: 2)
!289 = !DILocation(line: 359, column: 4, scope: !288)
!290 = !DILocation(line: 359, column: 2, scope: !288)
!291 = !DILocation(line: 359, column: 2, scope: !292)
!292 = !DILexicalBlockFile(scope: !281, file: !32, discriminator: 3)
!293 = !DILocation(line: 359, column: 2, scope: !294)
!294 = !DILexicalBlockFile(scope: !281, file: !32, discriminator: 4)
!295 = !DILocation(line: 359, column: 8, scope: !294)
!296 = !DILocation(line: 359, column: 26, scope: !294)
!297 = !DILocation(line: 361, column: 3, scope: !277)
!298 = !DILocation(line: 365, column: 26, scope: !34)
!299 = !DILocation(line: 365, column: 9, scope: !34)
!300 = !DILocation(line: 365, column: 7, scope: !34)
!301 = !DILocation(line: 367, column: 6, scope: !302)
!302 = distinct !DILexicalBlock(scope: !34, file: !32, line: 367, column: 6)
!303 = !DILocation(line: 367, column: 11, scope: !302)
!304 = !DILocation(line: 367, column: 6, scope: !34)
!305 = !DILocation(line: 368, column: 3, scope: !306)
!306 = distinct !DILexicalBlock(scope: !302, file: !32, line: 367, column: 19)
!307 = distinct !{!307, !305}
!308 = !DILocation(line: 368, column: 2, scope: !309)
!309 = !DILexicalBlockFile(scope: !310, file: !32, discriminator: 1)
!310 = distinct !DILexicalBlock(scope: !306, file: !32, line: 368, column: 6)
!311 = !DILocation(line: 368, column: 80, scope: !309)
!312 = !DILocation(line: 368, column: 89, scope: !309)
!313 = !DILocation(line: 368, column: 8, scope: !309)
!314 = !DILocation(line: 368, column: 100, scope: !309)
!315 = !DILocation(line: 369, column: 3, scope: !306)
!316 = !DILocation(line: 373, column: 6, scope: !317)
!317 = distinct !DILexicalBlock(scope: !34, file: !32, line: 373, column: 6)
!318 = !DILocation(line: 373, column: 6, scope: !34)
!319 = !DILocation(line: 374, column: 11, scope: !320)
!320 = distinct !DILexicalBlock(scope: !321, file: !32, line: 374, column: 7)
!321 = distinct !DILexicalBlock(scope: !317, file: !32, line: 373, column: 17)
!322 = !DILocation(line: 374, column: 19, scope: !320)
!323 = !DILocation(line: 374, column: 7, scope: !321)
!324 = !DILocation(line: 375, column: 4, scope: !325)
!325 = distinct !DILexicalBlock(scope: !320, file: !32, line: 374, column: 25)
!326 = distinct !{!326, !324}
!327 = !DILocation(line: 375, column: 3, scope: !328)
!328 = !DILexicalBlockFile(scope: !329, file: !32, discriminator: 1)
!329 = distinct !DILexicalBlock(scope: !325, file: !32, line: 375, column: 7)
!330 = !DILocation(line: 375, column: 9, scope: !328)
!331 = !DILocation(line: 375, column: 84, scope: !328)
!332 = !DILocation(line: 376, column: 7, scope: !325)
!333 = !DILocation(line: 377, column: 4, scope: !325)
!334 = !DILocation(line: 379, column: 26, scope: !321)
!335 = !DILocation(line: 379, column: 8, scope: !321)
!336 = !DILocation(line: 379, column: 6, scope: !321)
!337 = !DILocation(line: 380, column: 7, scope: !338)
!338 = distinct !DILexicalBlock(scope: !321, file: !32, line: 380, column: 7)
!339 = !DILocation(line: 380, column: 10, scope: !338)
!340 = !DILocation(line: 380, column: 7, scope: !321)
!341 = !DILocalVariable(name: "xerrno", scope: !342, file: !32, line: 381, type: !23)
!342 = distinct !DILexicalBlock(scope: !338, file: !32, line: 380, column: 15)
!343 = !DILocation(line: 381, column: 8, scope: !342)
!344 = !DILocation(line: 381, column: 18, scope: !342)
!345 = !DILocation(line: 381, column: 17, scope: !342)
!346 = !DILocation(line: 383, column: 4, scope: !342)
!347 = distinct !{!347, !346}
!348 = !DILocation(line: 383, column: 3, scope: !349)
!349 = !DILexicalBlockFile(scope: !350, file: !32, discriminator: 1)
!350 = distinct !DILexicalBlock(scope: !342, file: !32, line: 383, column: 7)
!351 = !DILocation(line: 383, column: 20, scope: !349)
!352 = !DILocation(line: 383, column: 6, scope: !349)
!353 = !DILocation(line: 383, column: 25, scope: !349)
!354 = !DILocation(line: 383, column: 42, scope: !349)
!355 = !DILocation(line: 383, column: 33, scope: !356)
!356 = !DILexicalBlockFile(scope: !349, file: !32, discriminator: 2)
!357 = !DILocation(line: 383, column: 9, scope: !358)
!358 = !DILexicalBlockFile(scope: !349, file: !32, discriminator: 3)
!359 = !DILocation(line: 383, column: 52, scope: !349)
!360 = !DILocation(line: 386, column: 33, scope: !342)
!361 = !DILocation(line: 386, column: 29, scope: !342)
!362 = !DILocation(line: 386, column: 43, scope: !342)
!363 = !DILocation(line: 386, column: 39, scope: !342)
!364 = !DILocation(line: 387, column: 12, scope: !342)
!365 = !DILocation(line: 386, column: 4, scope: !342)
!366 = !DILocation(line: 388, column: 7, scope: !342)
!367 = !DILocation(line: 389, column: 4, scope: !342)
!368 = !DILocation(line: 391, column: 2, scope: !321)
!369 = !DILocalVariable(name: "s", scope: !370, file: !32, line: 392, type: !371)
!370 = distinct !DILexicalBlock(scope: !317, file: !32, line: 391, column: 9)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !372, line: 46, size: 1152, align: 64, elements: !373)
!372 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop")
!373 = !{!374, !376, !378, !380, !382, !384, !386, !387, !388, !390, !392, !394, !402, !403, !404}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !371, file: !372, line: 48, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !28, line: 124, baseType: !65)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !371, file: !372, line: 53, baseType: !377, size: 64, align: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !28, line: 127, baseType: !65)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !371, file: !372, line: 61, baseType: !379, size: 64, align: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !28, line: 130, baseType: !65)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !371, file: !372, line: 62, baseType: !381, size: 32, align: 32, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !28, line: 129, baseType: !103)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !371, file: !372, line: 64, baseType: !383, size: 32, align: 32, offset: 224)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !28, line: 125, baseType: !103)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !371, file: !372, line: 65, baseType: !385, size: 32, align: 32, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !28, line: 126, baseType: !103)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !371, file: !372, line: 67, baseType: !23, size: 32, align: 32, offset: 288)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !371, file: !372, line: 69, baseType: !375, size: 64, align: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !371, file: !372, line: 74, baseType: !389, size: 64, align: 64, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !28, line: 131, baseType: !29)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !371, file: !372, line: 78, baseType: !391, size: 64, align: 64, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !28, line: 153, baseType: !29)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !371, file: !372, line: 80, baseType: !393, size: 64, align: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !28, line: 158, baseType: !29)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !371, file: !372, line: 91, baseType: !395, size: 128, align: 64, offset: 576)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !396, line: 120, size: 128, align: 64, elements: !397)
!396 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop")
!397 = !{!398, !400}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !395, file: !396, line: 122, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !28, line: 139, baseType: !29)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !395, file: !396, line: 123, baseType: !401, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !28, line: 175, baseType: !29)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !371, file: !372, line: 92, baseType: !395, size: 128, align: 64, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !371, file: !372, line: 93, baseType: !395, size: 128, align: 64, offset: 832)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !371, file: !372, line: 106, baseType: !405, size: 192, align: 64, offset: 960)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 192, align: 64, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 3)
!408 = !DILocation(line: 392, column: 15, scope: !370)
!409 = !DILocation(line: 394, column: 18, scope: !370)
!410 = !DILocation(line: 394, column: 8, scope: !370)
!411 = !DILocation(line: 394, column: 6, scope: !370)
!412 = !DILocation(line: 395, column: 7, scope: !413)
!413 = distinct !DILexicalBlock(scope: !370, file: !32, line: 395, column: 7)
!414 = !DILocation(line: 395, column: 10, scope: !413)
!415 = !DILocation(line: 395, column: 7, scope: !370)
!416 = !DILocation(line: 396, column: 4, scope: !417)
!417 = distinct !DILexicalBlock(scope: !413, file: !32, line: 395, column: 16)
!418 = distinct !{!418, !416}
!419 = !DILocation(line: 396, column: 3, scope: !420)
!420 = !DILexicalBlockFile(scope: !421, file: !32, discriminator: 1)
!421 = distinct !DILexicalBlock(scope: !417, file: !32, line: 396, column: 7)
!422 = !DILocation(line: 396, column: 71, scope: !420)
!423 = !DILocation(line: 396, column: 9, scope: !420)
!424 = !DILocation(line: 396, column: 79, scope: !420)
!425 = !DILocation(line: 397, column: 7, scope: !417)
!426 = !DILocation(line: 398, column: 4, scope: !417)
!427 = !DILocation(line: 401, column: 8, scope: !428)
!428 = distinct !DILexicalBlock(scope: !370, file: !32, line: 401, column: 7)
!429 = !DILocation(line: 401, column: 14, scope: !428)
!430 = !DILocation(line: 401, column: 20, scope: !431)
!431 = !DILexicalBlockFile(scope: !428, file: !32, discriminator: 1)
!432 = !DILocation(line: 401, column: 44, scope: !431)
!433 = !DILocation(line: 401, column: 31, scope: !431)
!434 = !DILocation(line: 401, column: 28, scope: !431)
!435 = !DILocation(line: 401, column: 7, scope: !431)
!436 = !DILocation(line: 402, column: 4, scope: !437)
!437 = distinct !DILexicalBlock(scope: !428, file: !32, line: 401, column: 54)
!438 = distinct !{!438, !436}
!439 = !DILocation(line: 402, column: 3, scope: !440)
!440 = !DILexicalBlockFile(scope: !441, file: !32, discriminator: 1)
!441 = distinct !DILexicalBlock(scope: !437, file: !32, line: 402, column: 7)
!442 = !DILocation(line: 402, column: 13, scope: !440)
!443 = !DILocation(line: 402, column: 6, scope: !440)
!444 = !DILocation(line: 402, column: 26, scope: !440)
!445 = !DILocation(line: 402, column: 9, scope: !440)
!446 = !DILocation(line: 402, column: 36, scope: !440)
!447 = !DILocation(line: 405, column: 7, scope: !437)
!448 = !DILocation(line: 406, column: 4, scope: !437)
!449 = !DILocation(line: 409, column: 28, scope: !370)
!450 = !DILocation(line: 409, column: 40, scope: !370)
!451 = !DILocation(line: 409, column: 8, scope: !370)
!452 = !DILocation(line: 409, column: 6, scope: !370)
!453 = !DILocation(line: 410, column: 7, scope: !454)
!454 = distinct !DILexicalBlock(scope: !370, file: !32, line: 410, column: 7)
!455 = !DILocation(line: 410, column: 10, scope: !454)
!456 = !DILocation(line: 410, column: 7, scope: !370)
!457 = !DILocalVariable(name: "xerrno", scope: !458, file: !32, line: 411, type: !23)
!458 = distinct !DILexicalBlock(scope: !454, file: !32, line: 410, column: 15)
!459 = !DILocation(line: 411, column: 8, scope: !458)
!460 = !DILocation(line: 411, column: 18, scope: !458)
!461 = !DILocation(line: 411, column: 17, scope: !458)
!462 = !DILocation(line: 413, column: 8, scope: !463)
!463 = distinct !DILexicalBlock(scope: !458, file: !32, line: 413, column: 8)
!464 = !DILocation(line: 413, column: 15, scope: !463)
!465 = !DILocation(line: 413, column: 8, scope: !458)
!466 = !DILocation(line: 414, column: 5, scope: !467)
!467 = distinct !DILexicalBlock(scope: !463, file: !32, line: 413, column: 25)
!468 = distinct !{!468, !466}
!469 = !DILocation(line: 414, column: 14, scope: !470)
!470 = !DILexicalBlockFile(scope: !471, file: !32, discriminator: 1)
!471 = distinct !DILexicalBlock(scope: !472, file: !32, line: 414, column: 14)
!472 = distinct !DILexicalBlock(scope: !467, file: !32, line: 414, column: 8)
!473 = !DILocation(line: 414, column: 4, scope: !474)
!474 = !DILexicalBlockFile(scope: !471, file: !32, discriminator: 2)
!475 = !DILocation(line: 414, column: 28, scope: !474)
!476 = !DILocation(line: 414, column: 74, scope: !477)
!477 = !DILexicalBlockFile(scope: !472, file: !32, discriminator: 3)
!478 = !DILocation(line: 416, column: 8, scope: !467)
!479 = !DILocation(line: 417, column: 5, scope: !467)
!480 = !DILocation(line: 419, column: 4, scope: !458)
!481 = distinct !{!481, !480}
!482 = !DILocation(line: 419, column: 3, scope: !483)
!483 = !DILexicalBlockFile(scope: !484, file: !32, discriminator: 1)
!484 = distinct !DILexicalBlock(scope: !458, file: !32, line: 419, column: 7)
!485 = !DILocation(line: 419, column: 20, scope: !483)
!486 = !DILocation(line: 419, column: 6, scope: !483)
!487 = !DILocation(line: 419, column: 25, scope: !483)
!488 = !DILocation(line: 419, column: 42, scope: !483)
!489 = !DILocation(line: 419, column: 33, scope: !490)
!490 = !DILexicalBlockFile(scope: !483, file: !32, discriminator: 2)
!491 = !DILocation(line: 419, column: 9, scope: !492)
!492 = !DILexicalBlockFile(scope: !483, file: !32, discriminator: 3)
!493 = !DILocation(line: 419, column: 52, scope: !483)
!494 = !DILocation(line: 426, column: 33, scope: !458)
!495 = !DILocation(line: 426, column: 29, scope: !458)
!496 = !DILocation(line: 426, column: 43, scope: !458)
!497 = !DILocation(line: 426, column: 39, scope: !458)
!498 = !DILocation(line: 427, column: 12, scope: !458)
!499 = !DILocation(line: 426, column: 4, scope: !458)
!500 = !DILocation(line: 428, column: 7, scope: !458)
!501 = !DILocation(line: 429, column: 3, scope: !458)
!502 = !DILocation(line: 373, column: 6, scope: !503)
!503 = !DILexicalBlockFile(scope: !317, file: !32, discriminator: 1)
!504 = !DILocation(line: 433, column: 20, scope: !34)
!505 = !DILocation(line: 433, column: 2, scope: !34)
!506 = !DILocation(line: 434, column: 6, scope: !507)
!507 = distinct !DILexicalBlock(scope: !34, file: !32, line: 434, column: 6)
!508 = !DILocation(line: 434, column: 9, scope: !507)
!509 = !DILocation(line: 434, column: 6, scope: !34)
!510 = !DILocation(line: 435, column: 3, scope: !507)
!511 = !DILocation(line: 436, column: 7, scope: !34)
!512 = !DILocation(line: 436, column: 2, scope: !34)
!513 = !DILocation(line: 437, column: 1, scope: !34)
!514 = distinct !DISubprogram(name: "usage", scope: !32, file: !32, line: 134, type: !515, isLocal: true, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !37)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !43}
!517 = !DILocalVariable(name: "prog", arg: 1, scope: !514, file: !32, line: 134, type: !43)
!518 = !DILocation(line: 134, column: 31, scope: !514)
!519 = !DILocation(line: 158, column: 9, scope: !514)
!520 = !DILocation(line: 158, column: 15, scope: !514)
!521 = !DILocation(line: 158, column: 21, scope: !514)
!522 = !DILocation(line: 136, column: 2, scope: !514)
!523 = !DILocation(line: 159, column: 1, scope: !514)
!524 = distinct !DISubprogram(name: "read_card_type", scope: !32, file: !32, line: 79, type: !525, isLocal: true, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !37)
!525 = !DISubroutineType(types: !526)
!526 = !{!23, !23}
!527 = !DILocalVariable(name: "card_no", arg: 1, scope: !524, file: !32, line: 79, type: !23)
!528 = !DILocation(line: 79, column: 31, scope: !524)
!529 = !DILocalVariable(name: "rc", scope: !524, file: !32, line: 81, type: !23)
!530 = !DILocation(line: 81, column: 6, scope: !524)
!531 = !DILocalVariable(name: "sysfs", scope: !524, file: !32, line: 82, type: !53)
!532 = !DILocation(line: 82, column: 7, scope: !524)
!533 = !DILocalVariable(name: "fp", scope: !524, file: !32, line: 83, type: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !26, line: 48, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !537, line: 241, size: 1728, align: 64, elements: !538)
!537 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop")
!538 = !{!539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !559, !560, !561, !562, !563, !564, !566, !570, !573, !575, !576, !577, !578, !579, !580, !581}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !536, file: !537, line: 242, baseType: !23, size: 32, align: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !536, file: !537, line: 247, baseType: !20, size: 64, align: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !536, file: !537, line: 248, baseType: !20, size: 64, align: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !536, file: !537, line: 249, baseType: !20, size: 64, align: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !536, file: !537, line: 250, baseType: !20, size: 64, align: 64, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !536, file: !537, line: 251, baseType: !20, size: 64, align: 64, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !536, file: !537, line: 252, baseType: !20, size: 64, align: 64, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !536, file: !537, line: 253, baseType: !20, size: 64, align: 64, offset: 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !536, file: !537, line: 254, baseType: !20, size: 64, align: 64, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !536, file: !537, line: 256, baseType: !20, size: 64, align: 64, offset: 576)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !536, file: !537, line: 257, baseType: !20, size: 64, align: 64, offset: 640)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !536, file: !537, line: 258, baseType: !20, size: 64, align: 64, offset: 704)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !536, file: !537, line: 260, baseType: !552, size: 64, align: 64, offset: 768)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !537, line: 156, size: 192, align: 64, elements: !554)
!554 = !{!555, !556, !558}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !553, file: !537, line: 157, baseType: !552, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !553, file: !537, line: 158, baseType: !557, size: 64, align: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !553, file: !537, line: 162, baseType: !23, size: 32, align: 32, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !536, file: !537, line: 262, baseType: !557, size: 64, align: 64, offset: 832)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !536, file: !537, line: 264, baseType: !23, size: 32, align: 32, offset: 896)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !536, file: !537, line: 268, baseType: !23, size: 32, align: 32, offset: 928)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !536, file: !537, line: 270, baseType: !389, size: 64, align: 64, offset: 960)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !536, file: !537, line: 274, baseType: !24, size: 16, align: 16, offset: 1024)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !536, file: !537, line: 275, baseType: !565, size: 8, align: 8, offset: 1040)
!565 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !536, file: !537, line: 276, baseType: !567, size: 8, align: 8, offset: 1048)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, align: 8, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 1)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !536, file: !537, line: 280, baseType: !571, size: 64, align: 64, offset: 1088)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !537, line: 150, baseType: null)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !536, file: !537, line: 289, baseType: !574, size: 64, align: 64, offset: 1152)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !28, line: 132, baseType: !29)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !536, file: !537, line: 297, baseType: !22, size: 64, align: 64, offset: 1216)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !536, file: !537, line: 298, baseType: !22, size: 64, align: 64, offset: 1280)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !536, file: !537, line: 299, baseType: !22, size: 64, align: 64, offset: 1344)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !536, file: !537, line: 300, baseType: !22, size: 64, align: 64, offset: 1408)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !536, file: !537, line: 302, baseType: !63, size: 64, align: 64, offset: 1472)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !536, file: !537, line: 303, baseType: !23, size: 32, align: 32, offset: 1536)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !536, file: !537, line: 305, baseType: !582, size: 160, align: 8, offset: 1568)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 160, align: 8, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 20)
!585 = !DILocation(line: 83, column: 8, scope: !524)
!586 = !DILocation(line: 85, column: 11, scope: !524)
!587 = !DILocation(line: 85, column: 85, scope: !524)
!588 = !DILocation(line: 85, column: 2, scope: !524)
!589 = !DILocation(line: 86, column: 30, scope: !524)
!590 = !DILocation(line: 88, column: 13, scope: !524)
!591 = !DILocation(line: 88, column: 7, scope: !524)
!592 = !DILocation(line: 88, column: 5, scope: !524)
!593 = !DILocation(line: 89, column: 6, scope: !594)
!594 = distinct !DILexicalBlock(scope: !524, file: !32, line: 89, column: 6)
!595 = !DILocation(line: 89, column: 9, scope: !594)
!596 = !DILocation(line: 89, column: 6, scope: !524)
!597 = !DILocation(line: 90, column: 3, scope: !594)
!598 = !DILocation(line: 92, column: 48, scope: !524)
!599 = !DILocation(line: 92, column: 7, scope: !524)
!600 = !DILocation(line: 92, column: 5, scope: !524)
!601 = !DILocation(line: 93, column: 35, scope: !524)
!602 = !DILocation(line: 94, column: 6, scope: !603)
!603 = distinct !DILexicalBlock(scope: !524, file: !32, line: 94, column: 6)
!604 = !DILocation(line: 94, column: 9, scope: !603)
!605 = !DILocation(line: 94, column: 6, scope: !524)
!606 = !DILocation(line: 95, column: 10, scope: !607)
!607 = distinct !DILexicalBlock(scope: !603, file: !32, line: 94, column: 15)
!608 = !DILocation(line: 95, column: 3, scope: !607)
!609 = !DILocation(line: 96, column: 3, scope: !607)
!610 = !DILocation(line: 99, column: 13, scope: !524)
!611 = !DILocation(line: 99, column: 31, scope: !524)
!612 = !DILocation(line: 99, column: 2, scope: !524)
!613 = !DILocation(line: 99, column: 35, scope: !524)
!614 = !DILocation(line: 100, column: 9, scope: !524)
!615 = !DILocation(line: 100, column: 2, scope: !524)
!616 = !DILocation(line: 101, column: 2, scope: !524)
!617 = !DILocation(line: 102, column: 1, scope: !524)
!618 = distinct !DISubprogram(name: "get_rbf_size", scope: !32, file: !32, line: 63, type: !619, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !37)
!619 = !DISubroutineType(types: !620)
!620 = !{!63, !20}
!621 = !DILocalVariable(name: "card_type", arg: 1, scope: !618, file: !32, line: 63, type: !20)
!622 = !DILocation(line: 63, column: 34, scope: !618)
!623 = !DILocalVariable(name: "t", scope: !618, file: !32, line: 65, type: !624)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!625 = !DILocation(line: 65, column: 28, scope: !618)
!626 = !DILocation(line: 67, column: 9, scope: !627)
!627 = distinct !DILexicalBlock(scope: !618, file: !32, line: 67, column: 2)
!628 = !DILocation(line: 67, column: 7, scope: !627)
!629 = !DILocation(line: 67, column: 27, scope: !630)
!630 = !DILexicalBlockFile(scope: !631, file: !32, discriminator: 1)
!631 = distinct !DILexicalBlock(scope: !627, file: !32, line: 67, column: 2)
!632 = !DILocation(line: 67, column: 30, scope: !630)
!633 = !DILocation(line: 67, column: 38, scope: !630)
!634 = !DILocation(line: 67, column: 2, scope: !630)
!635 = !DILocation(line: 68, column: 14, scope: !636)
!636 = distinct !DILexicalBlock(scope: !637, file: !32, line: 68, column: 7)
!637 = distinct !DILexicalBlock(scope: !631, file: !32, line: 67, column: 51)
!638 = !DILocation(line: 68, column: 25, scope: !636)
!639 = !DILocation(line: 68, column: 28, scope: !636)
!640 = !DILocation(line: 68, column: 7, scope: !636)
!641 = !DILocation(line: 68, column: 37, scope: !636)
!642 = !DILocation(line: 68, column: 7, scope: !637)
!643 = !DILocation(line: 69, column: 11, scope: !636)
!644 = !DILocation(line: 69, column: 14, scope: !636)
!645 = !DILocation(line: 69, column: 4, scope: !636)
!646 = !DILocation(line: 70, column: 2, scope: !637)
