; ModuleID = './libguestInfo_la-guestInfoServer.o.i'
source_filename = "./libguestInfo_la-guestInfoServer.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ToolsPluginData = type { i8*, %struct._GArray*, i32 (%struct.ToolsAppCtx*, i32, i8*, %struct.ToolsPluginData*)*, i8* }
%struct._GArray = type { i8*, i32 }
%struct.ToolsAppCtx = type { i32, i8*, i32, i32, %struct._GMainLoop*, %struct._RpcChannel*, %struct._GKeyFile*, i32, i32, i8**, i8* }
%struct._GMainLoop = type opaque
%struct._RpcChannel = type opaque
%struct._GKeyFile = type opaque
%struct.RpcChannelCallback = type { i8*, i32 (%struct.RpcInData*)*, i8*, i8*, i8*, i64 }
%struct.RpcInData = type { i8*, i8*, i64, i8*, i64, i32, i8*, i8* }
%struct.ToolsPluginSignalCb = type { i8*, i8*, i8* }
%struct._GuestInfoCache = type { [11 x i8*], %struct.NicInfoV3*, %struct._DiskInfo*, i32 }
%struct.NicInfoV3 = type { %struct.anon, %struct.anon.3, %struct.DnsConfigInfo*, %struct.WinsConfigInfo*, %struct.DhcpConfigInfo*, %struct.DhcpConfigInfo* }
%struct.anon = type { i32, %struct.GuestNicV3* }
%struct.GuestNicV3 = type { i8*, %struct.anon.0, %struct.DnsConfigInfo*, %struct.WinsConfigInfo*, %struct.DhcpConfigInfo*, %struct.DhcpConfigInfo* }
%struct.anon.0 = type { i32, %struct.IpAddressEntry* }
%struct.IpAddressEntry = type { %struct.TypedIpAddress, i32, i32*, i32* }
%struct.TypedIpAddress = type { i32, %struct.InetAddress }
%struct.InetAddress = type { i32, i8* }

!46 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 232, size: 32, align: 32, elements: !49)
!48 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/plugin.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!49 = !{!50}
!50 = !DIEnumerator(name: "TOOLS_CORE_API_V1", value: 1)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 62, size: 32, align: 32, elements: !53)
!52 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/guestInfo.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!54 = !DIEnumerator(name: "INFO_ERROR", value: 0)
!55 = !DIEnumerator(name: "INFO_DNS_NAME", value: 1)
!56 = !DIEnumerator(name: "INFO_IPADDRESS", value: 2)
!57 = !DIEnumerator(name: "INFO_DISK_FREE_SPACE", value: 3)
!58 = !DIEnumerator(name: "INFO_BUILD_NUMBER", value: 4)
!59 = !DIEnumerator(name: "INFO_OS_NAME_FULL", value: 5)
!60 = !DIEnumerator(name: "INFO_OS_NAME", value: 6)
!61 = !DIEnumerator(name: "INFO_UPTIME", value: 7)
!62 = !DIEnumerator(name: "INFO_MEMORY", value: 8)
!63 = !DIEnumerator(name: "INFO_IPADDRESS_V2", value: 9)
!64 = !DIEnumerator(name: "INFO_IPADDRESS_V3", value: 10)
!65 = !DIEnumerator(name: "INFO_MAX", value: 11)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 339, size: 32, align: 32, elements: !67)
!67 = !{!68, !69, !70, !71}
!68 = !DIEnumerator(name: "TOOLS_APP_GUESTRPC", value: 1)
!69 = !DIEnumerator(name: "TOOLS_APP_SIGNALS", value: 2)
!70 = !DIEnumerator(name: "TOOLS_APP_PROVIDER", value: 3)
!71 = !DIEnumerator(name: "TOOLS_SVC_PROPERTY", value: 4)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "NicInfoMethod", file: !73, line: 103, size: 32, align: 32, elements: !74)
!73 = !DIFile(filename: "guestInfoServer.c", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!74 = !{!75, !76, !77, !78, !79}
!75 = !DIEnumerator(name: "NIC_INFO_V3_WITH_INFO_IPADDRESS_V3", value: 0)
!76 = !DIEnumerator(name: "NIC_INFO_V3_WITH_INFO_IPADDRESS_V2", value: 1)
!77 = !DIEnumerator(name: "NIC_INFO_V2_WITH_INFO_IPADDRESS_V2", value: 2)
!78 = !DIEnumerator(name: "NIC_INFO_V1_WITH_INFO_IPADDRESS", value: 3)
!79 = !DIEnumerator(name: "NIC_INFO_METHOD_MAX", value: 4)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "NicInfoVersion", file: !4, line: 17, size: 32, align: 32, elements: !81)
!81 = !{!82, !83, !84}
!82 = !DIEnumerator(name: "NIC_INFO_V1", value: 1)
!83 = !DIEnumerator(name: "NIC_INFO_V2", value: 2)
!84 = !DIEnumerator(name: "NIC_INFO_V3", value: 3)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "NicInfoAddrType", file: !4, line: 28, size: 32, align: 32, elements: !86)
!86 = !{!87, !88}
!87 = !DIEnumerator(name: "NICINFO_ADDR_IPV4", value: 0)
!88 = !DIEnumerator(name: "NICINFO_ADDR_IPV6", value: 1)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdr_op", file: !90, line: 81, size: 32, align: 32, elements: !91)
!90 = !DIFile(filename: "/usr/include/rpc/xdr.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!91 = !{!92, !93, !94}
!92 = !DIEnumerator(name: "XDR_ENCODE", value: 0)
!93 = !DIEnumerator(name: "XDR_DECODE", value: 1)
!94 = !DIEnumerator(name: "XDR_FREE", value: 2)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !96, line: 172, size: 32, align: 32, elements: !97)
!96 = !DIFile(filename: "/usr/include/glib-2.0/glib/gspawn.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106, !107}
!98 = !DIEnumerator(name: "G_SPAWN_DEFAULT", value: 0)
!99 = !DIEnumerator(name: "G_SPAWN_LEAVE_DESCRIPTORS_OPEN", value: 1)
!100 = !DIEnumerator(name: "G_SPAWN_DO_NOT_REAP_CHILD", value: 2)
!101 = !DIEnumerator(name: "G_SPAWN_SEARCH_PATH", value: 4)
!102 = !DIEnumerator(name: "G_SPAWN_STDOUT_TO_DEV_NULL", value: 8)
!103 = !DIEnumerator(name: "G_SPAWN_STDERR_TO_DEV_NULL", value: 16)
!104 = !DIEnumerator(name: "G_SPAWN_CHILD_INHERITS_STDIN", value: 32)
!105 = !DIEnumerator(name: "G_SPAWN_FILE_AND_ARGV_ZERO", value: 64)
!106 = !DIEnumerator(name: "G_SPAWN_SEARCH_PATH_FROM_ENVP", value: 128)
!107 = !DIEnumerator(name: "G_SPAWN_CLOEXEC_PIPES", value: 256)
!108 = !{!109, !110, !112, !222, !293, !317, !305, !318, !321, !195}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "NicInfoV3", file: !4, line: 190, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NicInfoV3", file: !4, line: 176, size: 512, align: 64, elements: !115)
!115 = !{!116, !198, !218, !219, !220, !221}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "nics", scope: !114, file: !4, line: 180, baseType: !117, size: 128, align: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !114, file: !4, line: 177, size: 128, align: 64, elements: !118)
!118 = !{!119, !125}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "nics_len", scope: !117, file: !4, line: 178, baseType: !120, size: 32, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !121, line: 35, baseType: !122)
!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !123, line: 32, baseType: !124)
!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!124 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "nics_val", scope: !117, file: !4, line: 179, baseType: !126, size: 64, align: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestNicV3", file: !4, line: 174, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestNicV3", file: !4, line: 163, size: 448, align: 64, elements: !129)
!129 = !{!130, !131, !160, !180, !187, !197}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "macAddress", scope: !128, file: !4, line: 164, baseType: !110, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ips", scope: !128, file: !4, line: 168, baseType: !132, size: 128, align: 64, offset: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !128, file: !4, line: 165, size: 128, align: 64, elements: !133)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ips_len", scope: !132, file: !4, line: 166, baseType: !120, size: 32, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ips_val", scope: !132, file: !4, line: 167, baseType: !136, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "IpAddressEntry", file: !4, line: 110, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IpAddressEntry", file: !4, line: 104, size: 384, align: 64, elements: !139)
!139 = !{!140, !152, !154, !157}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressAddr", scope: !138, file: !4, line: 105, baseType: !141, size: 192, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "TypedIpAddress", file: !4, line: 102, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TypedIpAddress", file: !4, line: 98, size: 192, align: 64, elements: !143)
!143 = !{!144, !146}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressAddrType", scope: !142, file: !4, line: 99, baseType: !145, size: 32, align: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "InetAddressType", file: !4, line: 73, baseType: !3)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressAddr", scope: !142, file: !4, line: 100, baseType: !147, size: 128, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "InetAddress", file: !4, line: 63, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 60, size: 128, align: 64, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "InetAddress_len", scope: !148, file: !4, line: 61, baseType: !120, size: 32, align: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "InetAddress_val", scope: !148, file: !4, line: 62, baseType: !110, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressPrefixLength", scope: !138, file: !4, line: 106, baseType: !153, size: 32, align: 32, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "InetAddressPrefixLength", file: !4, line: 75, baseType: !120)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressOrigin", scope: !138, file: !4, line: 107, baseType: !155, size: 64, align: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "IpAddressOrigin", file: !4, line: 84, baseType: !12)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressStatus", scope: !138, file: !4, line: 108, baseType: !158, size: 64, align: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "IpAddressStatus", file: !4, line: 96, baseType: !19)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "dnsConfigInfo", scope: !128, file: !4, line: 169, baseType: !161, size: 64, align: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "DnsConfigInfo", file: !4, line: 129, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DnsConfigInfo", file: !4, line: 117, size: 384, align: 64, elements: !164)
!164 = !{!165, !168, !169, !175}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "hostName", scope: !163, file: !4, line: 118, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "DnsHostname", file: !4, line: 113, baseType: !110)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "domainName", scope: !163, file: !4, line: 119, baseType: !166, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "serverList", scope: !163, file: !4, line: 123, baseType: !170, size: 128, align: 64, offset: 128)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !163, file: !4, line: 120, size: 128, align: 64, elements: !171)
!171 = !{!172, !173}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "serverList_len", scope: !170, file: !4, line: 121, baseType: !120, size: 32, align: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "serverList_val", scope: !170, file: !4, line: 122, baseType: !174, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "searchSuffixes", scope: !163, file: !4, line: 127, baseType: !176, size: 128, align: 64, offset: 256)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !163, file: !4, line: 124, size: 128, align: 64, elements: !177)
!177 = !{!178, !179}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "searchSuffixes_len", scope: !176, file: !4, line: 125, baseType: !120, size: 32, align: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "searchSuffixes_val", scope: !176, file: !4, line: 126, baseType: !166, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "winsConfigInfo", scope: !128, file: !4, line: 170, baseType: !181, size: 64, align: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "WinsConfigInfo", file: !4, line: 135, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WinsConfigInfo", file: !4, line: 131, size: 384, align: 64, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "primary", scope: !183, file: !4, line: 132, baseType: !141, size: 192, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !183, file: !4, line: 133, baseType: !141, size: 192, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "dhcpConfigInfov4", scope: !128, file: !4, line: 171, baseType: !188, size: 64, align: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "DhcpConfigInfo", file: !4, line: 161, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DhcpConfigInfo", file: !4, line: 157, size: 128, align: 64, elements: !191)
!191 = !{!192, !196}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !190, file: !4, line: 158, baseType: !193, size: 32, align: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool_t", file: !194, line: 37, baseType: !195)
!194 = !DIFile(filename: "/usr/include/rpc/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!195 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "dhcpSettings", scope: !190, file: !4, line: 159, baseType: !110, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "dhcpConfigInfov6", scope: !128, file: !4, line: 172, baseType: !188, size: 64, align: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "routes", scope: !114, file: !4, line: 184, baseType: !199, size: 128, align: 64, offset: 128)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !114, file: !4, line: 181, size: 128, align: 64, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "routes_len", scope: !199, file: !4, line: 182, baseType: !120, size: 32, align: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "routes_val", scope: !199, file: !4, line: 183, baseType: !203, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "InetCidrRouteEntry", file: !4, line: 154, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InetCidrRouteEntry", file: !4, line: 146, size: 448, align: 64, elements: !206)
!206 = !{!207, !208, !209, !210, !215, !217}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRouteDest", scope: !205, file: !4, line: 147, baseType: !141, size: 192, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRoutePfxLen", scope: !205, file: !4, line: 148, baseType: !153, size: 32, align: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRouteNextHop", scope: !205, file: !4, line: 149, baseType: !174, size: 64, align: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRouteIfIndex", scope: !205, file: !4, line: 150, baseType: !211, size: 32, align: 32, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !212, line: 173, baseType: !213)
!212 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !214, line: 51, baseType: !124)
!214 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!215 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRouteType", scope: !205, file: !4, line: 151, baseType: !216, size: 32, align: 32, offset: 352)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "InetCidrRouteType", file: !4, line: 144, baseType: !29)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRouteMetric", scope: !205, file: !4, line: 152, baseType: !211, size: 32, align: 32, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "dnsConfigInfo", scope: !114, file: !4, line: 185, baseType: !161, size: 64, align: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "winsConfigInfo", scope: !114, file: !4, line: 186, baseType: !181, size: 64, align: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "dhcpConfigInfov4", scope: !114, file: !4, line: 187, baseType: !188, size: 64, align: 64, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "dhcpConfigInfov6", scope: !114, file: !4, line: 188, baseType: !188, size: 64, align: 64, offset: 448)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdrproc_t", file: !90, line: 152, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!193, !226, !109, null}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDR", file: !90, line: 109, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "XDR", file: !90, line: 110, size: 384, align: 64, elements: !229)
!229 = !{!230, !231, !289, !290, !291, !292}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "x_op", scope: !228, file: !90, line: 112, baseType: !89, size: 32, align: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "x_ops", scope: !228, file: !90, line: 136, baseType: !232, size: 64, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdr_ops", file: !90, line: 113, size: 640, align: 64, elements: !234)
!234 = !{!235, !241, !247, !253, !259, !265, !269, !275, !279, !283}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "x_getlong", scope: !233, file: !90, line: 115, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!193, !226, !239}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "x_putlong", scope: !233, file: !90, line: 117, baseType: !242, size: 64, align: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!193, !226, !245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "x_getbytes", scope: !233, file: !90, line: 119, baseType: !248, size: 64, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!193, !226, !251, !120}
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !121, line: 116, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__caddr_t", file: !123, line: 183, baseType: !110)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "x_putbytes", scope: !233, file: !90, line: 121, baseType: !254, size: 64, align: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!193, !226, !257, !120}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "x_getpostn", scope: !233, file: !90, line: 123, baseType: !260, size: 64, align: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!120, !263}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "x_setpostn", scope: !233, file: !90, line: 125, baseType: !266, size: 64, align: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!193, !226, !120}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "x_inline", scope: !233, file: !90, line: 127, baseType: !270, size: 64, align: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !226, !120}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !121, line: 196, baseType: !195)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "x_destroy", scope: !233, file: !90, line: 129, baseType: !276, size: 64, align: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !226}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "x_getint32", scope: !233, file: !90, line: 131, baseType: !280, size: 64, align: 64, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!193, !226, !273}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "x_putint32", scope: !233, file: !90, line: 133, baseType: !284, size: 64, align: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!193, !226, !287}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "x_public", scope: !228, file: !90, line: 137, baseType: !251, size: 64, align: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "x_private", scope: !228, file: !90, line: 138, baseType: !251, size: 64, align: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "x_base", scope: !228, file: !90, line: 139, baseType: !251, size: 64, align: 64, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "x_handy", scope: !228, file: !90, line: 140, baseType: !120, size: 32, align: 32, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestNic", file: !4, line: 42, size: 320, align: 64, elements: !295)
!295 = !{!296, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "macAddress", scope: !294, file: !4, line: 43, baseType: !297, size: 144, align: 8)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 144, align: 8, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 18)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ips", scope: !294, file: !4, line: 47, baseType: !301, size: 128, align: 64, offset: 192)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !294, file: !4, line: 44, size: 128, align: 64, elements: !302)
!302 = !{!303, !304}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ips_len", scope: !301, file: !4, line: 45, baseType: !120, size: 32, align: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ips_val", scope: !301, file: !4, line: 46, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VmIpAddress", file: !4, line: 34, size: 1088, align: 32, elements: !307)
!307 = !{!308, !310, !312, !316}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "addressFamily", scope: !306, file: !4, line: 35, baseType: !309, size: 32, align: 32)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "NicInfoAddrType", file: !4, line: 32, baseType: !85)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "dhcpEnabled", scope: !306, file: !4, line: 36, baseType: !311, size: 8, align: 8, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !212, line: 230, baseType: !111)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddress", scope: !306, file: !4, line: 37, baseType: !313, size: 512, align: 8, offset: 40)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 512, align: 8, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "subnetMask", scope: !306, file: !4, line: 38, baseType: !313, size: 512, align: 8, offset: 552)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !319, line: 50, baseType: !320)
!319 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !319, line: 49, baseType: !195)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !322, line: 155, baseType: !323)
!322 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!318, !326}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !319, line: 77, baseType: !109)
!327 = !{!328, !332, !333, !337, !338, !396, !427, !428, !502, !503, !507, !509}
!328 = distinct !DIGlobalVariable(name: "vm_version", scope: !0, file: !73, line: 73, type: !329, isLocal: false, isDefinition: true, variable: [20 x i8]* @vm_version)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 160, align: 8, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 20)
!332 = distinct !DIGlobalVariable(name: "guestInfoPollInterval", scope: !0, file: !73, line: 129, type: !195, isLocal: false, isDefinition: true, variable: i32* @guestInfoPollInterval)
!333 = distinct !DIGlobalVariable(name: "gGuestInfoLastGatherTime", scope: !0, file: !73, line: 134, type: !334, isLocal: false, isDefinition: true, variable: i64* @gGuestInfoLastGatherTime)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !335, line: 75, baseType: !336)
!335 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !123, line: 139, baseType: !240)
!337 = distinct !DIGlobalVariable(name: "guestInfoStatsInterval", scope: !0, file: !73, line: 141, type: !195, isLocal: false, isDefinition: true, variable: i32* @guestInfoStatsInterval)
!338 = distinct !DIGlobalVariable(name: "regData", scope: !339, file: !73, line: 1877, type: !343, isLocal: true, isDefinition: true, variable: %struct.ToolsPluginData* @ToolsOnLoad.regData)
!339 = distinct !DISubprogram(name: "ToolsOnLoad", scope: !73, file: !73, line: 1875, type: !340, isLocal: false, isDefinition: true, scopeLine: 1876, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!340 = !DISubroutineType(types: !341)
!341 = !{!342, !362}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginData", file: !48, line: 545, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginData", file: !48, line: 501, size: 256, align: 64, elements: !345)
!345 = !{!346, !347, !358, !394}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !344, file: !48, line: 503, baseType: !257, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !344, file: !48, line: 508, baseType: !348, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !350, line: 37, baseType: !351)
!350 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !350, line: 41, size: 128, align: 64, elements: !352)
!352 = !{!353, !356}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !351, file: !350, line: 43, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !319, line: 46, baseType: !111)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !351, file: !350, line: 44, baseType: !357, size: 32, align: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !319, line: 55, baseType: !124)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "errorCb", scope: !344, file: !48, line: 539, baseType: !359, size: 64, align: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!318, !362, !392, !326, !393}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCtx", file: !48, line: 274, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCtx", file: !48, line: 241, size: 576, align: 64, elements: !365)
!365 = !{!366, !368, !371, !372, !373, !377, !382, !387, !388, !389, !391}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !364, file: !48, line: 243, baseType: !367, size: 32, align: 32)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreAPI", file: !48, line: 234, baseType: !47)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !364, file: !48, line: 245, baseType: !369, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "isVMware", scope: !364, file: !48, line: 247, baseType: !318, size: 32, align: 32, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "errorCode", scope: !364, file: !48, line: 249, baseType: !195, size: 32, align: 32, offset: 160)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mainLoop", scope: !364, file: !48, line: 251, baseType: !374, size: 64, align: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !322, line: 56, baseType: !376)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !322, line: 56, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !364, file: !48, line: 253, baseType: !378, size: 64, align: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !380, line: 48, baseType: !381)
!380 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !380, line: 48, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !364, file: !48, line: 255, baseType: !383, size: 64, align: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !385, line: 48, baseType: !386)
!385 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !385, line: 48, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "blockFD", scope: !364, file: !48, line: 261, baseType: !195, size: 32, align: 32, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "uinputFD", scope: !364, file: !48, line: 263, baseType: !195, size: 32, align: 32, offset: 416)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !364, file: !48, line: 265, baseType: !390, size: 64, align: 64, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "serviceObj", scope: !364, file: !48, line: 273, baseType: !326, size: 64, align: 64, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppType", file: !48, line: 360, baseType: !66)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !344, file: !48, line: 544, baseType: !326, size: 64, align: 64, offset: 192)
!395 = !{}
!396 = distinct !DIGlobalVariable(name: "gInfoCache", scope: !0, file: !73, line: 154, type: !397, isLocal: true, isDefinition: true, variable: %struct._GuestInfoCache* @gInfoCache)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestInfoCache", file: !73, line: 121, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GuestInfoCache", file: !73, line: 115, size: 896, align: 64, elements: !399)
!399 = !{!400, !404, !405, !425}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !398, file: !73, line: 117, baseType: !401, size: 704, align: 64)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 704, align: 64, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 11)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "nicInfo", scope: !398, file: !73, line: 118, baseType: !112, size: 64, align: 64, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "diskInfo", scope: !398, file: !73, line: 119, baseType: !406, size: 64, align: 64, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestDiskInfo", file: !52, line: 106, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DiskInfo", file: !52, line: 103, size: 128, align: 64, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "numEntries", scope: !408, file: !52, line: 104, baseType: !124, size: 32, align: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "partitionList", scope: !408, file: !52, line: 105, baseType: !412, size: 64, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPartitionEntry", file: !52, line: 101, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PartitionEntry", file: !52, line: 95, size: 928, align: 8, elements: !415)
!415 = !{!416, !420, !421}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "freeBytes", scope: !414, file: !52, line: 96, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !212, line: 171, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !214, line: 55, baseType: !419)
!419 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "totalBytes", scope: !414, file: !52, line: 97, baseType: !417, size: 64, align: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !414, file: !52, line: 98, baseType: !422, size: 800, align: 8, offset: 128)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 800, align: 8, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 100)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !398, file: !73, line: 120, baseType: !426, size: 32, align: 32, offset: 832)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "NicInfoMethod", file: !73, line: 109, baseType: !72)
!427 = distinct !DIGlobalVariable(name: "gVMResumed", scope: !0, file: !73, line: 162, type: !311, isLocal: true, isDefinition: true, variable: i8* @gVMResumed)
!428 = distinct !DIGlobalVariable(name: "gatherInfoTimeoutSource", scope: !0, file: !73, line: 146, type: !429, isLocal: true, isDefinition: true, variable: %struct._GSource** @gatherInfoTimeoutSource)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !322, line: 64, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !322, line: 171, size: 768, align: 64, elements: !432)
!432 = !{!433, !434, !450, !479, !480, !484, !485, !486, !487, !495, !496, !497, !498}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !431, file: !322, line: 174, baseType: !326, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !431, file: !322, line: 175, baseType: !435, size: 64, align: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !322, line: 77, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !322, line: 196, size: 192, align: 64, elements: !438)
!438 = !{!439, !443, !444}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !437, file: !322, line: 198, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !326}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !437, file: !322, line: 199, baseType: !440, size: 64, align: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !437, file: !322, line: 200, baseType: !445, size: 64, align: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !326, !429, !448, !449}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !431, file: !322, line: 177, baseType: !451, size: 64, align: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !322, line: 130, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !322, line: 214, size: 384, align: 64, elements: !455)
!455 = !{!456, !461, !465, !469, !473, !474}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !454, file: !322, line: 216, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!318, !429, !460}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !454, file: !322, line: 218, baseType: !462, size: 64, align: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!318, !429}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !454, file: !322, line: 219, baseType: !466, size: 64, align: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!318, !429, !321, !326}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !454, file: !322, line: 222, baseType: !470, size: 64, align: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !429}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !454, file: !322, line: 226, baseType: !321, size: 64, align: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !454, file: !322, line: 227, baseType: !475, size: 64, align: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !322, line: 212, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{null}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !431, file: !322, line: 178, baseType: !357, size: 32, align: 32, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !431, file: !322, line: 180, baseType: !481, size: 64, align: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !322, line: 48, baseType: !483)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !322, line: 48, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !431, file: !322, line: 182, baseType: !320, size: 32, align: 32, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !431, file: !322, line: 183, baseType: !357, size: 32, align: 32, offset: 352)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !431, file: !322, line: 184, baseType: !357, size: 32, align: 32, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !431, file: !322, line: 186, baseType: !488, size: 64, align: 64, offset: 448)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !490, line: 37, baseType: !491)
!490 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !490, line: 39, size: 128, align: 64, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !491, file: !490, line: 41, baseType: !326, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !491, file: !490, line: 42, baseType: !488, size: 64, align: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !431, file: !322, line: 188, baseType: !429, size: 64, align: 64, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !431, file: !322, line: 189, baseType: !429, size: 64, align: 64, offset: 576)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !431, file: !322, line: 191, baseType: !110, size: 64, align: 64, offset: 640)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !431, file: !322, line: 193, baseType: !499, size: 64, align: 64, offset: 704)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !322, line: 65, baseType: !501)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !322, line: 65, flags: DIFlagFwdDecl)
!502 = distinct !DIGlobalVariable(name: "gatherStatsTimeoutSource", scope: !0, file: !73, line: 151, type: !429, isLocal: true, isDefinition: true, variable: %struct._GSource** @gatherStatsTimeoutSource)
!503 = distinct !DIGlobalVariable(name: "ifacePrimaryStringCached", scope: !504, file: !73, line: 382, type: !354, isLocal: true, isDefinition: true, variable: i8** @GuestInfoResetNicPrimaryList.ifacePrimaryStringCached)
!504 = distinct !DISubprogram(name: "GuestInfoResetNicPrimaryList", scope: !73, file: !73, line: 380, type: !505, isLocal: true, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!505 = !DISubroutineType(types: !506)
!506 = !{!311, !362}
!507 = distinct !DIGlobalVariable(name: "ifaceLowPriorityStringCached", scope: !508, file: !73, line: 412, type: !354, isLocal: true, isDefinition: true, variable: i8** @GuestInfoResetNicLowPriorityList.ifaceLowPriorityStringCached)
!508 = distinct !DISubprogram(name: "GuestInfoResetNicLowPriorityList", scope: !73, file: !73, line: 410, type: !505, isLocal: true, isDefinition: true, scopeLine: 411, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!509 = distinct !DIGlobalVariable(name: "ifaceExcludeStringCached", scope: !510, file: !73, line: 442, type: !354, isLocal: true, isDefinition: true, variable: i8** @GuestInfoResetNicExcludeList.ifaceExcludeStringCached)
!510 = distinct !DISubprogram(name: "GuestInfoResetNicExcludeList", scope: !73, file: !73, line: 440, type: !505, isLocal: true, isDefinition: true, scopeLine: 441, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!511 = !{i32 2, !"Dwarf Version", i32 4}
!512 = !{i32 2, !"Debug Info Version", i32 3}
!513 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!514 = distinct !DISubprogram(name: "GuestInfoConvertNicInfoToNicInfoV1", scope: !73, file: !73, line: 643, type: !515, isLocal: false, isDefinition: true, scopeLine: 645, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !112, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestNicInfoV1", file: !52, line: 91, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestNicInfoV1", file: !52, line: 88, size: 19488, align: 32, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "numNicEntries", scope: !519, file: !52, line: 89, baseType: !124, size: 32, align: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "nicList", scope: !519, file: !52, line: 90, baseType: !523, size: 19456, align: 32, offset: 32)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 19456, align: 32, elements: !537)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "NicEntryV1", file: !52, line: 86, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NicEntryV1", file: !52, line: 82, size: 1216, align: 32, elements: !526)
!526 = !{!527, !528, !532}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "numIPs", scope: !525, file: !52, line: 83, baseType: !124, size: 32, align: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "macAddress", scope: !525, file: !52, line: 84, baseType: !529, size: 152, align: 8, offset: 32)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 152, align: 8, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 19)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddress", scope: !525, file: !52, line: 85, baseType: !533, size: 1024, align: 8, offset: 184)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 1024, align: 8, elements: !534)
!534 = !{!535, !536}
!535 = !DISubrange(count: 8)
!536 = !DISubrange(count: 16)
!537 = !{!536}
!538 = !DILocalVariable(name: "info", arg: 1, scope: !514, file: !73, line: 643, type: !112)
!539 = !DIExpression()
!540 = !DILocation(line: 643, column: 47, scope: !514)
!541 = !DILocalVariable(name: "infoV1", arg: 2, scope: !514, file: !73, line: 644, type: !517)
!542 = !DILocation(line: 644, column: 52, scope: !514)
!543 = !DILocalVariable(name: "maxNics", scope: !514, file: !73, line: 646, type: !211)
!544 = !DILocation(line: 646, column: 11, scope: !514)
!545 = !DILocalVariable(name: "i", scope: !514, file: !73, line: 647, type: !120)
!546 = !DILocation(line: 647, column: 10, scope: !514)
!547 = !DILocation(line: 652, column: 17, scope: !514)
!548 = !DILocation(line: 652, column: 23, scope: !514)
!549 = !DILocation(line: 652, column: 28, scope: !514)
!550 = !DILocation(line: 652, column: 38, scope: !514)
!551 = !DILocation(line: 652, column: 15, scope: !514)
!552 = !DILocation(line: 652, column: 49, scope: !553)
!553 = !DILexicalBlockFile(scope: !514, file: !73, discriminator: 1)
!554 = !DILocation(line: 652, column: 55, scope: !553)
!555 = !DILocation(line: 652, column: 60, scope: !553)
!556 = !DILocation(line: 652, column: 15, scope: !553)
!557 = !DILocation(line: 652, column: 15, scope: !558)
!558 = !DILexicalBlockFile(scope: !514, file: !73, discriminator: 2)
!559 = !DILocation(line: 652, column: 15, scope: !560)
!560 = !DILexicalBlockFile(scope: !514, file: !73, discriminator: 3)
!561 = !DILocation(line: 652, column: 12, scope: !560)
!562 = !DILocation(line: 653, column: 28, scope: !514)
!563 = !DILocation(line: 653, column: 4, scope: !514)
!564 = !DILocation(line: 653, column: 12, scope: !514)
!565 = !DILocation(line: 653, column: 26, scope: !514)
!566 = !DILocation(line: 654, column: 8, scope: !567)
!567 = distinct !DILexicalBlock(scope: !514, file: !73, line: 654, column: 8)
!568 = !DILocation(line: 654, column: 18, scope: !567)
!569 = !DILocation(line: 654, column: 24, scope: !567)
!570 = !DILocation(line: 654, column: 29, scope: !567)
!571 = !DILocation(line: 654, column: 16, scope: !567)
!572 = !DILocation(line: 654, column: 8, scope: !514)
!573 = !DILocation(line: 655, column: 7, scope: !574)
!574 = distinct !DILexicalBlock(scope: !567, file: !73, line: 654, column: 39)
!575 = !DILocation(line: 656, column: 4, scope: !574)
!576 = !DILocation(line: 658, column: 13, scope: !577)
!577 = distinct !DILexicalBlock(scope: !514, file: !73, line: 658, column: 4)
!578 = !DILocation(line: 658, column: 9, scope: !577)
!579 = !DILocation(line: 658, column: 19, scope: !580)
!580 = !DILexicalBlockFile(scope: !581, file: !73, discriminator: 1)
!581 = distinct !DILexicalBlock(scope: !577, file: !73, line: 658, column: 4)
!582 = !DILocation(line: 658, column: 26, scope: !580)
!583 = !DILocation(line: 658, column: 33, scope: !580)
!584 = !DILocation(line: 658, column: 38, scope: !580)
!585 = !DILocation(line: 658, column: 22, scope: !580)
!586 = !DILocation(line: 658, column: 4, scope: !580)
!587 = !DILocalVariable(name: "j", scope: !588, file: !73, line: 659, type: !120)
!588 = distinct !DILexicalBlock(scope: !581, file: !73, line: 658, column: 56)
!589 = !DILocation(line: 659, column: 13, scope: !588)
!590 = !DILocalVariable(name: "maxIPs", scope: !588, file: !73, line: 660, type: !211)
!591 = !DILocation(line: 660, column: 14, scope: !588)
!592 = !DILocalVariable(name: "nic", scope: !588, file: !73, line: 661, type: !126)
!593 = !DILocation(line: 661, column: 19, scope: !588)
!594 = !DILocation(line: 661, column: 49, scope: !588)
!595 = !DILocation(line: 661, column: 27, scope: !588)
!596 = !DILocation(line: 661, column: 28, scope: !588)
!597 = !DILocation(line: 661, column: 35, scope: !588)
!598 = !DILocation(line: 661, column: 40, scope: !588)
!599 = !DILocation(line: 663, column: 34, scope: !588)
!600 = !DILocation(line: 663, column: 18, scope: !588)
!601 = !DILocation(line: 663, column: 26, scope: !588)
!602 = !DILocation(line: 663, column: 37, scope: !588)
!603 = !DILocation(line: 664, column: 18, scope: !588)
!604 = !DILocation(line: 664, column: 23, scope: !588)
!605 = !DILocation(line: 663, column: 7, scope: !588)
!606 = !DILocation(line: 667, column: 19, scope: !588)
!607 = !DILocation(line: 667, column: 24, scope: !588)
!608 = !DILocation(line: 667, column: 28, scope: !588)
!609 = !DILocation(line: 667, column: 37, scope: !588)
!610 = !DILocation(line: 667, column: 17, scope: !588)
!611 = !DILocation(line: 667, column: 47, scope: !612)
!612 = !DILexicalBlockFile(scope: !588, file: !73, discriminator: 1)
!613 = !DILocation(line: 667, column: 52, scope: !612)
!614 = !DILocation(line: 667, column: 56, scope: !612)
!615 = !DILocation(line: 667, column: 17, scope: !612)
!616 = !DILocation(line: 667, column: 17, scope: !617)
!617 = !DILexicalBlockFile(scope: !588, file: !73, discriminator: 2)
!618 = !DILocation(line: 667, column: 17, scope: !619)
!619 = !DILexicalBlockFile(scope: !588, file: !73, discriminator: 3)
!620 = !DILocation(line: 667, column: 14, scope: !619)
!621 = !DILocation(line: 668, column: 23, scope: !588)
!622 = !DILocation(line: 668, column: 7, scope: !588)
!623 = !DILocation(line: 668, column: 15, scope: !588)
!624 = !DILocation(line: 668, column: 26, scope: !588)
!625 = !DILocation(line: 668, column: 33, scope: !588)
!626 = !DILocation(line: 670, column: 16, scope: !627)
!627 = distinct !DILexicalBlock(scope: !588, file: !73, line: 670, column: 7)
!628 = !DILocation(line: 670, column: 12, scope: !627)
!629 = !DILocation(line: 670, column: 22, scope: !630)
!630 = !DILexicalBlockFile(scope: !631, file: !73, discriminator: 1)
!631 = distinct !DILexicalBlock(scope: !627, file: !73, line: 670, column: 7)
!632 = !DILocation(line: 670, column: 29, scope: !630)
!633 = !DILocation(line: 670, column: 35, scope: !630)
!634 = !DILocation(line: 670, column: 39, scope: !630)
!635 = !DILocation(line: 670, column: 25, scope: !630)
!636 = !DILocation(line: 670, column: 7, scope: !630)
!637 = !DILocalVariable(name: "ip", scope: !638, file: !73, line: 671, type: !136)
!638 = distinct !DILexicalBlock(scope: !631, file: !73, line: 670, column: 56)
!639 = !DILocation(line: 671, column: 26, scope: !638)
!640 = !DILocation(line: 671, column: 52, scope: !638)
!641 = !DILocation(line: 671, column: 33, scope: !638)
!642 = !DILocation(line: 671, column: 34, scope: !638)
!643 = !DILocation(line: 671, column: 40, scope: !638)
!644 = !DILocation(line: 671, column: 44, scope: !638)
!645 = !DILocalVariable(name: "typedIp", scope: !638, file: !73, line: 672, type: !174)
!646 = !DILocation(line: 672, column: 26, scope: !638)
!647 = !DILocation(line: 672, column: 37, scope: !638)
!648 = !DILocation(line: 672, column: 41, scope: !638)
!649 = !DILocation(line: 674, column: 14, scope: !650)
!650 = distinct !DILexicalBlock(scope: !638, file: !73, line: 674, column: 14)
!651 = !DILocation(line: 674, column: 23, scope: !650)
!652 = !DILocation(line: 674, column: 41, scope: !650)
!653 = !DILocation(line: 674, column: 14, scope: !638)
!654 = !DILocation(line: 675, column: 13, scope: !655)
!655 = distinct !DILexicalBlock(scope: !650, file: !73, line: 674, column: 54)
!656 = !DILocation(line: 678, column: 39, scope: !657)
!657 = distinct !DILexicalBlock(scope: !638, file: !73, line: 678, column: 14)
!658 = !DILocation(line: 678, column: 48, scope: !657)
!659 = !DILocation(line: 678, column: 62, scope: !657)
!660 = !DILocation(line: 679, column: 60, scope: !657)
!661 = !DILocation(line: 679, column: 31, scope: !657)
!662 = !DILocation(line: 679, column: 47, scope: !657)
!663 = !DILocation(line: 679, column: 39, scope: !657)
!664 = !DILocation(line: 679, column: 50, scope: !657)
!665 = !DILocation(line: 678, column: 14, scope: !657)
!666 = !DILocation(line: 678, column: 14, scope: !638)
!667 = !DILocation(line: 681, column: 29, scope: !668)
!668 = distinct !DILexicalBlock(scope: !657, file: !73, line: 680, column: 72)
!669 = !DILocation(line: 681, column: 13, scope: !668)
!670 = !DILocation(line: 681, column: 21, scope: !668)
!671 = !DILocation(line: 681, column: 32, scope: !668)
!672 = !DILocation(line: 681, column: 38, scope: !668)
!673 = !DILocation(line: 682, column: 33, scope: !674)
!674 = distinct !DILexicalBlock(scope: !668, file: !73, line: 682, column: 17)
!675 = !DILocation(line: 682, column: 17, scope: !674)
!676 = !DILocation(line: 682, column: 25, scope: !674)
!677 = !DILocation(line: 682, column: 36, scope: !674)
!678 = !DILocation(line: 682, column: 46, scope: !674)
!679 = !DILocation(line: 682, column: 43, scope: !674)
!680 = !DILocation(line: 682, column: 17, scope: !668)
!681 = !DILocation(line: 683, column: 16, scope: !682)
!682 = distinct !DILexicalBlock(scope: !674, file: !73, line: 682, column: 54)
!683 = !DILocation(line: 685, column: 10, scope: !668)
!684 = !DILocation(line: 686, column: 7, scope: !638)
!685 = !DILocation(line: 670, column: 52, scope: !686)
!686 = !DILexicalBlockFile(scope: !631, file: !73, discriminator: 2)
!687 = !DILocation(line: 670, column: 7, scope: !686)
!688 = distinct !{!688, !689}
!689 = !DILocation(line: 670, column: 7, scope: !588)
!690 = !DILocation(line: 688, column: 27, scope: !691)
!691 = distinct !DILexicalBlock(scope: !588, file: !73, line: 688, column: 11)
!692 = !DILocation(line: 688, column: 11, scope: !691)
!693 = !DILocation(line: 688, column: 19, scope: !691)
!694 = !DILocation(line: 688, column: 30, scope: !691)
!695 = !DILocation(line: 688, column: 40, scope: !691)
!696 = !DILocation(line: 688, column: 45, scope: !691)
!697 = !DILocation(line: 688, column: 49, scope: !691)
!698 = !DILocation(line: 688, column: 37, scope: !691)
!699 = !DILocation(line: 688, column: 11, scope: !588)
!700 = !DILocation(line: 689, column: 10, scope: !701)
!701 = distinct !DILexicalBlock(scope: !691, file: !73, line: 688, column: 58)
!702 = !DILocation(line: 690, column: 7, scope: !701)
!703 = !DILocation(line: 691, column: 11, scope: !704)
!704 = distinct !DILexicalBlock(scope: !588, file: !73, line: 691, column: 11)
!705 = !DILocation(line: 691, column: 16, scope: !704)
!706 = !DILocation(line: 691, column: 13, scope: !704)
!707 = !DILocation(line: 691, column: 11, scope: !588)
!708 = !DILocation(line: 692, column: 10, scope: !709)
!709 = distinct !DILexicalBlock(scope: !704, file: !73, line: 691, column: 25)
!710 = !DILocation(line: 694, column: 4, scope: !588)
!711 = !DILocation(line: 658, column: 52, scope: !712)
!712 = !DILexicalBlockFile(scope: !581, file: !73, discriminator: 2)
!713 = !DILocation(line: 658, column: 4, scope: !712)
!714 = distinct !{!714, !715}
!715 = !DILocation(line: 658, column: 4, scope: !514)
!716 = !DILocation(line: 695, column: 1, scope: !514)
!717 = distinct !DISubprogram(name: "GuestInfoFindMacAddress", scope: !73, file: !73, line: 1293, type: !718, isLocal: false, isDefinition: true, scopeLine: 1295, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!718 = !DISubroutineType(types: !719)
!719 = !{!126, !112, !257}
!720 = !DILocalVariable(name: "nicInfo", arg: 1, scope: !717, file: !73, line: 1293, type: !112)
!721 = !DILocation(line: 1293, column: 36, scope: !717)
!722 = !DILocalVariable(name: "macAddress", arg: 2, scope: !717, file: !73, line: 1294, type: !257)
!723 = !DILocation(line: 1294, column: 37, scope: !717)
!724 = !DILocalVariable(name: "i", scope: !717, file: !73, line: 1296, type: !120)
!725 = !DILocation(line: 1296, column: 10, scope: !717)
!726 = !DILocation(line: 1298, column: 11, scope: !727)
!727 = distinct !DILexicalBlock(scope: !717, file: !73, line: 1298, column: 4)
!728 = !DILocation(line: 1298, column: 9, scope: !727)
!729 = !DILocation(line: 1298, column: 16, scope: !730)
!730 = !DILexicalBlockFile(scope: !731, file: !73, discriminator: 1)
!731 = distinct !DILexicalBlock(scope: !727, file: !73, line: 1298, column: 4)
!732 = !DILocation(line: 1298, column: 20, scope: !730)
!733 = !DILocation(line: 1298, column: 29, scope: !730)
!734 = !DILocation(line: 1298, column: 34, scope: !730)
!735 = !DILocation(line: 1298, column: 18, scope: !730)
!736 = !DILocation(line: 1298, column: 4, scope: !730)
!737 = !DILocalVariable(name: "nic", scope: !738, file: !73, line: 1299, type: !126)
!738 = distinct !DILexicalBlock(scope: !731, file: !73, line: 1298, column: 49)
!739 = !DILocation(line: 1299, column: 19, scope: !738)
!740 = !DILocation(line: 1299, column: 49, scope: !738)
!741 = !DILocation(line: 1299, column: 26, scope: !738)
!742 = !DILocation(line: 1299, column: 35, scope: !738)
!743 = !DILocation(line: 1299, column: 40, scope: !738)
!744 = !DILocation(line: 1300, column: 19, scope: !745)
!745 = distinct !DILexicalBlock(scope: !738, file: !73, line: 1300, column: 11)
!746 = !DILocation(line: 1300, column: 24, scope: !745)
!747 = !DILocation(line: 1300, column: 36, scope: !745)
!748 = !DILocation(line: 1300, column: 11, scope: !745)
!749 = !DILocation(line: 1300, column: 52, scope: !745)
!750 = !DILocation(line: 1300, column: 11, scope: !738)
!751 = !DILocation(line: 1301, column: 17, scope: !752)
!752 = distinct !DILexicalBlock(scope: !745, file: !73, line: 1300, column: 58)
!753 = !DILocation(line: 1301, column: 10, scope: !752)
!754 = !DILocation(line: 1303, column: 4, scope: !738)
!755 = !DILocation(line: 1298, column: 45, scope: !756)
!756 = !DILexicalBlockFile(scope: !731, file: !73, discriminator: 2)
!757 = !DILocation(line: 1298, column: 4, scope: !756)
!758 = distinct !{!758, !759}
!759 = !DILocation(line: 1298, column: 4, scope: !717)
!760 = !DILocation(line: 1305, column: 4, scope: !717)
!761 = !DILocation(line: 1306, column: 1, scope: !717)
!762 = distinct !DISubprogram(name: "GuestInfo_ServerReportStats", scope: !73, file: !73, line: 1644, type: !763, isLocal: false, isDefinition: true, scopeLine: 1647, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!763 = !DISubroutineType(types: !764)
!764 = !{!311, !362, !765}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "DynBuf", file: !767, line: 40, baseType: !768)
!767 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dynbuf.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynBuf", file: !767, line: 36, size: 192, align: 64, elements: !769)
!769 = !{!770, !771, !774}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !768, file: !767, line: 37, baseType: !110, size: 64, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !768, file: !767, line: 38, baseType: !772, size: 64, align: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !773, line: 216, baseType: !419)
!773 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1422")
!774 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !768, file: !767, line: 39, baseType: !772, size: 64, align: 64, offset: 128)
!775 = !DILocalVariable(name: "ctx", arg: 1, scope: !762, file: !73, line: 1645, type: !362)
!776 = !DILocation(line: 1645, column: 17, scope: !762)
!777 = !DILocalVariable(name: "stats", arg: 2, scope: !762, file: !73, line: 1646, type: !765)
!778 = !DILocation(line: 1646, column: 12, scope: !762)
!779 = !DILocation(line: 1648, column: 31, scope: !762)
!780 = !DILocation(line: 1650, column: 42, scope: !762)
!781 = !DILocation(line: 1650, column: 31, scope: !762)
!782 = !DILocation(line: 1651, column: 46, scope: !762)
!783 = !DILocation(line: 1651, column: 31, scope: !762)
!784 = !DILocation(line: 1648, column: 11, scope: !762)
!785 = !DILocation(line: 1648, column: 4, scope: !762)
!786 = distinct !DISubprogram(name: "GuestInfoUpdateVmdb", scope: !73, file: !73, line: 1046, type: !787, isLocal: true, isDefinition: true, scopeLine: 1050, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!787 = !DISubroutineType(types: !788)
!788 = !{!311, !362, !789, !109, !772}
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestInfoType", file: !52, line: 75, baseType: !51)
!790 = !DILocalVariable(name: "ctx", arg: 1, scope: !786, file: !73, line: 1046, type: !362)
!791 = !DILocation(line: 1046, column: 34, scope: !786)
!792 = !DILocalVariable(name: "infoType", arg: 2, scope: !786, file: !73, line: 1047, type: !789)
!793 = !DILocation(line: 1047, column: 35, scope: !786)
!794 = !DILocalVariable(name: "info", arg: 3, scope: !786, file: !73, line: 1048, type: !109)
!795 = !DILocation(line: 1048, column: 27, scope: !786)
!796 = !DILocalVariable(name: "infoSize", arg: 4, scope: !786, file: !73, line: 1049, type: !772)
!797 = !DILocation(line: 1049, column: 28, scope: !786)
!798 = !DILocation(line: 1052, column: 73, scope: !786)
!799 = !DILocation(line: 1052, column: 4, scope: !786)
!800 = !DILocation(line: 1054, column: 8, scope: !801)
!801 = distinct !DILexicalBlock(scope: !786, file: !73, line: 1054, column: 8)
!802 = !DILocation(line: 1054, column: 8, scope: !786)
!803 = !DILocation(line: 1055, column: 18, scope: !804)
!804 = distinct !DILexicalBlock(scope: !801, file: !73, line: 1054, column: 20)
!805 = !DILocation(line: 1056, column: 7, scope: !804)
!806 = !DILocation(line: 1057, column: 4, scope: !804)
!807 = !DILocation(line: 1059, column: 12, scope: !786)
!808 = !DILocation(line: 1059, column: 4, scope: !786)
!809 = !DILocation(line: 1070, column: 28, scope: !810)
!810 = distinct !DILexicalBlock(scope: !811, file: !73, line: 1070, column: 11)
!811 = distinct !DILexicalBlock(scope: !786, file: !73, line: 1059, column: 22)
!812 = !DILocation(line: 1070, column: 11, scope: !810)
!813 = !DILocation(line: 1070, column: 38, scope: !810)
!814 = !DILocation(line: 1070, column: 45, scope: !810)
!815 = !DILocation(line: 1071, column: 35, scope: !810)
!816 = !DILocation(line: 1071, column: 18, scope: !810)
!817 = !DILocation(line: 1071, column: 54, scope: !810)
!818 = !DILocation(line: 1071, column: 11, scope: !810)
!819 = !DILocation(line: 1071, column: 60, scope: !810)
!820 = !DILocation(line: 1070, column: 11, scope: !821)
!821 = !DILexicalBlockFile(scope: !811, file: !73, discriminator: 1)
!822 = !DILocation(line: 1073, column: 87, scope: !823)
!823 = distinct !DILexicalBlock(scope: !810, file: !73, line: 1071, column: 66)
!824 = !DILocation(line: 1073, column: 10, scope: !823)
!825 = !DILocation(line: 1074, column: 10, scope: !823)
!826 = !DILocation(line: 1077, column: 25, scope: !827)
!827 = distinct !DILexicalBlock(scope: !811, file: !73, line: 1077, column: 11)
!828 = !DILocation(line: 1077, column: 30, scope: !827)
!829 = !DILocation(line: 1077, column: 48, scope: !827)
!830 = !DILocation(line: 1077, column: 12, scope: !827)
!831 = !DILocation(line: 1077, column: 11, scope: !811)
!832 = !DILocation(line: 1078, column: 101, scope: !833)
!833 = distinct !DILexicalBlock(scope: !827, file: !73, line: 1077, column: 55)
!834 = !DILocation(line: 1078, column: 10, scope: !833)
!835 = !DILocation(line: 1079, column: 10, scope: !833)
!836 = !DILocation(line: 1083, column: 29, scope: !811)
!837 = !DILocation(line: 1083, column: 12, scope: !811)
!838 = !DILocation(line: 1083, column: 7, scope: !811)
!839 = !DILocation(line: 1084, column: 62, scope: !811)
!840 = !DILocation(line: 1084, column: 36, scope: !811)
!841 = !DILocation(line: 1084, column: 24, scope: !811)
!842 = !DILocation(line: 1084, column: 7, scope: !811)
!843 = !DILocation(line: 1084, column: 34, scope: !811)
!844 = !DILocation(line: 1085, column: 7, scope: !811)
!845 = !DILocation(line: 1089, column: 36, scope: !846)
!846 = distinct !DILexicalBlock(scope: !847, file: !73, line: 1089, column: 14)
!847 = distinct !DILexicalBlock(scope: !811, file: !73, line: 1088, column: 7)
!848 = !DILocation(line: 1089, column: 55, scope: !846)
!849 = !DILocation(line: 1089, column: 41, scope: !846)
!850 = !DILocation(line: 1089, column: 15, scope: !846)
!851 = !DILocation(line: 1089, column: 14, scope: !847)
!852 = !DILocation(line: 1090, column: 13, scope: !853)
!853 = distinct !DILexicalBlock(scope: !846, file: !73, line: 1089, column: 62)
!854 = !DILocation(line: 1091, column: 13, scope: !853)
!855 = !DILocation(line: 1093, column: 10, scope: !847)
!856 = !DILocation(line: 1098, column: 39, scope: !857)
!857 = distinct !DILexicalBlock(scope: !858, file: !73, line: 1098, column: 14)
!858 = distinct !DILexicalBlock(scope: !811, file: !73, line: 1097, column: 7)
!859 = !DILocation(line: 1098, column: 44, scope: !857)
!860 = !DILocation(line: 1098, column: 54, scope: !857)
!861 = !DILocation(line: 1098, column: 15, scope: !857)
!862 = !DILocation(line: 1098, column: 14, scope: !858)
!863 = !DILocation(line: 1099, column: 13, scope: !864)
!864 = distinct !DILexicalBlock(scope: !857, file: !73, line: 1098, column: 61)
!865 = !DILocation(line: 1100, column: 13, scope: !864)
!866 = !DILocation(line: 1102, column: 10, scope: !858)
!867 = !DILocalVariable(name: "requestSize", scope: !868, file: !73, line: 1111, type: !124)
!868 = distinct !DILexicalBlock(scope: !811, file: !73, line: 1106, column: 7)
!869 = !DILocation(line: 1111, column: 23, scope: !868)
!870 = !DILocalVariable(name: "partitionCount", scope: !868, file: !73, line: 1113, type: !871)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !212, line: 177, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !214, line: 48, baseType: !873)
!873 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!874 = !DILocation(line: 1113, column: 16, scope: !868)
!875 = !DILocalVariable(name: "offset", scope: !868, file: !73, line: 1114, type: !772)
!876 = !DILocation(line: 1114, column: 17, scope: !868)
!877 = !DILocalVariable(name: "request", scope: !868, file: !73, line: 1115, type: !110)
!878 = !DILocation(line: 1115, column: 16, scope: !868)
!879 = !DILocalVariable(name: "reply", scope: !868, file: !73, line: 1116, type: !110)
!880 = !DILocation(line: 1116, column: 16, scope: !868)
!881 = !DILocalVariable(name: "replyLen", scope: !868, file: !73, line: 1117, type: !772)
!882 = !DILocation(line: 1117, column: 17, scope: !868)
!883 = !DILocalVariable(name: "status", scope: !868, file: !73, line: 1118, type: !311)
!884 = !DILocation(line: 1118, column: 15, scope: !868)
!885 = !DILocalVariable(name: "pdi", scope: !868, file: !73, line: 1119, type: !406)
!886 = !DILocation(line: 1119, column: 25, scope: !868)
!887 = !DILocation(line: 1119, column: 31, scope: !868)
!888 = !DILocation(line: 1121, column: 31, scope: !889)
!889 = distinct !DILexicalBlock(scope: !868, file: !73, line: 1121, column: 14)
!890 = !DILocation(line: 1121, column: 15, scope: !889)
!891 = !DILocation(line: 1121, column: 14, scope: !868)
!892 = !DILocation(line: 1122, column: 13, scope: !893)
!893 = distinct !DILexicalBlock(scope: !889, file: !73, line: 1121, column: 37)
!894 = !DILocation(line: 1123, column: 13, scope: !893)
!895 = !DILocation(line: 1130, column: 14, scope: !896)
!896 = distinct !DILexicalBlock(scope: !868, file: !73, line: 1130, column: 14)
!897 = !DILocation(line: 1130, column: 19, scope: !896)
!898 = !DILocation(line: 1130, column: 30, scope: !896)
!899 = !DILocation(line: 1130, column: 14, scope: !868)
!900 = !DILocation(line: 1131, column: 135, scope: !901)
!901 = distinct !DILexicalBlock(scope: !896, file: !73, line: 1130, column: 42)
!902 = !DILocation(line: 1131, column: 140, scope: !901)
!903 = !DILocation(line: 1131, column: 13, scope: !901)
!904 = !DILocation(line: 1133, column: 28, scope: !901)
!905 = !DILocation(line: 1134, column: 10, scope: !901)
!906 = !DILocation(line: 1135, column: 30, scope: !907)
!907 = distinct !DILexicalBlock(scope: !896, file: !73, line: 1134, column: 17)
!908 = !DILocation(line: 1135, column: 35, scope: !907)
!909 = !DILocation(line: 1135, column: 28, scope: !907)
!910 = !DILocation(line: 1139, column: 54, scope: !868)
!911 = !DILocation(line: 1139, column: 52, scope: !868)
!912 = !DILocation(line: 1138, column: 47, scope: !868)
!913 = !DILocation(line: 1138, column: 22, scope: !868)
!914 = !DILocation(line: 1140, column: 37, scope: !868)
!915 = !DILocation(line: 1140, column: 36, scope: !868)
!916 = !DILocation(line: 1140, column: 20, scope: !868)
!917 = !DILocation(line: 1140, column: 18, scope: !868)
!918 = !DILocation(line: 1142, column: 22, scope: !868)
!919 = !DILocation(line: 1142, column: 31, scope: !868)
!920 = !DILocation(line: 1142, column: 10, scope: !868)
!921 = !DILocation(line: 1145, column: 26, scope: !868)
!922 = !DILocation(line: 1145, column: 19, scope: !868)
!923 = !DILocation(line: 1145, column: 17, scope: !868)
!924 = !DILocation(line: 1157, column: 17, scope: !868)
!925 = !DILocation(line: 1157, column: 27, scope: !868)
!926 = !DILocation(line: 1157, column: 25, scope: !868)
!927 = !DILocation(line: 1157, column: 10, scope: !868)
!928 = !DILocation(line: 1163, column: 14, scope: !929)
!929 = distinct !DILexicalBlock(scope: !868, file: !73, line: 1163, column: 14)
!930 = !DILocation(line: 1163, column: 19, scope: !929)
!931 = !DILocation(line: 1163, column: 14, scope: !868)
!932 = !DILocation(line: 1164, column: 20, scope: !933)
!933 = distinct !DILexicalBlock(scope: !929, file: !73, line: 1163, column: 34)
!934 = !DILocation(line: 1164, column: 30, scope: !933)
!935 = !DILocation(line: 1164, column: 28, scope: !933)
!936 = !DILocation(line: 1164, column: 37, scope: !933)
!937 = !DILocation(line: 1164, column: 62, scope: !933)
!938 = !DILocation(line: 1164, column: 67, scope: !933)
!939 = !DILocation(line: 1164, column: 13, scope: !933)
!940 = !DILocation(line: 1165, column: 49, scope: !933)
!941 = !DILocation(line: 1165, column: 47, scope: !933)
!942 = !DILocation(line: 1166, column: 10, scope: !933)
!943 = !DILocation(line: 1168, column: 75, scope: !868)
!944 = !DILocation(line: 1168, column: 10, scope: !868)
!945 = !DILocation(line: 1169, column: 35, scope: !868)
!946 = !DILocation(line: 1169, column: 40, scope: !868)
!947 = !DILocation(line: 1169, column: 45, scope: !868)
!948 = !DILocation(line: 1169, column: 54, scope: !868)
!949 = !DILocation(line: 1169, column: 19, scope: !868)
!950 = !DILocation(line: 1169, column: 17, scope: !868)
!951 = !DILocation(line: 1171, column: 14, scope: !952)
!952 = distinct !DILexicalBlock(scope: !868, file: !73, line: 1171, column: 14)
!953 = !DILocation(line: 1171, column: 14, scope: !868)
!954 = !DILocation(line: 1172, column: 24, scope: !955)
!955 = distinct !DILexicalBlock(scope: !952, file: !73, line: 1171, column: 22)
!956 = !DILocation(line: 1172, column: 23, scope: !955)
!957 = !DILocation(line: 1172, column: 30, scope: !955)
!958 = !DILocation(line: 1172, column: 22, scope: !955)
!959 = !DILocation(line: 1172, column: 20, scope: !955)
!960 = !DILocation(line: 1173, column: 10, scope: !955)
!961 = !DILocation(line: 1175, column: 18, scope: !868)
!962 = !DILocation(line: 1175, column: 10, scope: !868)
!963 = !DILocation(line: 1176, column: 18, scope: !868)
!964 = !DILocation(line: 1176, column: 10, scope: !868)
!965 = !DILocation(line: 1178, column: 15, scope: !966)
!966 = distinct !DILexicalBlock(scope: !868, file: !73, line: 1178, column: 14)
!967 = !DILocation(line: 1178, column: 14, scope: !868)
!968 = !DILocation(line: 1179, column: 13, scope: !969)
!969 = distinct !DILexicalBlock(scope: !966, file: !73, line: 1178, column: 23)
!970 = !DILocation(line: 1180, column: 13, scope: !969)
!971 = !DILocation(line: 1183, column: 10, scope: !868)
!972 = !DILocation(line: 1185, column: 10, scope: !868)
!973 = !DILocation(line: 1188, column: 7, scope: !811)
!974 = distinct !{!974, !973}
!975 = !DILocation(line: 1188, column: 78, scope: !976)
!976 = !DILexicalBlockFile(scope: !977, file: !73, discriminator: 1)
!977 = distinct !DILexicalBlock(scope: !811, file: !73, line: 1188, column: 10)
!978 = !DILocation(line: 1188, column: 12, scope: !976)
!979 = !DILocation(line: 1188, column: 89, scope: !976)
!980 = !DILocation(line: 1188, column: 89, scope: !981)
!981 = !DILexicalBlockFile(scope: !982, file: !73, discriminator: 2)
!982 = distinct !DILexicalBlock(scope: !983, file: !73, line: 1188, column: 89)
!983 = distinct !DILexicalBlock(scope: !977, file: !73, line: 1188, column: 89)
!984 = distinct !{!984, !985}
!985 = !DILocation(line: 1188, column: 89, scope: !977)
!986 = !DILocation(line: 1189, column: 7, scope: !811)
!987 = !DILocation(line: 1192, column: 95, scope: !786)
!988 = !DILocation(line: 1192, column: 4, scope: !786)
!989 = !DILocation(line: 1193, column: 4, scope: !786)
!990 = !DILocation(line: 1194, column: 1, scope: !786)
!991 = distinct !DISubprogram(name: "DynBuf_Get", scope: !767, file: !767, line: 113, type: !992, isLocal: true, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!992 = !DISubroutineType(types: !993)
!993 = !{!109, !994}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !766)
!996 = !DILocalVariable(name: "b", arg: 1, scope: !991, file: !767, line: 113, type: !994)
!997 = !DILocation(line: 113, column: 26, scope: !991)
!998 = !DILocation(line: 117, column: 11, scope: !991)
!999 = !DILocation(line: 117, column: 14, scope: !991)
!1000 = !DILocation(line: 117, column: 4, scope: !991)
!1001 = distinct !DISubprogram(name: "DynBuf_GetSize", scope: !767, file: !767, line: 174, type: !1002, isLocal: true, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!772, !994}
!1004 = !DILocalVariable(name: "b", arg: 1, scope: !1001, file: !767, line: 174, type: !994)
!1005 = !DILocation(line: 174, column: 30, scope: !1001)
!1006 = !DILocation(line: 178, column: 11, scope: !1001)
!1007 = !DILocation(line: 178, column: 14, scope: !1001)
!1008 = !DILocation(line: 178, column: 4, scope: !1001)
!1009 = !DILocalVariable(name: "ctx", arg: 1, scope: !339, file: !73, line: 1875, type: !362)
!1010 = !DILocation(line: 1875, column: 26, scope: !339)
!1011 = !DILocation(line: 1887, column: 8, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !339, file: !73, line: 1887, column: 8)
!1013 = !DILocation(line: 1887, column: 13, scope: !1012)
!1014 = !DILocation(line: 1887, column: 17, scope: !1012)
!1015 = !DILocation(line: 1887, column: 8, scope: !339)
!1016 = !DILocalVariable(name: "rpcs", scope: !1017, file: !73, line: 1888, type: !1018)
!1017 = distinct !DILexicalBlock(scope: !1012, file: !73, line: 1887, column: 25)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1019, size: 384, align: 64, elements: !1044)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannelCallback", file: !380, line: 115, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcChannelCallback", file: !380, line: 94, size: 384, align: 64, elements: !1021)
!1021 = !{!1022, !1023, !1040, !1041, !1042, !1043}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1020, file: !380, line: 96, baseType: !257, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1020, file: !380, line: 98, baseType: !1024, size: 64, align: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcIn_Callback", file: !380, line: 90, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!318, !1028}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcInData", file: !380, line: 77, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcInData", file: !380, line: 51, size: 512, align: 64, elements: !1031)
!1031 = !{!1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1030, file: !380, line: 53, baseType: !257, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1030, file: !380, line: 58, baseType: !257, size: 64, align: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "argsSize", scope: !1030, file: !380, line: 60, baseType: !772, size: 64, align: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1030, file: !380, line: 65, baseType: !110, size: 64, align: 64, offset: 192)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "resultLen", scope: !1030, file: !380, line: 67, baseType: !772, size: 64, align: 64, offset: 256)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "freeResult", scope: !1030, file: !380, line: 72, baseType: !318, size: 32, align: 32, offset: 320)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "appCtx", scope: !1030, file: !380, line: 74, baseType: !109, size: 64, align: 64, offset: 384)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !1030, file: !380, line: 76, baseType: !109, size: 64, align: 64, offset: 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !1020, file: !380, line: 100, baseType: !326, size: 64, align: 64, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "xdrIn", scope: !1020, file: !380, line: 102, baseType: !326, size: 64, align: 64, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "xdrOut", scope: !1020, file: !380, line: 109, baseType: !326, size: 64, align: 64, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "xdrInSize", scope: !1020, file: !380, line: 114, baseType: !772, size: 64, align: 64, offset: 320)
!1044 = !{!1045}
!1045 = !DISubrange(count: 1)
!1046 = !DILocation(line: 1888, column: 26, scope: !1017)
!1047 = !DILocalVariable(name: "sigs", scope: !1017, file: !73, line: 1891, type: !1048)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 1152, align: 64, elements: !1055)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginSignalCb", file: !48, line: 484, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginSignalCb", file: !48, line: 480, size: 192, align: 64, elements: !1051)
!1051 = !{!1052, !1053, !1054}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "signame", scope: !1050, file: !48, line: 481, baseType: !369, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1050, file: !48, line: 482, baseType: !326, size: 64, align: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !1050, file: !48, line: 483, baseType: !326, size: 64, align: 64, offset: 128)
!1055 = !{!1056}
!1056 = !DISubrange(count: 6)
!1057 = !DILocation(line: 1891, column: 27, scope: !1017)
!1058 = !DILocalVariable(name: "regs", scope: !1017, file: !73, line: 1899, type: !1059)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1060, size: 256, align: 64, elements: !1065)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppReg", file: !48, line: 450, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppReg", file: !48, line: 447, size: 128, align: 64, elements: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1061, file: !48, line: 448, baseType: !392, size: 32, align: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1061, file: !48, line: 449, baseType: !348, size: 64, align: 64, offset: 64)
!1065 = !{!1066}
!1066 = !DISubrange(count: 2)
!1067 = !DILocation(line: 1899, column: 19, scope: !1017)
!1068 = !DILocation(line: 1899, column: 28, scope: !1017)
!1069 = !DILocation(line: 1900, column: 10, scope: !1017)
!1070 = !DILocation(line: 1900, column: 50, scope: !1017)
!1071 = !DILocation(line: 1900, column: 32, scope: !1017)
!1072 = !DILocation(line: 1901, column: 10, scope: !1017)
!1073 = !DILocation(line: 1901, column: 49, scope: !1017)
!1074 = !DILocation(line: 1901, column: 31, scope: !1017)
!1075 = !DILocation(line: 1913, column: 40, scope: !1017)
!1076 = !DILocation(line: 1913, column: 22, scope: !1017)
!1077 = !DILocation(line: 1913, column: 20, scope: !1017)
!1078 = !DILocation(line: 1915, column: 7, scope: !1017)
!1079 = !DILocation(line: 1916, column: 18, scope: !1017)
!1080 = !DILocation(line: 1917, column: 25, scope: !1017)
!1081 = !DILocation(line: 1922, column: 24, scope: !1017)
!1082 = !DILocation(line: 1922, column: 7, scope: !1017)
!1083 = !DILocation(line: 1924, column: 7, scope: !1017)
!1084 = !DILocation(line: 1927, column: 4, scope: !339)
!1085 = !DILocation(line: 1928, column: 1, scope: !339)
!1086 = distinct !DISubprogram(name: "GuestInfoVMSupport", scope: !73, file: !73, line: 197, type: !1026, isLocal: true, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!1087 = !DILocalVariable(name: "data", arg: 1, scope: !1086, file: !73, line: 197, type: !1028)
!1088 = !DILocation(line: 197, column: 31, scope: !1086)
!1089 = !DILocalVariable(name: "vmSupportCmdArgv", scope: !1086, file: !73, line: 250, type: !1090)
!1090 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 192, align: 64, elements: !1091)
!1091 = !{!1092}
!1092 = !DISubrange(count: 3)
!1093 = !DILocation(line: 250, column: 13, scope: !1086)
!1094 = !DILocation(line: 252, column: 84, scope: !1086)
!1095 = !DILocation(line: 252, column: 6, scope: !1086)
!1096 = !DILocation(line: 253, column: 30, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1086, file: !73, line: 253, column: 10)
!1098 = !DILocation(line: 253, column: 11, scope: !1097)
!1099 = !DILocation(line: 253, column: 10, scope: !1086)
!1100 = !DILocation(line: 258, column: 9, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1097, file: !73, line: 257, column: 49)
!1102 = !DILocation(line: 259, column: 38, scope: !1101)
!1103 = !DILocation(line: 259, column: 16, scope: !1101)
!1104 = !DILocation(line: 259, column: 9, scope: !1101)
!1105 = !DILocation(line: 263, column: 35, scope: !1086)
!1106 = !DILocation(line: 263, column: 13, scope: !1086)
!1107 = !DILocation(line: 263, column: 6, scope: !1086)
!1108 = !DILocation(line: 266, column: 1, scope: !1086)
!1109 = distinct !DISubprogram(name: "GuestInfoServerSendCaps", scope: !73, file: !73, line: 1797, type: !1110, isLocal: true, isDefinition: true, scopeLine: 1801, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!348, !326, !362, !318, !326}
!1112 = !DILocalVariable(name: "src", arg: 1, scope: !1109, file: !73, line: 1797, type: !326)
!1113 = !DILocation(line: 1797, column: 34, scope: !1109)
!1114 = !DILocalVariable(name: "ctx", arg: 2, scope: !1109, file: !73, line: 1798, type: !362)
!1115 = !DILocation(line: 1798, column: 38, scope: !1109)
!1116 = !DILocalVariable(name: "set", arg: 3, scope: !1109, file: !73, line: 1799, type: !318)
!1117 = !DILocation(line: 1799, column: 34, scope: !1109)
!1118 = !DILocalVariable(name: "data", arg: 4, scope: !1109, file: !73, line: 1800, type: !326)
!1119 = !DILocation(line: 1800, column: 34, scope: !1109)
!1120 = !DILocation(line: 1802, column: 8, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1109, file: !73, line: 1802, column: 8)
!1122 = !DILocation(line: 1802, column: 8, scope: !1109)
!1123 = !DILocation(line: 1803, column: 18, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1121, file: !73, line: 1802, column: 13)
!1125 = !DILocation(line: 1803, column: 7, scope: !1124)
!1126 = !DILocation(line: 1804, column: 4, scope: !1124)
!1127 = !DILocation(line: 1805, column: 4, scope: !1109)
!1128 = distinct !DISubprogram(name: "GuestInfoServerConfReload", scope: !73, file: !73, line: 1675, type: !1129, isLocal: true, isDefinition: true, scopeLine: 1678, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{null, !326, !362, !326}
!1131 = !DILocalVariable(name: "src", arg: 1, scope: !1128, file: !73, line: 1675, type: !326)
!1132 = !DILocation(line: 1675, column: 36, scope: !1128)
!1133 = !DILocalVariable(name: "ctx", arg: 2, scope: !1128, file: !73, line: 1676, type: !362)
!1134 = !DILocation(line: 1676, column: 40, scope: !1128)
!1135 = !DILocalVariable(name: "data", arg: 3, scope: !1128, file: !73, line: 1677, type: !326)
!1136 = !DILocation(line: 1677, column: 36, scope: !1128)
!1137 = !DILocation(line: 1679, column: 21, scope: !1128)
!1138 = !DILocation(line: 1679, column: 4, scope: !1128)
!1139 = !DILocation(line: 1680, column: 1, scope: !1128)
!1140 = distinct !DISubprogram(name: "GuestInfoServerIOFreeze", scope: !73, file: !73, line: 1699, type: !1141, isLocal: true, isDefinition: true, scopeLine: 1703, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{null, !326, !362, !318, !326}
!1143 = !DILocalVariable(name: "src", arg: 1, scope: !1140, file: !73, line: 1699, type: !326)
!1144 = !DILocation(line: 1699, column: 34, scope: !1140)
!1145 = !DILocalVariable(name: "ctx", arg: 2, scope: !1140, file: !73, line: 1700, type: !362)
!1146 = !DILocation(line: 1700, column: 38, scope: !1140)
!1147 = !DILocalVariable(name: "freeze", arg: 3, scope: !1140, file: !73, line: 1701, type: !318)
!1148 = !DILocation(line: 1701, column: 34, scope: !1140)
!1149 = !DILocalVariable(name: "data", arg: 4, scope: !1140, file: !73, line: 1702, type: !326)
!1150 = !DILocation(line: 1702, column: 34, scope: !1140)
!1151 = !DILocation(line: 1704, column: 21, scope: !1140)
!1152 = !DILocation(line: 1704, column: 27, scope: !1140)
!1153 = !DILocation(line: 1704, column: 26, scope: !1140)
!1154 = !DILocation(line: 1704, column: 4, scope: !1140)
!1155 = !DILocation(line: 1705, column: 1, scope: !1140)
!1156 = distinct !DISubprogram(name: "GuestInfoServerReset", scope: !73, file: !73, line: 1765, type: !1129, isLocal: true, isDefinition: true, scopeLine: 1768, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!1157 = !DILocalVariable(name: "src", arg: 1, scope: !1156, file: !73, line: 1765, type: !326)
!1158 = !DILocation(line: 1765, column: 31, scope: !1156)
!1159 = !DILocalVariable(name: "ctx", arg: 2, scope: !1156, file: !73, line: 1766, type: !362)
!1160 = !DILocation(line: 1766, column: 35, scope: !1156)
!1161 = !DILocalVariable(name: "data", arg: 3, scope: !1156, file: !73, line: 1767, type: !326)
!1162 = !DILocation(line: 1767, column: 31, scope: !1156)
!1163 = !DILocation(line: 1769, column: 15, scope: !1156)
!1164 = !DILocation(line: 1772, column: 29, scope: !1156)
!1165 = !DILocation(line: 1773, column: 1, scope: !1156)
!1166 = distinct !DISubprogram(name: "GuestInfoServerSetOption", scope: !73, file: !73, line: 1826, type: !1167, isLocal: true, isDefinition: true, scopeLine: 1831, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!318, !326, !362, !369, !369, !326}
!1169 = !DILocalVariable(name: "src", arg: 1, scope: !1166, file: !73, line: 1826, type: !326)
!1170 = !DILocation(line: 1826, column: 35, scope: !1166)
!1171 = !DILocalVariable(name: "ctx", arg: 2, scope: !1166, file: !73, line: 1827, type: !362)
!1172 = !DILocation(line: 1827, column: 39, scope: !1166)
!1173 = !DILocalVariable(name: "option", arg: 3, scope: !1166, file: !73, line: 1828, type: !369)
!1174 = !DILocation(line: 1828, column: 39, scope: !1166)
!1175 = !DILocalVariable(name: "value", arg: 4, scope: !1166, file: !73, line: 1829, type: !369)
!1176 = !DILocation(line: 1829, column: 39, scope: !1166)
!1177 = !DILocalVariable(name: "data", arg: 5, scope: !1166, file: !73, line: 1830, type: !326)
!1178 = !DILocation(line: 1830, column: 35, scope: !1166)
!1179 = !DILocalVariable(name: "ip", scope: !1166, file: !73, line: 1832, type: !110)
!1180 = !DILocation(line: 1832, column: 10, scope: !1166)
!1181 = !DILocalVariable(name: "ret", scope: !1166, file: !73, line: 1833, type: !311)
!1182 = !DILocation(line: 1833, column: 9, scope: !1166)
!1183 = !DILocalVariable(name: "msg", scope: !1166, file: !73, line: 1834, type: !354)
!1184 = !DILocation(line: 1834, column: 11, scope: !1166)
!1185 = !DILocation(line: 1836, column: 15, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1166, file: !73, line: 1836, column: 8)
!1187 = !DILocation(line: 1836, column: 8, scope: !1186)
!1188 = !DILocation(line: 1836, column: 38, scope: !1186)
!1189 = !DILocation(line: 1836, column: 8, scope: !1166)
!1190 = !DILocation(line: 1837, column: 7, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1186, file: !73, line: 1836, column: 44)
!1192 = !DILocation(line: 1840, column: 15, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1166, file: !73, line: 1840, column: 8)
!1194 = !DILocation(line: 1840, column: 8, scope: !1193)
!1195 = !DILocation(line: 1840, column: 27, scope: !1193)
!1196 = !DILocation(line: 1840, column: 8, scope: !1166)
!1197 = !DILocation(line: 1841, column: 11, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1193, file: !73, line: 1840, column: 33)
!1199 = !DILocation(line: 1842, column: 7, scope: !1198)
!1200 = !DILocation(line: 1845, column: 15, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1166, file: !73, line: 1845, column: 8)
!1202 = !DILocation(line: 1845, column: 8, scope: !1201)
!1203 = !DILocation(line: 1845, column: 27, scope: !1201)
!1204 = !DILocation(line: 1845, column: 8, scope: !1166)
!1205 = !DILocation(line: 1846, column: 7, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1201, file: !73, line: 1845, column: 33)
!1207 = !DILocation(line: 1849, column: 9, scope: !1166)
!1208 = !DILocation(line: 1849, column: 7, scope: !1166)
!1209 = !DILocation(line: 1851, column: 54, scope: !1166)
!1210 = !DILocation(line: 1851, column: 10, scope: !1166)
!1211 = !DILocation(line: 1851, column: 8, scope: !1166)
!1212 = !DILocation(line: 1852, column: 26, scope: !1166)
!1213 = !DILocation(line: 1852, column: 31, scope: !1166)
!1214 = !DILocation(line: 1852, column: 36, scope: !1166)
!1215 = !DILocation(line: 1852, column: 48, scope: !1166)
!1216 = !DILocation(line: 1852, column: 41, scope: !1166)
!1217 = !DILocation(line: 1852, column: 53, scope: !1166)
!1218 = !DILocation(line: 1852, column: 10, scope: !1219)
!1219 = !DILexicalBlockFile(scope: !1166, file: !73, discriminator: 1)
!1220 = !DILocation(line: 1852, column: 10, scope: !1166)
!1221 = !DILocation(line: 1852, column: 8, scope: !1166)
!1222 = !DILocation(line: 1853, column: 12, scope: !1166)
!1223 = !DILocation(line: 1853, column: 4, scope: !1166)
!1224 = !DILocation(line: 1854, column: 11, scope: !1166)
!1225 = !DILocation(line: 1854, column: 4, scope: !1166)
!1226 = !DILocation(line: 1857, column: 22, scope: !1166)
!1227 = !DILocation(line: 1857, column: 11, scope: !1166)
!1228 = !DILocation(line: 1857, column: 4, scope: !1166)
!1229 = distinct !DISubprogram(name: "GuestInfoServerShutdown", scope: !73, file: !73, line: 1722, type: !1129, isLocal: true, isDefinition: true, scopeLine: 1725, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!1230 = !DILocalVariable(name: "src", arg: 1, scope: !1229, file: !73, line: 1722, type: !326)
!1231 = !DILocation(line: 1722, column: 34, scope: !1229)
!1232 = !DILocalVariable(name: "ctx", arg: 2, scope: !1229, file: !73, line: 1723, type: !362)
!1233 = !DILocation(line: 1723, column: 38, scope: !1229)
!1234 = !DILocalVariable(name: "data", arg: 3, scope: !1229, file: !73, line: 1724, type: !326)
!1235 = !DILocation(line: 1724, column: 34, scope: !1229)
!1236 = !DILocation(line: 1726, column: 4, scope: !1229)
!1237 = !DILocation(line: 1728, column: 4, scope: !1229)
!1238 = !DILocation(line: 1730, column: 8, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1229, file: !73, line: 1730, column: 8)
!1240 = !DILocation(line: 1730, column: 32, scope: !1239)
!1241 = !DILocation(line: 1730, column: 8, scope: !1229)
!1242 = !DILocation(line: 1731, column: 24, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1239, file: !73, line: 1730, column: 40)
!1244 = !DILocation(line: 1731, column: 7, scope: !1243)
!1245 = !DILocation(line: 1732, column: 31, scope: !1243)
!1246 = !DILocation(line: 1733, column: 4, scope: !1243)
!1247 = !DILocation(line: 1735, column: 8, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1229, file: !73, line: 1735, column: 8)
!1249 = !DILocation(line: 1735, column: 33, scope: !1248)
!1250 = !DILocation(line: 1735, column: 8, scope: !1229)
!1251 = !DILocation(line: 1736, column: 24, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1248, file: !73, line: 1735, column: 41)
!1253 = !DILocation(line: 1736, column: 7, scope: !1252)
!1254 = !DILocation(line: 1737, column: 32, scope: !1252)
!1255 = !DILocation(line: 1738, column: 4, scope: !1252)
!1256 = !DILocation(line: 1741, column: 4, scope: !1229)
!1257 = !DILocation(line: 1747, column: 1, scope: !1229)
!1258 = distinct !DISubprogram(name: "TweakGatherLoops", scope: !73, file: !73, line: 1581, type: !1259, isLocal: true, isDefinition: true, scopeLine: 1583, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{null, !362, !318}
!1261 = !DILocalVariable(name: "ctx", arg: 1, scope: !1258, file: !73, line: 1581, type: !362)
!1262 = !DILocation(line: 1581, column: 31, scope: !1258)
!1263 = !DILocalVariable(name: "enable", arg: 2, scope: !1258, file: !73, line: 1582, type: !318)
!1264 = !DILocation(line: 1582, column: 27, scope: !1258)
!1265 = !DILocalVariable(name: "perfmonEnabled", scope: !1258, file: !73, line: 1585, type: !318)
!1266 = !DILocation(line: 1585, column: 13, scope: !1258)
!1267 = !DILocation(line: 1587, column: 45, scope: !1258)
!1268 = !DILocation(line: 1587, column: 50, scope: !1258)
!1269 = !DILocation(line: 1587, column: 22, scope: !1258)
!1270 = !DILocation(line: 1587, column: 21, scope: !1258)
!1271 = !DILocation(line: 1587, column: 19, scope: !1258)
!1272 = !DILocation(line: 1592, column: 8, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1258, file: !73, line: 1592, column: 8)
!1274 = !DILocation(line: 1592, column: 8, scope: !1258)
!1275 = !DILocation(line: 1596, column: 23, scope: !1276)
