; ModuleID = './[inter]lib--list.o.i'
source_filename = "./[inter]lib--list.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

; Function Attrs: nounwind uwtable
define %struct._list* @alloc_list(void (i8*)*, void (%struct._IO_FILE*, i8*)*) #0 !dbg !94 {
  %3 = alloca void (i8*)*, align 8
  %4 = alloca void (%struct._IO_FILE*, i8*)*, align 8
  store void (i8*)* %0, void (i8*)** %3, align 8
  call void @llvm.dbg.declare(metadata void (i8*)** %3, metadata !98, metadata !99), !dbg !100
  store void (%struct._IO_FILE*, i8*)* %1, void (%struct._IO_FILE*, i8*)** %4, align 8
  call void @llvm.dbg.declare(metadata void (%struct._IO_FILE*, i8*)** %4, metadata !101, metadata !99), !dbg !102
  %5 = load void (i8*)*, void (i8*)** %3, align 8, !dbg !103
  %6 = load void (%struct._IO_FILE*, i8*)*, void (%struct._IO_FILE*, i8*)** %4, align 8, !dbg !104
  %7 = call %struct._list* @alloc_mlist(void (i8*)* %5, void (%struct._IO_FILE*, i8*)* %6, i64 1), !dbg !105

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "[inter]lib--list.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!2 = !{}
!3 = !{!4, !5, !90}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !6, line: 31, baseType: !7)
!6 = !DIFile(filename: "list.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !6, line: 39, size: 320, align: 64, elements: !9)
!9 = !{!10, !17, !18, !20, !24}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !8, file: !6, line: 40, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !6, line: 33, size: 192, align: 64, elements: !13)
!13 = !{!14, !15, !16}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !6, line: 34, baseType: !11, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !12, file: !6, line: 35, baseType: !11, size: 64, align: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !12, file: !6, line: 36, baseType: !4, size: 64, align: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !8, file: !6, line: 41, baseType: !11, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !8, file: !6, line: 42, baseType: !19, size: 32, align: 32, offset: 128)
!19 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !8, file: !6, line: 43, baseType: !21, size: 64, align: 64, offset: 192)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DISubroutineType(types: !23)
!23 = !{null, !4}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !8, file: !6, line: 44, baseType: !25, size: 64, align: 64, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{null, !28, !4}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !30, line: 48, baseType: !31)
!30 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !32, line: 241, size: 1728, align: 64, elements: !33)
!32 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!33 = !{!34, !36, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !57, !58, !59, !60, !64, !66, !68, !72, !75, !77, !78, !79, !80, !81, !85, !86}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !31, file: !32, line: 242, baseType: !35, size: 32, align: 32)
!35 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !31, file: !32, line: 247, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !31, file: !32, line: 248, baseType: !37, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !31, file: !32, line: 249, baseType: !37, size: 64, align: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !31, file: !32, line: 250, baseType: !37, size: 64, align: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !31, file: !32, line: 251, baseType: !37, size: 64, align: 64, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !31, file: !32, line: 252, baseType: !37, size: 64, align: 64, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !31, file: !32, line: 253, baseType: !37, size: 64, align: 64, offset: 448)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !31, file: !32, line: 254, baseType: !37, size: 64, align: 64, offset: 512)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !31, file: !32, line: 256, baseType: !37, size: 64, align: 64, offset: 576)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !31, file: !32, line: 257, baseType: !37, size: 64, align: 64, offset: 640)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !31, file: !32, line: 258, baseType: !37, size: 64, align: 64, offset: 704)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !31, file: !32, line: 260, baseType: !50, size: 64, align: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !32, line: 156, size: 192, align: 64, elements: !52)
!52 = !{!53, !54, !56}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !51, file: !32, line: 157, baseType: !50, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !51, file: !32, line: 158, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !51, file: !32, line: 162, baseType: !35, size: 32, align: 32, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !31, file: !32, line: 262, baseType: !55, size: 64, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !31, file: !32, line: 264, baseType: !35, size: 32, align: 32, offset: 896)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !31, file: !32, line: 268, baseType: !35, size: 32, align: 32, offset: 928)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !31, file: !32, line: 270, baseType: !61, size: 64, align: 64, offset: 960)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !62, line: 131, baseType: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!63 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !31, file: !32, line: 274, baseType: !65, size: 16, align: 16, offset: 1024)
!65 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !31, file: !32, line: 275, baseType: !67, size: 8, align: 8, offset: 1040)
!67 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !31, file: !32, line: 276, baseType: !69, size: 8, align: 8, offset: 1048)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 1)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !31, file: !32, line: 280, baseType: !73, size: 64, align: 64, offset: 1088)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !32, line: 150, baseType: null)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !31, file: !32, line: 289, baseType: !76, size: 64, align: 64, offset: 1152)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !62, line: 132, baseType: !63)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !31, file: !32, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !31, file: !32, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !31, file: !32, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !31, file: !32, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !31, file: !32, line: 302, baseType: !82, size: 64, align: 64, offset: 1472)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !83, line: 216, baseType: !84)
!83 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!84 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !31, file: !32, line: 303, baseType: !35, size: 32, align: 32, offset: 1536)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !31, file: !32, line: 305, baseType: !87, size: 160, align: 8, offset: 1568)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 20)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "element", file: !6, line: 30, baseType: !11)
!91 = !{i32 2, !"Dwarf Version", i32 4}
!92 = !{i32 2, !"Debug Info Version", i32 3}
!93 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!94 = distinct !DISubprogram(name: "alloc_list", scope: !95, file: !95, line: 32, type: !96, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!95 = !DIFile(filename: "list.c", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!96 = !DISubroutineType(types: !97)
!97 = !{!5, !21, !25}
!98 = !DILocalVariable(name: "free_func", arg: 1, scope: !94, file: !95, line: 32, type: !21)
!99 = !DIExpression()
!100 = !DILocation(line: 32, column: 19, scope: !94)
!101 = !DILocalVariable(name: "dump_func", arg: 2, scope: !94, file: !95, line: 32, type: !25)
!102 = !DILocation(line: 32, column: 47, scope: !94)
!103 = !DILocation(line: 34, column: 21, scope: !94)
!104 = !DILocation(line: 34, column: 32, scope: !94)
!105 = !DILocation(line: 34, column: 9, scope: !94)
!106 = !DILocation(line: 34, column: 2, scope: !94)
!107 = distinct !DISubprogram(name: "alloc_mlist", scope: !95, file: !95, line: 200, type: !108, isLocal: false, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!108 = !DISubroutineType(types: !109)
!109 = !{!5, !21, !25, !82}
!110 = !DILocalVariable(name: "free_func", arg: 1, scope: !107, file: !95, line: 200, type: !21)
!111 = !DILocation(line: 200, column: 20, scope: !107)
!112 = !DILocalVariable(name: "dump_func", arg: 2, scope: !107, file: !95, line: 200, type: !25)
!113 = !DILocation(line: 200, column: 48, scope: !107)
!114 = !DILocalVariable(name: "size", arg: 3, scope: !107, file: !95, line: 200, type: !82)
!115 = !DILocation(line: 200, column: 84, scope: !107)
!116 = !DILocalVariable(name: "new", scope: !107, file: !95, line: 202, type: !5)
!117 = !DILocation(line: 202, column: 7, scope: !107)
!118 = !DILocation(line: 202, column: 28, scope: !107)
!119 = !DILocation(line: 202, column: 33, scope: !107)
!120 = !DILocation(line: 202, column: 21, scope: !107)
!121 = !DILocation(line: 202, column: 13, scope: !107)
!122 = !DILocation(line: 203, column: 14, scope: !107)
!123 = !DILocation(line: 203, column: 2, scope: !107)
!124 = !DILocation(line: 203, column: 7, scope: !107)
!125 = !DILocation(line: 203, column: 12, scope: !107)
!126 = !DILocation(line: 204, column: 14, scope: !107)
!127 = !DILocation(line: 204, column: 2, scope: !107)
!128 = !DILocation(line: 204, column: 7, scope: !107)
!129 = !DILocation(line: 204, column: 12, scope: !107)
!130 = !DILocation(line: 205, column: 9, scope: !107)
!131 = !DILocation(line: 205, column: 2, scope: !107)
!132 = distinct !DISubprogram(name: "list_add", scope: !95, file: !95, line: 45, type: !133, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !5, !4}
!135 = !DILocalVariable(name: "l", arg: 1, scope: !132, file: !95, line: 45, type: !5)
!136 = !DILocation(line: 45, column: 15, scope: !132)
!137 = !DILocalVariable(name: "data", arg: 2, scope: !132, file: !95, line: 45, type: !4)
!138 = !DILocation(line: 45, column: 24, scope: !132)
!139 = !DILocalVariable(name: "e", scope: !132, file: !95, line: 47, type: !90)
!140 = !DILocation(line: 47, column: 10, scope: !132)
!141 = !DILocation(line: 47, column: 14, scope: !132)
!142 = !DILocation(line: 49, column: 12, scope: !132)
!143 = !DILocation(line: 49, column: 15, scope: !132)
!144 = !DILocation(line: 49, column: 2, scope: !132)
