; ModuleID = './[inter]lib--scheduler.o.i'
source_filename = "./[inter]lib--scheduler.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._thread_master = type { %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.list_head, %struct.list_head, %struct.list_head, %struct._list*, %struct.rb_root, %struct.epoll_event*, %struct._thread_event*, i32, i32, i32, i32, %struct._thread*, i64, i64, i8 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.rb_root = type { %struct.rb_node* }
%struct.rb_node = type { i64, %struct.rb_node*, %struct.rb_node* }
%struct.epoll_event = type <{ i32, %union.epoll_data }>
%union.epoll_data = type { i8* }
%struct._thread_event = type { %struct._thread*, %struct._thread*, i64, i32, %struct.rb_node }
%struct._thread = type { i64, i32, %struct._thread_master*, i32 (%struct._thread*)*, i8*, %struct.timeval, %union.anon, %struct._thread_event*, %union.anon.0 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !62, globals: !261)
!1 = !DIFile(filename: "[inter]lib--scheduler.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!2 = !{!3, !24, !28, !33, !40, !45}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 41, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "scheduler.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!6 = !DIEnumerator(name: "THREAD_READ", value: 0)
!7 = !DIEnumerator(name: "THREAD_WRITE", value: 1)
!8 = !DIEnumerator(name: "THREAD_TIMER", value: 2)
!9 = !DIEnumerator(name: "THREAD_TIMER_SHUTDOWN", value: 3)
!10 = !DIEnumerator(name: "THREAD_EVENT", value: 4)
!11 = !DIEnumerator(name: "THREAD_CHILD", value: 5)
!12 = !DIEnumerator(name: "THREAD_READY", value: 6)
!13 = !DIEnumerator(name: "THREAD_UNUSED", value: 7)
!14 = !DIEnumerator(name: "THREAD_WRITE_TIMEOUT", value: 8)
!15 = !DIEnumerator(name: "THREAD_READ_TIMEOUT", value: 9)
!16 = !DIEnumerator(name: "THREAD_CHILD_TIMEOUT", value: 10)
!17 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!18 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!19 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!20 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!21 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!22 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!23 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 23, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/epoll.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!26 = !{!27}
!27 = !DIEnumerator(name: "EPOLL_CLOEXEC", value: 524288)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 23, size: 32, align: 32, elements: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/timerfd.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!30 = !{!31, !32}
!31 = !DIEnumerator(name: "TFD_CLOEXEC", value: 524288)
!32 = !DIEnumerator(name: "TFD_NONBLOCK", value: 2048)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "thread_flags", file: !4, line: 66, size: 32, align: 32, elements: !34)
!34 = !{!35, !36, !37, !38, !39}
!35 = !DIEnumerator(name: "THREAD_FL_READ_BIT", value: 0)
!36 = !DIEnumerator(name: "THREAD_FL_WRITE_BIT", value: 1)
!37 = !DIEnumerator(name: "THREAD_FL_EPOLL_BIT", value: 2)
!38 = !DIEnumerator(name: "THREAD_FL_EPOLL_READ_BIT", value: 3)
!39 = !DIEnumerator(name: "THREAD_FL_EPOLL_WRITE_BIT", value: 4)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 152, size: 32, align: 32, elements: !41)
!41 = !{!42, !43, !44}
!42 = !DIEnumerator(name: "PROG_TYPE_PARENT", value: 0)
!43 = !DIEnumerator(name: "PROG_TYPE_VRRP", value: 1)
!44 = !DIEnumerator(name: "PROG_TYPE_CHECKER", value: 2)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "EPOLL_EVENTS", file: !46, line: 40, size: 32, align: 32, elements: !47)
!46 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/epoll.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61}
!48 = !DIEnumerator(name: "EPOLLIN", value: 1)
!49 = !DIEnumerator(name: "EPOLLPRI", value: 2)
!50 = !DIEnumerator(name: "EPOLLOUT", value: 4)
!51 = !DIEnumerator(name: "EPOLLRDNORM", value: 64)
!52 = !DIEnumerator(name: "EPOLLRDBAND", value: 128)
!53 = !DIEnumerator(name: "EPOLLWRNORM", value: 256)
!54 = !DIEnumerator(name: "EPOLLWRBAND", value: 512)
!55 = !DIEnumerator(name: "EPOLLMSG", value: 1024)
!56 = !DIEnumerator(name: "EPOLLERR", value: 8)
!57 = !DIEnumerator(name: "EPOLLHUP", value: 16)
!58 = !DIEnumerator(name: "EPOLLRDHUP", value: 8192)
!59 = !DIEnumerator(name: "EPOLLWAKEUP", value: 536870912)
!60 = !DIEnumerator(name: "EPOLLONESHOT", value: 1073741824)
!61 = !DIEnumerator(name: "EPOLLET", value: -2147483648)
!62 = !{!63, !64, !65, !202, !128, !110, !126, !197, !79}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!64 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_master_t", file: !4, line: 149, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !4, line: 112, size: 1280, align: 64, elements: !68)
!68 = !{!69, !82, !83, !84, !85, !93, !94, !95, !179, !180, !196, !252, !253, !254, !255, !256, !257, !258, !259}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !67, file: !4, line: 113, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !71, line: 109, baseType: !72)
!71 = !DIFile(filename: "rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !71, line: 106, size: 64, align: 64, elements: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !72, file: !71, line: 108, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !71, line: 97, size: 192, align: 64, elements: !77)
!77 = !{!78, !80, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !76, file: !71, line: 99, baseType: !79, size: 64, align: 64)
!79 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !76, file: !71, line: 102, baseType: !75, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !76, file: !71, line: 103, baseType: !75, size: 64, align: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !67, file: !4, line: 114, baseType: !70, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !67, file: !4, line: 115, baseType: !70, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !67, file: !4, line: 116, baseType: !70, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !67, file: !4, line: 117, baseType: !86, size: 128, align: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !87, line: 62, baseType: !88)
!87 = !DIFile(filename: "list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !87, line: 60, size: 128, align: 64, elements: !89)
!89 = !{!90, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !88, file: !87, line: 61, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !88, file: !87, line: 61, baseType: !91, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !67, file: !4, line: 121, baseType: !86, size: 128, align: 64, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !67, file: !4, line: 122, baseType: !86, size: 128, align: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !67, file: !4, line: 124, baseType: !96, size: 64, align: 64, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !97, line: 31, baseType: !98)
!97 = !DIFile(filename: "list.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !97, line: 39, size: 320, align: 64, elements: !100)
!100 = !{!101, !108, !109, !111, !115}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !99, file: !97, line: 40, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !97, line: 33, size: 192, align: 64, elements: !104)
!104 = !{!105, !106, !107}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !103, file: !97, line: 34, baseType: !102, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !103, file: !97, line: 35, baseType: !102, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !103, file: !97, line: 36, baseType: !63, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !99, file: !97, line: 41, baseType: !102, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !99, file: !97, line: 42, baseType: !110, size: 32, align: 32, offset: 128)
!110 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !99, file: !97, line: 43, baseType: !112, size: 64, align: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !63}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !99, file: !97, line: 44, baseType: !116, size: 64, align: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !119, !63}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !121, line: 48, baseType: !122)
!121 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !123, line: 241, size: 1728, align: 64, elements: !124)
!123 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!124 = !{!125, !127, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !148, !149, !150, !151, !155, !157, !158, !162, !165, !167, !168, !169, !170, !171, !174, !175}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !122, file: !123, line: 242, baseType: !126, size: 32, align: 32)
!126 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !122, file: !123, line: 247, baseType: !128, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !122, file: !123, line: 248, baseType: !128, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !122, file: !123, line: 249, baseType: !128, size: 64, align: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !122, file: !123, line: 250, baseType: !128, size: 64, align: 64, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !122, file: !123, line: 251, baseType: !128, size: 64, align: 64, offset: 320)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !122, file: !123, line: 252, baseType: !128, size: 64, align: 64, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !122, file: !123, line: 253, baseType: !128, size: 64, align: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !122, file: !123, line: 254, baseType: !128, size: 64, align: 64, offset: 512)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !122, file: !123, line: 256, baseType: !128, size: 64, align: 64, offset: 576)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !122, file: !123, line: 257, baseType: !128, size: 64, align: 64, offset: 640)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !122, file: !123, line: 258, baseType: !128, size: 64, align: 64, offset: 704)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !122, file: !123, line: 260, baseType: !141, size: 64, align: 64, offset: 768)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !123, line: 156, size: 192, align: 64, elements: !143)
!143 = !{!144, !145, !147}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !142, file: !123, line: 157, baseType: !141, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !142, file: !123, line: 158, baseType: !146, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !142, file: !123, line: 162, baseType: !126, size: 32, align: 32, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !122, file: !123, line: 262, baseType: !146, size: 64, align: 64, offset: 832)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !122, file: !123, line: 264, baseType: !126, size: 32, align: 32, offset: 896)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !122, file: !123, line: 268, baseType: !126, size: 32, align: 32, offset: 928)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !122, file: !123, line: 270, baseType: !152, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !153, line: 131, baseType: !154)
!153 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!154 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !122, file: !123, line: 274, baseType: !156, size: 16, align: 16, offset: 1024)
!156 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !122, file: !123, line: 275, baseType: !64, size: 8, align: 8, offset: 1040)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !122, file: !123, line: 276, baseType: !159, size: 8, align: 8, offset: 1048)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 8, align: 8, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 1)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !122, file: !123, line: 280, baseType: !163, size: 64, align: 64, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !123, line: 150, baseType: null)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !122, file: !123, line: 289, baseType: !166, size: 64, align: 64, offset: 1152)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !153, line: 132, baseType: !154)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !122, file: !123, line: 297, baseType: !63, size: 64, align: 64, offset: 1216)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !122, file: !123, line: 298, baseType: !63, size: 64, align: 64, offset: 1280)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !122, file: !123, line: 299, baseType: !63, size: 64, align: 64, offset: 1344)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !122, file: !123, line: 300, baseType: !63, size: 64, align: 64, offset: 1408)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !122, file: !123, line: 302, baseType: !172, size: 64, align: 64, offset: 1472)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !173, line: 216, baseType: !79)
!173 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !122, file: !123, line: 303, baseType: !126, size: 32, align: 32, offset: 1536)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !122, file: !123, line: 305, baseType: !176, size: 160, align: 8, offset: 1568)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 160, align: 8, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 20)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !67, file: !4, line: 127, baseType: !70, size: 64, align: 64, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !67, file: !4, line: 128, baseType: !181, size: 64, align: 64, offset: 768)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !46, line: 87, size: 96, align: 8, elements: !183)
!183 = !{!184, !187}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !182, file: !46, line: 89, baseType: !185, size: 32, align: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !186, line: 51, baseType: !110)
!186 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!187 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !182, file: !46, line: 90, baseType: !188, size: 64, align: 64, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "epoll_data_t", file: !46, line: 85, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "epoll_data", file: !46, line: 79, size: 64, align: 64, elements: !190)
!190 = !{!191, !192, !193, !194}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !189, file: !46, line: 81, baseType: !63, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !189, file: !46, line: 82, baseType: !126, size: 32, align: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !189, file: !46, line: 83, baseType: !185, size: 32, align: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !189, file: !46, line: 84, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !186, line: 55, baseType: !79)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !67, file: !4, line: 129, baseType: !197, size: 64, align: 64, offset: 832)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !4, line: 109, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !4, line: 102, size: 448, align: 64, elements: !200)
!200 = !{!201, !248, !249, !250, !251}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !199, file: !4, line: 103, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !4, line: 99, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !4, line: 78, size: 768, align: 64, elements: !205)
!205 = !{!206, !207, !209, !211, !216, !217, !227, !240, !242}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !204, file: !4, line: 79, baseType: !79, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !204, file: !4, line: 80, baseType: !208, size: 32, align: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !4, line: 63, baseType: !3)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !204, file: !4, line: 81, baseType: !210, size: 64, align: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !204, file: !4, line: 82, baseType: !212, size: 64, align: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!126, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !204, file: !4, line: 83, baseType: !63, size: 64, align: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !204, file: !4, line: 84, baseType: !218, size: 128, align: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !219, line: 31, baseType: !220)
!219 = !DIFile(filename: "timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !221, line: 30, size: 128, align: 64, elements: !222)
!221 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!222 = !{!223, !225}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !220, file: !221, line: 32, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !153, line: 139, baseType: !154)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !220, file: !221, line: 33, baseType: !226, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !153, line: 141, baseType: !154)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !204, file: !4, line: 92, baseType: !228, size: 64, align: 32, offset: 448)
!228 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !204, file: !4, line: 85, size: 64, align: 32, elements: !229)
!229 = !{!230, !231, !232}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !228, file: !4, line: 86, baseType: !126, size: 32, align: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !228, file: !4, line: 87, baseType: !126, size: 32, align: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !228, file: !4, line: 91, baseType: !233, size: 64, align: 32)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !228, file: !4, line: 88, size: 64, align: 32, elements: !234)
!234 = !{!235, !239}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !233, file: !4, line: 89, baseType: !236, size: 32, align: 32)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !237, line: 61, baseType: !238)
!237 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !153, line: 133, baseType: !126)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !233, file: !4, line: 90, baseType: !126, size: 32, align: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !204, file: !4, line: 93, baseType: !241, size: 64, align: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, scope: !204, file: !4, line: 95, baseType: !243, size: 192, align: 64, offset: 576)
!243 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !204, file: !4, line: 95, size: 192, align: 64, elements: !244)
!244 = !{!245, !247}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !243, file: !4, line: 96, baseType: !246, size: 192, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !71, line: 104, baseType: !76)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !4, line: 97, baseType: !86, size: 128, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !199, file: !4, line: 104, baseType: !202, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !199, file: !4, line: 105, baseType: !79, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !199, file: !4, line: 106, baseType: !126, size: 32, align: 32, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !199, file: !4, line: 108, baseType: !246, size: 192, align: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !67, file: !4, line: 130, baseType: !110, size: 32, align: 32, offset: 896)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !67, file: !4, line: 131, baseType: !110, size: 32, align: 32, offset: 928)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !67, file: !4, line: 132, baseType: !126, size: 32, align: 32, offset: 960)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !67, file: !4, line: 135, baseType: !126, size: 32, align: 32, offset: 992)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !67, file: !4, line: 136, baseType: !202, size: 64, align: 64, offset: 1024)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !67, file: !4, line: 146, baseType: !79, size: 64, align: 64, offset: 1088)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !67, file: !4, line: 147, baseType: !79, size: 64, align: 64, offset: 1152)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !67, file: !4, line: 148, baseType: !260, size: 8, align: 8, offset: 1216)
!260 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!261 = !{!262, !264, !266, !267, !268, !270, !276, !280, !284, !285, !289}
!262 = distinct !DIGlobalVariable(name: "master", scope: !0, file: !263, line: 71, type: !65, isLocal: false, isDefinition: true, variable: %struct._thread_master** @master)
!263 = !DIFile(filename: "scheduler.c", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!264 = distinct !DIGlobalVariable(name: "prog_type", scope: !0, file: !263, line: 73, type: !265, isLocal: false, isDefinition: true, variable: i32* @prog_type)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "prog_type_t", file: !4, line: 163, baseType: !40)
!266 = distinct !DIGlobalVariable(name: "shutting_down", scope: !0, file: !263, line: 80, type: !260, isLocal: true, isDefinition: true, variable: i8* @shutting_down)
!267 = distinct !DIGlobalVariable(name: "sav_argc", scope: !0, file: !263, line: 81, type: !126, isLocal: true, isDefinition: true, variable: i32* @sav_argc)
!268 = distinct !DIGlobalVariable(name: "sav_argv", scope: !0, file: !263, line: 82, type: !269, isLocal: true, isDefinition: true, variable: i8*** @sav_argv)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!270 = distinct !DIGlobalVariable(name: "child_finder_name", scope: !0, file: !263, line: 95, type: !271, isLocal: true, isDefinition: true, variable: i8* (i32)** @child_finder_name)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !236}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!276 = distinct !DIGlobalVariable(name: "child_adder", scope: !0, file: !263, line: 98, type: !277, isLocal: true, isDefinition: true, variable: void (%struct._thread*)** @child_adder)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !202}
!280 = distinct !DIGlobalVariable(name: "child_finder", scope: !0, file: !263, line: 99, type: !281, isLocal: true, isDefinition: true, variable: %struct._thread* (i32)** @child_finder)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!202, !236}
!284 = distinct !DIGlobalVariable(name: "child_remover", scope: !0, file: !263, line: 100, type: !277, isLocal: true, isDefinition: true, variable: void (%struct._thread*)** @child_remover)
!285 = distinct !DIGlobalVariable(name: "child_finder_destroy", scope: !0, file: !263, line: 101, type: !286, isLocal: true, isDefinition: true, variable: void ()** @child_finder_destroy)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{null}
!289 = distinct !DIGlobalVariable(name: "child_finder_list_size", scope: !0, file: !263, line: 102, type: !172, isLocal: true, isDefinition: true, variable: i64* @child_finder_list_size)
!290 = !{i32 2, !"Dwarf Version", i32 4}
!291 = !{i32 2, !"Debug Info Version", i32 3}
!292 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!293 = distinct !DISubprogram(name: "set_child_finder_name", scope: !263, file: !263, line: 394, type: !294, isLocal: false, isDefinition: true, scopeLine: 395, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !271}
!296 = !{}
!297 = !DILocalVariable(name: "func", arg: 1, scope: !293, file: !263, line: 394, type: !271)
!298 = !DIExpression()
!299 = !DILocation(line: 394, column: 38, scope: !293)
!300 = !DILocation(line: 396, column: 22, scope: !293)
!301 = !DILocation(line: 396, column: 20, scope: !293)
!302 = !DILocation(line: 397, column: 1, scope: !293)
!303 = distinct !DISubprogram(name: "set_child_finder", scope: !263, file: !263, line: 400, type: !304, isLocal: false, isDefinition: true, scopeLine: 406, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !277, !281, !277, !306, !286, !172}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!260, !172}
!309 = !DILocalVariable(name: "adder_func", arg: 1, scope: !303, file: !263, line: 400, type: !277)
!310 = !DILocation(line: 400, column: 25, scope: !303)
!311 = !DILocalVariable(name: "finder_func", arg: 2, scope: !303, file: !263, line: 401, type: !281)
!312 = !DILocation(line: 401, column: 16, scope: !303)
!313 = !DILocalVariable(name: "remover_func", arg: 3, scope: !303, file: !263, line: 402, type: !277)
!314 = !DILocation(line: 402, column: 11, scope: !303)
!315 = !DILocalVariable(name: "init_func", arg: 4, scope: !303, file: !263, line: 403, type: !306)
!316 = !DILocation(line: 403, column: 10, scope: !303)
!317 = !DILocalVariable(name: "destroy_func", arg: 5, scope: !303, file: !263, line: 404, type: !286)
!318 = !DILocation(line: 404, column: 11, scope: !303)
!319 = !DILocalVariable(name: "num_entries", arg: 6, scope: !303, file: !263, line: 405, type: !172)
!320 = !DILocation(line: 405, column: 11, scope: !303)
!321 = !DILocalVariable(name: "using_child_finder", scope: !303, file: !263, line: 407, type: !260)
!322 = !DILocation(line: 407, column: 6, scope: !303)
!323 = !DILocation(line: 409, column: 6, scope: !324)
!324 = distinct !DILexicalBlock(scope: !303, file: !263, line: 409, column: 6)
!325 = !DILocation(line: 409, column: 6, scope: !303)
!326 = !DILocation(line: 410, column: 3, scope: !324)
!327 = !DILocation(line: 412, column: 6, scope: !328)
!328 = distinct !DILexicalBlock(scope: !303, file: !263, line: 412, column: 6)
!329 = !DILocation(line: 412, column: 17, scope: !328)
!330 = !DILocation(line: 412, column: 6, scope: !303)
!331 = !DILocation(line: 413, column: 33, scope: !332)
!332 = distinct !DILexicalBlock(scope: !333, file: !263, line: 413, column: 7)
!333 = distinct !DILexicalBlock(scope: !328, file: !263, line: 412, column: 33)
!334 = !DILocation(line: 413, column: 7, scope: !332)
!335 = !DILocation(line: 413, column: 7, scope: !333)
!336 = !DILocation(line: 414, column: 16, scope: !337)
!337 = distinct !DILexicalBlock(scope: !332, file: !263, line: 413, column: 47)
!338 = !DILocation(line: 415, column: 17, scope: !337)
!339 = !DILocation(line: 416, column: 18, scope: !337)
!340 = !DILocation(line: 417, column: 25, scope: !337)
!341 = !DILocation(line: 419, column: 23, scope: !337)
!342 = !DILocation(line: 420, column: 3, scope: !337)
!343 = !DILocation(line: 421, column: 2, scope: !333)
!344 = !DILocation(line: 421, column: 13, scope: !345)
!345 = !DILexicalBlockFile(scope: !346, file: !263, discriminator: 1)
!346 = distinct !DILexicalBlock(scope: !328, file: !263, line: 421, column: 13)
!347 = !DILocation(line: 421, column: 25, scope: !345)
!348 = !DILocation(line: 421, column: 28, scope: !349)
!349 = !DILexicalBlockFile(scope: !346, file: !263, discriminator: 2)
!350 = !DILocation(line: 421, column: 38, scope: !349)
!351 = !DILocation(line: 421, column: 41, scope: !352)
!352 = !DILexicalBlockFile(scope: !346, file: !263, discriminator: 3)
!353 = !DILocation(line: 421, column: 51, scope: !352)
!354 = !DILocation(line: 421, column: 13, scope: !352)
!355 = !DILocation(line: 422, column: 17, scope: !356)
!356 = distinct !DILexicalBlock(scope: !346, file: !263, line: 421, column: 65)
!357 = !DILocation(line: 422, column: 15, scope: !356)
!358 = !DILocation(line: 423, column: 18, scope: !356)
!359 = !DILocation(line: 423, column: 16, scope: !356)
!360 = !DILocation(line: 424, column: 19, scope: !356)
!361 = !DILocation(line: 424, column: 17, scope: !356)
!362 = !DILocation(line: 425, column: 26, scope: !356)
!363 = !DILocation(line: 425, column: 24, scope: !356)
!364 = !DILocation(line: 427, column: 22, scope: !356)
!365 = !DILocation(line: 428, column: 2, scope: !356)
!366 = !DILocation(line: 430, column: 6, scope: !367)
!367 = distinct !DILexicalBlock(scope: !303, file: !263, line: 430, column: 6)
!368 = !DILocation(line: 430, column: 6, scope: !303)
!369 = !DILocation(line: 431, column: 3, scope: !367)
!370 = !DILocation(line: 433, column: 15, scope: !371)
!371 = distinct !DILexicalBlock(scope: !367, file: !263, line: 432, column: 7)
!372 = !DILocation(line: 434, column: 16, scope: !371)
!373 = !DILocation(line: 435, column: 17, scope: !371)
!374 = !DILocation(line: 436, column: 24, scope: !371)
!375 = !DILocation(line: 438, column: 1, scope: !303)
!376 = distinct !DISubprogram(name: "default_child_finder_init", scope: !263, file: !263, line: 367, type: !307, isLocal: true, isDefinition: true, scopeLine: 368, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!377 = !DILocalVariable(name: "num_entries", arg: 1, scope: !376, file: !263, line: 367, type: !172)
!378 = !DILocation(line: 367, column: 34, scope: !376)
!379 = !DILocation(line: 369, column: 25, scope: !376)
!380 = !DILocation(line: 371, column: 6, scope: !381)
!381 = distinct !DILexicalBlock(scope: !376, file: !263, line: 371, column: 6)
!382 = !DILocation(line: 371, column: 18, scope: !381)
!383 = !DILocation(line: 371, column: 6, scope: !376)
!384 = !DILocation(line: 372, column: 3, scope: !381)
!385 = !DILocation(line: 376, column: 2, scope: !376)
!386 = !DILocation(line: 376, column: 22, scope: !387)
!387 = !DILexicalBlockFile(scope: !376, file: !263, discriminator: 1)
!388 = !DILocation(line: 376, column: 28, scope: !387)
!389 = !DILocation(line: 376, column: 32, scope: !387)
!390 = !DILocation(line: 376, column: 35, scope: !391)
!391 = !DILexicalBlockFile(scope: !376, file: !263, discriminator: 2)
!392 = !DILocation(line: 376, column: 58, scope: !391)
!393 = !DILocation(line: 376, column: 2, scope: !394)
!394 = !DILexicalBlockFile(scope: !376, file: !263, discriminator: 3)
!395 = !DILocation(line: 377, column: 26, scope: !376)
!396 = !DILocation(line: 376, column: 2, scope: !397)
!397 = !DILexicalBlockFile(scope: !376, file: !263, discriminator: 4)
!398 = distinct !{!398, !385}
!399 = !DILocation(line: 379, column: 51, scope: !376)
!400 = !DILocation(line: 379, column: 28, scope: !376)
!401 = !DILocation(line: 379, column: 2, scope: !376)
!402 = !DILocation(line: 379, column: 10, scope: !376)
!403 = !DILocation(line: 379, column: 26, scope: !376)
!404 = !DILocation(line: 381, column: 2, scope: !376)
!405 = !DILocation(line: 382, column: 1, scope: !376)
!406 = distinct !DISubprogram(name: "default_child_adder", scope: !263, file: !263, line: 337, type: !278, isLocal: true, isDefinition: true, scopeLine: 338, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!407 = !DILocalVariable(name: "thread", arg: 1, scope: !406, file: !263, line: 337, type: !202)
!408 = !DILocation(line: 337, column: 31, scope: !406)
!409 = !DILocation(line: 339, column: 57, scope: !406)
!410 = !DILocation(line: 339, column: 65, scope: !406)
!411 = !DILocation(line: 339, column: 67, scope: !406)
!412 = !DILocation(line: 339, column: 69, scope: !406)
!413 = !DILocation(line: 339, column: 44, scope: !406)
!414 = !DILocation(line: 339, column: 12, scope: !406)
!415 = !DILocation(line: 339, column: 20, scope: !406)
!416 = !DILocation(line: 339, column: 28, scope: !406)
!417 = !DILocation(line: 339, column: 76, scope: !406)
!418 = !DILocation(line: 339, column: 2, scope: !419)
!419 = !DILexicalBlockFile(scope: !406, file: !263, discriminator: 1)
!420 = !DILocation(line: 340, column: 1, scope: !406)
!421 = distinct !DISubprogram(name: "default_child_finder", scope: !263, file: !263, line: 343, type: !282, isLocal: true, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!422 = !DILocalVariable(name: "pid", arg: 1, scope: !421, file: !263, line: 343, type: !236)
!423 = !DILocation(line: 343, column: 28, scope: !421)
!424 = !DILocalVariable(name: "thread", scope: !421, file: !263, line: 345, type: !202)
!425 = !DILocation(line: 345, column: 12, scope: !421)
!426 = !DILocalVariable(name: "e", scope: !421, file: !263, line: 346, type: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "element", file: !97, line: 30, baseType: !102)
!428 = !DILocation(line: 346, column: 10, scope: !421)
!429 = !DILocalVariable(name: "l", scope: !421, file: !263, line: 347, type: !96)
!430 = !DILocation(line: 347, column: 7, scope: !421)
!431 = !DILocation(line: 347, column: 49, scope: !421)
!432 = !DILocation(line: 347, column: 36, scope: !421)
!433 = !DILocation(line: 347, column: 12, scope: !421)
!434 = !DILocation(line: 347, column: 20, scope: !421)
!435 = !DILocation(line: 349, column: 8, scope: !436)
!436 = distinct !DILexicalBlock(scope: !421, file: !263, line: 349, column: 6)
!437 = !DILocation(line: 349, column: 11, scope: !436)
!438 = !DILocation(line: 349, column: 5, scope: !436)
!439 = !DILocation(line: 349, column: 10, scope: !440)
!440 = !DILexicalBlockFile(scope: !436, file: !263, discriminator: 1)
!441 = !DILocation(line: 349, column: 14, scope: !440)
!442 = !DILocation(line: 349, column: 19, scope: !440)
!443 = !DILocation(line: 349, column: 5, scope: !440)
!444 = !DILocation(line: 349, column: 9, scope: !445)
!445 = !DILexicalBlockFile(scope: !436, file: !263, discriminator: 2)
!446 = !DILocation(line: 349, column: 13, scope: !445)
!447 = !DILocation(line: 349, column: 18, scope: !445)
!448 = !DILocation(line: 349, column: 6, scope: !445)
!449 = !DILocation(line: 350, column: 3, scope: !436)
!450 = !DILocation(line: 352, column: 15, scope: !451)
!451 = distinct !DILexicalBlock(scope: !421, file: !263, line: 352, column: 2)
!452 = !DILocation(line: 352, column: 14, scope: !451)
!453 = !DILocation(line: 352, column: 23, scope: !454)
!454 = !DILexicalBlockFile(scope: !451, file: !263, discriminator: 1)
!455 = !DILocation(line: 352, column: 22, scope: !454)
!456 = !DILocation(line: 352, column: 21, scope: !454)
!457 = !DILocation(line: 352, column: 21, scope: !458)
!458 = !DILexicalBlockFile(scope: !451, file: !263, discriminator: 2)
!459 = !DILocation(line: 352, column: 4, scope: !460)
!460 = !DILexicalBlockFile(scope: !451, file: !263, discriminator: 3)
!461 = !DILocation(line: 352, column: 8, scope: !460)
!462 = !DILocation(line: 352, column: 21, scope: !460)
!463 = !DILocation(line: 352, column: 21, scope: !464)
!464 = !DILexicalBlockFile(scope: !451, file: !263, discriminator: 4)
!465 = !DILocation(line: 352, column: 14, scope: !464)
!466 = !DILocation(line: 352, column: 14, scope: !467)
!467 = !DILexicalBlockFile(scope: !451, file: !263, discriminator: 5)
!468 = !DILocation(line: 352, column: 14, scope: !469)
!469 = !DILexicalBlockFile(scope: !451, file: !263, discriminator: 6)
!470 = !DILocation(line: 352, column: 11, scope: !469)
!471 = !DILocation(line: 352, column: 7, scope: !469)
!472 = !DILocation(line: 352, column: 5, scope: !473)
!473 = !DILexicalBlockFile(scope: !474, file: !263, discriminator: 7)
!474 = distinct !DILexicalBlock(scope: !451, file: !263, line: 352, column: 2)
!475 = !DILocation(line: 352, column: 4, scope: !473)
!476 = !DILocation(line: 352, column: 8, scope: !473)
!477 = !DILocation(line: 352, column: 25, scope: !478)
!478 = !DILexicalBlockFile(scope: !474, file: !263, discriminator: 8)
!479 = !DILocation(line: 352, column: 29, scope: !478)
!480 = !DILocation(line: 352, column: 23, scope: !478)
!481 = !DILocation(line: 352, column: 21, scope: !478)
!482 = !DILocation(line: 352, column: 2, scope: !483)
!483 = !DILexicalBlockFile(scope: !451, file: !263, discriminator: 9)
!484 = !DILocation(line: 353, column: 7, scope: !485)
!485 = distinct !DILexicalBlock(scope: !486, file: !263, line: 353, column: 7)
!486 = distinct !DILexicalBlock(scope: !474, file: !263, line: 352, column: 59)
!487 = !DILocation(line: 353, column: 15, scope: !485)
!488 = !DILocation(line: 353, column: 17, scope: !485)
!489 = !DILocation(line: 353, column: 19, scope: !485)
!490 = !DILocation(line: 353, column: 26, scope: !485)
!491 = !DILocation(line: 353, column: 23, scope: !485)
!492 = !DILocation(line: 353, column: 7, scope: !486)
!493 = !DILocation(line: 354, column: 11, scope: !485)
!494 = !DILocation(line: 354, column: 4, scope: !485)
!495 = !DILocation(line: 355, column: 2, scope: !486)
!496 = !DILocation(line: 352, column: 48, scope: !497)
!497 = !DILexicalBlockFile(scope: !474, file: !263, discriminator: 10)
!498 = !DILocation(line: 352, column: 52, scope: !497)
!499 = !DILocation(line: 352, column: 45, scope: !497)
!500 = !DILocation(line: 352, column: 2, scope: !497)
!501 = distinct !{!501, !502}
!502 = !DILocation(line: 352, column: 2, scope: !421)
!503 = !DILocation(line: 357, column: 2, scope: !421)
!504 = !DILocation(line: 358, column: 1, scope: !421)
!505 = distinct !DISubprogram(name: "default_child_remover", scope: !263, file: !263, line: 361, type: !278, isLocal: true, isDefinition: true, scopeLine: 362, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!506 = !DILocalVariable(name: "thread", arg: 1, scope: !505, file: !263, line: 361, type: !202)
!507 = !DILocation(line: 361, column: 33, scope: !505)
!508 = !DILocation(line: 363, column: 57, scope: !505)
!509 = !DILocation(line: 363, column: 65, scope: !505)
!510 = !DILocation(line: 363, column: 67, scope: !505)
!511 = !DILocation(line: 363, column: 69, scope: !505)
!512 = !DILocation(line: 363, column: 44, scope: !505)
!513 = !DILocation(line: 363, column: 12, scope: !505)
!514 = !DILocation(line: 363, column: 20, scope: !505)
!515 = !DILocation(line: 363, column: 28, scope: !505)
!516 = !DILocation(line: 363, column: 76, scope: !505)
!517 = !DILocation(line: 363, column: 2, scope: !518)
!518 = !DILexicalBlockFile(scope: !505, file: !263, discriminator: 1)
!519 = !DILocation(line: 364, column: 1, scope: !505)
!520 = distinct !DISubprogram(name: "default_child_finder_destroy", scope: !263, file: !263, line: 385, type: !287, isLocal: true, isDefinition: true, scopeLine: 386, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!521 = !DILocation(line: 387, column: 6, scope: !522)
!522 = distinct !DILexicalBlock(scope: !520, file: !263, line: 387, column: 6)
!523 = !DILocation(line: 387, column: 14, scope: !522)
!524 = !DILocation(line: 387, column: 6, scope: !520)
!525 = !DILocation(line: 388, column: 14, scope: !526)
!526 = distinct !DILexicalBlock(scope: !522, file: !263, line: 387, column: 31)
!527 = !DILocation(line: 388, column: 22, scope: !526)
!528 = !DILocation(line: 388, column: 39, scope: !526)
!529 = !DILocation(line: 388, column: 3, scope: !526)
!530 = !DILocation(line: 389, column: 3, scope: !526)
!531 = !DILocation(line: 389, column: 11, scope: !526)
!532 = !DILocation(line: 389, column: 27, scope: !526)
!533 = !DILocation(line: 390, column: 2, scope: !526)
!534 = !DILocation(line: 391, column: 1, scope: !520)
!535 = distinct !DISubprogram(name: "set_child_remover", scope: !263, file: !263, line: 441, type: !536, isLocal: false, isDefinition: true, scopeLine: 442, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !277}
!538 = !DILocalVariable(name: "remover_func", arg: 1, scope: !535, file: !263, line: 441, type: !277)
!539 = !DILocation(line: 441, column: 26, scope: !535)
!540 = !DILocation(line: 443, column: 18, scope: !535)
!541 = !DILocation(line: 443, column: 16, scope: !535)
!542 = !DILocation(line: 444, column: 1, scope: !535)
!543 = distinct !DISubprogram(name: "destroy_child_finder", scope: !263, file: !263, line: 447, type: !287, isLocal: false, isDefinition: true, scopeLine: 448, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!544 = !DILocation(line: 449, column: 2, scope: !543)
!545 = !DILocation(line: 450, column: 1, scope: !543)
!546 = distinct !DISubprogram(name: "save_cmd_line_options", scope: !263, file: !263, line: 453, type: !547, isLocal: false, isDefinition: true, scopeLine: 454, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !126, !269}
!549 = !DILocalVariable(name: "argc", arg: 1, scope: !546, file: !263, line: 453, type: !126)
!550 = !DILocation(line: 453, column: 27, scope: !546)
!551 = !DILocalVariable(name: "argv", arg: 2, scope: !546, file: !263, line: 453, type: !269)
!552 = !DILocation(line: 453, column: 40, scope: !546)
!553 = !DILocation(line: 455, column: 13, scope: !546)
!554 = !DILocation(line: 455, column: 11, scope: !546)
!555 = !DILocation(line: 456, column: 13, scope: !546)
!556 = !DILocation(line: 456, column: 11, scope: !546)
!557 = !DILocation(line: 457, column: 1, scope: !546)
!558 = distinct !DISubprogram(name: "log_command_line", scope: !263, file: !263, line: 505, type: !559, isLocal: false, isDefinition: true, scopeLine: 506, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !110}
!561 = !DILocalVariable(name: "indent", arg: 1, scope: !558, file: !263, line: 505, type: !110)
!562 = !DILocation(line: 505, column: 27, scope: !558)
!563 = !DILocalVariable(name: "len", scope: !558, file: !263, line: 507, type: !172)
!564 = !DILocation(line: 507, column: 9, scope: !558)
!565 = !DILocalVariable(name: "log_str", scope: !558, file: !263, line: 508, type: !128)
!566 = !DILocation(line: 508, column: 8, scope: !558)
!567 = !DILocalVariable(name: "p", scope: !558, file: !263, line: 509, type: !128)
!568 = !DILocation(line: 509, column: 8, scope: !558)
!569 = !DILocalVariable(name: "i", scope: !558, file: !263, line: 510, type: !126)
!570 = !DILocation(line: 510, column: 6, scope: !558)
!571 = !DILocation(line: 512, column: 7, scope: !572)
!572 = distinct !DILexicalBlock(scope: !558, file: !263, line: 512, column: 6)
!573 = !DILocation(line: 512, column: 6, scope: !558)
!574 = !DILocation(line: 513, column: 3, scope: !572)
!575 = !DILocation(line: 515, column: 9, scope: !576)
!576 = distinct !DILexicalBlock(scope: !558, file: !263, line: 515, column: 2)
!577 = !DILocation(line: 515, column: 7, scope: !576)
!578 = !DILocation(line: 515, column: 14, scope: !579)
!579 = !DILexicalBlockFile(scope: !580, file: !263, discriminator: 1)
!580 = distinct !DILexicalBlock(scope: !576, file: !263, line: 515, column: 2)
!581 = !DILocation(line: 515, column: 18, scope: !579)
!582 = !DILocation(line: 515, column: 16, scope: !579)
!583 = !DILocation(line: 515, column: 2, scope: !579)
!584 = !DILocation(line: 516, column: 26, scope: !580)
!585 = !DILocation(line: 516, column: 17, scope: !580)
!586 = !DILocation(line: 516, column: 10, scope: !580)
!587 = !DILocation(line: 516, column: 30, scope: !580)
!588 = !DILocation(line: 516, column: 7, scope: !580)
!589 = !DILocation(line: 516, column: 3, scope: !580)
!590 = !DILocation(line: 515, column: 29, scope: !591)
!591 = !DILexicalBlockFile(scope: !580, file: !263, discriminator: 2)
!592 = !DILocation(line: 515, column: 2, scope: !591)
!593 = distinct !{!593, !594}
!594 = !DILocation(line: 515, column: 2, scope: !558)
!595 = !DILocation(line: 518, column: 20, scope: !558)
!596 = !DILocation(line: 518, column: 13, scope: !558)
!597 = !DILocation(line: 518, column: 10, scope: !558)
!598 = !DILocation(line: 520, column: 9, scope: !599)
!599 = distinct !DILexicalBlock(scope: !558, file: !263, line: 520, column: 2)
!600 = !DILocation(line: 520, column: 18, scope: !599)
!601 = !DILocation(line: 520, column: 16, scope: !599)
!602 = !DILocation(line: 520, column: 7, scope: !599)
!603 = !DILocation(line: 520, column: 27, scope: !604)
!604 = !DILexicalBlockFile(scope: !605, file: !263, discriminator: 1)
!605 = distinct !DILexicalBlock(scope: !599, file: !263, line: 520, column: 2)
!606 = !DILocation(line: 520, column: 31, scope: !604)
!607 = !DILocation(line: 520, column: 29, scope: !604)
!608 = !DILocation(line: 520, column: 2, scope: !604)
!609 = !DILocation(line: 521, column: 16, scope: !605)
!610 = !DILocation(line: 521, column: 29, scope: !605)
!611 = !DILocation(line: 521, column: 52, scope: !605)
!612 = !DILocation(line: 521, column: 43, scope: !605)
!613 = !DILocation(line: 521, column: 8, scope: !605)
!614 = !DILocation(line: 521, column: 5, scope: !605)
!615 = !DILocation(line: 521, column: 3, scope: !605)
!616 = !DILocation(line: 520, column: 42, scope: !617)
!617 = !DILexicalBlockFile(scope: !605, file: !263, discriminator: 2)
!618 = !DILocation(line: 520, column: 2, scope: !617)
!619 = distinct !{!619, !620}
!620 = !DILocation(line: 520, column: 2, scope: !558)
!621 = !DILocation(line: 523, column: 30, scope: !558)
!622 = !DILocation(line: 523, column: 39, scope: !558)
!623 = !DILocation(line: 523, column: 2, scope: !558)
!624 = !DILocation(line: 525, column: 8, scope: !558)
!625 = !DILocation(line: 525, column: 3, scope: !558)
!626 = !DILocation(line: 525, column: 28, scope: !558)
!627 = !DILocation(line: 526, column: 1, scope: !558)
!628 = !DILocation(line: 526, column: 1, scope: !629)
!629 = !DILexicalBlockFile(scope: !558, file: !263, discriminator: 1)
!630 = distinct !DISubprogram(name: "log_options", scope: !263, file: !263, line: 481, type: !631, isLocal: true, isDefinition: true, scopeLine: 482, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !274, !274, !110}
!633 = !DILocalVariable(name: "option", arg: 1, scope: !630, file: !263, line: 481, type: !274)
!634 = !DILocation(line: 481, column: 25, scope: !630)
!635 = !DILocalVariable(name: "option_str", arg: 2, scope: !630, file: !263, line: 481, type: !274)
!636 = !DILocation(line: 481, column: 45, scope: !630)
!637 = !DILocalVariable(name: "indent", arg: 3, scope: !630, file: !263, line: 481, type: !110)
!638 = !DILocation(line: 481, column: 66, scope: !630)
!639 = !DILocalVariable(name: "p", scope: !630, file: !263, line: 483, type: !274)
!640 = !DILocation(line: 483, column: 14, scope: !630)
!641 = !DILocation(line: 483, column: 18, scope: !630)
!642 = !DILocalVariable(name: "opt_len", scope: !630, file: !263, line: 484, type: !172)
!643 = !DILocation(line: 484, column: 9, scope: !630)
!644 = !DILocation(line: 484, column: 26, scope: !630)
!645 = !DILocation(line: 484, column: 19, scope: !630)
!646 = !DILocalVariable(name: "end", scope: !630, file: !263, line: 485, type: !274)
!647 = !DILocation(line: 485, column: 14, scope: !630)
!648 = !DILocalVariable(name: "first_line", scope: !630, file: !263, line: 486, type: !260)
!649 = !DILocation(line: 486, column: 6, scope: !630)
!650 = !DILocation(line: 488, column: 2, scope: !630)
!651 = !DILocation(line: 488, column: 10, scope: !652)
!652 = !DILexicalBlockFile(scope: !630, file: !263, discriminator: 1)
!653 = !DILocation(line: 488, column: 9, scope: !652)
!654 = !DILocation(line: 488, column: 2, scope: !652)
!655 = !DILocation(line: 490, column: 3, scope: !656)
!656 = distinct !DILexicalBlock(scope: !630, file: !263, line: 488, column: 13)
!657 = !DILocation(line: 490, column: 11, scope: !658)
!658 = !DILexicalBlockFile(scope: !656, file: !263, discriminator: 1)
!659 = !DILocation(line: 490, column: 10, scope: !658)
!660 = !DILocation(line: 490, column: 13, scope: !658)
!661 = !DILocation(line: 490, column: 3, scope: !658)
!662 = !DILocation(line: 491, column: 5, scope: !656)
!663 = !DILocation(line: 490, column: 3, scope: !664)
!664 = !DILexicalBlockFile(scope: !656, file: !263, discriminator: 2)
!665 = distinct !{!665, !655}
!666 = !DILocation(line: 493, column: 17, scope: !656)
!667 = !DILocation(line: 493, column: 26, scope: !656)
!668 = !DILocation(line: 493, column: 24, scope: !656)
!669 = !DILocation(line: 493, column: 9, scope: !656)
!670 = !DILocation(line: 493, column: 7, scope: !656)
!671 = !DILocation(line: 494, column: 7, scope: !672)
!672 = distinct !DILexicalBlock(scope: !656, file: !263, line: 494, column: 7)
!673 = !DILocation(line: 494, column: 7, scope: !656)
!674 = !DILocation(line: 495, column: 40, scope: !675)
!675 = distinct !DILexicalBlock(scope: !672, file: !263, line: 494, column: 19)
!676 = !DILocation(line: 495, column: 52, scope: !675)
!677 = !DILocation(line: 495, column: 66, scope: !675)
!678 = !DILocation(line: 495, column: 72, scope: !675)
!679 = !DILocation(line: 495, column: 70, scope: !675)
!680 = !DILocation(line: 495, column: 60, scope: !675)
!681 = !DILocation(line: 495, column: 76, scope: !675)
!682 = !DILocation(line: 495, column: 4, scope: !675)
!683 = !DILocation(line: 496, column: 15, scope: !675)
!684 = !DILocation(line: 497, column: 3, scope: !675)
!685 = !DILocation(line: 499, column: 42, scope: !672)
!686 = !DILocation(line: 499, column: 51, scope: !672)
!687 = !DILocation(line: 499, column: 49, scope: !672)
!688 = !DILocation(line: 499, column: 59, scope: !672)
!689 = !DILocation(line: 499, column: 36, scope: !672)
!690 = !DILocation(line: 499, column: 75, scope: !672)
!691 = !DILocation(line: 499, column: 81, scope: !672)
!692 = !DILocation(line: 499, column: 79, scope: !672)
!693 = !DILocation(line: 499, column: 69, scope: !672)
!694 = !DILocation(line: 499, column: 85, scope: !672)
!695 = !DILocation(line: 499, column: 4, scope: !672)
!696 = !DILocation(line: 500, column: 7, scope: !656)
!697 = !DILocation(line: 500, column: 5, scope: !656)
!698 = !DILocation(line: 488, column: 2, scope: !699)
!699 = !DILexicalBlockFile(scope: !630, file: !263, discriminator: 2)
!700 = distinct !{!700, !650}
!701 = !DILocation(line: 502, column: 1, scope: !630)
!702 = distinct !DISubprogram(name: "report_child_status", scope: !263, file: !263, line: 530, type: !703, isLocal: false, isDefinition: true, scopeLine: 531, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!703 = !DISubroutineType(types: !704)
!704 = !{!260, !126, !236, !274}
!705 = !DILocalVariable(name: "status", arg: 1, scope: !702, file: !263, line: 530, type: !126)
!706 = !DILocation(line: 530, column: 25, scope: !702)
!707 = !DILocalVariable(name: "pid", arg: 2, scope: !702, file: !263, line: 530, type: !236)
!708 = !DILocation(line: 530, column: 39, scope: !702)
!709 = !DILocalVariable(name: "prog_name", arg: 3, scope: !702, file: !263, line: 530, type: !274)
!710 = !DILocation(line: 530, column: 56, scope: !702)
!711 = !DILocalVariable(name: "prog_id", scope: !702, file: !263, line: 532, type: !274)
!712 = !DILocation(line: 532, column: 14, scope: !702)
!713 = !DILocalVariable(name: "pid_buf", scope: !702, file: !263, line: 533, type: !714)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 96, align: 8, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 12)
!717 = !DILocation(line: 533, column: 7, scope: !702)
!718 = !DILocalVariable(name: "exit_status", scope: !702, file: !263, line: 534, type: !126)
!719 = !DILocation(line: 534, column: 6, scope: !702)
!720 = !DILocation(line: 536, column: 6, scope: !721)
!721 = distinct !DILexicalBlock(scope: !702, file: !263, line: 536, column: 6)
!722 = !DILocation(line: 536, column: 6, scope: !702)
!723 = !DILocation(line: 537, column: 13, scope: !721)
!724 = !DILocation(line: 537, column: 11, scope: !721)
!725 = !DILocation(line: 537, column: 3, scope: !721)
!726 = !DILocation(line: 538, column: 11, scope: !727)
!727 = distinct !DILexicalBlock(scope: !721, file: !263, line: 538, column: 11)
!728 = !DILocation(line: 538, column: 11, scope: !721)
!729 = !DILocation(line: 539, column: 13, scope: !727)
!730 = !DILocation(line: 539, column: 31, scope: !727)
!731 = !DILocation(line: 539, column: 11, scope: !727)
!732 = !DILocation(line: 539, column: 3, scope: !727)
!733 = !DILocation(line: 541, column: 7, scope: !734)
!734 = distinct !DILexicalBlock(scope: !702, file: !263, line: 541, column: 6)
!735 = !DILocation(line: 541, column: 6, scope: !702)
!736 = !DILocation(line: 542, column: 12, scope: !737)
!737 = distinct !DILexicalBlock(scope: !734, file: !263, line: 541, column: 16)
!738 = !DILocation(line: 542, column: 48, scope: !737)
!739 = !DILocation(line: 542, column: 3, scope: !737)
!740 = !DILocation(line: 543, column: 13, scope: !737)
!741 = !DILocation(line: 543, column: 11, scope: !737)
!742 = !DILocation(line: 544, column: 2, scope: !737)
!743 = !DILocation(line: 546, column: 25, scope: !744)
!744 = distinct !DILexicalBlock(scope: !702, file: !263, line: 546, column: 5)
!745 = !DILocation(line: 546, column: 5, scope: !744)
!746 = !DILocation(line: 546, column: 10, scope: !744)
!747 = !DILocation(line: 546, column: 17, scope: !744)
!748 = !DILocation(line: 546, column: 5, scope: !702)
!749 = !DILocation(line: 547, column: 36, scope: !750)
!750 = distinct !DILexicalBlock(scope: !744, file: !263, line: 546, column: 24)
!751 = !DILocation(line: 547, column: 16, scope: !750)
!752 = !DILocation(line: 547, column: 21, scope: !750)
!753 = !DILocation(line: 547, column: 28, scope: !750)
!754 = !DILocation(line: 547, column: 38, scope: !750)
!755 = !DILocation(line: 547, column: 15, scope: !750)
!756 = !DILocation(line: 550, column: 7, scope: !757)
!757 = distinct !DILexicalBlock(scope: !750, file: !263, line: 550, column: 7)
!758 = !DILocation(line: 550, column: 19, scope: !757)
!759 = !DILocation(line: 550, column: 25, scope: !757)
!760 = !DILocation(line: 551, column: 7, scope: !757)
!761 = !DILocation(line: 551, column: 19, scope: !757)
!762 = !DILocation(line: 550, column: 7, scope: !763)
!763 = !DILexicalBlockFile(scope: !750, file: !263, discriminator: 1)
!764 = !DILocation(line: 552, column: 75, scope: !765)
!765 = distinct !DILexicalBlock(scope: !757, file: !263, line: 551, column: 26)
!766 = !DILocation(line: 552, column: 84, scope: !765)
!767 = !DILocation(line: 552, column: 96, scope: !765)
!768 = !DILocation(line: 552, column: 4, scope: !765)
!769 = !DILocation(line: 553, column: 4, scope: !765)
!770 = !DILocation(line: 556, column: 7, scope: !771)
!771 = distinct !DILexicalBlock(scope: !750, file: !263, line: 556, column: 7)
!772 = !DILocation(line: 556, column: 19, scope: !771)
!773 = !DILocation(line: 556, column: 7, scope: !750)
!774 = !DILocation(line: 557, column: 53, scope: !771)
!775 = !DILocation(line: 557, column: 62, scope: !771)
!776 = !DILocation(line: 557, column: 4, scope: !771)
!777 = !DILocation(line: 558, column: 2, scope: !750)
!778 = !DILocation(line: 558, column: 32, scope: !779)
!779 = !DILexicalBlockFile(scope: !780, file: !263, discriminator: 1)
!780 = distinct !DILexicalBlock(scope: !744, file: !263, line: 558, column: 12)
!781 = !DILocation(line: 558, column: 12, scope: !779)
!782 = !DILocation(line: 558, column: 17, scope: !779)
!783 = !DILocation(line: 558, column: 24, scope: !779)
!784 = !DILocation(line: 558, column: 14, scope: !779)
!785 = !DILocation(line: 558, column: 37, scope: !779)
!786 = !DILocation(line: 558, column: 43, scope: !779)
!787 = !DILocation(line: 559, column: 26, scope: !788)
!788 = distinct !DILexicalBlock(scope: !789, file: !263, line: 559, column: 6)
!789 = distinct !DILexicalBlock(scope: !780, file: !263, line: 558, column: 33)
!790 = !DILocation(line: 559, column: 6, scope: !788)
!791 = !DILocation(line: 559, column: 11, scope: !788)
!792 = !DILocation(line: 559, column: 18, scope: !788)
!793 = !DILocation(line: 559, column: 23, scope: !788)
!794 = !DILocation(line: 559, column: 6, scope: !789)
!795 = !DILocalVariable(name: "uname_buf", scope: !796, file: !263, line: 560, type: !797)
!796 = distinct !DILexicalBlock(scope: !788, file: !263, line: 559, column: 35)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !798, line: 48, size: 3120, align: 8, elements: !799)
!798 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/utsname.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!799 = !{!800, !804, !805, !806, !807, !808}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !797, file: !798, line: 51, baseType: !801, size: 520, align: 8)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 520, align: 8, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 65)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !797, file: !798, line: 54, baseType: !801, size: 520, align: 8, offset: 520)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !797, file: !798, line: 57, baseType: !801, size: 520, align: 8, offset: 1040)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !797, file: !798, line: 59, baseType: !801, size: 520, align: 8, offset: 1560)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !797, file: !798, line: 62, baseType: !801, size: 520, align: 8, offset: 2080)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !797, file: !798, line: 67, baseType: !801, size: 520, align: 8, offset: 2600)
!809 = !DILocation(line: 560, column: 19, scope: !796)
!810 = !DILocation(line: 562, column: 75, scope: !796)
!811 = !DILocation(line: 562, column: 4, scope: !796)
!812 = !DILocation(line: 563, column: 4, scope: !796)
!813 = !DILocation(line: 564, column: 4, scope: !796)
!814 = !DILocation(line: 565, column: 4, scope: !796)
!815 = !DILocation(line: 566, column: 4, scope: !796)
!816 = !DILocation(line: 567, column: 4, scope: !796)
!817 = !DILocation(line: 568, column: 4, scope: !796)
!818 = !DILocation(line: 569, column: 4, scope: !796)
!819 = !DILocation(line: 570, column: 4, scope: !796)
!820 = !DILocation(line: 577, column: 4, scope: !796)
!821 = !DILocation(line: 581, column: 4, scope: !796)
!822 = !DILocation(line: 582, column: 60, scope: !796)
!823 = !DILocation(line: 582, column: 50, scope: !796)
!824 = !DILocation(line: 582, column: 79, scope: !796)
!825 = !DILocation(line: 582, column: 69, scope: !796)
!826 = !DILocation(line: 582, column: 98, scope: !796)
!827 = !DILocation(line: 582, column: 88, scope: !796)
!828 = !DILocation(line: 582, column: 4, scope: !796)
!829 = !DILocation(line: 583, column: 4, scope: !796)
!830 = !DILocation(line: 584, column: 4, scope: !796)
!831 = !DILocation(line: 585, column: 4, scope: !796)
!832 = !DILocation(line: 586, column: 4, scope: !796)
!833 = !DILocation(line: 590, column: 3, scope: !796)
!834 = !DILocation(line: 592, column: 55, scope: !788)
!835 = !DILocation(line: 592, column: 84, scope: !788)
!836 = !DILocation(line: 592, column: 64, scope: !788)
!837 = !DILocation(line: 592, column: 69, scope: !788)
!838 = !DILocation(line: 592, column: 76, scope: !788)
!839 = !DILocation(line: 592, column: 4, scope: !788)
!840 = !DILocation(line: 593, column: 2, scope: !789)
!841 = !DILocation(line: 595, column: 2, scope: !702)
!842 = !DILocation(line: 596, column: 1, scope: !702)
!843 = distinct !DISubprogram(name: "thread_make_master", scope: !263, file: !263, line: 748, type: !844, isLocal: false, isDefinition: true, scopeLine: 749, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!844 = !DISubroutineType(types: !845)
!845 = !{!65}
!846 = !DILocalVariable(name: "new", scope: !843, file: !263, line: 750, type: !65)
!847 = !DILocation(line: 750, column: 19, scope: !843)
!848 = !DILocation(line: 752, column: 29, scope: !843)
!849 = !DILocation(line: 752, column: 8, scope: !843)
!850 = !DILocation(line: 752, column: 6, scope: !843)
!851 = !DILocation(line: 755, column: 18, scope: !843)
!852 = !DILocation(line: 755, column: 2, scope: !843)
!853 = !DILocation(line: 755, column: 7, scope: !843)
!854 = !DILocation(line: 755, column: 16, scope: !843)
!855 = !DILocation(line: 759, column: 6, scope: !856)
!856 = distinct !DILexicalBlock(scope: !843, file: !263, line: 759, column: 6)
!857 = !DILocation(line: 759, column: 11, scope: !856)
!858 = !DILocation(line: 759, column: 20, scope: !856)
!859 = !DILocation(line: 759, column: 6, scope: !843)
!860 = !DILocation(line: 760, column: 3, scope: !861)
!861 = distinct !DILexicalBlock(scope: !856, file: !263, line: 759, column: 25)
!862 = !DILocation(line: 761, column: 9, scope: !861)
!863 = !DILocation(line: 761, column: 4, scope: !861)
!864 = !DILocation(line: 761, column: 21, scope: !861)
!865 = !DILocation(line: 762, column: 3, scope: !861)
!866 = !DILocation(line: 770, column: 2, scope: !843)
!867 = !DILocation(line: 770, column: 7, scope: !843)
!868 = !DILocation(line: 770, column: 31, scope: !843)
!869 = !DILocation(line: 770, column: 14, scope: !843)
!870 = !DILocation(line: 771, column: 2, scope: !843)
!871 = !DILocation(line: 771, column: 7, scope: !843)
!872 = !DILocation(line: 771, column: 32, scope: !843)
!873 = !DILocation(line: 771, column: 15, scope: !843)
!874 = !DILocation(line: 772, column: 2, scope: !843)
!875 = !DILocation(line: 772, column: 7, scope: !843)
!876 = !DILocation(line: 772, column: 32, scope: !843)
!877 = !DILocation(line: 772, column: 15, scope: !843)
!878 = !DILocation(line: 773, column: 2, scope: !843)
!879 = !DILocation(line: 773, column: 7, scope: !843)
!880 = !DILocation(line: 773, column: 32, scope: !843)
!881 = !DILocation(line: 773, column: 15, scope: !843)
!882 = !DILocation(line: 774, column: 2, scope: !843)
!883 = !DILocation(line: 774, column: 7, scope: !843)
!884 = !DILocation(line: 774, column: 36, scope: !843)
!885 = !DILocation(line: 774, column: 19, scope: !843)
!886 = !DILocation(line: 775, column: 2, scope: !843)
!887 = distinct !{!887, !886}
!888 = !DILocation(line: 775, column: 31, scope: !889)
!889 = !DILexicalBlockFile(scope: !890, file: !263, discriminator: 1)
!890 = distinct !DILexicalBlock(scope: !843, file: !263, line: 775, column: 5)
!891 = !DILocation(line: 775, column: 36, scope: !889)
!892 = !DILocation(line: 775, column: 9, scope: !889)
!893 = !DILocation(line: 775, column: 14, scope: !889)
!894 = !DILocation(line: 775, column: 22, scope: !889)
!895 = !DILocation(line: 775, column: 27, scope: !889)
!896 = !DILocation(line: 775, column: 68, scope: !889)
!897 = !DILocation(line: 775, column: 73, scope: !889)
!898 = !DILocation(line: 775, column: 46, scope: !889)
!899 = !DILocation(line: 775, column: 51, scope: !889)
!900 = !DILocation(line: 775, column: 59, scope: !889)
!901 = !DILocation(line: 775, column: 64, scope: !889)
!902 = !DILocation(line: 775, column: 81, scope: !889)
!903 = !DILocation(line: 779, column: 2, scope: !843)
!904 = distinct !{!904, !903}
!905 = !DILocation(line: 779, column: 31, scope: !906)
!906 = !DILexicalBlockFile(scope: !907, file: !263, discriminator: 1)
!907 = distinct !DILexicalBlock(scope: !843, file: !263, line: 779, column: 5)
!908 = !DILocation(line: 779, column: 36, scope: !906)
!909 = !DILocation(line: 779, column: 9, scope: !906)
!910 = !DILocation(line: 779, column: 14, scope: !906)
!911 = !DILocation(line: 779, column: 22, scope: !906)
!912 = !DILocation(line: 779, column: 27, scope: !906)
!913 = !DILocation(line: 779, column: 68, scope: !906)
!914 = !DILocation(line: 779, column: 73, scope: !906)
!915 = !DILocation(line: 779, column: 46, scope: !906)
!916 = !DILocation(line: 779, column: 51, scope: !906)
!917 = !DILocation(line: 779, column: 59, scope: !906)
!918 = !DILocation(line: 779, column: 64, scope: !906)
!919 = !DILocation(line: 779, column: 81, scope: !906)
!920 = !DILocation(line: 780, column: 2, scope: !843)
!921 = distinct !{!921, !920}
!922 = !DILocation(line: 780, column: 31, scope: !923)
!923 = !DILexicalBlockFile(scope: !924, file: !263, discriminator: 1)
!924 = distinct !DILexicalBlock(scope: !843, file: !263, line: 780, column: 5)
!925 = !DILocation(line: 780, column: 36, scope: !923)
!926 = !DILocation(line: 780, column: 9, scope: !923)
!927 = !DILocation(line: 780, column: 14, scope: !923)
!928 = !DILocation(line: 780, column: 22, scope: !923)
!929 = !DILocation(line: 780, column: 27, scope: !923)
!930 = !DILocation(line: 780, column: 68, scope: !923)
!931 = !DILocation(line: 780, column: 73, scope: !923)
!932 = !DILocation(line: 780, column: 46, scope: !923)
!933 = !DILocation(line: 780, column: 51, scope: !923)
!934 = !DILocation(line: 780, column: 59, scope: !923)
!935 = !DILocation(line: 780, column: 64, scope: !923)
!936 = !DILocation(line: 780, column: 81, scope: !923)
!937 = !DILocation(line: 783, column: 18, scope: !843)
!938 = !DILocation(line: 783, column: 2, scope: !843)
!939 = !DILocation(line: 783, column: 7, scope: !843)
!940 = !DILocation(line: 783, column: 16, scope: !843)
!941 = !DILocation(line: 790, column: 6, scope: !942)
!942 = distinct !DILexicalBlock(scope: !843, file: !263, line: 790, column: 6)
!943 = !DILocation(line: 790, column: 11, scope: !942)
!944 = !DILocation(line: 790, column: 20, scope: !942)
!945 = !DILocation(line: 790, column: 6, scope: !843)
!946 = !DILocation(line: 791, column: 3, scope: !947)
!947 = distinct !DILexicalBlock(scope: !942, file: !263, line: 790, column: 25)
!948 = !DILocation(line: 792, column: 9, scope: !947)
!949 = !DILocation(line: 792, column: 4, scope: !947)
!950 = !DILocation(line: 792, column: 21, scope: !947)
!951 = !DILocation(line: 793, column: 3, scope: !947)
!952 = !DILocation(line: 804, column: 2, scope: !843)
!953 = !DILocation(line: 806, column: 38, scope: !843)
!954 = !DILocation(line: 806, column: 72, scope: !843)
!955 = !DILocation(line: 806, column: 77, scope: !843)
!956 = !DILocation(line: 806, column: 22, scope: !843)
!957 = !DILocation(line: 806, column: 2, scope: !843)
!958 = !DILocation(line: 806, column: 7, scope: !843)
!959 = !DILocation(line: 806, column: 20, scope: !843)
!960 = !DILocation(line: 808, column: 25, scope: !843)
!961 = !DILocation(line: 808, column: 2, scope: !843)
!962 = !DILocation(line: 810, column: 9, scope: !843)
!963 = !DILocation(line: 810, column: 2, scope: !843)
!964 = !DILocation(line: 811, column: 1, scope: !843)
!965 = distinct !DISubprogram(name: "thread_add_read", scope: !263, file: !263, line: 1064, type: !966, isLocal: false, isDefinition: true, scopeLine: 1065, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!966 = !DISubroutineType(types: !967)
!967 = !{!202, !65, !968, !63, !126, !79}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!126, !202}
!971 = !DILocalVariable(name: "m", arg: 1, scope: !965, file: !263, line: 1064, type: !65)
!972 = !DILocation(line: 1064, column: 34, scope: !965)
!973 = !DILocalVariable(name: "func", arg: 2, scope: !965, file: !263, line: 1064, type: !968)
!974 = !DILocation(line: 1064, column: 43, scope: !965)
!975 = !DILocalVariable(name: "arg", arg: 3, scope: !965, file: !263, line: 1064, type: !63)
!976 = !DILocation(line: 1064, column: 69, scope: !965)
!977 = !DILocalVariable(name: "fd", arg: 4, scope: !965, file: !263, line: 1064, type: !126)
!978 = !DILocation(line: 1064, column: 78, scope: !965)
!979 = !DILocalVariable(name: "timer", arg: 5, scope: !965, file: !263, line: 1064, type: !79)
!980 = !DILocation(line: 1064, column: 96, scope: !965)
!981 = !DILocalVariable(name: "event", scope: !965, file: !263, line: 1066, type: !197)
!982 = !DILocation(line: 1066, column: 18, scope: !965)
!983 = !DILocalVariable(name: "thread", scope: !965, file: !263, line: 1067, type: !202)
!984 = !DILocation(line: 1067, column: 12, scope: !965)
!985 = !DILocation(line: 1072, column: 6, scope: !986)
!986 = distinct !DILexicalBlock(scope: !965, file: !263, line: 1072, column: 6)
!987 = !DILocation(line: 1072, column: 9, scope: !986)
!988 = !DILocation(line: 1072, column: 23, scope: !986)
!989 = !DILocation(line: 1072, column: 26, scope: !990)
!990 = !DILexicalBlockFile(scope: !986, file: !263, discriminator: 1)
!991 = !DILocation(line: 1072, column: 29, scope: !990)
!992 = !DILocation(line: 1072, column: 44, scope: !990)
!993 = !DILocation(line: 1072, column: 50, scope: !990)
!994 = !DILocation(line: 1072, column: 47, scope: !990)
!995 = !DILocation(line: 1072, column: 6, scope: !990)
!996 = !DILocation(line: 1073, column: 11, scope: !986)
!997 = !DILocation(line: 1073, column: 14, scope: !986)
!998 = !DILocation(line: 1073, column: 9, scope: !986)
!999 = !DILocation(line: 1073, column: 3, scope: !986)
!1000 = !DILocation(line: 1075, column: 28, scope: !986)
!1001 = !DILocation(line: 1075, column: 31, scope: !986)
!1002 = !DILocation(line: 1075, column: 11, scope: !986)
!1003 = !DILocation(line: 1075, column: 9, scope: !986)
!1004 = !DILocation(line: 1077, column: 7, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !965, file: !263, line: 1077, column: 6)
!1006 = !DILocation(line: 1077, column: 6, scope: !965)
!1007 = !DILocation(line: 1078, column: 34, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !263, line: 1078, column: 7)
!1009 = distinct !DILexicalBlock(scope: !1005, file: !263, line: 1077, column: 14)
!1010 = !DILocation(line: 1078, column: 37, scope: !1008)
!1011 = !DILocation(line: 1078, column: 17, scope: !1008)
!1012 = !DILocation(line: 1078, column: 15, scope: !1008)
!1013 = !DILocation(line: 1078, column: 7, scope: !1009)
!1014 = !DILocation(line: 1079, column: 80, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1008, file: !263, line: 1078, column: 43)
!1016 = !DILocation(line: 1079, column: 4, scope: !1015)
!1017 = !DILocation(line: 1080, column: 4, scope: !1015)
!1018 = !DILocation(line: 1082, column: 2, scope: !1009)
!1019 = !DILocation(line: 1083, column: 43, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1005, file: !263, line: 1083, column: 11)
!1021 = !DILocation(line: 1083, column: 50, scope: !1020)
!1022 = !DILocation(line: 1083, column: 11, scope: !1020)
!1023 = !DILocation(line: 1083, column: 57, scope: !1020)
!1024 = !DILocation(line: 1083, column: 60, scope: !1025)
!1025 = !DILexicalBlockFile(scope: !1020, file: !263, discriminator: 1)
!1026 = !DILocation(line: 1083, column: 67, scope: !1025)
!1027 = !DILocation(line: 1083, column: 11, scope: !1025)
!1028 = !DILocation(line: 1084, column: 101, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1020, file: !263, line: 1083, column: 73)
!1030 = !DILocation(line: 1084, column: 108, scope: !1029)
!1031 = !DILocation(line: 1084, column: 115, scope: !1029)
!1032 = !DILocation(line: 1084, column: 121, scope: !1029)
!1033 = !DILocation(line: 1084, column: 3, scope: !1029)
!1034 = !DILocation(line: 1085, column: 3, scope: !1029)
!1035 = !DILocation(line: 1088, column: 22, scope: !965)
!1036 = !DILocation(line: 1088, column: 11, scope: !965)
!1037 = !DILocation(line: 1088, column: 9, scope: !965)
!1038 = !DILocation(line: 1089, column: 2, scope: !965)
!1039 = !DILocation(line: 1089, column: 10, scope: !965)
!1040 = !DILocation(line: 1089, column: 15, scope: !965)
!1041 = !DILocation(line: 1090, column: 19, scope: !965)
!1042 = !DILocation(line: 1090, column: 2, scope: !965)
!1043 = !DILocation(line: 1090, column: 10, scope: !965)
!1044 = !DILocation(line: 1090, column: 17, scope: !965)
!1045 = !DILocation(line: 1091, column: 17, scope: !965)
!1046 = !DILocation(line: 1091, column: 2, scope: !965)
!1047 = !DILocation(line: 1091, column: 10, scope: !965)
!1048 = !DILocation(line: 1091, column: 15, scope: !965)
!1049 = !DILocation(line: 1092, column: 16, scope: !965)
!1050 = !DILocation(line: 1092, column: 2, scope: !965)
!1051 = !DILocation(line: 1092, column: 10, scope: !965)
!1052 = !DILocation(line: 1092, column: 14, scope: !965)
!1053 = !DILocation(line: 1093, column: 17, scope: !965)
!1054 = !DILocation(line: 1093, column: 2, scope: !965)
!1055 = !DILocation(line: 1093, column: 10, scope: !965)
!1056 = !DILocation(line: 1093, column: 12, scope: !965)
!1057 = !DILocation(line: 1093, column: 15, scope: !965)
!1058 = !DILocation(line: 1094, column: 18, scope: !965)
!1059 = !DILocation(line: 1094, column: 2, scope: !965)
!1060 = !DILocation(line: 1094, column: 10, scope: !965)
!1061 = !DILocation(line: 1094, column: 16, scope: !965)
!1062 = !DILocation(line: 1097, column: 33, scope: !965)
!1063 = !DILocation(line: 1097, column: 40, scope: !965)
!1064 = !DILocation(line: 1097, column: 2, scope: !965)
!1065 = !DILocation(line: 1098, column: 16, scope: !965)
!1066 = !DILocation(line: 1098, column: 2, scope: !965)
!1067 = !DILocation(line: 1098, column: 9, scope: !965)
!1068 = !DILocation(line: 1098, column: 14, scope: !965)
!1069 = !DILocation(line: 1099, column: 45, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !965, file: !263, line: 1099, column: 6)
!1071 = !DILocation(line: 1099, column: 52, scope: !1070)
!1072 = !DILocation(line: 1099, column: 7, scope: !1070)
!1073 = !DILocation(line: 1099, column: 6, scope: !965)
!1074 = !DILocation(line: 1100, column: 24, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1076, file: !263, line: 1100, column: 7)
!1076 = distinct !DILexicalBlock(scope: !1070, file: !263, line: 1099, column: 60)
!1077 = !DILocation(line: 1100, column: 7, scope: !1075)
!1078 = !DILocation(line: 1100, column: 32, scope: !1075)
!1079 = !DILocation(line: 1100, column: 7, scope: !1076)
!1080 = !DILocation(line: 1101, column: 80, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1075, file: !263, line: 1100, column: 37)
!1082 = !DILocation(line: 1101, column: 4, scope: !1081)
!1083 = !DILocation(line: 1102, column: 21, scope: !1081)
!1084 = !DILocation(line: 1102, column: 24, scope: !1081)
!1085 = !DILocation(line: 1102, column: 4, scope: !1081)
!1086 = !DILocation(line: 1103, column: 4, scope: !1081)
!1087 = !DILocation(line: 1105, column: 40, scope: !1076)
!1088 = !DILocation(line: 1105, column: 47, scope: !1076)
!1089 = !DILocation(line: 1105, column: 3, scope: !1076)
!1090 = !DILocation(line: 1106, column: 2, scope: !1076)
!1091 = !DILocation(line: 1109, column: 6, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !965, file: !263, line: 1109, column: 6)
!1093 = !DILocation(line: 1109, column: 12, scope: !1092)
!1094 = !DILocation(line: 1109, column: 6, scope: !965)
!1095 = !DILocation(line: 1110, column: 3, scope: !1092)
!1096 = !DILocation(line: 1110, column: 11, scope: !1092)
!1097 = !DILocation(line: 1110, column: 17, scope: !1092)
!1098 = !DILocation(line: 1110, column: 24, scope: !1092)
!1099 = !DILocation(line: 1112, column: 3, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1092, file: !263, line: 1111, column: 7)
!1101 = !DILocation(line: 1113, column: 3, scope: !1100)
!1102 = !DILocation(line: 1113, column: 11, scope: !1100)
!1103 = !DILocation(line: 1113, column: 44, scope: !1100)
!1104 = !DILocation(line: 1113, column: 19, scope: !1100)
!1105 = !DILocation(line: 1113, column: 19, scope: !1106)
!1106 = !DILexicalBlockFile(scope: !1100, file: !263, discriminator: 1)
!1107 = !DILocalVariable(name: "__n", scope: !1108, file: !263, line: 1117, type: !1109)
!1108 = distinct !DILexicalBlock(scope: !965, file: !263, line: 1117, column: 3)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!1111 = !DILocation(line: 1117, column: 17, scope: !1108)
!1112 = !DILocation(line: 1117, column: 26, scope: !1108)
!1113 = !DILocation(line: 1117, column: 29, scope: !1108)
!1114 = !DILocation(line: 1117, column: 36, scope: !1108)
!1115 = !DILocalVariable(name: "__parent", scope: !1108, file: !263, line: 1117, type: !1110)
!1116 = !DILocation(line: 1117, column: 46, scope: !1108)
!1117 = !DILocalVariable(name: "__data", scope: !1108, file: !263, line: 1117, type: !202)
!1118 = !DILocation(line: 1117, column: 18, scope: !1108)
!1119 = !DILocation(line: 1117, column: 34, scope: !1120)
!1120 = !DILexicalBlockFile(scope: !1108, file: !263, discriminator: 1)
!1121 = !DILocation(line: 1117, column: 33, scope: !1120)
!1122 = !DILocation(line: 1117, column: 26, scope: !1120)
!1123 = !DILocation(line: 1117, column: 52, scope: !1124)
!1124 = !DILexicalBlockFile(scope: !1125, file: !263, discriminator: 2)
!1125 = distinct !DILexicalBlock(scope: !1108, file: !263, line: 1117, column: 39)
!1126 = !DILocation(line: 1117, column: 51, scope: !1124)
!1127 = !DILocation(line: 1117, column: 50, scope: !1124)
!1128 = !DILocalVariable(name: "__mptr", scope: !1129, file: !263, line: 1117, type: !1130)
!1129 = distinct !DILexicalBlock(scope: !1125, file: !263, line: 1117, column: 60)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !246)
!1132 = !DILocation(line: 1117, column: 105, scope: !1129)
!1133 = !DILocation(line: 1117, column: 116, scope: !1134)
!1134 = !DILexicalBlockFile(scope: !1129, file: !263, discriminator: 3)
!1135 = !DILocation(line: 1117, column: 115, scope: !1134)
!1136 = !DILocation(line: 1117, column: 105, scope: !1134)
!1137 = !DILocation(line: 1117, column: 151, scope: !1134)
!1138 = !DILocation(line: 1117, column: 143, scope: !1134)
!1139 = !DILocation(line: 1117, column: 158, scope: !1134)
!1140 = !DILocation(line: 1117, column: 122, scope: !1134)
!1141 = !DILocation(line: 1117, column: 62, scope: !1134)
!1142 = !DILocation(line: 1117, column: 3, scope: !1134)
!1143 = !DILocation(line: 1117, column: 50, scope: !1134)
!1144 = !DILocation(line: 1117, column: 50, scope: !1145)
!1145 = !DILexicalBlockFile(scope: !1125, file: !263, discriminator: 4)
!1146 = !DILocation(line: 1117, column: 50, scope: !1147)
!1147 = !DILexicalBlockFile(scope: !1125, file: !263, discriminator: 5)
!1148 = !DILocation(line: 1117, column: 48, scope: !1147)
!1149 = !DILocalVariable(name: "__cmp", scope: !1125, file: !263, line: 1117, type: !126)
!1150 = !DILocation(line: 1117, column: 7, scope: !1125)
!1151 = !DILocation(line: 1117, column: 32, scope: !1147)
!1152 = !DILocation(line: 1117, column: 40, scope: !1147)
!1153 = !DILocation(line: 1117, column: 15, scope: !1147)
!1154 = !DILocation(line: 1117, column: 7, scope: !1147)
!1155 = !DILocation(line: 1117, column: 61, scope: !1147)
!1156 = !DILocation(line: 1117, column: 60, scope: !1147)
!1157 = !DILocation(line: 1117, column: 58, scope: !1147)
!1158 = !DILocation(line: 1117, column: 70, scope: !1147)
!1159 = !DILocation(line: 1117, column: 76, scope: !1147)
!1160 = !DILocation(line: 1117, column: 92, scope: !1161)
!1161 = !DILexicalBlockFile(scope: !1162, file: !263, discriminator: 6)
!1162 = distinct !DILexicalBlock(scope: !1125, file: !263, line: 1117, column: 70)
!1163 = !DILocation(line: 1117, column: 91, scope: !1161)
!1164 = !DILocation(line: 1117, column: 98, scope: !1161)
!1165 = !DILocation(line: 1117, column: 86, scope: !1161)
!1166 = !DILocation(line: 1117, column: 82, scope: !1161)
!1167 = !DILocation(line: 1117, column: 117, scope: !1168)
!1168 = !DILexicalBlockFile(scope: !1169, file: !263, discriminator: 7)
!1169 = distinct !DILexicalBlock(scope: !1162, file: !263, line: 1117, column: 117)
!1170 = !DILocation(line: 1117, column: 123, scope: !1168)
!1171 = !DILocation(line: 1117, column: 138, scope: !1172)
!1172 = !DILexicalBlockFile(scope: !1169, file: !263, discriminator: 8)
!1173 = !DILocation(line: 1117, column: 137, scope: !1172)
!1174 = !DILocation(line: 1117, column: 144, scope: !1172)
!1175 = !DILocation(line: 1117, column: 132, scope: !1172)
!1176 = !DILocation(line: 1117, column: 128, scope: !1172)
!1177 = !DILocation(line: 1117, column: 26, scope: !1178)
!1178 = !DILexicalBlockFile(scope: !1108, file: !263, discriminator: 9)
!1179 = distinct !{!1179, !1112}
!1180 = !DILocation(line: 1117, column: 173, scope: !1181)
!1181 = !DILexicalBlockFile(scope: !1108, file: !263, discriminator: 10)
!1182 = !DILocation(line: 1117, column: 182, scope: !1181)
!1183 = !DILocation(line: 1117, column: 186, scope: !1181)
!1184 = !DILocation(line: 1117, column: 196, scope: !1181)
!1185 = !DILocation(line: 1117, column: 157, scope: !1181)
!1186 = !DILocation(line: 1117, column: 221, scope: !1181)
!1187 = !DILocation(line: 1117, column: 230, scope: !1181)
!1188 = !DILocation(line: 1117, column: 235, scope: !1181)
!1189 = !DILocation(line: 1117, column: 238, scope: !1181)
!1190 = !DILocation(line: 1117, column: 202, scope: !1191)
!1191 = !DILexicalBlockFile(scope: !1181, file: !263, discriminator: 11)
!1192 = !DILocation(line: 1119, column: 9, scope: !965)
!1193 = !DILocation(line: 1119, column: 2, scope: !965)
!1194 = !DILocation(line: 1120, column: 1, scope: !965)
!1195 = distinct !DISubprogram(name: "thread_timerfd_handler", scope: !263, file: !263, line: 308, type: !969, isLocal: true, isDefinition: true, scopeLine: 309, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!1196 = !DILocalVariable(name: "thread", arg: 1, scope: !1195, file: !263, line: 308, type: !202)
!1197 = !DILocation(line: 308, column: 34, scope: !1195)
!1198 = !DILocalVariable(name: "m", scope: !1195, file: !263, line: 310, type: !65)
!1199 = !DILocation(line: 310, column: 19, scope: !1195)
!1200 = !DILocation(line: 310, column: 23, scope: !1195)
!1201 = !DILocation(line: 310, column: 31, scope: !1195)
!1202 = !DILocalVariable(name: "expired", scope: !1195, file: !263, line: 311, type: !195)
!1203 = !DILocation(line: 311, column: 11, scope: !1195)
!1204 = !DILocalVariable(name: "len", scope: !1195, file: !263, line: 312, type: !1205)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !1206, line: 109, baseType: !1207)
!1206 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !153, line: 172, baseType: !154)
!1208 = !DILocation(line: 312, column: 10, scope: !1195)
!1209 = !DILocation(line: 314, column: 13, scope: !1195)
!1210 = !DILocation(line: 314, column: 16, scope: !1195)
!1211 = !DILocation(line: 314, column: 26, scope: !1195)
!1212 = !DILocation(line: 314, column: 8, scope: !1195)
!1213 = !DILocation(line: 314, column: 6, scope: !1195)
!1214 = !DILocation(line: 315, column: 6, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1195, file: !263, line: 315, column: 6)
!1216 = !DILocation(line: 315, column: 10, scope: !1215)
!1217 = !DILocation(line: 315, column: 6, scope: !1195)
!1218 = !DILocation(line: 316, column: 73, scope: !1215)
!1219 = !DILocation(line: 316, column: 76, scope: !1215)
!1220 = !DILocation(line: 316, column: 3, scope: !1215)
!1221 = !DILocation(line: 319, column: 23, scope: !1195)
!1222 = !DILocation(line: 319, column: 27, scope: !1195)
!1223 = !DILocation(line: 319, column: 30, scope: !1195)
!1224 = !DILocation(line: 319, column: 2, scope: !1195)
!1225 = !DILocation(line: 320, column: 23, scope: !1195)
!1226 = !DILocation(line: 320, column: 27, scope: !1195)
!1227 = !DILocation(line: 320, column: 30, scope: !1195)
!1228 = !DILocation(line: 320, column: 2, scope: !1195)
!1229 = !DILocation(line: 321, column: 23, scope: !1195)
!1230 = !DILocation(line: 321, column: 27, scope: !1195)
!1231 = !DILocation(line: 321, column: 30, scope: !1195)
!1232 = !DILocation(line: 321, column: 2, scope: !1195)
!1233 = !DILocation(line: 322, column: 23, scope: !1195)
!1234 = !DILocation(line: 322, column: 27, scope: !1195)
!1235 = !DILocation(line: 322, column: 30, scope: !1195)
!1236 = !DILocation(line: 322, column: 2, scope: !1195)
!1237 = !DILocation(line: 325, column: 36, scope: !1195)
!1238 = !DILocation(line: 325, column: 68, scope: !1195)
!1239 = !DILocation(line: 325, column: 71, scope: !1195)
!1240 = !DILocation(line: 325, column: 20, scope: !1195)
!1241 = !DILocation(line: 325, column: 2, scope: !1195)
!1242 = !DILocation(line: 325, column: 5, scope: !1195)
!1243 = !DILocation(line: 325, column: 18, scope: !1195)
!1244 = !DILocation(line: 327, column: 2, scope: !1195)
!1245 = distinct !DISubprogram(name: "thread_cleanup_master", scope: !263, file: !263, line: 972, type: !1246, isLocal: false, isDefinition: true, scopeLine: 973, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{null, !65}
!1248 = !DILocalVariable(name: "m", arg: 1, scope: !1245, file: !263, line: 972, type: !65)
!1249 = !DILocation(line: 972, column: 41, scope: !1245)
!1250 = !DILocation(line: 975, column: 20, scope: !1245)
!1251 = !DILocation(line: 975, column: 24, scope: !1245)
!1252 = !DILocation(line: 975, column: 27, scope: !1245)
!1253 = !DILocation(line: 975, column: 2, scope: !1245)
!1254 = !DILocation(line: 976, column: 20, scope: !1245)
!1255 = !DILocation(line: 976, column: 24, scope: !1245)
!1256 = !DILocation(line: 976, column: 27, scope: !1245)
!1257 = !DILocation(line: 976, column: 2, scope: !1245)
!1258 = !DILocation(line: 977, column: 20, scope: !1245)
!1259 = !DILocation(line: 977, column: 24, scope: !1245)
!1260 = !DILocation(line: 977, column: 27, scope: !1245)
!1261 = !DILocation(line: 977, column: 2, scope: !1245)
!1262 = !DILocation(line: 978, column: 20, scope: !1245)
!1263 = !DILocation(line: 978, column: 24, scope: !1245)
!1264 = !DILocation(line: 978, column: 27, scope: !1245)
!1265 = !DILocation(line: 978, column: 2, scope: !1245)
!1266 = !DILocation(line: 979, column: 22, scope: !1245)
!1267 = !DILocation(line: 979, column: 26, scope: !1245)
!1268 = !DILocation(line: 979, column: 29, scope: !1245)
!1269 = !DILocation(line: 979, column: 2, scope: !1245)
!1270 = !DILocation(line: 983, column: 22, scope: !1245)
!1271 = !DILocation(line: 983, column: 26, scope: !1245)
!1272 = !DILocation(line: 983, column: 29, scope: !1245)
!1273 = !DILocation(line: 983, column: 2, scope: !1245)
!1274 = !DILocation(line: 985, column: 2, scope: !1245)
!1275 = !DILocation(line: 988, column: 21, scope: !1245)
!1276 = !DILocation(line: 988, column: 2, scope: !1245)
!1277 = !DILocation(line: 990, column: 8, scope: !1245)
!1278 = !DILocation(line: 990, column: 11, scope: !1245)
!1279 = !DILocation(line: 990, column: 3, scope: !1245)
!1280 = !DILocation(line: 990, column: 27, scope: !1245)
!1281 = !DILocation(line: 990, column: 30, scope: !1245)
!1282 = !DILocation(line: 990, column: 44, scope: !1245)
!1283 = !DILocation(line: 991, column: 2, scope: !1245)
!1284 = !DILocation(line: 991, column: 5, scope: !1245)
!1285 = !DILocation(line: 991, column: 16, scope: !1245)
!1286 = !DILocation(line: 992, column: 2, scope: !1245)
!1287 = !DILocation(line: 992, column: 5, scope: !1245)
!1288 = !DILocation(line: 992, column: 17, scope: !1245)
!1289 = !DILocation(line: 994, column: 2, scope: !1245)
!1290 = !DILocation(line: 994, column: 5, scope: !1245)
!1291 = !DILocation(line: 994, column: 18, scope: !1245)
!1292 = !DILocation(line: 1001, column: 1, scope: !1245)
!1293 = distinct !DISubprogram(name: "thread_destroy_rb", scope: !263, file: !263, line: 953, type: !1294, isLocal: true, isDefinition: true, scopeLine: 954, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{null, !65, !1296}
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!1297 = !DILocalVariable(name: "m", arg: 1, scope: !1293, file: !263, line: 953, type: !65)
!1298 = !DILocation(line: 953, column: 36, scope: !1293)
!1299 = !DILocalVariable(name: "root", arg: 2, scope: !1293, file: !263, line: 953, type: !1296)
!1300 = !DILocation(line: 953, column: 50, scope: !1293)
!1301 = !DILocalVariable(name: "thread", scope: !1293, file: !263, line: 955, type: !202)
!1302 = !DILocation(line: 955, column: 12, scope: !1293)
!1303 = !DILocalVariable(name: "thread_tmp", scope: !1293, file: !263, line: 955, type: !202)
!1304 = !DILocation(line: 955, column: 21, scope: !1293)
!1305 = !DILocation(line: 957, column: 26, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1293, file: !263, line: 957, column: 2)
!1307 = !DILocation(line: 957, column: 17, scope: !1306)
!1308 = !DILocation(line: 957, column: 16, scope: !1306)
!1309 = !DILocalVariable(name: "__mptr", scope: !1310, file: !263, line: 957, type: !1130)
!1310 = distinct !DILexicalBlock(scope: !1306, file: !263, line: 957, column: 36)
!1311 = !DILocation(line: 957, column: 81, scope: !1310)
!1312 = !DILocation(line: 957, column: 100, scope: !1313)
!1313 = !DILexicalBlockFile(scope: !1310, file: !263, discriminator: 1)
!1314 = !DILocation(line: 957, column: 91, scope: !1313)
!1315 = !DILocation(line: 957, column: 81, scope: !1313)
!1316 = !DILocation(line: 957, column: 137, scope: !1313)
!1317 = !DILocation(line: 957, column: 129, scope: !1313)
!1318 = !DILocation(line: 957, column: 144, scope: !1313)
!1319 = !DILocation(line: 957, column: 108, scope: !1313)
!1320 = !DILocation(line: 957, column: 38, scope: !1313)
!1321 = !DILocation(line: 957, column: 3, scope: !1313)
!1322 = !DILocation(line: 957, column: 16, scope: !1313)
!1323 = !DILocation(line: 957, column: 16, scope: !1324)
!1324 = !DILexicalBlockFile(scope: !1306, file: !263, discriminator: 2)
!1325 = !DILocation(line: 957, column: 16, scope: !1326)
!1326 = !DILexicalBlockFile(scope: !1306, file: !263, discriminator: 3)
!1327 = !DILocation(line: 957, column: 14, scope: !1326)
!1328 = !DILocation(line: 957, column: 7, scope: !1326)
!1329 = !DILocation(line: 957, column: 3, scope: !1330)
!1330 = !DILexicalBlockFile(scope: !1331, file: !263, discriminator: 4)
!1331 = distinct !DILexicalBlock(scope: !1306, file: !263, line: 957, column: 2)
!1332 = !DILocation(line: 957, column: 10, scope: !1330)
!1333 = !DILocation(line: 957, column: 37, scope: !1334)
!1334 = !DILexicalBlockFile(scope: !1331, file: !263, discriminator: 5)
!1335 = !DILocation(line: 957, column: 45, scope: !1334)
!1336 = !DILocation(line: 957, column: 28, scope: !1334)
!1337 = !DILocation(line: 957, column: 27, scope: !1334)
!1338 = !DILocalVariable(name: "__mptr", scope: !1339, file: !263, line: 957, type: !1130)
!1339 = distinct !DILexicalBlock(scope: !1331, file: !263, line: 957, column: 52)
!1340 = !DILocation(line: 957, column: 101, scope: !1339)
!1341 = !DILocation(line: 957, column: 120, scope: !1342)
!1342 = !DILexicalBlockFile(scope: !1339, file: !263, discriminator: 6)
!1343 = !DILocation(line: 957, column: 128, scope: !1342)
!1344 = !DILocation(line: 957, column: 111, scope: !1342)
!1345 = !DILocation(line: 957, column: 101, scope: !1342)
!1346 = !DILocation(line: 957, column: 166, scope: !1342)
!1347 = !DILocation(line: 957, column: 158, scope: !1342)
!1348 = !DILocation(line: 957, column: 173, scope: !1342)
!1349 = !DILocation(line: 957, column: 133, scope: !1342)
!1350 = !DILocation(line: 957, column: 54, scope: !1342)
!1351 = !DILocation(line: 957, column: 3, scope: !1342)
!1352 = !DILocation(line: 957, column: 27, scope: !1342)
!1353 = !DILocation(line: 957, column: 27, scope: !1354)
!1354 = !DILexicalBlockFile(scope: !1331, file: !263, discriminator: 7)
!1355 = !DILocation(line: 957, column: 27, scope: !1356)
!1356 = !DILexicalBlockFile(scope: !1331, file: !263, discriminator: 8)
!1357 = !DILocation(line: 957, column: 25, scope: !1356)
!1358 = !DILocation(line: 957, column: 2, scope: !1359)
!1359 = !DILexicalBlockFile(scope: !1306, file: !263, discriminator: 9)
!1360 = !DILocation(line: 958, column: 13, scope: !1361)
!1361 = distinct !DILexicalBlock(scope: !1331, file: !263, line: 957, column: 28)
!1362 = !DILocation(line: 958, column: 21, scope: !1361)
!1363 = !DILocation(line: 958, column: 24, scope: !1361)
!1364 = !DILocation(line: 958, column: 3, scope: !1361)
!1365 = !DILocation(line: 961, column: 7, scope: !1366)
!1366 = distinct !DILexicalBlock(scope: !1361, file: !263, line: 961, column: 7)
!1367 = !DILocation(line: 961, column: 15, scope: !1366)
!1368 = !DILocation(line: 961, column: 20, scope: !1366)
!1369 = !DILocation(line: 961, column: 7, scope: !1361)
!1370 = !DILocation(line: 962, column: 20, scope: !1366)
!1371 = !DILocation(line: 962, column: 4, scope: !1366)
!1372 = !DILocation(line: 963, column: 12, scope: !1373)
!1373 = distinct !DILexicalBlock(scope: !1366, file: !263, line: 963, column: 12)
!1374 = !DILocation(line: 963, column: 20, scope: !1373)
!1375 = !DILocation(line: 963, column: 25, scope: !1373)
!1376 = !DILocation(line: 963, column: 12, scope: !1366)
!1377 = !DILocation(line: 964, column: 21, scope: !1373)
!1378 = !DILocation(line: 964, column: 4, scope: !1373)
!1379 = !DILocation(line: 966, column: 20, scope: !1361)
!1380 = !DILocation(line: 966, column: 23, scope: !1361)
!1381 = !DILocation(line: 966, column: 3, scope: !1361)
!1382 = !DILocation(line: 967, column: 2, scope: !1361)
!1383 = !DILocation(line: 957, column: 16, scope: !1384)
