; ModuleID = './[inter]lib--parser.o.i'
source_filename = "./[inter]lib--parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._vector = type { i32, i32, i8** }
%struct._defs = type { i8*, i64, i8*, i64, i8, i8* ()* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._keyword = type { i8*, void (%struct._vector*)*, %struct._vector*, void ()*, i8 }
%struct.glob_t = type { i64, i8**, i64, i32, void (i8*)*, %struct.dirent* (i8*)*, i8* (i8*)*, i32 (i8*, %struct.stat*)*, i32 (i8*, %struct.stat*)* }
%struct.dirent = type opaque
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [7 x i8] c" \09\0C\0A\0D\0B\00", align 1
@WHITE_SPACE = global i8* getelementptr inbounds ([7 x i8], [7 x i8]* @.str, i32 0, i32 0), align 8
@current_file_name = internal global i8* null, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !49, globals: !86)
!1 = !DIFile(filename: "[inter]lib--parser.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!2 = !{!3, !19, !34}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "parser.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!6 = !DIEnumerator(name: "CONFIG_OK", value: 0)
!7 = !DIEnumerator(name: "CONFIG_FILE_NOT_FOUND", value: 1)
!8 = !DIEnumerator(name: "CONFIG_BAD_IF", value: 2)
!9 = !DIEnumerator(name: "CONFIG_FATAL", value: 3)
!10 = !DIEnumerator(name: "CONFIG_MULTIPLE_FILES", value: 4)
!11 = !DIEnumerator(name: "CONFIG_UNKNOWN_KEYWORD", value: 5)
!12 = !DIEnumerator(name: "CONFIG_UNEXPECTED_BOB", value: 6)
!13 = !DIEnumerator(name: "CONFIG_MISSING_BOB", value: 7)
!14 = !DIEnumerator(name: "CONFIG_UNMATCHED_QUOTE", value: 8)
!15 = !DIEnumerator(name: "CONFIG_MISSING_PARAMETER", value: 9)
!16 = !DIEnumerator(name: "CONFIG_INVALID_NUMBER", value: 10)
!17 = !DIEnumerator(name: "CONFIG_GENERAL_ERROR", value: 11)
!18 = !DIEnumerator(name: "CONFIG_SECURITY_ERROR", value: 12)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "global_bits", file: !20, line: 53, size: 32, align: 32, elements: !21)
!20 = !DIFile(filename: "bitops.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!21 = !{!22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33}
!22 = !DIEnumerator(name: "LOG_CONSOLE_BIT", value: 0)
!23 = !DIEnumerator(name: "NO_SYSLOG_BIT", value: 1)
!24 = !DIEnumerator(name: "DONT_FORK_BIT", value: 2)
!25 = !DIEnumerator(name: "DUMP_CONF_BIT", value: 3)
!26 = !DIEnumerator(name: "DONT_RELEASE_VRRP_BIT", value: 4)
!27 = !DIEnumerator(name: "RELEASE_VIPS_BIT", value: 5)
!28 = !DIEnumerator(name: "DONT_RELEASE_IPVS_BIT", value: 6)
!29 = !DIEnumerator(name: "LOG_DETAIL_BIT", value: 7)
!30 = !DIEnumerator(name: "LOG_EXTRA_DETAIL_BIT", value: 8)
!31 = !DIEnumerator(name: "DONT_RESPAWN_BIT", value: 9)
!32 = !DIEnumerator(name: "LOG_ADDRESS_CHANGES", value: 10)
!33 = !DIEnumerator(name: "CONFIG_TEST_BIT", value: 11)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 46, size: 32, align: 32, elements: !36)
!35 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!37 = !DIEnumerator(name: "_ISupper", value: 256)
!38 = !DIEnumerator(name: "_ISlower", value: 512)
!39 = !DIEnumerator(name: "_ISalpha", value: 1024)
!40 = !DIEnumerator(name: "_ISdigit", value: 2048)
!41 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!42 = !DIEnumerator(name: "_ISspace", value: 8192)
!43 = !DIEnumerator(name: "_ISprint", value: 16384)
!44 = !DIEnumerator(name: "_ISgraph", value: 32768)
!45 = !DIEnumerator(name: "_ISblank", value: 1)
!46 = !DIEnumerator(name: "_IScntrl", value: 2)
!47 = !DIEnumerator(name: "_ISpunct", value: 4)
!48 = !DIEnumerator(name: "_ISalnum", value: 8)
!49 = !{!50, !51, !52, !55, !57, !58, !59}
!50 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!51 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !53, line: 216, baseType: !54)
!53 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!54 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!58 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "keyword_t", file: !4, line: 73, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_keyword", file: !4, line: 67, size: 320, align: 64, elements: !62)
!62 = !{!63, !66, !79, !80, !84}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !61, file: !4, line: 68, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !61, file: !4, line: 69, baseType: !67, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !70}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !72, line: 34, baseType: !73)
!72 = !DIFile(filename: "vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !72, line: 30, size: 128, align: 64, elements: !74)
!74 = !{!75, !76, !77}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !73, file: !72, line: 31, baseType: !58, size: 32, align: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !73, file: !72, line: 32, baseType: !58, size: 32, align: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !73, file: !72, line: 33, baseType: !78, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !61, file: !4, line: 70, baseType: !70, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "sub_close_handler", scope: !61, file: !4, line: 71, baseType: !81, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{null}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !61, file: !4, line: 72, baseType: !85, size: 8, align: 8, offset: 256)
!85 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!86 = !{!87, !89, !90, !91, !92, !93, !94, !95, !96, !98, !99, !117, !118, !119, !197, !198, !199, !200}
!87 = distinct !DIGlobalVariable(name: "WHITE_SPACE", scope: !0, file: !88, line: 76, type: !64, isLocal: false, isDefinition: true, variable: i8** @WHITE_SPACE)
!88 = !DIFile(filename: "parser.c", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!89 = distinct !DIGlobalVariable(name: "keywords", scope: !0, file: !88, line: 74, type: !70, isLocal: false, isDefinition: true, variable: %struct._vector** @keywords)
!90 = distinct !DIGlobalVariable(name: "config_id", scope: !0, file: !88, line: 75, type: !55, isLocal: false, isDefinition: true, variable: i8** @config_id)
!91 = distinct !DIGlobalVariable(name: "current_keywords", scope: !0, file: !88, line: 79, type: !70, isLocal: true, isDefinition: true, variable: %struct._vector** @current_keywords)
!92 = distinct !DIGlobalVariable(name: "current_file_name", scope: !0, file: !88, line: 81, type: !64, isLocal: true, isDefinition: true, variable: i8** @current_file_name)
!93 = distinct !DIGlobalVariable(name: "current_file_line_no", scope: !0, file: !88, line: 82, type: !52, isLocal: true, isDefinition: true, variable: i64* @current_file_line_no)
!94 = distinct !DIGlobalVariable(name: "buf_extern", scope: !0, file: !88, line: 86, type: !55, isLocal: true, isDefinition: true, variable: i8** @buf_extern)
!95 = distinct !DIGlobalVariable(name: "read_value_block_vec", scope: !0, file: !88, line: 1575, type: !70, isLocal: true, isDefinition: true, variable: %struct._vector** @read_value_block_vec)
!96 = distinct !DIGlobalVariable(name: "config_err", scope: !0, file: !88, line: 87, type: !97, isLocal: true, isDefinition: true, variable: i32* @config_err)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "config_err_t", file: !4, line: 64, baseType: !3)
!98 = distinct !DIGlobalVariable(name: "sublevel", scope: !0, file: !88, line: 83, type: !50, isLocal: true, isDefinition: true, variable: i32* @sublevel)
!99 = distinct !DIGlobalVariable(name: "def", scope: !100, file: !88, line: 1339, type: !104, isLocal: true, isDefinition: true, variable: %struct._defs** @read_line.def)
!100 = distinct !DISubprogram(name: "read_line", scope: !88, file: !88, line: 1329, type: !101, isLocal: true, isDefinition: true, scopeLine: 1330, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!101 = !DISubroutineType(types: !102)
!102 = !{!85, !55, !52}
!103 = !{}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "def_t", file: !88, line: 71, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_defs", file: !88, line: 64, size: 384, align: 64, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !113}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !88, line: 65, baseType: !55, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "name_len", scope: !106, file: !88, line: 66, baseType: !52, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !106, file: !88, line: 67, baseType: !55, size: 64, align: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "value_len", scope: !106, file: !88, line: 68, baseType: !52, size: 64, align: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "multiline", scope: !106, file: !88, line: 69, baseType: !85, size: 8, align: 8, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !106, file: !88, line: 70, baseType: !114, size: 64, align: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!55}
!117 = distinct !DIGlobalVariable(name: "next_ptr", scope: !100, file: !88, line: 1340, type: !55, isLocal: true, isDefinition: true, variable: i8** @read_line.next_ptr)
!118 = distinct !DIGlobalVariable(name: "line_residue", scope: !100, file: !88, line: 1344, type: !55, isLocal: true, isDefinition: true, variable: i8** @read_line.line_residue)
!119 = distinct !DIGlobalVariable(name: "multiline_stack", scope: !0, file: !88, line: 85, type: !120, isLocal: true, isDefinition: true, variable: %struct._list** @multiline_stack)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !121, line: 31, baseType: !122)
!121 = !DIFile(filename: "list.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !121, line: 39, size: 320, align: 64, elements: !124)
!124 = !{!125, !132, !133, !134, !138}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !123, file: !121, line: 40, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !121, line: 33, size: 192, align: 64, elements: !128)
!128 = !{!129, !130, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !121, line: 34, baseType: !126, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !127, file: !121, line: 35, baseType: !126, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !121, line: 36, baseType: !57, size: 64, align: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !123, file: !121, line: 41, baseType: !126, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !123, file: !121, line: 42, baseType: !58, size: 32, align: 32, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !123, file: !121, line: 43, baseType: !135, size: 64, align: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !57}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !123, file: !121, line: 44, baseType: !139, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !142, !57}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !144, line: 48, baseType: !145)
!144 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !146, line: 241, size: 1728, align: 64, elements: !147)
!146 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !168, !169, !170, !171, !175, !176, !178, !182, !185, !187, !188, !189, !190, !191, !192, !193}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !145, file: !146, line: 242, baseType: !50, size: 32, align: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !145, file: !146, line: 247, baseType: !55, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !145, file: !146, line: 248, baseType: !55, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !145, file: !146, line: 249, baseType: !55, size: 64, align: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !145, file: !146, line: 250, baseType: !55, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !145, file: !146, line: 251, baseType: !55, size: 64, align: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !145, file: !146, line: 252, baseType: !55, size: 64, align: 64, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !145, file: !146, line: 253, baseType: !55, size: 64, align: 64, offset: 448)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !145, file: !146, line: 254, baseType: !55, size: 64, align: 64, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !145, file: !146, line: 256, baseType: !55, size: 64, align: 64, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !145, file: !146, line: 257, baseType: !55, size: 64, align: 64, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !145, file: !146, line: 258, baseType: !55, size: 64, align: 64, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !145, file: !146, line: 260, baseType: !161, size: 64, align: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !146, line: 156, size: 192, align: 64, elements: !163)
!163 = !{!164, !165, !167}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !162, file: !146, line: 157, baseType: !161, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !162, file: !146, line: 158, baseType: !166, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !162, file: !146, line: 162, baseType: !50, size: 32, align: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !145, file: !146, line: 262, baseType: !166, size: 64, align: 64, offset: 832)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !145, file: !146, line: 264, baseType: !50, size: 32, align: 32, offset: 896)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !145, file: !146, line: 268, baseType: !50, size: 32, align: 32, offset: 928)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !145, file: !146, line: 270, baseType: !172, size: 64, align: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !173, line: 131, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!174 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !145, file: !146, line: 274, baseType: !51, size: 16, align: 16, offset: 1024)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !145, file: !146, line: 275, baseType: !177, size: 8, align: 8, offset: 1040)
!177 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !145, file: !146, line: 276, baseType: !179, size: 8, align: 8, offset: 1048)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8, align: 8, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 1)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !145, file: !146, line: 280, baseType: !183, size: 64, align: 64, offset: 1088)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !146, line: 150, baseType: null)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !145, file: !146, line: 289, baseType: !186, size: 64, align: 64, offset: 1152)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !173, line: 132, baseType: !174)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !145, file: !146, line: 297, baseType: !57, size: 64, align: 64, offset: 1216)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !145, file: !146, line: 298, baseType: !57, size: 64, align: 64, offset: 1280)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !145, file: !146, line: 299, baseType: !57, size: 64, align: 64, offset: 1344)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !145, file: !146, line: 300, baseType: !57, size: 64, align: 64, offset: 1408)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !145, file: !146, line: 302, baseType: !52, size: 64, align: 64, offset: 1472)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !145, file: !146, line: 303, baseType: !50, size: 32, align: 32, offset: 1536)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !145, file: !146, line: 305, baseType: !194, size: 160, align: 8, offset: 1568)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 160, align: 8, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 20)
!197 = distinct !DIGlobalVariable(name: "current_stream", scope: !0, file: !88, line: 80, type: !142, isLocal: true, isDefinition: true, variable: %struct._IO_FILE** @current_stream)
!198 = distinct !DIGlobalVariable(name: "defs", scope: !0, file: !88, line: 90, type: !120, isLocal: true, isDefinition: true, variable: %struct._list** @defs)
!199 = distinct !DIGlobalVariable(name: "skip_sublevel", scope: !0, file: !88, line: 84, type: !50, isLocal: true, isDefinition: true, variable: i32* @skip_sublevel)
!200 = distinct !DIGlobalVariable(name: "kw_level", scope: !0, file: !88, line: 726, type: !50, isLocal: true, isDefinition: true, variable: i32* @kw_level)
!201 = !{i32 2, !"Dwarf Version", i32 4}
!202 = !{i32 2, !"Debug Info Version", i32 3}
!203 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!204 = distinct !DISubprogram(name: "report_config_error", scope: !88, file: !88, line: 96, type: !205, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !97, !64, null}
!207 = !DILocalVariable(name: "err", arg: 1, scope: !204, file: !88, line: 96, type: !97)
!208 = !DIExpression()
!209 = !DILocation(line: 96, column: 34, scope: !204)
!210 = !DILocalVariable(name: "format", arg: 2, scope: !204, file: !88, line: 96, type: !64)
!211 = !DILocation(line: 96, column: 51, scope: !204)
!212 = !DILocalVariable(name: "args", scope: !204, file: !88, line: 98, type: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !144, line: 79, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !215, line: 40, baseType: !216)
!215 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 98, baseType: !217)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 192, align: 64, elements: !180)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 98, size: 192, align: 64, elements: !219)
!219 = !{!220, !221, !222, !223}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !218, file: !1, line: 98, baseType: !58, size: 32, align: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !218, file: !1, line: 98, baseType: !58, size: 32, align: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !218, file: !1, line: 98, baseType: !57, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !218, file: !1, line: 98, baseType: !57, size: 64, align: 64, offset: 128)
!224 = !DILocation(line: 98, column: 10, scope: !204)
!225 = !DILocalVariable(name: "format_buf", scope: !204, file: !88, line: 99, type: !55)
!226 = !DILocation(line: 99, column: 8, scope: !204)
!227 = !DILocation(line: 103, column: 6, scope: !228)
!228 = distinct !DILexicalBlock(scope: !204, file: !88, line: 103, column: 6)
!229 = !DILocation(line: 103, column: 6, scope: !204)
!230 = !DILocation(line: 105, column: 35, scope: !231)
!231 = distinct !DILexicalBlock(scope: !228, file: !88, line: 103, column: 25)
!232 = !DILocation(line: 105, column: 28, scope: !231)
!233 = !DILocation(line: 105, column: 26, scope: !231)
!234 = !DILocation(line: 105, column: 54, scope: !231)
!235 = !DILocation(line: 105, column: 58, scope: !231)
!236 = !DILocation(line: 105, column: 63, scope: !231)
!237 = !DILocation(line: 105, column: 67, scope: !231)
!238 = !DILocation(line: 105, column: 80, scope: !231)
!239 = !DILocation(line: 105, column: 73, scope: !240)
!240 = !DILexicalBlockFile(scope: !231, file: !88, discriminator: 1)
!241 = !DILocation(line: 105, column: 71, scope: !231)
!242 = !DILocation(line: 105, column: 88, scope: !231)
!243 = !DILocation(line: 105, column: 17, scope: !244)
!244 = !DILexicalBlockFile(scope: !231, file: !88, discriminator: 2)
!245 = !DILocation(line: 105, column: 14, scope: !231)
!246 = !DILocation(line: 106, column: 11, scope: !231)
!247 = !DILocation(line: 106, column: 38, scope: !231)
!248 = !DILocation(line: 106, column: 57, scope: !231)
!249 = !DILocation(line: 106, column: 79, scope: !231)
!250 = !DILocation(line: 106, column: 3, scope: !231)
!251 = !DILocation(line: 107, column: 2, scope: !231)
!252 = !DILocation(line: 107, column: 13, scope: !253)
!253 = !DILexicalBlockFile(scope: !254, file: !88, discriminator: 1)
!254 = distinct !DILexicalBlock(scope: !228, file: !88, line: 107, column: 13)
!255 = !DILocation(line: 109, column: 52, scope: !256)
!256 = distinct !DILexicalBlock(scope: !254, file: !88, line: 107, column: 35)
!257 = !DILocation(line: 109, column: 45, scope: !256)
!258 = !DILocation(line: 109, column: 43, scope: !256)
!259 = !DILocation(line: 109, column: 60, scope: !256)
!260 = !DILocation(line: 109, column: 17, scope: !261)
!261 = !DILexicalBlockFile(scope: !256, file: !88, discriminator: 1)
!262 = !DILocation(line: 109, column: 14, scope: !256)
!263 = !DILocation(line: 110, column: 11, scope: !256)
!264 = !DILocation(line: 110, column: 46, scope: !256)
!265 = !DILocation(line: 110, column: 68, scope: !256)
!266 = !DILocation(line: 110, column: 3, scope: !256)
!267 = !DILocation(line: 111, column: 2, scope: !256)
!268 = !DILocation(line: 113, column: 1, scope: !204)
!269 = !DILocation(line: 115, column: 6, scope: !270)
!270 = distinct !DILexicalBlock(scope: !204, file: !88, line: 115, column: 6)
!271 = !DILocation(line: 115, column: 6, scope: !204)
!272 = !DILocation(line: 116, column: 11, scope: !273)
!273 = distinct !DILexicalBlock(scope: !270, file: !88, line: 115, column: 43)
!274 = !DILocation(line: 116, column: 19, scope: !273)
!275 = !DILocation(line: 116, column: 32, scope: !276)
!276 = !DILexicalBlockFile(scope: !273, file: !88, discriminator: 1)
!277 = !DILocation(line: 116, column: 19, scope: !276)
!278 = !DILocation(line: 116, column: 45, scope: !279)
!279 = !DILexicalBlockFile(scope: !273, file: !88, discriminator: 2)
!280 = !DILocation(line: 116, column: 19, scope: !279)
!281 = !DILocation(line: 116, column: 19, scope: !282)
!282 = !DILexicalBlockFile(scope: !273, file: !88, discriminator: 3)
!283 = !DILocation(line: 116, column: 53, scope: !282)
!284 = !DILocation(line: 116, column: 3, scope: !282)
!285 = !DILocation(line: 117, column: 14, scope: !273)
!286 = !DILocation(line: 117, column: 3, scope: !273)
!287 = !DILocation(line: 119, column: 7, scope: !288)
!288 = distinct !DILexicalBlock(scope: !273, file: !88, line: 119, column: 7)
!289 = !DILocation(line: 119, column: 18, scope: !288)
!290 = !DILocation(line: 119, column: 31, scope: !288)
!291 = !DILocation(line: 119, column: 34, scope: !292)
!292 = !DILexicalBlockFile(scope: !288, file: !88, discriminator: 1)
!293 = !DILocation(line: 119, column: 47, scope: !292)
!294 = !DILocation(line: 119, column: 45, scope: !292)
!295 = !DILocation(line: 119, column: 7, scope: !292)
!296 = !DILocation(line: 120, column: 17, scope: !288)
!297 = !DILocation(line: 120, column: 15, scope: !288)
!298 = !DILocation(line: 120, column: 4, scope: !288)
!299 = !DILocation(line: 121, column: 2, scope: !273)
!300 = !DILocation(line: 123, column: 25, scope: !270)
!301 = !DILocation(line: 123, column: 38, scope: !302)
!302 = !DILexicalBlockFile(scope: !270, file: !88, discriminator: 1)
!303 = !DILocation(line: 123, column: 25, scope: !302)
!304 = !DILocation(line: 123, column: 51, scope: !305)
!305 = !DILexicalBlockFile(scope: !270, file: !88, discriminator: 2)
!306 = !DILocation(line: 123, column: 25, scope: !305)
!307 = !DILocation(line: 123, column: 25, scope: !308)
!308 = !DILexicalBlockFile(scope: !270, file: !88, discriminator: 3)
!309 = !DILocation(line: 123, column: 59, scope: !308)
!310 = !DILocation(line: 123, column: 3, scope: !308)
!311 = !DILocation(line: 125, column: 1, scope: !204)
!312 = !DILocation(line: 127, column: 6, scope: !313)
!313 = distinct !DILexicalBlock(scope: !204, file: !88, line: 127, column: 6)
!314 = !DILocation(line: 127, column: 6, scope: !204)
!315 = !DILocation(line: 128, column: 9, scope: !313)
!316 = !DILocation(line: 128, column: 4, scope: !313)
!317 = !DILocation(line: 128, column: 35, scope: !313)
!318 = !DILocation(line: 128, column: 3, scope: !313)
!319 = !DILocation(line: 129, column: 1, scope: !204)
!320 = distinct !DISubprogram(name: "__test_bit", scope: !20, file: !20, line: 47, type: !321, isLocal: true, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!321 = !DISubroutineType(types: !322)
!322 = !{!85, !58, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!325 = !DILocalVariable(name: "idx", arg: 1, scope: !320, file: !20, line: 47, type: !58)
!326 = !DILocation(line: 47, column: 39, scope: !320)
!327 = !DILocalVariable(name: "bmap", arg: 2, scope: !320, file: !20, line: 47, type: !323)
!328 = !DILocation(line: 47, column: 65, scope: !320)
!329 = !DILocation(line: 49, column: 19, scope: !320)
!330 = !DILocation(line: 49, column: 18, scope: !320)
!331 = !DILocation(line: 49, column: 24, scope: !320)
!332 = !DILocation(line: 49, column: 12, scope: !320)
!333 = !DILocation(line: 49, column: 68, scope: !320)
!334 = !DILocation(line: 49, column: 67, scope: !320)
!335 = !DILocation(line: 49, column: 73, scope: !320)
!336 = !DILocation(line: 49, column: 63, scope: !320)
!337 = !DILocation(line: 49, column: 56, scope: !320)
!338 = !DILocation(line: 49, column: 10, scope: !320)
!339 = !DILocation(line: 49, column: 9, scope: !320)
!340 = !DILocation(line: 49, column: 2, scope: !320)
!341 = distinct !DISubprogram(name: "get_config_status", scope: !88, file: !88, line: 132, type: !342, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!342 = !DISubroutineType(types: !343)
!343 = !{!97}
!344 = !DILocation(line: 134, column: 9, scope: !341)
!345 = !DILocation(line: 134, column: 2, scope: !341)
!346 = distinct !DISubprogram(name: "read_int", scope: !88, file: !88, line: 299, type: !347, isLocal: false, isDefinition: true, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!347 = !DISubroutineType(types: !348)
!348 = !{!85, !64, !349, !50, !50, !85}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!350 = !DILocalVariable(name: "str", arg: 1, scope: !346, file: !88, line: 299, type: !64)
!351 = !DILocation(line: 299, column: 22, scope: !346)
!352 = !DILocalVariable(name: "res", arg: 2, scope: !346, file: !88, line: 299, type: !349)
!353 = !DILocation(line: 299, column: 32, scope: !346)
!354 = !DILocalVariable(name: "min_val", arg: 3, scope: !346, file: !88, line: 299, type: !50)
!355 = !DILocation(line: 299, column: 41, scope: !346)
!356 = !DILocalVariable(name: "max_val", arg: 4, scope: !346, file: !88, line: 299, type: !50)
!357 = !DILocation(line: 299, column: 54, scope: !346)
!358 = !DILocalVariable(name: "ignore_error", arg: 5, scope: !346, file: !88, line: 299, type: !85)
!359 = !DILocation(line: 299, column: 67, scope: !346)
!360 = !DILocation(line: 301, column: 23, scope: !346)
!361 = !DILocation(line: 301, column: 32, scope: !346)
!362 = !DILocation(line: 301, column: 37, scope: !346)
!363 = !DILocation(line: 301, column: 46, scope: !346)
!364 = !DILocation(line: 301, column: 55, scope: !346)
!365 = !DILocation(line: 301, column: 9, scope: !346)
!366 = !DILocation(line: 301, column: 2, scope: !346)
!367 = distinct !DISubprogram(name: "read_int_func", scope: !88, file: !88, line: 151, type: !368, isLocal: true, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!368 = !DISubroutineType(types: !369)
!369 = !{!85, !64, !50, !349, !50, !50, !85}
!370 = !DILocalVariable(name: "number", arg: 1, scope: !367, file: !88, line: 151, type: !64)
!371 = !DILocation(line: 151, column: 27, scope: !367)
!372 = !DILocalVariable(name: "base", arg: 2, scope: !367, file: !88, line: 151, type: !50)
!373 = !DILocation(line: 151, column: 39, scope: !367)
!374 = !DILocalVariable(name: "res", arg: 3, scope: !367, file: !88, line: 151, type: !349)
!375 = !DILocation(line: 151, column: 50, scope: !367)
!376 = !DILocalVariable(name: "min_val", arg: 4, scope: !367, file: !88, line: 151, type: !50)
!377 = !DILocation(line: 151, column: 59, scope: !367)
!378 = !DILocalVariable(name: "max_val", arg: 5, scope: !367, file: !88, line: 151, type: !50)
!379 = !DILocation(line: 151, column: 72, scope: !367)
!380 = !DILocalVariable(name: "ignore_error", arg: 6, scope: !367, file: !88, line: 151, type: !85)
!381 = !DILocation(line: 151, column: 109, scope: !367)
!382 = !DILocalVariable(name: "val", scope: !367, file: !88, line: 153, type: !174)
!383 = !DILocation(line: 153, column: 7, scope: !367)
!384 = !DILocalVariable(name: "endptr", scope: !367, file: !88, line: 154, type: !55)
!385 = !DILocation(line: 154, column: 8, scope: !367)
!386 = !DILocalVariable(name: "warn", scope: !367, file: !88, line: 155, type: !55)
!387 = !DILocation(line: 155, column: 8, scope: !367)
!388 = !DILocation(line: 158, column: 6, scope: !389)
!389 = distinct !DILexicalBlock(scope: !367, file: !88, line: 158, column: 6)
!390 = !DILocation(line: 158, column: 19, scope: !389)
!391 = !DILocation(line: 158, column: 23, scope: !392)
!392 = !DILexicalBlockFile(scope: !389, file: !88, discriminator: 1)
!393 = !DILocation(line: 158, column: 6, scope: !392)
!394 = !DILocation(line: 159, column: 8, scope: !389)
!395 = !DILocation(line: 159, column: 3, scope: !389)
!396 = !DILocation(line: 162, column: 3, scope: !367)
!397 = !DILocation(line: 162, column: 7, scope: !367)
!398 = !DILocation(line: 163, column: 15, scope: !367)
!399 = !DILocation(line: 163, column: 32, scope: !367)
!400 = !DILocation(line: 163, column: 8, scope: !367)
!401 = !DILocation(line: 163, column: 6, scope: !367)
!402 = !DILocation(line: 164, column: 14, scope: !367)
!403 = !DILocation(line: 164, column: 9, scope: !367)
!404 = !DILocation(line: 164, column: 3, scope: !367)
!405 = !DILocation(line: 164, column: 7, scope: !367)
!406 = !DILocation(line: 166, column: 7, scope: !407)
!407 = distinct !DILexicalBlock(scope: !367, file: !88, line: 166, column: 6)
!408 = !DILocation(line: 166, column: 6, scope: !407)
!409 = !DILocation(line: 166, column: 6, scope: !367)
!410 = !DILocation(line: 167, column: 71, scope: !407)
!411 = !DILocation(line: 167, column: 77, scope: !407)
!412 = !DILocation(line: 167, column: 3, scope: !407)
!413 = !DILocation(line: 168, column: 12, scope: !414)
!414 = distinct !DILexicalBlock(scope: !407, file: !88, line: 168, column: 10)
!415 = !DILocation(line: 168, column: 11, scope: !414)
!416 = !DILocation(line: 168, column: 16, scope: !414)
!417 = !DILocation(line: 168, column: 26, scope: !414)
!418 = !DILocation(line: 168, column: 29, scope: !419)
!419 = !DILexicalBlockFile(scope: !414, file: !88, discriminator: 1)
!420 = !DILocation(line: 168, column: 33, scope: !419)
!421 = !DILocation(line: 168, column: 43, scope: !419)
!422 = !DILocation(line: 168, column: 46, scope: !423)
!423 = !DILexicalBlockFile(scope: !414, file: !88, discriminator: 2)
!424 = !DILocation(line: 168, column: 50, scope: !423)
!425 = !DILocation(line: 168, column: 10, scope: !423)
!426 = !DILocation(line: 169, column: 85, scope: !414)
!427 = !DILocation(line: 169, column: 91, scope: !414)
!428 = !DILocation(line: 169, column: 3, scope: !414)
!429 = !DILocation(line: 170, column: 11, scope: !430)
!430 = distinct !DILexicalBlock(scope: !414, file: !88, line: 170, column: 11)
!431 = !DILocation(line: 170, column: 17, scope: !430)
!432 = !DILocation(line: 170, column: 15, scope: !430)
!433 = !DILocation(line: 170, column: 25, scope: !430)
!434 = !DILocation(line: 170, column: 28, scope: !435)
!435 = !DILexicalBlockFile(scope: !430, file: !88, discriminator: 1)
!436 = !DILocation(line: 170, column: 34, scope: !435)
!437 = !DILocation(line: 170, column: 32, scope: !435)
!438 = !DILocation(line: 170, column: 11, scope: !435)
!439 = !DILocation(line: 171, column: 84, scope: !430)
!440 = !DILocation(line: 171, column: 92, scope: !430)
!441 = !DILocation(line: 171, column: 101, scope: !430)
!442 = !DILocation(line: 171, column: 3, scope: !430)
!443 = !DILocation(line: 173, column: 3, scope: !430)
!444 = !DILocation(line: 178, column: 9, scope: !367)
!445 = !DILocation(line: 178, column: 22, scope: !367)
!446 = !DILocation(line: 178, column: 25, scope: !447)
!447 = !DILexicalBlockFile(scope: !367, file: !88, discriminator: 1)
!448 = !DILocation(line: 178, column: 32, scope: !447)
!449 = !DILocation(line: 178, column: 29, scope: !447)
!450 = !DILocation(line: 178, column: 40, scope: !447)
!451 = !DILocation(line: 178, column: 43, scope: !452)
!452 = !DILexicalBlockFile(scope: !367, file: !88, discriminator: 2)
!453 = !DILocation(line: 178, column: 50, scope: !452)
!454 = !DILocation(line: 178, column: 47, scope: !452)
!455 = !DILocation(line: 178, column: 58, scope: !452)
!456 = !DILocation(line: 178, column: 62, scope: !457)
!457 = !DILexicalBlockFile(scope: !367, file: !88, discriminator: 3)
!458 = !DILocation(line: 178, column: 61, scope: !457)
!459 = !DILocation(line: 178, column: 2, scope: !460)
!460 = !DILexicalBlockFile(scope: !367, file: !88, discriminator: 4)
!461 = !DILocation(line: 180, column: 1, scope: !367)
!462 = distinct !DISubprogram(name: "read_unsigned", scope: !88, file: !88, line: 305, type: !463, isLocal: false, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!463 = !DISubroutineType(types: !464)
!464 = !{!85, !64, !465, !58, !58, !85}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!466 = !DILocalVariable(name: "str", arg: 1, scope: !462, file: !88, line: 305, type: !64)
!467 = !DILocation(line: 305, column: 27, scope: !462)
!468 = !DILocalVariable(name: "res", arg: 2, scope: !462, file: !88, line: 305, type: !465)
!469 = !DILocation(line: 305, column: 42, scope: !462)
!470 = !DILocalVariable(name: "min_val", arg: 3, scope: !462, file: !88, line: 305, type: !58)
!471 = !DILocation(line: 305, column: 56, scope: !462)
!472 = !DILocalVariable(name: "max_val", arg: 4, scope: !462, file: !88, line: 305, type: !58)
!473 = !DILocation(line: 305, column: 74, scope: !462)
!474 = !DILocalVariable(name: "ignore_error", arg: 5, scope: !462, file: !88, line: 305, type: !85)
!475 = !DILocation(line: 305, column: 87, scope: !462)
!476 = !DILocation(line: 307, column: 28, scope: !462)
!477 = !DILocation(line: 307, column: 37, scope: !462)
!478 = !DILocation(line: 307, column: 42, scope: !462)
!479 = !DILocation(line: 307, column: 51, scope: !462)
!480 = !DILocation(line: 307, column: 60, scope: !462)
!481 = !DILocation(line: 307, column: 9, scope: !462)
!482 = !DILocation(line: 307, column: 2, scope: !462)
!483 = distinct !DISubprogram(name: "read_unsigned_func", scope: !88, file: !88, line: 183, type: !484, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!484 = !DISubroutineType(types: !485)
!485 = !{!85, !64, !50, !465, !58, !58, !85}
!486 = !DILocalVariable(name: "number", arg: 1, scope: !483, file: !88, line: 183, type: !64)
!487 = !DILocation(line: 183, column: 32, scope: !483)
!488 = !DILocalVariable(name: "base", arg: 2, scope: !483, file: !88, line: 183, type: !50)
!489 = !DILocation(line: 183, column: 44, scope: !483)
!490 = !DILocalVariable(name: "res", arg: 3, scope: !483, file: !88, line: 183, type: !465)
!491 = !DILocation(line: 183, column: 60, scope: !483)
!492 = !DILocalVariable(name: "min_val", arg: 4, scope: !483, file: !88, line: 183, type: !58)
!493 = !DILocation(line: 183, column: 74, scope: !483)
!494 = !DILocalVariable(name: "max_val", arg: 5, scope: !483, file: !88, line: 183, type: !58)
!495 = !DILocation(line: 183, column: 92, scope: !483)
!496 = !DILocalVariable(name: "ignore_error", arg: 6, scope: !483, file: !88, line: 183, type: !85)
!497 = !DILocation(line: 183, column: 129, scope: !483)
!498 = !DILocalVariable(name: "val", scope: !483, file: !88, line: 185, type: !54)
!499 = !DILocation(line: 185, column: 16, scope: !483)
!500 = !DILocalVariable(name: "endptr", scope: !483, file: !88, line: 186, type: !55)
!501 = !DILocation(line: 186, column: 8, scope: !483)
!502 = !DILocalVariable(name: "warn", scope: !483, file: !88, line: 187, type: !55)
!503 = !DILocation(line: 187, column: 8, scope: !483)
!504 = !DILocalVariable(name: "offset", scope: !483, file: !88, line: 188, type: !52)
!505 = !DILocation(line: 188, column: 9, scope: !483)
!506 = !DILocation(line: 191, column: 6, scope: !507)
!507 = distinct !DILexicalBlock(scope: !483, file: !88, line: 191, column: 6)
!508 = !DILocation(line: 191, column: 19, scope: !507)
!509 = !DILocation(line: 191, column: 23, scope: !510)
!510 = !DILexicalBlockFile(scope: !507, file: !88, discriminator: 1)
!511 = !DILocation(line: 191, column: 6, scope: !510)
!512 = !DILocation(line: 192, column: 8, scope: !507)
!513 = !DILocation(line: 192, column: 3, scope: !507)
!514 = !DILocation(line: 198, column: 18, scope: !483)
!515 = !DILocation(line: 198, column: 26, scope: !483)
!516 = !DILocation(line: 198, column: 11, scope: !483)
!517 = !DILocation(line: 198, column: 9, scope: !483)
!518 = !DILocation(line: 200, column: 3, scope: !483)
!519 = !DILocation(line: 200, column: 7, scope: !483)
!520 = !DILocation(line: 201, column: 16, scope: !483)
!521 = !DILocation(line: 201, column: 25, scope: !483)
!522 = !DILocation(line: 201, column: 23, scope: !483)
!523 = !DILocation(line: 201, column: 42, scope: !483)
!524 = !DILocation(line: 201, column: 8, scope: !483)
!525 = !DILocation(line: 201, column: 6, scope: !483)
!526 = !DILocation(line: 202, column: 19, scope: !483)
!527 = !DILocation(line: 202, column: 9, scope: !483)
!528 = !DILocation(line: 202, column: 3, scope: !483)
!529 = !DILocation(line: 202, column: 7, scope: !483)
!530 = !DILocation(line: 204, column: 13, scope: !531)
!531 = distinct !DILexicalBlock(scope: !483, file: !88, line: 204, column: 6)
!532 = !DILocation(line: 204, column: 6, scope: !531)
!533 = !DILocation(line: 204, column: 21, scope: !531)
!534 = !DILocation(line: 204, column: 6, scope: !483)
!535 = !DILocation(line: 205, column: 72, scope: !531)
!536 = !DILocation(line: 205, column: 78, scope: !531)
!537 = !DILocation(line: 205, column: 3, scope: !531)
!538 = !DILocation(line: 206, column: 12, scope: !539)
!539 = distinct !DILexicalBlock(scope: !531, file: !88, line: 206, column: 11)
!540 = !DILocation(line: 206, column: 11, scope: !539)
!541 = !DILocation(line: 206, column: 11, scope: !531)
!542 = !DILocation(line: 207, column: 71, scope: !539)
!543 = !DILocation(line: 207, column: 77, scope: !539)
!544 = !DILocation(line: 207, column: 3, scope: !539)
!545 = !DILocation(line: 208, column: 12, scope: !546)
!546 = distinct !DILexicalBlock(scope: !539, file: !88, line: 208, column: 10)
!547 = !DILocation(line: 208, column: 11, scope: !546)
!548 = !DILocation(line: 208, column: 16, scope: !546)
!549 = !DILocation(line: 208, column: 26, scope: !546)
!550 = !DILocation(line: 208, column: 29, scope: !551)
!551 = !DILexicalBlockFile(scope: !546, file: !88, discriminator: 1)
!552 = !DILocation(line: 208, column: 33, scope: !551)
!553 = !DILocation(line: 208, column: 10, scope: !551)
!554 = !DILocation(line: 209, column: 94, scope: !546)
!555 = !DILocation(line: 209, column: 100, scope: !546)
!556 = !DILocation(line: 209, column: 3, scope: !546)
!557 = !DILocation(line: 210, column: 11, scope: !558)
!558 = distinct !DILexicalBlock(scope: !546, file: !88, line: 210, column: 11)
!559 = !DILocation(line: 210, column: 17, scope: !558)
!560 = !DILocation(line: 210, column: 15, scope: !558)
!561 = !DILocation(line: 210, column: 25, scope: !558)
!562 = !DILocation(line: 210, column: 28, scope: !563)
!563 = !DILexicalBlockFile(scope: !558, file: !88, discriminator: 1)
!564 = !DILocation(line: 210, column: 34, scope: !563)
!565 = !DILocation(line: 210, column: 32, scope: !563)
!566 = !DILocation(line: 210, column: 11, scope: !563)
!567 = !DILocation(line: 211, column: 84, scope: !558)
!568 = !DILocation(line: 211, column: 92, scope: !558)
!569 = !DILocation(line: 211, column: 101, scope: !558)
!570 = !DILocation(line: 211, column: 3, scope: !558)
!571 = !DILocation(line: 213, column: 3, scope: !558)
!572 = !DILocation(line: 218, column: 9, scope: !483)
!573 = !DILocation(line: 218, column: 22, scope: !483)
!574 = !DILocation(line: 218, column: 25, scope: !575)
!575 = !DILexicalBlockFile(scope: !483, file: !88, discriminator: 1)
!576 = !DILocation(line: 218, column: 32, scope: !575)
!577 = !DILocation(line: 218, column: 29, scope: !575)
!578 = !DILocation(line: 218, column: 40, scope: !575)
!579 = !DILocation(line: 218, column: 43, scope: !580)
!580 = !DILexicalBlockFile(scope: !483, file: !88, discriminator: 2)
!581 = !DILocation(line: 218, column: 50, scope: !580)
!582 = !DILocation(line: 218, column: 47, scope: !580)
!583 = !DILocation(line: 218, column: 58, scope: !580)
!584 = !DILocation(line: 218, column: 62, scope: !585)
!585 = !DILexicalBlockFile(scope: !483, file: !88, discriminator: 3)
!586 = !DILocation(line: 218, column: 61, scope: !585)
!587 = !DILocation(line: 218, column: 2, scope: !588)
!588 = !DILexicalBlockFile(scope: !483, file: !88, discriminator: 4)
!589 = !DILocation(line: 220, column: 1, scope: !483)
!590 = distinct !DISubprogram(name: "read_unsigned64", scope: !88, file: !88, line: 311, type: !591, isLocal: false, isDefinition: true, scopeLine: 312, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!591 = !DISubroutineType(types: !592)
!592 = !{!85, !64, !593, !594, !594, !85}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !595, line: 55, baseType: !54)
!595 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!596 = !DILocalVariable(name: "str", arg: 1, scope: !590, file: !88, line: 311, type: !64)
!597 = !DILocation(line: 311, column: 29, scope: !590)
!598 = !DILocalVariable(name: "res", arg: 2, scope: !590, file: !88, line: 311, type: !593)
!599 = !DILocation(line: 311, column: 44, scope: !590)
!600 = !DILocalVariable(name: "min_val", arg: 3, scope: !590, file: !88, line: 311, type: !594)
!601 = !DILocation(line: 311, column: 58, scope: !590)
!602 = !DILocalVariable(name: "max_val", arg: 4, scope: !590, file: !88, line: 311, type: !594)
!603 = !DILocation(line: 311, column: 76, scope: !590)
!604 = !DILocalVariable(name: "ignore_error", arg: 5, scope: !590, file: !88, line: 311, type: !85)
!605 = !DILocation(line: 311, column: 89, scope: !590)
!606 = !DILocation(line: 313, column: 30, scope: !590)
!607 = !DILocation(line: 313, column: 39, scope: !590)
!608 = !DILocation(line: 313, column: 44, scope: !590)
!609 = !DILocation(line: 313, column: 53, scope: !590)
!610 = !DILocation(line: 313, column: 62, scope: !590)
!611 = !DILocation(line: 313, column: 9, scope: !590)
!612 = !DILocation(line: 313, column: 2, scope: !590)
!613 = distinct !DISubprogram(name: "read_unsigned64_func", scope: !88, file: !88, line: 223, type: !614, isLocal: true, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!614 = !DISubroutineType(types: !615)
!615 = !{!85, !64, !50, !593, !594, !594, !85}
!616 = !DILocalVariable(name: "number", arg: 1, scope: !613, file: !88, line: 223, type: !64)
!617 = !DILocation(line: 223, column: 34, scope: !613)
!618 = !DILocalVariable(name: "base", arg: 2, scope: !613, file: !88, line: 223, type: !50)
!619 = !DILocation(line: 223, column: 46, scope: !613)
!620 = !DILocalVariable(name: "res", arg: 3, scope: !613, file: !88, line: 223, type: !593)
!621 = !DILocation(line: 223, column: 62, scope: !613)
!622 = !DILocalVariable(name: "min_val", arg: 4, scope: !613, file: !88, line: 223, type: !594)
!623 = !DILocation(line: 223, column: 76, scope: !613)
!624 = !DILocalVariable(name: "max_val", arg: 5, scope: !613, file: !88, line: 223, type: !594)
!625 = !DILocation(line: 223, column: 94, scope: !613)
!626 = !DILocalVariable(name: "ignore_error", arg: 6, scope: !613, file: !88, line: 223, type: !85)
!627 = !DILocation(line: 223, column: 131, scope: !613)
!628 = !DILocalVariable(name: "val", scope: !613, file: !88, line: 225, type: !629)
!629 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!630 = !DILocation(line: 225, column: 21, scope: !613)
!631 = !DILocalVariable(name: "endptr", scope: !613, file: !88, line: 226, type: !55)
!632 = !DILocation(line: 226, column: 8, scope: !613)
!633 = !DILocalVariable(name: "warn", scope: !613, file: !88, line: 227, type: !55)
!634 = !DILocation(line: 227, column: 8, scope: !613)
!635 = !DILocalVariable(name: "offset", scope: !613, file: !88, line: 228, type: !52)
!636 = !DILocation(line: 228, column: 9, scope: !613)
!637 = !DILocation(line: 231, column: 6, scope: !638)
!638 = distinct !DILexicalBlock(scope: !613, file: !88, line: 231, column: 6)
!639 = !DILocation(line: 231, column: 19, scope: !638)
!640 = !DILocation(line: 231, column: 23, scope: !641)
!641 = !DILexicalBlockFile(scope: !638, file: !88, discriminator: 1)
!642 = !DILocation(line: 231, column: 6, scope: !641)
!643 = !DILocation(line: 232, column: 8, scope: !638)
!644 = !DILocation(line: 232, column: 3, scope: !638)
!645 = !DILocation(line: 238, column: 18, scope: !613)
!646 = !DILocation(line: 238, column: 26, scope: !613)
!647 = !DILocation(line: 238, column: 11, scope: !613)
!648 = !DILocation(line: 238, column: 9, scope: !613)
!649 = !DILocation(line: 240, column: 3, scope: !613)
!650 = !DILocation(line: 240, column: 7, scope: !613)
!651 = !DILocation(line: 241, column: 17, scope: !613)
!652 = !DILocation(line: 241, column: 26, scope: !613)
!653 = !DILocation(line: 241, column: 24, scope: !613)
!654 = !DILocation(line: 241, column: 43, scope: !613)
!655 = !DILocation(line: 241, column: 8, scope: !613)
!656 = !DILocation(line: 241, column: 6, scope: !613)
!657 = !DILocation(line: 242, column: 19, scope: !613)
!658 = !DILocation(line: 242, column: 9, scope: !613)
!659 = !DILocation(line: 242, column: 3, scope: !613)
!660 = !DILocation(line: 242, column: 7, scope: !613)
!661 = !DILocation(line: 244, column: 13, scope: !662)
!662 = distinct !DILexicalBlock(scope: !613, file: !88, line: 244, column: 6)
!663 = !DILocation(line: 244, column: 6, scope: !662)
!664 = !DILocation(line: 244, column: 21, scope: !662)
!665 = !DILocation(line: 244, column: 6, scope: !613)
!666 = !DILocation(line: 245, column: 72, scope: !662)
!667 = !DILocation(line: 245, column: 78, scope: !662)
!668 = !DILocation(line: 245, column: 3, scope: !662)
!669 = !DILocation(line: 246, column: 12, scope: !670)
!670 = distinct !DILexicalBlock(scope: !662, file: !88, line: 246, column: 11)
!671 = !DILocation(line: 246, column: 11, scope: !670)
!672 = !DILocation(line: 246, column: 11, scope: !662)
!673 = !DILocation(line: 247, column: 71, scope: !670)
!674 = !DILocation(line: 247, column: 77, scope: !670)
!675 = !DILocation(line: 247, column: 3, scope: !670)
!676 = !DILocation(line: 248, column: 12, scope: !677)
!677 = distinct !DILexicalBlock(scope: !670, file: !88, line: 248, column: 10)
!678 = !DILocation(line: 248, column: 11, scope: !677)
!679 = !DILocation(line: 248, column: 16, scope: !677)
!680 = !DILocation(line: 248, column: 10, scope: !670)
!681 = !DILocation(line: 249, column: 93, scope: !677)
!682 = !DILocation(line: 249, column: 99, scope: !677)
!683 = !DILocation(line: 249, column: 3, scope: !677)
!684 = !DILocation(line: 250, column: 11, scope: !685)
!685 = distinct !DILexicalBlock(scope: !677, file: !88, line: 250, column: 11)
!686 = !DILocation(line: 250, column: 17, scope: !685)
!687 = !DILocation(line: 250, column: 15, scope: !685)
!688 = !DILocation(line: 250, column: 25, scope: !685)
!689 = !DILocation(line: 250, column: 28, scope: !690)
!690 = !DILexicalBlockFile(scope: !685, file: !88, discriminator: 1)
!691 = !DILocation(line: 250, column: 34, scope: !690)
!692 = !DILocation(line: 250, column: 32, scope: !690)
!693 = !DILocation(line: 250, column: 11, scope: !690)
!694 = !DILocation(line: 251, column: 101, scope: !685)
!695 = !DILocation(line: 251, column: 109, scope: !685)
!696 = !DILocation(line: 251, column: 118, scope: !685)
!697 = !DILocation(line: 251, column: 3, scope: !685)
!698 = !DILocation(line: 253, column: 3, scope: !685)
!699 = !DILocation(line: 258, column: 9, scope: !613)
!700 = !DILocation(line: 258, column: 22, scope: !613)
!701 = !DILocation(line: 258, column: 25, scope: !702)
!702 = !DILexicalBlockFile(scope: !613, file: !88, discriminator: 1)
!703 = !DILocation(line: 258, column: 32, scope: !702)
!704 = !DILocation(line: 258, column: 29, scope: !702)
!705 = !DILocation(line: 258, column: 40, scope: !702)
!706 = !DILocation(line: 258, column: 43, scope: !707)
!707 = !DILexicalBlockFile(scope: !613, file: !88, discriminator: 2)
!708 = !DILocation(line: 258, column: 50, scope: !707)
!709 = !DILocation(line: 258, column: 47, scope: !707)
!710 = !DILocation(line: 258, column: 58, scope: !707)
!711 = !DILocation(line: 258, column: 62, scope: !712)
!712 = !DILexicalBlockFile(scope: !613, file: !88, discriminator: 3)
!713 = !DILocation(line: 258, column: 61, scope: !712)
!714 = !DILocation(line: 258, column: 2, scope: !715)
!715 = !DILexicalBlockFile(scope: !613, file: !88, discriminator: 4)
!716 = !DILocation(line: 260, column: 1, scope: !613)
!717 = distinct !DISubprogram(name: "read_double", scope: !88, file: !88, line: 317, type: !718, isLocal: false, isDefinition: true, scopeLine: 318, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!718 = !DISubroutineType(types: !719)
!719 = !{!85, !64, !720, !721, !721, !85}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64, align: 64)
!721 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!722 = !DILocalVariable(name: "str", arg: 1, scope: !717, file: !88, line: 317, type: !64)
!723 = !DILocation(line: 317, column: 25, scope: !717)
!724 = !DILocalVariable(name: "res", arg: 2, scope: !717, file: !88, line: 317, type: !720)
!725 = !DILocation(line: 317, column: 38, scope: !717)
!726 = !DILocalVariable(name: "min_val", arg: 3, scope: !717, file: !88, line: 317, type: !721)
!727 = !DILocation(line: 317, column: 50, scope: !717)
!728 = !DILocalVariable(name: "max_val", arg: 4, scope: !717, file: !88, line: 317, type: !721)
!729 = !DILocation(line: 317, column: 66, scope: !717)
!730 = !DILocalVariable(name: "ignore_error", arg: 5, scope: !717, file: !88, line: 317, type: !85)
!731 = !DILocation(line: 317, column: 79, scope: !717)
!732 = !DILocation(line: 319, column: 26, scope: !717)
!733 = !DILocation(line: 319, column: 31, scope: !717)
!734 = !DILocation(line: 319, column: 36, scope: !717)
!735 = !DILocation(line: 319, column: 45, scope: !717)
!736 = !DILocation(line: 319, column: 54, scope: !717)
!737 = !DILocation(line: 319, column: 9, scope: !717)
!738 = !DILocation(line: 319, column: 2, scope: !717)
!739 = distinct !DISubprogram(name: "read_double_func", scope: !88, file: !88, line: 263, type: !718, isLocal: true, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!740 = !DILocalVariable(name: "number", arg: 1, scope: !739, file: !88, line: 263, type: !64)
!741 = !DILocation(line: 263, column: 30, scope: !739)
!742 = !DILocalVariable(name: "res", arg: 2, scope: !739, file: !88, line: 263, type: !720)
!743 = !DILocation(line: 263, column: 46, scope: !739)
!744 = !DILocalVariable(name: "min_val", arg: 3, scope: !739, file: !88, line: 263, type: !721)
!745 = !DILocation(line: 263, column: 58, scope: !739)
!746 = !DILocalVariable(name: "max_val", arg: 4, scope: !739, file: !88, line: 263, type: !721)
!747 = !DILocation(line: 263, column: 74, scope: !739)
!748 = !DILocalVariable(name: "ignore_error", arg: 5, scope: !739, file: !88, line: 263, type: !85)
!749 = !DILocation(line: 263, column: 111, scope: !739)
!750 = !DILocalVariable(name: "val", scope: !739, file: !88, line: 265, type: !721)
!751 = !DILocation(line: 265, column: 9, scope: !739)
!752 = !DILocalVariable(name: "endptr", scope: !739, file: !88, line: 266, type: !55)
!753 = !DILocation(line: 266, column: 8, scope: !739)
!754 = !DILocalVariable(name: "warn", scope: !739, file: !88, line: 267, type: !55)
!755 = !DILocation(line: 267, column: 8, scope: !739)
!756 = !DILocation(line: 270, column: 6, scope: !757)
!757 = distinct !DILexicalBlock(scope: !739, file: !88, line: 270, column: 6)
!758 = !DILocation(line: 270, column: 19, scope: !757)
!759 = !DILocation(line: 270, column: 23, scope: !760)
!760 = !DILexicalBlockFile(scope: !757, file: !88, discriminator: 1)
!761 = !DILocation(line: 270, column: 6, scope: !760)
!762 = !DILocation(line: 271, column: 8, scope: !757)
!763 = !DILocation(line: 271, column: 3, scope: !757)
!764 = !DILocation(line: 274, column: 3, scope: !739)
!765 = !DILocation(line: 274, column: 7, scope: !739)
!766 = !DILocation(line: 275, column: 15, scope: !739)
!767 = !DILocation(line: 275, column: 8, scope: !739)
!768 = !DILocation(line: 275, column: 6, scope: !739)
!769 = !DILocation(line: 276, column: 9, scope: !739)
!770 = !DILocation(line: 276, column: 3, scope: !739)
!771 = !DILocation(line: 276, column: 7, scope: !739)
!772 = !DILocation(line: 278, column: 7, scope: !773)
!773 = distinct !DILexicalBlock(scope: !739, file: !88, line: 278, column: 6)
!774 = !DILocation(line: 278, column: 6, scope: !773)
!775 = !DILocation(line: 278, column: 6, scope: !739)
!776 = !DILocation(line: 279, column: 71, scope: !773)
!777 = !DILocation(line: 279, column: 77, scope: !773)
!778 = !DILocation(line: 279, column: 3, scope: !773)
!779 = !DILocation(line: 280, column: 12, scope: !780)
!780 = distinct !DILexicalBlock(scope: !773, file: !88, line: 280, column: 10)
!781 = !DILocation(line: 280, column: 11, scope: !780)
!782 = !DILocation(line: 280, column: 16, scope: !780)
!783 = !DILocation(line: 280, column: 10, scope: !773)
!784 = !DILocation(line: 281, column: 76, scope: !780)
!785 = !DILocation(line: 281, column: 82, scope: !780)
!786 = !DILocation(line: 281, column: 3, scope: !780)
!787 = !DILocation(line: 282, column: 11, scope: !788)
!788 = distinct !DILexicalBlock(scope: !780, file: !88, line: 282, column: 11)
!789 = !DILocation(line: 282, column: 15, scope: !788)
!790 = !DILocation(line: 282, column: 27, scope: !788)
!791 = !DILocation(line: 282, column: 30, scope: !792)
!792 = !DILexicalBlockFile(scope: !788, file: !88, discriminator: 1)
!793 = !DILocation(line: 282, column: 34, scope: !792)
!794 = !DILocation(line: 282, column: 11, scope: !792)
!795 = !DILocation(line: 283, column: 70, scope: !788)
!796 = !DILocation(line: 283, column: 3, scope: !788)
!797 = !DILocation(line: 284, column: 13, scope: !798)
!798 = distinct !DILexicalBlock(scope: !788, file: !88, line: 284, column: 11)
!799 = !DILocation(line: 284, column: 17, scope: !798)
!800 = !DILocation(line: 284, column: 22, scope: !798)
!801 = !DILocation(line: 284, column: 25, scope: !802)
!802 = !DILexicalBlockFile(scope: !798, file: !88, discriminator: 1)
!803 = !DILocation(line: 284, column: 29, scope: !802)
!804 = !DILocation(line: 284, column: 11, scope: !802)
!805 = !DILocation(line: 285, column: 67, scope: !798)
!806 = !DILocation(line: 285, column: 3, scope: !798)
!807 = !DILocation(line: 286, column: 11, scope: !808)
!808 = distinct !DILexicalBlock(scope: !798, file: !88, line: 286, column: 11)
!809 = !DILocation(line: 286, column: 17, scope: !808)
!810 = !DILocation(line: 286, column: 15, scope: !808)
!811 = !DILocation(line: 286, column: 25, scope: !808)
!812 = !DILocation(line: 286, column: 28, scope: !813)
!813 = !DILexicalBlockFile(scope: !808, file: !88, discriminator: 1)
!814 = !DILocation(line: 286, column: 34, scope: !813)
!815 = !DILocation(line: 286, column: 32, scope: !813)
!816 = !DILocation(line: 286, column: 11, scope: !813)
!817 = !DILocation(line: 287, column: 84, scope: !808)
!818 = !DILocation(line: 287, column: 92, scope: !808)
!819 = !DILocation(line: 287, column: 101, scope: !808)
!820 = !DILocation(line: 287, column: 3, scope: !808)
!821 = !DILocation(line: 289, column: 3, scope: !808)
!822 = !DILocation(line: 294, column: 9, scope: !739)
!823 = !DILocation(line: 294, column: 22, scope: !739)
!824 = !DILocation(line: 294, column: 25, scope: !825)
!825 = !DILexicalBlockFile(scope: !739, file: !88, discriminator: 1)
!826 = !DILocation(line: 294, column: 32, scope: !825)
!827 = !DILocation(line: 294, column: 29, scope: !825)
!828 = !DILocation(line: 294, column: 40, scope: !825)
!829 = !DILocation(line: 294, column: 43, scope: !830)
!830 = !DILexicalBlockFile(scope: !739, file: !88, discriminator: 2)
!831 = !DILocation(line: 294, column: 50, scope: !830)
!832 = !DILocation(line: 294, column: 47, scope: !830)
!833 = !DILocation(line: 294, column: 58, scope: !830)
!834 = !DILocation(line: 294, column: 62, scope: !835)
!835 = !DILexicalBlockFile(scope: !739, file: !88, discriminator: 3)
!836 = !DILocation(line: 294, column: 61, scope: !835)
!837 = !DILocation(line: 294, column: 2, scope: !838)
!838 = !DILexicalBlockFile(scope: !739, file: !88, discriminator: 4)
!839 = !DILocation(line: 296, column: 1, scope: !739)
!840 = distinct !DISubprogram(name: "read_int_strvec", scope: !88, file: !88, line: 323, type: !841, isLocal: false, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!841 = !DISubroutineType(types: !842)
!842 = !{!85, !843, !52, !349, !50, !50, !85}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64, align: 64)
!844 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!845 = !DILocalVariable(name: "strvec", arg: 1, scope: !840, file: !88, line: 323, type: !843)
!846 = !DILocation(line: 323, column: 33, scope: !840)
!847 = !DILocalVariable(name: "index", arg: 2, scope: !840, file: !88, line: 323, type: !52)
!848 = !DILocation(line: 323, column: 48, scope: !840)
!849 = !DILocalVariable(name: "res", arg: 3, scope: !840, file: !88, line: 323, type: !349)
!850 = !DILocation(line: 323, column: 60, scope: !840)
!851 = !DILocalVariable(name: "min_val", arg: 4, scope: !840, file: !88, line: 323, type: !50)
!852 = !DILocation(line: 323, column: 69, scope: !840)
!853 = !DILocalVariable(name: "max_val", arg: 5, scope: !840, file: !88, line: 323, type: !50)
!854 = !DILocation(line: 323, column: 82, scope: !840)
!855 = !DILocalVariable(name: "ignore_error", arg: 6, scope: !840, file: !88, line: 323, type: !85)
!856 = !DILocation(line: 323, column: 95, scope: !840)
!857 = !DILocation(line: 325, column: 35, scope: !840)
!858 = !DILocation(line: 325, column: 43, scope: !840)
!859 = !DILocation(line: 325, column: 23, scope: !840)
!860 = !DILocation(line: 325, column: 55, scope: !840)
!861 = !DILocation(line: 325, column: 60, scope: !840)
!862 = !DILocation(line: 325, column: 69, scope: !840)
!863 = !DILocation(line: 325, column: 78, scope: !840)
!864 = !DILocation(line: 325, column: 9, scope: !865)
!865 = !DILexicalBlockFile(scope: !840, file: !88, discriminator: 1)
!866 = !DILocation(line: 325, column: 2, scope: !840)
!867 = distinct !DISubprogram(name: "read_unsigned_strvec", scope: !88, file: !88, line: 329, type: !868, isLocal: false, isDefinition: true, scopeLine: 330, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!868 = !DISubroutineType(types: !869)
!869 = !{!85, !843, !52, !465, !58, !58, !85}
!870 = !DILocalVariable(name: "strvec", arg: 1, scope: !867, file: !88, line: 329, type: !843)
!871 = !DILocation(line: 329, column: 38, scope: !867)
!872 = !DILocalVariable(name: "index", arg: 2, scope: !867, file: !88, line: 329, type: !52)
!873 = !DILocation(line: 329, column: 53, scope: !867)
!874 = !DILocalVariable(name: "res", arg: 3, scope: !867, file: !88, line: 329, type: !465)
!875 = !DILocation(line: 329, column: 70, scope: !867)
!876 = !DILocalVariable(name: "min_val", arg: 4, scope: !867, file: !88, line: 329, type: !58)
!877 = !DILocation(line: 329, column: 84, scope: !867)
!878 = !DILocalVariable(name: "max_val", arg: 5, scope: !867, file: !88, line: 329, type: !58)
!879 = !DILocation(line: 329, column: 102, scope: !867)
!880 = !DILocalVariable(name: "ignore_error", arg: 6, scope: !867, file: !88, line: 329, type: !85)
!881 = !DILocation(line: 329, column: 115, scope: !867)
!882 = !DILocation(line: 331, column: 40, scope: !867)
!883 = !DILocation(line: 331, column: 48, scope: !867)
!884 = !DILocation(line: 331, column: 28, scope: !867)
!885 = !DILocation(line: 331, column: 60, scope: !867)
!886 = !DILocation(line: 331, column: 65, scope: !867)
!887 = !DILocation(line: 331, column: 74, scope: !867)
!888 = !DILocation(line: 331, column: 83, scope: !867)
!889 = !DILocation(line: 331, column: 9, scope: !890)
!890 = !DILexicalBlockFile(scope: !867, file: !88, discriminator: 1)
!891 = !DILocation(line: 331, column: 2, scope: !867)
!892 = distinct !DISubprogram(name: "read_unsigned64_strvec", scope: !88, file: !88, line: 335, type: !893, isLocal: false, isDefinition: true, scopeLine: 336, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!893 = !DISubroutineType(types: !894)
!894 = !{!85, !843, !52, !593, !594, !594, !85}
!895 = !DILocalVariable(name: "strvec", arg: 1, scope: !892, file: !88, line: 335, type: !843)
!896 = !DILocation(line: 335, column: 40, scope: !892)
!897 = !DILocalVariable(name: "index", arg: 2, scope: !892, file: !88, line: 335, type: !52)
!898 = !DILocation(line: 335, column: 55, scope: !892)
!899 = !DILocalVariable(name: "res", arg: 3, scope: !892, file: !88, line: 335, type: !593)
!900 = !DILocation(line: 335, column: 72, scope: !892)
!901 = !DILocalVariable(name: "min_val", arg: 4, scope: !892, file: !88, line: 335, type: !594)
!902 = !DILocation(line: 335, column: 86, scope: !892)
!903 = !DILocalVariable(name: "max_val", arg: 5, scope: !892, file: !88, line: 335, type: !594)
!904 = !DILocation(line: 335, column: 104, scope: !892)
!905 = !DILocalVariable(name: "ignore_error", arg: 6, scope: !892, file: !88, line: 335, type: !85)
!906 = !DILocation(line: 335, column: 117, scope: !892)
!907 = !DILocation(line: 337, column: 42, scope: !892)
!908 = !DILocation(line: 337, column: 50, scope: !892)
!909 = !DILocation(line: 337, column: 30, scope: !892)
!910 = !DILocation(line: 337, column: 62, scope: !892)
!911 = !DILocation(line: 337, column: 67, scope: !892)
!912 = !DILocation(line: 337, column: 76, scope: !892)
!913 = !DILocation(line: 337, column: 85, scope: !892)
!914 = !DILocation(line: 337, column: 9, scope: !915)
!915 = !DILexicalBlockFile(scope: !892, file: !88, discriminator: 1)
!916 = !DILocation(line: 337, column: 2, scope: !892)
!917 = distinct !DISubprogram(name: "read_double_strvec", scope: !88, file: !88, line: 341, type: !918, isLocal: false, isDefinition: true, scopeLine: 342, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!918 = !DISubroutineType(types: !919)
!919 = !{!85, !843, !52, !720, !721, !721, !85}
!920 = !DILocalVariable(name: "strvec", arg: 1, scope: !917, file: !88, line: 341, type: !843)
!921 = !DILocation(line: 341, column: 36, scope: !917)
!922 = !DILocalVariable(name: "index", arg: 2, scope: !917, file: !88, line: 341, type: !52)
!923 = !DILocation(line: 341, column: 51, scope: !917)
!924 = !DILocalVariable(name: "res", arg: 3, scope: !917, file: !88, line: 341, type: !720)
!925 = !DILocation(line: 341, column: 66, scope: !917)
!926 = !DILocalVariable(name: "min_val", arg: 4, scope: !917, file: !88, line: 341, type: !721)
!927 = !DILocation(line: 341, column: 78, scope: !917)
!928 = !DILocalVariable(name: "max_val", arg: 5, scope: !917, file: !88, line: 341, type: !721)
!929 = !DILocation(line: 341, column: 94, scope: !917)
!930 = !DILocalVariable(name: "ignore_error", arg: 6, scope: !917, file: !88, line: 341, type: !85)
!931 = !DILocation(line: 341, column: 107, scope: !917)
!932 = !DILocation(line: 343, column: 38, scope: !917)
!933 = !DILocation(line: 343, column: 46, scope: !917)
!934 = !DILocation(line: 343, column: 26, scope: !917)
!935 = !DILocation(line: 343, column: 54, scope: !917)
!936 = !DILocation(line: 343, column: 59, scope: !917)
!937 = !DILocation(line: 343, column: 68, scope: !917)
!938 = !DILocation(line: 343, column: 77, scope: !917)
!939 = !DILocation(line: 343, column: 9, scope: !940)
!940 = !DILexicalBlockFile(scope: !917, file: !88, discriminator: 1)
!941 = !DILocation(line: 343, column: 2, scope: !917)
!942 = distinct !DISubprogram(name: "read_unsigned_base_strvec", scope: !88, file: !88, line: 347, type: !943, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!943 = !DISubroutineType(types: !944)
!944 = !{!85, !843, !52, !50, !465, !58, !58, !85}
!945 = !DILocalVariable(name: "strvec", arg: 1, scope: !942, file: !88, line: 347, type: !843)
!946 = !DILocation(line: 347, column: 43, scope: !942)
!947 = !DILocalVariable(name: "index", arg: 2, scope: !942, file: !88, line: 347, type: !52)
!948 = !DILocation(line: 347, column: 58, scope: !942)
!949 = !DILocalVariable(name: "base", arg: 3, scope: !942, file: !88, line: 347, type: !50)
!950 = !DILocation(line: 347, column: 69, scope: !942)
!951 = !DILocalVariable(name: "res", arg: 4, scope: !942, file: !88, line: 347, type: !465)
!952 = !DILocation(line: 347, column: 85, scope: !942)
!953 = !DILocalVariable(name: "min_val", arg: 5, scope: !942, file: !88, line: 347, type: !58)
!954 = !DILocation(line: 347, column: 99, scope: !942)
!955 = !DILocalVariable(name: "max_val", arg: 6, scope: !942, file: !88, line: 347, type: !58)
!956 = !DILocation(line: 347, column: 117, scope: !942)
!957 = !DILocalVariable(name: "ignore_error", arg: 7, scope: !942, file: !88, line: 347, type: !85)
!958 = !DILocation(line: 347, column: 130, scope: !942)
!959 = !DILocation(line: 349, column: 40, scope: !942)
!960 = !DILocation(line: 349, column: 48, scope: !942)
!961 = !DILocation(line: 349, column: 28, scope: !942)
!962 = !DILocation(line: 349, column: 56, scope: !942)
!963 = !DILocation(line: 349, column: 62, scope: !942)
!964 = !DILocation(line: 349, column: 67, scope: !942)
!965 = !DILocation(line: 349, column: 76, scope: !942)
!966 = !DILocation(line: 349, column: 85, scope: !942)
!967 = !DILocation(line: 349, column: 9, scope: !968)
!968 = !DILexicalBlockFile(scope: !942, file: !88, discriminator: 1)
!969 = !DILocation(line: 349, column: 2, scope: !942)
!970 = distinct !DISubprogram(name: "install_sublevel", scope: !88, file: !88, line: 394, type: !82, isLocal: false, isDefinition: true, scopeLine: 395, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!971 = !DILocation(line: 396, column: 10, scope: !970)
!972 = !DILocation(line: 397, column: 1, scope: !970)
!973 = distinct !DISubprogram(name: "install_sublevel_end", scope: !88, file: !88, line: 400, type: !82, isLocal: false, isDefinition: true, scopeLine: 401, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!974 = !DILocation(line: 402, column: 10, scope: !973)
!975 = !DILocation(line: 403, column: 1, scope: !973)
!976 = distinct !DISubprogram(name: "install_keyword_root", scope: !88, file: !88, line: 406, type: !977, isLocal: false, isDefinition: true, scopeLine: 407, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!977 = !DISubroutineType(types: !978)
!978 = !{null, !64, !67, !85}
!979 = !DILocalVariable(name: "string", arg: 1, scope: !976, file: !88, line: 406, type: !64)
!980 = !DILocation(line: 406, column: 34, scope: !976)
!981 = !DILocalVariable(name: "handler", arg: 2, scope: !976, file: !88, line: 406, type: !67)
!982 = !DILocation(line: 406, column: 49, scope: !976)
!983 = !DILocalVariable(name: "active", arg: 3, scope: !976, file: !88, line: 406, type: !85)
!984 = !DILocation(line: 406, column: 76, scope: !976)
!985 = !DILocation(line: 410, column: 16, scope: !976)
!986 = !DILocation(line: 410, column: 26, scope: !976)
!987 = !DILocation(line: 410, column: 34, scope: !976)
!988 = !DILocation(line: 410, column: 43, scope: !976)
!989 = !DILocation(line: 410, column: 2, scope: !976)
!990 = !DILocation(line: 411, column: 1, scope: !976)
!991 = distinct !DISubprogram(name: "keyword_alloc", scope: !88, file: !88, line: 353, type: !992, isLocal: true, isDefinition: true, scopeLine: 354, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!992 = !DISubroutineType(types: !993)
!993 = !{null, !70, !64, !67, !85}
!994 = !DILocalVariable(name: "keywords_vec", arg: 1, scope: !991, file: !88, line: 353, type: !70)
!995 = !DILocation(line: 353, column: 25, scope: !991)
!996 = !DILocalVariable(name: "string", arg: 2, scope: !991, file: !88, line: 353, type: !64)
!997 = !DILocation(line: 353, column: 51, scope: !991)
!998 = !DILocalVariable(name: "handler", arg: 3, scope: !991, file: !88, line: 353, type: !67)
!999 = !DILocation(line: 353, column: 66, scope: !991)
!1000 = !DILocalVariable(name: "active", arg: 4, scope: !991, file: !88, line: 353, type: !85)
!1001 = !DILocation(line: 353, column: 93, scope: !991)
!1002 = !DILocalVariable(name: "keyword", scope: !991, file: !88, line: 355, type: !59)
!1003 = !DILocation(line: 355, column: 13, scope: !991)
!1004 = !DILocation(line: 357, column: 23, scope: !991)
!1005 = !DILocation(line: 357, column: 3, scope: !991)
!1006 = !DILocation(line: 359, column: 27, scope: !991)
!1007 = !DILocation(line: 359, column: 12, scope: !991)
!1008 = !DILocation(line: 359, column: 10, scope: !991)
!1009 = !DILocation(line: 360, column: 20, scope: !991)
!1010 = !DILocation(line: 360, column: 2, scope: !991)
!1011 = !DILocation(line: 360, column: 11, scope: !991)
!1012 = !DILocation(line: 360, column: 18, scope: !991)
!1013 = !DILocation(line: 361, column: 21, scope: !991)
!1014 = !DILocation(line: 361, column: 2, scope: !991)
!1015 = !DILocation(line: 361, column: 11, scope: !991)
!1016 = !DILocation(line: 361, column: 19, scope: !991)
!1017 = !DILocation(line: 362, column: 20, scope: !991)
!1018 = !DILocation(line: 362, column: 2, scope: !991)
!1019 = !DILocation(line: 362, column: 11, scope: !991)
!1020 = !DILocation(line: 362, column: 18, scope: !991)
!1021 = !DILocation(line: 364, column: 18, scope: !991)
!1022 = !DILocation(line: 364, column: 32, scope: !991)
!1023 = !DILocation(line: 364, column: 2, scope: !991)
!1024 = !DILocation(line: 365, column: 1, scope: !991)
!1025 = distinct !DISubprogram(name: "install_root_end_handler", scope: !88, file: !88, line: 414, type: !1026, isLocal: false, isDefinition: true, scopeLine: 415, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{null, !81}
!1028 = !DILocalVariable(name: "handler", arg: 1, scope: !1025, file: !88, line: 414, type: !81)
!1029 = !DILocation(line: 414, column: 33, scope: !1025)
!1030 = !DILocalVariable(name: "keyword", scope: !1025, file: !88, line: 416, type: !59)
!1031 = !DILocation(line: 416, column: 13, scope: !1025)
!1032 = !DILocation(line: 419, column: 33, scope: !1025)
!1033 = !DILocation(line: 419, column: 44, scope: !1025)
!1034 = !DILocation(line: 419, column: 55, scope: !1025)
!1035 = !DILocation(line: 419, column: 13, scope: !1025)
!1036 = !DILocation(line: 419, column: 14, scope: !1025)
!1037 = !DILocation(line: 419, column: 25, scope: !1025)
!1038 = !DILocation(line: 419, column: 12, scope: !1025)
!1039 = !DILocation(line: 419, column: 10, scope: !1025)
!1040 = !DILocation(line: 421, column: 7, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1025, file: !88, line: 421, column: 6)
!1042 = !DILocation(line: 421, column: 16, scope: !1041)
!1043 = !DILocation(line: 421, column: 6, scope: !1025)
!1044 = !DILocation(line: 422, column: 3, scope: !1041)
!1045 = !DILocation(line: 424, column: 31, scope: !1025)
!1046 = !DILocation(line: 424, column: 2, scope: !1025)
!1047 = !DILocation(line: 424, column: 11, scope: !1025)
!1048 = !DILocation(line: 424, column: 29, scope: !1025)
!1049 = !DILocation(line: 425, column: 1, scope: !1025)
!1050 = !DILocation(line: 425, column: 1, scope: !1051)
!1051 = !DILexicalBlockFile(scope: !1025, file: !88, discriminator: 1)
!1052 = distinct !DISubprogram(name: "install_keyword", scope: !88, file: !88, line: 428, type: !1053, isLocal: false, isDefinition: true, scopeLine: 429, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{null, !64, !67}
!1055 = !DILocalVariable(name: "string", arg: 1, scope: !1052, file: !88, line: 428, type: !64)
!1056 = !DILocation(line: 428, column: 29, scope: !1052)
!1057 = !DILocalVariable(name: "handler", arg: 2, scope: !1052, file: !88, line: 428, type: !67)
!1058 = !DILocation(line: 428, column: 44, scope: !1052)
!1059 = !DILocation(line: 430, column: 20, scope: !1052)
!1060 = !DILocation(line: 430, column: 30, scope: !1052)
!1061 = !DILocation(line: 430, column: 38, scope: !1052)
!1062 = !DILocation(line: 430, column: 2, scope: !1052)
!1063 = !DILocation(line: 431, column: 1, scope: !1052)
!1064 = distinct !DISubprogram(name: "keyword_alloc_sub", scope: !88, file: !88, line: 368, type: !1065, isLocal: true, isDefinition: true, scopeLine: 369, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{null, !70, !64, !67}
!1067 = !DILocalVariable(name: "keywords_vec", arg: 1, scope: !1064, file: !88, line: 368, type: !70)
!1068 = !DILocation(line: 368, column: 29, scope: !1064)
!1069 = !DILocalVariable(name: "string", arg: 2, scope: !1064, file: !88, line: 368, type: !64)
!1070 = !DILocation(line: 368, column: 55, scope: !1064)
!1071 = !DILocalVariable(name: "handler", arg: 3, scope: !1064, file: !88, line: 368, type: !67)
!1072 = !DILocation(line: 368, column: 70, scope: !1064)
!1073 = !DILocalVariable(name: "i", scope: !1064, file: !88, line: 370, type: !50)
!1074 = !DILocation(line: 370, column: 6, scope: !1064)
!1075 = !DILocalVariable(name: "keyword", scope: !1064, file: !88, line: 371, type: !59)
!1076 = !DILocation(line: 371, column: 13, scope: !1064)
!1077 = !DILocation(line: 374, column: 37, scope: !1064)
!1078 = !DILocation(line: 374, column: 52, scope: !1064)
!1079 = !DILocation(line: 374, column: 63, scope: !1064)
!1080 = !DILocation(line: 374, column: 13, scope: !1064)
!1081 = !DILocation(line: 374, column: 14, scope: !1064)
!1082 = !DILocation(line: 374, column: 29, scope: !1064)
!1083 = !DILocation(line: 374, column: 12, scope: !1064)
!1084 = !DILocation(line: 374, column: 10, scope: !1064)
!1085 = !DILocation(line: 377, column: 7, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1064, file: !88, line: 377, column: 6)
!1087 = !DILocation(line: 377, column: 16, scope: !1086)
!1088 = !DILocation(line: 377, column: 6, scope: !1064)
!1089 = !DILocation(line: 378, column: 3, scope: !1086)
!1090 = !DILocation(line: 381, column: 9, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1064, file: !88, line: 381, column: 2)
!1092 = !DILocation(line: 381, column: 7, scope: !1091)
!1093 = !DILocation(line: 381, column: 14, scope: !1094)
!1094 = !DILexicalBlockFile(scope: !1095, file: !88, discriminator: 1)
!1095 = distinct !DILexicalBlock(scope: !1091, file: !88, line: 381, column: 2)
!1096 = !DILocation(line: 381, column: 18, scope: !1094)
!1097 = !DILocation(line: 381, column: 16, scope: !1094)
!1098 = !DILocation(line: 381, column: 2, scope: !1094)
!1099 = !DILocation(line: 382, column: 38, scope: !1095)
!1100 = !DILocation(line: 382, column: 47, scope: !1095)
!1101 = !DILocation(line: 382, column: 53, scope: !1095)
!1102 = !DILocation(line: 382, column: 64, scope: !1095)
!1103 = !DILocation(line: 382, column: 14, scope: !1095)
!1104 = !DILocation(line: 382, column: 15, scope: !1095)
!1105 = !DILocation(line: 382, column: 24, scope: !1095)
!1106 = !DILocation(line: 382, column: 30, scope: !1095)
!1107 = !DILocation(line: 382, column: 13, scope: !1095)
!1108 = !DILocation(line: 382, column: 11, scope: !1095)
!1109 = !DILocation(line: 382, column: 3, scope: !1095)
!1110 = !DILocation(line: 381, column: 29, scope: !1111)
!1111 = !DILexicalBlockFile(scope: !1095, file: !88, discriminator: 2)
!1112 = !DILocation(line: 381, column: 2, scope: !1111)
!1113 = distinct !{!1113, !1114}
!1114 = !DILocation(line: 381, column: 2, scope: !1064)
!1115 = !DILocation(line: 385, column: 7, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1064, file: !88, line: 385, column: 6)
!1117 = !DILocation(line: 385, column: 16, scope: !1116)
!1118 = !DILocation(line: 385, column: 6, scope: !1064)
!1119 = !DILocation(line: 386, column: 19, scope: !1116)
!1120 = !DILocation(line: 386, column: 3, scope: !1116)
!1121 = !DILocation(line: 386, column: 12, scope: !1116)
!1122 = !DILocation(line: 386, column: 16, scope: !1116)
!1123 = !DILocation(line: 389, column: 16, scope: !1064)
!1124 = !DILocation(line: 389, column: 25, scope: !1064)
!1125 = !DILocation(line: 389, column: 30, scope: !1064)
!1126 = !DILocation(line: 389, column: 38, scope: !1064)
!1127 = !DILocation(line: 389, column: 2, scope: !1064)
!1128 = !DILocation(line: 390, column: 1, scope: !1064)
!1129 = !DILocation(line: 390, column: 1, scope: !1130)
!1130 = !DILexicalBlockFile(scope: !1064, file: !88, discriminator: 1)
!1131 = distinct !DISubprogram(name: "install_sublevel_end_handler", scope: !88, file: !88, line: 434, type: !1026, isLocal: false, isDefinition: true, scopeLine: 435, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!1132 = !DILocalVariable(name: "handler", arg: 1, scope: !1131, file: !88, line: 434, type: !81)
!1133 = !DILocation(line: 434, column: 37, scope: !1131)
!1134 = !DILocalVariable(name: "i", scope: !1131, file: !88, line: 436, type: !50)
!1135 = !DILocation(line: 436, column: 6, scope: !1131)
!1136 = !DILocalVariable(name: "keyword", scope: !1131, file: !88, line: 437, type: !59)
!1137 = !DILocation(line: 437, column: 13, scope: !1131)
!1138 = !DILocation(line: 440, column: 33, scope: !1131)
!1139 = !DILocation(line: 440, column: 44, scope: !1131)
!1140 = !DILocation(line: 440, column: 55, scope: !1131)
!1141 = !DILocation(line: 440, column: 13, scope: !1131)
!1142 = !DILocation(line: 440, column: 14, scope: !1131)
!1143 = !DILocation(line: 440, column: 25, scope: !1131)
!1144 = !DILocation(line: 440, column: 12, scope: !1131)
!1145 = !DILocation(line: 440, column: 10, scope: !1131)
!1146 = !DILocation(line: 442, column: 7, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1131, file: !88, line: 442, column: 6)
!1148 = !DILocation(line: 442, column: 16, scope: !1147)
!1149 = !DILocation(line: 442, column: 6, scope: !1131)
!1150 = !DILocation(line: 443, column: 3, scope: !1147)
!1151 = !DILocation(line: 446, column: 9, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1131, file: !88, line: 446, column: 2)
!1153 = !DILocation(line: 446, column: 7, scope: !1152)
!1154 = !DILocation(line: 446, column: 14, scope: !1155)
!1155 = !DILexicalBlockFile(scope: !1156, file: !88, discriminator: 1)
!1156 = distinct !DILexicalBlock(scope: !1152, file: !88, line: 446, column: 2)
!1157 = !DILocation(line: 446, column: 18, scope: !1155)
!1158 = !DILocation(line: 446, column: 16, scope: !1155)
!1159 = !DILocation(line: 446, column: 2, scope: !1155)
!1160 = !DILocation(line: 447, column: 38, scope: !1156)
!1161 = !DILocation(line: 447, column: 47, scope: !1156)
!1162 = !DILocation(line: 447, column: 53, scope: !1156)
!1163 = !DILocation(line: 447, column: 64, scope: !1156)
!1164 = !DILocation(line: 447, column: 14, scope: !1156)
!1165 = !DILocation(line: 447, column: 15, scope: !1156)
!1166 = !DILocation(line: 447, column: 24, scope: !1156)
!1167 = !DILocation(line: 447, column: 30, scope: !1156)
!1168 = !DILocation(line: 447, column: 13, scope: !1156)
!1169 = !DILocation(line: 447, column: 11, scope: !1156)
!1170 = !DILocation(line: 447, column: 3, scope: !1156)
!1171 = !DILocation(line: 446, column: 29, scope: !1172)
!1172 = !DILexicalBlockFile(scope: !1156, file: !88, discriminator: 2)
!1173 = !DILocation(line: 446, column: 2, scope: !1172)
!1174 = distinct !{!1174, !1175}
!1175 = !DILocation(line: 446, column: 2, scope: !1131)
!1176 = !DILocation(line: 448, column: 31, scope: !1131)
!1177 = !DILocation(line: 448, column: 2, scope: !1131)
!1178 = !DILocation(line: 448, column: 11, scope: !1131)
!1179 = !DILocation(line: 448, column: 29, scope: !1131)
!1180 = !DILocation(line: 449, column: 1, scope: !1131)
!1181 = !DILocation(line: 449, column: 1, scope: !1182)
!1182 = !DILexicalBlockFile(scope: !1131, file: !88, discriminator: 1)
!1183 = distinct !DISubprogram(name: "alloc_strvec_quoted_escaped", scope: !88, file: !88, line: 515, type: !1184, isLocal: false, isDefinition: true, scopeLine: 516, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !103)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!70, !55}
!1186 = !DILocalVariable(name: "src", arg: 1, scope: !1183, file: !88, line: 515, type: !55)
!1187 = !DILocation(line: 515, column: 35, scope: !1183)
!1188 = !DILocalVariable(name: "token", scope: !1183, file: !88, line: 517, type: !55)
!1189 = !DILocation(line: 517, column: 8, scope: !1183)
!1190 = !DILocalVariable(name: "strvec", scope: !1183, file: !88, line: 518, type: !70)
!1191 = !DILocation(line: 518, column: 12, scope: !1183)
!1192 = !DILocalVariable(name: "cur_quote", scope: !1183, file: !88, line: 519, type: !56)
!1193 = !DILocation(line: 519, column: 7, scope: !1183)
!1194 = !DILocalVariable(name: "ofs_op", scope: !1183, file: !88, line: 520, type: !55)
!1195 = !DILocation(line: 520, column: 8, scope: !1183)
!1196 = !DILocalVariable(name: "op_buf", scope: !1183, file: !88, line: 521, type: !55)
!1197 = !DILocation(line: 521, column: 8, scope: !1183)
!1198 = !DILocalVariable(name: "ofs", scope: !1183, file: !88, line: 522, type: !55)
!1199 = !DILocation(line: 522, column: 8, scope: !1183)
!1200 = !DILocalVariable(name: "ofs1", scope: !1183, file: !88, line: 522, type: !55)
!1201 = !DILocation(line: 522, column: 14, scope: !1183)
!1202 = !DILocalVariable(name: "op_char", scope: !1183, file: !88, line: 523, type: !56)
!1203 = !DILocation(line: 523, column: 7, scope: !1183)
!1204 = !DILocation(line: 525, column: 7, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1183, file: !88, line: 525, column: 6)
!1206 = !DILocation(line: 525, column: 6, scope: !1183)
!1207 = !DILocation(line: 526, column: 8, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1209, file: !88, line: 526, column: 7)
!1209 = distinct !DILexicalBlock(scope: !1205, file: !88, line: 525, column: 12)
!1210 = !DILocation(line: 526, column: 7, scope: !1209)
!1211 = !DILocation(line: 527, column: 4, scope: !1208)
!1212 = !DILocation(line: 528, column: 9, scope: !1209)
!1213 = !DILocation(line: 528, column: 7, scope: !1209)
!1214 = !DILocation(line: 529, column: 2, scope: !1209)
!1215 = !DILocation(line: 532, column: 12, scope: !1183)
!1216 = !DILocation(line: 532, column: 9, scope: !1183)
!1217 = !DILocation(line: 533, column: 12, scope: !1183)
!1218 = !DILocation(line: 533, column: 9, scope: !1183)
!1219 = !DILocation(line: 535, column: 8, scope: !1183)
!1220 = !DILocation(line: 535, column: 6, scope: !1183)
!1221 = !DILocation(line: 536, column: 2, scope: !1183)
!1222 = !DILocation(line: 536, column: 10, scope: !1223)
!1223 = !DILexicalBlockFile(scope: !1183, file: !88, discriminator: 1)
!1224 = !DILocation(line: 536, column: 9, scope: !1223)
!1225 = !DILocation(line: 536, column: 2, scope: !1223)
!1226 = !DILocation(line: 538, column: 17, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1183, file: !88, line: 536, column: 15)
!1228 = !DILocation(line: 538, column: 22, scope: !1227)
!1229 = !DILocation(line: 538, column: 10, scope: !1227)
!1230 = !DILocation(line: 538, column: 7, scope: !1227)
!1231 = !DILocation(line: 539, column: 9, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1227, file: !88, line: 539, column: 7)
!1233 = !DILocation(line: 539, column: 8, scope: !1232)
!1234 = !DILocation(line: 539, column: 13, scope: !1232)
!1235 = !DILocation(line: 539, column: 30, scope: !1236)
!1236 = !DILexicalBlockFile(scope: !1232, file: !88, discriminator: 1)
!1237 = !DILocation(line: 539, column: 29, scope: !1236)
!1238 = !DILocation(line: 539, column: 16, scope: !1236)
!1239 = !DILocation(line: 539, column: 7, scope: !1236)
!1240 = !DILocation(line: 540, column: 4, scope: !1232)
!1241 = !DILocation(line: 542, column: 12, scope: !1227)
!1242 = !DILocation(line: 542, column: 10, scope: !1227)
!1243 = !DILocation(line: 544, column: 3, scope: !1227)
!1244 = !DILocation(line: 544, column: 11, scope: !1245)
!1245 = !DILexicalBlockFile(scope: !1227, file: !88, discriminator: 1)
!1246 = !DILocation(line: 544, column: 10, scope: !1245)
!1247 = !DILocation(line: 544, column: 3, scope: !1245)
!1248 = !DILocation(line: 545, column: 19, scope: !1249)
!1249 = distinct !DILexicalBlock(scope: !1227, file: !88, line: 544, column: 16)
!1250 = !DILocation(line: 545, column: 24, scope: !1249)
!1251 = !DILocation(line: 545, column: 34, scope: !1249)
!1252 = !DILocation(line: 545, column: 24, scope: !1253)
!1253 = !DILexicalBlockFile(scope: !1249, file: !88, discriminator: 1)
!1254 = !DILocation(line: 545, column: 52, scope: !1255)
!1255 = !DILexicalBlockFile(scope: !1249, file: !88, discriminator: 2)
!1256 = !DILocation(line: 545, column: 62, scope: !1255)
!1257 = !DILocation(line: 545, column: 24, scope: !1255)
!1258 = !DILocation(line: 545, column: 24, scope: !1259)
!1259 = !DILexicalBlockFile(scope: !1249, file: !88, discriminator: 3)
!1260 = !DILocation(line: 545, column: 11, scope: !1259)
!1261 = !DILocation(line: 545, column: 9, scope: !1259)
!1262 = !DILocation(line: 547, column: 9, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1249, file: !88, line: 547, column: 8)
!1264 = !DILocation(line: 547, column: 8, scope: !1249)
!1265 = !DILocalVariable(name: "len", scope: !1266, file: !88, line: 548, type: !52)
!1266 = distinct !DILexicalBlock(scope: !1263, file: !88, line: 547, column: 15)
!1267 = !DILocation(line: 548, column: 12, scope: !1266)
!1268 = !DILocation(line: 549, column: 9, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1266, file: !88, line: 549, column: 9)
!1270 = !DILocation(line: 549, column: 9, scope: !1266)
!1271 = !DILocation(line: 550, column: 89, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1269, file: !88, line: 549, column: 20)
!1273 = !DILocation(line: 550, column: 94, scope: !1272)
!1274 = !DILocation(line: 550, column: 6, scope: !1272)
!1275 = !DILocation(line: 551, column: 1, scope: !1272)
!1276 = !DILocation(line: 552, column: 6, scope: !1272)
!1277 = !DILocation(line: 554, column: 12, scope: !1266)
!1278 = !DILocation(line: 554, column: 20, scope: !1266)
!1279 = !DILocation(line: 554, column: 5, scope: !1266)
!1280 = !DILocation(line: 555, column: 18, scope: !1266)
!1281 = !DILocation(line: 555, column: 11, scope: !1266)
!1282 = !DILocation(line: 555, column: 9, scope: !1266)
!1283 = !DILocation(line: 556, column: 12, scope: !1266)
!1284 = !DILocation(line: 556, column: 9, scope: !1266)
!1285 = !DILocation(line: 557, column: 15, scope: !1266)
!1286 = !DILocation(line: 557, column: 12, scope: !1266)
!1287 = !DILocation(line: 558, column: 5, scope: !1266)
!1288 = !DILocation(line: 562, column: 12, scope: !1249)
!1289 = !DILocation(line: 562, column: 20, scope: !1249)
!1290 = !DILocation(line: 562, column: 25, scope: !1249)
!1291 = !DILocation(line: 562, column: 32, scope: !1249)
!1292 = !DILocation(line: 562, column: 30, scope: !1249)
!1293 = !DILocation(line: 562, column: 4, scope: !1249)
!1294 = !DILocation(line: 563, column: 14, scope: !1249)
!1295 = !DILocation(line: 563, column: 21, scope: !1249)
!1296 = !DILocation(line: 563, column: 19, scope: !1249)
!1297 = !DILocation(line: 563, column: 11, scope: !1249)
!1298 = !DILocation(line: 564, column: 10, scope: !1249)
!1299 = !DILocation(line: 564, column: 8, scope: !1249)
!1300 = !DILocation(line: 566, column: 9, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !1249, file: !88, line: 566, column: 8)
!1302 = !DILocation(line: 566, column: 8, scope: !1301)
!1303 = !DILocation(line: 566, column: 13, scope: !1301)
!1304 = !DILocation(line: 566, column: 8, scope: !1249)
!1305 = !DILocation(line: 568, column: 8, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1301, file: !88, line: 566, column: 22)
!1307 = !DILocation(line: 570, column: 11, scope: !1308)
!1308 = distinct !DILexicalBlock(scope: !1306, file: !88, line: 570, column: 9)
!1309 = !DILocation(line: 570, column: 10, scope: !1308)
!1310 = !DILocation(line: 570, column: 9, scope: !1306)
!1311 = !DILocation(line: 570, column: 63, scope: !1312)
!1312 = !DILexicalBlockFile(scope: !1313, file: !88, discriminator: 1)
!1313 = distinct !DILexicalBlock(scope: !1308, file: !88, line: 570, column: 16)
!1314 = !DILocation(line: 571, column: 6, scope: !1313)
!1315 = !DILocation(line: 571, column: 1, scope: !1312)
!1316 = !DILocation(line: 572, column: 6, scope: !1313)
!1317 = !DILocation(line: 575, column: 10, scope: !1318)
!1318 = distinct !DILexicalBlock(scope: !1306, file: !88, line: 575, column: 9)
!1319 = !DILocation(line: 575, column: 9, scope: !1318)
!1320 = !DILocation(line: 575, column: 14, scope: !1318)
!1321 = !DILocation(line: 575, column: 21, scope: !1318)
!1322 = !DILocation(line: 574, column: 23, scope: !1318)
!1323 = !DILocation(line: 574, column: 44, scope: !1318)
!1324 = !DILocation(line: 574, column: 24, scope: !1318)
!1325 = !DILocation(line: 574, column: 26, scope: !1318)
!1326 = !DILocation(line: 574, column: 25, scope: !1318)
!1327 = !DILocation(line: 574, column: 27, scope: !1318)
!1328 = !DILocation(line: 575, column: 9, scope: !1329)
!1329 = !DILexicalBlockFile(scope: !1306, file: !88, discriminator: 1)
!1330 = !DILocation(line: 575, column: 14, scope: !1331)
!1331 = !DILexicalBlockFile(scope: !1332, file: !88, discriminator: 2)
!1332 = distinct !DILexicalBlock(scope: !1318, file: !88, line: 574, column: 41)
!1333 = !DILocation(line: 576, column: 9, scope: !1332)
!1334 = !DILocation(line: 577, column: 6, scope: !1332)
!1335 = !DILocation(line: 577, column: 13, scope: !1336)
!1336 = !DILexicalBlockFile(scope: !1332, file: !88, discriminator: 1)
!1337 = !DILocation(line: 577, column: 12, scope: !1336)
!1338 = !DILocation(line: 577, column: 33, scope: !1336)
!1339 = !DILocation(line: 577, column: 15, scope: !1336)
!1340 = !DILocation(line: 577, column: 14, scope: !1336)
!1341 = !DILocation(line: 577, column: 16, scope: !1336)
!1342 = !DILocation(line: 577, column: 6, scope: !1336)
!1343 = !DILocation(line: 578, column: 15, scope: !1344)
!1344 = distinct !DILexicalBlock(scope: !1332, file: !88, line: 577, column: 28)
!1345 = !DILocation(line: 579, column: 18, scope: !1344)
!1346 = !DILocation(line: 579, column: 17, scope: !1344)
!1347 = !DILocation(line: 579, column: 38, scope: !1344)
!1348 = !DILocation(line: 579, column: 20, scope: !1344)
!1349 = !DILocation(line: 579, column: 19, scope: !1344)
!1350 = !DILocation(line: 579, column: 21, scope: !1344)
!1351 = !DILocation(line: 579, column: 34, scope: !1352)
!1352 = !DILexicalBlockFile(scope: !1344, file: !88, discriminator: 1)
!1353 = !DILocation(line: 579, column: 33, scope: !1352)
!1354 = !DILocation(line: 579, column: 38, scope: !1352)
!1355 = !DILocation(line: 579, column: 17, scope: !1352)
!1356 = !DILocation(line: 579, column: 53, scope: !1357)
!1357 = !DILexicalBlockFile(scope: !1344, file: !88, discriminator: 2)
!1358 = !DILocation(line: 579, column: 52, scope: !1357)
!1359 = !DILocation(line: 579, column: 50, scope: !1357)
!1360 = !DILocation(line: 579, column: 61, scope: !1357)
!1361 = !DILocation(line: 579, column: 60, scope: !1357)
!1362 = !DILocation(line: 579, column: 81, scope: !1357)
!1363 = !DILocation(line: 579, column: 63, scope: !1357)
!1364 = !DILocation(line: 579, column: 62, scope: !1357)
!1365 = !DILocation(line: 579, column: 64, scope: !1357)
!1366 = !DILocation(line: 579, column: 57, scope: !1357)
!1367 = !DILocation(line: 579, column: 17, scope: !1357)
!1368 = !DILocation(line: 579, column: 17, scope: !1369)
!1369 = !DILexicalBlockFile(scope: !1344, file: !88, discriminator: 3)
!1370 = !DILocation(line: 579, column: 15, scope: !1369)
!1371 = !DILocation(line: 580, column: 10, scope: !1344)
!1372 = !DILocation(line: 577, column: 6, scope: !1331)
!1373 = distinct !{!1373, !1334}
!1374 = !DILocation(line: 582, column: 5, scope: !1332)
!1375 = !DILocation(line: 583, column: 15, scope: !1376)
!1376 = distinct !DILexicalBlock(scope: !1318, file: !88, line: 583, column: 14)
!1377 = !DILocation(line: 583, column: 14, scope: !1376)
!1378 = !DILocation(line: 583, column: 19, scope: !1376)
!1379 = !DILocation(line: 583, column: 26, scope: !1376)
!1380 = !DILocation(line: 583, column: 29, scope: !1381)
!1381 = !DILexicalBlockFile(scope: !1376, file: !88, discriminator: 1)
!1382 = !DILocation(line: 583, column: 14, scope: !1381)
!1383 = !DILocation(line: 584, column: 17, scope: !1384)
!1384 = distinct !DILexicalBlock(scope: !1376, file: !88, line: 583, column: 37)
!1385 = !DILocation(line: 584, column: 16, scope: !1384)
!1386 = !DILocation(line: 584, column: 23, scope: !1384)
!1387 = !DILocation(line: 584, column: 14, scope: !1384)
!1388 = !DILocation(line: 585, column: 9, scope: !1384)
!1389 = !DILocation(line: 586, column: 5, scope: !1384)
!1390 = !DILocation(line: 587, column: 15, scope: !1391)
!1391 = distinct !DILexicalBlock(scope: !1376, file: !88, line: 587, column: 14)
!1392 = !DILocation(line: 587, column: 14, scope: !1391)
!1393 = !DILocation(line: 587, column: 19, scope: !1391)
!1394 = !DILocation(line: 587, column: 26, scope: !1391)
!1395 = !DILocation(line: 587, column: 30, scope: !1396)
!1396 = !DILexicalBlockFile(scope: !1391, file: !88, discriminator: 1)
!1397 = !DILocation(line: 587, column: 29, scope: !1396)
!1398 = !DILocation(line: 587, column: 34, scope: !1396)
!1399 = !DILocation(line: 587, column: 14, scope: !1396)
!1400 = !DILocation(line: 588, column: 20, scope: !1401)
!1401 = distinct !DILexicalBlock(scope: !1391, file: !88, line: 587, column: 42)
!1402 = !DILocation(line: 588, column: 16, scope: !1401)
!1403 = !DILocation(line: 588, column: 23, scope: !1401)
