; ModuleID = './[inter]lib--utils.o.i'
source_filename = "./[inter]lib--utils.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.utsname = type { [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8] }

@debug = global i64 0, align 8
@.str = private unnamed_addr constant [10 x i8] c"%*s%.4zu \00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"%3.2x\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"   \00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c" -\00", align 1
@.str.5 = private unnamed_addr constant [3 x i8] c"%c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !63, globals: !124)
!1 = !DIFile(filename: "[inter]lib--utils.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!2 = !{!3, !18, !34}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "global_bits", file: !4, line: 53, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "bitops.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "LOG_CONSOLE_BIT", value: 0)
!7 = !DIEnumerator(name: "NO_SYSLOG_BIT", value: 1)
!8 = !DIEnumerator(name: "DONT_FORK_BIT", value: 2)
!9 = !DIEnumerator(name: "DUMP_CONF_BIT", value: 3)
!10 = !DIEnumerator(name: "DONT_RELEASE_VRRP_BIT", value: 4)
!11 = !DIEnumerator(name: "RELEASE_VIPS_BIT", value: 5)
!12 = !DIEnumerator(name: "DONT_RELEASE_IPVS_BIT", value: 6)
!13 = !DIEnumerator(name: "LOG_DETAIL_BIT", value: 7)
!14 = !DIEnumerator(name: "LOG_EXTRA_DETAIL_BIT", value: 8)
!15 = !DIEnumerator(name: "DONT_RESPAWN_BIT", value: 9)
!16 = !DIEnumerator(name: "LOG_ADDRESS_CHANGES", value: 10)
!17 = !DIEnumerator(name: "CONFIG_TEST_BIT", value: 11)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 44, size: 32, align: 32, elements: !20)
!19 = !DIFile(filename: "parser.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33}
!21 = !DIEnumerator(name: "CONFIG_OK", value: 0)
!22 = !DIEnumerator(name: "CONFIG_FILE_NOT_FOUND", value: 1)
!23 = !DIEnumerator(name: "CONFIG_BAD_IF", value: 2)
!24 = !DIEnumerator(name: "CONFIG_FATAL", value: 3)
!25 = !DIEnumerator(name: "CONFIG_MULTIPLE_FILES", value: 4)
!26 = !DIEnumerator(name: "CONFIG_UNKNOWN_KEYWORD", value: 5)
!27 = !DIEnumerator(name: "CONFIG_UNEXPECTED_BOB", value: 6)
!28 = !DIEnumerator(name: "CONFIG_MISSING_BOB", value: 7)
!29 = !DIEnumerator(name: "CONFIG_UNMATCHED_QUOTE", value: 8)
!30 = !DIEnumerator(name: "CONFIG_MISSING_PARAMETER", value: 9)
!31 = !DIEnumerator(name: "CONFIG_INVALID_NUMBER", value: 10)
!32 = !DIEnumerator(name: "CONFIG_GENERAL_ERROR", value: 11)
!33 = !DIEnumerator(name: "CONFIG_SECURITY_ERROR", value: 12)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 40, size: 32, align: 32, elements: !36)
!35 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62}
!37 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!38 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!39 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!40 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!41 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!42 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!43 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!44 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!45 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!46 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!47 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!48 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!49 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!50 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!51 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!52 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!53 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!54 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!55 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!56 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!57 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!58 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!59 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!60 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!61 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!62 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!63 = !{!64, !67, !73, !74, !77, !108, !120, !122}
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !65, line: 216, baseType: !66)
!65 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!66 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !69, line: 33, baseType: !70)
!69 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !71, line: 30, baseType: !72)
!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!72 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !75, line: 28, baseType: !76)
!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!76 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !35, line: 254, size: 224, align: 32, elements: !79)
!79 = !{!80, !81, !85, !88, !107}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !78, file: !35, line: 256, baseType: !74, size: 16, align: 16)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !78, file: !35, line: 257, baseType: !82, size: 16, align: 16, offset: 16)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !35, line: 119, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !84, line: 49, baseType: !76)
!84 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !78, file: !35, line: 258, baseType: !86, size: 32, align: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !84, line: 51, baseType: !87)
!87 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !78, file: !35, line: 259, baseType: !89, size: 128, align: 32, offset: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !35, line: 211, size: 128, align: 32, elements: !90)
!90 = !{!91}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !89, file: !35, line: 220, baseType: !92, size: 128, align: 32)
!92 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !89, file: !35, line: 213, size: 128, align: 32, elements: !93)
!93 = !{!94, !99, !103}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !92, file: !35, line: 215, baseType: !95, size: 128, align: 8)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, align: 8, elements: !97)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !84, line: 48, baseType: !72)
!97 = !{!98}
!98 = !DISubrange(count: 16)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !92, file: !35, line: 217, baseType: !100, size: 128, align: 16)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 128, align: 16, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 8)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !92, file: !35, line: 218, baseType: !104, size: 128, align: 32)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 128, align: 32, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 4)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !78, file: !35, line: 260, baseType: !86, size: 32, align: 32, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !35, line: 239, size: 128, align: 32, elements: !110)
!110 = !{!111, !112, !113, !118}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !109, file: !35, line: 241, baseType: !74, size: 16, align: 16)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !109, file: !35, line: 242, baseType: !82, size: 16, align: 16, offset: 16)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !109, file: !35, line: 243, baseType: !114, size: 32, align: 32, offset: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !35, line: 31, size: 32, align: 32, elements: !115)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !114, file: !35, line: 33, baseType: !117, size: 32, align: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !35, line: 30, baseType: !86)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !109, file: !35, line: 246, baseType: !119, size: 64, align: 8, offset: 64)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 64, align: 8, elements: !101)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !69, line: 197, baseType: !121)
!121 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!124 = !{!125, !127, !135, !152, !157}
!125 = distinct !DIGlobalVariable(name: "debug", scope: !0, file: !126, line: 69, type: !66, isLocal: false, isDefinition: true, variable: i64* @debug)
!126 = !DIFile(filename: "utils.c", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!127 = distinct !DIGlobalVariable(name: "buf", scope: !128, file: !126, line: 363, type: !134, isLocal: true, isDefinition: true, variable: [16 x i8]* @inet_ntop2.buf)
!128 = distinct !DISubprogram(name: "inet_ntop2", scope: !126, file: !126, line: 361, type: !129, isLocal: false, isDefinition: true, scopeLine: 362, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !86}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!133 = !{}
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 128, align: 8, elements: !97)
!135 = distinct !DIGlobalVariable(name: "addr_str", scope: !136, file: !126, line: 563, type: !149, isLocal: true, isDefinition: true, variable: [46 x i8]* @inet_sockaddrtos.addr_str)
!136 = distinct !DISubprogram(name: "inet_sockaddrtos", scope: !126, file: !126, line: 561, type: !137, isLocal: false, isDefinition: true, scopeLine: 562, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!137 = !DISubroutineType(types: !138)
!138 = !{!131, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !141, line: 166, size: 1024, align: 64, elements: !142)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!142 = !{!143, !144, !148}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !140, file: !141, line: 168, baseType: !74, size: 16, align: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !140, file: !141, line: 169, baseType: !145, size: 944, align: 8, offset: 16)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 944, align: 8, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 118)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !140, file: !141, line: 170, baseType: !66, size: 64, align: 64, offset: 960)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 368, align: 8, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 46)
!152 = distinct !DIGlobalVariable(name: "ret", scope: !153, file: !126, line: 590, type: !154, isLocal: true, isDefinition: true, variable: [54 x i8]* @inet_sockaddrtopair.ret)
!153 = distinct !DISubprogram(name: "inet_sockaddrtopair", scope: !126, file: !126, line: 587, type: !137, isLocal: false, isDefinition: true, scopeLine: 588, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 432, align: 8, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 54)
!157 = distinct !DIGlobalVariable(name: "ret", scope: !158, file: !126, line: 603, type: !161, isLocal: true, isDefinition: true, variable: [59 x i8]* @inet_sockaddrtotrio.ret)
!158 = distinct !DISubprogram(name: "inet_sockaddrtotrio", scope: !126, file: !126, line: 600, type: !159, isLocal: false, isDefinition: true, scopeLine: 601, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!159 = !DISubroutineType(types: !160)
!160 = !{!131, !139, !83}
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 472, align: 8, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 59)
!164 = !{i32 2, !"Dwarf Version", i32 4}
!165 = !{i32 2, !"Debug Info Version", i32 3}
!166 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!167 = distinct !DISubprogram(name: "dump_buffer", scope: !126, file: !126, line: 73, type: !168, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !131, !64, !170, !177}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !172, line: 48, baseType: !173)
!172 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !174, line: 241, size: 1728, align: 64, elements: !175)
!174 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!175 = !{!176, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !197, !198, !199, !200, !202, !203, !205, !209, !212, !214, !216, !217, !218, !219, !220, !221}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !173, file: !174, line: 242, baseType: !177, size: 32, align: 32)
!177 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !173, file: !174, line: 247, baseType: !131, size: 64, align: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !173, file: !174, line: 248, baseType: !131, size: 64, align: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !173, file: !174, line: 249, baseType: !131, size: 64, align: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !173, file: !174, line: 250, baseType: !131, size: 64, align: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !173, file: !174, line: 251, baseType: !131, size: 64, align: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !173, file: !174, line: 252, baseType: !131, size: 64, align: 64, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !173, file: !174, line: 253, baseType: !131, size: 64, align: 64, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !173, file: !174, line: 254, baseType: !131, size: 64, align: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !173, file: !174, line: 256, baseType: !131, size: 64, align: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !173, file: !174, line: 257, baseType: !131, size: 64, align: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !173, file: !174, line: 258, baseType: !131, size: 64, align: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !173, file: !174, line: 260, baseType: !190, size: 64, align: 64, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !174, line: 156, size: 192, align: 64, elements: !192)
!192 = !{!193, !194, !196}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !191, file: !174, line: 157, baseType: !190, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !191, file: !174, line: 158, baseType: !195, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !191, file: !174, line: 162, baseType: !177, size: 32, align: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !173, file: !174, line: 262, baseType: !195, size: 64, align: 64, offset: 832)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !173, file: !174, line: 264, baseType: !177, size: 32, align: 32, offset: 896)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !173, file: !174, line: 268, baseType: !177, size: 32, align: 32, offset: 928)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !173, file: !174, line: 270, baseType: !201, size: 64, align: 64, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !71, line: 131, baseType: !121)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !173, file: !174, line: 274, baseType: !76, size: 16, align: 16, offset: 1024)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !173, file: !174, line: 275, baseType: !204, size: 8, align: 8, offset: 1040)
!204 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !173, file: !174, line: 276, baseType: !206, size: 8, align: 8, offset: 1048)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 8, align: 8, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 1)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !173, file: !174, line: 280, baseType: !210, size: 64, align: 64, offset: 1088)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !174, line: 150, baseType: null)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !173, file: !174, line: 289, baseType: !213, size: 64, align: 64, offset: 1152)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !71, line: 132, baseType: !121)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !173, file: !174, line: 297, baseType: !215, size: 64, align: 64, offset: 1216)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !173, file: !174, line: 298, baseType: !215, size: 64, align: 64, offset: 1280)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !173, file: !174, line: 299, baseType: !215, size: 64, align: 64, offset: 1344)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !173, file: !174, line: 300, baseType: !215, size: 64, align: 64, offset: 1408)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !173, file: !174, line: 302, baseType: !64, size: 64, align: 64, offset: 1472)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !173, file: !174, line: 303, baseType: !177, size: 32, align: 32, offset: 1536)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !173, file: !174, line: 305, baseType: !222, size: 160, align: 8, offset: 1568)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 160, align: 8, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 20)
!225 = !DILocalVariable(name: "buff", arg: 1, scope: !167, file: !126, line: 73, type: !131)
!226 = !DIExpression()
!227 = !DILocation(line: 73, column: 19, scope: !167)
!228 = !DILocalVariable(name: "count", arg: 2, scope: !167, file: !126, line: 73, type: !64)
!229 = !DILocation(line: 73, column: 32, scope: !167)
!230 = !DILocalVariable(name: "fp", arg: 3, scope: !167, file: !126, line: 73, type: !170)
!231 = !DILocation(line: 73, column: 45, scope: !167)
!232 = !DILocalVariable(name: "indent", arg: 4, scope: !167, file: !126, line: 73, type: !177)
!233 = !DILocation(line: 73, column: 53, scope: !167)
!234 = !DILocalVariable(name: "i", scope: !167, file: !126, line: 75, type: !64)
!235 = !DILocation(line: 75, column: 9, scope: !167)
!236 = !DILocalVariable(name: "j", scope: !167, file: !126, line: 75, type: !64)
!237 = !DILocation(line: 75, column: 12, scope: !167)
!238 = !DILocalVariable(name: "c", scope: !167, file: !126, line: 75, type: !64)
!239 = !DILocation(line: 75, column: 15, scope: !167)
!240 = !DILocalVariable(name: "printnext", scope: !167, file: !126, line: 76, type: !241)
!241 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!242 = !DILocation(line: 76, column: 6, scope: !167)
!243 = !DILocation(line: 78, column: 6, scope: !244)
!244 = distinct !DILexicalBlock(scope: !167, file: !126, line: 78, column: 6)
!245 = !DILocation(line: 78, column: 12, scope: !244)
!246 = !DILocation(line: 78, column: 6, scope: !167)
!247 = !DILocation(line: 79, column: 7, scope: !244)
!248 = !DILocation(line: 79, column: 21, scope: !244)
!249 = !DILocation(line: 79, column: 27, scope: !244)
!250 = !DILocation(line: 79, column: 19, scope: !244)
!251 = !DILocation(line: 79, column: 13, scope: !244)
!252 = !DILocation(line: 79, column: 5, scope: !244)
!253 = !DILocation(line: 79, column: 3, scope: !244)
!254 = !DILocation(line: 81, column: 7, scope: !244)
!255 = !DILocation(line: 81, column: 5, scope: !244)
!256 = !DILocation(line: 83, column: 9, scope: !257)
!257 = distinct !DILexicalBlock(scope: !167, file: !126, line: 83, column: 2)
!258 = !DILocation(line: 83, column: 7, scope: !257)
!259 = !DILocation(line: 83, column: 14, scope: !260)
!260 = !DILexicalBlockFile(scope: !261, file: !126, discriminator: 1)
!261 = distinct !DILexicalBlock(scope: !257, file: !126, line: 83, column: 2)
!262 = !DILocation(line: 83, column: 18, scope: !260)
!263 = !DILocation(line: 83, column: 16, scope: !260)
!264 = !DILocation(line: 83, column: 2, scope: !260)
!265 = !DILocation(line: 84, column: 7, scope: !266)
!266 = distinct !DILexicalBlock(scope: !267, file: !126, line: 84, column: 7)
!267 = distinct !DILexicalBlock(scope: !261, file: !126, line: 83, column: 26)
!268 = !DILocation(line: 84, column: 7, scope: !267)
!269 = !DILocation(line: 85, column: 14, scope: !270)
!270 = distinct !DILexicalBlock(scope: !266, file: !126, line: 84, column: 18)
!271 = !DILocation(line: 86, column: 12, scope: !270)
!272 = !DILocation(line: 86, column: 29, scope: !270)
!273 = !DILocation(line: 86, column: 41, scope: !270)
!274 = !DILocation(line: 86, column: 43, scope: !270)
!275 = !DILocation(line: 86, column: 4, scope: !270)
!276 = !DILocation(line: 87, column: 3, scope: !270)
!277 = !DILocation(line: 88, column: 7, scope: !278)
!278 = distinct !DILexicalBlock(scope: !267, file: !126, line: 88, column: 7)
!279 = !DILocation(line: 88, column: 11, scope: !278)
!280 = !DILocation(line: 88, column: 9, scope: !278)
!281 = !DILocation(line: 88, column: 7, scope: !267)
!282 = !DILocation(line: 89, column: 12, scope: !278)
!283 = !DILocation(line: 89, column: 30, scope: !278)
!284 = !DILocation(line: 89, column: 25, scope: !278)
!285 = !DILocation(line: 89, column: 33, scope: !278)
!286 = !DILocation(line: 89, column: 4, scope: !278)
!287 = !DILocation(line: 91, column: 12, scope: !278)
!288 = !DILocation(line: 91, column: 4, scope: !278)
!289 = !DILocation(line: 92, column: 10, scope: !290)
!290 = distinct !DILexicalBlock(scope: !267, file: !126, line: 92, column: 7)
!291 = !DILocation(line: 92, column: 12, scope: !290)
!292 = !DILocation(line: 92, column: 17, scope: !290)
!293 = !DILocation(line: 92, column: 7, scope: !267)
!294 = !DILocation(line: 93, column: 9, scope: !295)
!295 = distinct !DILexicalBlock(scope: !296, file: !126, line: 93, column: 8)
!296 = distinct !DILexicalBlock(scope: !290, file: !126, line: 92, column: 23)
!297 = !DILocation(line: 93, column: 11, scope: !295)
!298 = !DILocation(line: 93, column: 16, scope: !295)
!299 = !DILocation(line: 93, column: 8, scope: !296)
!300 = !DILocation(line: 94, column: 13, scope: !295)
!301 = !DILocation(line: 94, column: 5, scope: !295)
!302 = !DILocation(line: 96, column: 13, scope: !303)
!303 = distinct !DILexicalBlock(scope: !295, file: !126, line: 95, column: 9)
!304 = !DILocation(line: 96, column: 5, scope: !303)
!305 = !DILocation(line: 97, column: 14, scope: !306)
!306 = distinct !DILexicalBlock(scope: !303, file: !126, line: 97, column: 5)
!307 = !DILocation(line: 97, column: 16, scope: !306)
!308 = !DILocation(line: 97, column: 12, scope: !306)
!309 = !DILocation(line: 97, column: 10, scope: !306)
!310 = !DILocation(line: 97, column: 22, scope: !311)
!311 = !DILexicalBlockFile(scope: !312, file: !126, discriminator: 1)
!312 = distinct !DILexicalBlock(scope: !306, file: !126, line: 97, column: 5)
!313 = !DILocation(line: 97, column: 27, scope: !311)
!314 = !DILocation(line: 97, column: 24, scope: !311)
!315 = !DILocation(line: 97, column: 5, scope: !311)
!316 = !DILocation(line: 98, column: 10, scope: !317)
!317 = distinct !DILexicalBlock(scope: !312, file: !126, line: 98, column: 10)
!318 = !DILocation(line: 98, column: 14, scope: !317)
!319 = !DILocation(line: 98, column: 12, scope: !317)
!320 = !DILocation(line: 98, column: 10, scope: !312)
!321 = !DILocation(line: 99, column: 17, scope: !322)
!322 = distinct !DILexicalBlock(scope: !323, file: !126, line: 99, column: 11)
!323 = distinct !DILexicalBlock(scope: !317, file: !126, line: 98, column: 21)
!324 = !DILocation(line: 99, column: 12, scope: !322)
!325 = !DILocation(line: 99, column: 20, scope: !322)
!326 = !DILocation(line: 99, column: 28, scope: !322)
!327 = !DILocation(line: 100, column: 11, scope: !322)
!328 = !DILocation(line: 100, column: 20, scope: !329)
!329 = !DILexicalBlockFile(scope: !322, file: !126, discriminator: 1)
!330 = !DILocation(line: 100, column: 15, scope: !329)
!331 = !DILocation(line: 100, column: 23, scope: !329)
!332 = !DILocation(line: 100, column: 31, scope: !329)
!333 = !DILocation(line: 99, column: 11, scope: !334)
!334 = !DILexicalBlockFile(scope: !323, file: !126, discriminator: 1)
!335 = !DILocation(line: 101, column: 16, scope: !322)
!336 = !DILocation(line: 102, column: 20, scope: !322)
!337 = !DILocation(line: 102, column: 15, scope: !322)
!338 = !DILocation(line: 102, column: 23, scope: !322)
!339 = !DILocation(line: 101, column: 8, scope: !322)
!340 = !DILocation(line: 104, column: 16, scope: !322)
!341 = !DILocation(line: 104, column: 8, scope: !322)
!342 = !DILocation(line: 105, column: 6, scope: !323)
!343 = !DILocation(line: 106, column: 15, scope: !317)
!344 = !DILocation(line: 106, column: 7, scope: !317)
!345 = !DILocation(line: 98, column: 14, scope: !346)
!346 = !DILexicalBlockFile(scope: !317, file: !126, discriminator: 1)
!347 = !DILocation(line: 97, column: 31, scope: !348)
!348 = !DILexicalBlockFile(scope: !312, file: !126, discriminator: 2)
!349 = !DILocation(line: 97, column: 5, scope: !348)
!350 = distinct !{!350, !351}
!351 = !DILocation(line: 97, column: 5, scope: !303)
!352 = !DILocation(line: 107, column: 13, scope: !303)
!353 = !DILocation(line: 107, column: 5, scope: !303)
!354 = !DILocation(line: 108, column: 15, scope: !303)
!355 = !DILocation(line: 110, column: 3, scope: !296)
!356 = !DILocation(line: 111, column: 2, scope: !267)
!357 = !DILocation(line: 83, column: 22, scope: !358)
!358 = !DILexicalBlockFile(scope: !261, file: !126, discriminator: 2)
!359 = !DILocation(line: 83, column: 2, scope: !358)
!360 = distinct !{!360, !361}
!361 = !DILocation(line: 83, column: 2, scope: !167)
!362 = !DILocation(line: 112, column: 1, scope: !167)
!363 = distinct !DISubprogram(name: "make_file_name", scope: !126, file: !126, line: 152, type: !364, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!364 = !DISubroutineType(types: !365)
!365 = !{!131, !366, !366, !366, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!368 = !DILocalVariable(name: "name", arg: 1, scope: !363, file: !126, line: 152, type: !366)
!369 = !DILocation(line: 152, column: 28, scope: !363)
!370 = !DILocalVariable(name: "prog", arg: 2, scope: !363, file: !126, line: 152, type: !366)
!371 = !DILocation(line: 152, column: 46, scope: !363)
!372 = !DILocalVariable(name: "namespace", arg: 3, scope: !363, file: !126, line: 152, type: !366)
!373 = !DILocation(line: 152, column: 64, scope: !363)
!374 = !DILocalVariable(name: "instance", arg: 4, scope: !363, file: !126, line: 152, type: !366)
!375 = !DILocation(line: 152, column: 87, scope: !363)
!376 = !DILocalVariable(name: "extn_start", scope: !363, file: !126, line: 154, type: !366)
!377 = !DILocation(line: 154, column: 14, scope: !363)
!378 = !DILocalVariable(name: "dir_end", scope: !363, file: !126, line: 155, type: !366)
!379 = !DILocation(line: 155, column: 14, scope: !363)
!380 = !DILocalVariable(name: "len", scope: !363, file: !126, line: 156, type: !64)
!381 = !DILocation(line: 156, column: 9, scope: !363)
!382 = !DILocalVariable(name: "file_name", scope: !363, file: !126, line: 157, type: !131)
!383 = !DILocation(line: 157, column: 8, scope: !363)
!384 = !DILocation(line: 159, column: 7, scope: !385)
!385 = distinct !DILexicalBlock(scope: !363, file: !126, line: 159, column: 6)
!386 = !DILocation(line: 159, column: 6, scope: !363)
!387 = !DILocation(line: 160, column: 3, scope: !385)
!388 = !DILocation(line: 162, column: 15, scope: !363)
!389 = !DILocation(line: 162, column: 8, scope: !363)
!390 = !DILocation(line: 162, column: 6, scope: !363)
!391 = !DILocation(line: 163, column: 6, scope: !392)
!392 = distinct !DILexicalBlock(scope: !363, file: !126, line: 163, column: 6)
!393 = !DILocation(line: 163, column: 6, scope: !363)
!394 = !DILocation(line: 164, column: 17, scope: !392)
!395 = !DILocation(line: 164, column: 10, scope: !392)
!396 = !DILocation(line: 164, column: 23, scope: !392)
!397 = !DILocation(line: 164, column: 7, scope: !392)
!398 = !DILocation(line: 164, column: 3, scope: !392)
!399 = !DILocation(line: 165, column: 6, scope: !400)
!400 = distinct !DILexicalBlock(scope: !363, file: !126, line: 165, column: 6)
!401 = !DILocation(line: 165, column: 6, scope: !363)
!402 = !DILocation(line: 166, column: 17, scope: !400)
!403 = !DILocation(line: 166, column: 10, scope: !400)
!404 = !DILocation(line: 166, column: 28, scope: !400)
!405 = !DILocation(line: 166, column: 7, scope: !400)
!406 = !DILocation(line: 166, column: 3, scope: !400)
!407 = !DILocation(line: 167, column: 6, scope: !408)
!408 = distinct !DILexicalBlock(scope: !363, file: !126, line: 167, column: 6)
!409 = !DILocation(line: 167, column: 6, scope: !363)
!410 = !DILocation(line: 168, column: 17, scope: !408)
!411 = !DILocation(line: 168, column: 10, scope: !408)
!412 = !DILocation(line: 168, column: 27, scope: !408)
!413 = !DILocation(line: 168, column: 7, scope: !408)
!414 = !DILocation(line: 168, column: 3, scope: !408)
!415 = !DILocation(line: 170, column: 22, scope: !363)
!416 = !DILocation(line: 170, column: 26, scope: !363)
!417 = !DILocation(line: 170, column: 15, scope: !363)
!418 = !DILocation(line: 170, column: 12, scope: !363)
!419 = !DILocation(line: 171, column: 20, scope: !363)
!420 = !DILocation(line: 171, column: 12, scope: !363)
!421 = !DILocation(line: 171, column: 10, scope: !363)
!422 = !DILocation(line: 172, column: 23, scope: !363)
!423 = !DILocation(line: 172, column: 33, scope: !424)
!424 = !DILexicalBlockFile(scope: !363, file: !126, discriminator: 1)
!425 = !DILocation(line: 172, column: 23, scope: !424)
!426 = !DILocation(line: 172, column: 43, scope: !427)
!427 = !DILexicalBlockFile(scope: !363, file: !126, discriminator: 2)
!428 = !DILocation(line: 172, column: 23, scope: !427)
!429 = !DILocation(line: 172, column: 23, scope: !430)
!430 = !DILexicalBlockFile(scope: !363, file: !126, discriminator: 3)
!431 = !DILocation(line: 172, column: 15, scope: !430)
!432 = !DILocation(line: 172, column: 13, scope: !430)
!433 = !DILocation(line: 173, column: 10, scope: !363)
!434 = !DILocation(line: 173, column: 21, scope: !363)
!435 = !DILocation(line: 173, column: 27, scope: !363)
!436 = !DILocation(line: 173, column: 49, scope: !424)
!437 = !DILocation(line: 173, column: 62, scope: !424)
!438 = !DILocation(line: 173, column: 60, scope: !424)
!439 = !DILocation(line: 173, column: 27, scope: !424)
!440 = !DILocation(line: 173, column: 70, scope: !427)
!441 = !DILocation(line: 173, column: 27, scope: !427)
!442 = !DILocation(line: 173, column: 27, scope: !430)
!443 = !DILocation(line: 173, column: 2, scope: !430)
!444 = !DILocation(line: 175, column: 6, scope: !445)
!445 = distinct !DILexicalBlock(scope: !363, file: !126, line: 175, column: 6)
!446 = !DILocation(line: 175, column: 6, scope: !363)
!447 = !DILocation(line: 176, column: 10, scope: !448)
!448 = distinct !DILexicalBlock(scope: !445, file: !126, line: 175, column: 12)
!449 = !DILocation(line: 176, column: 3, scope: !448)
!450 = !DILocation(line: 177, column: 10, scope: !448)
!451 = !DILocation(line: 177, column: 21, scope: !448)
!452 = !DILocation(line: 177, column: 3, scope: !448)
!453 = !DILocation(line: 178, column: 2, scope: !448)
!454 = !DILocation(line: 179, column: 6, scope: !455)
!455 = distinct !DILexicalBlock(scope: !363, file: !126, line: 179, column: 6)
!456 = !DILocation(line: 179, column: 6, scope: !363)
!457 = !DILocation(line: 180, column: 10, scope: !458)
!458 = distinct !DILexicalBlock(scope: !455, file: !126, line: 179, column: 17)
!459 = !DILocation(line: 180, column: 3, scope: !458)
!460 = !DILocation(line: 181, column: 10, scope: !458)
!461 = !DILocation(line: 181, column: 21, scope: !458)
!462 = !DILocation(line: 181, column: 3, scope: !458)
!463 = !DILocation(line: 182, column: 2, scope: !458)
!464 = !DILocation(line: 183, column: 6, scope: !465)
!465 = distinct !DILexicalBlock(scope: !363, file: !126, line: 183, column: 6)
!466 = !DILocation(line: 183, column: 6, scope: !363)
!467 = !DILocation(line: 184, column: 10, scope: !468)
!468 = distinct !DILexicalBlock(scope: !465, file: !126, line: 183, column: 16)
!469 = !DILocation(line: 184, column: 3, scope: !468)
!470 = !DILocation(line: 185, column: 10, scope: !468)
!471 = !DILocation(line: 185, column: 21, scope: !468)
!472 = !DILocation(line: 185, column: 3, scope: !468)
!473 = !DILocation(line: 186, column: 2, scope: !468)
!474 = !DILocation(line: 187, column: 6, scope: !475)
!475 = distinct !DILexicalBlock(scope: !363, file: !126, line: 187, column: 6)
!476 = !DILocation(line: 187, column: 6, scope: !363)
!477 = !DILocation(line: 188, column: 10, scope: !475)
!478 = !DILocation(line: 188, column: 21, scope: !475)
!479 = !DILocation(line: 188, column: 3, scope: !475)
!480 = !DILocation(line: 190, column: 9, scope: !363)
!481 = !DILocation(line: 190, column: 2, scope: !363)
!482 = !DILocation(line: 191, column: 1, scope: !363)
!483 = distinct !DISubprogram(name: "in_csum", scope: !126, file: !126, line: 325, type: !484, isLocal: false, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!484 = !DISubroutineType(types: !485)
!485 = !{!83, !486, !64, !86, !488}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!489 = !DILocalVariable(name: "addr", arg: 1, scope: !483, file: !126, line: 325, type: !486)
!490 = !DILocation(line: 325, column: 25, scope: !483)
!491 = !DILocalVariable(name: "len", arg: 2, scope: !483, file: !126, line: 325, type: !64)
!492 = !DILocation(line: 325, column: 38, scope: !483)
!493 = !DILocalVariable(name: "csum", arg: 3, scope: !483, file: !126, line: 325, type: !86)
!494 = !DILocation(line: 325, column: 52, scope: !483)
!495 = !DILocalVariable(name: "acc", arg: 4, scope: !483, file: !126, line: 325, type: !488)
!496 = !DILocation(line: 325, column: 68, scope: !483)
!497 = !DILocalVariable(name: "nleft", scope: !483, file: !126, line: 327, type: !64)
!498 = !DILocation(line: 327, column: 18, scope: !483)
!499 = !DILocation(line: 327, column: 26, scope: !483)
!500 = !DILocalVariable(name: "w", scope: !483, file: !126, line: 328, type: !486)
!501 = !DILocation(line: 328, column: 18, scope: !483)
!502 = !DILocation(line: 328, column: 22, scope: !483)
!503 = !DILocalVariable(name: "answer", scope: !483, file: !126, line: 329, type: !83)
!504 = !DILocation(line: 329, column: 20, scope: !483)
!505 = !DILocalVariable(name: "sum", scope: !483, file: !126, line: 330, type: !86)
!506 = !DILocation(line: 330, column: 20, scope: !483)
!507 = !DILocation(line: 330, column: 26, scope: !483)
!508 = !DILocation(line: 338, column: 2, scope: !483)
!509 = !DILocation(line: 338, column: 9, scope: !510)
!510 = !DILexicalBlockFile(scope: !483, file: !126, discriminator: 1)
!511 = !DILocation(line: 338, column: 15, scope: !510)
!512 = !DILocation(line: 338, column: 2, scope: !510)
!513 = !DILocation(line: 339, column: 12, scope: !514)
!514 = distinct !DILexicalBlock(scope: !483, file: !126, line: 338, column: 20)
!515 = !DILocation(line: 339, column: 10, scope: !514)
!516 = !DILocation(line: 339, column: 7, scope: !514)
!517 = !DILocation(line: 340, column: 9, scope: !514)
!518 = !DILocation(line: 338, column: 2, scope: !519)
!519 = !DILexicalBlockFile(scope: !483, file: !126, discriminator: 2)
!520 = distinct !{!520, !508}
!521 = !DILocation(line: 344, column: 6, scope: !522)
!522 = distinct !DILexicalBlock(scope: !483, file: !126, line: 344, column: 6)
!523 = !DILocation(line: 344, column: 12, scope: !522)
!524 = !DILocation(line: 344, column: 6, scope: !483)
!525 = !DILocation(line: 345, column: 28, scope: !522)
!526 = !DILocation(line: 345, column: 16, scope: !522)
!527 = !DILocation(line: 345, column: 30, scope: !522)
!528 = !DILocation(line: 345, column: 10, scope: !522)
!529 = !DILocation(line: 345, column: 7, scope: !522)
!530 = !DILocation(line: 345, column: 3, scope: !522)
!531 = !DILocation(line: 347, column: 6, scope: !532)
!532 = distinct !DILexicalBlock(scope: !483, file: !126, line: 347, column: 6)
!533 = !DILocation(line: 347, column: 6, scope: !483)
!534 = !DILocation(line: 348, column: 10, scope: !532)
!535 = !DILocation(line: 348, column: 4, scope: !532)
!536 = !DILocation(line: 348, column: 8, scope: !532)
!537 = !DILocation(line: 348, column: 3, scope: !532)
!538 = !DILocation(line: 353, column: 9, scope: !483)
!539 = !DILocation(line: 353, column: 13, scope: !483)
!540 = !DILocation(line: 353, column: 23, scope: !483)
!541 = !DILocation(line: 353, column: 27, scope: !483)
!542 = !DILocation(line: 353, column: 20, scope: !483)
!543 = !DILocation(line: 353, column: 6, scope: !483)
!544 = !DILocation(line: 354, column: 10, scope: !483)
!545 = !DILocation(line: 354, column: 14, scope: !483)
!546 = !DILocation(line: 354, column: 6, scope: !483)
!547 = !DILocation(line: 355, column: 13, scope: !483)
!548 = !DILocation(line: 355, column: 12, scope: !483)
!549 = !DILocation(line: 355, column: 17, scope: !483)
!550 = !DILocation(line: 355, column: 11, scope: !483)
!551 = !DILocation(line: 355, column: 9, scope: !483)
!552 = !DILocation(line: 356, column: 10, scope: !483)
!553 = !DILocation(line: 356, column: 2, scope: !483)
!554 = !DILocalVariable(name: "ip", arg: 1, scope: !128, file: !126, line: 361, type: !86)
!555 = !DILocation(line: 361, column: 21, scope: !128)
!556 = !DILocalVariable(name: "bytep", scope: !128, file: !126, line: 364, type: !73)
!557 = !DILocation(line: 364, column: 17, scope: !128)
!558 = !DILocation(line: 366, column: 10, scope: !128)
!559 = !DILocation(line: 366, column: 8, scope: !128)
!560 = !DILocation(line: 367, column: 30, scope: !128)
!561 = !DILocation(line: 367, column: 40, scope: !128)
!562 = !DILocation(line: 367, column: 50, scope: !128)
!563 = !DILocation(line: 367, column: 60, scope: !128)
!564 = !DILocation(line: 367, column: 2, scope: !128)
!565 = !DILocation(line: 368, column: 2, scope: !128)
!566 = distinct !DISubprogram(name: "inet_stor", scope: !126, file: !126, line: 389, type: !567, isLocal: false, isDefinition: true, scopeLine: 390, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!567 = !DISubroutineType(types: !568)
!568 = !{!241, !366, !488}
!569 = !DILocalVariable(name: "addr", arg: 1, scope: !566, file: !126, line: 389, type: !366)
!570 = !DILocation(line: 389, column: 23, scope: !566)
!571 = !DILocalVariable(name: "range_end", arg: 2, scope: !566, file: !126, line: 389, type: !488)
!572 = !DILocation(line: 389, column: 39, scope: !566)
!573 = !DILocalVariable(name: "cp", scope: !566, file: !126, line: 391, type: !366)
!574 = !DILocation(line: 391, column: 14, scope: !566)
!575 = !DILocalVariable(name: "endptr", scope: !566, file: !126, line: 392, type: !131)
!576 = !DILocation(line: 392, column: 8, scope: !566)
!577 = !DILocalVariable(name: "range", scope: !566, file: !126, line: 393, type: !66)
!578 = !DILocation(line: 393, column: 16, scope: !566)
!579 = !DILocalVariable(name: "family", scope: !566, file: !126, line: 394, type: !177)
!580 = !DILocation(line: 394, column: 6, scope: !566)
!581 = !DILocation(line: 394, column: 22, scope: !566)
!582 = !DILocation(line: 394, column: 15, scope: !566)
!583 = !DILocalVariable(name: "warn", scope: !566, file: !126, line: 395, type: !131)
!584 = !DILocation(line: 395, column: 8, scope: !566)
!585 = !DILocation(line: 398, column: 7, scope: !586)
!586 = distinct !DILexicalBlock(scope: !566, file: !126, line: 398, column: 6)
!587 = !DILocation(line: 398, column: 6, scope: !566)
!588 = !DILocation(line: 399, column: 8, scope: !586)
!589 = !DILocation(line: 399, column: 3, scope: !586)
!590 = !DILocation(line: 403, column: 20, scope: !591)
!591 = distinct !DILexicalBlock(scope: !566, file: !126, line: 403, column: 6)
!592 = !DILocation(line: 403, column: 13, scope: !591)
!593 = !DILocation(line: 403, column: 11, scope: !591)
!594 = !DILocation(line: 403, column: 6, scope: !566)
!595 = !DILocation(line: 404, column: 4, scope: !596)
!596 = distinct !DILexicalBlock(scope: !591, file: !126, line: 403, column: 33)
!597 = !DILocation(line: 404, column: 14, scope: !596)
!598 = !DILocation(line: 405, column: 3, scope: !596)
!599 = !DILocation(line: 408, column: 3, scope: !566)
!600 = !DILocation(line: 408, column: 7, scope: !566)
!601 = !DILocation(line: 409, column: 18, scope: !566)
!602 = !DILocation(line: 409, column: 21, scope: !566)
!603 = !DILocation(line: 409, column: 35, scope: !566)
!604 = !DILocation(line: 409, column: 42, scope: !566)
!605 = !DILocation(line: 409, column: 10, scope: !566)
!606 = !DILocation(line: 409, column: 8, scope: !566)
!607 = !DILocation(line: 410, column: 15, scope: !566)
!608 = !DILocation(line: 410, column: 3, scope: !566)
!609 = !DILocation(line: 410, column: 13, scope: !566)
!610 = !DILocation(line: 412, column: 7, scope: !611)
!611 = distinct !DILexicalBlock(scope: !566, file: !126, line: 412, column: 6)
!612 = !DILocation(line: 412, column: 6, scope: !611)
!613 = !DILocation(line: 412, column: 6, scope: !566)
!614 = !DILocation(line: 413, column: 116, scope: !611)
!615 = !DILocation(line: 413, column: 122, scope: !611)
!616 = !DILocation(line: 413, column: 128, scope: !611)
!617 = !DILocation(line: 413, column: 3, scope: !611)
!618 = !DILocation(line: 414, column: 12, scope: !619)
!619 = distinct !DILexicalBlock(scope: !611, file: !126, line: 414, column: 10)
!620 = !DILocation(line: 414, column: 11, scope: !619)
!621 = !DILocation(line: 414, column: 16, scope: !619)
!622 = !DILocation(line: 414, column: 26, scope: !619)
!623 = !DILocation(line: 415, column: 5, scope: !619)
!624 = !DILocation(line: 415, column: 12, scope: !619)
!625 = !DILocation(line: 415, column: 23, scope: !619)
!626 = !DILocation(line: 415, column: 26, scope: !627)
!627 = !DILexicalBlockFile(scope: !619, file: !126, discriminator: 1)
!628 = !DILocation(line: 415, column: 32, scope: !627)
!629 = !DILocation(line: 415, column: 42, scope: !627)
!630 = !DILocation(line: 416, column: 5, scope: !619)
!631 = !DILocation(line: 416, column: 12, scope: !619)
!632 = !DILocation(line: 416, column: 22, scope: !619)
!633 = !DILocation(line: 416, column: 25, scope: !627)
!634 = !DILocation(line: 416, column: 31, scope: !627)
!635 = !DILocation(line: 414, column: 10, scope: !636)
!636 = !DILexicalBlockFile(scope: !611, file: !126, discriminator: 1)
!637 = !DILocation(line: 417, column: 100, scope: !638)
!638 = distinct !DILexicalBlock(scope: !619, file: !126, line: 416, column: 39)
!639 = !DILocation(line: 417, column: 106, scope: !638)
!640 = !DILocation(line: 417, column: 109, scope: !638)
!641 = !DILocation(line: 417, column: 3, scope: !638)
!642 = !DILocation(line: 420, column: 3, scope: !638)
!643 = !DILocation(line: 423, column: 3, scope: !619)
!644 = !DILocation(line: 428, column: 17, scope: !566)
!645 = !DILocation(line: 428, column: 16, scope: !566)
!646 = !DILocation(line: 428, column: 9, scope: !566)
!647 = !DILocation(line: 430, column: 1, scope: !566)
!648 = distinct !DISubprogram(name: "__test_bit", scope: !4, file: !4, line: 47, type: !649, isLocal: true, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!649 = !DISubroutineType(types: !650)
!650 = !{!241, !87, !651}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!653 = !DILocalVariable(name: "idx", arg: 1, scope: !648, file: !4, line: 47, type: !87)
!654 = !DILocation(line: 47, column: 39, scope: !648)
!655 = !DILocalVariable(name: "bmap", arg: 2, scope: !648, file: !4, line: 47, type: !651)
!656 = !DILocation(line: 47, column: 65, scope: !648)
!657 = !DILocation(line: 49, column: 19, scope: !648)
!658 = !DILocation(line: 49, column: 18, scope: !648)
!659 = !DILocation(line: 49, column: 24, scope: !648)
!660 = !DILocation(line: 49, column: 12, scope: !648)
!661 = !DILocation(line: 49, column: 68, scope: !648)
!662 = !DILocation(line: 49, column: 67, scope: !648)
!663 = !DILocation(line: 49, column: 73, scope: !648)
!664 = !DILocation(line: 49, column: 63, scope: !648)
!665 = !DILocation(line: 49, column: 56, scope: !648)
!666 = !DILocation(line: 49, column: 10, scope: !648)
!667 = !DILocation(line: 49, column: 9, scope: !648)
!668 = !DILocation(line: 49, column: 2, scope: !648)
!669 = distinct !DISubprogram(name: "domain_stosockaddr", scope: !126, file: !126, line: 434, type: !670, isLocal: false, isDefinition: true, scopeLine: 435, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!670 = !DISubroutineType(types: !671)
!671 = !{!177, !366, !366, !139}
!672 = !DILocalVariable(name: "domain", arg: 1, scope: !669, file: !126, line: 434, type: !366)
!673 = !DILocation(line: 434, column: 32, scope: !669)
!674 = !DILocalVariable(name: "port", arg: 2, scope: !669, file: !126, line: 434, type: !366)
!675 = !DILocation(line: 434, column: 52, scope: !669)
!676 = !DILocalVariable(name: "addr", arg: 3, scope: !669, file: !126, line: 434, type: !139)
!677 = !DILocation(line: 434, column: 83, scope: !669)
!678 = !DILocalVariable(name: "res", scope: !669, file: !126, line: 436, type: !679)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64, align: 64)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !681, line: 567, size: 384, align: 64, elements: !682)
!681 = !DIFile(filename: "/usr/include/netdb.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!682 = !{!683, !684, !685, !686, !687, !691, !700, !701}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !680, file: !681, line: 569, baseType: !177, size: 32, align: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !680, file: !681, line: 570, baseType: !177, size: 32, align: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !680, file: !681, line: 571, baseType: !177, size: 32, align: 32, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !680, file: !681, line: 572, baseType: !177, size: 32, align: 32, offset: 96)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !680, file: !681, line: 573, baseType: !688, size: 32, align: 32, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !689, line: 277, baseType: !690)
!689 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !71, line: 189, baseType: !87)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !680, file: !681, line: 574, baseType: !692, size: 64, align: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !141, line: 153, size: 128, align: 16, elements: !694)
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !693, file: !141, line: 155, baseType: !74, size: 16, align: 16)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !693, file: !141, line: 156, baseType: !697, size: 112, align: 8, offset: 16)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 112, align: 8, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 14)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !680, file: !681, line: 575, baseType: !131, size: 64, align: 64, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !680, file: !681, line: 576, baseType: !679, size: 64, align: 64, offset: 320)
!702 = !DILocation(line: 436, column: 19, scope: !669)
!703 = !DILocalVariable(name: "port_num", scope: !669, file: !126, line: 437, type: !87)
!704 = !DILocation(line: 437, column: 11, scope: !669)
!705 = !DILocation(line: 439, column: 6, scope: !706)
!706 = distinct !DILexicalBlock(scope: !669, file: !126, line: 439, column: 6)
!707 = !DILocation(line: 439, column: 6, scope: !669)
!708 = !DILocation(line: 440, column: 22, scope: !709)
!709 = distinct !DILexicalBlock(scope: !710, file: !126, line: 440, column: 7)
!710 = distinct !DILexicalBlock(scope: !706, file: !126, line: 439, column: 12)
!711 = !DILocation(line: 440, column: 8, scope: !709)
!712 = !DILocation(line: 440, column: 7, scope: !710)
!713 = !DILocation(line: 441, column: 4, scope: !714)
!714 = distinct !DILexicalBlock(scope: !709, file: !126, line: 440, column: 55)
!715 = !DILocation(line: 441, column: 10, scope: !714)
!716 = !DILocation(line: 441, column: 20, scope: !714)
!717 = !DILocation(line: 442, column: 4, scope: !714)
!718 = !DILocation(line: 444, column: 2, scope: !710)
!719 = !DILocation(line: 446, column: 18, scope: !720)
!720 = distinct !DILexicalBlock(scope: !669, file: !126, line: 446, column: 6)
!721 = !DILocation(line: 446, column: 6, scope: !720)
!722 = !DILocation(line: 446, column: 43, scope: !720)
!723 = !DILocation(line: 446, column: 48, scope: !720)
!724 = !DILocation(line: 446, column: 52, scope: !725)
!725 = !DILexicalBlockFile(scope: !720, file: !126, discriminator: 1)
!726 = !DILocation(line: 446, column: 6, scope: !725)
!727 = !DILocation(line: 447, column: 3, scope: !728)
!728 = distinct !DILexicalBlock(scope: !720, file: !126, line: 446, column: 57)
!729 = !DILocation(line: 447, column: 9, scope: !728)
!730 = !DILocation(line: 447, column: 19, scope: !728)
!731 = !DILocation(line: 448, column: 3, scope: !728)
!732 = !DILocation(line: 451, column: 33, scope: !669)
!733 = !DILocation(line: 451, column: 38, scope: !669)
!734 = !DILocation(line: 451, column: 20, scope: !669)
!735 = !DILocation(line: 451, column: 2, scope: !669)
!736 = !DILocation(line: 451, column: 8, scope: !669)
!737 = !DILocation(line: 451, column: 18, scope: !669)
!738 = !DILocation(line: 453, column: 6, scope: !739)
!739 = distinct !DILexicalBlock(scope: !669, file: !126, line: 453, column: 6)
!740 = !DILocation(line: 453, column: 12, scope: !739)
!741 = !DILocation(line: 453, column: 22, scope: !739)
!742 = !DILocation(line: 453, column: 6, scope: !669)
!743 = !DILocalVariable(name: "addr6", scope: !744, file: !126, line: 454, type: !77)
!744 = distinct !DILexicalBlock(scope: !739, file: !126, line: 453, column: 34)
!745 = !DILocation(line: 454, column: 24, scope: !744)
!746 = !DILocation(line: 454, column: 55, scope: !744)
!747 = !DILocation(line: 454, column: 32, scope: !744)
!748 = !DILocation(line: 455, column: 4, scope: !744)
!749 = !DILocation(line: 455, column: 36, scope: !744)
!750 = !DILocation(line: 455, column: 41, scope: !744)
!751 = !DILocation(line: 455, column: 12, scope: !744)
!752 = !DILocation(line: 456, column: 7, scope: !753)
!753 = distinct !DILexicalBlock(scope: !744, file: !126, line: 456, column: 7)
!754 = !DILocation(line: 456, column: 7, scope: !744)
!755 = !DILocation(line: 457, column: 29, scope: !753)
!756 = !DILocation(line: 457, column: 23, scope: !753)
!757 = !DILocation(line: 457, column: 4, scope: !753)
!758 = !DILocation(line: 457, column: 11, scope: !753)
!759 = !DILocation(line: 457, column: 21, scope: !753)
!760 = !DILocation(line: 458, column: 2, scope: !744)
!761 = !DILocalVariable(name: "addr4", scope: !762, file: !126, line: 459, type: !108)
!762 = distinct !DILexicalBlock(scope: !739, file: !126, line: 458, column: 9)
!763 = !DILocation(line: 459, column: 23, scope: !762)
!764 = !DILocation(line: 459, column: 53, scope: !762)
!765 = !DILocation(line: 459, column: 31, scope: !762)
!766 = !DILocation(line: 460, column: 4, scope: !762)
!767 = !DILocation(line: 460, column: 35, scope: !762)
!768 = !DILocation(line: 460, column: 40, scope: !762)
!769 = !DILocation(line: 460, column: 12, scope: !762)
!770 = !DILocation(line: 461, column: 7, scope: !771)
!771 = distinct !DILexicalBlock(scope: !762, file: !126, line: 461, column: 7)
!772 = !DILocation(line: 461, column: 7, scope: !762)
!773 = !DILocation(line: 462, column: 28, scope: !771)
!774 = !DILocation(line: 462, column: 22, scope: !771)
!775 = !DILocation(line: 462, column: 4, scope: !771)
!776 = !DILocation(line: 462, column: 11, scope: !771)
!777 = !DILocation(line: 462, column: 20, scope: !771)
!778 = !DILocation(line: 465, column: 15, scope: !669)
!779 = !DILocation(line: 465, column: 2, scope: !669)
!780 = !DILocation(line: 467, column: 2, scope: !669)
!781 = !DILocation(line: 468, column: 1, scope: !669)
!782 = distinct !DISubprogram(name: "inet_stosockaddr", scope: !126, file: !126, line: 472, type: !783, isLocal: false, isDefinition: true, scopeLine: 473, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!783 = !DISubroutineType(types: !784)
!784 = !{!177, !131, !366, !139}
!785 = !DILocalVariable(name: "ip", arg: 1, scope: !782, file: !126, line: 472, type: !131)
!786 = !DILocation(line: 472, column: 24, scope: !782)
!787 = !DILocalVariable(name: "port", arg: 2, scope: !782, file: !126, line: 472, type: !366)
!788 = !DILocation(line: 472, column: 40, scope: !782)
!789 = !DILocalVariable(name: "addr", arg: 3, scope: !782, file: !126, line: 472, type: !139)
!790 = !DILocation(line: 472, column: 71, scope: !782)
!791 = !DILocalVariable(name: "addr_ip", scope: !782, file: !126, line: 474, type: !215)
!792 = !DILocation(line: 474, column: 8, scope: !782)
!793 = !DILocalVariable(name: "cp", scope: !782, file: !126, line: 475, type: !131)
!794 = !DILocation(line: 475, column: 8, scope: !782)
!795 = !DILocalVariable(name: "sav_cp", scope: !782, file: !126, line: 476, type: !132)
!796 = !DILocation(line: 476, column: 7, scope: !782)
!797 = !DILocalVariable(name: "port_num", scope: !782, file: !126, line: 477, type: !87)
!798 = !DILocation(line: 477, column: 11, scope: !782)
!799 = !DILocalVariable(name: "res", scope: !782, file: !126, line: 478, type: !177)
!800 = !DILocation(line: 478, column: 6, scope: !782)
!801 = !DILocation(line: 480, column: 28, scope: !782)
!802 = !DILocation(line: 480, column: 21, scope: !782)
!803 = !DILocation(line: 480, column: 20, scope: !782)
!804 = !DILocation(line: 480, column: 2, scope: !782)
!805 = !DILocation(line: 480, column: 8, scope: !782)
!806 = !DILocation(line: 480, column: 18, scope: !782)
!807 = !DILocation(line: 482, column: 6, scope: !808)
!808 = distinct !DILexicalBlock(scope: !782, file: !126, line: 482, column: 6)
!809 = !DILocation(line: 482, column: 6, scope: !782)
!810 = !DILocation(line: 483, column: 22, scope: !811)
!811 = distinct !DILexicalBlock(scope: !812, file: !126, line: 483, column: 7)
!812 = distinct !DILexicalBlock(scope: !808, file: !126, line: 482, column: 12)
!813 = !DILocation(line: 483, column: 8, scope: !811)
!814 = !DILocation(line: 483, column: 7, scope: !812)
!815 = !DILocation(line: 484, column: 4, scope: !816)
!816 = distinct !DILexicalBlock(scope: !811, file: !126, line: 483, column: 55)
!817 = !DILocation(line: 484, column: 10, scope: !816)
!818 = !DILocation(line: 484, column: 20, scope: !816)
!819 = !DILocation(line: 485, column: 4, scope: !816)
!820 = !DILocation(line: 487, column: 2, scope: !812)
!821 = !DILocation(line: 489, column: 6, scope: !822)
!822 = distinct !DILexicalBlock(scope: !782, file: !126, line: 489, column: 6)
!823 = !DILocation(line: 489, column: 12, scope: !822)
!824 = !DILocation(line: 489, column: 22, scope: !822)
!825 = !DILocation(line: 489, column: 6, scope: !782)
!826 = !DILocalVariable(name: "addr6", scope: !827, file: !126, line: 490, type: !77)
!827 = distinct !DILexicalBlock(scope: !822, file: !126, line: 489, column: 34)
!828 = !DILocation(line: 490, column: 24, scope: !827)
!829 = !DILocation(line: 490, column: 56, scope: !827)
!830 = !DILocation(line: 490, column: 32, scope: !827)
!831 = !DILocation(line: 491, column: 7, scope: !832)
!832 = distinct !DILexicalBlock(scope: !827, file: !126, line: 491, column: 7)
!833 = !DILocation(line: 491, column: 7, scope: !827)
!834 = !DILocation(line: 492, column: 29, scope: !832)
!835 = !DILocation(line: 492, column: 23, scope: !832)
!836 = !DILocation(line: 492, column: 4, scope: !832)
!837 = !DILocation(line: 492, column: 11, scope: !832)
!838 = !DILocation(line: 492, column: 21, scope: !832)
!839 = !DILocation(line: 493, column: 14, scope: !827)
!840 = !DILocation(line: 493, column: 21, scope: !827)
!841 = !DILocation(line: 493, column: 13, scope: !827)
!842 = !DILocation(line: 493, column: 11, scope: !827)
!843 = !DILocation(line: 494, column: 2, scope: !827)
!844 = !DILocalVariable(name: "addr4", scope: !845, file: !126, line: 495, type: !108)
!845 = distinct !DILexicalBlock(scope: !822, file: !126, line: 494, column: 9)
!846 = !DILocation(line: 495, column: 23, scope: !845)
!847 = !DILocation(line: 495, column: 54, scope: !845)
!848 = !DILocation(line: 495, column: 31, scope: !845)
!849 = !DILocation(line: 496, column: 7, scope: !850)
!850 = distinct !DILexicalBlock(scope: !845, file: !126, line: 496, column: 7)
!851 = !DILocation(line: 496, column: 7, scope: !845)
!852 = !DILocation(line: 497, column: 28, scope: !850)
!853 = !DILocation(line: 497, column: 22, scope: !850)
!854 = !DILocation(line: 497, column: 4, scope: !850)
!855 = !DILocation(line: 497, column: 11, scope: !850)
!856 = !DILocation(line: 497, column: 20, scope: !850)
!857 = !DILocation(line: 498, column: 14, scope: !845)
!858 = !DILocation(line: 498, column: 21, scope: !845)
!859 = !DILocation(line: 498, column: 13, scope: !845)
!860 = !DILocation(line: 498, column: 11, scope: !845)
!861 = !DILocation(line: 502, column: 19, scope: !862)
!862 = distinct !DILexicalBlock(scope: !782, file: !126, line: 502, column: 6)
!863 = !DILocation(line: 502, column: 12, scope: !862)
!864 = !DILocation(line: 502, column: 10, scope: !862)
!865 = !DILocation(line: 502, column: 29, scope: !862)
!866 = !DILocation(line: 503, column: 19, scope: !862)
!867 = !DILocation(line: 503, column: 12, scope: !862)
!868 = !DILocation(line: 503, column: 10, scope: !862)
!869 = !DILocation(line: 502, column: 6, scope: !870)
!870 = !DILexicalBlockFile(scope: !782, file: !126, discriminator: 1)
!871 = !DILocation(line: 504, column: 13, scope: !872)
!872 = distinct !DILexicalBlock(scope: !862, file: !126, line: 503, column: 30)
!873 = !DILocation(line: 504, column: 12, scope: !872)
!874 = !DILocation(line: 504, column: 10, scope: !872)
!875 = !DILocation(line: 505, column: 4, scope: !872)
!876 = !DILocation(line: 505, column: 7, scope: !872)
!877 = !DILocation(line: 506, column: 2, scope: !872)
!878 = !DILocation(line: 508, column: 18, scope: !782)
!879 = !DILocation(line: 508, column: 24, scope: !782)
!880 = !DILocation(line: 508, column: 35, scope: !782)
!881 = !DILocation(line: 508, column: 39, scope: !782)
!882 = !DILocation(line: 508, column: 8, scope: !782)
!883 = !DILocation(line: 508, column: 6, scope: !782)
!884 = !DILocation(line: 511, column: 6, scope: !885)
!885 = distinct !DILexicalBlock(scope: !782, file: !126, line: 511, column: 6)
!886 = !DILocation(line: 511, column: 6, scope: !782)
!887 = !DILocation(line: 512, column: 9, scope: !885)
!888 = !DILocation(line: 512, column: 4, scope: !885)
!889 = !DILocation(line: 512, column: 7, scope: !885)
!890 = !DILocation(line: 512, column: 3, scope: !885)
!891 = !DILocation(line: 514, column: 7, scope: !892)
!892 = distinct !DILexicalBlock(scope: !782, file: !126, line: 514, column: 6)
!893 = !DILocation(line: 514, column: 6, scope: !782)
!894 = !DILocation(line: 515, column: 3, scope: !895)
!895 = distinct !DILexicalBlock(scope: !892, file: !126, line: 514, column: 12)
!896 = !DILocation(line: 515, column: 9, scope: !895)
!897 = !DILocation(line: 515, column: 19, scope: !895)
!898 = !DILocation(line: 516, column: 3, scope: !895)
!899 = !DILocation(line: 519, column: 2, scope: !782)
!900 = !DILocation(line: 520, column: 1, scope: !782)
!901 = distinct !DISubprogram(name: "inet_ip4tosockaddr", scope: !126, file: !126, line: 524, type: !902, isLocal: false, isDefinition: true, scopeLine: 525, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!902 = !DISubroutineType(types: !903)
!903 = !{null, !904, !139}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!905 = !DILocalVariable(name: "sin_addr", arg: 1, scope: !901, file: !126, line: 524, type: !904)
!906 = !DILocation(line: 524, column: 36, scope: !901)
!907 = !DILocalVariable(name: "addr", arg: 2, scope: !901, file: !126, line: 524, type: !139)
!908 = !DILocation(line: 524, column: 71, scope: !901)
!909 = !DILocalVariable(name: "addr4", scope: !901, file: !126, line: 526, type: !108)
!910 = !DILocation(line: 526, column: 22, scope: !901)
!911 = !DILocation(line: 526, column: 53, scope: !901)
!912 = !DILocation(line: 526, column: 30, scope: !901)
!913 = !DILocation(line: 527, column: 2, scope: !901)
!914 = !DILocation(line: 527, column: 9, scope: !901)
!915 = !DILocation(line: 527, column: 20, scope: !901)
!916 = !DILocation(line: 528, column: 2, scope: !901)
!917 = !DILocation(line: 528, column: 9, scope: !901)
!918 = !DILocation(line: 528, column: 21, scope: !901)
!919 = !DILocation(line: 528, column: 20, scope: !901)
!920 = !DILocation(line: 529, column: 1, scope: !901)
!921 = distinct !DISubprogram(name: "inet_ip6tosockaddr", scope: !126, file: !126, line: 533, type: !922, isLocal: false, isDefinition: true, scopeLine: 534, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !924, !139}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!925 = !DILocalVariable(name: "sin_addr", arg: 1, scope: !921, file: !126, line: 533, type: !924)
!926 = !DILocation(line: 533, column: 37, scope: !921)
!927 = !DILocalVariable(name: "addr", arg: 2, scope: !921, file: !126, line: 533, type: !139)
!928 = !DILocation(line: 533, column: 72, scope: !921)
!929 = !DILocalVariable(name: "addr6", scope: !921, file: !126, line: 535, type: !77)
!930 = !DILocation(line: 535, column: 23, scope: !921)
!931 = !DILocation(line: 535, column: 55, scope: !921)
!932 = !DILocation(line: 535, column: 31, scope: !921)
!933 = !DILocation(line: 536, column: 2, scope: !921)
!934 = !DILocation(line: 536, column: 9, scope: !921)
!935 = !DILocation(line: 536, column: 21, scope: !921)
!936 = !DILocation(line: 537, column: 2, scope: !921)
!937 = !DILocation(line: 537, column: 9, scope: !921)
!938 = !DILocation(line: 537, column: 22, scope: !921)
!939 = !DILocation(line: 537, column: 21, scope: !921)
!940 = !DILocation(line: 538, column: 1, scope: !921)
!941 = !DILocalVariable(name: "addr", arg: 1, scope: !136, file: !126, line: 561, type: !139)
!942 = !DILocation(line: 561, column: 43, scope: !136)
!943 = !DILocation(line: 564, column: 20, scope: !136)
!944 = !DILocation(line: 564, column: 2, scope: !136)
!945 = !DILocation(line: 565, column: 2, scope: !136)
!946 = distinct !DISubprogram(name: "inet_sockaddrtos2", scope: !126, file: !126, line: 542, type: !947, isLocal: true, isDefinition: true, scopeLine: 543, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!947 = !DISubroutineType(types: !948)
!948 = !{!131, !139, !131}
!949 = !DILocalVariable(name: "addr", arg: 1, scope: !946, file: !126, line: 542, type: !139)
!950 = !DILocation(line: 542, column: 44, scope: !946)
!951 = !DILocalVariable(name: "addr_str", arg: 2, scope: !946, file: !126, line: 542, type: !131)
!952 = !DILocation(line: 542, column: 56, scope: !946)
!953 = !DILocalVariable(name: "addr_ip", scope: !946, file: !126, line: 544, type: !215)
!954 = !DILocation(line: 544, column: 8, scope: !946)
!955 = !DILocation(line: 546, column: 6, scope: !956)
!956 = distinct !DILexicalBlock(scope: !946, file: !126, line: 546, column: 6)
!957 = !DILocation(line: 546, column: 12, scope: !956)
!958 = !DILocation(line: 546, column: 22, scope: !956)
!959 = !DILocation(line: 546, column: 6, scope: !946)
!960 = !DILocalVariable(name: "addr6", scope: !961, file: !126, line: 547, type: !77)
!961 = distinct !DILexicalBlock(scope: !956, file: !126, line: 546, column: 34)
!962 = !DILocation(line: 547, column: 24, scope: !961)
!963 = !DILocation(line: 547, column: 56, scope: !961)
!964 = !DILocation(line: 547, column: 32, scope: !961)
!965 = !DILocation(line: 548, column: 14, scope: !961)
!966 = !DILocation(line: 548, column: 21, scope: !961)
!967 = !DILocation(line: 548, column: 13, scope: !961)
!968 = !DILocation(line: 548, column: 11, scope: !961)
!969 = !DILocation(line: 549, column: 2, scope: !961)
!970 = !DILocalVariable(name: "addr4", scope: !971, file: !126, line: 550, type: !108)
!971 = distinct !DILexicalBlock(scope: !956, file: !126, line: 549, column: 9)
!972 = !DILocation(line: 550, column: 23, scope: !971)
!973 = !DILocation(line: 550, column: 54, scope: !971)
!974 = !DILocation(line: 550, column: 31, scope: !971)
!975 = !DILocation(line: 551, column: 14, scope: !971)
!976 = !DILocation(line: 551, column: 21, scope: !971)
!977 = !DILocation(line: 551, column: 13, scope: !971)
!978 = !DILocation(line: 551, column: 11, scope: !971)
!979 = !DILocation(line: 554, column: 17, scope: !980)
!980 = distinct !DILexicalBlock(scope: !946, file: !126, line: 554, column: 6)
!981 = !DILocation(line: 554, column: 23, scope: !980)
!982 = !DILocation(line: 554, column: 34, scope: !980)
!983 = !DILocation(line: 554, column: 43, scope: !980)
!984 = !DILocation(line: 554, column: 7, scope: !980)
!985 = !DILocation(line: 554, column: 6, scope: !946)
!986 = !DILocation(line: 555, column: 3, scope: !980)
!987 = !DILocation(line: 557, column: 9, scope: !946)
!988 = !DILocation(line: 557, column: 2, scope: !946)
!989 = !DILocation(line: 558, column: 1, scope: !946)
!990 = distinct !DISubprogram(name: "inet_sockaddrport", scope: !126, file: !126, line: 569, type: !991, isLocal: false, isDefinition: true, scopeLine: 570, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!991 = !DISubroutineType(types: !992)
!992 = !{!83, !139}
!993 = !DILocalVariable(name: "addr", arg: 1, scope: !990, file: !126, line: 569, type: !139)
!994 = !DILocation(line: 569, column: 44, scope: !990)
!995 = !DILocalVariable(name: "port", scope: !990, file: !126, line: 571, type: !83)
!996 = !DILocation(line: 571, column: 11, scope: !990)
!997 = !DILocation(line: 573, column: 6, scope: !998)
!998 = distinct !DILexicalBlock(scope: !990, file: !126, line: 573, column: 6)
!999 = !DILocation(line: 573, column: 12, scope: !998)
!1000 = !DILocation(line: 573, column: 22, scope: !998)
!1001 = !DILocation(line: 573, column: 6, scope: !990)
!1002 = !DILocalVariable(name: "addr6", scope: !1003, file: !126, line: 574, type: !77)
!1003 = distinct !DILexicalBlock(scope: !998, file: !126, line: 573, column: 34)
!1004 = !DILocation(line: 574, column: 24, scope: !1003)
!1005 = !DILocation(line: 574, column: 56, scope: !1003)
!1006 = !DILocation(line: 574, column: 32, scope: !1003)
!1007 = !DILocation(line: 575, column: 10, scope: !1003)
!1008 = !DILocation(line: 575, column: 17, scope: !1003)
!1009 = !DILocation(line: 575, column: 8, scope: !1003)
!1010 = !DILocation(line: 576, column: 2, scope: !1003)
!1011 = !DILocalVariable(name: "addr4", scope: !1012, file: !126, line: 579, type: !108)
!1012 = distinct !DILexicalBlock(scope: !998, file: !126, line: 576, column: 9)
!1013 = !DILocation(line: 579, column: 23, scope: !1012)
!1014 = !DILocation(line: 579, column: 54, scope: !1012)
!1015 = !DILocation(line: 579, column: 31, scope: !1012)
!1016 = !DILocation(line: 580, column: 10, scope: !1012)
!1017 = !DILocation(line: 580, column: 17, scope: !1012)
!1018 = !DILocation(line: 580, column: 8, scope: !1012)
!1019 = !DILocation(line: 583, column: 9, scope: !990)
!1020 = !DILocation(line: 583, column: 2, scope: !990)
!1021 = !DILocalVariable(name: "addr", arg: 1, scope: !153, file: !126, line: 587, type: !139)
!1022 = !DILocation(line: 587, column: 46, scope: !153)
!1023 = !DILocalVariable(name: "addr_str", scope: !153, file: !126, line: 589, type: !149)
!1024 = !DILocation(line: 589, column: 7, scope: !153)
!1025 = !DILocation(line: 592, column: 20, scope: !153)
!1026 = !DILocation(line: 592, column: 26, scope: !153)
!1027 = !DILocation(line: 592, column: 2, scope: !153)
!1028 = !DILocation(line: 594, column: 5, scope: !153)
!1029 = !DILocation(line: 595, column: 29, scope: !153)
!1030 = !DILocation(line: 595, column: 11, scope: !153)
!1031 = !DILocation(line: 595, column: 5, scope: !1032)
!1032 = !DILexicalBlockFile(scope: !153, file: !126, discriminator: 1)
!1033 = !DILocation(line: 595, column: 5, scope: !153)
!1034 = !DILocation(line: 593, column: 2, scope: !153)
!1035 = !DILocation(line: 596, column: 2, scope: !153)
!1036 = !DILocalVariable(name: "addr", arg: 1, scope: !158, file: !126, line: 600, type: !139)
!1037 = !DILocation(line: 600, column: 46, scope: !158)
!1038 = !DILocalVariable(name: "proto", arg: 2, scope: !158, file: !126, line: 600, type: !83)
!1039 = !DILocation(line: 600, column: 61, scope: !158)
!1040 = !DILocalVariable(name: "addr_str", scope: !158, file: !126, line: 602, type: !149)
!1041 = !DILocation(line: 602, column: 7, scope: !158)
!1042 = !DILocalVariable(name: "proto_str", scope: !158, file: !126, line: 604, type: !131)
!1043 = !DILocation(line: 604, column: 8, scope: !158)
!1044 = !DILocation(line: 604, column: 20, scope: !158)
!1045 = !DILocation(line: 604, column: 26, scope: !158)
!1046 = !DILocation(line: 604, column: 20, scope: !1047)
!1047 = !DILexicalBlockFile(scope: !158, file: !126, discriminator: 1)
!1048 = !DILocation(line: 604, column: 50, scope: !1049)
!1049 = !DILexicalBlockFile(scope: !158, file: !126, discriminator: 2)
!1050 = !DILocation(line: 604, column: 56, scope: !1049)
!1051 = !DILocation(line: 604, column: 50, scope: !1052)
!1052 = !DILexicalBlockFile(scope: !158, file: !126, discriminator: 3)
!1053 = !DILocation(line: 604, column: 81, scope: !1054)
!1054 = !DILexicalBlockFile(scope: !158, file: !126, discriminator: 4)
!1055 = !DILocation(line: 604, column: 87, scope: !1054)
!1056 = !DILocation(line: 604, column: 81, scope: !1057)
!1057 = !DILexicalBlockFile(scope: !158, file: !126, discriminator: 5)
!1058 = !DILocation(line: 604, column: 114, scope: !1059)
!1059 = !DILexicalBlockFile(scope: !158, file: !126, discriminator: 6)
!1060 = !DILocation(line: 604, column: 120, scope: !1059)
!1061 = !DILocation(line: 604, column: 81, scope: !1059)
!1062 = !DILocation(line: 604, column: 81, scope: !1063)
!1063 = !DILexicalBlockFile(scope: !158, file: !126, discriminator: 7)
!1064 = !DILocation(line: 604, column: 50, scope: !1063)
!1065 = !DILocation(line: 604, column: 50, scope: !1066)
!1066 = !DILexicalBlockFile(scope: !158, file: !126, discriminator: 8)
!1067 = !DILocation(line: 604, column: 20, scope: !1066)
!1068 = !DILocation(line: 604, column: 20, scope: !1069)
!1069 = !DILexicalBlockFile(scope: !158, file: !126, discriminator: 9)
!1070 = !DILocation(line: 604, column: 8, scope: !1069)
!1071 = !DILocation(line: 606, column: 20, scope: !158)
!1072 = !DILocation(line: 606, column: 26, scope: !158)
!1073 = !DILocation(line: 606, column: 2, scope: !158)
!1074 = !DILocation(line: 607, column: 43, scope: !158)
!1075 = !DILocation(line: 607, column: 53, scope: !158)
!1076 = !DILocation(line: 608, column: 28, scope: !158)
!1077 = !DILocation(line: 608, column: 10, scope: !158)
!1078 = !DILocation(line: 608, column: 4, scope: !1047)
!1079 = !DILocation(line: 608, column: 4, scope: !158)
!1080 = !DILocation(line: 607, column: 2, scope: !158)
!1081 = !DILocation(line: 609, column: 2, scope: !158)
!1082 = distinct !DISubprogram(name: "inet_sockaddrip4", scope: !126, file: !126, line: 613, type: !1083, isLocal: false, isDefinition: true, scopeLine: 614, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!86, !139}
!1085 = !DILocalVariable(name: "addr", arg: 1, scope: !1082, file: !126, line: 613, type: !139)
!1086 = !DILocation(line: 613, column: 43, scope: !1082)
!1087 = !DILocation(line: 615, column: 6, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1082, file: !126, line: 615, column: 6)
!1089 = !DILocation(line: 615, column: 12, scope: !1088)
!1090 = !DILocation(line: 615, column: 22, scope: !1088)
!1091 = !DILocation(line: 615, column: 6, scope: !1082)
!1092 = !DILocation(line: 616, column: 3, scope: !1088)
!1093 = !DILocation(line: 618, column: 33, scope: !1082)
!1094 = !DILocation(line: 618, column: 40, scope: !1082)
!1095 = !DILocation(line: 618, column: 49, scope: !1082)
!1096 = !DILocation(line: 618, column: 2, scope: !1082)
!1097 = !DILocation(line: 619, column: 1, scope: !1082)
!1098 = distinct !DISubprogram(name: "inet_sockaddrip6", scope: !126, file: !126, line: 622, type: !1099, isLocal: false, isDefinition: true, scopeLine: 623, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!177, !139, !924}
!1101 = !DILocalVariable(name: "addr", arg: 1, scope: !1098, file: !126, line: 622, type: !139)
!1102 = !DILocation(line: 622, column: 43, scope: !1098)
!1103 = !DILocalVariable(name: "ip6", arg: 2, scope: !1098, file: !126, line: 622, type: !924)
!1104 = !DILocation(line: 622, column: 66, scope: !1098)
!1105 = !DILocation(line: 624, column: 6, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1098, file: !126, line: 624, column: 6)
!1107 = !DILocation(line: 624, column: 12, scope: !1106)
!1108 = !DILocation(line: 624, column: 22, scope: !1106)
!1109 = !DILocation(line: 624, column: 6, scope: !1098)
!1110 = !DILocation(line: 625, column: 3, scope: !1106)
!1111 = !DILocation(line: 627, column: 3, scope: !1098)
!1112 = !DILocation(line: 627, column: 34, scope: !1098)
!1113 = !DILocation(line: 627, column: 41, scope: !1098)
!1114 = !DILocation(line: 628, column: 2, scope: !1098)
!1115 = !DILocation(line: 629, column: 1, scope: !1098)
!1116 = distinct !DISubprogram(name: "inet_inaddrcmp", scope: !126, file: !126, line: 633, type: !1117, isLocal: false, isDefinition: true, scopeLine: 634, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!177, !1119, !1120, !1120}
!1119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1122 = !DILocalVariable(name: "family", arg: 1, scope: !1116, file: !126, line: 633, type: !1119)
!1123 = !DILocation(line: 633, column: 26, scope: !1116)
!1124 = !DILocalVariable(name: "a", arg: 2, scope: !1116, file: !126, line: 633, type: !1120)
!1125 = !DILocation(line: 633, column: 46, scope: !1116)
!1126 = !DILocalVariable(name: "b", arg: 3, scope: !1116, file: !126, line: 633, type: !1120)
!1127 = !DILocation(line: 633, column: 61, scope: !1116)
!1128 = !DILocalVariable(name: "addr_diff", scope: !1116, file: !126, line: 635, type: !120)
!1129 = !DILocation(line: 635, column: 10, scope: !1116)
!1130 = !DILocation(line: 637, column: 6, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1116, file: !126, line: 637, column: 6)
!1132 = !DILocation(line: 637, column: 13, scope: !1131)
!1133 = !DILocation(line: 637, column: 6, scope: !1116)
!1134 = !DILocation(line: 638, column: 51, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1131, file: !126, line: 637, column: 24)
!1136 = !DILocation(line: 638, column: 32, scope: !1135)
!1137 = !DILocation(line: 638, column: 30, scope: !1135)
!1138 = !DILocation(line: 638, column: 24, scope: !1135)
!1139 = !DILocation(line: 638, column: 15, scope: !1135)
!1140 = !DILocation(line: 638, column: 93, scope: !1135)
!1141 = !DILocation(line: 638, column: 74, scope: !1135)
!1142 = !DILocation(line: 638, column: 72, scope: !1135)
!1143 = !DILocation(line: 638, column: 66, scope: !1144)
!1144 = !DILexicalBlockFile(scope: !1135, file: !126, discriminator: 1)
!1145 = !DILocation(line: 638, column: 57, scope: !1135)
!1146 = !DILocation(line: 638, column: 55, scope: !1135)
!1147 = !DILocation(line: 638, column: 13, scope: !1135)
!1148 = !DILocation(line: 639, column: 7, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1135, file: !126, line: 639, column: 7)
!1150 = !DILocation(line: 639, column: 17, scope: !1149)
!1151 = !DILocation(line: 639, column: 7, scope: !1135)
!1152 = !DILocation(line: 640, column: 4, scope: !1149)
!1153 = !DILocation(line: 641, column: 7, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1135, file: !126, line: 641, column: 7)
!1155 = !DILocation(line: 641, column: 17, scope: !1154)
!1156 = !DILocation(line: 641, column: 7, scope: !1135)
!1157 = !DILocation(line: 642, column: 4, scope: !1154)
!1158 = !DILocation(line: 643, column: 3, scope: !1135)
!1159 = !DILocation(line: 646, column: 6, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1116, file: !126, line: 646, column: 6)
!1161 = !DILocation(line: 646, column: 13, scope: !1160)
!1162 = !DILocation(line: 646, column: 6, scope: !1116)
!1163 = !DILocalVariable(name: "i", scope: !1164, file: !126, line: 647, type: !177)
!1164 = distinct !DILexicalBlock(scope: !1160, file: !126, line: 646, column: 25)
!1165 = !DILocation(line: 647, column: 7, scope: !1164)
!1166 = !DILocation(line: 649, column: 10, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1164, file: !126, line: 649, column: 3)
!1168 = !DILocation(line: 649, column: 8, scope: !1167)
!1169 = !DILocation(line: 649, column: 15, scope: !1170)
!1170 = !DILexicalBlockFile(scope: !1171, file: !126, discriminator: 1)
!1171 = distinct !DILexicalBlock(scope: !1167, file: !126, line: 649, column: 3)
!1172 = !DILocation(line: 649, column: 17, scope: !1170)
!1173 = !DILocation(line: 649, column: 3, scope: !1170)
!1174 = !DILocation(line: 650, column: 56, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1171, file: !126, line: 649, column: 28)
!1176 = !DILocation(line: 650, column: 31, scope: !1175)
!1177 = !DILocation(line: 650, column: 52, scope: !1175)
!1178 = !DILocation(line: 650, column: 32, scope: !1175)
!1179 = !DILocation(line: 650, column: 25, scope: !1175)
!1180 = !DILocation(line: 650, column: 16, scope: !1175)
!1181 = !DILocation(line: 650, column: 102, scope: !1175)
!1182 = !DILocation(line: 650, column: 77, scope: !1175)
!1183 = !DILocation(line: 650, column: 98, scope: !1175)
!1184 = !DILocation(line: 650, column: 78, scope: !1175)
!1185 = !DILocation(line: 650, column: 71, scope: !1186)
!1186 = !DILexicalBlockFile(scope: !1175, file: !126, discriminator: 1)
!1187 = !DILocation(line: 650, column: 62, scope: !1175)
!1188 = !DILocation(line: 650, column: 60, scope: !1175)
!1189 = !DILocation(line: 650, column: 14, scope: !1175)
!1190 = !DILocation(line: 651, column: 8, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1175, file: !126, line: 651, column: 8)
!1192 = !DILocation(line: 651, column: 18, scope: !1191)
!1193 = !DILocation(line: 651, column: 8, scope: !1175)
!1194 = !DILocation(line: 652, column: 5, scope: !1191)
!1195 = !DILocation(line: 653, column: 8, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1175, file: !126, line: 653, column: 8)
!1197 = !DILocation(line: 653, column: 18, scope: !1196)
!1198 = !DILocation(line: 653, column: 8, scope: !1175)
!1199 = !DILocation(line: 654, column: 5, scope: !1196)
!1200 = !DILocation(line: 655, column: 3, scope: !1175)
!1201 = !DILocation(line: 649, column: 23, scope: !1202)
!1202 = !DILexicalBlockFile(scope: !1171, file: !126, discriminator: 2)
!1203 = !DILocation(line: 649, column: 3, scope: !1202)
!1204 = distinct !{!1204, !1205}
!1205 = !DILocation(line: 649, column: 3, scope: !1164)
!1206 = !DILocation(line: 656, column: 3, scope: !1164)
!1207 = !DILocation(line: 659, column: 2, scope: !1116)
!1208 = !DILocation(line: 660, column: 1, scope: !1116)
!1209 = distinct !DISubprogram(name: "inet_sockaddrcmp", scope: !126, file: !126, line: 663, type: !1210, isLocal: false, isDefinition: true, scopeLine: 664, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!177, !1212, !1212}
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!1214 = !DILocalVariable(name: "a", arg: 1, scope: !1209, file: !126, line: 663, type: !1212)
!1215 = !DILocation(line: 663, column: 49, scope: !1209)
!1216 = !DILocalVariable(name: "b", arg: 2, scope: !1209, file: !126, line: 663, type: !1212)
!1217 = !DILocation(line: 663, column: 83, scope: !1209)
!1218 = !DILocation(line: 665, column: 6, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1209, file: !126, line: 665, column: 6)
!1220 = !DILocation(line: 665, column: 9, scope: !1219)
!1221 = !DILocation(line: 665, column: 22, scope: !1219)
!1222 = !DILocation(line: 665, column: 25, scope: !1219)
!1223 = !DILocation(line: 665, column: 19, scope: !1219)
!1224 = !DILocation(line: 665, column: 6, scope: !1209)
!1225 = !DILocation(line: 666, column: 3, scope: !1219)
!1226 = !DILocation(line: 668, column: 6, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1209, file: !126, line: 668, column: 6)
!1228 = !DILocation(line: 668, column: 9, scope: !1227)
!1229 = !DILocation(line: 668, column: 19, scope: !1227)
!1230 = !DILocation(line: 668, column: 6, scope: !1209)
!1231 = !DILocation(line: 669, column: 25, scope: !1227)
!1232 = !DILocation(line: 669, column: 28, scope: !1227)
!1233 = !DILocation(line: 670, column: 36, scope: !1227)
!1234 = !DILocation(line: 670, column: 40, scope: !1227)
!1235 = !DILocation(line: 670, column: 11, scope: !1227)
!1236 = !DILocation(line: 671, column: 36, scope: !1227)
!1237 = !DILocation(line: 671, column: 40, scope: !1227)
!1238 = !DILocation(line: 671, column: 11, scope: !1227)
!1239 = !DILocation(line: 669, column: 10, scope: !1227)
!1240 = !DILocation(line: 669, column: 3, scope: !1227)
!1241 = !DILocation(line: 672, column: 6, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1209, file: !126, line: 672, column: 6)
!1243 = !DILocation(line: 672, column: 9, scope: !1242)
!1244 = !DILocation(line: 672, column: 19, scope: !1242)
!1245 = !DILocation(line: 672, column: 6, scope: !1209)
!1246 = !DILocation(line: 673, column: 25, scope: !1242)
!1247 = !DILocation(line: 673, column: 28, scope: !1242)
!1248 = !DILocation(line: 674, column: 37, scope: !1242)
!1249 = !DILocation(line: 674, column: 41, scope: !1242)
!1250 = !DILocation(line: 674, column: 11, scope: !1242)
!1251 = !DILocation(line: 675, column: 37, scope: !1242)
!1252 = !DILocation(line: 675, column: 41, scope: !1242)
!1253 = !DILocation(line: 675, column: 11, scope: !1242)
!1254 = !DILocation(line: 673, column: 10, scope: !1242)
!1255 = !DILocation(line: 673, column: 3, scope: !1242)
!1256 = !DILocation(line: 676, column: 2, scope: !1209)
!1257 = !DILocation(line: 677, column: 1, scope: !1209)
!1258 = distinct !DISubprogram(name: "get_local_name", scope: !126, file: !126, line: 750, type: !1259, isLocal: false, isDefinition: true, scopeLine: 751, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!131}
!1261 = !DILocalVariable(name: "name", scope: !1258, file: !126, line: 752, type: !1262)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !1263, line: 48, size: 3120, align: 8, elements: !1264)
!1263 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/utsname.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!1264 = !{!1265, !1269, !1270, !1271, !1272, !1273}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !1262, file: !1263, line: 51, baseType: !1266, size: 520, align: 8)
!1266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 520, align: 8, elements: !1267)
!1267 = !{!1268}
!1268 = !DISubrange(count: 65)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !1262, file: !1263, line: 54, baseType: !1266, size: 520, align: 8, offset: 520)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !1262, file: !1263, line: 57, baseType: !1266, size: 520, align: 8, offset: 1040)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1262, file: !1263, line: 59, baseType: !1266, size: 520, align: 8, offset: 1560)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1262, file: !1263, line: 62, baseType: !1266, size: 520, align: 8, offset: 2080)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !1262, file: !1263, line: 67, baseType: !1266, size: 520, align: 8, offset: 2600)
!1274 = !DILocation(line: 752, column: 17, scope: !1258)
!1275 = !DILocalVariable(name: "hints", scope: !1258, file: !126, line: 753, type: !680)
!1276 = !DILocation(line: 753, column: 18, scope: !1258)
!1277 = !DILocalVariable(name: "res", scope: !1258, file: !126, line: 753, type: !679)
!1278 = !DILocation(line: 753, column: 26, scope: !1258)
!1279 = !DILocalVariable(name: "canonname", scope: !1258, file: !126, line: 754, type: !131)
!1280 = !DILocation(line: 754, column: 8, scope: !1258)
!1281 = !DILocalVariable(name: "len", scope: !1258, file: !126, line: 755, type: !64)
!1282 = !DILocation(line: 755, column: 9, scope: !1258)
!1283 = !DILocation(line: 757, column: 2, scope: !1258)
!1284 = !DILocation(line: 758, column: 8, scope: !1258)
!1285 = !DILocation(line: 758, column: 17, scope: !1258)
!1286 = !DILocation(line: 760, column: 6, scope: !1287)
!1287 = distinct !DILexicalBlock(scope: !1258, file: !126, line: 760, column: 6)
!1288 = !DILocation(line: 760, column: 19, scope: !1287)
!1289 = !DILocation(line: 760, column: 6, scope: !1258)
!1290 = !DILocation(line: 761, column: 3, scope: !1287)
!1291 = !DILocation(line: 763, column: 23, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1258, file: !126, line: 763, column: 6)
!1293 = !DILocation(line: 763, column: 18, scope: !1292)
!1294 = !DILocation(line: 763, column: 6, scope: !1292)
!1295 = !DILocation(line: 763, column: 52, scope: !1292)
!1296 = !DILocation(line: 763, column: 6, scope: !1258)
!1297 = !DILocation(line: 764, column: 3, scope: !1292)
!1298 = !DILocation(line: 766, column: 6, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1258, file: !126, line: 766, column: 6)
!1300 = !DILocation(line: 766, column: 10, scope: !1299)
!1301 = !DILocation(line: 766, column: 13, scope: !1302)
!1302 = !DILexicalBlockFile(scope: !1299, file: !126, discriminator: 1)
!1303 = !DILocation(line: 766, column: 18, scope: !1302)
!1304 = !DILocation(line: 766, column: 6, scope: !1302)
!1305 = !DILocation(line: 767, column: 16, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1299, file: !126, line: 766, column: 32)
!1307 = !DILocation(line: 767, column: 21, scope: !1306)
!1308 = !DILocation(line: 767, column: 9, scope: !1306)
!1309 = !DILocation(line: 767, column: 7, scope: !1306)
!1310 = !DILocation(line: 768, column: 23, scope: !1306)
!1311 = !DILocation(line: 768, column: 27, scope: !1306)
!1312 = !DILocation(line: 768, column: 16, scope: !1306)
!1313 = !DILocation(line: 768, column: 13, scope: !1306)
!1314 = !DILocation(line: 769, column: 7, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1306, file: !126, line: 769, column: 7)
!1316 = !DILocation(line: 769, column: 7, scope: !1306)
!1317 = !DILocation(line: 770, column: 11, scope: !1318)
!1318 = distinct !DILexicalBlock(scope: !1315, file: !126, line: 769, column: 18)
!1319 = !DILocation(line: 770, column: 22, scope: !1318)
!1320 = !DILocation(line: 770, column: 27, scope: !1318)
!1321 = !DILocation(line: 770, column: 41, scope: !1318)
!1322 = !DILocation(line: 770, column: 4, scope: !1318)
!1323 = !DILocation(line: 771, column: 3, scope: !1318)
!1324 = !DILocation(line: 772, column: 2, scope: !1306)
!1325 = !DILocation(line: 774, column: 15, scope: !1258)
!1326 = !DILocation(line: 774, column: 2, scope: !1258)
!1327 = !DILocation(line: 776, column: 9, scope: !1258)
!1328 = !DILocation(line: 776, column: 2, scope: !1258)
!1329 = !DILocation(line: 777, column: 1, scope: !1258)
!1330 = distinct !DISubprogram(name: "string_equal", scope: !126, file: !126, line: 781, type: !1331, isLocal: false, isDefinition: true, scopeLine: 782, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !133)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{!241, !366, !366}
!1333 = !DILocalVariable(name: "str1", arg: 1, scope: !1330, file: !126, line: 781, type: !366)
