; ModuleID = './[inter]lib--notify.o.i'
source_filename = "./[inter]lib--notify.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._thread_master = type { %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.list_head, %struct.list_head, %struct.list_head, %struct._list*, %struct.rb_root, %struct.epoll_event*, %struct._thread_event*, i32, i32, i32, i32, %struct._thread*, i64, i64, i8 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.rb_root = type { %struct.rb_node* }
%struct.rb_node = type { i64, %struct.rb_node*, %struct.rb_node* }
%struct.epoll_event = type opaque
%struct._thread_event = type { %struct._thread*, %struct._thread*, i64, i32, %struct.rb_node }
%struct._thread = type { i64, i32, %struct._thread_master*, {}*, i8*, %struct.timeval, %union.anon, %struct._thread_event*, %union.anon.0 }
%struct.timeval = type { i64, i64 }
%union.anon = type { %struct.anon }
%struct.anon = type { i32, i32 }

!226 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFFBIG", value: 126)
!227 = !DIEnumerator(name: "_SC_XBS5_LP64_OFF64", value: 127)
!228 = !DIEnumerator(name: "_SC_XBS5_LPBIG_OFFBIG", value: 128)
!229 = !DIEnumerator(name: "_SC_XOPEN_LEGACY", value: 129)
!230 = !DIEnumerator(name: "_SC_XOPEN_REALTIME", value: 130)
!231 = !DIEnumerator(name: "_SC_XOPEN_REALTIME_THREADS", value: 131)
!232 = !DIEnumerator(name: "_SC_ADVISORY_INFO", value: 132)
!233 = !DIEnumerator(name: "_SC_BARRIERS", value: 133)
!234 = !DIEnumerator(name: "_SC_BASE", value: 134)
!235 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135)
!236 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136)
!237 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137)
!238 = !DIEnumerator(name: "_SC_CPUTIME", value: 138)
!239 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139)
!240 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!241 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!242 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!243 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!244 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!245 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!246 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!247 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!248 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!249 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!250 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!251 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!252 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!253 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!254 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!255 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!256 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!257 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!258 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!259 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!260 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!261 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!262 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!263 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!264 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!265 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!266 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!267 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!268 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!269 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!270 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!271 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!272 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!273 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!274 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!275 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!276 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!277 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!278 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!279 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!280 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!281 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!282 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!283 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!284 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!285 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!286 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!287 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!288 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!289 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!290 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!291 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!292 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!293 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!294 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!295 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!296 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!297 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!298 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!299 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!300 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!301 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!302 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!303 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!304 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!305 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!306 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!307 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!308 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!309 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!310 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!311 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!312 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!313 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!314 = !{!315, !386, !416, !365, !431, !498}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !4, line: 99, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !4, line: 78, size: 768, align: 64, elements: !318)
!318 = !{!319, !321, !323, !462, !467, !468, !478, !491, !493}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !317, file: !4, line: 79, baseType: !320, size: 64, align: 64)
!320 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !317, file: !4, line: 80, baseType: !322, size: 32, align: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !4, line: 63, baseType: !3)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !317, file: !4, line: 81, baseType: !324, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !4, line: 112, size: 1280, align: 64, elements: !326)
!326 = !{!327, !339, !340, !341, !342, !350, !351, !352, !438, !439, !442, !453, !454, !455, !456, !457, !458, !459, !460}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !325, file: !4, line: 113, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !329, line: 109, baseType: !330)
!329 = !DIFile(filename: "rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !329, line: 106, size: 64, align: 64, elements: !331)
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !330, file: !329, line: 108, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !329, line: 97, size: 192, align: 64, elements: !335)
!335 = !{!336, !337, !338}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !334, file: !329, line: 99, baseType: !320, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !334, file: !329, line: 102, baseType: !333, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !334, file: !329, line: 103, baseType: !333, size: 64, align: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !325, file: !4, line: 114, baseType: !328, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !325, file: !4, line: 115, baseType: !328, size: 64, align: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !325, file: !4, line: 116, baseType: !328, size: 64, align: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !325, file: !4, line: 117, baseType: !343, size: 128, align: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !344, line: 62, baseType: !345)
!344 = !DIFile(filename: "list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !344, line: 60, size: 128, align: 64, elements: !346)
!346 = !{!347, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !345, file: !344, line: 61, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !345, file: !344, line: 61, baseType: !348, size: 64, align: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !325, file: !4, line: 121, baseType: !343, size: 128, align: 64, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !325, file: !4, line: 122, baseType: !343, size: 128, align: 64, offset: 512)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !325, file: !4, line: 124, baseType: !353, size: 64, align: 64, offset: 640)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !354, line: 31, baseType: !355)
!354 = !DIFile(filename: "list.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !354, line: 39, size: 320, align: 64, elements: !357)
!357 = !{!358, !366, !367, !369, !373}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !356, file: !354, line: 40, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !354, line: 33, size: 192, align: 64, elements: !361)
!361 = !{!362, !363, !364}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !360, file: !354, line: 34, baseType: !359, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !360, file: !354, line: 35, baseType: !359, size: 64, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !360, file: !354, line: 36, baseType: !365, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !356, file: !354, line: 41, baseType: !359, size: 64, align: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !356, file: !354, line: 42, baseType: !368, size: 32, align: 32, offset: 128)
!368 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !356, file: !354, line: 43, baseType: !370, size: 64, align: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !365}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !356, file: !354, line: 44, baseType: !374, size: 64, align: 64, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !377, !365}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !379, line: 48, baseType: !380)
!379 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !381, line: 241, size: 1728, align: 64, elements: !382)
!381 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!382 = !{!383, !385, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !406, !407, !408, !409, !413, !415, !417, !421, !424, !426, !427, !428, !429, !430, !433, !434}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !380, file: !381, line: 242, baseType: !384, size: 32, align: 32)
!384 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !380, file: !381, line: 247, baseType: !386, size: 64, align: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !380, file: !381, line: 248, baseType: !386, size: 64, align: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !380, file: !381, line: 249, baseType: !386, size: 64, align: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !380, file: !381, line: 250, baseType: !386, size: 64, align: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !380, file: !381, line: 251, baseType: !386, size: 64, align: 64, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !380, file: !381, line: 252, baseType: !386, size: 64, align: 64, offset: 384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !380, file: !381, line: 253, baseType: !386, size: 64, align: 64, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !380, file: !381, line: 254, baseType: !386, size: 64, align: 64, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !380, file: !381, line: 256, baseType: !386, size: 64, align: 64, offset: 576)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !380, file: !381, line: 257, baseType: !386, size: 64, align: 64, offset: 640)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !380, file: !381, line: 258, baseType: !386, size: 64, align: 64, offset: 704)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !380, file: !381, line: 260, baseType: !399, size: 64, align: 64, offset: 768)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !381, line: 156, size: 192, align: 64, elements: !401)
!401 = !{!402, !403, !405}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !400, file: !381, line: 157, baseType: !399, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !400, file: !381, line: 158, baseType: !404, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !400, file: !381, line: 162, baseType: !384, size: 32, align: 32, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !380, file: !381, line: 262, baseType: !404, size: 64, align: 64, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !380, file: !381, line: 264, baseType: !384, size: 32, align: 32, offset: 896)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !380, file: !381, line: 268, baseType: !384, size: 32, align: 32, offset: 928)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !380, file: !381, line: 270, baseType: !410, size: 64, align: 64, offset: 960)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !411, line: 131, baseType: !412)
!411 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!412 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !380, file: !381, line: 274, baseType: !414, size: 16, align: 16, offset: 1024)
!414 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !380, file: !381, line: 275, baseType: !416, size: 8, align: 8, offset: 1040)
!416 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !380, file: !381, line: 276, baseType: !418, size: 8, align: 8, offset: 1048)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 8, align: 8, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 1)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !380, file: !381, line: 280, baseType: !422, size: 64, align: 64, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !381, line: 150, baseType: null)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !380, file: !381, line: 289, baseType: !425, size: 64, align: 64, offset: 1152)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !411, line: 132, baseType: !412)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !380, file: !381, line: 297, baseType: !365, size: 64, align: 64, offset: 1216)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !380, file: !381, line: 298, baseType: !365, size: 64, align: 64, offset: 1280)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !380, file: !381, line: 299, baseType: !365, size: 64, align: 64, offset: 1344)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !380, file: !381, line: 300, baseType: !365, size: 64, align: 64, offset: 1408)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !380, file: !381, line: 302, baseType: !431, size: 64, align: 64, offset: 1472)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !432, line: 216, baseType: !320)
!432 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !380, file: !381, line: 303, baseType: !384, size: 32, align: 32, offset: 1536)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !380, file: !381, line: 305, baseType: !435, size: 160, align: 8, offset: 1568)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 160, align: 8, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 20)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !325, file: !4, line: 127, baseType: !328, size: 64, align: 64, offset: 704)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !325, file: !4, line: 128, baseType: !440, size: 64, align: 64, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !4, line: 128, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !325, file: !4, line: 129, baseType: !443, size: 64, align: 64, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !4, line: 109, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !4, line: 102, size: 448, align: 64, elements: !446)
!446 = !{!447, !448, !449, !450, !451}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !445, file: !4, line: 103, baseType: !315, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !445, file: !4, line: 104, baseType: !315, size: 64, align: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !445, file: !4, line: 105, baseType: !320, size: 64, align: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !445, file: !4, line: 106, baseType: !384, size: 32, align: 32, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !445, file: !4, line: 108, baseType: !452, size: 192, align: 64, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !329, line: 104, baseType: !334)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !325, file: !4, line: 130, baseType: !368, size: 32, align: 32, offset: 896)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !325, file: !4, line: 131, baseType: !368, size: 32, align: 32, offset: 928)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !325, file: !4, line: 132, baseType: !384, size: 32, align: 32, offset: 960)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !325, file: !4, line: 135, baseType: !384, size: 32, align: 32, offset: 992)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !325, file: !4, line: 136, baseType: !315, size: 64, align: 64, offset: 1024)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !325, file: !4, line: 146, baseType: !320, size: 64, align: 64, offset: 1088)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !325, file: !4, line: 147, baseType: !320, size: 64, align: 64, offset: 1152)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !325, file: !4, line: 148, baseType: !461, size: 8, align: 8, offset: 1216)
!461 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !317, file: !4, line: 82, baseType: !463, size: 64, align: 64, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!384, !466}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !317, file: !4, line: 83, baseType: !365, size: 64, align: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !317, file: !4, line: 84, baseType: !469, size: 128, align: 64, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !470, line: 31, baseType: !471)
!470 = !DIFile(filename: "timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !472, line: 30, size: 128, align: 64, elements: !473)
!472 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!473 = !{!474, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !471, file: !472, line: 32, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !411, line: 139, baseType: !412)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !471, file: !472, line: 33, baseType: !477, size: 64, align: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !411, line: 141, baseType: !412)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !317, file: !4, line: 92, baseType: !479, size: 64, align: 32, offset: 448)
!479 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !317, file: !4, line: 85, size: 64, align: 32, elements: !480)
!480 = !{!481, !482, !483}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !479, file: !4, line: 86, baseType: !384, size: 32, align: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !479, file: !4, line: 87, baseType: !384, size: 32, align: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !479, file: !4, line: 91, baseType: !484, size: 64, align: 32)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !479, file: !4, line: 88, size: 64, align: 32, elements: !485)
!485 = !{!486, !490}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !484, file: !4, line: 89, baseType: !487, size: 32, align: 32)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !488, line: 263, baseType: !489)
!488 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !411, line: 133, baseType: !384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !484, file: !4, line: 90, baseType: !384, size: 32, align: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !317, file: !4, line: 93, baseType: !492, size: 64, align: 64, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, scope: !317, file: !4, line: 95, baseType: !494, size: 192, align: 64, offset: 576)
!494 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !317, file: !4, line: 95, size: 192, align: 64, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !494, file: !4, line: 96, baseType: !452, size: 192, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !494, file: !4, line: 97, baseType: !343, size: 128, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!499 = !{!500, !502, !505, !508, !509, !510, !511, !515, !516, !517}
!500 = distinct !DIGlobalVariable(name: "script_security", scope: !0, file: !501, line: 57, type: !461, isLocal: false, isDefinition: true, variable: i8* @script_security)
!501 = !DIFile(filename: "notify.c", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!502 = distinct !DIGlobalVariable(name: "default_script_uid", scope: !0, file: !501, line: 48, type: !503, isLocal: false, isDefinition: true, variable: i32* @default_script_uid)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !488, line: 240, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !411, line: 125, baseType: !368)
!505 = distinct !DIGlobalVariable(name: "default_script_gid", scope: !0, file: !501, line: 49, type: !506, isLocal: false, isDefinition: true, variable: i32* @default_script_gid)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !488, line: 235, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !411, line: 126, baseType: !368)
!508 = distinct !DIGlobalVariable(name: "getpwnam_buf_len", scope: !0, file: !501, line: 60, type: !431, isLocal: true, isDefinition: true, variable: i64* @getpwnam_buf_len)
!509 = distinct !DIGlobalVariable(name: "path", scope: !0, file: !501, line: 62, type: !386, isLocal: true, isDefinition: true, variable: i8** @path)
!510 = distinct !DIGlobalVariable(name: "path_is_malloced", scope: !0, file: !501, line: 63, type: !461, isLocal: true, isDefinition: true, variable: i8* @path_is_malloced)
!511 = distinct !DIGlobalVariable(name: "cmd_str_buf", scope: !0, file: !501, line: 69, type: !512, isLocal: true, isDefinition: true, variable: [1024 x i8]* @cmd_str_buf)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 8192, align: 8, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 1024)
!515 = distinct !DIGlobalVariable(name: "cur_prio", scope: !0, file: !501, line: 66, type: !384, isLocal: true, isDefinition: true, variable: i32* @cur_prio)
!516 = distinct !DIGlobalVariable(name: "default_script_uid_set", scope: !0, file: !501, line: 52, type: !461, isLocal: true, isDefinition: true, variable: i8* @default_script_uid_set)
!517 = distinct !DIGlobalVariable(name: "default_user_fail", scope: !0, file: !501, line: 53, type: !461, isLocal: true, isDefinition: true, variable: i8* @default_user_fail)
!518 = !{i32 2, !"Dwarf Version", i32 4}
!519 = !{i32 2, !"Debug Info Version", i32 3}
!520 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!521 = distinct !DISubprogram(name: "cmd_str_r", scope: !501, file: !501, line: 117, type: !522, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !535)
!522 = !DISubroutineType(types: !523)
!523 = !{!386, !524, !386, !431}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !527, line: 65, baseType: !528)
!527 = !DIFile(filename: "notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !527, line: 59, size: 192, align: 64, elements: !529)
!529 = !{!530, !531, !532, !533, !534}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !528, file: !527, line: 60, baseType: !498, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !528, file: !527, line: 61, baseType: !384, size: 32, align: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !528, file: !527, line: 62, baseType: !384, size: 32, align: 32, offset: 96)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !528, file: !527, line: 63, baseType: !503, size: 32, align: 32, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !528, file: !527, line: 64, baseType: !506, size: 32, align: 32, offset: 160)
!535 = !{}
!536 = !DILocalVariable(name: "script", arg: 1, scope: !521, file: !501, line: 117, type: !524)
!537 = !DIExpression()
!538 = !DILocation(line: 117, column: 34, scope: !521)
!539 = !DILocalVariable(name: "buf", arg: 2, scope: !521, file: !501, line: 117, type: !386)
!540 = !DILocation(line: 117, column: 48, scope: !521)
!541 = !DILocalVariable(name: "len", arg: 3, scope: !521, file: !501, line: 117, type: !431)
!542 = !DILocation(line: 117, column: 60, scope: !521)
!543 = !DILocalVariable(name: "str_p", scope: !521, file: !501, line: 119, type: !386)
!544 = !DILocation(line: 119, column: 8, scope: !521)
!545 = !DILocalVariable(name: "i", scope: !521, file: !501, line: 120, type: !384)
!546 = !DILocation(line: 120, column: 6, scope: !521)
!547 = !DILocalVariable(name: "str_len", scope: !521, file: !501, line: 121, type: !431)
!548 = !DILocation(line: 121, column: 9, scope: !521)
!549 = !DILocation(line: 123, column: 10, scope: !521)
!550 = !DILocation(line: 123, column: 8, scope: !521)
!551 = !DILocation(line: 125, column: 9, scope: !552)
!552 = distinct !DILexicalBlock(scope: !521, file: !501, line: 125, column: 2)
!553 = !DILocation(line: 125, column: 7, scope: !552)
!554 = !DILocation(line: 125, column: 14, scope: !555)
!555 = !DILexicalBlockFile(scope: !556, file: !501, discriminator: 1)
!556 = distinct !DILexicalBlock(scope: !552, file: !501, line: 125, column: 2)
!557 = !DILocation(line: 125, column: 18, scope: !555)
!558 = !DILocation(line: 125, column: 26, scope: !555)
!559 = !DILocation(line: 125, column: 16, scope: !555)
!560 = !DILocation(line: 125, column: 2, scope: !555)
!561 = !DILocation(line: 127, column: 33, scope: !562)
!562 = distinct !DILexicalBlock(scope: !556, file: !501, line: 125, column: 41)
!563 = !DILocation(line: 127, column: 20, scope: !562)
!564 = !DILocation(line: 127, column: 28, scope: !562)
!565 = !DILocation(line: 127, column: 13, scope: !562)
!566 = !DILocation(line: 127, column: 11, scope: !562)
!567 = !DILocation(line: 128, column: 7, scope: !568)
!568 = distinct !DILexicalBlock(scope: !562, file: !501, line: 128, column: 7)
!569 = !DILocation(line: 128, column: 15, scope: !568)
!570 = !DILocation(line: 128, column: 13, scope: !568)
!571 = !DILocation(line: 128, column: 23, scope: !568)
!572 = !DILocation(line: 128, column: 30, scope: !568)
!573 = !DILocation(line: 128, column: 27, scope: !568)
!574 = !DILocation(line: 128, column: 44, scope: !568)
!575 = !DILocation(line: 128, column: 50, scope: !568)
!576 = !DILocation(line: 128, column: 48, scope: !568)
!577 = !DILocation(line: 128, column: 41, scope: !568)
!578 = !DILocation(line: 128, column: 7, scope: !562)
!579 = !DILocation(line: 129, column: 4, scope: !568)
!580 = !DILocation(line: 131, column: 7, scope: !581)
!581 = distinct !DILexicalBlock(scope: !562, file: !501, line: 131, column: 7)
!582 = !DILocation(line: 131, column: 7, scope: !562)
!583 = !DILocation(line: 132, column: 10, scope: !581)
!584 = !DILocation(line: 132, column: 13, scope: !581)
!585 = !DILocation(line: 132, column: 4, scope: !581)
!586 = !DILocation(line: 133, column: 9, scope: !562)
!587 = !DILocation(line: 133, column: 12, scope: !562)
!588 = !DILocation(line: 134, column: 10, scope: !562)
!589 = !DILocation(line: 134, column: 30, scope: !562)
!590 = !DILocation(line: 134, column: 17, scope: !562)
!591 = !DILocation(line: 134, column: 25, scope: !562)
!592 = !DILocation(line: 134, column: 3, scope: !562)
!593 = !DILocation(line: 135, column: 12, scope: !562)
!594 = !DILocation(line: 135, column: 9, scope: !562)
!595 = !DILocation(line: 136, column: 9, scope: !562)
!596 = !DILocation(line: 136, column: 12, scope: !562)
!597 = !DILocation(line: 137, column: 2, scope: !562)
!598 = !DILocation(line: 125, column: 37, scope: !599)
!599 = !DILexicalBlockFile(scope: !556, file: !501, discriminator: 2)
!600 = !DILocation(line: 125, column: 2, scope: !599)
!601 = distinct !{!601, !602}
!602 = !DILocation(line: 125, column: 2, scope: !521)
!603 = !DILocation(line: 138, column: 3, scope: !521)
!604 = !DILocation(line: 138, column: 9, scope: !521)
!605 = !DILocation(line: 140, column: 9, scope: !521)
!606 = !DILocation(line: 140, column: 2, scope: !521)
!607 = !DILocation(line: 141, column: 1, scope: !521)
!608 = distinct !DISubprogram(name: "cmd_str", scope: !501, file: !501, line: 144, type: !609, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !535)
!609 = !DISubroutineType(types: !610)
!610 = !{!386, !524}
!611 = !DILocalVariable(name: "script", arg: 1, scope: !608, file: !501, line: 144, type: !524)
!612 = !DILocation(line: 144, column: 32, scope: !608)
!613 = !DILocalVariable(name: "len", scope: !608, file: !501, line: 146, type: !431)
!614 = !DILocation(line: 146, column: 9, scope: !608)
!615 = !DILocalVariable(name: "i", scope: !608, file: !501, line: 147, type: !384)
!616 = !DILocation(line: 147, column: 6, scope: !608)
!617 = !DILocation(line: 149, column: 9, scope: !618)
!618 = distinct !DILexicalBlock(scope: !608, file: !501, line: 149, column: 2)
!619 = !DILocation(line: 149, column: 18, scope: !618)
!620 = !DILocation(line: 149, column: 7, scope: !618)
!621 = !DILocation(line: 149, column: 23, scope: !622)
!622 = !DILexicalBlockFile(scope: !623, file: !501, discriminator: 1)
!623 = distinct !DILexicalBlock(scope: !618, file: !501, line: 149, column: 2)
!624 = !DILocation(line: 149, column: 27, scope: !622)
!625 = !DILocation(line: 149, column: 35, scope: !622)
!626 = !DILocation(line: 149, column: 25, scope: !622)
!627 = !DILocation(line: 149, column: 2, scope: !622)
!628 = !DILocation(line: 150, column: 30, scope: !623)
!629 = !DILocation(line: 150, column: 17, scope: !623)
!630 = !DILocation(line: 150, column: 25, scope: !623)
!631 = !DILocation(line: 150, column: 10, scope: !623)
!632 = !DILocation(line: 150, column: 34, scope: !623)
!633 = !DILocation(line: 150, column: 7, scope: !623)
!634 = !DILocation(line: 150, column: 3, scope: !623)
!635 = !DILocation(line: 149, column: 46, scope: !636)
!636 = !DILexicalBlockFile(scope: !623, file: !501, discriminator: 2)
!637 = !DILocation(line: 149, column: 2, scope: !636)
!638 = distinct !{!638, !639}
!639 = !DILocation(line: 149, column: 2, scope: !608)
!640 = !DILocation(line: 152, column: 6, scope: !641)
!641 = distinct !DILexicalBlock(scope: !608, file: !501, line: 152, column: 6)
!642 = !DILocation(line: 152, column: 10, scope: !641)
!643 = !DILocation(line: 152, column: 6, scope: !608)
!644 = !DILocation(line: 153, column: 3, scope: !641)
!645 = !DILocation(line: 155, column: 19, scope: !608)
!646 = !DILocation(line: 155, column: 9, scope: !608)
!647 = !DILocation(line: 155, column: 2, scope: !608)
!648 = !DILocation(line: 156, column: 1, scope: !608)
!649 = distinct !DISubprogram(name: "notify_fifo_open", scope: !501, file: !501, line: 256, type: !650, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !535)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !652, !652, !661, !664}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_fifo_t", file: !527, line: 73, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_fifo", file: !527, line: 68, size: 192, align: 64, elements: !655)
!655 = !{!656, !657, !658, !659}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !654, file: !527, line: 69, baseType: !386, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !654, file: !527, line: 70, baseType: !384, size: 32, align: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "created_fifo", scope: !654, file: !527, line: 71, baseType: !461, size: 8, align: 8, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !654, file: !527, line: 72, baseType: !660, size: 64, align: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64, align: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!384, !315}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!666 = !DILocalVariable(name: "global_fifo", arg: 1, scope: !649, file: !501, line: 256, type: !652)
!667 = !DILocation(line: 256, column: 33, scope: !649)
!668 = !DILocalVariable(name: "fifo", arg: 2, scope: !649, file: !501, line: 256, type: !652)
!669 = !DILocation(line: 256, column: 61, scope: !649)
!670 = !DILocalVariable(name: "script_exit", arg: 3, scope: !649, file: !501, line: 256, type: !661)
!671 = !DILocation(line: 256, column: 73, scope: !649)
!672 = !DILocalVariable(name: "type", arg: 4, scope: !649, file: !501, line: 256, type: !664)
!673 = !DILocation(line: 256, column: 111, scope: !649)
!674 = !DILocation(line: 259, column: 6, scope: !675)
!675 = distinct !DILexicalBlock(scope: !649, file: !501, line: 259, column: 6)
!676 = !DILocation(line: 259, column: 19, scope: !675)
!677 = !DILocation(line: 259, column: 6, scope: !649)
!678 = !DILocation(line: 260, column: 13, scope: !675)
!679 = !DILocation(line: 260, column: 26, scope: !675)
!680 = !DILocation(line: 260, column: 3, scope: !675)
!681 = !DILocation(line: 263, column: 6, scope: !682)
!682 = distinct !DILexicalBlock(scope: !649, file: !501, line: 263, column: 6)
!683 = !DILocation(line: 263, column: 12, scope: !682)
!684 = !DILocation(line: 263, column: 6, scope: !649)
!685 = !DILocation(line: 264, column: 13, scope: !682)
!686 = !DILocation(line: 264, column: 19, scope: !682)
!687 = !DILocation(line: 264, column: 32, scope: !682)
!688 = !DILocation(line: 264, column: 3, scope: !682)
!689 = !DILocation(line: 265, column: 1, scope: !649)
!690 = distinct !DISubprogram(name: "fifo_open", scope: !501, file: !501, line: 216, type: !691, isLocal: true, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !535)
!691 = !DISubroutineType(types: !692)
!692 = !{null, !652, !661, !664}
!693 = !DILocalVariable(name: "fifo", arg: 1, scope: !690, file: !501, line: 216, type: !652)
!694 = !DILocation(line: 216, column: 26, scope: !690)
!695 = !DILocalVariable(name: "script_exit", arg: 2, scope: !690, file: !501, line: 216, type: !661)
!696 = !DILocation(line: 216, column: 38, scope: !690)
!697 = !DILocalVariable(name: "type", arg: 3, scope: !690, file: !501, line: 216, type: !664)
!698 = !DILocation(line: 216, column: 76, scope: !690)
!699 = !DILocalVariable(name: "ret", scope: !690, file: !501, line: 218, type: !384)
!700 = !DILocation(line: 218, column: 6, scope: !690)
!701 = !DILocalVariable(name: "sav_errno", scope: !690, file: !501, line: 219, type: !384)
!702 = !DILocation(line: 219, column: 6, scope: !690)
!703 = !DILocation(line: 221, column: 6, scope: !704)
!704 = distinct !DILexicalBlock(scope: !690, file: !501, line: 221, column: 6)
!705 = !DILocation(line: 221, column: 12, scope: !704)
!706 = !DILocation(line: 221, column: 6, scope: !690)
!707 = !DILocation(line: 222, column: 13, scope: !708)
!708 = distinct !DILexicalBlock(scope: !704, file: !501, line: 221, column: 18)
!709 = !DILocation(line: 224, column: 22, scope: !710)
!710 = distinct !DILexicalBlock(scope: !708, file: !501, line: 224, column: 7)
!711 = !DILocation(line: 224, column: 28, scope: !710)
!712 = !DILocation(line: 224, column: 15, scope: !710)
!713 = !DILocation(line: 224, column: 13, scope: !710)
!714 = !DILocation(line: 224, column: 7, scope: !708)
!715 = !DILocation(line: 225, column: 4, scope: !710)
!716 = !DILocation(line: 225, column: 10, scope: !710)
!717 = !DILocation(line: 225, column: 23, scope: !710)
!718 = !DILocation(line: 227, column: 17, scope: !719)
!719 = distinct !DILexicalBlock(scope: !710, file: !501, line: 226, column: 8)
!720 = !DILocation(line: 227, column: 16, scope: !719)
!721 = !DILocation(line: 227, column: 14, scope: !719)
!722 = !DILocation(line: 229, column: 8, scope: !723)
!723 = distinct !DILexicalBlock(scope: !719, file: !501, line: 229, column: 8)
!724 = !DILocation(line: 229, column: 18, scope: !723)
!725 = !DILocation(line: 229, column: 8, scope: !719)
!726 = !DILocation(line: 230, column: 63, scope: !723)
!727 = !DILocation(line: 230, column: 69, scope: !723)
!728 = !DILocation(line: 230, column: 75, scope: !723)
!729 = !DILocation(line: 230, column: 5, scope: !723)
!730 = !DILocation(line: 233, column: 8, scope: !731)
!731 = distinct !DILexicalBlock(scope: !708, file: !501, line: 233, column: 7)
!732 = !DILocation(line: 233, column: 18, scope: !731)
!733 = !DILocation(line: 233, column: 21, scope: !734)
!734 = !DILexicalBlockFile(scope: !731, file: !501, discriminator: 1)
!735 = !DILocation(line: 233, column: 31, scope: !734)
!736 = !DILocation(line: 233, column: 7, scope: !734)
!737 = !DILocation(line: 235, column: 8, scope: !738)
!738 = distinct !DILexicalBlock(scope: !739, file: !501, line: 235, column: 8)
!739 = distinct !DILexicalBlock(scope: !731, file: !501, line: 233, column: 41)
!740 = !DILocation(line: 235, column: 14, scope: !738)
!741 = !DILocation(line: 235, column: 8, scope: !739)
!742 = !DILocation(line: 236, column: 22, scope: !738)
!743 = !DILocation(line: 236, column: 30, scope: !738)
!744 = !DILocation(line: 236, column: 43, scope: !738)
!745 = !DILocation(line: 236, column: 49, scope: !738)
!746 = !DILocation(line: 236, column: 55, scope: !738)
!747 = !DILocation(line: 236, column: 5, scope: !738)
!748 = !DILocation(line: 239, column: 25, scope: !749)
!749 = distinct !DILexicalBlock(scope: !739, file: !501, line: 239, column: 8)
!750 = !DILocation(line: 239, column: 31, scope: !749)
!751 = !DILocation(line: 239, column: 20, scope: !749)
!752 = !DILocation(line: 239, column: 9, scope: !749)
!753 = !DILocation(line: 239, column: 15, scope: !749)
!754 = !DILocation(line: 239, column: 18, scope: !749)
!755 = !DILocation(line: 239, column: 70, scope: !749)
!756 = !DILocation(line: 239, column: 8, scope: !739)
!757 = !DILocation(line: 240, column: 72, scope: !758)
!758 = distinct !DILexicalBlock(scope: !749, file: !501, line: 239, column: 77)
!759 = !DILocation(line: 240, column: 78, scope: !758)
!760 = !DILocation(line: 240, column: 84, scope: !758)
!761 = !DILocation(line: 240, column: 92, scope: !758)
!762 = !DILocation(line: 240, column: 91, scope: !758)
!763 = !DILocation(line: 240, column: 5, scope: !764)
!764 = !DILexicalBlockFile(scope: !758, file: !501, discriminator: 1)
!765 = !DILocation(line: 241, column: 9, scope: !766)
!766 = distinct !DILexicalBlock(scope: !758, file: !501, line: 241, column: 9)
!767 = !DILocation(line: 241, column: 15, scope: !766)
!768 = !DILocation(line: 241, column: 9, scope: !758)
!769 = !DILocation(line: 242, column: 13, scope: !770)
!770 = distinct !DILexicalBlock(scope: !766, file: !501, line: 241, column: 29)
!771 = !DILocation(line: 242, column: 19, scope: !770)
!772 = !DILocation(line: 242, column: 6, scope: !770)
!773 = !DILocation(line: 243, column: 6, scope: !770)
!774 = !DILocation(line: 243, column: 12, scope: !770)
!775 = !DILocation(line: 243, column: 25, scope: !770)
!776 = !DILocation(line: 244, column: 5, scope: !770)
!777 = !DILocation(line: 245, column: 4, scope: !758)
!778 = !DILocation(line: 246, column: 3, scope: !739)
!779 = !DILocation(line: 248, column: 7, scope: !780)
!780 = distinct !DILexicalBlock(scope: !708, file: !501, line: 248, column: 7)
!781 = !DILocation(line: 248, column: 13, scope: !780)
!782 = !DILocation(line: 248, column: 16, scope: !780)
!783 = !DILocation(line: 248, column: 7, scope: !708)
!784 = !DILocation(line: 249, column: 10, scope: !785)
!785 = distinct !DILexicalBlock(scope: !780, file: !501, line: 248, column: 23)
!786 = !DILocation(line: 249, column: 16, scope: !785)
!787 = !DILocation(line: 249, column: 5, scope: !785)
!788 = !DILocation(line: 249, column: 24, scope: !785)
!789 = !DILocation(line: 249, column: 30, scope: !785)
!790 = !DILocation(line: 249, column: 36, scope: !785)
!791 = !DILocation(line: 250, column: 4, scope: !785)
!792 = !DILocation(line: 250, column: 10, scope: !785)
!793 = !DILocation(line: 250, column: 15, scope: !785)
!794 = !DILocation(line: 251, column: 3, scope: !785)
!795 = !DILocation(line: 252, column: 2, scope: !708)
!796 = !DILocation(line: 253, column: 1, scope: !690)
!797 = distinct !DISubprogram(name: "notify_fifo_close", scope: !501, file: !501, line: 279, type: !798, isLocal: false, isDefinition: true, scopeLine: 280, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !535)
!798 = !DISubroutineType(types: !799)
!799 = !{null, !652, !652}
!800 = !DILocalVariable(name: "global_fifo", arg: 1, scope: !797, file: !501, line: 279, type: !652)
!801 = !DILocation(line: 279, column: 34, scope: !797)
!802 = !DILocalVariable(name: "fifo", arg: 2, scope: !797, file: !501, line: 279, type: !652)
!803 = !DILocation(line: 279, column: 62, scope: !797)
!804 = !DILocation(line: 281, column: 6, scope: !805)
!805 = distinct !DILexicalBlock(scope: !797, file: !501, line: 281, column: 6)
!806 = !DILocation(line: 281, column: 19, scope: !805)
!807 = !DILocation(line: 281, column: 22, scope: !805)
!808 = !DILocation(line: 281, column: 6, scope: !797)
!809 = !DILocation(line: 282, column: 14, scope: !805)
!810 = !DILocation(line: 282, column: 3, scope: !805)
!811 = !DILocation(line: 284, column: 13, scope: !797)
!812 = !DILocation(line: 284, column: 2, scope: !797)
!813 = !DILocation(line: 285, column: 1, scope: !797)
!814 = distinct !DISubprogram(name: "fifo_close", scope: !501, file: !501, line: 268, type: !815, isLocal: true, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !535)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !652}
!817 = !DILocalVariable(name: "fifo", arg: 1, scope: !814, file: !501, line: 268, type: !652)
!818 = !DILocation(line: 268, column: 27, scope: !814)
!819 = !DILocation(line: 270, column: 6, scope: !820)
!820 = distinct !DILexicalBlock(scope: !814, file: !501, line: 270, column: 6)
!821 = !DILocation(line: 270, column: 12, scope: !820)
!822 = !DILocation(line: 270, column: 15, scope: !820)
!823 = !DILocation(line: 270, column: 6, scope: !814)
!824 = !DILocation(line: 271, column: 9, scope: !825)
!825 = distinct !DILexicalBlock(scope: !820, file: !501, line: 270, column: 22)
!826 = !DILocation(line: 271, column: 15, scope: !825)
!827 = !DILocation(line: 271, column: 3, scope: !825)
!828 = !DILocation(line: 272, column: 3, scope: !825)
!829 = !DILocation(line: 272, column: 9, scope: !825)
!830 = !DILocation(line: 272, column: 12, scope: !825)
!831 = !DILocation(line: 273, column: 2, scope: !825)
!832 = !DILocation(line: 274, column: 6, scope: !833)
!833 = distinct !DILexicalBlock(scope: !814, file: !501, line: 274, column: 6)
!834 = !DILocation(line: 274, column: 12, scope: !833)
!835 = !DILocation(line: 274, column: 6, scope: !814)
!836 = !DILocation(line: 275, column: 10, scope: !833)
!837 = !DILocation(line: 275, column: 16, scope: !833)
!838 = !DILocation(line: 275, column: 3, scope: !833)
!839 = !DILocation(line: 276, column: 1, scope: !814)
!840 = distinct !DISubprogram(name: "notify_exec", scope: !501, file: !501, line: 347, type: !841, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !535)
!841 = !DISubroutineType(types: !842)
!842 = !{!384, !524}
!843 = !DILocalVariable(name: "script", arg: 1, scope: !840, file: !501, line: 347, type: !524)
!844 = !DILocation(line: 347, column: 36, scope: !840)
!845 = !DILocalVariable(name: "pid", scope: !840, file: !501, line: 349, type: !487)
!846 = !DILocation(line: 349, column: 8, scope: !840)
!847 = !DILocation(line: 351, column: 6, scope: !848)
!848 = distinct !DILexicalBlock(scope: !840, file: !501, line: 351, column: 6)
!849 = !DILocation(line: 351, column: 6, scope: !840)
!850 = !DILocation(line: 352, column: 3, scope: !848)
!851 = !DILocation(line: 354, column: 8, scope: !840)
!852 = !DILocation(line: 354, column: 6, scope: !840)
!853 = !DILocation(line: 356, column: 6, scope: !854)
!854 = distinct !DILexicalBlock(scope: !840, file: !501, line: 356, column: 6)
!855 = !DILocation(line: 356, column: 10, scope: !854)
!856 = !DILocation(line: 356, column: 6, scope: !840)
!857 = !DILocation(line: 358, column: 3, scope: !858)
!858 = distinct !DILexicalBlock(scope: !854, file: !501, line: 356, column: 15)
!859 = !DILocation(line: 359, column: 3, scope: !858)
!860 = !DILocation(line: 362, column: 6, scope: !861)
!861 = distinct !DILexicalBlock(scope: !840, file: !501, line: 362, column: 6)
!862 = !DILocation(line: 362, column: 6, scope: !840)
!863 = !DILocation(line: 364, column: 3, scope: !864)
!864 = distinct !DILexicalBlock(scope: !861, file: !501, line: 362, column: 11)
!865 = !DILocation(line: 371, column: 14, scope: !840)
!866 = !DILocation(line: 371, column: 2, scope: !840)
!867 = !DILocation(line: 375, column: 1, scope: !840)
!868 = distinct !DISubprogram(name: "system_call", scope: !501, file: !501, line: 291, type: !869, isLocal: true, isDefinition: true, scopeLine: 292, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !535)
!869 = !DISubroutineType(types: !870)
!870 = !{null, !524}
!871 = !DILocalVariable(name: "script", arg: 1, scope: !868, file: !501, line: 291, type: !524)
!872 = !DILocation(line: 291, column: 36, scope: !868)
!873 = !DILocalVariable(name: "command_line", scope: !868, file: !501, line: 293, type: !386)
!874 = !DILocation(line: 293, column: 8, scope: !868)
!875 = !DILocalVariable(name: "str", scope: !868, file: !501, line: 294, type: !386)
!876 = !DILocation(line: 294, column: 8, scope: !868)
!877 = !DILocalVariable(name: "retval", scope: !868, file: !501, line: 295, type: !384)
!878 = !DILocation(line: 295, column: 6, scope: !868)
!879 = !DILocation(line: 297, column: 21, scope: !880)
!880 = distinct !DILexicalBlock(scope: !868, file: !501, line: 297, column: 6)
!881 = !DILocation(line: 297, column: 29, scope: !880)
!882 = !DILocation(line: 297, column: 34, scope: !880)
!883 = !DILocation(line: 297, column: 42, scope: !880)
!884 = !DILocation(line: 297, column: 6, scope: !880)
!885 = !DILocation(line: 297, column: 6, scope: !868)
!886 = !DILocation(line: 298, column: 3, scope: !880)
!887 = !DILocation(line: 302, column: 2, scope: !868)
!888 = !DILocation(line: 304, column: 6, scope: !889)
!889 = distinct !DILexicalBlock(scope: !868, file: !501, line: 304, column: 6)
!890 = !DILocation(line: 304, column: 14, scope: !889)
!891 = !DILocation(line: 304, column: 20, scope: !889)
!892 = !DILocation(line: 304, column: 6, scope: !868)
!893 = !DILocation(line: 306, column: 3, scope: !894)
!894 = distinct !DILexicalBlock(scope: !889, file: !501, line: 304, column: 28)
!895 = !DILocation(line: 308, column: 10, scope: !894)
!896 = !DILocation(line: 308, column: 18, scope: !894)
!897 = !DILocation(line: 308, column: 27, scope: !894)
!898 = !DILocation(line: 308, column: 35, scope: !894)
!899 = !DILocation(line: 308, column: 41, scope: !894)
!900 = !DILocation(line: 308, column: 3, scope: !894)
!901 = !DILocation(line: 311, column: 70, scope: !894)
!902 = !DILocation(line: 311, column: 78, scope: !894)
!903 = !DILocation(line: 311, column: 89, scope: !894)
!904 = !DILocation(line: 311, column: 88, scope: !894)
!905 = !DILocation(line: 311, column: 3, scope: !906)
!906 = !DILexicalBlockFile(scope: !894, file: !501, discriminator: 1)
!907 = !DILocation(line: 312, column: 2, scope: !894)
!908 = !DILocation(line: 314, column: 33, scope: !909)
!909 = distinct !DILexicalBlock(scope: !889, file: !501, line: 313, column: 7)
!910 = !DILocation(line: 314, column: 25, scope: !909)
!911 = !DILocation(line: 314, column: 23, scope: !909)
!912 = !DILocation(line: 314, column: 12, scope: !913)
!913 = !DILexicalBlockFile(scope: !909, file: !501, discriminator: 1)
!914 = !DILocation(line: 314, column: 10, scope: !909)
!915 = !DILocation(line: 316, column: 7, scope: !916)
!916 = distinct !DILexicalBlock(scope: !909, file: !501, line: 316, column: 7)
!917 = !DILocation(line: 316, column: 14, scope: !916)
!918 = !DILocation(line: 316, column: 7, scope: !909)
!919 = !DILocation(line: 317, column: 56, scope: !916)
!920 = !DILocation(line: 317, column: 4, scope: !916)
!921 = !DILocation(line: 318, column: 31, scope: !922)
!922 = distinct !DILexicalBlock(scope: !916, file: !501, line: 318, column: 11)
!923 = !DILocation(line: 318, column: 11, scope: !922)
!924 = !DILocation(line: 318, column: 16, scope: !922)
!925 = !DILocation(line: 318, column: 23, scope: !922)
!926 = !DILocation(line: 318, column: 11, scope: !916)
!927 = !DILocation(line: 319, column: 27, scope: !928)
!928 = distinct !DILexicalBlock(scope: !929, file: !501, line: 319, column: 7)
!929 = distinct !DILexicalBlock(scope: !922, file: !501, line: 318, column: 30)
!930 = !DILocation(line: 319, column: 7, scope: !928)
!931 = !DILocation(line: 319, column: 12, scope: !928)
!932 = !DILocation(line: 319, column: 19, scope: !928)
!933 = !DILocation(line: 319, column: 29, scope: !928)
!934 = !DILocation(line: 319, column: 7, scope: !929)
!935 = !DILocation(line: 321, column: 56, scope: !936)
!936 = distinct !DILexicalBlock(scope: !928, file: !501, line: 319, column: 35)
!937 = !DILocation(line: 321, column: 5, scope: !936)
!938 = !DILocation(line: 322, column: 4, scope: !936)
!939 = !DILocation(line: 323, column: 32, scope: !940)
!940 = distinct !DILexicalBlock(scope: !928, file: !501, line: 323, column: 12)
!941 = !DILocation(line: 323, column: 12, scope: !940)
!942 = !DILocation(line: 323, column: 17, scope: !940)
!943 = !DILocation(line: 323, column: 24, scope: !940)
!944 = !DILocation(line: 323, column: 34, scope: !940)
!945 = !DILocation(line: 323, column: 12, scope: !928)
!946 = !DILocation(line: 325, column: 59, scope: !947)
!947 = distinct !DILexicalBlock(scope: !940, file: !501, line: 323, column: 40)
!948 = !DILocation(line: 325, column: 5, scope: !947)
!949 = !DILocation(line: 326, column: 4, scope: !947)
!950 = !DILocation(line: 327, column: 3, scope: !929)
!951 = !DILocation(line: 329, column: 7, scope: !952)
!952 = distinct !DILexicalBlock(scope: !909, file: !501, line: 329, column: 7)
!953 = !DILocation(line: 329, column: 7, scope: !909)
!954 = !DILocation(line: 330, column: 10, scope: !952)
!955 = !DILocation(line: 330, column: 5, scope: !952)
!956 = !DILocation(line: 330, column: 40, scope: !952)
!957 = !DILocation(line: 330, column: 4, scope: !952)
!958 = !DILocation(line: 332, column: 7, scope: !959)
!959 = distinct !DILexicalBlock(scope: !909, file: !501, line: 332, column: 7)
!960 = !DILocation(line: 332, column: 14, scope: !959)
!961 = !DILocation(line: 332, column: 20, scope: !959)
!962 = !DILocation(line: 333, column: 27, scope: !959)
!963 = !DILocation(line: 333, column: 7, scope: !959)
!964 = !DILocation(line: 333, column: 12, scope: !959)
!965 = !DILocation(line: 333, column: 19, scope: !959)
!966 = !DILocation(line: 333, column: 25, scope: !959)
!967 = !DILocation(line: 333, column: 49, scope: !968)
!968 = !DILexicalBlockFile(scope: !959, file: !501, discriminator: 1)
!969 = !DILocation(line: 333, column: 29, scope: !968)
!970 = !DILocation(line: 333, column: 34, scope: !968)
!971 = !DILocation(line: 333, column: 41, scope: !968)
!972 = !DILocation(line: 333, column: 51, scope: !968)
!973 = !DILocation(line: 333, column: 56, scope: !968)
!974 = !DILocation(line: 333, column: 79, scope: !975)
!975 = !DILexicalBlockFile(scope: !959, file: !501, discriminator: 2)
!976 = !DILocation(line: 333, column: 59, scope: !975)
!977 = !DILocation(line: 333, column: 64, scope: !975)
!978 = !DILocation(line: 333, column: 71, scope: !975)
!979 = !DILocation(line: 333, column: 81, scope: !975)
!980 = !DILocation(line: 332, column: 7, scope: !913)
!981 = !DILocation(line: 334, column: 4, scope: !959)
!982 = !DILocation(line: 335, column: 26, scope: !983)
!983 = distinct !DILexicalBlock(scope: !909, file: !501, line: 335, column: 6)
!984 = !DILocation(line: 335, column: 6, scope: !983)
!985 = !DILocation(line: 335, column: 11, scope: !983)
!986 = !DILocation(line: 335, column: 18, scope: !983)
!987 = !DILocation(line: 335, column: 6, scope: !909)
!988 = !DILocation(line: 336, column: 28, scope: !983)
!989 = !DILocation(line: 336, column: 8, scope: !983)
!990 = !DILocation(line: 336, column: 13, scope: !983)
!991 = !DILocation(line: 336, column: 20, scope: !983)
!992 = !DILocation(line: 336, column: 30, scope: !983)
!993 = !DILocation(line: 336, column: 4, scope: !983)
!994 = !DILocation(line: 337, column: 26, scope: !995)
!995 = distinct !DILexicalBlock(scope: !909, file: !501, line: 337, column: 6)
!996 = !DILocation(line: 337, column: 6, scope: !995)
!997 = !DILocation(line: 337, column: 11, scope: !995)
!998 = !DILocation(line: 337, column: 18, scope: !995)
!999 = !DILocation(line: 337, column: 8, scope: !995)
!1000 = !DILocation(line: 337, column: 31, scope: !995)
!1001 = !DILocation(line: 337, column: 37, scope: !995)
!1002 = !DILocation(line: 337, column: 6, scope: !909)
!1003 = !DILocation(line: 338, column: 9, scope: !995)
!1004 = !DILocation(line: 338, column: 38, scope: !995)
!1005 = !DILocation(line: 338, column: 18, scope: !995)
!1006 = !DILocation(line: 338, column: 23, scope: !995)
!1007 = !DILocation(line: 338, column: 30, scope: !995)
!1008 = !DILocation(line: 338, column: 4, scope: !1009)
!1009 = !DILexicalBlockFile(scope: !995, file: !501, discriminator: 1)
!1010 = !DILocation(line: 338, column: 4, scope: !995)
!1011 = !DILocation(line: 339, column: 3, scope: !909)
!1012 = !DILocation(line: 342, column: 2, scope: !868)
!1013 = !DILocation(line: 343, column: 1, scope: !868)
!1014 = distinct !DISubprogram(name: "system_call_script", scope: !501, file: !501, line: 378, type: !1015, isLocal: false, isDefinition: true, scopeLine: 379, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !535)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!384, !1017, !661, !365, !320, !660}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_master_t", file: !4, line: 149, baseType: !325)
!1019 = !DILocalVariable(name: "m", arg: 1, scope: !1014, file: !501, line: 378, type: !1017)
!1020 = !DILocation(line: 378, column: 37, scope: !1014)
!1021 = !DILocalVariable(name: "func", arg: 2, scope: !1014, file: !501, line: 378, type: !661)
!1022 = !DILocation(line: 378, column: 46, scope: !1014)
!1023 = !DILocalVariable(name: "arg", arg: 3, scope: !1014, file: !501, line: 378, type: !365)
!1024 = !DILocation(line: 378, column: 73, scope: !1014)
!1025 = !DILocalVariable(name: "timer", arg: 4, scope: !1014, file: !501, line: 378, type: !320)
!1026 = !DILocation(line: 378, column: 92, scope: !1014)
!1027 = !DILocalVariable(name: "script", arg: 5, scope: !1014, file: !501, line: 378, type: !660)
!1028 = !DILocation(line: 378, column: 116, scope: !1014)
!1029 = !DILocalVariable(name: "pid", scope: !1014, file: !501, line: 380, type: !487)
!1030 = !DILocation(line: 380, column: 8, scope: !1014)
!1031 = !DILocation(line: 383, column: 6, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1014, file: !501, line: 383, column: 6)
!1033 = !DILocation(line: 383, column: 6, scope: !1014)
!1034 = !DILocation(line: 384, column: 3, scope: !1032)
!1035 = !DILocation(line: 386, column: 8, scope: !1014)
!1036 = !DILocation(line: 386, column: 6, scope: !1014)
!1037 = !DILocation(line: 388, column: 6, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1014, file: !501, line: 388, column: 6)
!1039 = !DILocation(line: 388, column: 10, scope: !1038)
!1040 = !DILocation(line: 388, column: 6, scope: !1014)
!1041 = !DILocation(line: 390, column: 3, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1038, file: !501, line: 388, column: 15)
!1043 = !DILocation(line: 391, column: 3, scope: !1042)
!1044 = !DILocation(line: 394, column: 6, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1014, file: !501, line: 394, column: 6)
!1046 = !DILocation(line: 394, column: 6, scope: !1014)
!1047 = !DILocation(line: 396, column: 20, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1045, file: !501, line: 394, column: 11)
!1049 = !DILocation(line: 396, column: 23, scope: !1048)
!1050 = !DILocation(line: 396, column: 29, scope: !1048)
!1051 = !DILocation(line: 396, column: 34, scope: !1048)
!1052 = !DILocation(line: 396, column: 39, scope: !1048)
!1053 = !DILocation(line: 396, column: 3, scope: !1048)
!1054 = !DILocation(line: 397, column: 3, scope: !1048)
!1055 = !DILocation(line: 405, column: 14, scope: !1014)
!1056 = !DILocation(line: 405, column: 2, scope: !1014)
!1057 = !DILocation(line: 408, column: 1, scope: !1014)
!1058 = distinct !DISubprogram(name: "child_killed_thread", scope: !501, file: !501, line: 411, type: !662, isLocal: false, isDefinition: true, scopeLine: 412, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !535)
!1059 = !DILocalVariable(name: "thread", arg: 1, scope: !1058, file: !501, line: 411, type: !315)
!1060 = !DILocation(line: 411, column: 31, scope: !1058)
!1061 = !DILocalVariable(name: "m", scope: !1058, file: !501, line: 413, type: !1017)
!1062 = !DILocation(line: 413, column: 19, scope: !1058)
!1063 = !DILocation(line: 413, column: 23, scope: !1058)
!1064 = !DILocation(line: 413, column: 31, scope: !1058)
!1065 = !DILocation(line: 416, column: 6, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1058, file: !501, line: 416, column: 6)
!1067 = !DILocation(line: 416, column: 14, scope: !1066)
!1068 = !DILocation(line: 416, column: 19, scope: !1066)
!1069 = !DILocation(line: 416, column: 6, scope: !1058)
!1070 = !DILocation(line: 417, column: 17, scope: !1066)
!1071 = !DILocation(line: 417, column: 25, scope: !1066)
!1072 = !DILocation(line: 417, column: 27, scope: !1066)
!1073 = !DILocation(line: 417, column: 29, scope: !1066)
!1074 = !DILocation(line: 417, column: 9, scope: !1066)
!1075 = !DILocation(line: 417, column: 8, scope: !1066)
!1076 = !DILocation(line: 417, column: 3, scope: !1077)
!1077 = !DILexicalBlockFile(scope: !1066, file: !501, discriminator: 1)
!1078 = !DILocation(line: 417, column: 3, scope: !1066)
!1079 = !DILocation(line: 421, column: 8, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1058, file: !501, line: 421, column: 6)
!1081 = !DILocation(line: 421, column: 11, scope: !1080)
!1082 = !DILocation(line: 421, column: 17, scope: !1080)
!1083 = !DILocation(line: 421, column: 7, scope: !1080)
!1084 = !DILocation(line: 421, column: 25, scope: !1080)
!1085 = !DILocation(line: 421, column: 29, scope: !1086)
!1086 = !DILexicalBlockFile(scope: !1080, file: !501, discriminator: 1)
!1087 = !DILocation(line: 421, column: 32, scope: !1086)
!1088 = !DILocation(line: 421, column: 6, scope: !1086)
!1089 = !DILocation(line: 422, column: 30, scope: !1080)
!1090 = !DILocation(line: 422, column: 3, scope: !1080)
!1091 = !DILocation(line: 424, column: 2, scope: !1058)
!1092 = distinct !DISubprogram(name: "script_killall", scope: !501, file: !501, line: 428, type: !1093, isLocal: false, isDefinition: true, scopeLine: 429, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !535)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{null, !1017, !384, !461}
!1095 = !DILocalVariable(name: "m", arg: 1, scope: !1092, file: !501, line: 428, type: !1017)
!1096 = !DILocation(line: 428, column: 33, scope: !1092)
!1097 = !DILocalVariable(name: "signo", arg: 2, scope: !1092, file: !501, line: 428, type: !384)
!1098 = !DILocation(line: 428, column: 40, scope: !1092)
!1099 = !DILocalVariable(name: "requeue", arg: 3, scope: !1092, file: !501, line: 428, type: !461)
!1100 = !DILocation(line: 428, column: 51, scope: !1092)
!1101 = !DILocalVariable(name: "thread", scope: !1092, file: !501, line: 430, type: !315)
!1102 = !DILocation(line: 430, column: 12, scope: !1092)
!1103 = !DILocalVariable(name: "p_pgid", scope: !1092, file: !501, line: 431, type: !487)
!1104 = !DILocation(line: 431, column: 8, scope: !1092)
!1105 = !DILocalVariable(name: "c_pgid", scope: !1092, file: !501, line: 431, type: !487)
!1106 = !DILocation(line: 431, column: 16, scope: !1092)
!1107 = !DILocation(line: 443, column: 11, scope: !1092)
!1108 = !DILocation(line: 443, column: 9, scope: !1092)
!1109 = !DILocation(line: 445, column: 27, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1092, file: !501, line: 445, column: 2)
!1111 = !DILocation(line: 445, column: 30, scope: !1110)
!1112 = !DILocation(line: 445, column: 17, scope: !1110)
!1113 = !DILocation(line: 445, column: 16, scope: !1110)
!1114 = !DILocalVariable(name: "__mptr", scope: !1115, file: !501, line: 445, type: !1116)
!1115 = distinct !DILexicalBlock(scope: !1110, file: !501, line: 445, column: 41)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!1118 = !DILocation(line: 445, column: 86, scope: !1115)
!1119 = !DILocation(line: 445, column: 106, scope: !1120)
!1120 = !DILexicalBlockFile(scope: !1115, file: !501, discriminator: 1)
!1121 = !DILocation(line: 445, column: 109, scope: !1120)
!1122 = !DILocation(line: 445, column: 96, scope: !1120)
!1123 = !DILocation(line: 445, column: 86, scope: !1120)
!1124 = !DILocation(line: 445, column: 147, scope: !1120)
!1125 = !DILocation(line: 445, column: 139, scope: !1120)
!1126 = !DILocation(line: 445, column: 154, scope: !1120)
!1127 = !DILocation(line: 445, column: 118, scope: !1120)
!1128 = !DILocation(line: 445, column: 43, scope: !1120)
!1129 = !DILocation(line: 445, column: 3, scope: !1120)
!1130 = !DILocation(line: 445, column: 16, scope: !1120)
!1131 = !DILocation(line: 445, column: 16, scope: !1132)
!1132 = !DILexicalBlockFile(scope: !1110, file: !501, discriminator: 2)
!1133 = !DILocation(line: 445, column: 16, scope: !1134)
!1134 = !DILexicalBlockFile(scope: !1110, file: !501, discriminator: 3)
!1135 = !DILocation(line: 445, column: 14, scope: !1134)
!1136 = !DILocation(line: 445, column: 7, scope: !1134)
!1137 = !DILocation(line: 445, column: 3, scope: !1138)
!1138 = !DILexicalBlockFile(scope: !1139, file: !501, discriminator: 4)
!1139 = distinct !DILexicalBlock(scope: !1110, file: !501, line: 445, column: 2)
!1140 = !DILocation(line: 445, column: 2, scope: !1138)
!1141 = !DILocation(line: 446, column: 20, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1139, file: !501, line: 445, column: 3)
!1143 = !DILocation(line: 446, column: 28, scope: !1142)
!1144 = !DILocation(line: 446, column: 30, scope: !1142)
!1145 = !DILocation(line: 446, column: 32, scope: !1142)
!1146 = !DILocation(line: 446, column: 12, scope: !1142)
!1147 = !DILocation(line: 446, column: 10, scope: !1142)
!1148 = !DILocation(line: 447, column: 7, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1142, file: !501, line: 447, column: 7)
!1150 = !DILocation(line: 447, column: 17, scope: !1149)
!1151 = !DILocation(line: 447, column: 14, scope: !1149)
!1152 = !DILocation(line: 447, column: 7, scope: !1142)
!1153 = !DILocation(line: 448, column: 10, scope: !1149)
!1154 = !DILocation(line: 448, column: 9, scope: !1149)
!1155 = !DILocation(line: 448, column: 18, scope: !1149)
!1156 = !DILocation(line: 448, column: 4, scope: !1149)
!1157 = !DILocation(line: 450, column: 69, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1149, file: !501, line: 449, column: 8)
!1159 = !DILocation(line: 450, column: 77, scope: !1158)
!1160 = !DILocation(line: 450, column: 4, scope: !1158)
!1161 = !DILocation(line: 451, column: 9, scope: !1158)
!1162 = !DILocation(line: 451, column: 17, scope: !1158)
!1163 = !DILocation(line: 451, column: 19, scope: !1158)
!1164 = !DILocation(line: 451, column: 21, scope: !1158)
!1165 = !DILocation(line: 451, column: 26, scope: !1158)
!1166 = !DILocation(line: 451, column: 4, scope: !1158)
!1167 = !DILocation(line: 453, column: 2, scope: !1142)
!1168 = !DILocation(line: 445, column: 30, scope: !1169)
!1169 = !DILexicalBlockFile(scope: !1139, file: !501, discriminator: 5)
!1170 = !DILocation(line: 445, column: 38, scope: !1169)
!1171 = !DILocation(line: 445, column: 21, scope: !1169)
!1172 = !DILocation(line: 445, column: 20, scope: !1169)
!1173 = !DILocalVariable(name: "__mptr", scope: !1174, file: !501, line: 445, type: !1116)
!1174 = distinct !DILexicalBlock(scope: !1139, file: !501, line: 445, column: 45)
!1175 = !DILocation(line: 445, column: 90, scope: !1174)
!1176 = !DILocation(line: 445, column: 109, scope: !1177)
!1177 = !DILexicalBlockFile(scope: !1174, file: !501, discriminator: 6)
!1178 = !DILocation(line: 445, column: 117, scope: !1177)
!1179 = !DILocation(line: 445, column: 100, scope: !1177)
!1180 = !DILocation(line: 445, column: 90, scope: !1177)
!1181 = !DILocation(line: 445, column: 151, scope: !1177)
!1182 = !DILocation(line: 445, column: 143, scope: !1177)
!1183 = !DILocation(line: 445, column: 158, scope: !1177)
!1184 = !DILocation(line: 445, column: 122, scope: !1177)
!1185 = !DILocation(line: 445, column: 47, scope: !1177)
!1186 = !DILocation(line: 445, column: 3, scope: !1177)
!1187 = !DILocation(line: 445, column: 20, scope: !1177)
!1188 = !DILocation(line: 445, column: 20, scope: !1189)
!1189 = !DILexicalBlockFile(scope: !1139, file: !501, discriminator: 7)
!1190 = !DILocation(line: 445, column: 20, scope: !1191)
!1191 = !DILexicalBlockFile(scope: !1139, file: !501, discriminator: 8)
!1192 = !DILocation(line: 445, column: 18, scope: !1191)
!1193 = !DILocation(line: 445, column: 2, scope: !1191)
!1194 = distinct !{!1194, !1195}
!1195 = !DILocation(line: 445, column: 2, scope: !1092)
!1196 = !DILocation(line: 456, column: 6, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1092, file: !501, line: 456, column: 6)
!1198 = !DILocation(line: 456, column: 14, scope: !1197)
!1199 = !DILocation(line: 456, column: 17, scope: !1200)
!1200 = !DILexicalBlockFile(scope: !1197, file: !501, discriminator: 1)
!1201 = !DILocation(line: 456, column: 23, scope: !1200)
!1202 = !DILocation(line: 456, column: 6, scope: !1200)
!1203 = !DILocation(line: 457, column: 30, scope: !1197)
!1204 = !DILocation(line: 457, column: 3, scope: !1197)
!1205 = !DILocation(line: 463, column: 1, scope: !1092)
!1206 = distinct !DISubprogram(name: "check_script_secure", scope: !501, file: !501, line: 765, type: !1207, isLocal: false, isDefinition: true, scopeLine: 770, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !535)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!384, !660, !1209}
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "magic_t", file: !1210, line: 90, baseType: !1211)
!1210 = !DIFile(filename: "/usr/include/magic.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DICompositeType(tag: DW_TAG_structure_type, name: "magic_set", file: !1210, line: 90, flags: DIFlagFwdDecl)
!1213 = !DILocalVariable(name: "script", arg: 1, scope: !1206, file: !501, line: 765, type: !660)
!1214 = !DILocation(line: 765, column: 38, scope: !1206)
!1215 = !DILocalVariable(name: "magic", arg: 2, scope: !1206, file: !501, line: 769, type: !1209)
!1216 = !DILocation(line: 769, column: 22, scope: !1206)
!1217 = !DILocalVariable(name: "flags", scope: !1206, file: !501, line: 771, type: !384)
!1218 = !DILocation(line: 771, column: 6, scope: !1206)
!1219 = !DILocalVariable(name: "ret", scope: !1206, file: !501, line: 772, type: !384)
!1220 = !DILocation(line: 772, column: 6, scope: !1206)
!1221 = !DILocalVariable(name: "ret_real", scope: !1206, file: !501, line: 772, type: !384)
!1222 = !DILocation(line: 772, column: 11, scope: !1206)
!1223 = !DILocalVariable(name: "ret_new", scope: !1206, file: !501, line: 772, type: !384)
!1224 = !DILocation(line: 772, column: 21, scope: !1206)
!1225 = !DILocalVariable(name: "file_buf", scope: !1206, file: !501, line: 773, type: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1227, line: 46, size: 1152, align: 64, elements: !1228)
!1227 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!1228 = !{!1229, !1231, !1233, !1235, !1237, !1238, !1239, !1240, !1241, !1242, !1244, !1246, !1253, !1254, !1255}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1226, file: !1227, line: 48, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !411, line: 124, baseType: !320)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1226, file: !1227, line: 53, baseType: !1232, size: 64, align: 64, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !411, line: 127, baseType: !320)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1226, file: !1227, line: 61, baseType: !1234, size: 64, align: 64, offset: 128)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !411, line: 130, baseType: !320)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1226, file: !1227, line: 62, baseType: !1236, size: 32, align: 32, offset: 192)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !411, line: 129, baseType: !368)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1226, file: !1227, line: 64, baseType: !504, size: 32, align: 32, offset: 224)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1226, file: !1227, line: 65, baseType: !507, size: 32, align: 32, offset: 256)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1226, file: !1227, line: 67, baseType: !384, size: 32, align: 32, offset: 288)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1226, file: !1227, line: 69, baseType: !1230, size: 64, align: 64, offset: 320)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1226, file: !1227, line: 74, baseType: !410, size: 64, align: 64, offset: 384)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1226, file: !1227, line: 78, baseType: !1243, size: 64, align: 64, offset: 448)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !411, line: 153, baseType: !412)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1226, file: !1227, line: 80, baseType: !1245, size: 64, align: 64, offset: 512)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !411, line: 158, baseType: !412)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1226, file: !1227, line: 91, baseType: !1247, size: 128, align: 64, offset: 576)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1248, line: 120, size: 128, align: 64, elements: !1249)
!1248 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]lib--liblib.a")
!1249 = !{!1250, !1251}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1247, file: !1248, line: 122, baseType: !475, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1247, file: !1248, line: 123, baseType: !1252, size: 64, align: 64, offset: 64)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !411, line: 175, baseType: !412)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1226, file: !1227, line: 92, baseType: !1247, size: 128, align: 64, offset: 704)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1226, file: !1227, line: 93, baseType: !1247, size: 128, align: 64, offset: 832)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1226, file: !1227, line: 106, baseType: !1256, size: 192, align: 64, offset: 960)
!1256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1252, size: 192, align: 64, elements: !1257)
!1257 = !{!1258}
!1258 = !DISubrange(count: 3)
!1259 = !DILocation(line: 773, column: 14, scope: !1206)
!1260 = !DILocalVariable(name: "real_buf", scope: !1206, file: !501, line: 773, type: !1226)
!1261 = !DILocation(line: 773, column: 24, scope: !1206)
!1262 = !DILocalVariable(name: "need_script_protection", scope: !1206, file: !501, line: 774, type: !461)
!1263 = !DILocation(line: 774, column: 6, scope: !1206)
!1264 = !DILocalVariable(name: "old_uid", scope: !1206, file: !501, line: 775, type: !503)
!1265 = !DILocation(line: 775, column: 8, scope: !1206)
!1266 = !DILocalVariable(name: "old_gid", scope: !1206, file: !501, line: 776, type: !506)
!1267 = !DILocation(line: 776, column: 8, scope: !1206)
!1268 = !DILocalVariable(name: "new_path", scope: !1206, file: !501, line: 777, type: !386)
!1269 = !DILocation(line: 777, column: 8, scope: !1206)
!1270 = !DILocalVariable(name: "sav_errno", scope: !1206, file: !501, line: 778, type: !384)
!1271 = !DILocation(line: 778, column: 6, scope: !1206)
!1272 = !DILocalVariable(name: "real_file_path", scope: !1206, file: !501, line: 779, type: !386)
!1273 = !DILocation(line: 779, column: 8, scope: !1206)
!1274 = !DILocalVariable(name: "orig_file_part", scope: !1206, file: !501, line: 780, type: !386)
!1275 = !DILocation(line: 780, column: 8, scope: !1206)
!1276 = !DILocalVariable(name: "new_file_part", scope: !1206, file: !501, line: 780, type: !386)
!1277 = !DILocation(line: 780, column: 25, scope: !1206)
!1278 = !DILocation(line: 782, column: 7, scope: !1279)
!1279 = distinct !DILexicalBlock(scope: !1206, file: !501, line: 782, column: 6)
!1280 = !DILocation(line: 782, column: 6, scope: !1206)
!1281 = !DILocation(line: 783, column: 3, scope: !1279)
!1282 = !DILocation(line: 788, column: 6, scope: !1283)
!1283 = distinct !DILexicalBlock(scope: !1206, file: !501, line: 788, column: 6)
!1284 = !DILocation(line: 788, column: 14, scope: !1283)
!1285 = !DILocation(line: 788, column: 25, scope: !1283)
!1286 = !DILocation(line: 788, column: 32, scope: !1283)
!1287 = !DILocation(line: 789, column: 29, scope: !1283)
!1288 = !DILocation(line: 789, column: 37, scope: !1283)
!1289 = !DILocation(line: 789, column: 45, scope: !1283)
!1290 = !DILocation(line: 789, column: 22, scope: !1283)
!1291 = !DILocation(line: 789, column: 57, scope: !1283)
!1292 = !DILocation(line: 789, column: 6, scope: !1283)
!1293 = !DILocation(line: 789, column: 14, scope: !1283)
!1294 = !DILocation(line: 789, column: 62, scope: !1283)
!1295 = !DILocation(line: 788, column: 6, scope: !1296)
!1296 = !DILexicalBlockFile(scope: !1206, file: !501, discriminator: 1)
!1297 = !DILocation(line: 790, column: 3, scope: !1283)
!1298 = !DILocation(line: 792, column: 14, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1206, file: !501, line: 792, column: 6)
!1300 = !DILocation(line: 792, column: 22, scope: !1299)
!1301 = !DILocation(line: 792, column: 7, scope: !1299)
!1302 = !DILocation(line: 792, column: 6, scope: !1206)
!1303 = !DILocation(line: 794, column: 24, scope: !1304)
!1304 = distinct !DILexicalBlock(scope: !1305, file: !501, line: 794, column: 7)
!1305 = distinct !DILexicalBlock(scope: !1299, file: !501, line: 792, column: 37)
!1306 = !DILocation(line: 794, column: 14, scope: !1304)
!1307 = !DILocation(line: 794, column: 12, scope: !1304)
!1308 = !DILocation(line: 794, column: 7, scope: !1305)
!1309 = !DILocation(line: 795, column: 8, scope: !1310)
!1310 = distinct !DILexicalBlock(scope: !1311, file: !501, line: 795, column: 8)
!1311 = distinct !DILexicalBlock(scope: !1304, file: !501, line: 794, column: 34)
!1312 = !DILocation(line: 795, column: 12, scope: !1310)
!1313 = !DILocation(line: 795, column: 8, scope: !1311)
!1314 = !DILocation(line: 796, column: 83, scope: !1310)
!1315 = !DILocation(line: 796, column: 91, scope: !1310)
!1316 = !DILocation(line: 796, column: 5, scope: !1310)
!1317 = !DILocation(line: 798, column: 71, scope: !1310)
!1318 = !DILocation(line: 798, column: 79, scope: !1310)
!1319 = !DILocation(line: 798, column: 5, scope: !1310)
!1320 = !DILocation(line: 799, column: 4, scope: !1311)
!1321 = !DILocation(line: 801, column: 2, scope: !1305)
!1322 = !DILocation(line: 804, column: 6, scope: !1323)
!1323 = distinct !DILexicalBlock(scope: !1206, file: !501, line: 804, column: 6)
!1324 = !DILocation(line: 804, column: 14, scope: !1323)
!1325 = !DILocation(line: 804, column: 6, scope: !1206)
!1326 = !DILocation(line: 805, column: 13, scope: !1323)
!1327 = !DILocation(line: 805, column: 11, scope: !1323)
!1328 = !DILocation(line: 805, column: 3, scope: !1323)
!1329 = !DILocation(line: 806, column: 6, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !1206, file: !501, line: 806, column: 6)
!1331 = !DILocation(line: 806, column: 14, scope: !1330)
!1332 = !DILocation(line: 806, column: 6, scope: !1206)
!1333 = !DILocation(line: 807, column: 13, scope: !1330)
!1334 = !DILocation(line: 807, column: 11, scope: !1330)
!1335 = !DILocation(line: 807, column: 3, scope: !1330)
!1336 = !DILocation(line: 809, column: 7, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1206, file: !501, line: 809, column: 6)
!1338 = !DILocation(line: 809, column: 15, scope: !1337)
!1339 = !DILocation(line: 809, column: 19, scope: !1337)
!1340 = !DILocation(line: 809, column: 30, scope: !1341)
!1341 = !DILexicalBlockFile(scope: !1337, file: !501, discriminator: 1)
!1342 = !DILocation(line: 809, column: 38, scope: !1341)
!1343 = !DILocation(line: 809, column: 22, scope: !1341)
!1344 = !DILocation(line: 809, column: 44, scope: !1341)
!1345 = !DILocation(line: 810, column: 7, scope: !1337)
!1346 = !DILocation(line: 810, column: 15, scope: !1337)
!1347 = !DILocation(line: 810, column: 19, scope: !1337)
!1348 = !DILocation(line: 810, column: 30, scope: !1341)
!1349 = !DILocation(line: 810, column: 38, scope: !1341)
!1350 = !DILocation(line: 810, column: 22, scope: !1341)
!1351 = !DILocation(line: 809, column: 6, scope: !1352)
!1352 = !DILexicalBlockFile(scope: !1206, file: !501, discriminator: 2)
!1353 = !DILocation(line: 811, column: 81, scope: !1354)
!1354 = distinct !DILexicalBlock(scope: !1337, file: !501, line: 810, column: 45)
!1355 = !DILocation(line: 811, column: 89, scope: !1354)
!1356 = !DILocation(line: 811, column: 94, scope: !1354)
!1357 = !DILocation(line: 811, column: 102, scope: !1354)
!1358 = !DILocation(line: 811, column: 107, scope: !1354)
!1359 = !DILocation(line: 811, column: 115, scope: !1354)
!1360 = !DILocation(line: 811, column: 3, scope: !1354)
!1361 = !DILocation(line: 813, column: 8, scope: !1362)
!1362 = distinct !DILexicalBlock(scope: !1354, file: !501, line: 813, column: 7)
!1363 = !DILocation(line: 813, column: 16, scope: !1362)
!1364 = !DILocation(line: 813, column: 20, scope: !1362)
!1365 = !DILocation(line: 813, column: 31, scope: !1366)
!1366 = !DILexicalBlockFile(scope: !1362, file: !501, discriminator: 1)
!1367 = !DILocation(line: 813, column: 23, scope: !1366)
!1368 = !DILocation(line: 813, column: 41, scope: !1366)
!1369 = !DILocation(line: 814, column: 8, scope: !1362)
!1370 = !DILocation(line: 814, column: 16, scope: !1362)
!1371 = !DILocation(line: 814, column: 20, scope: !1362)
!1372 = !DILocation(line: 814, column: 31, scope: !1366)
!1373 = !DILocation(line: 814, column: 23, scope: !1366)
!1374 = !DILocation(line: 813, column: 7, scope: !1375)
!1375 = !DILexicalBlockFile(scope: !1354, file: !501, discriminator: 2)
!1376 = !DILocation(line: 815, column: 76, scope: !1362)
!1377 = !DILocation(line: 815, column: 84, scope: !1362)
!1378 = !DILocation(line: 815, column: 89, scope: !1362)
!1379 = !DILocation(line: 815, column: 97, scope: !1362)
!1380 = !DILocation(line: 815, column: 102, scope: !1362)
!1381 = !DILocation(line: 815, column: 110, scope: !1362)
!1382 = !DILocation(line: 815, column: 4, scope: !1362)
!1383 = !DILocation(line: 817, column: 3, scope: !1354)
!1384 = !DILocation(line: 821, column: 22, scope: !1206)
!1385 = !DILocation(line: 821, column: 30, scope: !1206)
!1386 = !DILocation(line: 821, column: 13, scope: !1206)
!1387 = !DILocation(line: 821, column: 11, scope: !1206)
!1388 = !DILocation(line: 822, column: 15, scope: !1206)
!1389 = !DILocation(line: 822, column: 14, scope: !1206)
!1390 = !DILocation(line: 822, column: 12, scope: !1206)
!1391 = !DILocation(line: 824, column: 7, scope: !1392)
!1392 = distinct !DILexicalBlock(scope: !1206, file: !501, line: 824, column: 6)
!1393 = !DILocation(line: 824, column: 15, scope: !1392)
!1394 = !DILocation(line: 824, column: 19, scope: !1392)
!1395 = !DILocation(line: 824, column: 30, scope: !1396)
!1396 = !DILexicalBlockFile(scope: !1392, file: !501, discriminator: 1)
!1397 = !DILocation(line: 824, column: 22, scope: !1396)
!1398 = !DILocation(line: 824, column: 40, scope: !1396)
!1399 = !DILocation(line: 825, column: 7, scope: !1392)
!1400 = !DILocation(line: 825, column: 15, scope: !1392)
!1401 = !DILocation(line: 825, column: 19, scope: !1392)
!1402 = !DILocation(line: 825, column: 30, scope: !1396)
!1403 = !DILocation(line: 825, column: 22, scope: !1396)
!1404 = !DILocation(line: 824, column: 6, scope: !1352)
!1405 = !DILocation(line: 826, column: 84, scope: !1392)
!1406 = !DILocation(line: 826, column: 92, scope: !1392)
!1407 = !DILocation(line: 826, column: 97, scope: !1392)
!1408 = !DILocation(line: 826, column: 105, scope: !1392)
!1409 = !DILocation(line: 826, column: 110, scope: !1392)
!1410 = !DILocation(line: 826, column: 118, scope: !1392)
!1411 = !DILocation(line: 826, column: 3, scope: !1392)
!1412 = !DILocation(line: 828, column: 7, scope: !1413)
!1413 = distinct !DILexicalBlock(scope: !1206, file: !501, line: 828, column: 6)
!1414 = !DILocation(line: 828, column: 6, scope: !1206)
!1415 = !DILocation(line: 830, column: 61, scope: !1416)
!1416 = distinct !DILexicalBlock(scope: !1413, file: !501, line: 829, column: 2)
!1417 = !DILocation(line: 830, column: 69, scope: !1416)
!1418 = !DILocation(line: 830, column: 87, scope: !1416)
!1419 = !DILocation(line: 830, column: 78, scope: !1416)
!1420 = !DILocation(line: 830, column: 3, scope: !1421)
!1421 = !DILexicalBlockFile(scope: !1416, file: !501, discriminator: 1)
!1422 = !DILocation(line: 832, column: 3, scope: !1416)
!1423 = !DILocation(line: 835, column: 17, scope: !1206)
!1424 = !DILocation(line: 837, column: 27, scope: !1206)
!1425 = !DILocation(line: 837, column: 35, scope: !1206)
!1426 = !DILocation(line: 837, column: 19, scope: !1206)
!1427 = !DILocation(line: 837, column: 17, scope: !1206)
!1428 = !DILocation(line: 838, column: 26, scope: !1206)
!1429 = !DILocation(line: 838, column: 18, scope: !1206)
!1430 = !DILocation(line: 838, column: 16, scope: !1206)
!1431 = !DILocation(line: 839, column: 13, scope: !1432)
!1432 = distinct !DILexicalBlock(scope: !1206, file: !501, line: 839, column: 6)
!1433 = !DILocation(line: 839, column: 21, scope: !1432)
!1434 = !DILocation(line: 839, column: 30, scope: !1432)
!1435 = !DILocation(line: 839, column: 6, scope: !1432)
!1436 = !DILocation(line: 839, column: 6, scope: !1206)
!1437 = !DILocation(line: 845, column: 14, scope: !1438)
!1438 = distinct !DILexicalBlock(scope: !1439, file: !501, line: 845, column: 7)
!1439 = distinct !DILexicalBlock(scope: !1432, file: !501, line: 839, column: 41)
!1440 = !DILocation(line: 845, column: 29, scope: !1438)
!1441 = !DILocation(line: 845, column: 34, scope: !1438)
!1442 = !DILocation(line: 845, column: 48, scope: !1438)
!1443 = !DILocation(line: 845, column: 7, scope: !1438)
!1444 = !DILocation(line: 845, column: 7, scope: !1439)
!1445 = !DILocation(line: 846, column: 21, scope: !1446)
!1446 = distinct !DILexicalBlock(scope: !1438, file: !501, line: 845, column: 54)
!1447 = !DILocation(line: 846, column: 19, scope: !1446)
!1448 = !DILocation(line: 847, column: 23, scope: !1446)
!1449 = !DILocation(line: 847, column: 39, scope: !1446)
!1450 = !DILocation(line: 847, column: 37, scope: !1446)
!1451 = !DILocation(line: 847, column: 54, scope: !1446)
!1452 = !DILocation(line: 847, column: 67, scope: !1446)
!1453 = !DILocation(line: 847, column: 82, scope: !1446)
!1454 = !DILocation(line: 847, column: 60, scope: !1446)
!1455 = !DILocation(line: 847, column: 58, scope: !1446)
!1456 = !DILocation(line: 847, column: 87, scope: !1446)
!1457 = !DILocation(line: 847, column: 16, scope: !1458)
!1458 = !DILexicalBlockFile(scope: !1446, file: !501, discriminator: 1)
!1459 = !DILocation(line: 847, column: 13, scope: !1446)
!1460 = !DILocation(line: 848, column: 12, scope: !1446)
!1461 = !DILocation(line: 848, column: 22, scope: !1446)
!1462 = !DILocation(line: 848, column: 38, scope: !1446)
!1463 = !DILocation(line: 848, column: 52, scope: !1446)
!1464 = !DILocation(line: 848, column: 58, scope: !1446)
!1465 = !DILocation(line: 848, column: 56, scope: !1446)
!1466 = !DILocation(line: 848, column: 4, scope: !1446)
!1467 = !DILocation(line: 849, column: 11, scope: !1446)
!1468 = !DILocation(line: 849, column: 23, scope: !1446)
!1469 = !DILocation(line: 849, column: 37, scope: !1446)
!1470 = !DILocation(line: 849, column: 43, scope: !1446)
!1471 = !DILocation(line: 849, column: 41, scope: !1446)
!1472 = !DILocation(line: 849, column: 20, scope: !1446)
!1473 = !DILocation(line: 849, column: 60, scope: !1446)
!1474 = !DILocation(line: 849, column: 75, scope: !1446)
!1475 = !DILocation(line: 849, column: 4, scope: !1446)
!1476 = !DILocation(line: 852, column: 20, scope: !1446)
!1477 = !DILocation(line: 852, column: 15, scope: !1446)
!1478 = !DILocation(line: 852, column: 13, scope: !1446)
!1479 = !DILocation(line: 853, column: 19, scope: !1446)
!1480 = !DILocation(line: 853, column: 14, scope: !1446)
!1481 = !DILocation(line: 853, column: 12, scope: !1446)
!1482 = !DILocation(line: 854, column: 9, scope: !1483)
!1483 = distinct !DILexicalBlock(scope: !1446, file: !501, line: 854, column: 8)
!1484 = !DILocation(line: 854, column: 18, scope: !1483)
!1485 = !DILocation(line: 855, column: 9, scope: !1483)
!1486 = !DILocation(line: 855, column: 17, scope: !1483)
!1487 = !DILocation(line: 856, column: 18, scope: !1483)
!1488 = !DILocation(line: 856, column: 37, scope: !1483)
!1489 = !DILocation(line: 856, column: 25, scope: !1483)
!1490 = !DILocation(line: 856, column: 44, scope: !1483)
!1491 = !DILocation(line: 857, column: 18, scope: !1483)
!1492 = !DILocation(line: 857, column: 37, scope: !1483)
!1493 = !DILocation(line: 857, column: 25, scope: !1483)
!1494 = !DILocation(line: 854, column: 8, scope: !1458)
!1495 = !DILocation(line: 859, column: 11, scope: !1496)
!1496 = distinct !DILexicalBlock(scope: !1483, file: !501, line: 857, column: 46)
!1497 = !DILocation(line: 859, column: 6, scope: !1496)
!1498 = !DILocation(line: 859, column: 33, scope: !1496)
!1499 = !DILocation(line: 860, column: 16, scope: !1496)
!1500 = !DILocation(line: 860, column: 14, scope: !1496)
!1501 = !DILocation(line: 861, column: 20, scope: !1496)
!1502 = !DILocation(line: 862, column: 4, scope: !1496)
!1503 = !DILocation(line: 863, column: 3, scope: !1446)
!1504 = !DILocation(line: 865, column: 14, scope: !1505)
!1505 = distinct !DILexicalBlock(scope: !1439, file: !501, line: 865, column: 7)
!1506 = !DILocation(line: 865, column: 22, scope: !1505)
!1507 = !DILocation(line: 865, column: 31, scope: !1505)
!1508 = !DILocation(line: 865, column: 7, scope: !1505)
!1509 = !DILocation(line: 865, column: 7, scope: !1439)
!1510 = !DILocation(line: 867, column: 21, scope: !1511)
!1511 = distinct !DILexicalBlock(scope: !1505, file: !501, line: 865, column: 42)
!1512 = !DILocation(line: 867, column: 29, scope: !1511)
!1513 = !DILocation(line: 867, column: 4, scope: !1511)
!1514 = !DILocation(line: 868, column: 3, scope: !1511)
!1515 = !DILocation(line: 869, column: 2, scope: !1439)
!1516 = !DILocation(line: 871, column: 7, scope: !1517)
!1517 = distinct !DILexicalBlock(scope: !1206, file: !501, line: 871, column: 6)
!1518 = !DILocation(line: 871, column: 6, scope: !1206)
!1519 = !DILocation(line: 872, column: 8, scope: !1517)
!1520 = !DILocation(line: 872, column: 3, scope: !1517)
!1521 = !DILocation(line: 874, column: 9, scope: !1517)
!1522 = !DILocation(line: 874, column: 4, scope: !1517)
!1523 = !DILocation(line: 874, column: 31, scope: !1517)
!1524 = !DILocation(line: 877, column: 11, scope: !1525)
!1525 = distinct !DILexicalBlock(scope: !1206, file: !501, line: 877, column: 6)
!1526 = !DILocation(line: 877, column: 28, scope: !1527)
!1527 = !DILexicalBlockFile(scope: !1525, file: !501, discriminator: 1)
!1528 = !DILocation(line: 877, column: 11, scope: !1527)
!1529 = !DILocation(line: 877, column: 45, scope: !1530)
!1530 = !DILexicalBlockFile(scope: !1525, file: !501, discriminator: 2)
!1531 = !DILocation(line: 877, column: 53, scope: !1530)
!1532 = !DILocation(line: 877, column: 11, scope: !1530)
!1533 = !DILocation(line: 877, column: 11, scope: !1534)
!1534 = !DILexicalBlockFile(scope: !1525, file: !501, discriminator: 3)
!1535 = !DILocation(line: 877, column: 6, scope: !1534)
!1536 = !DILocation(line: 878, column: 68, scope: !1537)
!1537 = distinct !DILexicalBlock(scope: !1525, file: !501, line: 877, column: 74)
!1538 = !DILocation(line: 878, column: 76, scope: !1537)
!1539 = !DILocation(line: 878, column: 3, scope: !1537)
!1540 = !DILocation(line: 879, column: 3, scope: !1537)
!1541 = !DILocation(line: 882, column: 8, scope: !1206)
!1542 = !DILocation(line: 885, column: 31, scope: !1543)
!1543 = distinct !DILexicalBlock(scope: !1206, file: !501, line: 885, column: 6)
!1544 = !DILocation(line: 885, column: 39, scope: !1543)
!1545 = !DILocation(line: 885, column: 44, scope: !1543)
!1546 = !DILocation(line: 885, column: 52, scope: !1543)
!1547 = !DILocation(line: 885, column: 6, scope: !1543)
!1548 = !DILocation(line: 885, column: 6, scope: !1206)
!1549 = !DILocation(line: 886, column: 9, scope: !1550)
!1550 = distinct !DILexicalBlock(scope: !1543, file: !501, line: 885, column: 58)
!1551 = !DILocation(line: 887, column: 7, scope: !1552)
!1552 = distinct !DILexicalBlock(scope: !1550, file: !501, line: 887, column: 7)
!1553 = !DILocation(line: 887, column: 15, scope: !1552)
!1554 = !DILocation(line: 887, column: 19, scope: !1552)
!1555 = !DILocation(line: 887, column: 24, scope: !1552)
!1556 = !DILocation(line: 887, column: 27, scope: !1557)
!1557 = !DILexicalBlockFile(scope: !1552, file: !501, discriminator: 1)
!1558 = !DILocation(line: 887, column: 35, scope: !1557)
!1559 = !DILocation(line: 887, column: 39, scope: !1557)
!1560 = !DILocation(line: 887, column: 44, scope: !1557)
!1561 = !DILocation(line: 888, column: 17, scope: !1552)
!1562 = !DILocation(line: 888, column: 24, scope: !1552)
!1563 = !DILocation(line: 888, column: 29, scope: !1552)
!1564 = !DILocation(line: 888, column: 42, scope: !1557)
!1565 = !DILocation(line: 888, column: 50, scope: !1557)
!1566 = !DILocation(line: 888, column: 60, scope: !1557)
!1567 = !DILocation(line: 888, column: 73, scope: !1568)
!1568 = !DILexicalBlockFile(scope: !1552, file: !501, discriminator: 2)
!1569 = !DILocation(line: 888, column: 81, scope: !1568)
!1570 = !DILocation(line: 888, column: 93, scope: !1568)
!1571 = !DILocation(line: 889, column: 17, scope: !1552)
!1572 = !DILocation(line: 889, column: 24, scope: !1552)
!1573 = !DILocation(line: 889, column: 29, scope: !1552)
!1574 = !DILocation(line: 889, column: 42, scope: !1557)
!1575 = !DILocation(line: 889, column: 50, scope: !1557)
!1576 = !DILocation(line: 889, column: 60, scope: !1557)
!1577 = !DILocation(line: 889, column: 73, scope: !1568)
!1578 = !DILocation(line: 889, column: 81, scope: !1568)
!1579 = !DILocation(line: 887, column: 7, scope: !1580)
!1580 = !DILexicalBlockFile(scope: !1550, file: !501, discriminator: 2)
!1581 = !DILocation(line: 890, column: 27, scope: !1552)
!1582 = !DILocation(line: 890, column: 4, scope: !1552)
!1583 = !DILocation(line: 891, column: 2, scope: !1550)
!1584 = !DILocation(line: 892, column: 98, scope: !1543)
!1585 = !DILocation(line: 892, column: 106, scope: !1543)
!1586 = !DILocation(line: 892, column: 115, scope: !1543)
!1587 = !DILocation(line: 892, column: 123, scope: !1543)
!1588 = !DILocation(line: 892, column: 128, scope: !1543)
