; ModuleID = './libvmbackup_la-syncDriverOps.o.i'
source_filename = "./libvmbackup_la-syncDriverOps.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.VmBackupSyncProvider = type { void (%struct.ToolsAppCtx*, i8*)*, i8 (%struct.VmBackupState*, i8*)*, void (%struct.VmBackupSyncProvider*)*, i8* }
%struct.ToolsAppCtx = type { i32, i8*, i32, i32, %struct._GMainLoop*, %struct._RpcChannel*, %struct._GKeyFile*, i32, i32, i8**, i8* }
%struct._GMainLoop = type opaque
%struct._RpcChannel = type opaque
%struct._GKeyFile = type opaque
%struct.VmBackupState = type { %struct.ToolsAppCtx*, %struct.VmBackupOp*, i8*, %struct.GStaticMutex, i8*, i8*, i32, %struct._GSource*, %struct._GSource*, %struct._GSource*, i8 (%struct.VmBackupState*)*, i8, i8, i8, i8, i8*, i8, i8, i8, i8, i8*, i32, i8*, i8*, i8*, i64, i8*, i32, i32, %struct.VmBackupSyncProvider*, %struct.VmBackupSyncCompleter*, i32, i32, i8, i8, i8 }
%struct.VmBackupOp = type { i32 (%struct.VmBackupOp*)*, void (%struct.VmBackupOp*)*, void (%struct.VmBackupOp*)* }
%struct.GStaticMutex = type { %union._GMutex*, %union.pthread_mutex_t }
%union._GMutex = type { i8* }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !49)
!1 = !DIFile(filename: "libvmbackup_la-syncDriverOps.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!2 = !{!3, !7, !14, !25, !31, !43}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 232, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/plugin.h", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!5 = !{!6}
!6 = !DIEnumerator(name: "TOOLS_CORE_API_V1", value: 1)
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 43, size: 32, align: 32, elements: !9)
!8 = !DIFile(filename: "vmBackupInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!9 = !{!10, !11, !12, !13}
!10 = !DIEnumerator(name: "VMBACKUP_STATUS_PENDING", value: 0)
!11 = !DIEnumerator(name: "VMBACKUP_STATUS_FINISHED", value: 1)
!12 = !DIEnumerator(name: "VMBACKUP_STATUS_CANCELED", value: 2)
!13 = !DIEnumerator(name: "VMBACKUP_STATUS_ERROR", value: 3)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 63, size: 32, align: 32, elements: !15)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24}
!16 = !DIEnumerator(name: "VMBACKUP_MSTATE_IDLE", value: 0)
!17 = !DIEnumerator(name: "VMBACKUP_MSTATE_SCRIPT_FREEZE", value: 1)
!18 = !DIEnumerator(name: "VMBACKUP_MSTATE_SYNC_FREEZE_WAIT", value: 2)
!19 = !DIEnumerator(name: "VMBACKUP_MSTATE_SYNC_FREEZE", value: 3)
!20 = !DIEnumerator(name: "VMBACKUP_MSTATE_SYNC_THAW", value: 4)
!21 = !DIEnumerator(name: "VMBACKUP_MSTATE_SCRIPT_THAW", value: 5)
!22 = !DIEnumerator(name: "VMBACKUP_MSTATE_COMPLETE_WAIT", value: 6)
!23 = !DIEnumerator(name: "VMBACKUP_MSTATE_SCRIPT_ERROR", value: 7)
!24 = !DIEnumerator(name: "VMBACKUP_MSTATE_SYNC_ERROR", value: 8)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 50, size: 32, align: 32, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "VMBACKUP_FREEZE_PENDING", value: 0)
!28 = !DIEnumerator(name: "VMBACKUP_FREEZE_FINISHED", value: 1)
!29 = !DIEnumerator(name: "VMBACKUP_FREEZE_CANCELED", value: 2)
!30 = !DIEnumerator(name: "VMBACKUP_FREEZE_ERROR", value: 3)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 51, size: 32, align: 32, elements: !33)
!32 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42}
!34 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!35 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!36 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!37 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!38 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!39 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!40 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!41 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!42 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 45, size: 32, align: 32, elements: !45)
!44 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/syncDriver.h", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!45 = !{!46, !47, !48}
!46 = !DIEnumerator(name: "SYNCDRIVER_IDLE", value: 0)
!47 = !DIEnumerator(name: "SYNCDRIVER_BUSY", value: 1)
!48 = !DIEnumerator(name: "SYNCDRIVER_ERROR", value: 2)
!49 = !{!50, !51, !97, !92, !313, !317}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupState", file: !8, line: 141, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VmBackupState", file: !8, line: 104, size: 1984, align: 64, elements: !54)
!54 = !{!55, !96, !112, !113, !160, !162, !163, !164, !242, !243, !244, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !262, !263, !264, !265, !266, !271, !272, !274, !276, !296, !308, !309, !310, !311, !312}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !53, file: !8, line: 105, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCtx", file: !4, line: 274, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCtx", file: !4, line: 241, size: 576, align: 64, elements: !59)
!59 = !{!60, !62, !68, !72, !73, !78, !83, !88, !89, !90, !94}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !58, file: !4, line: 243, baseType: !61, size: 32, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreAPI", file: !4, line: 234, baseType: !3)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !58, file: !4, line: 245, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !66, line: 46, baseType: !67)
!66 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!67 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "isVMware", scope: !58, file: !4, line: 247, baseType: !69, size: 32, align: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !66, line: 50, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !66, line: 49, baseType: !71)
!71 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "errorCode", scope: !58, file: !4, line: 249, baseType: !71, size: 32, align: 32, offset: 160)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "mainLoop", scope: !58, file: !4, line: 251, baseType: !74, size: 64, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !76, line: 56, baseType: !77)
!76 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !76, line: 56, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !58, file: !4, line: 253, baseType: !79, size: 64, align: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !81, line: 48, baseType: !82)
!81 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !81, line: 48, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !58, file: !4, line: 255, baseType: !84, size: 64, align: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !86, line: 48, baseType: !87)
!86 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !86, line: 48, flags: DIFlagFwdDecl)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "blockFD", scope: !58, file: !4, line: 261, baseType: !71, size: 32, align: 32, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "uinputFD", scope: !58, file: !4, line: 263, baseType: !71, size: 32, align: 32, offset: 416)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !58, file: !4, line: 265, baseType: !91, size: 64, align: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "serviceObj", scope: !58, file: !4, line: 273, baseType: !95, size: 64, align: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !66, line: 77, baseType: !50)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "currentOp", scope: !53, file: !8, line: 106, baseType: !97, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupOp", file: !8, line: 86, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VmBackupOp", file: !8, line: 82, size: 192, align: 64, elements: !100)
!100 = !{!101, !107, !111}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "queryFn", scope: !99, file: !8, line: 83, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !106}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupOpStatus", file: !8, line: 48, baseType: !7)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "releaseFn", scope: !99, file: !8, line: 84, baseType: !108, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !106}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "cancelFn", scope: !99, file: !8, line: 85, baseType: !108, size: 64, align: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "currentOpName", scope: !53, file: !8, line: 107, baseType: !92, size: 64, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "opLock", scope: !53, file: !8, line: 108, baseType: !114, size: 384, align: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "GStaticMutex", file: !115, line: 140, baseType: !116)
!115 = !DIFile(filename: "/usr/include/glib-2.0/glib/deprecated/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 133, size: 384, align: 64, elements: !117)
!117 = !{!118, !131}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !116, file: !115, line: 135, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMutex", file: !121, line: 51, baseType: !122)
!121 = !DIFile(filename: "/usr/include/glib-2.0/glib/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!122 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GMutex", file: !121, line: 58, size: 64, align: 64, elements: !123)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !122, file: !121, line: 61, baseType: !95, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !122, file: !121, line: 62, baseType: !126, size: 64, align: 32)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 64, align: 32, elements: !129)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !66, line: 55, baseType: !128)
!128 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!129 = !{!130}
!130 = !DISubrange(count: 2)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !116, file: !115, line: 138, baseType: !132, size: 320, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !133, line: 128, baseType: !134)
!133 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!134 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !133, line: 90, size: 320, align: 64, elements: !135)
!135 = !{!136, !154, !158}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !134, file: !133, line: 125, baseType: !137, size: 320, align: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !133, line: 92, size: 320, align: 64, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144, !146, !147}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !137, file: !133, line: 94, baseType: !71, size: 32, align: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !137, file: !133, line: 95, baseType: !128, size: 32, align: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !137, file: !133, line: 96, baseType: !71, size: 32, align: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !137, file: !133, line: 98, baseType: !128, size: 32, align: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !137, file: !133, line: 102, baseType: !71, size: 32, align: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !137, file: !133, line: 104, baseType: !145, size: 16, align: 16, offset: 160)
!145 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !137, file: !133, line: 105, baseType: !145, size: 16, align: 16, offset: 176)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !137, file: !133, line: 106, baseType: !148, size: 128, align: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !133, line: 79, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !133, line: 75, size: 128, align: 64, elements: !150)
!150 = !{!151, !153}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !149, file: !133, line: 77, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !149, file: !133, line: 78, baseType: !152, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !134, file: !133, line: 126, baseType: !155, size: 320, align: 8)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 320, align: 8, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 40)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !134, file: !133, line: 127, baseType: !159, size: 64, align: 64)
!159 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "volumes", scope: !53, file: !8, line: 109, baseType: !161, size: 64, align: 64, offset: 576)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "snapshots", scope: !53, file: !8, line: 110, baseType: !161, size: 64, align: 64, offset: 640)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "pollPeriod", scope: !53, file: !8, line: 111, baseType: !127, size: 32, align: 32, offset: 704)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "abortTimer", scope: !53, file: !8, line: 112, baseType: !165, size: 64, align: 64, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !76, line: 64, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !76, line: 171, size: 768, align: 64, elements: !168)
!168 = !{!169, !170, !190, !219, !220, !224, !225, !226, !227, !235, !236, !237, !238}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !167, file: !76, line: 174, baseType: !95, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !167, file: !76, line: 175, baseType: !171, size: 64, align: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !76, line: 77, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !76, line: 196, size: 192, align: 64, elements: !174)
!174 = !{!175, !179, !180}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !173, file: !76, line: 198, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !95}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !173, file: !76, line: 199, baseType: !176, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !173, file: !76, line: 200, baseType: !181, size: 64, align: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !95, !165, !184, !189}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !76, line: 155, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!69, !95}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !167, file: !76, line: 177, baseType: !191, size: 64, align: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !76, line: 130, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !76, line: 214, size: 384, align: 64, elements: !195)
!195 = !{!196, !201, !205, !209, !213, !214}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !194, file: !76, line: 216, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!69, !165, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !194, file: !76, line: 218, baseType: !202, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!69, !165}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !194, file: !76, line: 219, baseType: !206, size: 64, align: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!69, !165, !185, !95}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !194, file: !76, line: 222, baseType: !210, size: 64, align: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !165}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !194, file: !76, line: 226, baseType: !185, size: 64, align: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !194, file: !76, line: 227, baseType: !215, size: 64, align: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !76, line: 212, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !167, file: !76, line: 178, baseType: !127, size: 32, align: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !167, file: !76, line: 180, baseType: !221, size: 64, align: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !76, line: 48, baseType: !223)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !76, line: 48, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !167, file: !76, line: 182, baseType: !70, size: 32, align: 32, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !167, file: !76, line: 183, baseType: !127, size: 32, align: 32, offset: 352)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !167, file: !76, line: 184, baseType: !127, size: 32, align: 32, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !167, file: !76, line: 186, baseType: !228, size: 64, align: 64, offset: 448)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !230, line: 37, baseType: !231)
!230 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !230, line: 39, size: 128, align: 64, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !231, file: !230, line: 41, baseType: !95, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !231, file: !230, line: 42, baseType: !228, size: 64, align: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !167, file: !76, line: 188, baseType: !165, size: 64, align: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !167, file: !76, line: 189, baseType: !165, size: 64, align: 64, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !167, file: !76, line: 191, baseType: !161, size: 64, align: 64, offset: 640)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !167, file: !76, line: 193, baseType: !239, size: 64, align: 64, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !76, line: 65, baseType: !241)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !76, line: 65, flags: DIFlagFwdDecl)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "timerEvent", scope: !53, file: !8, line: 113, baseType: !165, size: 64, align: 64, offset: 832)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "keepAlive", scope: !53, file: !8, line: 114, baseType: !165, size: 64, align: 64, offset: 896)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !53, file: !8, line: 115, baseType: !245, size: 64, align: 64, offset: 960)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!248, !250}
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !249, line: 230, baseType: !67)
!249 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "forceRequeue", scope: !53, file: !8, line: 116, baseType: !248, size: 8, align: 8, offset: 1024)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "generateManifests", scope: !53, file: !8, line: 117, baseType: !248, size: 8, align: 8, offset: 1032)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "quiesceApps", scope: !53, file: !8, line: 118, baseType: !248, size: 8, align: 8, offset: 1040)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "quiesceFS", scope: !53, file: !8, line: 119, baseType: !248, size: 8, align: 8, offset: 1048)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "excludedFileSystems", scope: !53, file: !8, line: 120, baseType: !161, size: 64, align: 64, offset: 1088)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "allowHWProvider", scope: !53, file: !8, line: 121, baseType: !248, size: 8, align: 8, offset: 1152)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "execScripts", scope: !53, file: !8, line: 122, baseType: !248, size: 8, align: 8, offset: 1160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "enableNullDriver", scope: !53, file: !8, line: 123, baseType: !248, size: 8, align: 8, offset: 1168)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "needsPriv", scope: !53, file: !8, line: 124, baseType: !248, size: 8, align: 8, offset: 1176)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "scriptArg", scope: !53, file: !8, line: 125, baseType: !261, size: 64, align: 64, offset: 1216)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !53, file: !8, line: 126, baseType: !127, size: 32, align: 32, offset: 1280)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !53, file: !8, line: 127, baseType: !95, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "scripts", scope: !53, file: !8, line: 128, baseType: !50, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "configDir", scope: !53, file: !8, line: 129, baseType: !92, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "currentScript", scope: !53, file: !8, line: 130, baseType: !267, size: 64, align: 64, offset: 1536)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !268, line: 109, baseType: !269)
!268 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !270, line: 172, baseType: !159)
!270 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!271 = !DIDerivedType(tag: DW_TAG_member, name: "errorMsg", scope: !53, file: !8, line: 131, baseType: !261, size: 64, align: 64, offset: 1600)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "machineState", scope: !53, file: !8, line: 132, baseType: !273, size: 32, align: 32, offset: 1664)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupMState", file: !8, line: 73, baseType: !14)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "freezeStatus", scope: !53, file: !8, line: 133, baseType: !275, size: 32, align: 32, offset: 1696)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupFreezeStatus", file: !8, line: 55, baseType: !25)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "provider", scope: !53, file: !8, line: 134, baseType: !277, size: 64, align: 64, offset: 1728)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VmBackupSyncProvider", file: !8, line: 154, size: 256, align: 64, elements: !279)
!279 = !{!280, !286, !291, !295}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !278, file: !8, line: 158, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCorePoolCb", file: !282, line: 54, baseType: !283)
!282 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/threadPool.h", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !56, !95}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "snapshotDone", scope: !278, file: !8, line: 160, baseType: !287, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupProviderCallback", file: !8, line: 144, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!248, !51, !50}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !278, file: !8, line: 161, baseType: !292, size: 64, align: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !277}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !278, file: !8, line: 162, baseType: !50, size: 64, align: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "completer", scope: !53, file: !8, line: 135, baseType: !297, size: 64, align: 64, offset: 1792)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VmBackupSyncCompleter", file: !8, line: 171, size: 256, align: 64, elements: !299)
!299 = !{!300, !302, !303, !307}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !298, file: !8, line: 172, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupCompleterCallback", file: !8, line: 145, baseType: !288)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "snapshotCompleted", scope: !298, file: !8, line: 173, baseType: !301, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !298, file: !8, line: 174, baseType: !304, size: 64, align: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !297}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !298, file: !8, line: 175, baseType: !50, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "vssBackupContext", scope: !53, file: !8, line: 136, baseType: !70, size: 32, align: 32, offset: 1856)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "vssBackupType", scope: !53, file: !8, line: 137, baseType: !70, size: 32, align: 32, offset: 1888)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "vssBootableSystemState", scope: !53, file: !8, line: 138, baseType: !248, size: 8, align: 8, offset: 1920)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "vssPartialFileSupport", scope: !53, file: !8, line: 139, baseType: !248, size: 8, align: 8, offset: 1928)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "vssUseDefault", scope: !53, file: !8, line: 140, baseType: !248, size: 8, align: 8, offset: 1936)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyncDriverHandle", file: !44, line: 41, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "SyncHandle", file: !44, line: 41, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupDriverOp", file: !319, line: 45, baseType: !320)
!319 = !DIFile(filename: "syncDriverOps.c", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VmBackupDriverOp", file: !319, line: 38, size: 448, align: 64, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !320, file: !319, line: 39, baseType: !98, size: 192, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "volumes", scope: !320, file: !319, line: 40, baseType: !92, size: 64, align: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "freeze", scope: !320, file: !319, line: 41, baseType: !248, size: 8, align: 8, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "canceled", scope: !320, file: !319, line: 42, baseType: !248, size: 8, align: 8, offset: 264)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "syncHandle", scope: !320, file: !319, line: 43, baseType: !313, size: 64, align: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "manifest", scope: !320, file: !319, line: 44, baseType: !328, size: 64, align: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyncManifest", file: !330, line: 37, baseType: !331)
!330 = !DIFile(filename: "syncManifest.h", directory: "/home/lichi/Desktop/open-vm-tools/line1592")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 34, size: 128, align: 64, elements: !332)
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !331, file: !330, line: 35, baseType: !161, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "providerName", scope: !331, file: !330, line: 36, baseType: !161, size: 64, align: 64, offset: 64)
!335 = !{i32 2, !"Dwarf Version", i32 4}
!336 = !{i32 2, !"Debug Info Version", i32 3}
!337 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!338 = distinct !DISubprogram(name: "VmBackup_NewSyncDriverProvider", scope: !319, file: !319, line: 612, type: !339, isLocal: false, isDefinition: true, scopeLine: 613, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !343)
!339 = !DISubroutineType(types: !340)
!340 = !{!341}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupSyncProvider", file: !8, line: 163, baseType: !278)
!343 = !{}
!344 = !DILocation(line: 614, column: 11, scope: !338)
!345 = !DILocation(line: 614, column: 4, scope: !338)
!346 = distinct !DISubprogram(name: "VmBackup_NewSyncDriverProviderInternal", scope: !319, file: !319, line: 569, type: !347, isLocal: true, isDefinition: true, scopeLine: 570, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !343)
!347 = !DISubroutineType(types: !348)
!348 = !{!341, !248}
!349 = !DILocalVariable(name: "useNullDriverPrefs", arg: 1, scope: !346, file: !319, line: 569, type: !248)
!350 = !DIExpression()
!351 = !DILocation(line: 569, column: 45, scope: !346)
!352 = !DILocalVariable(name: "provider", scope: !346, file: !319, line: 571, type: !341)
!353 = !DILocation(line: 571, column: 26, scope: !346)
!354 = !DILocation(line: 573, column: 9, scope: !355)
!355 = distinct !DILexicalBlock(scope: !346, file: !319, line: 573, column: 8)
!356 = !DILocation(line: 573, column: 8, scope: !346)
!357 = !DILocation(line: 574, column: 7, scope: !358)
!358 = distinct !DILexicalBlock(scope: !355, file: !319, line: 573, column: 28)
!359 = !DILocation(line: 575, column: 7, scope: !358)
!360 = !DILocation(line: 578, column: 15, scope: !346)
!361 = !DILocation(line: 578, column: 13, scope: !346)
!362 = !DILocation(line: 579, column: 8, scope: !363)
!363 = distinct !DILexicalBlock(scope: !346, file: !319, line: 579, column: 8)
!364 = !DILocation(line: 579, column: 8, scope: !346)
!365 = !DILocation(line: 580, column: 7, scope: !366)
!366 = distinct !DILexicalBlock(scope: !363, file: !319, line: 579, column: 28)
!367 = !DILocation(line: 580, column: 17, scope: !366)
!368 = !DILocation(line: 580, column: 23, scope: !366)
!369 = !DILocation(line: 581, column: 7, scope: !366)
!370 = !DILocation(line: 581, column: 17, scope: !366)
!371 = !DILocation(line: 581, column: 30, scope: !366)
!372 = !DILocation(line: 582, column: 4, scope: !366)
!373 = !DILocation(line: 583, column: 7, scope: !374)
!374 = distinct !DILexicalBlock(scope: !363, file: !319, line: 582, column: 11)
!375 = !DILocation(line: 583, column: 17, scope: !374)
!376 = !DILocation(line: 583, column: 23, scope: !374)
!377 = !DILocation(line: 584, column: 7, scope: !374)
!378 = !DILocation(line: 584, column: 17, scope: !374)
!379 = !DILocation(line: 584, column: 30, scope: !374)
!380 = !DILocation(line: 586, column: 4, scope: !346)
!381 = !DILocation(line: 586, column: 14, scope: !346)
!382 = !DILocation(line: 586, column: 22, scope: !346)
!383 = !DILocation(line: 587, column: 4, scope: !346)
!384 = !DILocation(line: 587, column: 14, scope: !346)
!385 = !DILocation(line: 587, column: 25, scope: !346)
!386 = !DILocation(line: 589, column: 11, scope: !346)
!387 = !DILocation(line: 589, column: 4, scope: !346)
!388 = !DILocation(line: 590, column: 1, scope: !346)
!389 = distinct !DISubprogram(name: "VmBackup_NewSyncDriverOnlyProvider", scope: !319, file: !319, line: 639, type: !339, isLocal: false, isDefinition: true, scopeLine: 640, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !343)
!390 = !DILocation(line: 641, column: 11, scope: !389)
!391 = !DILocation(line: 641, column: 4, scope: !389)
