; ModuleID = './vmware_namespace_cmd-namespacetool.o.i'
source_filename = "./vmware_namespace_cmd-namespacetool.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._GError = type { i32, i32, i8* }
%struct._GOptionContext = type opaque
%struct._GOptionGroup = type opaque
%struct.NamespaceOptionsState = type { i8*, i8*, i8*, i8*, i8*, i8*, i32, i32 }
%struct._GOptionEntry = type { i8*, i8, i32, i32, i8*, i8*, i8* }
%struct.DynBuf = type { i8*, i64, i64 }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !62, globals: !85)
!1 = !DIFile(filename: "vmware_namespace_cmd-namespacetool.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1352")
!2 = !{!3, !15, !25, !30, !37, !42, !51}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 118, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/goption.h", directory: "/home/lichi/Desktop/open-vm-tools/line1352")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "G_OPTION_ARG_NONE", value: 0)
!7 = !DIEnumerator(name: "G_OPTION_ARG_STRING", value: 1)
!8 = !DIEnumerator(name: "G_OPTION_ARG_INT", value: 2)
!9 = !DIEnumerator(name: "G_OPTION_ARG_CALLBACK", value: 3)
!10 = !DIEnumerator(name: "G_OPTION_ARG_FILENAME", value: 4)
!11 = !DIEnumerator(name: "G_OPTION_ARG_STRING_ARRAY", value: 5)
!12 = !DIEnumerator(name: "G_OPTION_ARG_FILENAME_ARRAY", value: 6)
!13 = !DIEnumerator(name: "G_OPTION_ARG_DOUBLE", value: 7)
!14 = !DIEnumerator(name: "G_OPTION_ARG_INT64", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 81, size: 32, align: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24}
!17 = !DIEnumerator(name: "G_OPTION_FLAG_NONE", value: 0)
!18 = !DIEnumerator(name: "G_OPTION_FLAG_HIDDEN", value: 1)
!19 = !DIEnumerator(name: "G_OPTION_FLAG_IN_MAIN", value: 2)
!20 = !DIEnumerator(name: "G_OPTION_FLAG_REVERSE", value: 4)
!21 = !DIEnumerator(name: "G_OPTION_FLAG_NO_ARG", value: 8)
!22 = !DIEnumerator(name: "G_OPTION_FLAG_FILENAME", value: 16)
!23 = !DIEnumerator(name: "G_OPTION_FLAG_OPTIONAL_ARG", value: 32)
!24 = !DIEnumerator(name: "G_OPTION_FLAG_NOALIAS", value: 64)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 205, size: 32, align: 32, elements: !26)
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "G_OPTION_ERROR_UNKNOWN_OPTION", value: 0)
!28 = !DIEnumerator(name: "G_OPTION_ERROR_BAD_VALUE", value: 1)
!29 = !DIEnumerator(name: "G_OPTION_ERROR_FAILED", value: 2)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 69, size: 32, align: 32, elements: !32)
!31 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/open-vm-tools/line1352")
!32 = !{!33, !34, !35, !36}
!33 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!34 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!35 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!36 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 77, size: 32, align: 32, elements: !38)
!38 = !{!39, !40, !41}
!39 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!40 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!41 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 31, size: 32, align: 32, elements: !44)
!43 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1352")
!44 = !{!45, !46, !47, !48, !49, !50}
!45 = !DIEnumerator(name: "G_IO_IN", value: 1)
!46 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!47 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!48 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!49 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!50 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 84, size: 32, align: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61}
!53 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!54 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!55 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!56 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!57 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!58 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!59 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!60 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!61 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!62 = !{!63, !64, !84, !82}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "NamespaceOptionsState", file: !66, line: 59, baseType: !67)
!66 = !DIFile(filename: "namespacetool.c", directory: "/home/lichi/Desktop/open-vm-tools/line1352")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NamespaceOptionsState", file: !66, line: 50, size: 448, align: 64, elements: !68)
!68 = !{!69, !74, !75, !76, !77, !78, !79, !83}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "cmdName", scope: !67, file: !66, line: 51, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !72, line: 46, baseType: !73)
!72 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1352")
!73 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "nsName", scope: !67, file: !66, line: 52, baseType: !70, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "keyName", scope: !67, file: !66, line: 53, baseType: !70, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "valueToSet", scope: !67, file: !66, line: 54, baseType: !70, size: 64, align: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "oldValueToSet", scope: !67, file: !66, line: 55, baseType: !70, size: 64, align: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "getValueFromFile", scope: !67, file: !66, line: 56, baseType: !70, size: 64, align: 64, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "verboseLogFlag", scope: !67, file: !66, line: 57, baseType: !80, size: 32, align: 32, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !72, line: 50, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !72, line: 49, baseType: !82)
!82 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "standardInput", scope: !67, file: !66, line: 58, baseType: !80, size: 32, align: 32, offset: 416)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!85 = !{!86}
!86 = distinct !DIGlobalVariable(name: "gAppName", scope: !0, file: !66, line: 61, type: !70, isLocal: true, isDefinition: true, variable: i8** @gAppName)
!87 = !{i32 2, !"Dwarf Version", i32 4}
!88 = !{i32 2, !"Debug Info Version", i32 3}
!89 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!90 = distinct !DISubprogram(name: "main", scope: !66, file: !66, line: 581, type: !91, isLocal: false, isDefinition: true, scopeLine: 582, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!91 = !DISubroutineType(types: !92)
!92 = !{!82, !82, !93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!94 = !{}
!95 = !DILocalVariable(name: "argc", arg: 1, scope: !90, file: !66, line: 581, type: !82)
!96 = !DIExpression()
!97 = !DILocation(line: 581, column: 10, scope: !90)
!98 = !DILocalVariable(name: "argv", arg: 2, scope: !90, file: !66, line: 581, type: !93)
!99 = !DILocation(line: 581, column: 22, scope: !90)
!100 = !DILocalVariable(name: "success", scope: !90, file: !66, line: 583, type: !82)
!101 = !DILocation(line: 583, column: 8, scope: !90)
!102 = !DILocalVariable(name: "gErr", scope: !90, file: !66, line: 584, type: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !105, line: 42, baseType: !106)
!105 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/open-vm-tools/line1352")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !105, line: 44, size: 128, align: 64, elements: !107)
!107 = !{!108, !114, !115}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !106, file: !105, line: 46, baseType: !109, size: 32, align: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !110, line: 36, baseType: !111)
!110 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/open-vm-tools/line1352")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !112, line: 45, baseType: !113)
!112 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line1352")
!113 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !106, file: !105, line: 47, baseType: !81, size: 32, align: 32, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !106, file: !105, line: 48, baseType: !70, size: 64, align: 64, offset: 64)
!116 = !DILocation(line: 584, column: 12, scope: !90)
!117 = !DILocalVariable(name: "descriptionBuf", scope: !90, file: !66, line: 585, type: !70)
!118 = !DILocation(line: 585, column: 11, scope: !90)
!119 = !DILocalVariable(name: "helpBuf", scope: !90, file: !66, line: 586, type: !70)
!120 = !DILocation(line: 586, column: 11, scope: !90)
!121 = !DILocalVariable(name: "optCtx", scope: !90, file: !66, line: 587, type: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOptionContext", file: !4, line: 38, baseType: !124)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GOptionContext", file: !4, line: 38, flags: DIFlagFwdDecl)
!125 = !DILocation(line: 587, column: 20, scope: !90)
!126 = !DILocalVariable(name: "gr", scope: !90, file: !66, line: 588, type: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOptionGroup", file: !4, line: 51, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GOptionGroup", file: !4, line: 51, flags: DIFlagFwdDecl)
!130 = !DILocation(line: 588, column: 18, scope: !90)
!131 = !DILocalVariable(name: "summary", scope: !90, file: !66, line: 589, type: !70)
!132 = !DILocation(line: 589, column: 11, scope: !90)
!133 = !DILocalVariable(name: "nsOptions", scope: !90, file: !66, line: 590, type: !65)
!134 = !DILocation(line: 590, column: 26, scope: !90)
!135 = !DILocalVariable(name: "mainEntry", scope: !90, file: !66, line: 595, type: !136)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 768, align: 64, elements: !151)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOptionEntry", file: !4, line: 52, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GOptionEntry", file: !4, line: 257, size: 384, align: 64, elements: !139)
!139 = !{!140, !143, !144, !145, !147, !149, !150}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !138, file: !4, line: 259, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "short_name", scope: !138, file: !4, line: 260, baseType: !71, size: 8, align: 8, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !138, file: !4, line: 261, baseType: !81, size: 32, align: 32, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !138, file: !4, line: 263, baseType: !146, size: 32, align: 32, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOptionArg", file: !4, line: 129, baseType: !3)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "arg_data", scope: !138, file: !4, line: 264, baseType: !148, size: 64, align: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !72, line: 77, baseType: !63)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !138, file: !4, line: 266, baseType: !141, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "arg_description", scope: !138, file: !4, line: 267, baseType: !141, size: 64, align: 64, offset: 320)
!151 = !{!152}
!152 = !DISubrange(count: 2)
!153 = !DILocation(line: 595, column: 17, scope: !90)
!154 = !DILocation(line: 595, column: 31, scope: !90)
!155 = !DILocation(line: 596, column: 7, scope: !90)
!156 = !DILocation(line: 596, column: 58, scope: !90)
!157 = !DILocation(line: 596, column: 47, scope: !90)
!158 = !DILocalVariable(name: "getValuesEntry", scope: !90, file: !66, line: 600, type: !136)
!159 = !DILocation(line: 600, column: 17, scope: !90)
!160 = !DILocation(line: 600, column: 36, scope: !90)
!161 = !DILocation(line: 601, column: 7, scope: !90)
!162 = !DILocation(line: 601, column: 76, scope: !90)
!163 = !DILocation(line: 601, column: 65, scope: !90)
!164 = !DILocalVariable(name: "setKeysEntry", scope: !90, file: !66, line: 605, type: !165)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 2304, align: 64, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 6)
!168 = !DILocation(line: 605, column: 17, scope: !90)
!169 = !DILocation(line: 605, column: 34, scope: !90)
!170 = !DILocation(line: 606, column: 7, scope: !90)
!171 = !DILocation(line: 607, column: 21, scope: !90)
!172 = !DILocation(line: 607, column: 10, scope: !90)
!173 = !DILocation(line: 608, column: 7, scope: !90)
!174 = !DILocation(line: 608, column: 58, scope: !90)
!175 = !DILocation(line: 608, column: 47, scope: !90)
!176 = !DILocation(line: 610, column: 7, scope: !90)
!177 = !DILocation(line: 610, column: 61, scope: !90)
!178 = !DILocation(line: 610, column: 50, scope: !90)
!179 = !DILocation(line: 613, column: 7, scope: !90)
!180 = !DILocation(line: 613, column: 61, scope: !90)
!181 = !DILocation(line: 613, column: 50, scope: !90)
!182 = !DILocation(line: 615, column: 7, scope: !90)
!183 = !DILocation(line: 615, column: 56, scope: !90)
!184 = !DILocation(line: 615, column: 45, scope: !90)
!185 = !DILocalVariable(name: "deleteKeyEntry", scope: !90, file: !66, line: 619, type: !186)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 1152, align: 64, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 3)
!189 = !DILocation(line: 619, column: 17, scope: !90)
!190 = !DILocation(line: 619, column: 36, scope: !90)
!191 = !DILocation(line: 620, column: 7, scope: !90)
!192 = !DILocation(line: 621, column: 21, scope: !90)
!193 = !DILocation(line: 621, column: 10, scope: !90)
!194 = !DILocation(line: 622, column: 7, scope: !90)
!195 = !DILocation(line: 623, column: 21, scope: !90)
!196 = !DILocation(line: 623, column: 10, scope: !90)
!197 = !DILocation(line: 629, column: 35, scope: !90)
!198 = !DILocation(line: 629, column: 15, scope: !90)
!199 = !DILocation(line: 629, column: 13, scope: !90)
!200 = !DILocation(line: 630, column: 18, scope: !90)
!201 = !DILocation(line: 630, column: 4, scope: !90)
!202 = !DILocation(line: 632, column: 13, scope: !90)
!203 = !DILocation(line: 632, column: 11, scope: !90)
!204 = !DILocation(line: 635, column: 58, scope: !90)
!205 = !DILocation(line: 635, column: 9, scope: !90)
!206 = !DILocation(line: 635, column: 7, scope: !90)
!207 = !DILocation(line: 636, column: 31, scope: !90)
!208 = !DILocation(line: 636, column: 35, scope: !90)
!209 = !DILocation(line: 636, column: 4, scope: !90)
!210 = !DILocation(line: 637, column: 36, scope: !90)
!211 = !DILocation(line: 637, column: 44, scope: !90)
!212 = !DILocation(line: 637, column: 4, scope: !90)
!213 = !DILocation(line: 646, column: 49, scope: !90)
!214 = !DILocation(line: 647, column: 31, scope: !90)
!215 = !DILocation(line: 647, column: 41, scope: !90)
!216 = !DILocation(line: 647, column: 51, scope: !90)
!217 = !DILocation(line: 647, column: 61, scope: !90)
!218 = !DILocation(line: 639, column: 14, scope: !90)
!219 = !DILocation(line: 639, column: 12, scope: !90)
!220 = !DILocation(line: 648, column: 33, scope: !90)
!221 = !DILocation(line: 648, column: 41, scope: !90)
!222 = !DILocation(line: 648, column: 4, scope: !90)
!223 = !DILocation(line: 650, column: 8, scope: !224)
!224 = distinct !DILexicalBlock(scope: !90, file: !66, line: 650, column: 8)
!225 = !DILocation(line: 650, column: 13, scope: !224)
!226 = !DILocation(line: 650, column: 8, scope: !90)
!227 = !DILocation(line: 651, column: 36, scope: !228)
!228 = distinct !DILexicalBlock(scope: !224, file: !66, line: 650, column: 18)
!229 = !DILocation(line: 651, column: 27, scope: !228)
!230 = !DILocation(line: 651, column: 17, scope: !228)
!231 = !DILocation(line: 651, column: 25, scope: !228)
!232 = !DILocation(line: 652, column: 4, scope: !228)
!233 = !DILocation(line: 653, column: 8, scope: !234)
!234 = distinct !DILexicalBlock(scope: !90, file: !66, line: 653, column: 8)
!235 = !DILocation(line: 653, column: 13, scope: !234)
!236 = !DILocation(line: 653, column: 8, scope: !90)
!237 = !DILocation(line: 654, column: 35, scope: !238)
!238 = distinct !DILexicalBlock(scope: !234, file: !66, line: 653, column: 18)
!239 = !DILocation(line: 654, column: 26, scope: !238)
!240 = !DILocation(line: 654, column: 17, scope: !238)
!241 = !DILocation(line: 654, column: 24, scope: !238)
!242 = !DILocation(line: 655, column: 4, scope: !238)
!243 = !DILocation(line: 657, column: 55, scope: !90)
!244 = !DILocation(line: 657, column: 21, scope: !90)
!245 = !DILocation(line: 657, column: 19, scope: !90)
!246 = !DILocation(line: 659, column: 14, scope: !90)
!247 = !DILocation(line: 659, column: 12, scope: !90)
!248 = !DILocation(line: 661, column: 41, scope: !90)
!249 = !DILocation(line: 662, column: 28, scope: !90)
!250 = !DILocation(line: 662, column: 37, scope: !90)
!251 = !DILocation(line: 661, column: 9, scope: !90)
!252 = !DILocation(line: 661, column: 7, scope: !90)
!253 = !DILocation(line: 663, column: 11, scope: !90)
!254 = !DILocation(line: 663, column: 4, scope: !90)
!255 = !DILocation(line: 664, column: 11, scope: !90)
!256 = !DILocation(line: 664, column: 4, scope: !90)
!257 = !DILocation(line: 665, column: 31, scope: !90)
!258 = !DILocation(line: 665, column: 35, scope: !90)
!259 = !DILocation(line: 665, column: 4, scope: !90)
!260 = !DILocation(line: 666, column: 31, scope: !90)
!261 = !DILocation(line: 666, column: 39, scope: !90)
!262 = !DILocation(line: 666, column: 4, scope: !90)
!263 = !DILocation(line: 667, column: 35, scope: !90)
!264 = !DILocation(line: 667, column: 4, scope: !90)
!265 = !DILocation(line: 672, column: 38, scope: !90)
!266 = !DILocation(line: 670, column: 21, scope: !90)
!267 = !DILocation(line: 670, column: 19, scope: !90)
!268 = !DILocation(line: 673, column: 14, scope: !90)
!269 = !DILocation(line: 673, column: 12, scope: !90)
!270 = !DILocation(line: 676, column: 39, scope: !90)
!271 = !DILocation(line: 676, column: 55, scope: !90)
!272 = !DILocation(line: 677, column: 28, scope: !90)
!273 = !DILocation(line: 676, column: 9, scope: !90)
!274 = !DILocation(line: 676, column: 7, scope: !90)
!275 = !DILocation(line: 678, column: 11, scope: !90)
!276 = !DILocation(line: 678, column: 4, scope: !90)
!277 = !DILocation(line: 679, column: 11, scope: !90)
!278 = !DILocation(line: 679, column: 4, scope: !90)
!279 = !DILocation(line: 680, column: 31, scope: !90)
!280 = !DILocation(line: 680, column: 35, scope: !90)
!281 = !DILocation(line: 680, column: 4, scope: !90)
!282 = !DILocation(line: 681, column: 31, scope: !90)
!283 = !DILocation(line: 681, column: 39, scope: !90)
!284 = !DILocation(line: 681, column: 4, scope: !90)
!285 = !DILocation(line: 682, column: 35, scope: !90)
!286 = !DILocation(line: 682, column: 4, scope: !90)
!287 = !DILocation(line: 686, column: 37, scope: !90)
!288 = !DILocation(line: 685, column: 21, scope: !90)
!289 = !DILocation(line: 685, column: 19, scope: !90)
!290 = !DILocation(line: 687, column: 14, scope: !90)
!291 = !DILocation(line: 687, column: 12, scope: !90)
!292 = !DILocation(line: 690, column: 42, scope: !90)
!293 = !DILocation(line: 690, column: 58, scope: !90)
!294 = !DILocation(line: 691, column: 28, scope: !90)
!295 = !DILocation(line: 690, column: 9, scope: !90)
!296 = !DILocation(line: 690, column: 7, scope: !90)
!297 = !DILocation(line: 692, column: 11, scope: !90)
!298 = !DILocation(line: 692, column: 4, scope: !90)
!299 = !DILocation(line: 693, column: 11, scope: !90)
!300 = !DILocation(line: 693, column: 4, scope: !90)
!301 = !DILocation(line: 694, column: 31, scope: !90)
!302 = !DILocation(line: 694, column: 35, scope: !90)
!303 = !DILocation(line: 694, column: 4, scope: !90)
!304 = !DILocation(line: 695, column: 31, scope: !90)
!305 = !DILocation(line: 695, column: 39, scope: !90)
!306 = !DILocation(line: 695, column: 4, scope: !90)
!307 = !DILocation(line: 696, column: 35, scope: !90)
!308 = !DILocation(line: 696, column: 4, scope: !90)
!309 = !DILocation(line: 698, column: 32, scope: !310)
!310 = distinct !DILexicalBlock(scope: !90, file: !66, line: 698, column: 8)
!311 = !DILocation(line: 698, column: 9, scope: !310)
!312 = !DILocation(line: 698, column: 8, scope: !90)
!313 = !DILocation(line: 699, column: 18, scope: !314)
!314 = distinct !DILexicalBlock(scope: !310, file: !66, line: 698, column: 62)
!315 = !DILocation(line: 699, column: 7, scope: !314)
!316 = !DILocation(line: 700, column: 14, scope: !314)
!317 = !DILocation(line: 700, column: 34, scope: !314)
!318 = !DILocation(line: 700, column: 45, scope: !314)
!319 = !DILocation(line: 700, column: 50, scope: !314)
!320 = !DILocation(line: 700, column: 60, scope: !321)
!321 = !DILexicalBlockFile(scope: !314, file: !66, discriminator: 1)
!322 = !DILocation(line: 700, column: 66, scope: !321)
!323 = !DILocation(line: 700, column: 45, scope: !321)
!324 = !DILocation(line: 700, column: 45, scope: !325)
!325 = !DILexicalBlockFile(scope: !314, file: !66, discriminator: 2)
!326 = !DILocation(line: 700, column: 45, scope: !327)
!327 = !DILexicalBlockFile(scope: !314, file: !66, discriminator: 3)
!328 = !DILocation(line: 700, column: 7, scope: !327)
!329 = !DILocation(line: 701, column: 20, scope: !314)
!330 = !DILocation(line: 701, column: 7, scope: !314)
!331 = !DILocation(line: 702, column: 7, scope: !314)
!332 = !DILocation(line: 705, column: 18, scope: !333)
!333 = distinct !DILexicalBlock(scope: !90, file: !66, line: 705, column: 8)
!334 = !DILocation(line: 705, column: 8, scope: !333)
!335 = !DILocation(line: 705, column: 8, scope: !90)
!336 = !DILocation(line: 706, column: 32, scope: !337)
!337 = distinct !DILexicalBlock(scope: !333, file: !66, line: 705, column: 34)
!338 = !DILocation(line: 706, column: 7, scope: !337)
!339 = !DILocation(line: 707, column: 4, scope: !337)
!340 = !DILocation(line: 713, column: 8, scope: !341)
!341 = distinct !DILexicalBlock(scope: !90, file: !66, line: 713, column: 8)
!342 = !DILocation(line: 713, column: 13, scope: !341)
!343 = !DILocation(line: 713, column: 17, scope: !341)
!344 = !DILocation(line: 713, column: 49, scope: !345)
!345 = !DILexicalBlockFile(scope: !341, file: !66, discriminator: 1)
!346 = !DILocation(line: 713, column: 20, scope: !345)
!347 = !DILocation(line: 713, column: 58, scope: !345)
!348 = !DILocation(line: 713, column: 8, scope: !345)
!349 = !DILocation(line: 714, column: 7, scope: !350)
!350 = distinct !DILexicalBlock(scope: !341, file: !66, line: 713, column: 66)
!351 = !DILocation(line: 717, column: 14, scope: !90)
!352 = !DILocation(line: 717, column: 12, scope: !90)
!353 = !DILocation(line: 717, column: 4, scope: !90)
!354 = !DILocation(line: 720, column: 26, scope: !90)
!355 = !DILocation(line: 720, column: 4, scope: !90)
!356 = !DILocation(line: 721, column: 11, scope: !90)
!357 = !DILocation(line: 721, column: 4, scope: !90)
!358 = !DILocation(line: 722, column: 11, scope: !90)
!359 = !DILocation(line: 722, column: 4, scope: !90)
!360 = !DILocation(line: 723, column: 11, scope: !90)
!361 = !DILocation(line: 723, column: 4, scope: !90)
!362 = distinct !DISubprogram(name: "PostVerifyGetValueOptions", scope: !66, file: !66, line: 434, type: !363, isLocal: true, isDefinition: true, scopeLine: 436, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!363 = !DISubroutineType(types: !364)
!364 = !{!80, !122, !127, !148, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!366 = !DILocalVariable(name: "context", arg: 1, scope: !362, file: !66, line: 434, type: !122)
!367 = !DILocation(line: 434, column: 43, scope: !362)
!368 = !DILocalVariable(name: "group", arg: 2, scope: !362, file: !66, line: 434, type: !127)
!369 = !DILocation(line: 434, column: 66, scope: !362)
!370 = !DILocalVariable(name: "data", arg: 3, scope: !362, file: !66, line: 435, type: !148)
!371 = !DILocation(line: 435, column: 36, scope: !362)
!372 = !DILocalVariable(name: "error", arg: 4, scope: !362, file: !66, line: 435, type: !365)
!373 = !DILocation(line: 435, column: 51, scope: !362)
!374 = !DILocalVariable(name: "nsOptions", scope: !362, file: !66, line: 437, type: !64)
!375 = !DILocation(line: 437, column: 27, scope: !362)
!376 = !DILocation(line: 439, column: 42, scope: !362)
!377 = !DILocation(line: 439, column: 16, scope: !362)
!378 = !DILocation(line: 439, column: 14, scope: !362)
!379 = !DILocation(line: 440, column: 8, scope: !380)
!380 = distinct !DILexicalBlock(scope: !362, file: !66, line: 440, column: 8)
!381 = !DILocation(line: 440, column: 19, scope: !380)
!382 = !DILocation(line: 440, column: 27, scope: !380)
!383 = !DILocation(line: 440, column: 8, scope: !362)
!384 = !DILocation(line: 441, column: 19, scope: !385)
!385 = distinct !DILexicalBlock(scope: !380, file: !66, line: 440, column: 35)
!386 = !DILocation(line: 441, column: 27, scope: !385)
!387 = !DILocation(line: 441, column: 7, scope: !388)
!388 = !DILexicalBlockFile(scope: !385, file: !66, discriminator: 1)
!389 = !DILocation(line: 443, column: 7, scope: !385)
!390 = !DILocation(line: 445, column: 8, scope: !391)
!391 = distinct !DILexicalBlock(scope: !362, file: !66, line: 445, column: 8)
!392 = !DILocation(line: 445, column: 19, scope: !391)
!393 = !DILocation(line: 445, column: 26, scope: !391)
!394 = !DILocation(line: 445, column: 8, scope: !362)
!395 = !DILocation(line: 446, column: 19, scope: !396)
!396 = distinct !DILexicalBlock(scope: !391, file: !66, line: 445, column: 34)
!397 = !DILocation(line: 446, column: 27, scope: !396)
!398 = !DILocation(line: 446, column: 7, scope: !399)
!399 = !DILexicalBlockFile(scope: !396, file: !66, discriminator: 1)
!400 = !DILocation(line: 448, column: 7, scope: !396)
!401 = !DILocation(line: 450, column: 18, scope: !402)
!402 = distinct !DILexicalBlock(scope: !362, file: !66, line: 450, column: 8)
!403 = !DILocation(line: 450, column: 29, scope: !402)
!404 = !DILocation(line: 450, column: 8, scope: !402)
!405 = !DILocation(line: 450, column: 51, scope: !402)
!406 = !DILocation(line: 450, column: 8, scope: !362)
!407 = !DILocation(line: 451, column: 11, scope: !408)
!408 = distinct !DILexicalBlock(scope: !409, file: !66, line: 451, column: 11)
!409 = distinct !DILexicalBlock(scope: !402, file: !66, line: 450, column: 57)
!410 = !DILocation(line: 451, column: 22, scope: !408)
!411 = !DILocation(line: 451, column: 30, scope: !408)
!412 = !DILocation(line: 451, column: 11, scope: !409)
!413 = !DILocation(line: 452, column: 22, scope: !414)
!414 = distinct !DILexicalBlock(scope: !408, file: !66, line: 451, column: 38)
!415 = !DILocation(line: 452, column: 30, scope: !414)
!416 = !DILocation(line: 452, column: 10, scope: !417)
!417 = !DILexicalBlockFile(scope: !414, file: !66, discriminator: 1)
!418 = !DILocation(line: 454, column: 10, scope: !414)
!419 = !DILocation(line: 456, column: 4, scope: !409)
!420 = !DILocation(line: 457, column: 4, scope: !362)
!421 = !DILocation(line: 458, column: 1, scope: !362)
!422 = distinct !DISubprogram(name: "PostVerifySetKeyOptions", scope: !66, file: !66, line: 525, type: !363, isLocal: true, isDefinition: true, scopeLine: 527, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!423 = !DILocalVariable(name: "context", arg: 1, scope: !422, file: !66, line: 525, type: !122)
!424 = !DILocation(line: 525, column: 41, scope: !422)
!425 = !DILocalVariable(name: "group", arg: 2, scope: !422, file: !66, line: 525, type: !127)
!426 = !DILocation(line: 525, column: 64, scope: !422)
!427 = !DILocalVariable(name: "data", arg: 3, scope: !422, file: !66, line: 526, type: !148)
!428 = !DILocation(line: 526, column: 34, scope: !422)
!429 = !DILocalVariable(name: "error", arg: 4, scope: !422, file: !66, line: 526, type: !365)
!430 = !DILocation(line: 526, column: 49, scope: !422)
!431 = !DILocalVariable(name: "usedOptions", scope: !422, file: !66, line: 528, type: !82)
!432 = !DILocation(line: 528, column: 8, scope: !422)
!433 = !DILocalVariable(name: "nsOptions", scope: !422, file: !66, line: 529, type: !64)
!434 = !DILocation(line: 529, column: 27, scope: !422)
!435 = !DILocation(line: 531, column: 42, scope: !422)
!436 = !DILocation(line: 531, column: 16, scope: !422)
!437 = !DILocation(line: 531, column: 14, scope: !422)
!438 = !DILocation(line: 533, column: 8, scope: !439)
!439 = distinct !DILexicalBlock(scope: !422, file: !66, line: 533, column: 8)
!440 = !DILocation(line: 533, column: 19, scope: !439)
!441 = !DILocation(line: 533, column: 27, scope: !439)
!442 = !DILocation(line: 533, column: 8, scope: !422)
!443 = !DILocation(line: 534, column: 19, scope: !444)
!444 = distinct !DILexicalBlock(scope: !439, file: !66, line: 533, column: 35)
!445 = !DILocation(line: 534, column: 27, scope: !444)
!446 = !DILocation(line: 534, column: 7, scope: !447)
!447 = !DILexicalBlockFile(scope: !444, file: !66, discriminator: 1)
!448 = !DILocation(line: 536, column: 7, scope: !444)
!449 = !DILocation(line: 538, column: 8, scope: !450)
!450 = distinct !DILexicalBlock(scope: !422, file: !66, line: 538, column: 8)
!451 = !DILocation(line: 538, column: 19, scope: !450)
!452 = !DILocation(line: 538, column: 26, scope: !450)
!453 = !DILocation(line: 538, column: 8, scope: !422)
!454 = !DILocation(line: 539, column: 19, scope: !455)
!455 = distinct !DILexicalBlock(scope: !450, file: !66, line: 538, column: 34)
!456 = !DILocation(line: 539, column: 27, scope: !455)
!457 = !DILocation(line: 539, column: 7, scope: !458)
!458 = !DILexicalBlockFile(scope: !455, file: !66, discriminator: 1)
!459 = !DILocation(line: 541, column: 7, scope: !455)
!460 = !DILocation(line: 543, column: 18, scope: !461)
!461 = distinct !DILexicalBlock(scope: !422, file: !66, line: 543, column: 8)
!462 = !DILocation(line: 543, column: 29, scope: !461)
!463 = !DILocation(line: 543, column: 8, scope: !461)
!464 = !DILocation(line: 543, column: 49, scope: !461)
!465 = !DILocation(line: 543, column: 8, scope: !422)
!466 = !DILocation(line: 544, column: 11, scope: !467)
!467 = distinct !DILexicalBlock(scope: !468, file: !66, line: 544, column: 11)
!468 = distinct !DILexicalBlock(scope: !461, file: !66, line: 543, column: 55)
!469 = !DILocation(line: 544, column: 22, scope: !467)
!470 = !DILocation(line: 544, column: 30, scope: !467)
!471 = !DILocation(line: 544, column: 11, scope: !468)
!472 = !DILocation(line: 545, column: 22, scope: !473)
!473 = distinct !DILexicalBlock(scope: !467, file: !66, line: 544, column: 38)
!474 = !DILocation(line: 545, column: 30, scope: !473)
!475 = !DILocation(line: 545, column: 10, scope: !476)
!476 = !DILexicalBlockFile(scope: !473, file: !66, discriminator: 1)
!477 = !DILocation(line: 547, column: 10, scope: !473)
!478 = !DILocation(line: 549, column: 11, scope: !479)
!479 = distinct !DILexicalBlock(scope: !468, file: !66, line: 549, column: 11)
!480 = !DILocation(line: 549, column: 22, scope: !479)
!481 = !DILocation(line: 549, column: 33, scope: !479)
!482 = !DILocation(line: 549, column: 11, scope: !468)
!483 = !DILocation(line: 550, column: 10, scope: !484)
!484 = distinct !DILexicalBlock(scope: !479, file: !66, line: 549, column: 41)
!485 = !DILocation(line: 551, column: 7, scope: !484)
!486 = !DILocation(line: 552, column: 11, scope: !487)
!487 = distinct !DILexicalBlock(scope: !468, file: !66, line: 552, column: 11)
!488 = !DILocation(line: 552, column: 22, scope: !487)
!489 = !DILocation(line: 552, column: 39, scope: !487)
!490 = !DILocation(line: 552, column: 11, scope: !468)
!491 = !DILocation(line: 553, column: 10, scope: !492)
!492 = distinct !DILexicalBlock(scope: !487, file: !66, line: 552, column: 47)
!493 = !DILocation(line: 554, column: 7, scope: !492)
!494 = !DILocation(line: 555, column: 11, scope: !495)
!495 = distinct !DILexicalBlock(scope: !468, file: !66, line: 555, column: 11)
!496 = !DILocation(line: 555, column: 22, scope: !495)
!497 = !DILocation(line: 555, column: 36, scope: !495)
!498 = !DILocation(line: 555, column: 11, scope: !468)
!499 = !DILocation(line: 556, column: 10, scope: !500)
!500 = distinct !DILexicalBlock(scope: !495, file: !66, line: 555, column: 42)
!501 = !DILocation(line: 557, column: 7, scope: !500)
!502 = !DILocation(line: 558, column: 12, scope: !503)
!503 = distinct !DILexicalBlock(scope: !468, file: !66, line: 558, column: 11)
!504 = !DILocation(line: 558, column: 24, scope: !503)
!505 = !DILocation(line: 558, column: 29, scope: !503)
!506 = !DILocation(line: 558, column: 33, scope: !507)
!507 = !DILexicalBlockFile(scope: !503, file: !66, discriminator: 1)
!508 = !DILocation(line: 558, column: 45, scope: !507)
!509 = !DILocation(line: 558, column: 11, scope: !507)
!510 = !DILocation(line: 559, column: 22, scope: !511)
!511 = distinct !DILexicalBlock(scope: !503, file: !66, line: 558, column: 52)
!512 = !DILocation(line: 559, column: 30, scope: !511)
!513 = !DILocation(line: 559, column: 10, scope: !514)
!514 = !DILexicalBlockFile(scope: !511, file: !66, discriminator: 1)
!515 = !DILocation(line: 561, column: 10, scope: !511)
!516 = !DILocation(line: 563, column: 4, scope: !468)
!517 = !DILocation(line: 564, column: 4, scope: !422)
!518 = !DILocation(line: 565, column: 1, scope: !422)
!519 = distinct !DISubprogram(name: "PostVerifyDeleteKeyOptions", scope: !66, file: !66, line: 479, type: !363, isLocal: true, isDefinition: true, scopeLine: 481, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!520 = !DILocalVariable(name: "context", arg: 1, scope: !519, file: !66, line: 479, type: !122)
!521 = !DILocation(line: 479, column: 44, scope: !519)
!522 = !DILocalVariable(name: "group", arg: 2, scope: !519, file: !66, line: 479, type: !127)
!523 = !DILocation(line: 479, column: 67, scope: !519)
!524 = !DILocalVariable(name: "data", arg: 3, scope: !519, file: !66, line: 480, type: !148)
!525 = !DILocation(line: 480, column: 37, scope: !519)
!526 = !DILocalVariable(name: "error", arg: 4, scope: !519, file: !66, line: 480, type: !365)
!527 = !DILocation(line: 480, column: 52, scope: !519)
!528 = !DILocalVariable(name: "nsOptions", scope: !519, file: !66, line: 482, type: !64)
!529 = !DILocation(line: 482, column: 27, scope: !519)
!530 = !DILocation(line: 484, column: 42, scope: !519)
!531 = !DILocation(line: 484, column: 16, scope: !519)
!532 = !DILocation(line: 484, column: 14, scope: !519)
!533 = !DILocation(line: 486, column: 8, scope: !534)
!534 = distinct !DILexicalBlock(scope: !519, file: !66, line: 486, column: 8)
!535 = !DILocation(line: 486, column: 19, scope: !534)
!536 = !DILocation(line: 486, column: 27, scope: !534)
!537 = !DILocation(line: 486, column: 8, scope: !519)
!538 = !DILocation(line: 487, column: 19, scope: !539)
!539 = distinct !DILexicalBlock(scope: !534, file: !66, line: 486, column: 35)
!540 = !DILocation(line: 487, column: 27, scope: !539)
!541 = !DILocation(line: 487, column: 7, scope: !542)
!542 = !DILexicalBlockFile(scope: !539, file: !66, discriminator: 1)
!543 = !DILocation(line: 489, column: 7, scope: !539)
!544 = !DILocation(line: 491, column: 8, scope: !545)
!545 = distinct !DILexicalBlock(scope: !519, file: !66, line: 491, column: 8)
!546 = !DILocation(line: 491, column: 19, scope: !545)
!547 = !DILocation(line: 491, column: 26, scope: !545)
!548 = !DILocation(line: 491, column: 8, scope: !519)
!549 = !DILocation(line: 492, column: 19, scope: !550)
!550 = distinct !DILexicalBlock(scope: !545, file: !66, line: 491, column: 34)
!551 = !DILocation(line: 492, column: 27, scope: !550)
!552 = !DILocation(line: 492, column: 7, scope: !553)
!553 = !DILexicalBlockFile(scope: !550, file: !66, discriminator: 1)
!554 = !DILocation(line: 494, column: 7, scope: !550)
!555 = !DILocation(line: 496, column: 18, scope: !556)
!556 = distinct !DILexicalBlock(scope: !519, file: !66, line: 496, column: 8)
!557 = !DILocation(line: 496, column: 29, scope: !556)
!558 = !DILocation(line: 496, column: 8, scope: !556)
!559 = !DILocation(line: 496, column: 52, scope: !556)
!560 = !DILocation(line: 496, column: 8, scope: !519)
!561 = !DILocation(line: 497, column: 11, scope: !562)
!562 = distinct !DILexicalBlock(scope: !563, file: !66, line: 497, column: 11)
!563 = distinct !DILexicalBlock(scope: !556, file: !66, line: 496, column: 58)
!564 = !DILocation(line: 497, column: 22, scope: !562)
!565 = !DILocation(line: 497, column: 30, scope: !562)
!566 = !DILocation(line: 497, column: 11, scope: !563)
!567 = !DILocation(line: 498, column: 22, scope: !568)
!568 = distinct !DILexicalBlock(scope: !562, file: !66, line: 497, column: 38)
!569 = !DILocation(line: 498, column: 30, scope: !568)
!570 = !DILocation(line: 498, column: 10, scope: !571)
!571 = !DILexicalBlockFile(scope: !568, file: !66, discriminator: 1)
!572 = !DILocation(line: 500, column: 10, scope: !568)
!573 = !DILocation(line: 502, column: 4, scope: !563)
!574 = !DILocation(line: 503, column: 4, scope: !519)
!575 = !DILocation(line: 504, column: 1, scope: !519)
!576 = distinct !DISubprogram(name: "PrintUsage", scope: !66, file: !66, line: 74, type: !577, isLocal: true, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !122}
!579 = !DILocalVariable(name: "optCtx", arg: 1, scope: !576, file: !66, line: 74, type: !122)
!580 = !DILocation(line: 74, column: 28, scope: !576)
!581 = !DILocalVariable(name: "usage", scope: !576, file: !66, line: 76, type: !70)
!582 = !DILocation(line: 76, column: 11, scope: !576)
!583 = !DILocation(line: 78, column: 38, scope: !576)
!584 = !DILocation(line: 78, column: 12, scope: !576)
!585 = !DILocation(line: 78, column: 10, scope: !576)
!586 = !DILocation(line: 79, column: 21, scope: !576)
!587 = !DILocation(line: 79, column: 4, scope: !576)
!588 = !DILocation(line: 80, column: 11, scope: !576)
!589 = !DILocation(line: 80, column: 4, scope: !576)
!590 = !DILocation(line: 81, column: 1, scope: !576)
!591 = distinct !DISubprogram(name: "ValidateNSCommands", scope: !66, file: !66, line: 126, type: !592, isLocal: true, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!592 = !DISubroutineType(types: !593)
!593 = !{!80, !141}
!594 = !DILocalVariable(name: "cmdName", arg: 1, scope: !591, file: !66, line: 126, type: !141)
!595 = !DILocation(line: 126, column: 33, scope: !591)
!596 = !DILocation(line: 128, column: 19, scope: !597)
!597 = distinct !DILexicalBlock(scope: !591, file: !66, line: 128, column: 8)
!598 = !DILocation(line: 128, column: 9, scope: !597)
!599 = !DILocation(line: 128, column: 41, scope: !597)
!600 = !DILocation(line: 128, column: 47, scope: !597)
!601 = !DILocation(line: 129, column: 19, scope: !597)
!602 = !DILocation(line: 129, column: 9, scope: !597)
!603 = !DILocation(line: 129, column: 39, scope: !597)
!604 = !DILocation(line: 129, column: 45, scope: !597)
!605 = !DILocation(line: 130, column: 19, scope: !597)
!606 = !DILocation(line: 130, column: 9, scope: !597)
!607 = !DILocation(line: 130, column: 42, scope: !597)
!608 = !DILocation(line: 128, column: 8, scope: !609)
!609 = !DILexicalBlockFile(scope: !591, file: !66, discriminator: 1)
!610 = !DILocation(line: 131, column: 7, scope: !611)
!611 = distinct !DILexicalBlock(scope: !597, file: !66, line: 130, column: 49)
!612 = !DILocation(line: 133, column: 14, scope: !613)
!613 = distinct !DILexicalBlock(scope: !597, file: !66, line: 132, column: 11)
!614 = !DILocation(line: 133, column: 50, scope: !613)
!615 = !DILocation(line: 133, column: 7, scope: !613)
!616 = !DILocation(line: 134, column: 7, scope: !613)
!617 = !DILocation(line: 136, column: 1, scope: !591)
!618 = distinct !DISubprogram(name: "RunNamespaceCommand", scope: !66, file: !66, line: 296, type: !619, isLocal: true, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!619 = !DISubroutineType(types: !620)
!620 = !{!621, !64}
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !622, line: 230, baseType: !73)
!622 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1352")
!623 = !DILocalVariable(name: "nsOptions", arg: 1, scope: !618, file: !66, line: 296, type: !64)
!624 = !DILocation(line: 296, column: 44, scope: !618)
!625 = !DILocalVariable(name: "result", scope: !618, file: !66, line: 298, type: !84)
!626 = !DILocation(line: 298, column: 10, scope: !618)
!627 = !DILocalVariable(name: "resultLen", scope: !618, file: !66, line: 299, type: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !629, line: 216, baseType: !630)
!629 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1352")
!630 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!631 = !DILocation(line: 299, column: 11, scope: !618)
!632 = !DILocalVariable(name: "status", scope: !618, file: !66, line: 300, type: !621)
!633 = !DILocation(line: 300, column: 9, scope: !618)
!634 = !DILocalVariable(name: "opCode", scope: !618, file: !66, line: 301, type: !70)
!635 = !DILocation(line: 301, column: 11, scope: !618)
!636 = !DILocalVariable(name: "keyValueData", scope: !618, file: !66, line: 302, type: !70)
!637 = !DILocation(line: 302, column: 11, scope: !618)
!638 = !DILocalVariable(name: "keyValueLength", scope: !618, file: !66, line: 303, type: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !112, line: 66, baseType: !630)
!640 = !DILocation(line: 303, column: 10, scope: !618)
!641 = !DILocalVariable(name: "nscmd", scope: !618, file: !66, line: 305, type: !642)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!644 = !DILocation(line: 305, column: 16, scope: !618)
!645 = !DILocation(line: 305, column: 52, scope: !618)
!646 = !DILocation(line: 305, column: 63, scope: !618)
!647 = !DILocation(line: 305, column: 24, scope: !618)
!648 = !DILocalVariable(name: "buf", scope: !618, file: !66, line: 307, type: !649)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "DynBuf", file: !650, line: 40, baseType: !651)
!650 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dynbuf.h", directory: "/home/lichi/Desktop/open-vm-tools/line1352")
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynBuf", file: !650, line: 36, size: 192, align: 64, elements: !652)
!652 = !{!653, !654, !655}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !651, file: !650, line: 37, baseType: !84, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !651, file: !650, line: 38, baseType: !628, size: 64, align: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !651, file: !650, line: 39, baseType: !628, size: 64, align: 64, offset: 128)
!656 = !DILocation(line: 307, column: 11, scope: !618)
!657 = !DILocation(line: 309, column: 4, scope: !618)
!658 = !DILocation(line: 310, column: 29, scope: !659)
!659 = distinct !DILexicalBlock(scope: !618, file: !66, line: 310, column: 8)
!660 = !DILocation(line: 310, column: 43, scope: !659)
!661 = !DILocation(line: 310, column: 36, scope: !659)
!662 = !DILocation(line: 310, column: 9, scope: !663)
!663 = !DILexicalBlockFile(scope: !659, file: !66, discriminator: 2)
!664 = !DILocation(line: 310, column: 9, scope: !659)
!665 = !DILocation(line: 310, column: 51, scope: !659)
!666 = !DILocation(line: 311, column: 9, scope: !659)
!667 = !DILocation(line: 311, column: 37, scope: !659)
!668 = !DILocation(line: 312, column: 35, scope: !659)
!669 = !DILocation(line: 312, column: 46, scope: !659)
!670 = !DILocation(line: 312, column: 9, scope: !659)
!671 = !DILocation(line: 310, column: 8, scope: !672)
!672 = !DILexicalBlockFile(scope: !618, file: !66, discriminator: 1)
!673 = !DILocation(line: 313, column: 14, scope: !674)
!674 = distinct !DILexicalBlock(scope: !659, file: !66, line: 312, column: 55)
!675 = !DILocation(line: 313, column: 7, scope: !674)
!676 = !DILocation(line: 314, column: 7, scope: !674)
!677 = !DILocation(line: 316, column: 15, scope: !678)
!678 = distinct !DILexicalBlock(scope: !618, file: !66, line: 316, column: 8)
!679 = !DILocation(line: 316, column: 26, scope: !678)
!680 = !DILocation(line: 316, column: 8, scope: !678)
!681 = !DILocation(line: 316, column: 41, scope: !678)
!682 = !DILocation(line: 316, column: 8, scope: !618)
!683 = !DILocation(line: 317, column: 16, scope: !684)
!684 = distinct !DILexicalBlock(scope: !678, file: !66, line: 316, column: 47)
!685 = !DILocation(line: 317, column: 14, scope: !684)
!686 = !DILocation(line: 318, column: 4, scope: !684)
!687 = !DILocation(line: 319, column: 16, scope: !688)
!688 = distinct !DILexicalBlock(scope: !678, file: !66, line: 318, column: 11)
!689 = !DILocation(line: 319, column: 14, scope: !688)
!690 = !DILocation(line: 321, column: 18, scope: !691)
!691 = distinct !DILexicalBlock(scope: !618, file: !66, line: 321, column: 8)
!692 = !DILocation(line: 321, column: 29, scope: !691)
!693 = !DILocation(line: 321, column: 8, scope: !691)
!694 = !DILocation(line: 321, column: 51, scope: !691)
!695 = !DILocation(line: 321, column: 8, scope: !618)
!696 = !DILocation(line: 323, column: 38, scope: !697)
!697 = distinct !DILexicalBlock(scope: !698, file: !66, line: 323, column: 11)
!698 = distinct !DILexicalBlock(scope: !691, file: !66, line: 321, column: 57)
!699 = !DILocation(line: 323, column: 49, scope: !697)
!700 = !DILocation(line: 323, column: 12, scope: !697)
!701 = !DILocation(line: 323, column: 11, scope: !698)
!702 = !DILocation(line: 324, column: 17, scope: !703)
!703 = distinct !DILexicalBlock(scope: !697, file: !66, line: 323, column: 59)
!704 = !DILocation(line: 324, column: 10, scope: !703)
!705 = !DILocation(line: 325, column: 10, scope: !703)
!706 = !DILocation(line: 327, column: 4, scope: !698)
!707 = !DILocation(line: 327, column: 25, scope: !708)
!708 = !DILexicalBlockFile(scope: !709, file: !66, discriminator: 1)
!709 = distinct !DILexicalBlock(scope: !691, file: !66, line: 327, column: 15)
!710 = !DILocation(line: 327, column: 36, scope: !708)
!711 = !DILocation(line: 327, column: 15, scope: !708)
!712 = !DILocation(line: 327, column: 56, scope: !708)
!713 = !DILocation(line: 329, column: 12, scope: !714)
!714 = distinct !DILexicalBlock(scope: !715, file: !66, line: 329, column: 11)
!715 = distinct !DILexicalBlock(scope: !709, file: !66, line: 327, column: 62)
!716 = !DILocation(line: 329, column: 43, scope: !714)
!717 = !DILocation(line: 330, column: 38, scope: !714)
!718 = !DILocation(line: 330, column: 12, scope: !714)
!719 = !DILocation(line: 330, column: 45, scope: !714)
!720 = !DILocation(line: 331, column: 38, scope: !714)
!721 = !DILocation(line: 331, column: 49, scope: !714)
!722 = !DILocation(line: 331, column: 12, scope: !714)
!723 = !DILocation(line: 329, column: 11, scope: !724)
!724 = !DILexicalBlockFile(scope: !715, file: !66, discriminator: 1)
!725 = !DILocation(line: 332, column: 17, scope: !726)
!726 = distinct !DILexicalBlock(scope: !714, file: !66, line: 331, column: 59)
!727 = !DILocation(line: 332, column: 10, scope: !726)
!728 = !DILocation(line: 333, column: 10, scope: !726)
!729 = !DILocation(line: 335, column: 11, scope: !730)
!730 = distinct !DILexicalBlock(scope: !715, file: !66, line: 335, column: 11)
!731 = !DILocation(line: 335, column: 22, scope: !730)
!732 = !DILocation(line: 335, column: 39, scope: !730)
!733 = !DILocation(line: 335, column: 11, scope: !715)
!734 = !DILocation(line: 336, column: 14, scope: !735)
!735 = distinct !DILexicalBlock(scope: !736, file: !66, line: 336, column: 14)
!736 = distinct !DILexicalBlock(scope: !730, file: !66, line: 335, column: 47)
!737 = !DILocation(line: 336, column: 25, scope: !735)
!738 = !DILocation(line: 336, column: 36, scope: !735)
!739 = !DILocation(line: 336, column: 14, scope: !736)
!740 = !DILocation(line: 337, column: 24, scope: !741)
!741 = distinct !DILexicalBlock(scope: !742, file: !66, line: 337, column: 17)
!742 = distinct !DILexicalBlock(scope: !735, file: !66, line: 336, column: 44)
!743 = !DILocation(line: 337, column: 35, scope: !741)
!744 = !DILocation(line: 337, column: 17, scope: !741)
!745 = !DILocation(line: 337, column: 47, scope: !741)
!746 = !DILocation(line: 337, column: 17, scope: !742)
!747 = !DILocation(line: 338, column: 23, scope: !748)
!748 = distinct !DILexicalBlock(scope: !741, file: !66, line: 337, column: 53)
!749 = !DILocation(line: 338, column: 68, scope: !748)
!750 = !DILocation(line: 338, column: 16, scope: !748)
!751 = !DILocation(line: 339, column: 16, scope: !748)
!752 = !DILocation(line: 341, column: 44, scope: !753)
!753 = distinct !DILexicalBlock(scope: !742, file: !66, line: 341, column: 17)
!754 = !DILocation(line: 341, column: 55, scope: !753)
!755 = !DILocation(line: 341, column: 18, scope: !753)
!756 = !DILocation(line: 341, column: 67, scope: !753)
!757 = !DILocation(line: 342, column: 44, scope: !753)
!758 = !DILocation(line: 342, column: 55, scope: !753)
!759 = !DILocation(line: 342, column: 18, scope: !753)
!760 = !DILocation(line: 341, column: 17, scope: !761)
!761 = !DILexicalBlockFile(scope: !742, file: !66, discriminator: 1)
!762 = !DILocation(line: 343, column: 23, scope: !763)
!763 = distinct !DILexicalBlock(scope: !753, file: !66, line: 342, column: 71)
!764 = !DILocation(line: 343, column: 16, scope: !763)
!765 = !DILocation(line: 344, column: 16, scope: !763)
!766 = !DILocation(line: 346, column: 10, scope: !742)
!767 = !DILocation(line: 347, column: 17, scope: !768)
!768 = distinct !DILexicalBlock(scope: !769, file: !66, line: 347, column: 17)
!769 = distinct !DILexicalBlock(scope: !735, file: !66, line: 346, column: 17)
!770 = !DILocation(line: 347, column: 67, scope: !768)
!771 = !DILocation(line: 347, column: 17, scope: !769)
!772 = !DILocation(line: 348, column: 16, scope: !773)
!773 = distinct !DILexicalBlock(scope: !768, file: !66, line: 347, column: 75)
!774 = !DILocation(line: 350, column: 38, scope: !775)
!775 = distinct !DILexicalBlock(scope: !769, file: !66, line: 350, column: 17)
!776 = !DILocation(line: 350, column: 52, scope: !775)
!777 = !DILocation(line: 350, column: 67, scope: !775)
!778 = !DILocation(line: 350, column: 18, scope: !775)
!779 = !DILocation(line: 350, column: 72, scope: !775)
!780 = !DILocation(line: 351, column: 44, scope: !775)
!781 = !DILocation(line: 351, column: 55, scope: !775)
!782 = !DILocation(line: 351, column: 18, scope: !775)
!783 = !DILocation(line: 350, column: 17, scope: !784)
!784 = !DILexicalBlockFile(scope: !769, file: !66, discriminator: 1)
!785 = !DILocation(line: 352, column: 23, scope: !786)
!786 = distinct !DILexicalBlock(scope: !775, file: !66, line: 351, column: 71)
!787 = !DILocation(line: 352, column: 16, scope: !786)
!788 = !DILocation(line: 353, column: 16, scope: !786)
!789 = !DILocation(line: 356, column: 7, scope: !736)
!790 = !DILocation(line: 357, column: 31, scope: !791)
!791 = distinct !DILexicalBlock(scope: !792, file: !66, line: 357, column: 14)
!792 = distinct !DILexicalBlock(scope: !730, file: !66, line: 356, column: 14)
!793 = !DILocation(line: 357, column: 42, scope: !791)
!794 = !DILocation(line: 357, column: 14, scope: !791)
!795 = !DILocation(line: 358, column: 63, scope: !791)
!796 = !DILocation(line: 357, column: 14, scope: !792)
!797 = !DILocation(line: 359, column: 13, scope: !798)
!798 = distinct !DILexicalBlock(scope: !791, file: !66, line: 358, column: 71)
!799 = !DILocation(line: 361, column: 35, scope: !800)
!800 = distinct !DILexicalBlock(scope: !792, file: !66, line: 361, column: 14)
!801 = !DILocation(line: 361, column: 49, scope: !800)
!802 = !DILocation(line: 361, column: 64, scope: !800)
!803 = !DILocation(line: 361, column: 15, scope: !800)
!804 = !DILocation(line: 361, column: 69, scope: !800)
!805 = !DILocation(line: 362, column: 41, scope: !800)
!806 = !DILocation(line: 362, column: 52, scope: !800)
!807 = !DILocation(line: 362, column: 15, scope: !800)
!808 = !DILocation(line: 361, column: 14, scope: !809)
!809 = !DILexicalBlockFile(scope: !792, file: !66, discriminator: 1)
!810 = !DILocation(line: 363, column: 20, scope: !811)
!811 = distinct !DILexicalBlock(scope: !800, file: !66, line: 362, column: 68)
!812 = !DILocation(line: 363, column: 13, scope: !811)
!813 = !DILocation(line: 364, column: 13, scope: !811)
!814 = !DILocation(line: 367, column: 4, scope: !715)
!815 = !DILocation(line: 367, column: 25, scope: !816)
!816 = !DILexicalBlockFile(scope: !817, file: !66, discriminator: 1)
!817 = distinct !DILexicalBlock(scope: !709, file: !66, line: 367, column: 15)
!818 = !DILocation(line: 367, column: 36, scope: !816)
!819 = !DILocation(line: 367, column: 15, scope: !816)
!820 = !DILocation(line: 367, column: 59, scope: !816)
!821 = !DILocation(line: 369, column: 12, scope: !822)
!822 = distinct !DILexicalBlock(scope: !823, file: !66, line: 369, column: 11)
!823 = distinct !DILexicalBlock(scope: !817, file: !66, line: 367, column: 65)
!824 = !DILocation(line: 369, column: 43, scope: !822)
!825 = !DILocation(line: 370, column: 38, scope: !822)
!826 = !DILocation(line: 370, column: 12, scope: !822)
!827 = !DILocation(line: 370, column: 46, scope: !822)
!828 = !DILocation(line: 371, column: 38, scope: !822)
!829 = !DILocation(line: 371, column: 49, scope: !822)
!830 = !DILocation(line: 371, column: 12, scope: !822)
!831 = !DILocation(line: 371, column: 58, scope: !822)
!832 = !DILocation(line: 372, column: 12, scope: !822)
!833 = !DILocation(line: 372, column: 42, scope: !822)
!834 = !DILocation(line: 373, column: 38, scope: !822)
!835 = !DILocation(line: 373, column: 49, scope: !822)
!836 = !DILocation(line: 373, column: 12, scope: !822)
!837 = !DILocation(line: 369, column: 11, scope: !838)
!838 = !DILexicalBlockFile(scope: !823, file: !66, discriminator: 1)
!839 = !DILocation(line: 374, column: 17, scope: !840)
!840 = distinct !DILexicalBlock(scope: !822, file: !66, line: 373, column: 65)
!841 = !DILocation(line: 374, column: 10, scope: !840)
!842 = !DILocation(line: 375, column: 10, scope: !840)
!843 = !DILocation(line: 377, column: 4, scope: !823)
!844 = !DILocation(line: 379, column: 8, scope: !845)
!845 = distinct !DILexicalBlock(scope: !618, file: !66, line: 379, column: 8)
!846 = !DILocation(line: 379, column: 19, scope: !845)
!847 = !DILocation(line: 379, column: 8, scope: !618)
!848 = !DILocation(line: 380, column: 28, scope: !849)
!849 = distinct !DILexicalBlock(scope: !845, file: !66, line: 379, column: 35)
!850 = !DILocation(line: 380, column: 46, scope: !851)
!851 = !DILexicalBlockFile(scope: !849, file: !66, discriminator: 1)
!852 = !DILocation(line: 380, column: 7, scope: !853)
!853 = !DILexicalBlockFile(scope: !849, file: !66, discriminator: 2)
!854 = !DILocation(line: 381, column: 4, scope: !849)
!855 = !DILocation(line: 383, column: 35, scope: !618)
!856 = !DILocation(line: 384, column: 35, scope: !618)
!857 = !DILocation(line: 383, column: 13, scope: !672)
!858 = !DILocation(line: 383, column: 13, scope: !618)
!859 = !DILocation(line: 383, column: 11, scope: !618)
!860 = !DILocation(line: 385, column: 9, scope: !861)
!861 = distinct !DILexicalBlock(scope: !618, file: !66, line: 385, column: 8)
!862 = !DILocation(line: 385, column: 8, scope: !618)
!863 = !DILocation(line: 386, column: 14, scope: !864)
!864 = distinct !DILexicalBlock(scope: !861, file: !66, line: 385, column: 17)
!865 = !DILocation(line: 387, column: 13, scope: !864)
!866 = !DILocation(line: 387, column: 20, scope: !864)
!867 = !DILocation(line: 387, column: 24, scope: !868)
!868 = !DILexicalBlockFile(scope: !864, file: !66, discriminator: 1)
!869 = !DILocation(line: 387, column: 23, scope: !868)
!870 = !DILocation(line: 387, column: 13, scope: !868)
!871 = !DILocation(line: 387, column: 33, scope: !872)
!872 = !DILexicalBlockFile(scope: !864, file: !66, discriminator: 2)
!873 = !DILocation(line: 387, column: 13, scope: !872)
!874 = !DILocation(line: 387, column: 13, scope: !875)
!875 = !DILexicalBlockFile(scope: !864, file: !66, discriminator: 3)
!876 = !DILocation(line: 387, column: 13, scope: !877)
!877 = !DILexicalBlockFile(scope: !864, file: !66, discriminator: 4)
!878 = !DILocation(line: 386, column: 7, scope: !868)
!879 = !DILocation(line: 388, column: 4, scope: !864)
!880 = !DILocalVariable(name: "p", scope: !881, file: !66, line: 389, type: !84)
!881 = distinct !DILexicalBlock(scope: !861, file: !66, line: 388, column: 11)
!882 = !DILocation(line: 389, column: 13, scope: !881)
!883 = !DILocation(line: 389, column: 17, scope: !881)
!884 = !DILocation(line: 390, column: 11, scope: !885)
!885 = distinct !DILexicalBlock(scope: !881, file: !66, line: 390, column: 11)
!886 = !DILocation(line: 390, column: 21, scope: !885)
!887 = !DILocation(line: 390, column: 11, scope: !881)
!888 = !DILocation(line: 391, column: 14, scope: !889)
!889 = distinct !DILexicalBlock(scope: !890, file: !66, line: 391, column: 14)
!890 = distinct !DILexicalBlock(scope: !885, file: !66, line: 390, column: 27)
!891 = !DILocation(line: 391, column: 25, scope: !889)
!892 = !DILocation(line: 391, column: 14, scope: !890)
!893 = !DILocation(line: 392, column: 13, scope: !894)
!894 = distinct !DILexicalBlock(scope: !889, file: !66, line: 391, column: 41)
!895 = !DILocation(line: 393, column: 10, scope: !894)
!896 = !DILocation(line: 394, column: 7, scope: !890)
!897 = !DILocation(line: 395, column: 14, scope: !898)
!898 = distinct !DILexicalBlock(scope: !899, file: !66, line: 395, column: 14)
!899 = distinct !DILexicalBlock(scope: !885, file: !66, line: 394, column: 14)
!900 = !DILocation(line: 395, column: 25, scope: !898)
!901 = !DILocation(line: 395, column: 14, scope: !899)
!902 = !DILocation(line: 396, column: 13, scope: !903)
!903 = distinct !DILexicalBlock(scope: !898, file: !66, line: 395, column: 41)
!904 = !DILocation(line: 397, column: 10, scope: !903)
!905 = !DILocation(line: 398, column: 10, scope: !899)
!906 = !DILocation(line: 398, column: 17, scope: !907)
!907 = !DILexicalBlockFile(scope: !899, file: !66, discriminator: 1)
!908 = !DILocation(line: 398, column: 21, scope: !907)
!909 = !DILocation(line: 398, column: 30, scope: !907)
!910 = !DILocation(line: 398, column: 28, scope: !907)
!911 = !DILocation(line: 398, column: 19, scope: !907)
!912 = !DILocation(line: 398, column: 10, scope: !907)
!913 = !DILocation(line: 399, column: 26, scope: !914)
!914 = distinct !DILexicalBlock(scope: !899, file: !66, line: 398, column: 41)
!915 = !DILocation(line: 399, column: 13, scope: !914)
!916 = !DILocation(line: 400, column: 25, scope: !914)
!917 = !DILocation(line: 400, column: 18, scope: !914)
!918 = !DILocation(line: 400, column: 28, scope: !914)
!919 = !DILocation(line: 400, column: 15, scope: !914)
!920 = !DILocation(line: 398, column: 10, scope: !921)
!921 = !DILexicalBlockFile(scope: !899, file: !66, discriminator: 2)
!922 = distinct !{!922, !905}
!923 = !DILocation(line: 403, column: 13, scope: !881)
!924 = !DILocation(line: 403, column: 7, scope: !881)
!925 = !DILocation(line: 405, column: 10, scope: !618)
!926 = !DILocation(line: 405, column: 4, scope: !618)
!927 = !DILocation(line: 408, column: 4, scope: !618)
!928 = !DILocation(line: 409, column: 10, scope: !618)
!929 = !DILocation(line: 409, column: 4, scope: !618)
!930 = !DILocation(line: 410, column: 11, scope: !618)
!931 = !DILocation(line: 410, column: 4, scope: !618)
!932 = !DILocation(line: 411, column: 11, scope: !618)
!933 = !DILocation(line: 411, column: 4, scope: !618)
!934 = !DILocation(line: 412, column: 11, scope: !618)
!935 = !DILocation(line: 412, column: 4, scope: !618)
!936 = distinct !DISubprogram(name: "GetInternalNamespaceCommand", scope: !66, file: !66, line: 98, type: !937, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!937 = !DISubroutineType(types: !938)
!938 = !{!84, !141}
!939 = !DILocalVariable(name: "cmd", arg: 1, scope: !936, file: !66, line: 98, type: !141)
!940 = !DILocation(line: 98, column: 42, scope: !936)
!941 = !DILocation(line: 100, column: 18, scope: !942)
!942 = distinct !DILexicalBlock(scope: !936, file: !66, line: 100, column: 8)
!943 = !DILocation(line: 100, column: 8, scope: !942)
!944 = !DILocation(line: 100, column: 36, scope: !942)
!945 = !DILocation(line: 100, column: 8, scope: !936)
!946 = !DILocation(line: 101, column: 7, scope: !947)
!947 = distinct !DILexicalBlock(scope: !942, file: !66, line: 100, column: 42)
!948 = !DILocation(line: 102, column: 25, scope: !949)
!949 = distinct !DILexicalBlock(scope: !942, file: !66, line: 102, column: 15)
!950 = !DILocation(line: 102, column: 15, scope: !949)
!951 = !DILocation(line: 102, column: 41, scope: !949)
!952 = !DILocation(line: 102, column: 15, scope: !942)
!953 = !DILocation(line: 103, column: 7, scope: !954)
!954 = distinct !DILexicalBlock(scope: !949, file: !66, line: 102, column: 47)
!955 = !DILocation(line: 104, column: 25, scope: !956)
!956 = distinct !DILexicalBlock(scope: !949, file: !66, line: 104, column: 15)
!957 = !DILocation(line: 104, column: 15, scope: !956)
!958 = !DILocation(line: 104, column: 44, scope: !956)
!959 = !DILocation(line: 104, column: 15, scope: !949)
!960 = !DILocation(line: 105, column: 7, scope: !961)
!961 = distinct !DILexicalBlock(scope: !956, file: !66, line: 104, column: 50)
!962 = !DILocation(line: 107, column: 7, scope: !963)
!963 = distinct !DILexicalBlock(scope: !956, file: !66, line: 106, column: 11)
!964 = !DILocation(line: 109, column: 1, scope: !936)
!965 = distinct !DISubprogram(name: "DynBuf_AppendString", scope: !650, file: !650, line: 267, type: !966, isLocal: true, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!966 = !DISubroutineType(types: !967)
!967 = !{!621, !968, !642}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64, align: 64)
!969 = !DILocalVariable(name: "buf", arg: 1, scope: !965, file: !650, line: 267, type: !968)
!970 = !DILocation(line: 267, column: 29, scope: !965)
!971 = !DILocalVariable(name: "string", arg: 2, scope: !965, file: !650, line: 268, type: !642)
!972 = !DILocation(line: 268, column: 33, scope: !965)
!973 = !DILocation(line: 270, column: 25, scope: !965)
!974 = !DILocation(line: 270, column: 30, scope: !965)
!975 = !DILocation(line: 270, column: 45, scope: !965)
!976 = !DILocation(line: 270, column: 38, scope: !965)
!977 = !DILocation(line: 270, column: 53, scope: !965)
!978 = !DILocation(line: 270, column: 11, scope: !979)
!979 = !DILexicalBlockFile(scope: !965, file: !650, discriminator: 1)
!980 = !DILocation(line: 270, column: 4, scope: !965)
!981 = distinct !DISubprogram(name: "GetValueFromStdin", scope: !66, file: !66, line: 197, type: !982, isLocal: true, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !94)
!982 = !DISubroutineType(types: !983)
!983 = !{!621, !984, !985}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64, align: 64)
!986 = !DILocalVariable(name: "data", arg: 1, scope: !981, file: !66, line: 197, type: !984)
!987 = !DILocation(line: 197, column: 27, scope: !981)
!988 = !DILocalVariable(name: "length", arg: 2, scope: !981, file: !66, line: 197, type: !985)
!989 = !DILocation(line: 197, column: 40, scope: !981)
!990 = !DILocalVariable(name: "gErr", scope: !981, file: !66, line: 199, type: !103)
!991 = !DILocation(line: 199, column: 12, scope: !981)
!992 = !DILocalVariable(name: "status", scope: !981, file: !66, line: 200, type: !993)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !31, line: 75, baseType: !30)
!994 = !DILocation(line: 200, column: 14, scope: !981)
!995 = !DILocalVariable(name: "iochannel", scope: !981, file: !66, line: 201, type: !996)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !31, line: 41, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !31, line: 97, size: 896, align: 64, elements: !999)
!999 = !{!1000, !1001, !1121, !1122, !1127, !1128, !1129, !1130, !1131, !1140, !1141, !1142, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !998, file: !31, line: 100, baseType: !81, size: 32, align: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !998, file: !31, line: 101, baseType: !1002, size: 64, align: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !31, line: 42, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !31, line: 131, size: 512, align: 64, elements: !1005)
!1005 = !{!1006, !1010, !1014, !1021, !1025, !1108, !1112, !1117}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !1004, file: !31, line: 133, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!993, !996, !70, !639, !985, !365}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !1004, file: !31, line: 138, baseType: !1011, size: 64, align: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!993, !996, !141, !639, !985, !365}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !1004, file: !31, line: 143, baseType: !1015, size: 64, align: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!993, !996, !1018, !1020, !365}
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !112, line: 51, baseType: !1019)
!1019 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !31, line: 82, baseType: !37)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !1004, file: !31, line: 147, baseType: !1022, size: 64, align: 64, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!993, !996, !365}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !1004, file: !31, line: 149, baseType: !1026, size: 64, align: 64, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!1029, !996, !1107}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !43, line: 64, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !43, line: 171, size: 768, align: 64, elements: !1032)
!1032 = !{!1033, !1034, !1054, !1083, !1085, !1089, !1090, !1091, !1092, !1100, !1101, !1102, !1103}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !1031, file: !43, line: 174, baseType: !148, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !1031, file: !43, line: 175, baseType: !1035, size: 64, align: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !43, line: 77, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !43, line: 196, size: 192, align: 64, elements: !1038)
!1038 = !{!1039, !1043, !1044}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1037, file: !43, line: 198, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{null, !148}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !1037, file: !43, line: 199, baseType: !1040, size: 64, align: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !1037, file: !43, line: 200, baseType: !1045, size: 64, align: 64, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{null, !148, !1029, !1048, !1053}
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !43, line: 155, baseType: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!80, !148}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !1031, file: !43, line: 177, baseType: !1055, size: 64, align: 64, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1057)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !43, line: 130, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !43, line: 214, size: 384, align: 64, elements: !1059)
!1059 = !{!1060, !1065, !1069, !1073, !1077, !1078}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !1058, file: !43, line: 216, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!80, !1029, !1064}
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !1058, file: !43, line: 218, baseType: !1066, size: 64, align: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!80, !1029}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !1058, file: !43, line: 219, baseType: !1070, size: 64, align: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!80, !1029, !1049, !148}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !1058, file: !43, line: 222, baseType: !1074, size: 64, align: 64, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{null, !1029}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !1058, file: !43, line: 226, baseType: !1049, size: 64, align: 64, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !1058, file: !43, line: 227, baseType: !1079, size: 64, align: 64, offset: 320)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !43, line: 212, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{null}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !1031, file: !43, line: 178, baseType: !1084, size: 32, align: 32, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !72, line: 55, baseType: !113)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1031, file: !43, line: 180, baseType: !1086, size: 64, align: 64, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !43, line: 48, baseType: !1088)
!1088 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !43, line: 48, flags: DIFlagFwdDecl)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !1031, file: !43, line: 182, baseType: !81, size: 32, align: 32, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1031, file: !43, line: 183, baseType: !1084, size: 32, align: 32, offset: 352)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !1031, file: !43, line: 184, baseType: !1084, size: 32, align: 32, offset: 384)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !1031, file: !43, line: 186, baseType: !1093, size: 64, align: 64, offset: 448)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !1095, line: 37, baseType: !1096)
!1095 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line1352")
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !1095, line: 39, size: 128, align: 64, elements: !1097)
!1097 = !{!1098, !1099}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1096, file: !1095, line: 41, baseType: !148, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1096, file: !1095, line: 42, baseType: !1093, size: 64, align: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1031, file: !43, line: 188, baseType: !1029, size: 64, align: 64, offset: 512)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1031, file: !43, line: 189, baseType: !1029, size: 64, align: 64, offset: 576)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1031, file: !43, line: 191, baseType: !84, size: 64, align: 64, offset: 640)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !1031, file: !43, line: 193, baseType: !1104, size: 64, align: 64, offset: 704)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !43, line: 65, baseType: !1106)
!1106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !43, line: 65, flags: DIFlagFwdDecl)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !43, line: 39, baseType: !42)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !1004, file: !31, line: 151, baseType: !1109, size: 64, align: 64, offset: 320)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{null, !996}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !1004, file: !31, line: 152, baseType: !1113, size: 64, align: 64, offset: 384)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!993, !996, !1116, !365}
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !31, line: 95, baseType: !51)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !1004, file: !31, line: 155, baseType: !1118, size: 64, align: 64, offset: 448)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!1116, !996}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !998, file: !31, line: 103, baseType: !70, size: 64, align: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !998, file: !31, line: 104, baseType: !1123, size: 64, align: 64, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !1124, line: 77, baseType: !1125)
!1124 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/open-vm-tools/line1352")
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !1124, line: 77, flags: DIFlagFwdDecl)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !998, file: !31, line: 105, baseType: !1123, size: 64, align: 64, offset: 256)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !998, file: !31, line: 106, baseType: !70, size: 64, align: 64, offset: 320)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !998, file: !31, line: 107, baseType: !1084, size: 32, align: 32, offset: 384)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !998, file: !31, line: 109, baseType: !639, size: 64, align: 64, offset: 448)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !998, file: !31, line: 110, baseType: !1132, size: 64, align: 64, offset: 512)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !1134, line: 39, baseType: !1135)
!1134 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/open-vm-tools/line1352")
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !1134, line: 41, size: 192, align: 64, elements: !1136)
!1136 = !{!1137, !1138, !1139}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1135, file: !1134, line: 43, baseType: !70, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1135, file: !1134, line: 44, baseType: !639, size: 64, align: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !1135, file: !1134, line: 45, baseType: !639, size: 64, align: 64, offset: 128)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !998, file: !31, line: 111, baseType: !1132, size: 64, align: 64, offset: 576)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !998, file: !31, line: 112, baseType: !1132, size: 64, align: 64, offset: 640)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !998, file: !31, line: 113, baseType: !1143, size: 48, align: 8, offset: 704)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 48, align: 8, elements: !166)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !998, file: !31, line: 117, baseType: !1084, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !998, file: !31, line: 118, baseType: !1084, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !998, file: !31, line: 119, baseType: !1084, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !998, file: !31, line: 120, baseType: !1084, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !998, file: !31, line: 121, baseType: !1084, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !998, file: !31, line: 122, baseType: !1084, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !998, file: !31, line: 124, baseType: !148, size: 64, align: 64, offset: 768)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !998, file: !31, line: 125, baseType: !148, size: 64, align: 64, offset: 832)
!1152 = !DILocation(line: 201, column: 16, scope: !981)
!1153 = !DILocalVariable(name: "retVal", scope: !981, file: !66, line: 202, type: !621)
!1154 = !DILocation(line: 202, column: 9, scope: !981)
!1155 = !DILocation(line: 206, column: 16, scope: !981)
!1156 = !DILocation(line: 206, column: 14, scope: !981)
!1157 = !DILocation(line: 211, column: 38, scope: !981)
!1158 = !DILocation(line: 211, column: 49, scope: !981)
!1159 = !DILocation(line: 211, column: 55, scope: !981)
!1160 = !DILocation(line: 211, column: 13, scope: !981)
!1161 = !DILocation(line: 211, column: 11, scope: !981)
!1162 = !DILocation(line: 213, column: 8, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !981, file: !66, line: 213, column: 8)
!1164 = !DILocation(line: 213, column: 15, scope: !1163)
!1165 = !DILocation(line: 213, column: 8, scope: !981)
!1166 = !DILocation(line: 214, column: 14, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1163, file: !66, line: 213, column: 38)
!1168 = !DILocation(line: 215, column: 15, scope: !1167)
!1169 = !DILocation(line: 215, column: 25, scope: !1167)
!1170 = !DILocation(line: 215, column: 34, scope: !1167)
!1171 = !DILocation(line: 215, column: 39, scope: !1167)
!1172 = !DILocation(line: 215, column: 48, scope: !1173)
!1173 = !DILexicalBlockFile(scope: !1167, file: !66, discriminator: 1)
!1174 = !DILocation(line: 215, column: 54, scope: !1173)
!1175 = !DILocation(line: 215, column: 34, scope: !1173)
!1176 = !DILocation(line: 215, column: 34, scope: !1177)
!1177 = !DILexicalBlockFile(scope: !1167, file: !66, discriminator: 2)
!1178 = !DILocation(line: 215, column: 34, scope: !1179)
!1179 = !DILexicalBlockFile(scope: !1167, file: !66, discriminator: 3)
!1180 = !DILocation(line: 214, column: 7, scope: !1173)
!1181 = !DILocation(line: 216, column: 14, scope: !1167)
!1182 = !DILocation(line: 217, column: 4, scope: !1167)
!1183 = !DILocation(line: 218, column: 12, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1185, file: !66, line: 218, column: 11)
!1185 = distinct !DILexicalBlock(scope: !1163, file: !66, line: 217, column: 11)
!1186 = !DILocation(line: 218, column: 11, scope: !1184)
!1187 = !DILocation(line: 218, column: 19, scope: !1184)
!1188 = !DILocation(line: 218, column: 11, scope: !1185)
!1189 = !DILocation(line: 219, column: 17, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1184, file: !66, line: 218, column: 34)
!1191 = !DILocation(line: 220, column: 17, scope: !1190)
!1192 = !DILocation(line: 221, column: 16, scope: !1190)
!1193 = !DILocation(line: 220, column: 10, scope: !1190)
!1194 = !DILocation(line: 222, column: 7, scope: !1190)
!1195 = !DILocation(line: 222, column: 19, scope: !1196)
!1196 = !DILexicalBlockFile(scope: !1197, file: !66, discriminator: 1)
!1197 = distinct !DILexicalBlock(scope: !1184, file: !66, line: 222, column: 18)
!1198 = !DILocation(line: 222, column: 18, scope: !1196)
!1199 = !DILocation(line: 222, column: 26, scope: !1196)
!1200 = !DILocation(line: 223, column: 17, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1197, file: !66, line: 222, column: 32)
!1202 = !DILocation(line: 224, column: 17, scope: !1201)
!1203 = !DILocation(line: 224, column: 63, scope: !1201)
!1204 = !DILocation(line: 224, column: 10, scope: !1201)
!1205 = !DILocation(line: 225, column: 7, scope: !1201)
!1206 = !DILocation(line: 227, column: 8, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !981, file: !66, line: 227, column: 8)
!1208 = !DILocation(line: 227, column: 15, scope: !1207)
!1209 = !DILocation(line: 227, column: 8, scope: !981)
!1210 = !DILocation(line: 228, column: 15, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1207, file: !66, line: 227, column: 23)
!1212 = !DILocation(line: 228, column: 14, scope: !1211)
!1213 = !DILocation(line: 228, column: 7, scope: !1211)
!1214 = !DILocation(line: 229, column: 8, scope: !1211)
