; ModuleID = './asyncSocketBase.o.i'
source_filename = "./asyncSocketBase.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Atomic_uint32 = type { i32 }
%struct.AsyncSocket = type { i32, i32, %struct.AsyncSocketPollParams, i32, i8, i8, void (i32, %struct.AsyncSocket*, i8*)*, i8*, i8*, i32, i32, void (i8*, i32, %struct.AsyncSocket*, i8*)*, i8*, i8, %struct.AsyncSocketVTable* }
%struct.AsyncSocketPollParams = type { i32, %struct.MXUserRecLock*, %struct.PollClassSet, %struct.IVmdbPoll* }
%struct.MXUserRecLock = type opaque
%struct.PollClassSet = type { i64 }
%struct.IVmdbPoll = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !26, globals: !28)
!1 = !DIFile(filename: "asyncSocketBase.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line57")
!2 = !{!3, !11, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AsyncSocketState", file: !4, line: 184, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/asyncsocket.h", directory: "/home/lichi/Desktop/open-vm-tools/line57")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "AsyncSocketListening", value: 0)
!7 = !DIEnumerator(name: "AsyncSocketConnecting", value: 1)
!8 = !DIEnumerator(name: "AsyncSocketConnected", value: 2)
!9 = !DIEnumerator(name: "AsyncSocketCBCancelled", value: 3)
!10 = !DIEnumerator(name: "AsyncSocketClosed", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 303, size: 32, align: 32, elements: !12)
!12 = !{!13, !14}
!13 = !DIEnumerator(name: "ASYNC_SOCKET_OPTS_LAYER_BASE", value: 1001)
!14 = !DIEnumerator(name: "ASYNC_SOCKET_OPTS_LAYER_BLAST_PROXY", value: 1002)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PollClass", file: !16, line: 103, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/poll.h", directory: "/home/lichi/Desktop/open-vm-tools/line57")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25}
!18 = !DIEnumerator(name: "POLL_CLASS_MAIN", value: 0)
!19 = !DIEnumerator(name: "POLL_CLASS_PAUSE", value: 1)
!20 = !DIEnumerator(name: "POLL_CLASS_IPC", value: 2)
!21 = !DIEnumerator(name: "POLL_CLASS_CPT", value: 3)
!22 = !DIEnumerator(name: "POLL_CLASS_MKS", value: 4)
!23 = !DIEnumerator(name: "POLL_FIXED_CLASSES", value: 5)
!24 = !DIEnumerator(name: "POLL_DEFAULT_FIXED_CLASSES", value: 6)
!25 = !DIEnumerator(name: "POLL_MAX_CLASSES", value: 31)
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!28 = !{!29}
!29 = distinct !DIGlobalVariable(name: "nextid", scope: !30, file: !31, line: 321, type: !261, isLocal: true, isDefinition: true, variable: %struct.Atomic_uint32* @AsyncSocketInitSocket.nextid)
!30 = distinct !DISubprogram(name: "AsyncSocketInitSocket", scope: !31, file: !31, line: 313, type: !32, isLocal: false, isDefinition: true, scopeLine: 316, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !260)
!31 = !DIFile(filename: "asyncSocketBase.c", directory: "/home/lichi/Desktop/open-vm-tools/line57")
!32 = !DISubroutineType(types: !33)
!33 = !{null, !34, !259, !90}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocket", file: !4, line: 155, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AsyncSocket", file: !37, line: 47, size: 896, align: 64, elements: !38)
!37 = !DIFile(filename: "asyncSocketBase.h", directory: "/home/lichi/Desktop/open-vm-tools/line57")
!38 = !{!39, !45, !46, !67, !69, !72, !73, !78, !79, !80, !81, !82, !87, !88, !89}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !36, file: !37, line: 48, baseType: !40, size: 32, align: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !41, line: 173, baseType: !42)
!41 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line57")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !43, line: 51, baseType: !44)
!43 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line57")
!44 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", scope: !36, file: !37, line: 49, baseType: !40, size: 32, align: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "pollParams", scope: !36, file: !37, line: 50, baseType: !47, size: 256, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketPollParams", file: !4, line: 174, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AsyncSocketPollParams", file: !4, line: 169, size: 256, align: 64, elements: !49)
!49 = !{!50, !52, !57, !64}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !48, file: !4, line: 170, baseType: !51, size: 32, align: 32)
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !48, file: !4, line: 171, baseType: !53, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserRecLock", file: !55, line: 39, baseType: !56)
!55 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/userlock.h", directory: "/home/lichi/Desktop/open-vm-tools/line57")
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserRecLock", file: !55, line: 39, flags: DIFlagFwdDecl)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "pollClass", scope: !48, file: !4, line: 172, baseType: !58, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "PollClassSet", file: !16, line: 128, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PollClassSet", file: !16, line: 126, size: 64, align: 64, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !59, file: !16, line: 127, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !43, line: 122, baseType: !63)
!63 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "iPoll", scope: !48, file: !4, line: 173, baseType: !65, size: 64, align: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "IVmdbPoll", file: !4, line: 168, flags: DIFlagFwdDecl)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !36, file: !37, line: 51, baseType: !68, size: 32, align: 32, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketState", file: !4, line: 190, baseType: !3)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "inited", scope: !36, file: !37, line: 53, baseType: !70, size: 8, align: 8, offset: 352)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !41, line: 230, baseType: !71)
!71 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "errorSeen", scope: !36, file: !37, line: 54, baseType: !70, size: 8, align: 8, offset: 360)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "errorFn", scope: !36, file: !37, line: 55, baseType: !74, size: 64, align: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketErrorFn", file: !4, line: 401, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !51, !34, !27}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "errorClientData", scope: !36, file: !37, line: 56, baseType: !27, size: 64, align: 64, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "recvBuf", scope: !36, file: !37, line: 58, baseType: !27, size: 64, align: 64, offset: 512)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "recvPos", scope: !36, file: !37, line: 59, baseType: !51, size: 32, align: 32, offset: 576)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "recvLen", scope: !36, file: !37, line: 60, baseType: !51, size: 32, align: 32, offset: 608)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "recvFn", scope: !36, file: !37, line: 61, baseType: !83, size: 64, align: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketRecvFn", file: !4, line: 389, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !27, !51, !34, !27}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "recvClientData", scope: !36, file: !37, line: 62, baseType: !27, size: 64, align: 64, offset: 704)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "recvFireOnPartial", scope: !36, file: !37, line: 63, baseType: !70, size: 8, align: 8, offset: 768)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "vt", scope: !36, file: !37, line: 65, baseType: !90, size: 64, align: 64, offset: 832)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketVTable", file: !93, line: 138, baseType: !94)
!93 = !DIFile(filename: "asyncSocketVTable.h", directory: "/home/lichi/Desktop/open-vm-tools/line57")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AsyncSocketVTable", file: !93, line: 52, size: 2432, align: 64, elements: !95)
!95 = !{!96, !100, !112, !117, !121, !122, !129, !135, !139, !147, !153, !161, !165, !170, !174, !178, !182, !183, !188, !189, !204, !205, !211, !212, !217, !218, !219, !223, !224, !231, !235, !239, !243, !244, !245, !249, !250, !255}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "getState", scope: !94, file: !93, line: 53, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!68, !34}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "setOption", scope: !94, file: !93, line: 63, baseType: !101, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!51, !34, !104, !105, !106, !108}
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketOpts_Layer", file: !4, line: 319, baseType: !11)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketOpts_ID", file: !4, line: 284, baseType: !51)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !109, line: 33, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/open-vm-tools/line57")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !111, line: 189, baseType: !44)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line57")
!112 = !DIDerivedType(tag: DW_TAG_member, name: "getOption", scope: !94, file: !93, line: 75, baseType: !113, size: 64, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!51, !34, !104, !105, !27, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "getGenericErrno", scope: !94, file: !93, line: 81, baseType: !118, size: 64, align: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!51, !34}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "getFd", scope: !94, file: !93, line: 82, baseType: !118, size: 64, align: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "getRemoteIPStr", scope: !94, file: !93, line: 83, baseType: !123, size: 64, align: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!51, !34, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "getINETIPStr", scope: !94, file: !93, line: 84, baseType: !130, size: 64, align: 64, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!51, !34, !51, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "getPort", scope: !94, file: !93, line: 85, baseType: !136, size: 64, align: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!44, !34}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "setCloseOptions", scope: !94, file: !93, line: 86, baseType: !140, size: 64, align: 64, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!51, !34, !51, !143}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketCloseFn", file: !4, line: 410, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !34, !27}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "connectSSL", scope: !94, file: !93, line: 88, baseType: !148, size: 64, align: 64, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!70, !34, !151, !27}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SSLVerifyParam", file: !4, line: 150, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "startSslConnect", scope: !94, file: !93, line: 90, baseType: !154, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!51, !34, !151, !27, !157, !27}
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketSslConnectFn", file: !4, line: 408, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !70, !34, !27}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "acceptSSL", scope: !94, file: !93, line: 94, baseType: !162, size: 64, align: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!70, !34, !27}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "startSslAccept", scope: !94, file: !93, line: 95, baseType: !166, size: 64, align: 64, offset: 768)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!51, !34, !27, !169, !27}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketSslAcceptFn", file: !4, line: 406, baseType: !158)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !94, file: !93, line: 98, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!51, !34, !51}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !94, file: !93, line: 99, baseType: !175, size: 64, align: 64, offset: 896)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!51, !34, !27, !51, !70, !27, !27}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "recvPassedFd", scope: !94, file: !93, line: 101, baseType: !179, size: 64, align: 64, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!51, !34, !27, !51, !27, !27}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "getReceivedFd", scope: !94, file: !93, line: 103, baseType: !118, size: 64, align: 64, offset: 1024)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !94, file: !93, line: 104, baseType: !184, size: 64, align: 64, offset: 1088)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!51, !34, !27, !51, !187, !27}
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketSendFn", file: !4, line: 395, baseType: !84)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "isSendBufferFull", scope: !94, file: !93, line: 106, baseType: !118, size: 64, align: 64, offset: 1152)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "getNetworkStats", scope: !94, file: !93, line: 107, baseType: !190, size: 64, align: 64, offset: 1216)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!51, !34, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketNetworkStats", file: !4, line: 200, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AsyncSocketNetworkStats", file: !4, line: 193, size: 256, align: 64, elements: !196)
!196 = !{!197, !198, !199, !200, !201, !202}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "cwndBytes", scope: !195, file: !4, line: 194, baseType: !40, size: 32, align: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "rttSmoothedAvgMillis", scope: !195, file: !4, line: 195, baseType: !40, size: 32, align: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "rttSmoothedVarMillis", scope: !195, file: !4, line: 196, baseType: !40, size: 32, align: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "queuedBytes", scope: !195, file: !4, line: 197, baseType: !40, size: 32, align: 32, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "inflightBytes", scope: !195, file: !4, line: 198, baseType: !40, size: 32, align: 32, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "packetLossPercent", scope: !195, file: !4, line: 199, baseType: !203, size: 64, align: 64, offset: 192)
!203 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !94, file: !93, line: 109, baseType: !118, size: 64, align: 64, offset: 1280)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "cancelRecv", scope: !94, file: !93, line: 110, baseType: !206, size: 64, align: 64, offset: 1344)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!51, !34, !209, !210, !210, !70}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "cancelCbForClose", scope: !94, file: !93, line: 112, baseType: !118, size: 64, align: 64, offset: 1408)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "getLocalVMCIAddress", scope: !94, file: !93, line: 113, baseType: !213, size: 64, align: 64, offset: 1472)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!51, !34, !216, !216}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "getRemoteVMCIAddress", scope: !94, file: !93, line: 114, baseType: !213, size: 64, align: 64, offset: 1536)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "getWebSocketError", scope: !94, file: !93, line: 115, baseType: !118, size: 64, align: 64, offset: 1600)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "getWebSocketURI", scope: !94, file: !93, line: 116, baseType: !220, size: 64, align: 64, offset: 1664)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!134, !34}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "getWebSocketCookie", scope: !94, file: !93, line: 117, baseType: !220, size: 64, align: 64, offset: 1728)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "getWebSocketCloseStatus", scope: !94, file: !93, line: 118, baseType: !225, size: 64, align: 64, offset: 1792)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !34}
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !41, line: 175, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !43, line: 49, baseType: !230)
!230 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "getWebSocketProtocol", scope: !94, file: !93, line: 119, baseType: !232, size: 64, align: 64, offset: 1856)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!127, !34}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "setWebSocketCookie", scope: !94, file: !93, line: 120, baseType: !236, size: 64, align: 64, offset: 1920)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!51, !34, !27, !127, !127}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "recvBlocking", scope: !94, file: !93, line: 122, baseType: !240, size: 64, align: 64, offset: 1984)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!51, !34, !27, !51, !209, !51}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "recvPartialBlocking", scope: !94, file: !93, line: 124, baseType: !240, size: 64, align: 64, offset: 2048)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sendBlocking", scope: !94, file: !93, line: 126, baseType: !240, size: 64, align: 64, offset: 2112)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "doOneMsg", scope: !94, file: !93, line: 128, baseType: !246, size: 64, align: 64, offset: 2176)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!51, !34, !70, !51}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "waitForConnection", scope: !94, file: !93, line: 129, baseType: !171, size: 64, align: 64, offset: 2240)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "waitForReadMultiple", scope: !94, file: !93, line: 130, baseType: !251, size: 64, align: 64, offset: 2304)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!51, !254, !51, !51, !209}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !94, file: !93, line: 137, baseType: !256, size: 64, align: 64, offset: 2368)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !34}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!260 = !{}
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint32", file: !262, line: 135, baseType: !263)
!262 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_atomic.h", directory: "/home/lichi/Desktop/open-vm-tools/line57")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint32", file: !262, line: 133, size: 32, align: 32, elements: !264)
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !263, file: !262, line: 134, baseType: !266, size: 32, align: 32)
!266 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !40)
!267 = !{i32 2, !"Dwarf Version", i32 4}
!268 = !{i32 2, !"Debug Info Version", i32 3}
!269 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!270 = distinct !DISubprogram(name: "AsyncSocketLock", scope: !31, file: !31, line: 155, type: !257, isLocal: false, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !260)
!271 = !DILocalVariable(name: "asock", arg: 1, scope: !270, file: !31, line: 155, type: !34)
!272 = !DIExpression()
!273 = !DILocation(line: 155, column: 30, scope: !270)
!274 = !DILocation(line: 157, column: 30, scope: !270)
!275 = !DILocation(line: 157, column: 4, scope: !270)
!276 = !DILocation(line: 158, column: 1, scope: !270)
!277 = distinct !DISubprogram(name: "AsyncSocketInternalIncRef", scope: !31, file: !31, line: 85, type: !278, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !260)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !34, !70}
!280 = !DILocalVariable(name: "asock", arg: 1, scope: !277, file: !31, line: 85, type: !34)
!281 = !DILocation(line: 85, column: 40, scope: !277)
!282 = !DILocalVariable(name: "lock", arg: 2, scope: !277, file: !31, line: 86, type: !70)
!283 = !DILocation(line: 86, column: 32, scope: !277)
!284 = !DILocation(line: 88, column: 8, scope: !285)
!285 = distinct !DILexicalBlock(scope: !277, file: !31, line: 88, column: 8)
!286 = !DILocation(line: 88, column: 13, scope: !285)
!287 = !DILocation(line: 88, column: 16, scope: !288)
!288 = !DILexicalBlockFile(scope: !285, file: !31, discriminator: 1)
!289 = !DILocation(line: 88, column: 23, scope: !288)
!290 = !DILocation(line: 88, column: 34, scope: !288)
!291 = !DILocation(line: 88, column: 8, scope: !288)
!292 = !DILocation(line: 89, column: 29, scope: !293)
!293 = distinct !DILexicalBlock(scope: !285, file: !31, line: 88, column: 40)
!294 = !DILocation(line: 89, column: 36, scope: !293)
!295 = !DILocation(line: 89, column: 47, scope: !293)
!296 = !DILocation(line: 89, column: 7, scope: !293)
!297 = !DILocation(line: 90, column: 4, scope: !293)
!298 = !DILocation(line: 92, column: 6, scope: !277)
!299 = !DILocation(line: 92, column: 13, scope: !277)
!300 = !DILocation(line: 92, column: 4, scope: !277)
!301 = !DILocation(line: 93, column: 1, scope: !277)
!302 = distinct !DISubprogram(name: "AsyncSocketUnlock", scope: !31, file: !31, line: 161, type: !257, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !260)
!303 = !DILocalVariable(name: "asock", arg: 1, scope: !302, file: !31, line: 161, type: !34)
!304 = !DILocation(line: 161, column: 32, scope: !302)
!305 = !DILocation(line: 163, column: 30, scope: !302)
!306 = !DILocation(line: 163, column: 4, scope: !302)
!307 = !DILocation(line: 164, column: 1, scope: !302)
