; ModuleID = './[inter]src--mat.o.i'
source_filename = "./[inter]src--mat.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.mat_complex_split_t = type { i8*, i8* }
%struct.matvar_t = type { i64, i32, i32, i32, i32, i32, i32, i32, i64*, i8*, i8*, i32, i32, %struct.matvar_internal* }
%struct.matvar_internal = type { i64, i32, i8**, %struct.z_stream_s*, i8* }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.internal_state = type opaque
%struct._mat_t = type { i8*, i8*, i8*, i8*, i32, i32, i32, i64, i64, i64, i8** }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.mat_sparse_t = type { i32, i32*, i32, i32*, i32, i32, i8* }

@.str = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"r+b\00", align 1
@.str.2 = private unnamed_addr constant [23 x i8] c"Invalid file open mode\00", align 1
@.str.3 = private unnamed_addr constant [42 x i8] c"Couldn't allocate memory for the MAT file\00", align 1
@.str.4 = private unnamed_addr constant [49 x i8] c"Couldn't allocate memory for the MAT file header\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !67)
!1 = !DIFile(filename: "[inter]src--mat.o.i", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!2 = !{!3, !27, !47, !51, !57, !61}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "matio_types", file: !4, line: 77, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "matio.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!6 = !DIEnumerator(name: "MAT_T_UNKNOWN", value: 0)
!7 = !DIEnumerator(name: "MAT_T_INT8", value: 1)
!8 = !DIEnumerator(name: "MAT_T_UINT8", value: 2)
!9 = !DIEnumerator(name: "MAT_T_INT16", value: 3)
!10 = !DIEnumerator(name: "MAT_T_UINT16", value: 4)
!11 = !DIEnumerator(name: "MAT_T_INT32", value: 5)
!12 = !DIEnumerator(name: "MAT_T_UINT32", value: 6)
!13 = !DIEnumerator(name: "MAT_T_SINGLE", value: 7)
!14 = !DIEnumerator(name: "MAT_T_DOUBLE", value: 9)
!15 = !DIEnumerator(name: "MAT_T_INT64", value: 12)
!16 = !DIEnumerator(name: "MAT_T_UINT64", value: 13)
!17 = !DIEnumerator(name: "MAT_T_MATRIX", value: 14)
!18 = !DIEnumerator(name: "MAT_T_COMPRESSED", value: 15)
!19 = !DIEnumerator(name: "MAT_T_UTF8", value: 16)
!20 = !DIEnumerator(name: "MAT_T_UTF16", value: 17)
!21 = !DIEnumerator(name: "MAT_T_UTF32", value: 18)
!22 = !DIEnumerator(name: "MAT_T_STRING", value: 20)
!23 = !DIEnumerator(name: "MAT_T_CELL", value: 21)
!24 = !DIEnumerator(name: "MAT_T_STRUCT", value: 22)
!25 = !DIEnumerator(name: "MAT_T_ARRAY", value: 23)
!26 = !DIEnumerator(name: "MAT_T_FUNCTION", value: 24)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "matio_classes", file: !4, line: 107, size: 32, align: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!29 = !DIEnumerator(name: "MAT_C_EMPTY", value: 0)
!30 = !DIEnumerator(name: "MAT_C_CELL", value: 1)
!31 = !DIEnumerator(name: "MAT_C_STRUCT", value: 2)
!32 = !DIEnumerator(name: "MAT_C_OBJECT", value: 3)
!33 = !DIEnumerator(name: "MAT_C_CHAR", value: 4)
!34 = !DIEnumerator(name: "MAT_C_SPARSE", value: 5)
!35 = !DIEnumerator(name: "MAT_C_DOUBLE", value: 6)
!36 = !DIEnumerator(name: "MAT_C_SINGLE", value: 7)
!37 = !DIEnumerator(name: "MAT_C_INT8", value: 8)
!38 = !DIEnumerator(name: "MAT_C_UINT8", value: 9)
!39 = !DIEnumerator(name: "MAT_C_INT16", value: 10)
!40 = !DIEnumerator(name: "MAT_C_UINT16", value: 11)
!41 = !DIEnumerator(name: "MAT_C_INT32", value: 12)
!42 = !DIEnumerator(name: "MAT_C_UINT32", value: 13)
!43 = !DIEnumerator(name: "MAT_C_INT64", value: 14)
!44 = !DIEnumerator(name: "MAT_C_UINT64", value: 15)
!45 = !DIEnumerator(name: "MAT_C_FUNCTION", value: 16)
!46 = !DIEnumerator(name: "MAT_C_OPAQUE", value: 17)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "matio_compression", file: !4, line: 145, size: 32, align: 32, elements: !48)
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "MAT_COMPRESSION_NONE", value: 0)
!50 = !DIEnumerator(name: "MAT_COMPRESSION_ZLIB", value: 1)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mat_ft", file: !4, line: 65, size: 32, align: 32, elements: !52)
!52 = !{!53, !54, !55, !56}
!53 = !DIEnumerator(name: "MAT_FT_MAT73", value: 512)
!54 = !DIEnumerator(name: "MAT_FT_MAT5", value: 256)
!55 = !DIEnumerator(name: "MAT_FT_MAT4", value: 16)
!56 = !DIEnumerator(name: "MAT_FT_UNDEFINED", value: 0)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mat_acc", file: !4, line: 55, size: 32, align: 32, elements: !58)
!58 = !{!59, !60}
!59 = !DIEnumerator(name: "MAT_ACC_RDONLY", value: 0)
!60 = !DIEnumerator(name: "MAT_ACC_RDWR", value: 1)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "matio_flags", file: !4, line: 133, size: 32, align: 32, elements: !62)
!62 = !{!63, !64, !65, !66}
!63 = !DIEnumerator(name: "MAT_F_COMPLEX", value: 2048)
!64 = !DIEnumerator(name: "MAT_F_GLOBAL", value: 1024)
!65 = !DIEnumerator(name: "MAT_F_LOGICAL", value: 512)
!66 = !DIEnumerator(name: "MAT_F_DONT_COPY_DATA", value: 1)
!67 = !{!68, !73, !51, !75, !82, !87, !99, !98, !154, !173, !167, !220, !221, !227, !181, !237, !238, !93, !239, !244, !246, !247, !249, !252, !255, !258, !262, !263, !266}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_complex_split_t", file: !4, line: 168, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mat_complex_split_t", file: !4, line: 165, size: 128, align: 64, elements: !71)
!71 = !{!72, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Re", scope: !70, file: !4, line: 166, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Im", scope: !70, file: !4, line: 167, baseType: !73, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_t", file: !4, line: 175, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mat_t", file: !78, line: 58, size: 640, align: 64, elements: !79)
!78 = !DIFile(filename: "matio_private.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!79 = !{!80, !81, !84, !85, !86, !88, !89, !90, !92, !96, !97}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !77, file: !78, line: 59, baseType: !73, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !77, file: !78, line: 60, baseType: !82, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "subsys_offset", scope: !77, file: !78, line: 61, baseType: !82, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !77, file: !78, line: 62, baseType: !82, size: 64, align: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !77, file: !78, line: 63, baseType: !87, size: 32, align: 32, offset: 256)
!87 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "byteswap", scope: !77, file: !78, line: 64, baseType: !87, size: 32, align: 32, offset: 288)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !77, file: !78, line: 65, baseType: !87, size: 32, align: 32, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "bof", scope: !77, file: !78, line: 66, baseType: !91, size: 64, align: 64, offset: 384)
!91 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "next_index", scope: !77, file: !78, line: 67, baseType: !93, size: 64, align: 64, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 216, baseType: !95)
!94 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!95 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "num_datasets", scope: !77, file: !78, line: 68, baseType: !93, size: 64, align: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !77, file: !78, line: 72, baseType: !98, size: 64, align: 64, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !101, line: 48, baseType: !102)
!101 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !103, line: 241, size: 1728, align: 64, elements: !104)
!103 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !125, !126, !127, !128, !131, !133, !135, !139, !142, !144, !145, !146, !147, !148, !149, !150}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !102, file: !103, line: 242, baseType: !87, size: 32, align: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !102, file: !103, line: 247, baseType: !82, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !102, file: !103, line: 248, baseType: !82, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !102, file: !103, line: 249, baseType: !82, size: 64, align: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !102, file: !103, line: 250, baseType: !82, size: 64, align: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !102, file: !103, line: 251, baseType: !82, size: 64, align: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !102, file: !103, line: 252, baseType: !82, size: 64, align: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !102, file: !103, line: 253, baseType: !82, size: 64, align: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !102, file: !103, line: 254, baseType: !82, size: 64, align: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !102, file: !103, line: 256, baseType: !82, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !102, file: !103, line: 257, baseType: !82, size: 64, align: 64, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !102, file: !103, line: 258, baseType: !82, size: 64, align: 64, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !102, file: !103, line: 260, baseType: !118, size: 64, align: 64, offset: 768)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !103, line: 156, size: 192, align: 64, elements: !120)
!120 = !{!121, !122, !124}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !119, file: !103, line: 157, baseType: !118, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !119, file: !103, line: 158, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !119, file: !103, line: 162, baseType: !87, size: 32, align: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !102, file: !103, line: 262, baseType: !123, size: 64, align: 64, offset: 832)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !102, file: !103, line: 264, baseType: !87, size: 32, align: 32, offset: 896)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !102, file: !103, line: 268, baseType: !87, size: 32, align: 32, offset: 928)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !102, file: !103, line: 270, baseType: !129, size: 64, align: 64, offset: 960)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !130, line: 131, baseType: !91)
!130 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !102, file: !103, line: 274, baseType: !132, size: 16, align: 16, offset: 1024)
!132 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !102, file: !103, line: 275, baseType: !134, size: 8, align: 8, offset: 1040)
!134 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !102, file: !103, line: 276, baseType: !136, size: 8, align: 8, offset: 1048)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 8, align: 8, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 1)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !102, file: !103, line: 280, baseType: !140, size: 64, align: 64, offset: 1088)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !103, line: 150, baseType: null)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !102, file: !103, line: 289, baseType: !143, size: 64, align: 64, offset: 1152)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !130, line: 132, baseType: !91)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !102, file: !103, line: 297, baseType: !73, size: 64, align: 64, offset: 1216)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !102, file: !103, line: 298, baseType: !73, size: 64, align: 64, offset: 1280)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !102, file: !103, line: 299, baseType: !73, size: 64, align: 64, offset: 1344)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !102, file: !103, line: 300, baseType: !73, size: 64, align: 64, offset: 1408)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !102, file: !103, line: 302, baseType: !93, size: 64, align: 64, offset: 1472)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !102, file: !103, line: 303, baseType: !87, size: 32, align: 32, offset: 1536)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !102, file: !103, line: 305, baseType: !151, size: 160, align: 8, offset: 1568)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 160, align: 8, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 20)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "matvar_t", file: !4, line: 200, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "matvar_t", file: !4, line: 185, size: 640, align: 64, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166, !168, !169, !170, !171, !172}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !156, file: !4, line: 186, baseType: !93, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !156, file: !4, line: 187, baseType: !87, size: 32, align: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !156, file: !4, line: 188, baseType: !3, size: 32, align: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !156, file: !4, line: 189, baseType: !87, size: 32, align: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "class_type", scope: !156, file: !4, line: 190, baseType: !27, size: 32, align: 32, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "isComplex", scope: !156, file: !4, line: 191, baseType: !87, size: 32, align: 32, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "isGlobal", scope: !156, file: !4, line: 192, baseType: !87, size: 32, align: 32, offset: 224)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "isLogical", scope: !156, file: !4, line: 193, baseType: !87, size: 32, align: 32, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !156, file: !4, line: 194, baseType: !167, size: 64, align: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !4, line: 195, baseType: !82, size: 64, align: 64, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !156, file: !4, line: 196, baseType: !73, size: 64, align: 64, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mem_conserve", scope: !156, file: !4, line: 197, baseType: !87, size: 32, align: 32, offset: 512)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !156, file: !4, line: 198, baseType: !47, size: 32, align: 32, offset: 544)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !156, file: !4, line: 199, baseType: !173, size: 64, align: 64, offset: 576)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "matvar_internal", file: !78, line: 80, size: 320, align: 64, elements: !175)
!175 = !{!176, !177, !179, !180, !219}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "datapos", scope: !174, file: !78, line: 86, baseType: !91, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "num_fields", scope: !174, file: !78, line: 87, baseType: !178, size: 32, align: 32, offset: 64)
!178 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "fieldnames", scope: !174, file: !78, line: 88, baseType: !98, size: 64, align: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !174, file: !78, line: 90, baseType: !181, size: 64, align: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_streamp", file: !182, line: 108, baseType: !183)
!182 = !DIFile(filename: "/usr/local/include/zlib.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !182, line: 106, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !182, line: 86, size: 896, align: 64, elements: !186)
!186 = !{!187, !193, !195, !197, !198, !199, !200, !201, !204, !210, !215, !216, !217, !218}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !185, file: !182, line: 87, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !190, line: 400, baseType: !191)
!190 = !DIFile(filename: "/usr/local/include/zconf.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !190, line: 391, baseType: !192)
!192 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !185, file: !182, line: 88, baseType: !194, size: 32, align: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !190, line: 393, baseType: !178)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !185, file: !182, line: 89, baseType: !196, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !190, line: 394, baseType: !95)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !185, file: !182, line: 91, baseType: !188, size: 64, align: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !185, file: !182, line: 92, baseType: !194, size: 32, align: 32, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !185, file: !182, line: 93, baseType: !196, size: 64, align: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !185, file: !182, line: 95, baseType: !82, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !185, file: !182, line: 96, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !182, line: 84, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !185, file: !182, line: 98, baseType: !205, size: 64, align: 64, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !182, line: 81, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!209, !209, !194, !194}
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !190, line: 409, baseType: !73)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !185, file: !182, line: 99, baseType: !211, size: 64, align: 64, offset: 576)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !182, line: 82, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !209, !209}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !185, file: !182, line: 100, baseType: !209, size: 64, align: 64, offset: 640)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !185, file: !182, line: 102, baseType: !87, size: 32, align: 32, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !185, file: !182, line: 104, baseType: !196, size: 64, align: 64, offset: 768)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !185, file: !182, line: 105, baseType: !196, size: 64, align: 64, offset: 832)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !174, file: !78, line: 91, baseType: !73, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_sparse_t", file: !4, line: 220, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mat_sparse_t", file: !4, line: 207, size: 384, align: 64, elements: !224)
!224 = !{!225, !226, !232, !233, !234, !235, !236}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "nzmax", scope: !223, file: !4, line: 208, baseType: !87, size: 32, align: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ir", scope: !223, file: !4, line: 209, baseType: !227, size: 64, align: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_int32_t", file: !229, line: 94, baseType: !230)
!229 = !DIFile(filename: "matio_pubconf.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !231, line: 196, baseType: !87)
!231 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!232 = !DIDerivedType(tag: DW_TAG_member, name: "nir", scope: !223, file: !4, line: 212, baseType: !87, size: 32, align: 32, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "jc", scope: !223, file: !4, line: 213, baseType: !227, size: 64, align: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "njc", scope: !223, file: !4, line: 217, baseType: !87, size: 32, align: 32, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ndata", scope: !223, file: !4, line: 218, baseType: !87, size: 32, align: 32, offset: 288)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !223, file: !4, line: 219, baseType: !73, size: 64, align: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!238 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_uint16_t", file: !229, line: 103, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !243, line: 49, baseType: !132)
!243 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_int64_t", file: !229, line: 88, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !231, line: 197, baseType: !91)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_uint64_t", file: !229, line: 91, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !243, line: 55, baseType: !95)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_uint32_t", file: !229, line: 97, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !243, line: 51, baseType: !178)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_int16_t", file: !229, line: 100, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !231, line: 195, baseType: !261)
!261 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_int8_t", file: !229, line: 106, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !231, line: 194, baseType: !134)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_uint8_t", file: !229, line: 109, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !243, line: 48, baseType: !192)
!269 = !{i32 2, !"Dwarf Version", i32 4}
!270 = !{i32 2, !"Debug Info Version", i32 3}
!271 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!272 = distinct !DISubprogram(name: "ComplexMalloc", scope: !273, file: !273, line: 141, type: !274, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !276)
!273 = !DIFile(filename: "mat.c", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!274 = !DISubroutineType(types: !275)
!275 = !{!68, !93}
!276 = !{}
!277 = !DILocalVariable(name: "nbytes", arg: 1, scope: !272, file: !273, line: 141, type: !93)
!278 = !DIExpression()
!279 = !DILocation(line: 141, column: 22, scope: !272)
!280 = !DILocalVariable(name: "complex_data", scope: !272, file: !273, line: 143, type: !68)
!281 = !DILocation(line: 143, column: 26, scope: !272)
!282 = !DILocation(line: 143, column: 63, scope: !272)
