; ModuleID = './[inter]src--matvar_struct.o.i'
source_filename = "./[inter]src--matvar_struct.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.matvar_t = type { i64, i32, i32, i32, i32, i32, i32, i32, i64*, i8*, i8*, i32, i32, %struct.matvar_internal* }
%struct.matvar_internal = type { i64, i32, i8**, %struct.z_stream_s*, i8* }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.internal_state = type opaque

@.str = private unnamed_addr constant [53 x i8] c"Mat_VarGetStructField: structure index out of bounds\00", align 1
@.str.1 = private unnamed_addr constant [49 x i8] c"Mat_VarGetStructField: field index out of bounds\00", align 1

; Function Attrs: nounwind uwtable
define %struct.matvar_t* @Mat_VarCreateStruct(i8*, i32, i64*, i8**, i32) #0 !dbg !139 {
  %6 = alloca %struct.matvar_t*, align 8
  %7 = alloca i8*, align 8
  %8 = alloca i32, align 4
  %9 = alloca i64*, align 8
  %10 = alloca i8**, align 8
  %11 = alloca i32, align 4
  %12 = alloca i64, align 8
  %13 = alloca i32, align 4
  %14 = alloca %struct.matvar_t*, align 8
  %15 = alloca i64, align 8
  %16 = alloca i64, align 8
  store i8* %0, i8** %7, align 8
  call void @llvm.dbg.declare(metadata i8** %7, metadata !145, metadata !146), !dbg !147
  store i32 %1, i32* %8, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !55)
!1 = !DIFile(filename: "[inter]src--matvar_struct.o.i", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!2 = !{!3, !27, !47, !51}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "matio_types", file: !4, line: 77, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "matio.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!6 = !DIEnumerator(name: "MAT_T_UNKNOWN", value: 0)
!7 = !DIEnumerator(name: "MAT_T_INT8", value: 1)
!8 = !DIEnumerator(name: "MAT_T_UINT8", value: 2)
!9 = !DIEnumerator(name: "MAT_T_INT16", value: 3)
!10 = !DIEnumerator(name: "MAT_T_UINT16", value: 4)
!11 = !DIEnumerator(name: "MAT_T_INT32", value: 5)
!12 = !DIEnumerator(name: "MAT_T_UINT32", value: 6)
!13 = !DIEnumerator(name: "MAT_T_SINGLE", value: 7)
!14 = !DIEnumerator(name: "MAT_T_DOUBLE", value: 9)
!15 = !DIEnumerator(name: "MAT_T_INT64", value: 12)
!16 = !DIEnumerator(name: "MAT_T_UINT64", value: 13)
!17 = !DIEnumerator(name: "MAT_T_MATRIX", value: 14)
!18 = !DIEnumerator(name: "MAT_T_COMPRESSED", value: 15)
!19 = !DIEnumerator(name: "MAT_T_UTF8", value: 16)
!20 = !DIEnumerator(name: "MAT_T_UTF16", value: 17)
!21 = !DIEnumerator(name: "MAT_T_UTF32", value: 18)
!22 = !DIEnumerator(name: "MAT_T_STRING", value: 20)
!23 = !DIEnumerator(name: "MAT_T_CELL", value: 21)
!24 = !DIEnumerator(name: "MAT_T_STRUCT", value: 22)
!25 = !DIEnumerator(name: "MAT_T_ARRAY", value: 23)
!26 = !DIEnumerator(name: "MAT_T_FUNCTION", value: 24)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "matio_classes", file: !4, line: 107, size: 32, align: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!29 = !DIEnumerator(name: "MAT_C_EMPTY", value: 0)
!30 = !DIEnumerator(name: "MAT_C_CELL", value: 1)
!31 = !DIEnumerator(name: "MAT_C_STRUCT", value: 2)
!32 = !DIEnumerator(name: "MAT_C_OBJECT", value: 3)
!33 = !DIEnumerator(name: "MAT_C_CHAR", value: 4)
!34 = !DIEnumerator(name: "MAT_C_SPARSE", value: 5)
!35 = !DIEnumerator(name: "MAT_C_DOUBLE", value: 6)
!36 = !DIEnumerator(name: "MAT_C_SINGLE", value: 7)
!37 = !DIEnumerator(name: "MAT_C_INT8", value: 8)
!38 = !DIEnumerator(name: "MAT_C_UINT8", value: 9)
!39 = !DIEnumerator(name: "MAT_C_INT16", value: 10)
!40 = !DIEnumerator(name: "MAT_C_UINT16", value: 11)
!41 = !DIEnumerator(name: "MAT_C_INT32", value: 12)
!42 = !DIEnumerator(name: "MAT_C_UINT32", value: 13)
!43 = !DIEnumerator(name: "MAT_C_INT64", value: 14)
!44 = !DIEnumerator(name: "MAT_C_UINT64", value: 15)
!45 = !DIEnumerator(name: "MAT_C_FUNCTION", value: 16)
!46 = !DIEnumerator(name: "MAT_C_OPAQUE", value: 17)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "matio_compression", file: !4, line: 145, size: 32, align: 32, elements: !48)
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "MAT_COMPRESSION_NONE", value: 0)
!50 = !DIEnumerator(name: "MAT_COMPRESSION_ZLIB", value: 1)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 155, size: 32, align: 32, elements: !52)
!52 = !{!53, !54}
!53 = !DIEnumerator(name: "MAT_BY_NAME", value: 1)
!54 = !DIEnumerator(name: "MAT_BY_INDEX", value: 2)
!55 = !{!56, !57, !61, !64, !133, !134, !58}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !59, line: 216, baseType: !60)
!59 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!60 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "matvar_t", file: !4, line: 200, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "matvar_t", file: !4, line: 185, size: 640, align: 64, elements: !68)
!68 = !{!69, !70, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !67, file: !4, line: 186, baseType: !58, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !67, file: !4, line: 187, baseType: !71, size: 32, align: 32, offset: 64)
!71 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !67, file: !4, line: 188, baseType: !3, size: 32, align: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !67, file: !4, line: 189, baseType: !71, size: 32, align: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "class_type", scope: !67, file: !4, line: 190, baseType: !27, size: 32, align: 32, offset: 160)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "isComplex", scope: !67, file: !4, line: 191, baseType: !71, size: 32, align: 32, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "isGlobal", scope: !67, file: !4, line: 192, baseType: !71, size: 32, align: 32, offset: 224)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "isLogical", scope: !67, file: !4, line: 193, baseType: !71, size: 32, align: 32, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !67, file: !4, line: 194, baseType: !57, size: 64, align: 64, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !67, file: !4, line: 195, baseType: !62, size: 64, align: 64, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !67, file: !4, line: 196, baseType: !56, size: 64, align: 64, offset: 448)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "mem_conserve", scope: !67, file: !4, line: 197, baseType: !71, size: 32, align: 32, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !67, file: !4, line: 198, baseType: !47, size: 32, align: 32, offset: 544)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !67, file: !4, line: 199, baseType: !84, size: 64, align: 64, offset: 576)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "matvar_internal", file: !86, line: 80, size: 320, align: 64, elements: !87)
!86 = !DIFile(filename: "matio_private.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!87 = !{!88, !90, !92, !93, !132}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "datapos", scope: !85, file: !86, line: 86, baseType: !89, size: 64, align: 64)
!89 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "num_fields", scope: !85, file: !86, line: 87, baseType: !91, size: 32, align: 32, offset: 64)
!91 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "fieldnames", scope: !85, file: !86, line: 88, baseType: !61, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !85, file: !86, line: 90, baseType: !94, size: 64, align: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_streamp", file: !95, line: 108, baseType: !96)
!95 = !DIFile(filename: "/usr/local/include/zlib.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !95, line: 106, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !95, line: 86, size: 896, align: 64, elements: !99)
!99 = !{!100, !106, !108, !110, !111, !112, !113, !114, !117, !123, !128, !129, !130, !131}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !98, file: !95, line: 87, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !103, line: 400, baseType: !104)
!103 = !DIFile(filename: "/usr/local/include/zconf.h", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !103, line: 391, baseType: !105)
!105 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !98, file: !95, line: 88, baseType: !107, size: 32, align: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !103, line: 393, baseType: !91)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !98, file: !95, line: 89, baseType: !109, size: 64, align: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !103, line: 394, baseType: !60)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !98, file: !95, line: 91, baseType: !101, size: 64, align: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !98, file: !95, line: 92, baseType: !107, size: 32, align: 32, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !98, file: !95, line: 93, baseType: !109, size: 64, align: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !98, file: !95, line: 95, baseType: !62, size: 64, align: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !98, file: !95, line: 96, baseType: !115, size: 64, align: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !95, line: 84, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !98, file: !95, line: 98, baseType: !118, size: 64, align: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !95, line: 81, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!122, !122, !107, !107}
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !103, line: 409, baseType: !56)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !98, file: !95, line: 99, baseType: !124, size: 64, align: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !95, line: 82, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !122, !122}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !98, file: !95, line: 100, baseType: !122, size: 64, align: 64, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !98, file: !95, line: 102, baseType: !71, size: 32, align: 32, offset: 704)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !98, file: !95, line: 104, baseType: !109, size: 64, align: 64, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !98, file: !95, line: 105, baseType: !109, size: 64, align: 64, offset: 832)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !86, line: 91, baseType: !56, size: 64, align: 64, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!136 = !{i32 2, !"Dwarf Version", i32 4}
!137 = !{i32 2, !"Debug Info Version", i32 3}
!138 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!139 = distinct !DISubprogram(name: "Mat_VarCreateStruct", scope: !140, file: !140, line: 45, type: !141, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !144)
!140 = !DIFile(filename: "matvar_struct.c", directory: "/home/lichi/Desktop/matio/[lib]src--.libs--libmatio.a")
!141 = !DISubroutineType(types: !142)
!142 = !{!65, !134, !71, !57, !143, !91}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!144 = !{}
!145 = !DILocalVariable(name: "name", arg: 1, scope: !139, file: !140, line: 45, type: !134)
!146 = !DIExpression()
!147 = !DILocation(line: 45, column: 33, scope: !139)
!148 = !DILocalVariable(name: "rank", arg: 2, scope: !139, file: !140, line: 45, type: !71)
!149 = !DILocation(line: 45, column: 42, scope: !139)
!150 = !DILocalVariable(name: "dims", arg: 3, scope: !139, file: !140, line: 45, type: !57)
!151 = !DILocation(line: 45, column: 55, scope: !139)
!152 = !DILocalVariable(name: "fields", arg: 4, scope: !139, file: !140, line: 45, type: !143)
!153 = !DILocation(line: 45, column: 73, scope: !139)
!154 = !DILocalVariable(name: "nfields", arg: 5, scope: !139, file: !140, line: 46, type: !91)
!155 = !DILocation(line: 46, column: 14, scope: !139)
!156 = !DILocalVariable(name: "nelems", scope: !139, file: !140, line: 48, type: !58)
!157 = !DILocation(line: 48, column: 12, scope: !139)
!158 = !DILocalVariable(name: "j", scope: !139, file: !140, line: 49, type: !71)
!159 = !DILocation(line: 49, column: 9, scope: !139)
!160 = !DILocalVariable(name: "matvar", scope: !139, file: !140, line: 50, type: !65)
!161 = !DILocation(line: 50, column: 15, scope: !139)
!162 = !DILocation(line: 52, column: 17, scope: !163)
!163 = distinct !DILexicalBlock(scope: !139, file: !140, line: 52, column: 9)
!164 = !DILocation(line: 52, column: 14, scope: !163)
!165 = !DILocation(line: 52, column: 9, scope: !139)
!166 = !DILocation(line: 53, column: 9, scope: !163)
!167 = !DILocation(line: 55, column: 14, scope: !139)
!168 = !DILocation(line: 55, column: 12, scope: !139)
!169 = !DILocation(line: 56, column: 17, scope: !170)
!170 = distinct !DILexicalBlock(scope: !139, file: !140, line: 56, column: 9)
!171 = !DILocation(line: 56, column: 14, scope: !170)
!172 = !DILocation(line: 56, column: 9, scope: !139)
!173 = !DILocation(line: 57, column: 9, scope: !170)
!174 = !DILocation(line: 59, column: 5, scope: !139)
!175 = !DILocation(line: 59, column: 13, scope: !139)
!176 = !DILocation(line: 59, column: 25, scope: !139)
!177 = !DILocation(line: 60, column: 17, scope: !178)
!178 = distinct !DILexicalBlock(scope: !139, file: !140, line: 60, column: 9)
!179 = !DILocation(line: 60, column: 14, scope: !178)
!180 = !DILocation(line: 60, column: 9, scope: !139)
!181 = !DILocation(line: 61, column: 31, scope: !178)
!182 = !DILocation(line: 61, column: 24, scope: !178)
!183 = !DILocation(line: 61, column: 9, scope: !178)
!184 = !DILocation(line: 61, column: 17, scope: !178)
!185 = !DILocation(line: 61, column: 22, scope: !178)
!186 = !DILocation(line: 62, column: 20, scope: !139)
!187 = !DILocation(line: 62, column: 5, scope: !139)
!188 = !DILocation(line: 62, column: 13, scope: !139)
!189 = !DILocation(line: 62, column: 18, scope: !139)
!190 = !DILocation(line: 63, column: 36, scope: !139)
!191 = !DILocation(line: 63, column: 44, scope: !139)
!192 = !DILocation(line: 63, column: 48, scope: !139)
!193 = !DILocation(line: 63, column: 29, scope: !139)
