; ModuleID = './vmtoolsd-cmdLine.o.i'
source_filename = "./vmtoolsd-cmdLine.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ToolsServiceState = type { i8*, i8*, i64, i32, i32, i32, i8*, i8*, %struct._GPtrArray*, i8*, %struct._GModule*, i8*, %struct.RpcDebugLibData*, %struct.ToolsAppCtx, %struct._GArray*, i32, i32 }
%struct._GPtrArray = type { i8**, i32 }
%struct._GModule = type opaque
%struct.RpcDebugLibData = type { %struct._RpcChannel* (%struct.ToolsAppCtx*, %struct.RpcDebugLibData*)*, i32 (%struct.ToolsAppCtx*, i8*, i8*, %struct.RpcDebugLibData*)*, %struct.RpcDebugPlugin* }
%struct._RpcChannel = type opaque
%struct.RpcDebugPlugin = type { %struct.RpcDebugRecvMapping*, i32 (i8*, i64, i8**, i64*)*, i32 (%struct.RpcDebugMsgMapping*)*, void (%struct.ToolsAppCtx*, %struct.RpcDebugPlugin*)*, %struct.ToolsPluginData* }
%struct.RpcDebugRecvMapping = type { i8*, i32 (i8*, i64, i8**, i64*)*, i8*, i64 }
%struct.RpcDebugMsgMapping = type { i8*, i64, i32 (%struct.RpcInData*, i32)*, i32 }
%struct.RpcInData = type { i8*, i8*, i64, i8*, i64, i32, i8*, i8* }
%struct.ToolsPluginData = type { i8*, %struct._GArray*, i32 (%struct.ToolsAppCtx*, i32, i8*, %struct.ToolsPluginData*)*, i8* }
%struct.ToolsAppCtx = type { i32, i8*, i32, i32, %struct._GMainLoop*, %struct._RpcChannel*, %struct._GKeyFile*, i32, i32, i8**, i8* }
%struct._GMainLoop = type opaque
%struct._GKeyFile = type opaque
%struct._GArray = type { i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !37)
!1 = !DIFile(filename: "vmtoolsd-cmdLine.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!2 = !{!3, !7, !13, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 232, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/plugin.h", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!5 = !{!6}
!6 = !DIEnumerator(name: "TOOLS_CORE_API_V1", value: 1)
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 339, size: 32, align: 32, elements: !8)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "TOOLS_APP_GUESTRPC", value: 1)
!10 = !DIEnumerator(name: "TOOLS_APP_SIGNALS", value: 2)
!11 = !DIEnumerator(name: "TOOLS_APP_PROVIDER", value: 3)
!12 = !DIEnumerator(name: "TOOLS_SVC_PROPERTY", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 118, size: 32, align: 32, elements: !15)
!14 = !DIFile(filename: "/usr/include/glib-2.0/glib/goption.h", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24}
!16 = !DIEnumerator(name: "G_OPTION_ARG_NONE", value: 0)
!17 = !DIEnumerator(name: "G_OPTION_ARG_STRING", value: 1)
!18 = !DIEnumerator(name: "G_OPTION_ARG_INT", value: 2)
!19 = !DIEnumerator(name: "G_OPTION_ARG_CALLBACK", value: 3)
!20 = !DIEnumerator(name: "G_OPTION_ARG_FILENAME", value: 4)
!21 = !DIEnumerator(name: "G_OPTION_ARG_STRING_ARRAY", value: 5)
!22 = !DIEnumerator(name: "G_OPTION_ARG_FILENAME_ARRAY", value: 6)
!23 = !DIEnumerator(name: "G_OPTION_ARG_DOUBLE", value: 7)
!24 = !DIEnumerator(name: "G_OPTION_ARG_INT64", value: 8)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 51, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36}
!28 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!29 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!30 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!31 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!32 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!33 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!34 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!35 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!36 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!37 = !{!38}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!39 = !{i32 2, !"Dwarf Version", i32 4}
!40 = !{i32 2, !"Debug Info Version", i32 3}
!41 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!42 = distinct !DISubprogram(name: "ToolsCore_ParseCommandLine", scope: !43, file: !43, line: 214, type: !44, isLocal: false, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !222)
!43 = !DIFile(filename: "cmdLine.c", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!44 = !DISubroutineType(types: !45)
!45 = !{!46, !50, !49, !158}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !47, line: 50, baseType: !48)
!47 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !47, line: 49, baseType: !49)
!49 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsServiceState", file: !52, line: 100, baseType: !53)
!52 = !DIFile(filename: "toolsCoreInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsServiceState", file: !52, line: 69, size: 1472, align: 64, elements: !54)
!54 = !{!55, !59, !60, !66, !69, !70, !71, !72, !73, !83, !84, !89, !90, !218, !219, !220, !221}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !53, file: !52, line: 70, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !47, line: 46, baseType: !58)
!58 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "configFile", scope: !53, file: !52, line: 71, baseType: !56, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "configMtime", scope: !53, file: !52, line: 72, baseType: !61, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !62, line: 75, baseType: !63)
!62 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !64, line: 139, baseType: !65)
!64 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!65 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "configCheckTask", scope: !53, file: !52, line: 73, baseType: !67, size: 32, align: 32, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !47, line: 55, baseType: !68)
!68 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "mainService", scope: !53, file: !52, line: 74, baseType: !46, size: 32, align: 32, offset: 224)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "capsRegistered", scope: !53, file: !52, line: 75, baseType: !46, size: 32, align: 32, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "commonPath", scope: !53, file: !52, line: 76, baseType: !56, size: 64, align: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "pluginPath", scope: !53, file: !52, line: 77, baseType: !56, size: 64, align: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "plugins", scope: !53, file: !52, line: 78, baseType: !74, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPtrArray", file: !76, line: 39, baseType: !77)
!76 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GPtrArray", file: !76, line: 53, size: 128, align: 64, elements: !78)
!78 = !{!79, !82}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !77, file: !76, line: 55, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !47, line: 77, baseType: !38)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !77, file: !76, line: 56, baseType: !67, size: 32, align: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "pidFile", scope: !53, file: !52, line: 82, baseType: !56, size: 64, align: 64, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "debugLib", scope: !53, file: !52, line: 84, baseType: !85, size: 64, align: 64, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "GModule", file: !87, line: 49, baseType: !88)
!87 = !DIFile(filename: "/usr/include/glib-2.0/gmodule.h", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GModule", file: !87, line: 49, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "debugPlugin", scope: !53, file: !52, line: 85, baseType: !56, size: 64, align: 64, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "debugData", scope: !53, file: !52, line: 86, baseType: !91, size: 64, align: 64, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugLibData", file: !93, line: 150, baseType: !94)
!93 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/rpcdebug.h", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcDebugLibData", file: !93, line: 142, size: 192, align: 64, elements: !95)
!95 = !{!96, !134, !138}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "newDebugChannel", scope: !94, file: !93, line: 143, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !104, !133}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !102, line: 48, baseType: !103)
!102 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !102, line: 48, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCtx", file: !4, line: 274, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCtx", file: !4, line: 241, size: 576, align: 64, elements: !107)
!107 = !{!108, !110, !113, !114, !115, !120, !121, !126, !127, !128, !132}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !106, file: !4, line: 243, baseType: !109, size: 32, align: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreAPI", file: !4, line: 234, baseType: !3)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !4, line: 245, baseType: !111, size: 64, align: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "isVMware", scope: !106, file: !4, line: 247, baseType: !46, size: 32, align: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "errorCode", scope: !106, file: !4, line: 249, baseType: !49, size: 32, align: 32, offset: 160)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "mainLoop", scope: !106, file: !4, line: 251, baseType: !116, size: 64, align: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !118, line: 56, baseType: !119)
!118 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !118, line: 56, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !106, file: !4, line: 253, baseType: !100, size: 64, align: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !106, file: !4, line: 255, baseType: !122, size: 64, align: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !124, line: 48, baseType: !125)
!124 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !124, line: 48, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "blockFD", scope: !106, file: !4, line: 261, baseType: !49, size: 32, align: 32, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "uinputFD", scope: !106, file: !4, line: 263, baseType: !49, size: 32, align: 32, offset: 416)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !106, file: !4, line: 265, baseType: !129, size: 64, align: 64, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "serviceObj", scope: !106, file: !4, line: 273, baseType: !81, size: 64, align: 64, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !94, file: !93, line: 145, baseType: !135, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!49, !104, !81, !81, !133}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "debugPlugin", scope: !94, file: !93, line: 149, baseType: !139, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugPlugin", file: !93, line: 126, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcDebugPlugin", file: !93, line: 112, size: 320, align: 64, elements: !142)
!142 = !{!143, !162, !163, !192, !198}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "recvFns", scope: !141, file: !93, line: 114, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugRecvMapping", file: !93, line: 69, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcDebugRecvMapping", file: !93, line: 59, size: 256, align: 64, elements: !147)
!147 = !{!148, !149, !160, !161}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !146, file: !93, line: 60, baseType: !56, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "recvFn", scope: !146, file: !93, line: 61, baseType: !150, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugRecvFn", file: !93, line: 53, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!46, !154, !155, !158, !159}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !156, line: 216, baseType: !157)
!156 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!157 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "xdrProc", scope: !146, file: !93, line: 66, baseType: !81, size: 64, align: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "xdrSize", scope: !146, file: !93, line: 68, baseType: !155, size: 64, align: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "dfltRecvFn", scope: !141, file: !93, line: 119, baseType: !150, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "sendFn", scope: !141, file: !93, line: 121, baseType: !164, size: 64, align: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugSendFn", file: !93, line: 102, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!46, !168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugMsgMapping", file: !93, line: 86, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcDebugMsgMapping", file: !93, line: 81, size: 256, align: 64, elements: !171)
!171 = !{!172, !173, !174, !191}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !170, file: !93, line: 82, baseType: !56, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "messageLen", scope: !170, file: !93, line: 83, baseType: !155, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "validateFn", scope: !170, file: !93, line: 84, baseType: !175, size: 64, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugValidateFn", file: !93, line: 77, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!46, !179, !46}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcInData", file: !102, line: 77, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcInData", file: !102, line: 51, size: 512, align: 64, elements: !182)
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !102, line: 53, baseType: !130, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !181, file: !102, line: 58, baseType: !130, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "argsSize", scope: !181, file: !102, line: 60, baseType: !155, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !181, file: !102, line: 65, baseType: !154, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "resultLen", scope: !181, file: !102, line: 67, baseType: !155, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "freeResult", scope: !181, file: !102, line: 72, baseType: !46, size: 32, align: 32, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "appCtx", scope: !181, file: !102, line: 74, baseType: !38, size: 64, align: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !181, file: !102, line: 76, baseType: !38, size: 64, align: 64, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "freeMsg", scope: !170, file: !93, line: 85, baseType: !46, size: 32, align: 32, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "shutdownFn", scope: !141, file: !93, line: 123, baseType: !193, size: 64, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugShutdownFn", file: !93, line: 105, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !104, !197}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "plugin", scope: !141, file: !93, line: 125, baseType: !199, size: 64, align: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginData", file: !4, line: 545, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginData", file: !4, line: 501, size: 256, align: 64, elements: !202)
!202 = !{!203, !204, !211, !217}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !201, file: !4, line: 503, baseType: !130, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !201, file: !4, line: 508, baseType: !205, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !76, line: 37, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !76, line: 41, size: 128, align: 64, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !76, line: 43, baseType: !56, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !207, file: !76, line: 44, baseType: !67, size: 32, align: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "errorCb", scope: !201, file: !4, line: 539, baseType: !212, size: 64, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!46, !104, !215, !81, !216}
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppType", file: !4, line: 360, baseType: !7)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !201, file: !4, line: 544, baseType: !81, size: 64, align: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !53, file: !52, line: 87, baseType: !105, size: 576, align: 64, offset: 768)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "providers", scope: !53, file: !52, line: 88, baseType: !205, size: 64, align: 64, offset: 1344)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "vsockDev", scope: !53, file: !52, line: 97, baseType: !49, size: 32, align: 32, offset: 1408)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "vsockFamily", scope: !53, file: !52, line: 98, baseType: !49, size: 32, align: 32, offset: 1440)
!222 = !{}
!223 = !DILocalVariable(name: "state", arg: 1, scope: !42, file: !43, line: 214, type: !50)
!224 = !DIExpression()
!225 = !DILocation(line: 214, column: 47, scope: !42)
!226 = !DILocalVariable(name: "argc", arg: 2, scope: !42, file: !43, line: 215, type: !49)
!227 = !DILocation(line: 215, column: 32, scope: !42)
!228 = !DILocalVariable(name: "argv", arg: 3, scope: !42, file: !43, line: 216, type: !158)
!229 = !DILocation(line: 216, column: 34, scope: !42)
!230 = !DILocalVariable(name: "i", scope: !42, file: !43, line: 218, type: !49)
!231 = !DILocation(line: 218, column: 8, scope: !42)
!232 = !DILocalVariable(name: "cmdStr", scope: !42, file: !43, line: 219, type: !154)
!233 = !DILocation(line: 219, column: 10, scope: !42)
!234 = !DILocalVariable(name: "ret", scope: !42, file: !43, line: 220, type: !46)
!235 = !DILocation(line: 220, column: 13, scope: !42)
!236 = !DILocalVariable(name: "version", scope: !42, file: !43, line: 221, type: !46)
!237 = !DILocation(line: 221, column: 13, scope: !42)
!238 = !DILocalVariable(name: "unused", scope: !42, file: !43, line: 226, type: !46)
!239 = !DILocation(line: 226, column: 13, scope: !42)
!240 = !DILocalVariable(name: "clOptions", scope: !42, file: !43, line: 227, type: !241)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 4608, align: 64, elements: !253)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOptionEntry", file: !14, line: 52, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GOptionEntry", file: !14, line: 257, size: 384, align: 64, elements: !244)
!244 = !{!245, !246, !247, !248, !250, !251, !252}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !243, file: !14, line: 259, baseType: !111, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "short_name", scope: !243, file: !14, line: 260, baseType: !57, size: 8, align: 8, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !243, file: !14, line: 261, baseType: !48, size: 32, align: 32, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !243, file: !14, line: 263, baseType: !249, size: 32, align: 32, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOptionArg", file: !14, line: 129, baseType: !13)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "arg_data", scope: !243, file: !14, line: 264, baseType: !81, size: 64, align: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !243, file: !14, line: 266, baseType: !111, size: 64, align: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "arg_description", scope: !243, file: !14, line: 267, baseType: !111, size: 64, align: 64, offset: 320)
!253 = !{!254}
!254 = !DISubrange(count: 12)
!255 = !DILocation(line: 227, column: 17, scope: !42)
!256 = !DILocation(line: 227, column: 31, scope: !42)
!257 = !DILocation(line: 228, column: 7, scope: !42)
!258 = !DILocation(line: 228, column: 47, scope: !42)
!259 = !DILocation(line: 228, column: 54, scope: !42)
!260 = !DILocation(line: 228, column: 46, scope: !42)
!261 = !DILocation(line: 229, column: 10, scope: !42)
!262 = !DILocation(line: 230, column: 10, scope: !42)
!263 = !DILocation(line: 231, column: 7, scope: !42)
!264 = !DILocation(line: 231, column: 57, scope: !42)
!265 = !DILocation(line: 231, column: 64, scope: !42)
!266 = !DILocation(line: 231, column: 56, scope: !42)
!267 = !DILocation(line: 232, column: 10, scope: !42)
!268 = !DILocation(line: 233, column: 10, scope: !42)
!269 = !DILocation(line: 234, column: 7, scope: !42)
!270 = !DILocation(line: 234, column: 56, scope: !42)
!271 = !DILocation(line: 234, column: 63, scope: !42)
!272 = !DILocation(line: 234, column: 55, scope: !42)
!273 = !DILocation(line: 235, column: 10, scope: !42)
!274 = !DILocation(line: 236, column: 10, scope: !42)
!275 = !DILocation(line: 237, column: 7, scope: !42)
!276 = !DILocation(line: 238, column: 10, scope: !42)
!277 = !DILocation(line: 239, column: 10, scope: !42)
!278 = !DILocation(line: 257, column: 7, scope: !42)
!279 = !DILocation(line: 257, column: 55, scope: !42)
!280 = !DILocation(line: 257, column: 62, scope: !42)
!281 = !DILocation(line: 257, column: 54, scope: !42)
!282 = !DILocation(line: 258, column: 10, scope: !42)
!283 = !DILocation(line: 259, column: 10, scope: !42)
!284 = !DILocation(line: 260, column: 7, scope: !42)
!285 = !DILocation(line: 260, column: 48, scope: !42)
!286 = !DILocation(line: 260, column: 55, scope: !42)
!287 = !DILocation(line: 260, column: 59, scope: !42)
!288 = !DILocation(line: 260, column: 47, scope: !42)
!289 = !DILocation(line: 261, column: 10, scope: !42)
!290 = !DILocation(line: 262, column: 10, scope: !42)
!291 = !DILocation(line: 263, column: 7, scope: !42)
!292 = !DILocation(line: 263, column: 49, scope: !42)
!293 = !DILocation(line: 263, column: 56, scope: !42)
!294 = !DILocation(line: 263, column: 60, scope: !42)
!295 = !DILocation(line: 263, column: 48, scope: !42)
!296 = !DILocation(line: 264, column: 10, scope: !42)
!297 = !DILocation(line: 265, column: 10, scope: !42)
!298 = !DILocation(line: 267, column: 7, scope: !42)
!299 = !DILocation(line: 267, column: 51, scope: !42)
!300 = !DILocation(line: 267, column: 58, scope: !42)
!301 = !DILocation(line: 267, column: 50, scope: !42)
!302 = !DILocation(line: 268, column: 10, scope: !42)
!303 = !DILocation(line: 269, column: 10, scope: !42)
!304 = !DILocation(line: 270, column: 7, scope: !42)
!305 = !DILocation(line: 270, column: 50, scope: !42)
!306 = !DILocation(line: 270, column: 57, scope: !42)
!307 = !DILocation(line: 270, column: 49, scope: !42)
!308 = !DILocation(line: 271, column: 10, scope: !42)
!309 = !DILocation(line: 272, column: 10, scope: !42)
!310 = !DILocation(line: 273, column: 7, scope: !42)
!311 = !DILocation(line: 273, column: 43, scope: !42)
!312 = !DILocation(line: 274, column: 10, scope: !42)
!313 = !DILocation(line: 276, column: 7, scope: !42)
!314 = !DILocation(line: 276, column: 47, scope: !42)
!315 = !DILocation(line: 277, column: 10, scope: !42)
!316 = !DILocalVariable(name: "error", scope: !42, file: !43, line: 281, type: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !319, line: 42, baseType: !320)
!319 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !319, line: 44, size: 128, align: 64, elements: !321)
!321 = !{!322, !327, !328}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !320, file: !319, line: 46, baseType: !323, size: 32, align: 32)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !324, line: 36, baseType: !325)
!324 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !326, line: 45, baseType: !68)
!326 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line1381")
!327 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !320, file: !319, line: 47, baseType: !48, size: 32, align: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !320, file: !319, line: 48, baseType: !56, size: 64, align: 64, offset: 64)
!329 = !DILocation(line: 281, column: 12, scope: !42)
!330 = !DILocalVariable(name: "context", scope: !42, file: !43, line: 282, type: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOptionContext", file: !14, line: 38, baseType: !333)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GOptionContext", file: !14, line: 38, flags: DIFlagFwdDecl)
!334 = !DILocation(line: 282, column: 20, scope: !42)
!335 = !DILocation(line: 285, column: 4, scope: !42)
!336 = !DILocation(line: 285, column: 11, scope: !42)
!337 = !DILocation(line: 285, column: 15, scope: !42)
!338 = !DILocation(line: 285, column: 23, scope: !42)
!339 = !DILocation(line: 286, column: 4, scope: !42)
!340 = !DILocation(line: 286, column: 11, scope: !42)
!341 = !DILocation(line: 286, column: 15, scope: !42)
!342 = !DILocation(line: 286, column: 24, scope: !42)
!343 = !DILocation(line: 293, column: 41, scope: !42)
!344 = !DILocation(line: 293, column: 13, scope: !42)
!345 = !DILocation(line: 293, column: 11, scope: !42)
!346 = !DILocation(line: 294, column: 11, scope: !347)
!347 = distinct !DILexicalBlock(scope: !42, file: !43, line: 294, column: 4)
!348 = !DILocation(line: 294, column: 9, scope: !347)
!349 = !DILocation(line: 294, column: 16, scope: !350)
!350 = !DILexicalBlockFile(scope: !351, file: !43, discriminator: 1)
!351 = distinct !DILexicalBlock(scope: !347, file: !43, line: 294, column: 4)
!352 = !DILocation(line: 294, column: 20, scope: !350)
!353 = !DILocation(line: 294, column: 18, scope: !350)
!354 = !DILocation(line: 294, column: 4, scope: !350)
!355 = !DILocalVariable(name: "prefix", scope: !356, file: !43, line: 295, type: !154)
!356 = distinct !DILexicalBlock(scope: !351, file: !43, line: 294, column: 31)
!357 = !DILocation(line: 295, column: 13, scope: !356)
!358 = !DILocation(line: 295, column: 22, scope: !356)
!359 = !DILocation(line: 296, column: 47, scope: !356)
!360 = !DILocation(line: 296, column: 60, scope: !356)
!361 = !DILocation(line: 296, column: 55, scope: !356)
!362 = !DILocation(line: 296, column: 16, scope: !356)
!363 = !DILocation(line: 296, column: 14, scope: !356)
!364 = !DILocation(line: 297, column: 12, scope: !356)
!365 = !DILocation(line: 297, column: 7, scope: !356)
!366 = !DILocation(line: 304, column: 4, scope: !356)
!367 = !DILocation(line: 294, column: 27, scope: !368)
!368 = !DILexicalBlockFile(scope: !351, file: !43, discriminator: 2)
!369 = !DILocation(line: 294, column: 4, scope: !368)
!370 = distinct !{!370, !371}
!371 = !DILocation(line: 294, column: 4, scope: !42)
!372 = !DILocation(line: 306, column: 14, scope: !42)
!373 = !DILocation(line: 306, column: 12, scope: !42)
!374 = !DILocation(line: 308, column: 33, scope: !42)
!375 = !DILocation(line: 308, column: 4, scope: !42)
!376 = !DILocation(line: 310, column: 38, scope: !42)
!377 = !DILocation(line: 310, column: 47, scope: !42)
!378 = !DILocation(line: 310, column: 4, scope: !42)
!379 = !DILocation(line: 311, column: 66, scope: !42)
!380 = !DILocation(line: 311, column: 34, scope: !42)
!381 = !DILocation(line: 311, column: 4, scope: !382)
!382 = !DILexicalBlockFile(scope: !42, file: !43, discriminator: 1)
!383 = !DILocation(line: 314, column: 32, scope: !384)
!384 = distinct !DILexicalBlock(scope: !42, file: !43, line: 314, column: 8)
!385 = !DILocation(line: 314, column: 9, scope: !384)
!386 = !DILocation(line: 314, column: 8, scope: !42)
!387 = !DILocation(line: 315, column: 63, scope: !388)
!388 = distinct !DILexicalBlock(scope: !384, file: !43, line: 314, column: 64)
!389 = !DILocation(line: 315, column: 70, scope: !388)
!390 = !DILocation(line: 315, column: 7, scope: !388)
!391 = !DILocation(line: 316, column: 7, scope: !388)
!392 = !DILocation(line: 319, column: 8, scope: !393)
