; ModuleID = './wiperPosix.o.i'
source_filename = "./wiperPosix.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.PartitionInfo = type { i8*, i32, i8*, i8 }
%struct.WiperPartition = type { [256 x i8], i32, i8, i8*, %struct.DblLnkLst_Links }
%struct.DblLnkLst_Links = type { %struct.DblLnkLst_Links*, %struct.DblLnkLst_Links* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.mntent = type { i8*, i8*, i8*, i8*, i32, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.statfs = type { i64, i64, i64, i64, i64, i64, i64, %struct.__fsid_t, i64, i64, i64, [4 x i64] }
%struct.__fsid_t = type { [2 x i32] }
%struct.WiperPartition_List = type { %struct.DblLnkLst_Links }
%struct.Wiper_State = type opaque
%struct.WiperState = type { i32, %struct.WiperPartition*, %struct.File*, i32, [65536 x i8], i32 }
%struct.File = type { [256 x i8], %struct.FileIODescriptor, i64, %struct.File* }
%struct.FileIODescriptor = type { i32, i32, i8*, %struct.FileLockToken* }
%struct.FileLockToken = type opaque
%struct.WiperInitData = type {}


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !53, globals: !126)
!1 = !DIFile(filename: "wiperPosix.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1100")
!2 = !{!3, !19, !24, !40, !47}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/wiper.h", directory: "/home/lichi/Desktop/open-vm-tools/line1100")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!6 = !DIEnumerator(name: "PARTITION_UNSUPPORTED", value: 0)
!7 = !DIEnumerator(name: "PARTITION_EXT2", value: 1)
!8 = !DIEnumerator(name: "PARTITION_EXT3", value: 2)
!9 = !DIEnumerator(name: "PARTITION_REISERFS", value: 3)
!10 = !DIEnumerator(name: "PARTITION_NTFS", value: 4)
!11 = !DIEnumerator(name: "PARTITION_FAT", value: 5)
!12 = !DIEnumerator(name: "PARTITION_UFS", value: 6)
!13 = !DIEnumerator(name: "PARTITION_PCFS", value: 7)
!14 = !DIEnumerator(name: "PARTITION_EXT4", value: 8)
!15 = !DIEnumerator(name: "PARTITION_HFS", value: 9)
!16 = !DIEnumerator(name: "PARTITION_ZFS", value: 10)
!17 = !DIEnumerator(name: "PARTITION_XFS", value: 11)
!18 = !DIEnumerator(name: "PARTITION_BTRFS", value: 12)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 83, size: 32, align: 32, elements: !21)
!20 = !DIFile(filename: "wiperPosix.c", directory: "/home/lichi/Desktop/open-vm-tools/line1100")
!21 = !{!22, !23}
!22 = !DIEnumerator(name: "WIPER_PHASE_CREATE", value: 0)
!23 = !DIEnumerator(name: "WIPER_PHASE_FILL", value: 1)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 264, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/fileIO.h", directory: "/home/lichi/Desktop/open-vm-tools/line1100")
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39}
!27 = !DIEnumerator(name: "FILEIO_SUCCESS", value: 0)
!28 = !DIEnumerator(name: "FILEIO_CANCELLED", value: 1)
!29 = !DIEnumerator(name: "FILEIO_ERROR", value: 2)
!30 = !DIEnumerator(name: "FILEIO_OPEN_ERROR_EXIST", value: 3)
!31 = !DIEnumerator(name: "FILEIO_LOCK_FAILED", value: 4)
!32 = !DIEnumerator(name: "FILEIO_READ_ERROR_EOF", value: 5)
!33 = !DIEnumerator(name: "FILEIO_FILE_NOT_FOUND", value: 6)
!34 = !DIEnumerator(name: "FILEIO_NO_PERMISSION", value: 7)
!35 = !DIEnumerator(name: "FILEIO_FILE_NAME_TOO_LONG", value: 8)
!36 = !DIEnumerator(name: "FILEIO_WRITE_ERROR_FBIG", value: 9)
!37 = !DIEnumerator(name: "FILEIO_WRITE_ERROR_NOSPC", value: 10)
!38 = !DIEnumerator(name: "FILEIO_WRITE_ERROR_DQUOT", value: 11)
!39 = !DIEnumerator(name: "FILEIO_ERROR_LAST", value: 12)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 256, size: 32, align: 32, elements: !41)
!41 = !{!42, !43, !44, !45, !46}
!42 = !DIEnumerator(name: "FILEIO_OPEN", value: 0)
!43 = !DIEnumerator(name: "FILEIO_OPEN_EMPTY", value: 1)
!44 = !DIEnumerator(name: "FILEIO_OPEN_CREATE", value: 2)
!45 = !DIEnumerator(name: "FILEIO_OPEN_CREATE_SAFE", value: 3)
!46 = !DIEnumerator(name: "FILEIO_OPEN_CREATE_EMPTY", value: 4)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 34, size: 32, align: 32, elements: !49)
!48 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmstdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1100")
!49 = !{!50, !51, !52}
!50 = !DIEnumerator(name: "StdIO_Error", value: 0)
!51 = !DIEnumerator(name: "StdIO_EOF", value: 1)
!52 = !DIEnumerator(name: "StdIO_Success", value: 2)
!53 = !{!54, !55, !60, !125, !94}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !56, line: 171, baseType: !57)
!56 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1100")
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !58, line: 55, baseType: !59)
!58 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line1100")
!59 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "WiperState", file: !20, line: 109, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WiperState", file: !20, line: 96, size: 524544, align: 64, elements: !63)
!63 = !{!64, !66, !93, !114, !116, !120}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !62, file: !20, line: 98, baseType: !65, size: 32, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "WiperPhase", file: !20, line: 86, baseType: !19)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !62, file: !20, line: 100, baseType: !67, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "WiperPartition", file: !4, line: 86, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WiperPartition", file: !4, line: 62, size: 2304, align: 64, elements: !71)
!71 = !{!72, !77, !79, !82, !85}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mountPoint", scope: !70, file: !4, line: 63, baseType: !73, size: 2048, align: 8)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 2048, align: 8, elements: !75)
!74 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!75 = !{!76}
!76 = !DISubrange(count: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !70, file: !4, line: 66, baseType: !78, size: 32, align: 32, offset: 2048)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "WiperPartition_Type", file: !4, line: 56, baseType: !3)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "attemptUnmaps", scope: !70, file: !4, line: 72, baseType: !80, size: 8, align: 8, offset: 2080)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !56, line: 230, baseType: !81)
!81 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !70, file: !4, line: 78, baseType: !83, size: 64, align: 64, offset: 2112)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !70, file: !4, line: 85, baseType: !86, size: 128, align: 64, offset: 2176)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "DblLnkLst_Links", file: !87, line: 94, baseType: !88)
!87 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dbllnklst.h", directory: "/home/lichi/Desktop/open-vm-tools/line1100")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DblLnkLst_Links", file: !87, line: 91, size: 128, align: 64, elements: !89)
!89 = !{!90, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !88, file: !87, line: 92, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !88, file: !87, line: 93, baseType: !91, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !62, file: !20, line: 102, baseType: !94, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "File", file: !20, line: 93, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !20, line: 88, size: 2368, align: 64, elements: !97)
!97 = !{!98, !99, !111, !112}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !96, file: !20, line: 89, baseType: !73, size: 2048, align: 8)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !96, file: !20, line: 90, baseType: !100, size: 192, align: 64, offset: 2048)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "FileIODescriptor", file: !25, line: 79, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileIODescriptor", file: !25, line: 74, size: 192, align: 64, elements: !102)
!102 = !{!103, !105, !106, !108}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "posix", scope: !101, file: !25, line: 75, baseType: !104, size: 32, align: 32)
!104 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !101, file: !25, line: 76, baseType: !104, size: 32, align: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "fileName", scope: !101, file: !25, line: 77, baseType: !107, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "lockToken", scope: !101, file: !25, line: 78, baseType: !109, size: 64, align: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileLockToken", file: !25, line: 59, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !96, file: !20, line: 91, baseType: !55, size: 64, align: 64, offset: 2240)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !96, file: !20, line: 92, baseType: !113, size: 64, align: 64, offset: 2304)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !62, file: !20, line: 104, baseType: !115, size: 32, align: 32, offset: 192)
!115 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !62, file: !20, line: 106, baseType: !117, size: 524288, align: 8, offset: 224)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 524288, align: 8, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 65536)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "euid", scope: !62, file: !20, line: 108, baseType: !121, size: 32, align: 32, offset: 524512)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !122, line: 81, baseType: !123)
!122 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "/home/lichi/Desktop/open-vm-tools/line1100")
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !124, line: 125, baseType: !115)
!124 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1100")
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!126 = !{!127, !135, !139, !140, !142, !154, !158}
!127 = distinct !DIGlobalVariable(name: "diskDevNames", scope: !128, file: !20, line: 207, type: !132, isLocal: true, isDefinition: true, variable: [43 x i8]* @WiperCollectDiskMajors.diskDevNames)
!128 = distinct !DISubprogram(name: "WiperCollectDiskMajors", scope: !20, file: !20, line: 205, type: !129, isLocal: true, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !131)
!129 = !DISubroutineType(types: !130)
!130 = !{null}
!131 = !{}
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 344, align: 8, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 43)
!135 = distinct !DIGlobalVariable(name: "blockSeparator", scope: !128, file: !20, line: 208, type: !136, isLocal: true, isDefinition: true, variable: [15 x i8]* @WiperCollectDiskMajors.blockSeparator)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 120, align: 8, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 15)
!139 = distinct !DIGlobalVariable(name: "numDiskMajors", scope: !0, file: !20, line: 183, type: !104, isLocal: true, isDefinition: true, variable: i32* @numDiskMajors)
!140 = distinct !DIGlobalVariable(name: "knownDiskMajor", scope: !0, file: !20, line: 168, type: !141, isLocal: true, isDefinition: true, variable: [256 x i32]* @knownDiskMajor)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 8192, align: 32, elements: !75)
!142 = distinct !DIGlobalVariable(name: "gKnownPartitions", scope: !0, file: !20, line: 130, type: !143, isLocal: true, isDefinition: true, variable: [20 x %struct.PartitionInfo]* @gKnownPartitions)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 5120, align: 64, elements: !152)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PartitionInfo", file: !20, line: 123, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PartitionInfo", file: !20, line: 118, size: 256, align: 64, elements: !147)
!147 = !{!148, !149, !150, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !146, file: !20, line: 119, baseType: !83, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !146, file: !20, line: 120, baseType: !78, size: 32, align: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !146, file: !20, line: 121, baseType: !83, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "diskBacked", scope: !146, file: !20, line: 122, baseType: !80, size: 8, align: 8, offset: 192)
!152 = !{!153}
!153 = !DISubrange(count: 20)
!154 = distinct !DIGlobalVariable(name: "gRemoteFS", scope: !0, file: !20, line: 128, type: !155, isLocal: true, isDefinition: true, variable: [19 x i8]* @gRemoteFS)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 152, align: 8, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 19)
!158 = distinct !DIGlobalVariable(name: "initDone", scope: !0, file: !20, line: 153, type: !80, isLocal: true, isDefinition: true, variable: i8* @initDone)
!159 = !{i32 2, !"Dwarf Version", i32 4}
!160 = !{i32 2, !"Debug Info Version", i32 3}
!161 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!162 = distinct !DISubprogram(name: "WiperSinglePartition_Open", scope: !20, file: !20, line: 503, type: !163, isLocal: false, isDefinition: true, scopeLine: 505, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !131)
!163 = !DISubroutineType(types: !164)
!164 = !{!165, !83, !80}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!166 = !DILocalVariable(name: "mountPoint", arg: 1, scope: !162, file: !20, line: 503, type: !83)
!167 = !DIExpression()
!168 = !DILocation(line: 503, column: 39, scope: !162)
!169 = !DILocalVariable(name: "shrinkableOnly", arg: 2, scope: !162, file: !20, line: 504, type: !80)
!170 = !DILocation(line: 504, column: 32, scope: !162)
!171 = !DILocalVariable(name: "mntpt", scope: !162, file: !20, line: 506, type: !107)
!172 = !DILocation(line: 506, column: 10, scope: !162)
!173 = !DILocalVariable(name: "fp", scope: !162, file: !20, line: 507, type: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !176, line: 48, baseType: !177)
!176 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1100")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !178, line: 241, size: 1728, align: 64, elements: !179)
!178 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1100")
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !200, !201, !202, !203, !206, !208, !210, !214, !217, !219, !220, !221, !222, !223, !226, !227}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !177, file: !178, line: 242, baseType: !104, size: 32, align: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !177, file: !178, line: 247, baseType: !107, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !177, file: !178, line: 248, baseType: !107, size: 64, align: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !177, file: !178, line: 249, baseType: !107, size: 64, align: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !177, file: !178, line: 250, baseType: !107, size: 64, align: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !177, file: !178, line: 251, baseType: !107, size: 64, align: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !177, file: !178, line: 252, baseType: !107, size: 64, align: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !177, file: !178, line: 253, baseType: !107, size: 64, align: 64, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !177, file: !178, line: 254, baseType: !107, size: 64, align: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !177, file: !178, line: 256, baseType: !107, size: 64, align: 64, offset: 576)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !177, file: !178, line: 257, baseType: !107, size: 64, align: 64, offset: 640)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !177, file: !178, line: 258, baseType: !107, size: 64, align: 64, offset: 704)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !177, file: !178, line: 260, baseType: !193, size: 64, align: 64, offset: 768)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !178, line: 156, size: 192, align: 64, elements: !195)
!195 = !{!196, !197, !199}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !194, file: !178, line: 157, baseType: !193, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !194, file: !178, line: 158, baseType: !198, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !194, file: !178, line: 162, baseType: !104, size: 32, align: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !177, file: !178, line: 262, baseType: !198, size: 64, align: 64, offset: 832)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !177, file: !178, line: 264, baseType: !104, size: 32, align: 32, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !177, file: !178, line: 268, baseType: !104, size: 32, align: 32, offset: 928)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !177, file: !178, line: 270, baseType: !204, size: 64, align: 64, offset: 960)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !124, line: 131, baseType: !205)
!205 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !177, file: !178, line: 274, baseType: !207, size: 16, align: 16, offset: 1024)
!207 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !177, file: !178, line: 275, baseType: !209, size: 8, align: 8, offset: 1040)
!209 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !177, file: !178, line: 276, baseType: !211, size: 8, align: 8, offset: 1048)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 8, align: 8, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 1)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !177, file: !178, line: 280, baseType: !215, size: 64, align: 64, offset: 1088)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !178, line: 150, baseType: null)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !177, file: !178, line: 289, baseType: !218, size: 64, align: 64, offset: 1152)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !124, line: 132, baseType: !205)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !177, file: !178, line: 297, baseType: !54, size: 64, align: 64, offset: 1216)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !177, file: !178, line: 298, baseType: !54, size: 64, align: 64, offset: 1280)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !177, file: !178, line: 299, baseType: !54, size: 64, align: 64, offset: 1344)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !177, file: !178, line: 300, baseType: !54, size: 64, align: 64, offset: 1408)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !177, file: !178, line: 302, baseType: !224, size: 64, align: 64, offset: 1472)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !225, line: 216, baseType: !59)
!225 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1100")
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !177, file: !178, line: 303, baseType: !104, size: 32, align: 32, offset: 1536)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !177, file: !178, line: 305, baseType: !228, size: 160, align: 8, offset: 1568)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 160, align: 8, elements: !152)
!229 = !DILocation(line: 507, column: 11, scope: !162)
!230 = !DILocalVariable(name: "len", scope: !162, file: !20, line: 508, type: !104)
!231 = !DILocation(line: 508, column: 8, scope: !162)
!232 = !DILocalVariable(name: "mnt", scope: !162, file: !20, line: 509, type: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mntent", file: !235, line: 53, size: 320, align: 64, elements: !236)
!235 = !DIFile(filename: "/usr/include/mntent.h", directory: "/home/lichi/Desktop/open-vm-tools/line1100")
!236 = !{!237, !238, !239, !240, !241, !242}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_fsname", scope: !234, file: !235, line: 55, baseType: !107, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_dir", scope: !234, file: !235, line: 56, baseType: !107, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_type", scope: !234, file: !235, line: 57, baseType: !107, size: 64, align: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_opts", scope: !234, file: !235, line: 58, baseType: !107, size: 64, align: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_freq", scope: !234, file: !235, line: 59, baseType: !104, size: 32, align: 32, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_passno", scope: !234, file: !235, line: 60, baseType: !104, size: 32, align: 32, offset: 288)
!243 = !DILocation(line: 509, column: 19, scope: !162)
!244 = !DILocalVariable(name: "p", scope: !162, file: !20, line: 510, type: !165)
!245 = !DILocation(line: 510, column: 20, scope: !162)
!246 = !DILocation(line: 514, column: 9, scope: !162)
!247 = !DILocation(line: 514, column: 7, scope: !162)
!248 = !DILocation(line: 515, column: 8, scope: !249)
!249 = distinct !DILexicalBlock(scope: !162, file: !20, line: 515, column: 8)
!250 = !DILocation(line: 515, column: 11, scope: !249)
!251 = !DILocation(line: 515, column: 8, scope: !162)
!252 = !DILocation(line: 516, column: 7, scope: !253)
!253 = distinct !DILexicalBlock(scope: !249, file: !20, line: 515, column: 19)
!254 = !DILocation(line: 517, column: 7, scope: !253)
!255 = !DILocation(line: 520, column: 29, scope: !162)
!256 = !DILocation(line: 520, column: 12, scope: !162)
!257 = !DILocation(line: 520, column: 10, scope: !162)
!258 = !DILocalVariable(name: "tmp", scope: !259, file: !20, line: 526, type: !107)
!259 = distinct !DILexicalBlock(scope: !162, file: !20, line: 525, column: 4)
!260 = !DILocation(line: 526, column: 13, scope: !259)
!261 = !DILocation(line: 526, column: 33, scope: !259)
!262 = !DILocation(line: 526, column: 26, scope: !259)
!263 = !DILocation(line: 526, column: 40, scope: !259)
!264 = !DILocation(line: 526, column: 20, scope: !259)
!265 = !DILocation(line: 527, column: 12, scope: !266)
!266 = distinct !DILexicalBlock(scope: !259, file: !20, line: 527, column: 11)
!267 = !DILocation(line: 527, column: 11, scope: !266)
!268 = !DILocation(line: 527, column: 16, scope: !266)
!269 = !DILocation(line: 527, column: 11, scope: !259)
!270 = !DILocation(line: 528, column: 11, scope: !271)
!271 = distinct !DILexicalBlock(scope: !266, file: !20, line: 527, column: 24)
!272 = !DILocation(line: 528, column: 15, scope: !271)
!273 = !DILocation(line: 529, column: 7, scope: !271)
!274 = !DILocation(line: 532, column: 17, scope: !162)
!275 = !DILocation(line: 532, column: 10, scope: !162)
!276 = !DILocation(line: 532, column: 8, scope: !162)
!277 = !DILocation(line: 533, column: 4, scope: !162)
!278 = !DILocation(line: 533, column: 35, scope: !279)
!279 = !DILexicalBlockFile(scope: !162, file: !20, discriminator: 1)
!280 = !DILocation(line: 533, column: 19, scope: !279)
!281 = !DILocation(line: 533, column: 17, scope: !279)
!282 = !DILocation(line: 533, column: 40, scope: !279)
!283 = !DILocation(line: 533, column: 4, scope: !279)
!284 = !DILocation(line: 534, column: 19, scope: !285)
!285 = distinct !DILexicalBlock(scope: !286, file: !20, line: 534, column: 11)
!286 = distinct !DILexicalBlock(scope: !162, file: !20, line: 533, column: 13)
!287 = !DILocation(line: 534, column: 24, scope: !285)
!288 = !DILocation(line: 534, column: 33, scope: !285)
!289 = !DILocation(line: 534, column: 40, scope: !285)
!290 = !DILocation(line: 534, column: 11, scope: !285)
!291 = !DILocation(line: 534, column: 45, scope: !285)
!292 = !DILocation(line: 534, column: 11, scope: !286)
!293 = !DILocation(line: 536, column: 14, scope: !294)
!294 = distinct !DILexicalBlock(scope: !285, file: !20, line: 534, column: 51)
!295 = !DILocation(line: 536, column: 12, scope: !294)
!296 = !DILocation(line: 537, column: 14, scope: !297)
!297 = distinct !DILexicalBlock(scope: !294, file: !20, line: 537, column: 14)
!298 = !DILocation(line: 537, column: 16, scope: !297)
!299 = !DILocation(line: 537, column: 14, scope: !294)
!300 = !DILocation(line: 538, column: 13, scope: !301)
!301 = distinct !DILexicalBlock(scope: !297, file: !20, line: 537, column: 24)
!302 = !DILocation(line: 539, column: 10, scope: !301)
!303 = !DILocation(line: 539, column: 34, scope: !304)
!304 = !DILexicalBlockFile(scope: !305, file: !20, discriminator: 1)
!305 = distinct !DILexicalBlock(scope: !297, file: !20, line: 539, column: 21)
!306 = !DILocation(line: 539, column: 37, scope: !304)
!307 = !DILocation(line: 540, column: 40, scope: !305)
!308 = !DILocation(line: 540, column: 45, scope: !305)
!309 = !DILocation(line: 539, column: 21, scope: !304)
!310 = !DILocation(line: 540, column: 54, scope: !305)
!311 = !DILocation(line: 541, column: 13, scope: !312)
!312 = distinct !DILexicalBlock(scope: !305, file: !20, line: 540, column: 61)
!313 = !DILocation(line: 542, column: 40, scope: !312)
!314 = !DILocation(line: 542, column: 13, scope: !312)
!315 = !DILocation(line: 543, column: 15, scope: !312)
!316 = !DILocation(line: 544, column: 10, scope: !312)
!317 = !DILocation(line: 545, column: 13, scope: !318)
!318 = distinct !DILexicalBlock(scope: !305, file: !20, line: 544, column: 17)
!319 = !DILocation(line: 546, column: 34, scope: !318)
!320 = !DILocation(line: 546, column: 37, scope: !318)
!321 = !DILocation(line: 546, column: 42, scope: !318)
!322 = !DILocation(line: 546, column: 13, scope: !318)
!323 = !DILocation(line: 549, column: 10, scope: !294)
!324 = !DILocation(line: 533, column: 4, scope: !325)
!325 = !DILexicalBlockFile(scope: !162, file: !20, discriminator: 2)
!326 = distinct !{!326, !277}
!327 = !DILocation(line: 553, column: 55, scope: !162)
!328 = !DILocation(line: 553, column: 4, scope: !162)
!329 = !DILocation(line: 556, column: 9, scope: !162)
!330 = !DILocation(line: 556, column: 4, scope: !162)
!331 = !DILocation(line: 557, column: 22, scope: !162)
!332 = !DILocation(line: 557, column: 12, scope: !162)
!333 = !DILocation(line: 557, column: 26, scope: !162)
!334 = !DILocation(line: 558, column: 11, scope: !162)
!335 = !DILocation(line: 558, column: 4, scope: !162)
!336 = !DILocation(line: 559, column: 1, scope: !162)
!337 = !DILocalVariable(name: "seenBlockSeparator", scope: !128, file: !20, line: 209, type: !80)
!338 = !DILocation(line: 209, column: 9, scope: !128)
!339 = !DILocalVariable(name: "buf", scope: !128, file: !20, line: 210, type: !107)
!340 = !DILocation(line: 210, column: 10, scope: !128)
!341 = !DILocalVariable(name: "major", scope: !128, file: !20, line: 211, type: !104)
!342 = !DILocation(line: 211, column: 8, scope: !128)
!343 = !DILocalVariable(name: "device", scope: !128, file: !20, line: 212, type: !344)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 512, align: 8, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 64)
!347 = !DILocation(line: 212, column: 9, scope: !128)
!348 = !DILocalVariable(name: "f", scope: !128, file: !20, line: 213, type: !174)
!349 = !DILocation(line: 213, column: 10, scope: !128)
!350 = !DILocation(line: 215, column: 18, scope: !128)
!351 = !DILocation(line: 217, column: 8, scope: !128)
!352 = !DILocation(line: 217, column: 6, scope: !128)
!353 = !DILocation(line: 218, column: 9, scope: !354)
!354 = distinct !DILexicalBlock(scope: !128, file: !20, line: 218, column: 8)
!355 = !DILocation(line: 218, column: 8, scope: !128)
!356 = !DILocation(line: 219, column: 7, scope: !357)
!357 = distinct !DILexicalBlock(scope: !354, file: !20, line: 218, column: 12)
!358 = !DILocation(line: 222, column: 4, scope: !128)
!359 = !DILocation(line: 222, column: 30, scope: !360)
!360 = !DILexicalBlockFile(scope: !128, file: !20, discriminator: 1)
!361 = !DILocation(line: 222, column: 11, scope: !360)
!362 = !DILocation(line: 222, column: 47, scope: !360)
!363 = !DILocation(line: 222, column: 4, scope: !360)
!364 = !DILocation(line: 224, column: 12, scope: !365)
!365 = distinct !DILexicalBlock(scope: !366, file: !20, line: 224, column: 11)
!366 = distinct !DILexicalBlock(scope: !128, file: !20, line: 222, column: 65)
!367 = !DILocation(line: 224, column: 11, scope: !366)
!368 = !DILocation(line: 225, column: 22, scope: !369)
!369 = distinct !DILexicalBlock(scope: !370, file: !20, line: 225, column: 14)
!370 = distinct !DILexicalBlock(scope: !365, file: !20, line: 224, column: 32)
!371 = !DILocation(line: 225, column: 15, scope: !369)
!372 = !DILocation(line: 225, column: 14, scope: !370)
!373 = !DILocation(line: 226, column: 32, scope: !374)
!374 = distinct !DILexicalBlock(scope: !369, file: !20, line: 225, column: 72)
!375 = !DILocation(line: 227, column: 10, scope: !374)
!376 = !DILocation(line: 228, column: 7, scope: !370)
!377 = !DILocation(line: 228, column: 25, scope: !378)
!378 = !DILexicalBlockFile(scope: !379, file: !20, discriminator: 1)
!379 = distinct !DILexicalBlock(scope: !365, file: !20, line: 228, column: 18)
!380 = !DILocation(line: 228, column: 51, scope: !378)
!381 = !DILocation(line: 228, column: 58, scope: !378)
!382 = !DILocation(line: 228, column: 18, scope: !378)
!383 = !DILocation(line: 228, column: 63, scope: !378)
!384 = !DILocation(line: 230, column: 10, scope: !385)
!385 = distinct !DILexicalBlock(scope: !379, file: !20, line: 228, column: 69)
!386 = !DILocation(line: 230, column: 20, scope: !385)
!387 = !DILocation(line: 231, column: 10, scope: !385)
!388 = !DILocation(line: 231, column: 37, scope: !385)
!389 = !DILocation(line: 232, column: 21, scope: !385)
!390 = !DILocation(line: 232, column: 10, scope: !385)
!391 = !DILocation(line: 234, column: 35, scope: !392)
!392 = distinct !DILexicalBlock(scope: !385, file: !20, line: 234, column: 14)
!393 = !DILocation(line: 234, column: 14, scope: !392)
!394 = !DILocation(line: 234, column: 14, scope: !385)
!395 = !DILocation(line: 235, column: 47, scope: !396)
!396 = distinct !DILexicalBlock(scope: !392, file: !20, line: 234, column: 44)
!397 = !DILocation(line: 235, column: 41, scope: !396)
!398 = !DILocation(line: 235, column: 13, scope: !396)
!399 = !DILocation(line: 235, column: 45, scope: !396)
!400 = !DILocation(line: 236, column: 10, scope: !396)
!401 = !DILocation(line: 237, column: 7, scope: !385)
!402 = !DILocation(line: 239, column: 12, scope: !366)
!403 = !DILocation(line: 239, column: 7, scope: !366)
!404 = !DILocation(line: 241, column: 11, scope: !405)
!405 = distinct !DILexicalBlock(scope: !366, file: !20, line: 241, column: 11)
!406 = !DILocation(line: 241, column: 25, scope: !405)
!407 = !DILocation(line: 241, column: 11, scope: !366)
!408 = !DILocation(line: 242, column: 10, scope: !409)
!409 = distinct !DILexicalBlock(scope: !405, file: !20, line: 241, column: 33)
!410 = !DILocation(line: 222, column: 4, scope: !411)
!411 = !DILexicalBlockFile(scope: !128, file: !20, discriminator: 2)
!412 = distinct !{!412, !358}
!413 = !DILocation(line: 246, column: 11, scope: !128)
!414 = !DILocation(line: 246, column: 4, scope: !128)
!415 = !DILocation(line: 247, column: 1, scope: !128)
!416 = !DILocation(line: 247, column: 1, scope: !360)
!417 = distinct !DISubprogram(name: "WiperPartitionFilter", scope: !20, file: !20, line: 427, type: !418, isLocal: true, isDefinition: true, scopeLine: 430, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !131)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !165, !233, !80}
!420 = !DILocalVariable(name: "item", arg: 1, scope: !417, file: !20, line: 427, type: !165)
!421 = !DILocation(line: 427, column: 38, scope: !417)
!422 = !DILocalVariable(name: "mnt", arg: 2, scope: !417, file: !20, line: 428, type: !233)
!423 = !DILocation(line: 428, column: 37, scope: !417)
!424 = !DILocalVariable(name: "shrinkableOnly", arg: 3, scope: !417, file: !20, line: 429, type: !80)
!425 = !DILocation(line: 429, column: 27, scope: !417)
!426 = !DILocalVariable(name: "s", scope: !417, file: !20, line: 431, type: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !428, line: 46, size: 1152, align: 64, elements: !429)
!428 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/open-vm-tools/line1100")
!429 = !{!430, !432, !434, !436, !438, !439, !441, !442, !443, !444, !446, !448, !456, !457, !458}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !427, file: !428, line: 48, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !124, line: 124, baseType: !59)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !427, file: !428, line: 53, baseType: !433, size: 64, align: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !124, line: 127, baseType: !59)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !427, file: !428, line: 61, baseType: !435, size: 64, align: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !124, line: 130, baseType: !59)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !427, file: !428, line: 62, baseType: !437, size: 32, align: 32, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !124, line: 129, baseType: !115)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !427, file: !428, line: 64, baseType: !123, size: 32, align: 32, offset: 224)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !427, file: !428, line: 65, baseType: !440, size: 32, align: 32, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !124, line: 126, baseType: !115)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !427, file: !428, line: 67, baseType: !104, size: 32, align: 32, offset: 288)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !427, file: !428, line: 69, baseType: !431, size: 64, align: 64, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !427, file: !428, line: 74, baseType: !204, size: 64, align: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !427, file: !428, line: 78, baseType: !445, size: 64, align: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !124, line: 153, baseType: !205)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !427, file: !428, line: 80, baseType: !447, size: 64, align: 64, offset: 512)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !124, line: 158, baseType: !205)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !427, file: !428, line: 91, baseType: !449, size: 128, align: 64, offset: 576)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !450, line: 120, size: 128, align: 64, elements: !451)
!450 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line1100")
!451 = !{!452, !454}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !449, file: !450, line: 122, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !124, line: 139, baseType: !205)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !449, file: !450, line: 123, baseType: !455, size: 64, align: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !124, line: 175, baseType: !205)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !427, file: !428, line: 92, baseType: !449, size: 128, align: 64, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !427, file: !428, line: 93, baseType: !449, size: 128, align: 64, offset: 832)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !427, file: !428, line: 106, baseType: !459, size: 192, align: 64, offset: 960)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 192, align: 64, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 3)
!462 = !DILocation(line: 431, column: 16, scope: !417)
!463 = !DILocalVariable(name: "comment", scope: !417, file: !20, line: 432, type: !83)
!464 = !DILocation(line: 432, column: 16, scope: !417)
!465 = !DILocalVariable(name: "fsname", scope: !417, file: !20, line: 433, type: !83)
!466 = !DILocation(line: 433, column: 16, scope: !417)
!467 = !DILocation(line: 433, column: 25, scope: !417)
!468 = !DILocation(line: 433, column: 30, scope: !417)
!469 = !DILocalVariable(name: "info", scope: !417, file: !20, line: 434, type: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!471 = !DILocation(line: 434, column: 25, scope: !417)
!472 = !DILocalVariable(name: "i", scope: !417, file: !20, line: 435, type: !224)
!473 = !DILocation(line: 435, column: 11, scope: !417)
!474 = !DILocation(line: 437, column: 4, scope: !417)
!475 = !DILocation(line: 437, column: 10, scope: !417)
!476 = !DILocation(line: 437, column: 15, scope: !417)
!477 = !DILocation(line: 439, column: 11, scope: !478)
!478 = distinct !DILexicalBlock(scope: !417, file: !20, line: 439, column: 4)
!479 = !DILocation(line: 439, column: 9, scope: !478)
!480 = !DILocation(line: 439, column: 16, scope: !481)
!481 = !DILexicalBlockFile(scope: !482, file: !20, discriminator: 1)
!482 = distinct !DILexicalBlock(scope: !478, file: !20, line: 439, column: 4)
!483 = !DILocation(line: 439, column: 18, scope: !481)
!484 = !DILocation(line: 439, column: 4, scope: !481)
!485 = !DILocation(line: 440, column: 32, scope: !486)
!486 = distinct !DILexicalBlock(scope: !482, file: !20, line: 439, column: 83)
!487 = !DILocation(line: 440, column: 15, scope: !486)
!488 = !DILocation(line: 440, column: 12, scope: !486)
!489 = !DILocation(line: 441, column: 18, scope: !490)
!490 = distinct !DILexicalBlock(scope: !486, file: !20, line: 441, column: 11)
!491 = !DILocation(line: 441, column: 24, scope: !490)
!492 = !DILocation(line: 441, column: 30, scope: !490)
!493 = !DILocation(line: 441, column: 11, scope: !490)
!494 = !DILocation(line: 441, column: 38, scope: !490)
!495 = !DILocation(line: 441, column: 11, scope: !486)
!496 = !DILocation(line: 442, column: 23, scope: !497)
!497 = distinct !DILexicalBlock(scope: !490, file: !20, line: 441, column: 44)
!498 = !DILocation(line: 442, column: 29, scope: !497)
!499 = !DILocation(line: 442, column: 10, scope: !497)
!500 = !DILocation(line: 442, column: 16, scope: !497)
!501 = !DILocation(line: 442, column: 21, scope: !497)
!502 = !DILocation(line: 443, column: 20, scope: !497)
!503 = !DILocation(line: 443, column: 26, scope: !497)
!504 = !DILocation(line: 443, column: 18, scope: !497)
!505 = !DILocation(line: 444, column: 10, scope: !497)
!506 = !DILocation(line: 446, column: 4, scope: !486)
!507 = !DILocation(line: 439, column: 79, scope: !508)
!508 = !DILexicalBlockFile(scope: !482, file: !20, discriminator: 2)
!509 = !DILocation(line: 439, column: 4, scope: !508)
!510 = distinct !{!510, !511}
!511 = !DILocation(line: 439, column: 4, scope: !417)
!512 = !DILocation(line: 448, column: 8, scope: !513)
!513 = distinct !DILexicalBlock(scope: !417, file: !20, line: 448, column: 8)
!514 = !DILocation(line: 448, column: 10, scope: !513)
!515 = !DILocation(line: 448, column: 8, scope: !417)
!516 = !DILocation(line: 449, column: 15, scope: !517)
!517 = distinct !DILexicalBlock(scope: !513, file: !20, line: 448, column: 71)
!518 = !DILocation(line: 450, column: 4, scope: !517)
!519 = !DILocation(line: 450, column: 15, scope: !520)
!520 = !DILexicalBlockFile(scope: !521, file: !20, discriminator: 1)
!521 = distinct !DILexicalBlock(scope: !513, file: !20, line: 450, column: 15)
!522 = !DILocation(line: 450, column: 21, scope: !520)
!523 = !DILocation(line: 450, column: 26, scope: !520)
!524 = !DILocation(line: 450, column: 51, scope: !520)
!525 = !DILocation(line: 451, column: 15, scope: !521)
!526 = !DILocation(line: 450, column: 15, scope: !527)
!527 = !DILexicalBlockFile(scope: !513, file: !20, discriminator: 2)
!528 = !DILocation(line: 457, column: 11, scope: !529)
!529 = distinct !DILexicalBlock(scope: !530, file: !20, line: 457, column: 11)
!530 = distinct !DILexicalBlock(scope: !521, file: !20, line: 451, column: 31)
!531 = !DILocation(line: 457, column: 17, scope: !529)
!532 = !DILocation(line: 457, column: 11, scope: !530)
!533 = !DILocation(line: 458, column: 25, scope: !534)
!534 = distinct !DILexicalBlock(scope: !535, file: !20, line: 458, column: 14)
!535 = distinct !DILexicalBlock(scope: !529, file: !20, line: 457, column: 29)
!536 = !DILocation(line: 458, column: 30, scope: !534)
!537 = !DILocation(line: 458, column: 14, scope: !534)
!538 = !DILocation(line: 458, column: 46, scope: !534)
!539 = !DILocation(line: 458, column: 14, scope: !535)
!540 = !DILocation(line: 459, column: 21, scope: !541)
!541 = distinct !DILexicalBlock(scope: !534, file: !20, line: 458, column: 51)
!542 = !DILocation(line: 461, column: 10, scope: !541)
!543 = !DILocation(line: 461, column: 23, scope: !544)
!544 = !DILexicalBlockFile(scope: !545, file: !20, discriminator: 1)
!545 = distinct !DILexicalBlock(scope: !534, file: !20, line: 461, column: 21)
!546 = !DILocation(line: 461, column: 24, scope: !544)
!547 = !DILocation(line: 461, column: 35, scope: !544)
!548 = !DILocation(line: 461, column: 21, scope: !544)
!549 = !DILocation(line: 462, column: 21, scope: !550)
!550 = distinct !DILexicalBlock(scope: !545, file: !20, line: 461, column: 41)
!551 = !DILocation(line: 464, column: 10, scope: !550)
!552 = !DILocation(line: 464, column: 40, scope: !553)
!553 = !DILexicalBlockFile(scope: !554, file: !20, discriminator: 1)
!554 = distinct !DILexicalBlock(scope: !545, file: !20, line: 464, column: 21)
!555 = !DILocation(line: 464, column: 22, scope: !553)
!556 = !DILocation(line: 464, column: 21, scope: !553)
!557 = !DILocation(line: 465, column: 21, scope: !558)
!558 = distinct !DILexicalBlock(scope: !554, file: !20, line: 464, column: 50)
!559 = !DILocation(line: 466, column: 10, scope: !558)
!560 = !DILocation(line: 466, column: 33, scope: !561)
!561 = !DILexicalBlockFile(scope: !562, file: !20, discriminator: 1)
!562 = distinct !DILexicalBlock(scope: !554, file: !20, line: 466, column: 21)
!563 = !DILocation(line: 466, column: 22, scope: !561)
!564 = !DILocation(line: 466, column: 45, scope: !561)
!565 = !DILocation(line: 466, column: 21, scope: !561)
!566 = !DILocation(line: 467, column: 21, scope: !567)
!567 = distinct !DILexicalBlock(scope: !562, file: !20, line: 466, column: 23)
!568 = !DILocation(line: 468, column: 10, scope: !567)
!569 = !DILocation(line: 469, column: 7, scope: !535)
!570 = !DILocation(line: 469, column: 31, scope: !571)
!571 = !DILexicalBlockFile(scope: !572, file: !20, discriminator: 1)
!572 = distinct !DILexicalBlock(scope: !529, file: !20, line: 469, column: 18)
!573 = !DILocation(line: 469, column: 36, scope: !571)
!574 = !DILocation(line: 469, column: 18, scope: !571)
!575 = !DILocation(line: 469, column: 56, scope: !571)
!576 = !DILocation(line: 470, column: 18, scope: !577)
!577 = distinct !DILexicalBlock(scope: !572, file: !20, line: 469, column: 62)
!578 = !DILocation(line: 471, column: 7, scope: !577)
!579 = !DILocation(line: 473, column: 11, scope: !580)
!580 = distinct !DILexicalBlock(scope: !530, file: !20, line: 473, column: 11)
!581 = !DILocation(line: 473, column: 19, scope: !580)
!582 = !DILocation(line: 473, column: 11, scope: !530)
!583 = !DILocation(line: 474, column: 10, scope: !584)
!584 = distinct !DILexicalBlock(scope: !580, file: !20, line: 473, column: 27)
!585 = !DILocation(line: 474, column: 16, scope: !584)
!586 = !DILocation(line: 474, column: 21, scope: !584)
!587 = !DILocation(line: 475, column: 7, scope: !584)
!588 = !DILocation(line: 476, column: 4, scope: !530)
!589 = !DILocation(line: 478, column: 8, scope: !590)
!590 = distinct !DILexicalBlock(scope: !417, file: !20, line: 478, column: 8)
!591 = !DILocation(line: 478, column: 14, scope: !590)
!592 = !DILocation(line: 478, column: 19, scope: !590)
!593 = !DILocation(line: 478, column: 8, scope: !417)
!594 = !DILocation(line: 480, column: 40, scope: !595)
!595 = distinct !DILexicalBlock(scope: !590, file: !20, line: 478, column: 45)
!596 = !DILocation(line: 480, column: 23, scope: !595)
!597 = !DILocation(line: 480, column: 7, scope: !595)
!598 = !DILocation(line: 480, column: 13, scope: !595)
!599 = !DILocation(line: 480, column: 21, scope: !595)
!600 = !DILocation(line: 481, column: 4, scope: !595)
!601 = !DILocation(line: 482, column: 1, scope: !417)
!602 = distinct !DISubprogram(name: "WiperSinglePartition_GetSpace", scope: !20, file: !20, line: 579, type: !603, isLocal: false, isDefinition: true, scopeLine: 583, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !131)
!603 = !DISubroutineType(types: !604)
!604 = !{!605, !67, !606, !606, !606}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!607 = !DILocalVariable(name: "p", arg: 1, scope: !602, file: !20, line: 579, type: !67)
!608 = !DILocation(line: 579, column: 53, scope: !602)
!609 = !DILocalVariable(name: "avail", arg: 2, scope: !602, file: !20, line: 580, type: !606)
!610 = !DILocation(line: 580, column: 39, scope: !602)
!611 = !DILocalVariable(name: "free", arg: 3, scope: !602, file: !20, line: 581, type: !606)
!612 = !DILocation(line: 581, column: 39, scope: !602)
!613 = !DILocalVariable(name: "total", arg: 4, scope: !602, file: !20, line: 582, type: !606)
!614 = !DILocation(line: 582, column: 39, scope: !602)
!615 = !DILocalVariable(name: "statfsbuf", scope: !602, file: !20, line: 587, type: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statfs", file: !617, line: 24, size: 960, align: 64, elements: !618)
!617 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/statfs.h", directory: "/home/lichi/Desktop/open-vm-tools/line1100")
!618 = !{!619, !621, !622, !624, !625, !626, !628, !629, !637, !638, !639, !640}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "f_type", scope: !616, file: !617, line: 26, baseType: !620, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsword_t", file: !124, line: 170, baseType: !205)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "f_bsize", scope: !616, file: !617, line: 27, baseType: !620, size: 64, align: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "f_blocks", scope: !616, file: !617, line: 35, baseType: !623, size: 64, align: 64, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsblkcnt64_t", file: !124, line: 163, baseType: !59)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "f_bfree", scope: !616, file: !617, line: 36, baseType: !623, size: 64, align: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "f_bavail", scope: !616, file: !617, line: 37, baseType: !623, size: 64, align: 64, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "f_files", scope: !616, file: !617, line: 38, baseType: !627, size: 64, align: 64, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsfilcnt64_t", file: !124, line: 167, baseType: !59)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "f_ffree", scope: !616, file: !617, line: 39, baseType: !627, size: 64, align: 64, offset: 384)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "f_fsid", scope: !616, file: !617, line: 41, baseType: !630, size: 64, align: 32, offset: 448)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsid_t", file: !124, line: 134, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 134, size: 64, align: 32, elements: !632)
!632 = !{!633}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !631, file: !124, line: 134, baseType: !634, size: 64, align: 32)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 64, align: 32, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 2)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "f_namelen", scope: !616, file: !617, line: 42, baseType: !620, size: 64, align: 64, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "f_frsize", scope: !616, file: !617, line: 43, baseType: !620, size: 64, align: 64, offset: 576)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags", scope: !616, file: !617, line: 44, baseType: !620, size: 64, align: 64, offset: 640)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "f_spare", scope: !616, file: !617, line: 45, baseType: !641, size: 256, align: 64, offset: 704)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 256, align: 64, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 4)
!644 = !DILocation(line: 587, column: 18, scope: !602)
!645 = !DILocalVariable(name: "blockSize", scope: !602, file: !20, line: 589, type: !55)
!646 = !DILocation(line: 589, column: 11, scope: !602)
!647 = !DILocation(line: 596, column: 21, scope: !648)
!648 = distinct !DILexicalBlock(scope: !602, file: !20, line: 596, column: 8)
!649 = !DILocation(line: 596, column: 24, scope: !648)
!650 = !DILocation(line: 596, column: 8, scope: !648)
!651 = !DILocation(line: 596, column: 48, scope: !648)
!652 = !DILocation(line: 596, column: 8, scope: !602)
!653 = !DILocation(line: 598, column: 7, scope: !654)
!654 = distinct !DILexicalBlock(scope: !648, file: !20, line: 596, column: 53)
!655 = !DILocation(line: 604, column: 26, scope: !602)
!656 = !DILocation(line: 604, column: 14, scope: !602)
!657 = !DILocation(line: 607, column: 8, scope: !658)
!658 = distinct !DILexicalBlock(scope: !602, file: !20, line: 607, column: 8)
!659 = !DILocation(line: 607, column: 8, scope: !602)
!660 = !DILocation(line: 614, column: 34, scope: !661)
!661 = distinct !DILexicalBlock(scope: !658, file: !20, line: 607, column: 15)
!662 = !DILocation(line: 614, column: 45, scope: !661)
!663 = !DILocation(line: 614, column: 43, scope: !661)
!664 = !DILocation(line: 614, column: 8, scope: !661)
!665 = !DILocation(line: 614, column: 14, scope: !661)
!666 = !DILocation(line: 615, column: 4, scope: !661)
!667 = !DILocation(line: 617, column: 8, scope: !668)
!668 = distinct !DILexicalBlock(scope: !602, file: !20, line: 617, column: 8)
!669 = !DILocation(line: 617, column: 8, scope: !602)
!670 = !DILocation(line: 618, column: 11, scope: !671)
!671 = distinct !DILexicalBlock(scope: !672, file: !20, line: 618, column: 11)
!672 = distinct !DILexicalBlock(scope: !668, file: !20, line: 617, column: 14)
!673 = !DILocation(line: 618, column: 20, scope: !671)
!674 = !DILocation(line: 618, column: 11, scope: !672)
!675 = !DILocation(line: 623, column: 36, scope: !676)
!676 = distinct !DILexicalBlock(scope: !671, file: !20, line: 618, column: 26)
!677 = !DILocation(line: 623, column: 46, scope: !676)
!678 = !DILocation(line: 623, column: 44, scope: !676)
!679 = !DILocation(line: 623, column: 11, scope: !676)
!680 = !DILocation(line: 623, column: 16, scope: !676)
!681 = !DILocation(line: 624, column: 7, scope: !676)
!682 = !DILocation(line: 629, column: 36, scope: !683)
!683 = distinct !DILexicalBlock(scope: !671, file: !20, line: 624, column: 14)
!684 = !DILocation(line: 629, column: 47, scope: !683)
!685 = !DILocation(line: 629, column: 45, scope: !683)
!686 = !DILocation(line: 629, column: 11, scope: !683)
!687 = !DILocation(line: 629, column: 16, scope: !683)
!688 = !DILocation(line: 631, column: 4, scope: !672)
!689 = !DILocation(line: 633, column: 31, scope: !602)
!690 = !DILocation(line: 633, column: 42, scope: !602)
!691 = !DILocation(line: 633, column: 40, scope: !602)
!692 = !DILocation(line: 633, column: 5, scope: !602)
!693 = !DILocation(line: 633, column: 11, scope: !602)
!694 = !DILocation(line: 635, column: 4, scope: !602)
!695 = !DILocation(line: 636, column: 1, scope: !602)
!696 = distinct !DISubprogram(name: "WiperPartition_Open", scope: !20, file: !20, line: 656, type: !697, isLocal: false, isDefinition: true, scopeLine: 658, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !131)
!697 = !DISubroutineType(types: !698)
!698 = !{!80, !699, !80}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "WiperPartition_List", file: !4, line: 90, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WiperPartition_List", file: !4, line: 88, size: 128, align: 64, elements: !702)
