; ModuleID = './libvmtools_la-signalSource.o.i'
source_filename = "./libvmtools_la-signalSource.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSourceFuncs = type { i32 (%struct._GSource*, i32*)*, i32 (%struct._GSource*)*, i32 (%struct._GSource*, i32 (i8*)*, i8*)*, void (%struct._GSource*)*, i32 (i8*)*, void ()* }
%struct._GSource = type { i8*, %struct._GSourceCallbackFuncs*, %struct._GSourceFuncs*, i32, %struct._GMainContext*, i32, i32, i32, %struct._GSList*, %struct._GSource*, %struct._GSource*, i8*, %struct._GSourcePrivate* }
%struct._GSourceCallbackFuncs = type { void (i8*)*, void (i8*)*, void (i8*, %struct._GSource*, i32 (i8*)**, i8**)* }
%struct._GMainContext = type opaque
%struct._GSList = type { i8*, %struct._GSList* }
%struct._GSourcePrivate = type opaque
%union._GMutex = type { i8* }
%struct.SignalHandler = type { i32, [2 x i32], %struct.sigaction, %struct._GPollFD, [65 x i32], %struct.siginfo_t }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.__sigset_t = type { [16 x i64] }
%struct._GPollFD = type { i32, i16, i16 }
%struct.siginfo_t = type { i32, i32, i32, %union.anon.0 }
%union.anon.0 = type { %struct.anon.3, [80 x i8] }
%struct.anon.3 = type { i32, i32, i32, i64, i64 }
%struct.SignalSource = type { %struct._GSource, i32 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !30, globals: !205)
!1 = !DIFile(filename: "libvmtools_la-signalSource.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1140")
!2 = !{!3, !12, !18}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 31, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1140")
!5 = !{!6, !7, !8, !9, !10, !11}
!6 = !DIEnumerator(name: "G_IO_IN", value: 1)
!7 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!8 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!9 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!10 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!11 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 37, size: 32, align: 32, elements: !14)
!13 = !DIFile(filename: "signalSource.c", directory: "/home/lichi/Desktop/open-vm-tools/line1140")
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "SIG_SRC_UNHANDLED", value: 0)
!16 = !DIEnumerator(name: "SIG_SRC_IDLE", value: 1)
!17 = !DIEnumerator(name: "SIG_SRC_SIGNALED", value: 2)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 51, size: 32, align: 32, elements: !20)
!19 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1140")
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29}
!21 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!22 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!23 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!24 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!25 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!26 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!27 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!28 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!29 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!30 = !{!31, !35, !126, !45}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !33, line: 46, baseType: !34)
!33 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1140")
!34 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "SignalSource", file: !13, line: 65, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SignalSource", file: !13, line: 62, size: 832, align: 64, elements: !38)
!38 = !{!39, !125}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !37, file: !13, line: 63, baseType: !40, size: 768, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !4, line: 64, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !4, line: 171, size: 768, align: 64, elements: !42)
!42 = !{!43, !46, !70, !99, !102, !106, !107, !108, !109, !117, !118, !119, !121}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !41, file: !4, line: 174, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !33, line: 77, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !41, file: !4, line: 175, baseType: !47, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !4, line: 77, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !4, line: 196, size: 192, align: 64, elements: !50)
!50 = !{!51, !55, !56}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !49, file: !4, line: 198, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !44}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !49, file: !4, line: 199, baseType: !52, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !49, file: !4, line: 200, baseType: !57, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !44, !60, !61, !69}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !4, line: 155, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !44}
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !33, line: 50, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !33, line: 49, baseType: !68)
!68 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !41, file: !4, line: 177, baseType: !71, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !4, line: 130, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !4, line: 214, size: 384, align: 64, elements: !75)
!75 = !{!76, !81, !85, !89, !93, !94}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !74, file: !4, line: 216, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!66, !60, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !74, file: !4, line: 218, baseType: !82, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!66, !60}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !74, file: !4, line: 219, baseType: !86, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!66, !60, !62, !44}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !74, file: !4, line: 222, baseType: !90, size: 64, align: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !60}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !74, file: !4, line: 226, baseType: !62, size: 64, align: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !74, file: !4, line: 227, baseType: !95, size: 64, align: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !4, line: 212, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !41, file: !4, line: 178, baseType: !100, size: 32, align: 32, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !33, line: 55, baseType: !101)
!101 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !41, file: !4, line: 180, baseType: !103, size: 64, align: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !4, line: 48, baseType: !105)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !4, line: 48, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !41, file: !4, line: 182, baseType: !67, size: 32, align: 32, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !41, file: !4, line: 183, baseType: !100, size: 32, align: 32, offset: 352)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !41, file: !4, line: 184, baseType: !100, size: 32, align: 32, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !41, file: !4, line: 186, baseType: !110, size: 64, align: 64, offset: 448)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !112, line: 37, baseType: !113)
!112 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line1140")
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !112, line: 39, size: 128, align: 64, elements: !114)
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !113, file: !112, line: 41, baseType: !44, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !112, line: 42, baseType: !110, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !41, file: !4, line: 188, baseType: !60, size: 64, align: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !41, file: !4, line: 189, baseType: !60, size: 64, align: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !41, file: !4, line: 191, baseType: !120, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !41, file: !4, line: 193, baseType: !122, size: 64, align: 64, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !4, line: 65, baseType: !124)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !4, line: 65, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !37, file: !13, line: 64, baseType: !68, size: 32, align: 32, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "SignalSourceCb", file: !127, line: 157, baseType: !128)
!127 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/utils.h", directory: "/home/lichi/Desktop/open-vm-tools/line1140")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!66, !131, !44}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !134, line: 133, baseType: !135)
!134 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/siginfo.h", directory: "/home/lichi/Desktop/open-vm-tools/line1140")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 62, size: 1024, align: 64, elements: !136)
!136 = !{!137, !138, !139, !140}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !135, file: !134, line: 64, baseType: !68, size: 32, align: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !135, file: !134, line: 65, baseType: !68, size: 32, align: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !135, file: !134, line: 67, baseType: !68, size: 32, align: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !135, file: !134, line: 132, baseType: !141, size: 896, align: 64, offset: 128)
!141 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !135, file: !134, line: 69, size: 896, align: 64, elements: !142)
!142 = !{!143, !147, !155, !166, !172, !183, !194, !199}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !141, file: !134, line: 71, baseType: !144, size: 896, align: 32)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 896, align: 32, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 28)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !141, file: !134, line: 78, baseType: !148, size: 64, align: 32)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !134, line: 74, size: 64, align: 32, elements: !149)
!149 = !{!150, !153}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !148, file: !134, line: 76, baseType: !151, size: 32, align: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !152, line: 133, baseType: !68)
!152 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1140")
!153 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !148, file: !134, line: 77, baseType: !154, size: 32, align: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !152, line: 125, baseType: !101)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !141, file: !134, line: 86, baseType: !156, size: 128, align: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !134, line: 81, size: 128, align: 64, elements: !157)
!157 = !{!158, !159, !160}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !156, file: !134, line: 83, baseType: !68, size: 32, align: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !156, file: !134, line: 84, baseType: !68, size: 32, align: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !156, file: !134, line: 85, baseType: !161, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !134, line: 36, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !134, line: 32, size: 64, align: 64, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !162, file: !134, line: 34, baseType: !68, size: 32, align: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !162, file: !134, line: 35, baseType: !45, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !141, file: !134, line: 94, baseType: !167, size: 128, align: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !134, line: 89, size: 128, align: 64, elements: !168)
!168 = !{!169, !170, !171}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !167, file: !134, line: 91, baseType: !151, size: 32, align: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !167, file: !134, line: 92, baseType: !154, size: 32, align: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !167, file: !134, line: 93, baseType: !161, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !141, file: !134, line: 104, baseType: !173, size: 256, align: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !134, line: 97, size: 256, align: 64, elements: !174)
!174 = !{!175, !176, !177, !178, !182}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !173, file: !134, line: 99, baseType: !151, size: 32, align: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !173, file: !134, line: 100, baseType: !154, size: 32, align: 32, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !173, file: !134, line: 101, baseType: !68, size: 32, align: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !173, file: !134, line: 102, baseType: !179, size: 64, align: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !134, line: 58, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !152, line: 135, baseType: !181)
!181 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !173, file: !134, line: 103, baseType: !179, size: 64, align: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !141, file: !134, line: 116, baseType: !184, size: 256, align: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !134, line: 107, size: 256, align: 64, elements: !185)
!185 = !{!186, !187, !189}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !184, file: !134, line: 109, baseType: !45, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !184, file: !134, line: 110, baseType: !188, size: 16, align: 16, offset: 64)
!188 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_bnd", scope: !184, file: !134, line: 115, baseType: !190, size: 128, align: 64, offset: 128)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !184, file: !134, line: 111, size: 128, align: 64, elements: !191)
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !190, file: !134, line: 113, baseType: !45, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !190, file: !134, line: 114, baseType: !45, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !141, file: !134, line: 123, baseType: !195, size: 128, align: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !134, line: 119, size: 128, align: 64, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !195, file: !134, line: 121, baseType: !181, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !195, file: !134, line: 122, baseType: !68, size: 32, align: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !141, file: !134, line: 131, baseType: !200, size: 128, align: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !134, line: 126, size: 128, align: 64, elements: !201)
!201 = !{!202, !203, !204}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !200, file: !134, line: 128, baseType: !45, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !200, file: !134, line: 129, baseType: !68, size: 32, align: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !200, file: !134, line: 130, baseType: !101, size: 32, align: 32, offset: 96)
!205 = !{!206, !211, !266}
!206 = distinct !DIGlobalVariable(name: "srcFuncs", scope: !207, file: !13, line: 259, type: !73, isLocal: true, isDefinition: true, variable: %struct._GSourceFuncs* @VMTools_NewSignalSource.srcFuncs)
!207 = distinct !DISubprogram(name: "VMTools_NewSignalSource", scope: !13, file: !13, line: 257, type: !208, isLocal: false, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !210)
!208 = !DISubroutineType(types: !209)
!209 = !{!60, !68}
!210 = !{}
!211 = distinct !DIGlobalVariable(name: "gHandler", scope: !0, file: !13, line: 59, type: !212, isLocal: true, isDefinition: true, variable: %struct.SignalHandler* @gHandler)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "SignalHandler", file: !13, line: 57, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SignalHandler", file: !13, line: 50, size: 4544, align: 64, elements: !214)
!214 = !{!215, !216, !220, !250, !260, !265}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !213, file: !13, line: 51, baseType: !66, size: 32, align: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "wakeupPipe", scope: !213, file: !13, line: 52, baseType: !217, size: 64, align: 32, offset: 32)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 64, align: 32, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 2)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !213, file: !13, line: 53, baseType: !221, size: 1216, align: 64, offset: 128)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !222, line: 24, size: 1216, align: 64, elements: !223)
!222 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "/home/lichi/Desktop/open-vm-tools/line1140")
!223 = !{!224, !238, !248, !249}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !221, file: !222, line: 35, baseType: !225, size: 64, align: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !221, file: !222, line: 28, size: 64, align: 64, elements: !226)
!226 = !{!227, !233}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !225, file: !222, line: 31, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !229, line: 85, baseType: !230)
!229 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/open-vm-tools/line1140")
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !68}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !225, file: !222, line: 33, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !68, !237, !45}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !221, file: !222, line: 43, baseType: !239, size: 1024, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !240, line: 30, baseType: !241)
!240 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "/home/lichi/Desktop/open-vm-tools/line1140")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !240, line: 27, size: 1024, align: 64, elements: !242)
!242 = !{!243}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !241, file: !240, line: 29, baseType: !244, size: 1024, align: 64)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 1024, align: 64, elements: !246)
!245 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!246 = !{!247}
!247 = !DISubrange(count: 16)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !221, file: !222, line: 46, baseType: !68, size: 32, align: 32, offset: 1088)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !221, file: !222, line: 49, baseType: !96, size: 64, align: 64, offset: 1152)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "wakeupFd", scope: !213, file: !13, line: 54, baseType: !251, size: 64, align: 32, offset: 1344)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPollFD", file: !252, line: 59, baseType: !253)
!252 = !DIFile(filename: "/usr/include/glib-2.0/glib/gpoll.h", directory: "/home/lichi/Desktop/open-vm-tools/line1140")
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GPollFD", file: !252, line: 91, size: 64, align: 32, elements: !254)
!254 = !{!255, !256, !259}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !253, file: !252, line: 98, baseType: !67, size: 32, align: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !253, file: !252, line: 100, baseType: !257, size: 16, align: 16, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "gushort", file: !33, line: 53, baseType: !258)
!258 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !253, file: !252, line: 101, baseType: !257, size: 16, align: 16, offset: 48)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "signals", scope: !213, file: !13, line: 55, baseType: !261, size: 2080, align: 32, offset: 1408)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 2080, align: 32, elements: !263)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "SignalState", file: !13, line: 41, baseType: !12)
!263 = !{!264}
!264 = !DISubrange(count: 65)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "currSignal", scope: !213, file: !13, line: 56, baseType: !133, size: 1024, align: 64, offset: 3520)
!266 = distinct !DIGlobalVariable(name: "g__gLock_lock", scope: !0, file: !13, line: 60, type: !267, isLocal: true, isDefinition: true, variable: %union._GMutex* @g__gLock_lock)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMutex", file: !268, line: 51, baseType: !269)
!268 = !DIFile(filename: "/usr/include/glib-2.0/glib/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line1140")
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GMutex", file: !268, line: 58, size: 64, align: 64, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !269, file: !268, line: 61, baseType: !44, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !269, file: !268, line: 62, baseType: !273, size: 64, align: 32)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 64, align: 32, elements: !218)
!274 = !{i32 2, !"Dwarf Version", i32 4}
!275 = !{i32 2, !"Debug Info Version", i32 3}
!276 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!277 = !DILocalVariable(name: "signum", arg: 1, scope: !207, file: !13, line: 257, type: !68)
!278 = !DIExpression()
!279 = !DILocation(line: 257, column: 29, scope: !207)
!280 = !DILocalVariable(name: "ret", scope: !207, file: !13, line: 267, type: !35)
!281 = !DILocation(line: 267, column: 18, scope: !207)
!282 = !DILocation(line: 272, column: 4, scope: !207)
!283 = !DILocation(line: 273, column: 18, scope: !284)
!284 = distinct !DILexicalBlock(scope: !207, file: !13, line: 273, column: 8)
!285 = !DILocation(line: 273, column: 9, scope: !284)
!286 = !DILocation(line: 273, column: 8, scope: !207)
!287 = !DILocation(line: 274, column: 11, scope: !288)
!288 = distinct !DILexicalBlock(scope: !289, file: !13, line: 274, column: 11)
!289 = distinct !DILexicalBlock(scope: !284, file: !13, line: 273, column: 31)
!290 = !DILocation(line: 274, column: 37, scope: !288)
!291 = !DILocation(line: 274, column: 43, scope: !288)
!292 = !DILocation(line: 275, column: 17, scope: !288)
!293 = !DILocation(line: 275, column: 11, scope: !288)
!294 = !DILocation(line: 275, column: 72, scope: !288)
!295 = !DILocation(line: 275, column: 76, scope: !288)
!296 = !DILocation(line: 276, column: 17, scope: !288)
!297 = !DILocation(line: 276, column: 11, scope: !288)
!298 = !DILocation(line: 276, column: 72, scope: !288)
!299 = !DILocation(line: 274, column: 11, scope: !300)
!300 = !DILexicalBlockFile(scope: !289, file: !13, discriminator: 1)
!301 = !DILocation(line: 278, column: 7, scope: !302)
!302 = distinct !DILexicalBlock(scope: !288, file: !13, line: 276, column: 77)
!303 = !DILocation(line: 279, column: 30, scope: !289)
!304 = !DILocation(line: 279, column: 28, scope: !289)
!305 = !DILocation(line: 280, column: 32, scope: !289)
!306 = !DILocation(line: 281, column: 36, scope: !289)
!307 = !DILocation(line: 282, column: 33, scope: !289)
!308 = !DILocation(line: 283, column: 28, scope: !289)
!309 = !DILocation(line: 284, column: 4, scope: !289)
!310 = !DILocation(line: 285, column: 4, scope: !207)
!311 = !DILocation(line: 292, column: 25, scope: !312)
!312 = distinct !DILexicalBlock(scope: !207, file: !13, line: 292, column: 8)
!313 = !DILocation(line: 292, column: 8, scope: !312)
!314 = !DILocation(line: 292, column: 33, scope: !312)
!315 = !DILocation(line: 292, column: 8, scope: !207)
!316 = !DILocation(line: 293, column: 21, scope: !317)
!317 = distinct !DILexicalBlock(scope: !318, file: !13, line: 293, column: 11)
!318 = distinct !DILexicalBlock(scope: !312, file: !13, line: 292, column: 55)
!319 = !DILocation(line: 293, column: 11, scope: !317)
!320 = !DILocation(line: 293, column: 53, scope: !317)
!321 = !DILocation(line: 293, column: 11, scope: !318)
!322 = !DILocation(line: 294, column: 11, scope: !323)
!323 = distinct !DILexicalBlock(scope: !317, file: !13, line: 293, column: 60)
