; ModuleID = './systemLinux.o.i'
source_filename = "./systemLinux.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.tms = type { i64, i64, i64, i64 }
%struct.HashTable = type opaque
%struct.DynBuf = type { i8*, i64, i64 }
%struct.SNEBufs = type { %struct.DynBuf*, %struct.DynBuf* }

@.str = private unnamed_addr constant [13 x i8] c"/proc/uptime\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"%lu.%2u\00", align 1
@.str.3 = private unnamed_addr constant [35 x i8] c"%s: Unable to parse /proc/uptime.\0A\00", align 1
@__func__.System_Uptime = private unnamed_addr constant [14 x i8] c"System_Uptime\00", align 1
@.str.4 = private unnamed_addr constant [22 x i8] c"/sbin/shutdown -r now\00", align 1
@.str.5 = private unnamed_addr constant [22 x i8] c"/sbin/shutdown -h now\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.6 = private unnamed_addr constant [36 x i8] c"Unable to execute %s command: \22%s\22\0A\00", align 1
@.str.7 = private unnamed_addr constant [7 x i8] c"reboot\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9)
!1 = !DIFile(filename: "systemLinux.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line991")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 34, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmstdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line991")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "StdIO_Error", value: 0)
!7 = !DIEnumerator(name: "StdIO_EOF", value: 1)
!8 = !DIEnumerator(name: "StdIO_Success", value: 2)
!9 = !{!10, !11, !13}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNEBufs", file: !15, line: 102, baseType: !16)
!15 = !DIFile(filename: "systemLinux.c", directory: "/home/lichi/Desktop/open-vm-tools/line991")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 99, size: 128, align: 64, elements: !17)
!17 = !{!18, !30}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "nativeEnvironStrings", scope: !16, file: !15, line: 100, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "DynBuf", file: !21, line: 40, baseType: !22)
!21 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dynbuf.h", directory: "/home/lichi/Desktop/open-vm-tools/line991")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynBuf", file: !21, line: 36, size: 192, align: 64, elements: !23)
!23 = !{!24, !25, !29}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !22, file: !21, line: 37, baseType: !11, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !22, file: !21, line: 38, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !27, line: 216, baseType: !28)
!27 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line991")
!28 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !22, file: !21, line: 39, baseType: !26, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "nativeEnvironOffsets", scope: !16, file: !15, line: 101, baseType: !19, size: 64, align: 64, offset: 64)
!31 = !{i32 2, !"Dwarf Version", i32 4}
!32 = !{i32 2, !"Debug Info Version", i32 3}
!33 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!34 = distinct !DISubprogram(name: "System_GetTimeMonotonic", scope: !15, file: !15, line: 141, type: !35, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !41)
!35 = !DISubroutineType(types: !36)
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !38, line: 171, baseType: !39)
!38 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line991")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !40, line: 55, baseType: !28)
!40 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line991")
!41 = !{}
!42 = !DILocalVariable(name: "tp", scope: !34, file: !15, line: 146, type: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tms", file: !44, line: 34, size: 256, align: 64, elements: !45)
!44 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/times.h", directory: "/home/lichi/Desktop/open-vm-tools/line991")
!45 = !{!46, !52, !53, !54}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tms_utime", scope: !43, file: !44, line: 36, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_t", file: !48, line: 59, baseType: !49)
!48 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line991")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !50, line: 135, baseType: !51)
!50 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line991")
!51 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tms_stime", scope: !43, file: !44, line: 37, baseType: !47, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cutime", scope: !43, file: !44, line: 39, baseType: !47, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cstime", scope: !43, file: !44, line: 40, baseType: !47, size: 64, align: 64, offset: 192)
!55 = !DIExpression()
!56 = !DILocation(line: 146, column: 15, scope: !34)
!57 = !DILocation(line: 190, column: 11, scope: !34)
!58 = !DILocation(line: 190, column: 4, scope: !34)
!59 = distinct !DISubprogram(name: "System_Uptime", scope: !15, file: !15, line: 213, type: !35, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !41)
!60 = !DILocalVariable(name: "uptime", scope: !59, file: !15, line: 215, type: !37)
!61 = !DILocation(line: 215, column: 11, scope: !59)
!62 = !DILocalVariable(name: "procStream", scope: !63, file: !15, line: 228, type: !64)
!63 = distinct !DILexicalBlock(scope: !59, file: !15, line: 227, column: 4)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !66, line: 48, baseType: !67)
!66 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line991")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 241, size: 1728, align: 64, elements: !69)
!68 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line991")
!69 = !{!70, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !91, !92, !93, !94, !96, !98, !100, !104, !107, !109, !110, !111, !112, !113, !114, !115}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !67, file: !68, line: 242, baseType: !71, size: 32, align: 32)
!71 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !67, file: !68, line: 247, baseType: !11, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !67, file: !68, line: 248, baseType: !11, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !67, file: !68, line: 249, baseType: !11, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !67, file: !68, line: 250, baseType: !11, size: 64, align: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !67, file: !68, line: 251, baseType: !11, size: 64, align: 64, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !67, file: !68, line: 252, baseType: !11, size: 64, align: 64, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !67, file: !68, line: 253, baseType: !11, size: 64, align: 64, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !67, file: !68, line: 254, baseType: !11, size: 64, align: 64, offset: 512)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !67, file: !68, line: 256, baseType: !11, size: 64, align: 64, offset: 576)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !67, file: !68, line: 257, baseType: !11, size: 64, align: 64, offset: 640)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !67, file: !68, line: 258, baseType: !11, size: 64, align: 64, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !67, file: !68, line: 260, baseType: !84, size: 64, align: 64, offset: 768)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !68, line: 156, size: 192, align: 64, elements: !86)
!86 = !{!87, !88, !90}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !85, file: !68, line: 157, baseType: !84, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !85, file: !68, line: 158, baseType: !89, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !85, file: !68, line: 162, baseType: !71, size: 32, align: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !67, file: !68, line: 262, baseType: !89, size: 64, align: 64, offset: 832)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !67, file: !68, line: 264, baseType: !71, size: 32, align: 32, offset: 896)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !67, file: !68, line: 268, baseType: !71, size: 32, align: 32, offset: 928)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !67, file: !68, line: 270, baseType: !95, size: 64, align: 64, offset: 960)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !50, line: 131, baseType: !51)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !67, file: !68, line: 274, baseType: !97, size: 16, align: 16, offset: 1024)
!97 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !67, file: !68, line: 275, baseType: !99, size: 8, align: 8, offset: 1040)
!99 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !67, file: !68, line: 276, baseType: !101, size: 8, align: 8, offset: 1048)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, align: 8, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 1)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !67, file: !68, line: 280, baseType: !105, size: 64, align: 64, offset: 1088)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !68, line: 150, baseType: null)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !67, file: !68, line: 289, baseType: !108, size: 64, align: 64, offset: 1152)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !50, line: 132, baseType: !51)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !67, file: !68, line: 297, baseType: !10, size: 64, align: 64, offset: 1216)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !67, file: !68, line: 298, baseType: !10, size: 64, align: 64, offset: 1280)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !67, file: !68, line: 299, baseType: !10, size: 64, align: 64, offset: 1344)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !67, file: !68, line: 300, baseType: !10, size: 64, align: 64, offset: 1408)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !67, file: !68, line: 302, baseType: !26, size: 64, align: 64, offset: 1472)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !67, file: !68, line: 303, baseType: !71, size: 32, align: 32, offset: 1536)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !67, file: !68, line: 305, baseType: !116, size: 160, align: 8, offset: 1568)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, align: 8, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 20)
!119 = !DILocation(line: 228, column: 13, scope: !63)
!120 = !DILocalVariable(name: "buf", scope: !63, file: !15, line: 229, type: !11)
!121 = !DILocation(line: 229, column: 13, scope: !63)
!122 = !DILocalVariable(name: "bufSize", scope: !63, file: !15, line: 230, type: !26)
!123 = !DILocation(line: 230, column: 14, scope: !63)
!124 = !DILocalVariable(name: "sec", scope: !63, file: !15, line: 231, type: !37)
!125 = !DILocation(line: 231, column: 14, scope: !63)
!126 = !DILocalVariable(name: "csec", scope: !63, file: !15, line: 232, type: !127)
!127 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!128 = !DILocation(line: 232, column: 20, scope: !63)
!129 = !DILocation(line: 234, column: 26, scope: !130)
!130 = distinct !DILexicalBlock(scope: !63, file: !15, line: 234, column: 11)
!131 = !DILocation(line: 234, column: 24, scope: !130)
!132 = !DILocation(line: 234, column: 60, scope: !130)
!133 = !DILocation(line: 234, column: 68, scope: !130)
!134 = !DILocation(line: 235, column: 31, scope: !130)
!135 = !DILocation(line: 235, column: 12, scope: !130)
!136 = !DILocation(line: 235, column: 63, scope: !130)
!137 = !DILocation(line: 235, column: 81, scope: !130)
!138 = !DILocation(line: 236, column: 19, scope: !130)
!139 = !DILocation(line: 236, column: 12, scope: !130)
!140 = !DILocation(line: 236, column: 52, scope: !130)
!141 = !DILocation(line: 234, column: 11, scope: !142)
!142 = !DILexicalBlockFile(scope: !63, file: !15, discriminator: 1)
!143 = !DILocation(line: 237, column: 19, scope: !144)
!144 = distinct !DILexicalBlock(scope: !130, file: !15, line: 236, column: 59)
!145 = !DILocation(line: 237, column: 23, scope: !144)
!146 = !DILocation(line: 237, column: 31, scope: !144)
!147 = !DILocation(line: 237, column: 29, scope: !144)
!148 = !DILocation(line: 237, column: 17, scope: !144)
!149 = !DILocation(line: 238, column: 7, scope: !144)
!150 = !DILocation(line: 239, column: 10, scope: !151)
!151 = distinct !DILexicalBlock(scope: !130, file: !15, line: 238, column: 14)
!152 = !DILocation(line: 242, column: 12, scope: !63)
!153 = !DILocation(line: 242, column: 7, scope: !63)
!154 = !DILocation(line: 244, column: 11, scope: !155)
!155 = distinct !DILexicalBlock(scope: !63, file: !15, line: 244, column: 11)
!156 = !DILocation(line: 244, column: 11, scope: !63)
!157 = !DILocation(line: 245, column: 17, scope: !158)
!158 = distinct !DILexicalBlock(scope: !155, file: !15, line: 244, column: 23)
!159 = !DILocation(line: 245, column: 10, scope: !158)
!160 = !DILocation(line: 246, column: 7, scope: !158)
!161 = !DILocation(line: 284, column: 11, scope: !59)
!162 = !DILocation(line: 284, column: 4, scope: !59)
!163 = distinct !DISubprogram(name: "System_Shutdown", scope: !15, file: !15, line: 305, type: !164, isLocal: false, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !41)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !166}
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !38, line: 230, baseType: !12)
!167 = !DILocalVariable(name: "reboot", arg: 1, scope: !163, file: !15, line: 305, type: !166)
!168 = !DILocation(line: 305, column: 22, scope: !163)
!169 = !DILocalVariable(name: "cmd", scope: !163, file: !15, line: 307, type: !11)
!170 = !DILocation(line: 307, column: 10, scope: !163)
!171 = !DILocation(line: 309, column: 8, scope: !172)
!172 = distinct !DILexicalBlock(scope: !163, file: !15, line: 309, column: 8)
!173 = !DILocation(line: 309, column: 8, scope: !163)
!174 = !DILocation(line: 315, column: 11, scope: !175)
!175 = distinct !DILexicalBlock(scope: !172, file: !15, line: 309, column: 16)
!176 = !DILocation(line: 317, column: 4, scope: !175)
