; ModuleID = './posixPwd.o.i'
source_filename = "./posixPwd.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.group = type { i8*, i8*, i32, i8** }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }

@Posix_Getgrnam.sgr = internal global %struct.group zeroinitializer, align 8
@GetpwInternal.spw = internal global %struct.passwd zeroinitializer, align 8

; Function Attrs: nounwind uwtable
define %struct.passwd* @Posix_Getpwnam(i8*) #0 !dbg !381 {
  %2 = alloca %struct.passwd*, align 8
  %3 = alloca i8*, align 8
  %4 = alloca %struct.passwd*, align 8
  %5 = alloca i8*, align 8
  store i8* %0, i8** %3, align 8
  call void @llvm.dbg.declare(metadata i8** %3, metadata !384, metadata !385), !dbg !386
  call void @llvm.dbg.declare(metadata %struct.passwd** %4, metadata !387, metadata !385), !dbg !388
  call void @llvm.dbg.declare(metadata i8** %5, metadata !389, metadata !385), !dbg !390
  %6 = load i8*, i8** %3, align 8, !dbg !391
  %7 = call signext i8 @PosixConvertToCurrent(i8* %6, i8** %5), !dbg !393
  %8 = icmp ne i8 %7, 0, !dbg !393
  br i1 %8, label %10, label %9, !dbg !394

; <label>:9:                                      ; preds = %1
  store %struct.passwd* null, %struct.passwd** %2, align 8, !dbg !395
  br label %16, !dbg !395

; <label>:10:                                     ; preds = %1
  %11 = load i8*, i8** %5, align 8, !dbg !397
  %12 = call %struct.passwd* @getpwnam(i8* %11), !dbg !398

!271 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_10004", value: 264)
!272 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_10005", value: 265)
!273 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_10006", value: 266)
!274 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_10007", value: 267)
!275 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_10008", value: 268)
!276 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_10010", value: 269)
!277 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_10017", value: 270)
!278 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_10021", value: 271)
!279 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_10029", value: 272)
!280 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_10079", value: 273)
!281 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_10081", value: 274)
!282 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_10082", value: 275)
!283 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20000", value: 276)
!284 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20001", value: 277)
!285 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20002", value: 278)
!286 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20003", value: 279)
!287 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20004", value: 280)
!288 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20005", value: 281)
!289 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20105", value: 282)
!290 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20106", value: 283)
!291 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20107", value: 284)
!292 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20108", value: 285)
!293 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20269", value: 286)
!294 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20833", value: 287)
!295 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20949", value: 288)
!296 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_21025", value: 289)
!297 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_21027", value: 290)
!298 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_29001", value: 291)
!299 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_38598", value: 292)
!300 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50221", value: 293)
!301 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50222", value: 294)
!302 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50229", value: 295)
!303 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50930", value: 296)
!304 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50931", value: 297)
!305 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50933", value: 298)
!306 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50935", value: 299)
!307 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50936", value: 300)
!308 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50937", value: 301)
!309 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50939", value: 302)
!310 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_51936", value: 303)
!311 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_51950", value: 304)
!312 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57002", value: 305)
!313 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57003", value: 306)
!314 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57004", value: 307)
!315 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57005", value: 308)
!316 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57006", value: 309)
!317 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57007", value: 310)
!318 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57008", value: 311)
!319 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57009", value: 312)
!320 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57010", value: 313)
!321 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57011", value: 314)
!322 = !DIEnumerator(name: "STRING_ENCODING_IBM_813", value: 315)
!323 = !DIEnumerator(name: "STRING_ENCODING_IBM_943_P130_1999", value: 316)
!324 = !DIEnumerator(name: "STRING_ENCODING_IBM_33722", value: 317)
!325 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_949", value: 318)
!326 = !DIEnumerator(name: "STRING_ENCODING_IBM_1363", value: 319)
!327 = !DIEnumerator(name: "STRING_ENCODING_IBM_1386", value: 320)
!328 = !DIEnumerator(name: "STRING_ENCODING_IBM_1373", value: 321)
!329 = !DIEnumerator(name: "STRING_ENCODING_IBM_5471", value: 322)
!330 = !DIEnumerator(name: "STRING_ENCODING_IBM_874", value: 323)
!331 = !DIEnumerator(name: "STRING_ENCODING_MAX_SPECIFIED", value: 324)
!332 = !DIEnumerator(name: "STRING_ENCODING_DEFAULT", value: -1)
!333 = !DIEnumerator(name: "STRING_ENCODING_UNKNOWN", value: -2)
!334 = !DIEnumerator(name: "STRING_ENCODING_UTF16", value: 1)
!335 = !DIEnumerator(name: "STRING_ENCODING_UTF32", value: 4)
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!339 = !{!340, !362}
!340 = distinct !DIGlobalVariable(name: "sgr", scope: !341, file: !342, line: 960, type: !346, isLocal: true, isDefinition: true, variable: %struct.group* @Posix_Getgrnam.sgr)
!341 = distinct !DISubprogram(name: "Posix_Getgrnam", scope: !342, file: !342, line: 955, type: !343, isLocal: false, isDefinition: true, scopeLine: 956, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !361)
!342 = !DIFile(filename: "posixPwd.c", directory: "/home/lichi/Desktop/open-vm-tools/line670")
!343 = !DISubroutineType(types: !344)
!344 = !{!345, !359}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !347, line: 42, size: 256, align: 64, elements: !348)
!347 = !DIFile(filename: "/usr/include/grp.h", directory: "/home/lichi/Desktop/open-vm-tools/line670")
!348 = !{!349, !352, !353, !357}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !346, file: !347, line: 44, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !346, file: !347, line: 45, baseType: !350, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !346, file: !347, line: 46, baseType: !354, size: 32, align: 32, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !355, line: 126, baseType: !356)
!355 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line670")
!356 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !346, file: !347, line: 47, baseType: !358, size: 64, align: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !351)
!361 = !{}
!362 = distinct !DIGlobalVariable(name: "spw", scope: !363, file: !342, line: 126, type: !367, isLocal: true, isDefinition: true, variable: %struct.passwd* @GetpwInternal.spw)
!363 = distinct !DISubprogram(name: "GetpwInternal", scope: !342, file: !342, line: 123, type: !364, isLocal: true, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !361)
!364 = !DISubroutineType(types: !365)
!365 = !{!366, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !368, line: 49, size: 384, align: 64, elements: !369)
!368 = !DIFile(filename: "/usr/include/pwd.h", directory: "/home/lichi/Desktop/open-vm-tools/line670")
!369 = !{!370, !371, !372, !374, !375, !376, !377}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !367, file: !368, line: 51, baseType: !350, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !367, file: !368, line: 52, baseType: !350, size: 64, align: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !367, file: !368, line: 53, baseType: !373, size: 32, align: 32, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !355, line: 125, baseType: !356)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !367, file: !368, line: 54, baseType: !354, size: 32, align: 32, offset: 160)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !367, file: !368, line: 55, baseType: !350, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !367, file: !368, line: 56, baseType: !350, size: 64, align: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !367, file: !368, line: 57, baseType: !350, size: 64, align: 64, offset: 320)
!378 = !{i32 2, !"Dwarf Version", i32 4}
!379 = !{i32 2, !"Debug Info Version", i32 3}
!380 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!381 = distinct !DISubprogram(name: "Posix_Getpwnam", scope: !342, file: !342, line: 66, type: !382, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !361)
!382 = !DISubroutineType(types: !383)
!383 = !{!366, !359}
!384 = !DILocalVariable(name: "name", arg: 1, scope: !381, file: !342, line: 66, type: !359)
!385 = !DIExpression()
!386 = !DILocation(line: 66, column: 28, scope: !381)
!387 = !DILocalVariable(name: "pw", scope: !381, file: !342, line: 68, type: !366)
!388 = !DILocation(line: 68, column: 19, scope: !381)
!389 = !DILocalVariable(name: "tmpname", scope: !381, file: !342, line: 69, type: !350)
!390 = !DILocation(line: 69, column: 10, scope: !381)
!391 = !DILocation(line: 71, column: 31, scope: !392)
!392 = distinct !DILexicalBlock(scope: !381, file: !342, line: 71, column: 8)
!393 = !DILocation(line: 71, column: 9, scope: !392)
!394 = !DILocation(line: 71, column: 8, scope: !381)
!395 = !DILocation(line: 72, column: 7, scope: !396)
!396 = distinct !DILexicalBlock(scope: !392, file: !342, line: 71, column: 48)
!397 = !DILocation(line: 74, column: 18, scope: !381)
!398 = !DILocation(line: 74, column: 9, scope: !381)
!399 = !DILocation(line: 74, column: 7, scope: !381)
!400 = !DILocation(line: 75, column: 15, scope: !381)
!401 = !DILocation(line: 75, column: 4, scope: !381)
!402 = !DILocation(line: 77, column: 25, scope: !381)
!403 = !DILocation(line: 77, column: 11, scope: !381)
!404 = !DILocation(line: 77, column: 4, scope: !381)
!405 = !DILocation(line: 78, column: 1, scope: !381)
!406 = distinct !DISubprogram(name: "PosixConvertToCurrent", scope: !407, file: !407, line: 61, type: !408, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !361)
!407 = !DIFile(filename: "posixInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line670")
!408 = !DISubroutineType(types: !409)
!409 = !{!410, !359, !358}
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !411, line: 230, baseType: !351)
!411 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line670")
!412 = !DILocalVariable(name: "in", arg: 1, scope: !406, file: !407, line: 61, type: !359)
!413 = !DILocation(line: 61, column: 35, scope: !406)
!414 = !DILocalVariable(name: "out", arg: 2, scope: !406, file: !407, line: 62, type: !358)
!415 = !DILocation(line: 62, column: 30, scope: !406)
!416 = !DILocalVariable(name: "e", scope: !406, file: !407, line: 64, type: !417)
!417 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!418 = !DILocation(line: 64, column: 8, scope: !406)
!419 = !DILocation(line: 64, column: 13, scope: !406)
!420 = !DILocation(line: 64, column: 12, scope: !406)
!421 = !DILocalVariable(name: "p", scope: !406, file: !407, line: 65, type: !350)
!422 = !DILocation(line: 65, column: 10, scope: !406)
!423 = !DILocation(line: 65, column: 36, scope: !406)
!424 = !DILocation(line: 65, column: 14, scope: !406)
!425 = !DILocalVariable(name: "success", scope: !406, file: !407, line: 66, type: !410)
!426 = !DILocation(line: 66, column: 9, scope: !406)
!427 = !DILocation(line: 66, column: 19, scope: !406)
!428 = !DILocation(line: 66, column: 21, scope: !406)
!429 = !DILocation(line: 66, column: 28, scope: !406)
!430 = !DILocation(line: 66, column: 31, scope: !431)
!431 = !DILexicalBlockFile(scope: !406, file: !407, discriminator: 1)
!432 = !DILocation(line: 66, column: 34, scope: !431)
!433 = !DILocation(line: 66, column: 28, scope: !431)
!434 = !DILocation(line: 66, column: 28, scope: !435)
