; ModuleID = './ulRW.o.i'
source_filename = "./ulRW.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.MXUserHeader = type { i32, i8*, i32, %struct.anon, {}*, {}*, %struct.ListItem }
%struct.anon = type { i32 }
%struct.ListItem = type { %struct.ListItem*, %struct.ListItem* }
%struct.MXUserRWLock = type { %struct.MXUserHeader, i8, %union.pthread_rwlock_t, %struct.MXRecLock, %struct.Atomic_uint32, %struct.HashTable*, %struct.Atomic_uint64, %struct.Atomic_uint64 }
%union.pthread_rwlock_t = type { %struct.anon.0 }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i8, [7 x i8], i64, i32 }
%struct.MXRecLock = type { %union.pthread_mutex_t, i32, i64 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.Atomic_uint32 = type { i32 }
%struct.HashTable = type opaque
%struct.Atomic_uint64 = type { i64 }
%union.pthread_rwlockattr_t = type { i64 }
%struct.MXUserHeldStats = type { i64, %struct.MXUserBasicStats, %struct.Atomic_uint64 }
%struct.MXUserBasicStats = type { i8*, i64, i64, i64, i64, double }
%struct.MXUserAcquireStats = type { %struct.MXUserAcquisitionStats, %struct.Atomic_uint64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !21)
!1 = !DIFile(filename: "ulRW.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line502")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 440, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "ulInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line502")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "MXUSER_TYPE_NEVER_USE", value: 0)
!7 = !DIEnumerator(name: "MXUSER_TYPE_RW", value: 1)
!8 = !DIEnumerator(name: "MXUSER_TYPE_REC", value: 2)
!9 = !DIEnumerator(name: "MXUSER_TYPE_RANK", value: 3)
!10 = !DIEnumerator(name: "MXUSER_TYPE_EXCL", value: 4)
!11 = !DIEnumerator(name: "MXUSER_TYPE_SEMA", value: 5)
!12 = !DIEnumerator(name: "MXUSER_TYPE_CONDVAR", value: 6)
!13 = !DIEnumerator(name: "MXUSER_TYPE_BARRIER", value: 7)
!14 = !DIEnumerator(name: "MXUSER_TYPE_EVENT", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 230, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "ulRW.c", directory: "/home/lichi/Desktop/open-vm-tools/line502")
!17 = !{!18, !19, !20}
!18 = !DIEnumerator(name: "RW_UNLOCKED", value: 0)
!19 = !DIEnumerator(name: "RW_LOCKED_FOR_READ", value: 1)
!20 = !DIEnumerator(name: "RW_LOCKED_FOR_WRITE", value: 2)
!21 = !{!22, !154, !155, !156, !151}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserRWLock", file: !24, line: 40, baseType: !25)
!24 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/userlock.h", directory: "/home/lichi/Desktop/open-vm-tools/line502")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserRWLock", file: !16, line: 241, size: 1664, align: 64, elements: !26)
!26 = !{!27, !61, !63, !97, !132, !139, !144, !153}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !25, file: !16, line: 243, baseType: !28, size: 448, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserHeader", file: !4, line: 469, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserHeader", file: !4, line: 456, size: 448, align: 64, elements: !30)
!30 = !{!31, !37, !40, !42, !47, !52, !53}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !29, file: !4, line: 457, baseType: !32, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !33, line: 173, baseType: !34)
!33 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line502")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !35, line: 51, baseType: !36)
!35 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line502")
!36 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !29, file: !4, line: 458, baseType: !38, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !29, file: !4, line: 459, baseType: !41, size: 32, align: 32, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "MX_Rank", file: !33, line: 1167, baseType: !32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !29, file: !4, line: 464, baseType: !43, size: 32, align: 32, offset: 160)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !29, file: !4, line: 461, size: 32, align: 32, elements: !44)
!44 = !{!45, !46}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !43, file: !4, line: 462, baseType: !36, size: 24, align: 32, flags: DIFlagBitField, extraData: i64 0)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "badHeader", scope: !43, file: !4, line: 463, baseType: !36, size: 1, align: 32, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "dumpFunc", scope: !29, file: !4, line: 466, baseType: !48, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !51}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "statsFunc", scope: !29, file: !4, line: 467, baseType: !48, size: 64, align: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !29, file: !4, line: 468, baseType: !54, size: 128, align: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem", file: !55, line: 45, baseType: !56)
!55 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/circList.h", directory: "/home/lichi/Desktop/open-vm-tools/line502")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListItem", file: !55, line: 42, size: 128, align: 64, elements: !57)
!57 = !{!58, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !56, file: !55, line: 43, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !56, file: !55, line: 44, baseType: !59, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "useNative", scope: !25, file: !16, line: 245, baseType: !62, size: 8, align: 8, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !33, line: 230, baseType: !39)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "nativeLock", scope: !25, file: !16, line: 246, baseType: !64, size: 448, align: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "NativeRWLock", file: !16, line: 158, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !66, line: 222, baseType: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line502")
!67 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !66, line: 174, size: 448, align: 64, elements: !68)
!68 = !{!69, !91, !95}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !67, file: !66, line: 200, baseType: !70, size: 448, align: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !67, file: !66, line: 177, size: 448, align: 64, elements: !71)
!71 = !{!72, !74, !75, !76, !77, !78, !79, !80, !81, !83, !88, !90}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !70, file: !66, line: 179, baseType: !73, size: 32, align: 32)
!73 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers", scope: !70, file: !66, line: 180, baseType: !36, size: 32, align: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__readers_wakeup", scope: !70, file: !66, line: 181, baseType: !36, size: 32, align: 32, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__writer_wakeup", scope: !70, file: !66, line: 182, baseType: !36, size: 32, align: 32, offset: 96)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_readers_queued", scope: !70, file: !66, line: 183, baseType: !36, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__nr_writers_queued", scope: !70, file: !66, line: 184, baseType: !36, size: 32, align: 32, offset: 160)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__writer", scope: !70, file: !66, line: 185, baseType: !73, size: 32, align: 32, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !70, file: !66, line: 186, baseType: !73, size: 32, align: 32, offset: 224)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__rwelision", scope: !70, file: !66, line: 187, baseType: !82, size: 8, align: 8, offset: 256)
!82 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !70, file: !66, line: 192, baseType: !84, size: 56, align: 8, offset: 264)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 56, align: 8, elements: !86)
!85 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!86 = !{!87}
!87 = !DISubrange(count: 7)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !70, file: !66, line: 195, baseType: !89, size: 64, align: 64, offset: 320)
!89 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !70, file: !66, line: 198, baseType: !36, size: 32, align: 32, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !67, file: !66, line: 220, baseType: !92, size: 448, align: 8)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 448, align: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 56)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !67, file: !66, line: 221, baseType: !96, size: 64, align: 64)
!96 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "recursiveLock", scope: !25, file: !16, line: 247, baseType: !98, size: 448, align: 64, offset: 960)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXRecLock", file: !4, line: 67, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 58, size: 448, align: 64, elements: !100)
!100 = !{!101, !128, !129}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "nativeLock", scope: !99, file: !4, line: 62, baseType: !102, size: 320, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !66, line: 128, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !66, line: 90, size: 320, align: 64, elements: !104)
!104 = !{!105, !123, !127}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !103, file: !66, line: 125, baseType: !106, size: 320, align: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !66, line: 92, size: 320, align: 64, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !113, !115, !116}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !106, file: !66, line: 94, baseType: !73, size: 32, align: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !106, file: !66, line: 95, baseType: !36, size: 32, align: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !106, file: !66, line: 96, baseType: !73, size: 32, align: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !106, file: !66, line: 98, baseType: !36, size: 32, align: 32, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !106, file: !66, line: 102, baseType: !73, size: 32, align: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !106, file: !66, line: 104, baseType: !114, size: 16, align: 16, offset: 160)
!114 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !106, file: !66, line: 105, baseType: !114, size: 16, align: 16, offset: 176)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !106, file: !66, line: 106, baseType: !117, size: 128, align: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !66, line: 79, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !66, line: 75, size: 128, align: 64, elements: !119)
!119 = !{!120, !122}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !118, file: !66, line: 77, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !118, file: !66, line: 78, baseType: !121, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !103, file: !66, line: 126, baseType: !124, size: 320, align: 8)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 320, align: 8, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 40)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !103, file: !66, line: 127, baseType: !96, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "referenceCount", scope: !99, file: !4, line: 65, baseType: !73, size: 32, align: 32, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nativeThreadID", scope: !99, file: !4, line: 66, baseType: !130, size: 64, align: 64, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserThreadID", file: !4, line: 39, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !66, line: 60, baseType: !89)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "holderCount", scope: !25, file: !16, line: 249, baseType: !133, size: 32, align: 32, offset: 1408)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint32", file: !134, line: 135, baseType: !135)
!134 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_atomic.h", directory: "/home/lichi/Desktop/open-vm-tools/line502")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint32", file: !134, line: 133, size: 32, align: 32, elements: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !135, file: !134, line: 134, baseType: !138, size: 32, align: 32)
!138 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "holderTable", scope: !25, file: !16, line: 250, baseType: !140, size: 64, align: 64, offset: 1472)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashTable", file: !142, line: 40, baseType: !143)
!142 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hashTable.h", directory: "/home/lichi/Desktop/open-vm-tools/line502")
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashTable", file: !142, line: 40, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "heldStatsMem", scope: !25, file: !16, line: 252, baseType: !145, size: 64, align: 64, offset: 1536)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_Ptr", file: !134, line: 3829, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint64", file: !134, line: 139, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint64", file: !134, line: 137, size: 64, align: 64, elements: !148)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !147, file: !134, line: 138, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !33, line: 171, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !35, line: 55, baseType: !89)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "acquireStatsMem", scope: !25, file: !16, line: 253, baseType: !145, size: 64, align: 64, offset: 1600)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !35, line: 122, baseType: !89)
!157 = !{i32 2, !"Dwarf Version", i32 4}
!158 = !{i32 2, !"Debug Info Version", i32 3}
!159 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!160 = distinct !DISubprogram(name: "MXUserDumpRWLock", scope: !16, file: !16, line: 346, type: !161, isLocal: false, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !164)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!164 = !{}
!165 = !DILocalVariable(name: "header", arg: 1, scope: !160, file: !16, line: 346, type: !163)
!166 = !DIExpression()
!167 = !DILocation(line: 346, column: 32, scope: !160)
!168 = !DILocalVariable(name: "lock", scope: !160, file: !16, line: 348, type: !22)
!169 = !DILocation(line: 348, column: 18, scope: !160)
!170 = !DILocation(line: 348, column: 42, scope: !160)
!171 = !DILocation(line: 348, column: 25, scope: !160)
!172 = !DILocation(line: 350, column: 58, scope: !160)
!173 = !DILocation(line: 350, column: 4, scope: !160)
!174 = !DILocation(line: 352, column: 34, scope: !160)
!175 = !DILocation(line: 352, column: 40, scope: !160)
!176 = !DILocation(line: 352, column: 47, scope: !160)
!177 = !DILocation(line: 352, column: 4, scope: !160)
!178 = !DILocation(line: 353, column: 27, scope: !160)
!179 = !DILocation(line: 353, column: 33, scope: !160)
!180 = !DILocation(line: 353, column: 40, scope: !160)
!181 = !DILocation(line: 353, column: 4, scope: !160)
!182 = !DILocation(line: 354, column: 29, scope: !160)
!183 = !DILocation(line: 354, column: 35, scope: !160)
!184 = !DILocation(line: 354, column: 42, scope: !160)
!185 = !DILocation(line: 354, column: 4, scope: !160)
!186 = !DILocation(line: 355, column: 36, scope: !160)
!187 = !DILocation(line: 355, column: 42, scope: !160)
!188 = !DILocation(line: 355, column: 49, scope: !160)
!189 = !DILocation(line: 355, column: 54, scope: !160)
!190 = !DILocation(line: 355, column: 4, scope: !160)
!191 = !DILocation(line: 357, column: 28, scope: !192)
!192 = distinct !DILexicalBlock(scope: !160, file: !16, line: 357, column: 8)
!193 = !DILocation(line: 357, column: 34, scope: !192)
!194 = !DILocation(line: 357, column: 26, scope: !192)
!195 = !DILocation(line: 357, column: 25, scope: !192)
!196 = !DILocation(line: 357, column: 8, scope: !192)
!197 = !DILocation(line: 357, column: 8, scope: !160)
!198 = !DILocation(line: 358, column: 51, scope: !199)
!199 = distinct !DILexicalBlock(scope: !192, file: !16, line: 357, column: 50)
!200 = !DILocation(line: 358, column: 57, scope: !199)
!201 = !DILocation(line: 358, column: 7, scope: !199)
!202 = !DILocation(line: 359, column: 4, scope: !199)
!203 = !DILocation(line: 360, column: 47, scope: !204)
!204 = distinct !DILexicalBlock(scope: !192, file: !16, line: 359, column: 11)
!205 = !DILocation(line: 360, column: 53, scope: !204)
!206 = !DILocation(line: 360, column: 31, scope: !204)
!207 = !DILocation(line: 360, column: 7, scope: !208)
!208 = !DILexicalBlockFile(scope: !204, file: !16, discriminator: 1)
!209 = !DILocation(line: 363, column: 49, scope: !160)
!210 = !DILocation(line: 363, column: 55, scope: !160)
!211 = !DILocation(line: 363, column: 34, scope: !160)
!212 = !DILocation(line: 363, column: 4, scope: !213)
!213 = !DILexicalBlockFile(scope: !160, file: !16, discriminator: 1)
!214 = !DILocation(line: 364, column: 1, scope: !160)
!215 = distinct !DISubprogram(name: "MXRecLockCount", scope: !4, file: !4, line: 290, type: !216, isLocal: true, isDefinition: true, scopeLine: 291, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !164)
!216 = !DISubroutineType(types: !217)
!217 = !{!73, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!220 = !DILocalVariable(name: "lock", arg: 1, scope: !215, file: !4, line: 290, type: !218)
!221 = !DILocation(line: 290, column: 33, scope: !215)
!222 = !DILocation(line: 295, column: 11, scope: !215)
!223 = !DILocation(line: 295, column: 17, scope: !215)
!224 = !DILocation(line: 295, column: 4, scope: !215)
!225 = distinct !DISubprogram(name: "Atomic_Read32", scope: !134, file: !134, line: 911, type: !226, isLocal: true, isDefinition: true, scopeLine: 912, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !164)
!226 = !DISubroutineType(types: !227)
!227 = !{!32, !228}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!230 = !DILocalVariable(name: "var", arg: 1, scope: !225, file: !134, line: 911, type: !228)
!231 = !DILocation(line: 911, column: 36, scope: !225)
!232 = !DILocalVariable(name: "value", scope: !225, file: !134, line: 913, type: !32)
!233 = !DILocation(line: 913, column: 11, scope: !225)
!234 = !DILocation(line: 938, column: 14, scope: !225)
!235 = !DILocation(line: 938, column: 19, scope: !225)
!236 = !DILocation(line: 935, column: 4, scope: !225)
!237 = !{i32 140999}
!238 = !DILocation(line: 953, column: 11, scope: !225)
!239 = !DILocation(line: 953, column: 4, scope: !225)
!240 = distinct !DISubprogram(name: "MXUser_CreateRWLock", scope: !16, file: !16, line: 394, type: !241, isLocal: false, isDefinition: true, scopeLine: 396, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !164)
!241 = !DISubroutineType(types: !242)
!242 = !{!22, !243, !41}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!245 = !DILocalVariable(name: "userName", arg: 1, scope: !240, file: !16, line: 394, type: !243)
!246 = !DILocation(line: 394, column: 33, scope: !240)
!247 = !DILocalVariable(name: "rank", arg: 2, scope: !240, file: !16, line: 395, type: !41)
!248 = !DILocation(line: 395, column: 29, scope: !240)
!249 = !DILocalVariable(name: "lockInited", scope: !240, file: !16, line: 397, type: !62)
!250 = !DILocation(line: 397, column: 9, scope: !240)
!251 = !DILocalVariable(name: "properName", scope: !240, file: !16, line: 398, type: !38)
!252 = !DILocation(line: 398, column: 10, scope: !240)
!253 = !DILocalVariable(name: "useNative", scope: !240, file: !16, line: 399, type: !62)
!254 = !DILocation(line: 399, column: 9, scope: !240)
!255 = !DILocation(line: 399, column: 21, scope: !240)
!256 = !DILocalVariable(name: "lock", scope: !240, file: !16, line: 400, type: !22)
!257 = !DILocation(line: 400, column: 18, scope: !240)
!258 = !DILocation(line: 400, column: 25, scope: !240)
!259 = !DILocation(line: 402, column: 8, scope: !260)
!260 = distinct !DILexicalBlock(scope: !240, file: !16, line: 402, column: 8)
!261 = !DILocation(line: 402, column: 17, scope: !260)
!262 = !DILocation(line: 402, column: 8, scope: !240)
!263 = !DILocation(line: 403, column: 31, scope: !264)
!264 = distinct !DILexicalBlock(scope: !265, file: !16, line: 403, column: 11)
!265 = distinct !DILexicalBlock(scope: !260, file: !16, line: 402, column: 25)
!266 = !DILocation(line: 403, column: 29, scope: !264)
!267 = !DILocation(line: 403, column: 28, scope: !264)
!268 = !DILocation(line: 403, column: 11, scope: !264)
!269 = !DILocation(line: 403, column: 11, scope: !265)
!270 = !DILocation(line: 404, column: 54, scope: !271)
!271 = distinct !DILexicalBlock(scope: !264, file: !16, line: 403, column: 47)
!272 = !DILocation(line: 404, column: 23, scope: !273)
!273 = !DILexicalBlockFile(scope: !271, file: !16, discriminator: 1)
!274 = !DILocation(line: 404, column: 21, scope: !271)
!275 = !DILocation(line: 405, column: 7, scope: !271)
!276 = !DILocation(line: 407, column: 58, scope: !277)
!277 = distinct !DILexicalBlock(scope: !264, file: !16, line: 405, column: 14)
!278 = !DILocation(line: 407, column: 23, scope: !279)
!279 = !DILexicalBlockFile(scope: !277, file: !16, discriminator: 1)
!280 = !DILocation(line: 407, column: 21, scope: !277)
!281 = !DILocation(line: 409, column: 4, scope: !265)
!282 = !DILocation(line: 410, column: 37, scope: !283)
!283 = distinct !DILexicalBlock(scope: !260, file: !16, line: 409, column: 11)
!284 = !DILocation(line: 410, column: 20, scope: !283)
!285 = !DILocation(line: 410, column: 18, scope: !283)
!286 = !DILocation(line: 413, column: 29, scope: !240)
!287 = !DILocation(line: 413, column: 4, scope: !240)
!288 = !DILocation(line: 413, column: 10, scope: !240)
!289 = !DILocation(line: 413, column: 17, scope: !240)
!290 = !DILocation(line: 413, column: 27, scope: !240)
!291 = !DILocation(line: 414, column: 24, scope: !240)
!292 = !DILocation(line: 414, column: 4, scope: !240)
!293 = !DILocation(line: 414, column: 10, scope: !240)
!294 = !DILocation(line: 414, column: 17, scope: !240)
!295 = !DILocation(line: 414, column: 22, scope: !240)
!296 = !DILocation(line: 415, column: 24, scope: !240)
!297 = !DILocation(line: 415, column: 4, scope: !240)
!298 = !DILocation(line: 415, column: 10, scope: !240)
!299 = !DILocation(line: 415, column: 17, scope: !240)
!300 = !DILocation(line: 415, column: 22, scope: !240)
!301 = !DILocation(line: 416, column: 37, scope: !240)
!302 = !DILocation(line: 416, column: 4, scope: !240)
!303 = !DILocation(line: 416, column: 10, scope: !240)
!304 = !DILocation(line: 416, column: 17, scope: !240)
!305 = !DILocation(line: 416, column: 22, scope: !240)
!306 = !DILocation(line: 416, column: 35, scope: !240)
!307 = !DILocation(line: 417, column: 4, scope: !240)
!308 = !DILocation(line: 417, column: 10, scope: !240)
!309 = !DILocation(line: 417, column: 17, scope: !240)
!310 = !DILocation(line: 417, column: 26, scope: !240)
!311 = !DILocation(line: 425, column: 22, scope: !240)
!312 = !DILocation(line: 425, column: 32, scope: !240)
!313 = !DILocation(line: 425, column: 55, scope: !314)
!314 = !DILexicalBlockFile(scope: !240, file: !16, discriminator: 1)
!315 = !DILocation(line: 425, column: 61, scope: !314)
!316 = !DILocation(line: 425, column: 35, scope: !314)
!317 = !DILocation(line: 425, column: 32, scope: !314)
!318 = !DILocation(line: 425, column: 32, scope: !319)
!319 = !DILexicalBlockFile(scope: !240, file: !16, discriminator: 2)
!320 = !DILocation(line: 425, column: 22, scope: !319)
!321 = !DILocation(line: 425, column: 4, scope: !319)
!322 = !DILocation(line: 425, column: 10, scope: !319)
!323 = !DILocation(line: 425, column: 20, scope: !319)
!324 = !DILocation(line: 427, column: 32, scope: !240)
!325 = !DILocation(line: 427, column: 38, scope: !240)
!326 = !DILocation(line: 427, column: 17, scope: !240)
!327 = !DILocation(line: 427, column: 15, scope: !240)
!328 = !DILocation(line: 429, column: 28, scope: !329)
!329 = distinct !DILexicalBlock(scope: !240, file: !16, line: 429, column: 8)
!330 = !DILocation(line: 429, column: 26, scope: !329)
!331 = !DILocation(line: 429, column: 25, scope: !329)
!332 = !DILocation(line: 429, column: 8, scope: !329)
!333 = !DILocation(line: 429, column: 8, scope: !240)
!334 = !DILocalVariable(name: "statsMode", scope: !335, file: !16, line: 430, type: !32)
!335 = distinct !DILexicalBlock(scope: !329, file: !16, line: 429, column: 45)
!336 = !DILocation(line: 430, column: 14, scope: !335)
!337 = !DILocation(line: 432, column: 27, scope: !335)
!338 = !DILocation(line: 432, column: 7, scope: !335)
!339 = !DILocation(line: 432, column: 13, scope: !335)
!340 = !DILocation(line: 432, column: 25, scope: !335)
!341 = !DILocation(line: 436, column: 19, scope: !335)
!342 = !DILocation(line: 436, column: 17, scope: !335)
!343 = !DILocation(line: 438, column: 15, scope: !335)
!344 = !DILocation(line: 438, column: 7, scope: !335)
!345 = !DILocation(line: 440, column: 30, scope: !346)
!346 = distinct !DILexicalBlock(scope: !335, file: !16, line: 438, column: 34)
!347 = !DILocation(line: 440, column: 36, scope: !346)
!348 = !DILocation(line: 440, column: 54, scope: !346)
!349 = !DILocation(line: 440, column: 60, scope: !346)
!350 = !DILocation(line: 440, column: 10, scope: !346)
!351 = !DILocation(line: 441, column: 10, scope: !346)
!352 = !DILocation(line: 441, column: 16, scope: !346)
!353 = !DILocation(line: 441, column: 23, scope: !346)
!354 = !DILocation(line: 441, column: 33, scope: !346)
!355 = !DILocation(line: 442, column: 10, scope: !346)
!356 = !DILocation(line: 445, column: 29, scope: !346)
!357 = !DILocation(line: 445, column: 35, scope: !346)
!358 = !DILocation(line: 445, column: 10, scope: !346)
!359 = !DILocation(line: 446, column: 10, scope: !346)
!360 = !DILocation(line: 446, column: 16, scope: !346)
!361 = !DILocation(line: 446, column: 23, scope: !346)
!362 = !DILocation(line: 446, column: 33, scope: !346)
!363 = !DILocation(line: 447, column: 10, scope: !346)
!364 = !DILocation(line: 450, column: 29, scope: !346)
!365 = !DILocation(line: 450, column: 35, scope: !346)
!366 = !DILocation(line: 450, column: 53, scope: !346)
!367 = !DILocation(line: 450, column: 59, scope: !346)
!368 = !DILocation(line: 450, column: 10, scope: !346)
!369 = !DILocation(line: 451, column: 10, scope: !346)
!370 = !DILocation(line: 451, column: 16, scope: !346)
!371 = !DILocation(line: 451, column: 23, scope: !346)
!372 = !DILocation(line: 451, column: 33, scope: !346)
!373 = !DILocation(line: 452, column: 10, scope: !346)
!374 = !DILocation(line: 455, column: 63, scope: !346)
!375 = !DILocation(line: 455, column: 10, scope: !346)
!376 = !DILocation(line: 458, column: 24, scope: !335)
!377 = !DILocation(line: 458, column: 30, scope: !335)
!378 = !DILocation(line: 458, column: 7, scope: !335)
!379 = !DILocation(line: 459, column: 4, scope: !335)
!380 = !DILocation(line: 460, column: 7, scope: !381)
!381 = distinct !DILexicalBlock(scope: !329, file: !16, line: 459, column: 11)
!382 = !DILocation(line: 463, column: 11, scope: !240)
!383 = !DILocation(line: 463, column: 4, scope: !240)
!384 = distinct !DISubprogram(name: "MXUserNativeRWSupported", scope: !16, file: !16, line: 164, type: !385, isLocal: true, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !164)
!385 = !DISubroutineType(types: !386)
!386 = !{!62}
!387 = !DILocation(line: 167, column: 4, scope: !384)
!388 = distinct !DISubprogram(name: "MXUserNativeRWInit", scope: !16, file: !16, line: 174, type: !389, isLocal: true, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !164)
!389 = !DISubroutineType(types: !390)
!390 = !{!62, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!392 = !DILocalVariable(name: "lock", arg: 1, scope: !388, file: !16, line: 174, type: !391)
!393 = !DILocation(line: 174, column: 34, scope: !388)
!394 = !DILocation(line: 177, column: 32, scope: !388)
!395 = !DILocation(line: 177, column: 12, scope: !388)
!396 = !DILocation(line: 177, column: 43, scope: !388)
!397 = !DILocation(line: 177, column: 11, scope: !388)
!398 = !DILocation(line: 177, column: 4, scope: !388)
!399 = distinct !DISubprogram(name: "MXRecLockInit", scope: !4, file: !4, line: 264, type: !400, isLocal: true, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !164)
!400 = !DISubroutineType(types: !401)
!401 = !{!62, !402}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!403 = !DILocalVariable(name: "lock", arg: 1, scope: !399, file: !4, line: 264, type: !402)
!404 = !DILocation(line: 264, column: 26, scope: !399)
!405 = !DILocalVariable(name: "success", scope: !399, file: !4, line: 266, type: !62)
!406 = !DILocation(line: 266, column: 9, scope: !399)
!407 = !DILocation(line: 266, column: 44, scope: !399)
!408 = !DILocation(line: 266, column: 20, scope: !399)
!409 = !DILocation(line: 266, column: 50, scope: !399)
!410 = !DILocation(line: 266, column: 19, scope: !399)
!411 = !DILocation(line: 268, column: 8, scope: !412)
!412 = distinct !DILexicalBlock(scope: !399, file: !4, line: 268, column: 8)
!413 = !DILocation(line: 268, column: 8, scope: !399)
!414 = !DILocation(line: 269, column: 27, scope: !415)
!415 = distinct !DILexicalBlock(scope: !412, file: !4, line: 268, column: 17)
!416 = !DILocation(line: 269, column: 7, scope: !415)
!417 = !DILocation(line: 271, column: 7, scope: !415)
!418 = !DILocation(line: 271, column: 13, scope: !415)
!419 = !DILocation(line: 271, column: 28, scope: !415)
!420 = !DILocation(line: 272, column: 4, scope: !415)
!421 = !DILocation(line: 274, column: 11, scope: !399)
!422 = !DILocation(line: 274, column: 4, scope: !399)
!423 = distinct !DISubprogram(name: "MXUserFreeHashEntry", scope: !16, file: !16, line: 388, type: !424, isLocal: true, isDefinition: true, scopeLine: 389, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !164)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !154}
!426 = !DILocalVariable(name: "data", arg: 1, scope: !423, file: !16, line: 388, type: !154)
!427 = !DILocation(line: 388, column: 27, scope: !423)
!428 = !DILocation(line: 390, column: 9, scope: !423)
!429 = !DILocation(line: 390, column: 4, scope: !423)
!430 = !DILocation(line: 391, column: 1, scope: !423)
!431 = distinct !DISubprogram(name: "MXUserStatsActionRW", scope: !16, file: !16, line: 274, type: !161, isLocal: true, isDefinition: true, scopeLine: 275, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !164)
!432 = !DILocalVariable(name: "header", arg: 1, scope: !431, file: !16, line: 274, type: !163)
!433 = !DILocation(line: 274, column: 35, scope: !431)
!434 = !DILocalVariable(name: "lock", scope: !431, file: !16, line: 276, type: !22)
!435 = !DILocation(line: 276, column: 18, scope: !431)
!436 = !DILocation(line: 276, column: 42, scope: !431)
!437 = !DILocation(line: 276, column: 25, scope: !431)
!438 = !DILocalVariable(name: "heldStats", scope: !431, file: !16, line: 277, type: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserHeldStats", file: !4, line: 569, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 564, size: 512, align: 64, elements: !442)
!442 = !{!443, !447, !458}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "holdStart", scope: !441, file: !4, line: 566, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmTimeType", file: !33, line: 354, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !33, line: 172, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !35, line: 40, baseType: !96)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !441, file: !4, line: 567, baseType: !448, size: 384, align: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserBasicStats", file: !4, line: 539, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 532, size: 384, align: 64, elements: !450)
!450 = !{!451, !452, !453, !454, !455, !456}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "typeName", scope: !449, file: !4, line: 533, baseType: !38, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "numSamples", scope: !449, file: !4, line: 534, baseType: !151, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "minTime", scope: !449, file: !4, line: 535, baseType: !151, size: 64, align: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "maxTime", scope: !449, file: !4, line: 536, baseType: !151, size: 64, align: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "timeSum", scope: !449, file: !4, line: 537, baseType: !151, size: 64, align: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "timeSquaredSum", scope: !449, file: !4, line: 538, baseType: !457, size: 64, align: 64, offset: 320)
!457 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "histo", scope: !441, file: !4, line: 568, baseType: !145, size: 64, align: 64, offset: 448)
!459 = !DILocation(line: 277, column: 21, scope: !431)
!460 = !DILocation(line: 277, column: 49, scope: !431)
!461 = !DILocation(line: 277, column: 55, scope: !431)
!462 = !DILocation(line: 277, column: 33, scope: !431)
!463 = !DILocalVariable(name: "acquireStats", scope: !431, file: !16, line: 278, type: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserAcquireStats", file: !4, line: 562, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 558, size: 960, align: 64, elements: !467)
!467 = !{!468, !481}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !466, file: !4, line: 560, baseType: !469, size: 896, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserAcquisitionStats", file: !4, line: 552, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 541, size: 896, align: 64, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479, !480}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "contentionRatioFloor", scope: !470, file: !4, line: 542, baseType: !457, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "contentionCountFloor", scope: !470, file: !4, line: 543, baseType: !151, size: 64, align: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "contentionDurationFloor", scope: !470, file: !4, line: 544, baseType: !151, size: 64, align: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "numAttempts", scope: !470, file: !4, line: 545, baseType: !151, size: 64, align: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "numSuccesses", scope: !470, file: !4, line: 546, baseType: !151, size: 64, align: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "numSuccessesContended", scope: !470, file: !4, line: 547, baseType: !151, size: 64, align: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "successContentionTime", scope: !470, file: !4, line: 548, baseType: !151, size: 64, align: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "totalContentionTime", scope: !470, file: !4, line: 549, baseType: !151, size: 64, align: 64, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "basicStats", scope: !470, file: !4, line: 551, baseType: !448, size: 384, align: 64, offset: 512)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "histo", scope: !466, file: !4, line: 561, baseType: !145, size: 64, align: 64, offset: 896)
!482 = !DILocation(line: 278, column: 24, scope: !431)
!483 = !DILocation(line: 278, column: 55, scope: !431)
!484 = !DILocation(line: 278, column: 61, scope: !431)
!485 = !DILocation(line: 278, column: 39, scope: !431)
!486 = !DILocation(line: 280, column: 8, scope: !487)
!487 = distinct !DILexicalBlock(scope: !431, file: !16, line: 280, column: 8)
!488 = !DILocation(line: 280, column: 8, scope: !431)
!489 = !DILocation(line: 281, column: 29, scope: !490)
!490 = distinct !DILexicalBlock(scope: !487, file: !16, line: 280, column: 19)
!491 = !DILocation(line: 281, column: 40, scope: !490)
!492 = !DILocation(line: 281, column: 46, scope: !490)
!493 = !DILocation(line: 281, column: 7, scope: !490)
!494 = !DILocation(line: 283, column: 27, scope: !495)
!495 = distinct !DILexicalBlock(scope: !490, file: !16, line: 283, column: 11)
!496 = !DILocation(line: 283, column: 38, scope: !495)
!497 = !DILocation(line: 283, column: 11, scope: !495)
!498 = !DILocation(line: 283, column: 45, scope: !495)
!499 = !DILocation(line: 283, column: 11, scope: !490)
!500 = !DILocation(line: 284, column: 42, scope: !501)
!501 = distinct !DILexicalBlock(scope: !495, file: !16, line: 283, column: 53)
!502 = !DILocation(line: 284, column: 53, scope: !501)
!503 = !DILocation(line: 284, column: 26, scope: !501)
!504 = !DILocation(line: 284, column: 61, scope: !501)
!505 = !DILocation(line: 284, column: 10, scope: !506)
!506 = !DILexicalBlockFile(scope: !501, file: !16, discriminator: 1)
!507 = !DILocation(line: 285, column: 7, scope: !501)
!508 = !DILocation(line: 286, column: 4, scope: !490)
!509 = !DILocation(line: 288, column: 8, scope: !510)
!510 = distinct !DILexicalBlock(scope: !431, file: !16, line: 288, column: 8)
!511 = !DILocation(line: 288, column: 8, scope: !431)
!512 = !DILocalVariable(name: "isHot", scope: !513, file: !16, line: 289, type: !62)
!513 = distinct !DILexicalBlock(scope: !510, file: !16, line: 288, column: 22)
!514 = !DILocation(line: 289, column: 12, scope: !513)
!515 = !DILocalVariable(name: "doLog", scope: !513, file: !16, line: 290, type: !62)
!516 = !DILocation(line: 290, column: 12, scope: !513)
!517 = !DILocalVariable(name: "contentionRatio", scope: !513, file: !16, line: 291, type: !457)
!518 = !DILocation(line: 291, column: 14, scope: !513)
!519 = !DILocation(line: 297, column: 35, scope: !513)
!520 = !DILocation(line: 297, column: 49, scope: !513)
!521 = !DILocation(line: 297, column: 55, scope: !513)
!522 = !DILocation(line: 297, column: 7, scope: !513)
!523 = !DILocation(line: 299, column: 27, scope: !524)
!524 = distinct !DILexicalBlock(scope: !513, file: !16, line: 299, column: 11)
!525 = !DILocation(line: 299, column: 41, scope: !524)
!526 = !DILocation(line: 299, column: 11, scope: !524)
!527 = !DILocation(line: 299, column: 48, scope: !524)
!528 = !DILocation(line: 299, column: 11, scope: !513)
!529 = !DILocation(line: 300, column: 42, scope: !530)
!530 = distinct !DILexicalBlock(scope: !524, file: !16, line: 299, column: 56)
!531 = !DILocation(line: 300, column: 56, scope: !530)
!532 = !DILocation(line: 300, column: 26, scope: !530)
!533 = !DILocation(line: 300, column: 64, scope: !530)
!534 = !DILocation(line: 300, column: 10, scope: !535)
!535 = !DILexicalBlockFile(scope: !530, file: !16, discriminator: 1)
!536 = !DILocation(line: 301, column: 7, scope: !530)
!537 = !DILocation(line: 307, column: 22, scope: !513)
!538 = !DILocation(line: 307, column: 36, scope: !513)
!539 = !DILocation(line: 307, column: 7, scope: !513)
!540 = !DILocation(line: 309, column: 11, scope: !541)
!541 = distinct !DILexicalBlock(scope: !513, file: !16, line: 309, column: 11)
!542 = !DILocation(line: 309, column: 11, scope: !513)
!543 = !DILocation(line: 310, column: 39, scope: !544)
!544 = distinct !DILexicalBlock(scope: !541, file: !16, line: 309, column: 18)
!545 = !DILocation(line: 310, column: 45, scope: !544)
!546 = !DILocation(line: 310, column: 10, scope: !544)
!547 = !DILocation(line: 314, column: 14, scope: !548)
!548 = distinct !DILexicalBlock(scope: !544, file: !16, line: 314, column: 14)
!549 = !DILocation(line: 314, column: 14, scope: !544)
!550 = !DILocation(line: 315, column: 35, scope: !551)
!551 = distinct !DILexicalBlock(scope: !548, file: !16, line: 314, column: 25)
!552 = !DILocation(line: 315, column: 41, scope: !551)
!553 = !DILocation(line: 315, column: 13, scope: !551)
!554 = !DILocation(line: 318, column: 10, scope: !551)
!555 = !DILocation(line: 320, column: 14, scope: !556)
!556 = distinct !DILexicalBlock(scope: !544, file: !16, line: 320, column: 14)
!557 = !DILocation(line: 320, column: 14, scope: !544)
!558 = !DILocation(line: 322, column: 17, scope: !559)
!559 = distinct !DILexicalBlock(scope: !556, file: !16, line: 320, column: 21)
!560 = !DILocation(line: 322, column: 23, scope: !559)
!561 = !DILocation(line: 322, column: 30, scope: !559)
!562 = !DILocation(line: 322, column: 36, scope: !559)
!563 = !DILocation(line: 321, column: 13, scope: !559)
!564 = !DILocation(line: 323, column: 10, scope: !559)
!565 = !DILocation(line: 324, column: 7, scope: !544)
!566 = !DILocation(line: 325, column: 4, scope: !513)
!567 = !DILocation(line: 326, column: 1, scope: !431)
!568 = distinct !DISubprogram(name: "MXUser_DestroyRWLock", scope: !16, file: !16, line: 484, type: !569, isLocal: false, isDefinition: true, scopeLine: 485, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !164)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !22}
!571 = !DILocalVariable(name: "lock", arg: 1, scope: !568, file: !16, line: 484, type: !22)
!572 = !DILocation(line: 484, column: 36, scope: !568)
!573 = !DILocation(line: 486, column: 28, scope: !574)
!574 = distinct !DILexicalBlock(scope: !568, file: !16, line: 486, column: 8)
!575 = !DILocation(line: 486, column: 33, scope: !574)
!576 = !DILocation(line: 486, column: 26, scope: !574)
!577 = !DILocation(line: 486, column: 25, scope: !574)
!578 = !DILocation(line: 486, column: 8, scope: !574)
!579 = !DILocation(line: 486, column: 8, scope: !568)
!580 = !DILocation(line: 487, column: 29, scope: !581)
!581 = distinct !DILexicalBlock(scope: !574, file: !16, line: 486, column: 14)
!582 = !DILocation(line: 487, column: 35, scope: !581)
!583 = !DILocation(line: 487, column: 7, scope: !581)
!584 = !DILocation(line: 489, column: 26, scope: !585)
!585 = distinct !DILexicalBlock(scope: !581, file: !16, line: 489, column: 11)
!586 = !DILocation(line: 489, column: 32, scope: !585)
!587 = !DILocation(line: 489, column: 11, scope: !585)
!588 = !DILocation(line: 489, column: 45, scope: !585)
!589 = !DILocation(line: 489, column: 11, scope: !581)
!590 = !DILocation(line: 490, column: 30, scope: !591)
!591 = distinct !DILexicalBlock(scope: !585, file: !16, line: 489, column: 51)
!592 = !DILocation(line: 490, column: 36, scope: !591)
!593 = !DILocation(line: 490, column: 10, scope: !591)
!594 = !DILocation(line: 493, column: 7, scope: !591)
!595 = !DILocation(line: 495, column: 31, scope: !596)
!596 = distinct !DILexicalBlock(scope: !581, file: !16, line: 495, column: 11)
!597 = !DILocation(line: 495, column: 37, scope: !596)
!598 = !DILocation(line: 495, column: 29, scope: !596)
!599 = !DILocation(line: 495, column: 28, scope: !596)
!600 = !DILocation(line: 495, column: 11, scope: !596)
!601 = !DILocation(line: 495, column: 11, scope: !581)
!602 = !DILocalVariable(name: "err", scope: !603, file: !16, line: 496, type: !73)
!603 = distinct !DILexicalBlock(scope: !596, file: !16, line: 495, column: 53)
!604 = !DILocation(line: 496, column: 14, scope: !603)
!605 = !DILocation(line: 496, column: 43, scope: !603)
!606 = !DILocation(line: 496, column: 49, scope: !603)
!607 = !DILocation(line: 496, column: 20, scope: !603)
!608 = !DILocation(line: 498, column: 32, scope: !609)
!609 = distinct !DILexicalBlock(scope: !603, file: !16, line: 498, column: 14)
!610 = !DILocation(line: 498, column: 36, scope: !609)
!611 = !DILocation(line: 498, column: 31, scope: !609)
!612 = !DILocation(line: 498, column: 14, scope: !609)
!613 = !DILocation(line: 498, column: 14, scope: !603)
!614 = !DILocation(line: 499, column: 33, scope: !615)
!615 = distinct !DILexicalBlock(scope: !609, file: !16, line: 498, column: 47)
!616 = !DILocation(line: 499, column: 39, scope: !615)
!617 = !DILocation(line: 500, column: 46, scope: !615)
!618 = !DILocation(line: 499, column: 13, scope: !615)
!619 = !DILocation(line: 501, column: 10, scope: !615)
!620 = !DILocation(line: 502, column: 7, scope: !603)
!621 = !DILocation(line: 504, column: 25, scope: !581)
!622 = !DILocation(line: 504, column: 31, scope: !581)
!623 = !DILocation(line: 504, column: 7, scope: !581)
!624 = !DILocation(line: 506, column: 29, scope: !581)
!625 = !DILocation(line: 506, column: 35, scope: !581)
!626 = !DILocation(line: 506, column: 7, scope: !581)
!627 = !DILocation(line: 512, column: 28, scope: !581)
!628 = !DILocation(line: 512, column: 34, scope: !581)
!629 = !DILocation(line: 512, column: 7, scope: !581)
!630 = !DILocation(line: 514, column: 7, scope: !581)
!631 = !DILocation(line: 514, column: 13, scope: !581)
!632 = !DILocation(line: 514, column: 20, scope: !581)
!633 = !DILocation(line: 514, column: 30, scope: !581)
!634 = !DILocation(line: 515, column: 12, scope: !581)
!635 = !DILocation(line: 515, column: 18, scope: !581)
!636 = !DILocation(line: 515, column: 25, scope: !581)
!637 = !DILocation(line: 515, column: 7, scope: !581)
!638 = !DILocation(line: 516, column: 7, scope: !581)
!639 = !DILocation(line: 516, column: 13, scope: !581)
!640 = !DILocation(line: 516, column: 20, scope: !581)
!641 = !DILocation(line: 516, column: 25, scope: !581)
!642 = !DILocation(line: 517, column: 12, scope: !581)
!643 = !DILocation(line: 517, column: 7, scope: !581)
!644 = !DILocation(line: 518, column: 4, scope: !581)
!645 = !DILocation(line: 519, column: 1, scope: !568)
!646 = distinct !DISubprogram(name: "MXUserValidateHeader", scope: !4, file: !4, line: 507, type: !647, isLocal: true, isDefinition: true, scopeLine: 509, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !164)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !163, !649}
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserObjectType", file: !4, line: 450, baseType: !3)
!650 = !DILocalVariable(name: "header", arg: 1, scope: !646, file: !4, line: 507, type: !163)
!651 = !DILocation(line: 507, column: 36, scope: !646)
!652 = !DILocalVariable(name: "objectType", arg: 2, scope: !646, file: !4, line: 508, type: !649)
!653 = !DILocation(line: 508, column: 39, scope: !646)
!654 = !DILocation(line: 510, column: 4, scope: !646)
!655 = distinct !DISubprogram(name: "MXUserNativeRWDestroy", scope: !16, file: !16, line: 184, type: !656, isLocal: true, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !164)
!656 = !DISubroutineType(types: !657)
!657 = !{!73, !391}
!658 = !DILocalVariable(name: "lock", arg: 1, scope: !655, file: !16, line: 184, type: !391)
!659 = !DILocation(line: 184, column: 37, scope: !655)
!660 = !DILocation(line: 187, column: 34, scope: !655)
!661 = !DILocation(line: 187, column: 11, scope: !655)
!662 = !DILocation(line: 187, column: 4, scope: !655)
!663 = distinct !DISubprogram(name: "MXRecLockDestroy", scope: !4, file: !4, line: 279, type: !664, isLocal: true, isDefinition: true, scopeLine: 280, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !164)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !402}
!666 = !DILocalVariable(name: "lock", arg: 1, scope: !663, file: !4, line: 279, type: !402)
!667 = !DILocation(line: 279, column: 29, scope: !663)
!668 = !DILocalVariable(name: "err", scope: !663, file: !4, line: 281, type: !73)
!669 = !DILocation(line: 281, column: 8, scope: !663)
!670 = !DILocation(line: 281, column: 39, scope: !663)
!671 = !DILocation(line: 281, column: 14, scope: !663)
!672 = !DILocation(line: 286, column: 1, scope: !663)
!673 = distinct !DISubprogram(name: "MXUser_AcquireForRead", scope: !16, file: !16, line: 707, type: !569, isLocal: false, isDefinition: true, scopeLine: 708, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !164)
!674 = !DILocalVariable(name: "lock", arg: 1, scope: !673, file: !16, line: 707, type: !22)
!675 = !DILocation(line: 707, column: 37, scope: !673)
!676 = !DILocation(line: 709, column: 22, scope: !673)
!677 = !DILocation(line: 709, column: 4, scope: !673)
!678 = !DILocation(line: 710, column: 1, scope: !673)
!679 = distinct !DISubprogram(name: "MXUserAcquisition", scope: !16, file: !16, line: 582, type: !680, isLocal: true, isDefinition: true, scopeLine: 584, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !164)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !22, !62}
!682 = !DILocalVariable(name: "lock", arg: 1, scope: !679, file: !16, line: 582, type: !22)
!683 = !DILocation(line: 582, column: 33, scope: !679)
!684 = !DILocalVariable(name: "forRead", arg: 2, scope: !679, file: !16, line: 583, type: !62)
!685 = !DILocation(line: 583, column: 24, scope: !679)
!686 = !DILocalVariable(name: "myContext", scope: !679, file: !16, line: 585, type: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "HolderContext", file: !16, line: 239, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 236, size: 128, align: 64, elements: !690)
!690 = !{!691, !693}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !689, file: !16, line: 237, baseType: !692, size: 32, align: 32)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "HolderState", file: !16, line: 234, baseType: !15)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "holdStart", scope: !689, file: !16, line: 238, baseType: !444, size: 64, align: 64, offset: 64)
!694 = !DILocation(line: 585, column: 19, scope: !679)
!695 = !DILocation(line: 588, column: 26, scope: !679)
!696 = !DILocation(line: 588, column: 32, scope: !679)
!697 = !DILocation(line: 588, column: 4, scope: !679)
!698 = !DILocation(line: 590, column: 31, scope: !679)
!699 = !DILocation(line: 590, column: 37, scope: !679)
!700 = !DILocation(line: 590, column: 4, scope: !679)
!701 = !DILocation(line: 592, column: 39, scope: !679)
!702 = !DILocation(line: 592, column: 16, scope: !679)
!703 = !DILocation(line: 592, column: 14, scope: !679)
!704 = !DILocation(line: 594, column: 26, scope: !705)
!705 = distinct !DILexicalBlock(scope: !679, file: !16, line: 594, column: 8)
!706 = !DILocation(line: 594, column: 37, scope: !705)
!707 = !DILocation(line: 594, column: 43, scope: !705)
!708 = !DILocation(line: 594, column: 25, scope: !705)
!709 = !DILocation(line: 594, column: 8, scope: !705)
!710 = !DILocation(line: 594, column: 8, scope: !679)
!711 = !DILocation(line: 595, column: 27, scope: !712)
!712 = distinct !DILexicalBlock(scope: !705, file: !16, line: 594, column: 64)
!713 = !DILocation(line: 595, column: 33, scope: !712)
!714 = !DILocation(line: 598, column: 25, scope: !712)
!715 = !DILocation(line: 599, column: 26, scope: !712)
!716 = !DILocation(line: 599, column: 37, scope: !712)
!717 = !DILocation(line: 599, column: 43, scope: !712)
!718 = !DILocation(line: 599, column: 25, scope: !712)
!719 = !DILocation(line: 595, column: 7, scope: !712)
!720 = !DILocation(line: 601, column: 4, scope: !712)
!721 = !DILocation(line: 664, column: 31, scope: !722)
!722 = distinct !DILexicalBlock(scope: !723, file: !16, line: 664, column: 11)
!723 = distinct !DILexicalBlock(scope: !724, file: !16, line: 663, column: 11)
!724 = distinct !DILexicalBlock(scope: !679, file: !16, line: 603, column: 8)
!725 = !DILocation(line: 664, column: 37, scope: !722)
!726 = !DILocation(line: 664, column: 29, scope: !722)
!727 = !DILocation(line: 664, column: 28, scope: !722)
!728 = !DILocation(line: 664, column: 11, scope: !722)
!729 = !DILocation(line: 664, column: 11, scope: !723)
!730 = !DILocalVariable(name: "err", scope: !731, file: !16, line: 665, type: !73)
!731 = distinct !DILexicalBlock(scope: !722, file: !16, line: 664, column: 53)
!732 = !DILocation(line: 665, column: 14, scope: !731)
!733 = !DILocation(line: 667, column: 33, scope: !731)
!734 = !DILocation(line: 667, column: 39, scope: !731)
!735 = !DILocation(line: 667, column: 51, scope: !731)
!736 = !DILocation(line: 667, column: 10, scope: !731)
!737 = !DILocation(line: 669, column: 32, scope: !738)
!738 = distinct !DILexicalBlock(scope: !731, file: !16, line: 669, column: 14)
!739 = !DILocation(line: 669, column: 36, scope: !738)
!740 = !DILocation(line: 669, column: 31, scope: !738)
!741 = !DILocation(line: 669, column: 14, scope: !738)
!742 = !DILocation(line: 669, column: 14, scope: !731)
!743 = !DILocation(line: 670, column: 33, scope: !744)
!744 = distinct !DILexicalBlock(scope: !738, file: !16, line: 669, column: 47)
!745 = !DILocation(line: 670, column: 39, scope: !744)
!746 = !DILocation(line: 671, column: 46, scope: !744)
!747 = !DILocation(line: 670, column: 13, scope: !744)
!748 = !DILocation(line: 672, column: 10, scope: !744)
!749 = !DILocation(line: 673, column: 7, scope: !731)
!750 = !DILocation(line: 674, column: 28, scope: !751)
!751 = distinct !DILexicalBlock(scope: !722, file: !16, line: 673, column: 14)
!752 = !DILocation(line: 674, column: 34, scope: !751)
!753 = !DILocation(line: 674, column: 10, scope: !751)
!754 = !DILocation(line: 679, column: 9, scope: !755)
!755 = distinct !DILexicalBlock(scope: !679, file: !16, line: 679, column: 8)
!756 = !DILocation(line: 679, column: 17, scope: !755)
!757 = !DILocation(line: 679, column: 21, scope: !758)
!758 = !DILexicalBlockFile(scope: !755, file: !16, discriminator: 1)
