; ModuleID = './posixPosix.o.i'
source_filename = "./posixPosix.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.mntent = type { i8*, i8*, i8*, i8*, i32, i32 }
%struct.Atomic_uint64 = type { i64 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.utimbuf = type { i64, i64 }
%struct.timeval = type { i64, i64 }
%struct.__dirstream = type opaque
%struct.HashTable = type opaque
%struct.PosixEnvEntry = type { %struct.Atomic_uint64, %struct.Atomic_uint64 }
%struct.statfs = type { i64, i64, i64, i64, i64, i64, i64, %struct.__fsid_t, i64, i64, i64, [4 x i64] }
%struct.__fsid_t = type { [2 x i32] }

@Posix_Getmntent.sm = internal global %struct.mntent zeroinitializer, align 8
@.str = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@PosixGetenvHash.htPtr = internal global %struct.Atomic_uint64 zeroinitializer, align 8
@.str.1 = private unnamed_addr constant [19 x i8] c"NOT_REACHED %s:%d\0A\00", align 1

!283 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20000", value: 276)
!284 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20001", value: 277)
!285 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20002", value: 278)
!286 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20003", value: 279)
!287 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20004", value: 280)
!288 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20005", value: 281)
!289 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20105", value: 282)
!290 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20106", value: 283)
!291 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20107", value: 284)
!292 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20108", value: 285)
!293 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20269", value: 286)
!294 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20833", value: 287)
!295 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_20949", value: 288)
!296 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_21025", value: 289)
!297 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_21027", value: 290)
!298 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_29001", value: 291)
!299 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_38598", value: 292)
!300 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50221", value: 293)
!301 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50222", value: 294)
!302 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50229", value: 295)
!303 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50930", value: 296)
!304 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50931", value: 297)
!305 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50933", value: 298)
!306 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50935", value: 299)
!307 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50936", value: 300)
!308 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50937", value: 301)
!309 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50939", value: 302)
!310 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_51936", value: 303)
!311 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_51950", value: 304)
!312 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57002", value: 305)
!313 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57003", value: 306)
!314 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57004", value: 307)
!315 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57005", value: 308)
!316 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57006", value: 309)
!317 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57007", value: 310)
!318 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57008", value: 311)
!319 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57009", value: 312)
!320 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57010", value: 313)
!321 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57011", value: 314)
!322 = !DIEnumerator(name: "STRING_ENCODING_IBM_813", value: 315)
!323 = !DIEnumerator(name: "STRING_ENCODING_IBM_943_P130_1999", value: 316)
!324 = !DIEnumerator(name: "STRING_ENCODING_IBM_33722", value: 317)
!325 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_949", value: 318)
!326 = !DIEnumerator(name: "STRING_ENCODING_IBM_1363", value: 319)
!327 = !DIEnumerator(name: "STRING_ENCODING_IBM_1386", value: 320)
!328 = !DIEnumerator(name: "STRING_ENCODING_IBM_1373", value: 321)
!329 = !DIEnumerator(name: "STRING_ENCODING_IBM_5471", value: 322)
!330 = !DIEnumerator(name: "STRING_ENCODING_IBM_874", value: 323)
!331 = !DIEnumerator(name: "STRING_ENCODING_MAX_SPECIFIED", value: 324)
!332 = !DIEnumerator(name: "STRING_ENCODING_DEFAULT", value: -1)
!333 = !DIEnumerator(name: "STRING_ENCODING_UNKNOWN", value: -2)
!334 = !DIEnumerator(name: "STRING_ENCODING_UTF16", value: 1)
!335 = !DIEnumerator(name: "STRING_ENCODING_UTF32", value: 4)
!336 = !{!337, !340, !341, !342, !347}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !343, line: 171, baseType: !344)
!343 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !345, line: 55, baseType: !346)
!345 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!346 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !345, line: 122, baseType: !346)
!348 = !{!349, !424}
!349 = distinct !DIGlobalVariable(name: "sm", scope: !350, file: !351, line: 1953, type: !355, isLocal: true, isDefinition: true, variable: %struct.mntent* @Posix_Getmntent.sm)
!350 = distinct !DISubprogram(name: "Posix_Getmntent", scope: !351, file: !351, line: 1949, type: !352, isLocal: false, isDefinition: true, scopeLine: 1950, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!351 = !DIFile(filename: "posixPosix.c", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!352 = !DISubroutineType(types: !353)
!353 = !{!354, !365}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mntent", file: !356, line: 53, size: 320, align: 64, elements: !357)
!356 = !DIFile(filename: "/usr/include/mntent.h", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!357 = !{!358, !359, !360, !361, !362, !364}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_fsname", scope: !355, file: !356, line: 55, baseType: !338, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_dir", scope: !355, file: !356, line: 56, baseType: !338, size: 64, align: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_type", scope: !355, file: !356, line: 57, baseType: !338, size: 64, align: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_opts", scope: !355, file: !356, line: 58, baseType: !338, size: 64, align: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_freq", scope: !355, file: !356, line: 59, baseType: !363, size: 32, align: 32, offset: 256)
!363 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_passno", scope: !355, file: !356, line: 60, baseType: !363, size: 32, align: 32, offset: 288)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !367, line: 48, baseType: !368)
!367 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !369, line: 241, size: 1728, align: 64, elements: !370)
!369 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !391, !392, !393, !394, !398, !400, !402, !406, !409, !411, !412, !413, !414, !415, !418, !419}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !368, file: !369, line: 242, baseType: !363, size: 32, align: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !368, file: !369, line: 247, baseType: !338, size: 64, align: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !368, file: !369, line: 248, baseType: !338, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !368, file: !369, line: 249, baseType: !338, size: 64, align: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !368, file: !369, line: 250, baseType: !338, size: 64, align: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !368, file: !369, line: 251, baseType: !338, size: 64, align: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !368, file: !369, line: 252, baseType: !338, size: 64, align: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !368, file: !369, line: 253, baseType: !338, size: 64, align: 64, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !368, file: !369, line: 254, baseType: !338, size: 64, align: 64, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !368, file: !369, line: 256, baseType: !338, size: 64, align: 64, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !368, file: !369, line: 257, baseType: !338, size: 64, align: 64, offset: 640)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !368, file: !369, line: 258, baseType: !338, size: 64, align: 64, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !368, file: !369, line: 260, baseType: !384, size: 64, align: 64, offset: 768)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !369, line: 156, size: 192, align: 64, elements: !386)
!386 = !{!387, !388, !390}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !385, file: !369, line: 157, baseType: !384, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !385, file: !369, line: 158, baseType: !389, size: 64, align: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !385, file: !369, line: 162, baseType: !363, size: 32, align: 32, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !368, file: !369, line: 262, baseType: !389, size: 64, align: 64, offset: 832)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !368, file: !369, line: 264, baseType: !363, size: 32, align: 32, offset: 896)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !368, file: !369, line: 268, baseType: !363, size: 32, align: 32, offset: 928)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !368, file: !369, line: 270, baseType: !395, size: 64, align: 64, offset: 960)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !396, line: 131, baseType: !397)
!396 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!397 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !368, file: !369, line: 274, baseType: !399, size: 16, align: 16, offset: 1024)
!399 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !368, file: !369, line: 275, baseType: !401, size: 8, align: 8, offset: 1040)
!401 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !368, file: !369, line: 276, baseType: !403, size: 8, align: 8, offset: 1048)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 8, align: 8, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 1)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !368, file: !369, line: 280, baseType: !407, size: 64, align: 64, offset: 1088)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !369, line: 150, baseType: null)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !368, file: !369, line: 289, baseType: !410, size: 64, align: 64, offset: 1152)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !396, line: 132, baseType: !397)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !368, file: !369, line: 297, baseType: !340, size: 64, align: 64, offset: 1216)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !368, file: !369, line: 298, baseType: !340, size: 64, align: 64, offset: 1280)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !368, file: !369, line: 299, baseType: !340, size: 64, align: 64, offset: 1344)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !368, file: !369, line: 300, baseType: !340, size: 64, align: 64, offset: 1408)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !368, file: !369, line: 302, baseType: !416, size: 64, align: 64, offset: 1472)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !417, line: 216, baseType: !346)
!417 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !368, file: !369, line: 303, baseType: !363, size: 32, align: 32, offset: 1536)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !368, file: !369, line: 305, baseType: !420, size: 160, align: 8, offset: 1568)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 160, align: 8, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 20)
!423 = !{}
!424 = distinct !DIGlobalVariable(name: "htPtr", scope: !425, file: !426, line: 164, type: !431, isLocal: true, isDefinition: true, variable: %struct.Atomic_uint64* @PosixGetenvHash.htPtr)
!425 = distinct !DISubprogram(name: "PosixGetenvHash", scope: !426, file: !426, line: 161, type: !427, isLocal: true, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!426 = !DIFile(filename: "posixInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!427 = !DISubroutineType(types: !428)
!428 = !{!338, !429, !338}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !339)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_Ptr", file: !432, line: 3829, baseType: !433)
!432 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_atomic.h", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint64", file: !432, line: 139, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint64", file: !432, line: 137, size: 64, align: 64, elements: !435)
!435 = !{!436}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !434, file: !432, line: 138, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !342)
!438 = !{i32 2, !"Dwarf Version", i32 4}
!439 = !{i32 2, !"Debug Info Version", i32 3}
!440 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!441 = distinct !DISubprogram(name: "Posix_Open", scope: !351, file: !351, line: 116, type: !442, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!442 = !DISubroutineType(types: !443)
!443 = !{!363, !429, !363, null}
!444 = !DILocalVariable(name: "pathName", arg: 1, scope: !441, file: !351, line: 116, type: !429)
!445 = !DIExpression()
!446 = !DILocation(line: 116, column: 24, scope: !441)
!447 = !DILocalVariable(name: "flags", arg: 2, scope: !441, file: !351, line: 117, type: !363)
!448 = !DILocation(line: 117, column: 16, scope: !441)
!449 = !DILocalVariable(name: "path", scope: !441, file: !351, line: 120, type: !338)
!450 = !DILocation(line: 120, column: 10, scope: !441)
!451 = !DILocalVariable(name: "mode", scope: !441, file: !351, line: 121, type: !452)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !453, line: 70, baseType: !454)
!453 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !396, line: 129, baseType: !455)
!455 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!456 = !DILocation(line: 121, column: 11, scope: !441)
!457 = !DILocalVariable(name: "fd", scope: !441, file: !351, line: 122, type: !363)
!458 = !DILocation(line: 122, column: 8, scope: !441)
!459 = !DILocation(line: 124, column: 31, scope: !460)
!460 = distinct !DILexicalBlock(scope: !441, file: !351, line: 124, column: 8)
!461 = !DILocation(line: 124, column: 9, scope: !460)
!462 = !DILocation(line: 124, column: 8, scope: !441)
!463 = !DILocation(line: 125, column: 7, scope: !464)
!464 = distinct !DILexicalBlock(scope: !460, file: !351, line: 124, column: 49)
!465 = !DILocation(line: 128, column: 9, scope: !466)
!466 = distinct !DILexicalBlock(scope: !441, file: !351, line: 128, column: 8)
!467 = !DILocation(line: 128, column: 15, scope: !466)
!468 = !DILocation(line: 128, column: 25, scope: !466)
!469 = !DILocation(line: 128, column: 8, scope: !441)
!470 = !DILocalVariable(name: "a", scope: !471, file: !351, line: 129, type: !472)
!471 = distinct !DILexicalBlock(scope: !466, file: !351, line: 128, column: 31)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !367, line: 79, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !474, line: 40, baseType: !475)
!474 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 129, baseType: !476)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 192, align: 64, elements: !404)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 129, size: 192, align: 64, elements: !478)
!478 = !{!479, !480, !481, !482}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !477, file: !1, line: 129, baseType: !455, size: 32, align: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !477, file: !1, line: 129, baseType: !455, size: 32, align: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !477, file: !1, line: 129, baseType: !340, size: 64, align: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !477, file: !1, line: 129, baseType: !340, size: 64, align: 64, offset: 128)
!483 = !DILocation(line: 129, column: 15, scope: !471)
!484 = !DILocation(line: 138, column: 6, scope: !471)
!485 = !DILocation(line: 139, column: 7, scope: !471)
!486 = distinct !{!486, !485}
!487 = !DILocation(line: 139, column: 94, scope: !488)
!488 = !DILexicalBlockFile(scope: !489, file: !351, discriminator: 1)
!489 = distinct !DILexicalBlock(scope: !471, file: !351, line: 139, column: 10)
!490 = !DILocation(line: 140, column: 13, scope: !471)
!491 = !DILocation(line: 140, column: 13, scope: !492)
!492 = !DILexicalBlockFile(scope: !471, file: !351, discriminator: 1)
!493 = !DILocation(line: 140, column: 13, scope: !494)
!494 = !DILexicalBlockFile(scope: !471, file: !351, discriminator: 2)
!495 = !DILocation(line: 140, column: 13, scope: !496)
!496 = !DILexicalBlockFile(scope: !471, file: !351, discriminator: 3)
!497 = !DILocation(line: 140, column: 12, scope: !496)
!498 = !DILocation(line: 141, column: 6, scope: !471)
!499 = !DILocation(line: 142, column: 4, scope: !471)
!500 = !DILocation(line: 144, column: 14, scope: !441)
!501 = !DILocation(line: 144, column: 20, scope: !441)
!502 = !DILocation(line: 144, column: 27, scope: !441)
!503 = !DILocation(line: 144, column: 9, scope: !441)
!504 = !DILocation(line: 144, column: 7, scope: !441)
!505 = !DILocation(line: 146, column: 15, scope: !441)
!506 = !DILocation(line: 146, column: 4, scope: !441)
!507 = !DILocation(line: 148, column: 11, scope: !441)
!508 = !DILocation(line: 148, column: 4, scope: !441)
!509 = !DILocation(line: 149, column: 1, scope: !441)
!510 = distinct !DISubprogram(name: "PosixConvertToCurrent", scope: !426, file: !426, line: 61, type: !511, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!511 = !DISubroutineType(types: !512)
!512 = !{!513, !429, !337}
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !343, line: 230, baseType: !339)
!514 = !DILocalVariable(name: "in", arg: 1, scope: !510, file: !426, line: 61, type: !429)
!515 = !DILocation(line: 61, column: 35, scope: !510)
!516 = !DILocalVariable(name: "out", arg: 2, scope: !510, file: !426, line: 62, type: !337)
!517 = !DILocation(line: 62, column: 30, scope: !510)
!518 = !DILocalVariable(name: "e", scope: !510, file: !426, line: 64, type: !363)
!519 = !DILocation(line: 64, column: 8, scope: !510)
!520 = !DILocation(line: 64, column: 13, scope: !510)
!521 = !DILocation(line: 64, column: 12, scope: !510)
!522 = !DILocalVariable(name: "p", scope: !510, file: !426, line: 65, type: !338)
!523 = !DILocation(line: 65, column: 10, scope: !510)
!524 = !DILocation(line: 65, column: 36, scope: !510)
!525 = !DILocation(line: 65, column: 14, scope: !510)
!526 = !DILocalVariable(name: "success", scope: !510, file: !426, line: 66, type: !513)
!527 = !DILocation(line: 66, column: 9, scope: !510)
!528 = !DILocation(line: 66, column: 19, scope: !510)
!529 = !DILocation(line: 66, column: 21, scope: !510)
!530 = !DILocation(line: 66, column: 28, scope: !510)
!531 = !DILocation(line: 66, column: 31, scope: !532)
!532 = !DILexicalBlockFile(scope: !510, file: !426, discriminator: 1)
!533 = !DILocation(line: 66, column: 34, scope: !532)
!534 = !DILocation(line: 66, column: 28, scope: !532)
!535 = !DILocation(line: 66, column: 28, scope: !536)
!536 = !DILexicalBlockFile(scope: !510, file: !426, discriminator: 2)
!537 = !DILocation(line: 66, column: 19, scope: !536)
!538 = !DILocation(line: 66, column: 9, scope: !536)
!539 = !DILocation(line: 68, column: 8, scope: !540)
!540 = distinct !DILexicalBlock(scope: !510, file: !426, line: 68, column: 8)
!541 = !DILocation(line: 68, column: 8, scope: !510)
!542 = !DILocation(line: 69, column: 14, scope: !543)
!543 = distinct !DILexicalBlock(scope: !540, file: !426, line: 68, column: 17)
!544 = !DILocation(line: 69, column: 8, scope: !543)
!545 = !DILocation(line: 69, column: 12, scope: !543)
!546 = !DILocation(line: 70, column: 14, scope: !543)
!547 = !DILocation(line: 70, column: 8, scope: !543)
!548 = !DILocation(line: 70, column: 12, scope: !543)
!549 = !DILocation(line: 71, column: 4, scope: !543)
!550 = !DILocation(line: 72, column: 8, scope: !551)
!551 = distinct !DILexicalBlock(scope: !540, file: !426, line: 71, column: 11)
!552 = !DILocation(line: 72, column: 12, scope: !551)
!553 = !DILocation(line: 73, column: 8, scope: !551)
!554 = !DILocation(line: 73, column: 12, scope: !551)
!555 = !DILocation(line: 75, column: 11, scope: !510)
!556 = !DILocation(line: 75, column: 4, scope: !510)
!557 = distinct !DISubprogram(name: "Posix_Free", scope: !558, file: !558, line: 129, type: !559, isLocal: true, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!558 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/posix.h", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!559 = !DISubroutineType(types: !560)
!560 = !{null, !340}
!561 = !DILocalVariable(name: "p", arg: 1, scope: !557, file: !558, line: 129, type: !340)
!562 = !DILocation(line: 129, column: 18, scope: !557)
!563 = !DILocalVariable(name: "err", scope: !557, file: !558, line: 131, type: !363)
!564 = !DILocation(line: 131, column: 8, scope: !557)
!565 = !DILocation(line: 131, column: 15, scope: !557)
!566 = !DILocation(line: 131, column: 14, scope: !557)
!567 = !DILocation(line: 132, column: 9, scope: !557)
!568 = !DILocation(line: 132, column: 4, scope: !557)
!569 = !DILocation(line: 133, column: 11, scope: !557)
!570 = !DILocation(line: 133, column: 5, scope: !557)
!571 = !DILocation(line: 133, column: 9, scope: !557)
!572 = !DILocation(line: 134, column: 1, scope: !557)
!573 = distinct !DISubprogram(name: "Posix_Creat", scope: !351, file: !351, line: 170, type: !574, isLocal: false, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!574 = !DISubroutineType(types: !575)
!575 = !{!363, !429, !452}
!576 = !DILocalVariable(name: "pathName", arg: 1, scope: !573, file: !351, line: 170, type: !429)
!577 = !DILocation(line: 170, column: 25, scope: !573)
!578 = !DILocalVariable(name: "mode", arg: 2, scope: !573, file: !351, line: 171, type: !452)
!579 = !DILocation(line: 171, column: 20, scope: !573)
!580 = !DILocation(line: 173, column: 22, scope: !573)
!581 = !DILocation(line: 173, column: 61, scope: !573)
!582 = !DILocation(line: 173, column: 11, scope: !573)
!583 = !DILocation(line: 173, column: 4, scope: !573)
!584 = distinct !DISubprogram(name: "Posix_Fopen", scope: !351, file: !351, line: 194, type: !585, isLocal: false, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!585 = !DISubroutineType(types: !586)
!586 = !{!365, !429, !429}
!587 = !DILocalVariable(name: "pathName", arg: 1, scope: !584, file: !351, line: 194, type: !429)
!588 = !DILocation(line: 194, column: 25, scope: !584)
!589 = !DILocalVariable(name: "mode", arg: 2, scope: !584, file: !351, line: 195, type: !429)
!590 = !DILocation(line: 195, column: 25, scope: !584)
!591 = !DILocalVariable(name: "path", scope: !584, file: !351, line: 197, type: !338)
!592 = !DILocation(line: 197, column: 10, scope: !584)
!593 = !DILocalVariable(name: "stream", scope: !584, file: !351, line: 198, type: !365)
!594 = !DILocation(line: 198, column: 10, scope: !584)
!595 = !DILocation(line: 202, column: 31, scope: !596)
!596 = distinct !DILexicalBlock(scope: !584, file: !351, line: 202, column: 8)
!597 = !DILocation(line: 202, column: 9, scope: !596)
!598 = !DILocation(line: 202, column: 8, scope: !584)
!599 = !DILocation(line: 203, column: 7, scope: !600)
!600 = distinct !DILexicalBlock(scope: !596, file: !351, line: 202, column: 49)
!601 = !DILocation(line: 206, column: 19, scope: !584)
!602 = !DILocation(line: 206, column: 25, scope: !584)
!603 = !DILocation(line: 206, column: 13, scope: !584)
!604 = !DILocation(line: 206, column: 11, scope: !584)
!605 = !DILocation(line: 208, column: 15, scope: !584)
!606 = !DILocation(line: 208, column: 4, scope: !584)
!607 = !DILocation(line: 210, column: 11, scope: !584)
!608 = !DILocation(line: 210, column: 4, scope: !584)
!609 = !DILocation(line: 211, column: 1, scope: !584)
!610 = distinct !DISubprogram(name: "Posix_Stat", scope: !351, file: !351, line: 232, type: !611, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!611 = !DISubroutineType(types: !612)
!612 = !{!363, !429, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64, align: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !615, line: 46, size: 1152, align: 64, elements: !616)
!615 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!616 = !{!617, !619, !621, !623, !624, !626, !628, !629, !630, !631, !633, !635, !643, !644, !645}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !614, file: !615, line: 48, baseType: !618, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !396, line: 124, baseType: !346)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !614, file: !615, line: 53, baseType: !620, size: 64, align: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !396, line: 127, baseType: !346)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !614, file: !615, line: 61, baseType: !622, size: 64, align: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !396, line: 130, baseType: !346)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !614, file: !615, line: 62, baseType: !454, size: 32, align: 32, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !614, file: !615, line: 64, baseType: !625, size: 32, align: 32, offset: 224)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !396, line: 125, baseType: !455)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !614, file: !615, line: 65, baseType: !627, size: 32, align: 32, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !396, line: 126, baseType: !455)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !614, file: !615, line: 67, baseType: !363, size: 32, align: 32, offset: 288)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !614, file: !615, line: 69, baseType: !618, size: 64, align: 64, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !614, file: !615, line: 74, baseType: !395, size: 64, align: 64, offset: 384)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !614, file: !615, line: 78, baseType: !632, size: 64, align: 64, offset: 448)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !396, line: 153, baseType: !397)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !614, file: !615, line: 80, baseType: !634, size: 64, align: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !396, line: 158, baseType: !397)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !614, file: !615, line: 91, baseType: !636, size: 128, align: 64, offset: 576)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !637, line: 120, size: 128, align: 64, elements: !638)
!637 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!638 = !{!639, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !636, file: !637, line: 122, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !396, line: 139, baseType: !397)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !636, file: !637, line: 123, baseType: !642, size: 64, align: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !396, line: 175, baseType: !397)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !614, file: !615, line: 92, baseType: !636, size: 128, align: 64, offset: 704)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !614, file: !615, line: 93, baseType: !636, size: 128, align: 64, offset: 832)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !614, file: !615, line: 106, baseType: !646, size: 192, align: 64, offset: 960)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !642, size: 192, align: 64, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 3)
!649 = !DILocalVariable(name: "pathName", arg: 1, scope: !610, file: !351, line: 232, type: !429)
!650 = !DILocation(line: 232, column: 24, scope: !610)
!651 = !DILocalVariable(name: "statbuf", arg: 2, scope: !610, file: !351, line: 233, type: !613)
!652 = !DILocation(line: 233, column: 25, scope: !610)
!653 = !DILocalVariable(name: "path", scope: !610, file: !351, line: 235, type: !338)
!654 = !DILocation(line: 235, column: 10, scope: !610)
!655 = !DILocalVariable(name: "ret", scope: !610, file: !351, line: 236, type: !363)
!656 = !DILocation(line: 236, column: 8, scope: !610)
!657 = !DILocation(line: 238, column: 31, scope: !658)
!658 = distinct !DILexicalBlock(scope: !610, file: !351, line: 238, column: 8)
!659 = !DILocation(line: 238, column: 9, scope: !658)
!660 = !DILocation(line: 238, column: 8, scope: !610)
!661 = !DILocation(line: 239, column: 7, scope: !662)
!662 = distinct !DILexicalBlock(scope: !658, file: !351, line: 238, column: 49)
!663 = !DILocation(line: 242, column: 15, scope: !610)
!664 = !DILocation(line: 242, column: 21, scope: !610)
!665 = !DILocation(line: 242, column: 10, scope: !610)
!666 = !DILocation(line: 242, column: 8, scope: !610)
!667 = !DILocation(line: 244, column: 15, scope: !610)
!668 = !DILocation(line: 244, column: 4, scope: !610)
!669 = !DILocation(line: 246, column: 11, scope: !610)
!670 = !DILocation(line: 246, column: 4, scope: !610)
!671 = !DILocation(line: 247, column: 1, scope: !610)
!672 = distinct !DISubprogram(name: "Posix_Chmod", scope: !351, file: !351, line: 268, type: !574, isLocal: false, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!673 = !DILocalVariable(name: "pathName", arg: 1, scope: !672, file: !351, line: 268, type: !429)
!674 = !DILocation(line: 268, column: 25, scope: !672)
!675 = !DILocalVariable(name: "mode", arg: 2, scope: !672, file: !351, line: 269, type: !452)
!676 = !DILocation(line: 269, column: 20, scope: !672)
!677 = !DILocalVariable(name: "path", scope: !672, file: !351, line: 271, type: !338)
!678 = !DILocation(line: 271, column: 10, scope: !672)
!679 = !DILocalVariable(name: "ret", scope: !672, file: !351, line: 272, type: !363)
!680 = !DILocation(line: 272, column: 8, scope: !672)
!681 = !DILocation(line: 274, column: 31, scope: !682)
!682 = distinct !DILexicalBlock(scope: !672, file: !351, line: 274, column: 8)
!683 = !DILocation(line: 274, column: 9, scope: !682)
!684 = !DILocation(line: 274, column: 8, scope: !672)
!685 = !DILocation(line: 275, column: 7, scope: !686)
!686 = distinct !DILexicalBlock(scope: !682, file: !351, line: 274, column: 49)
!687 = !DILocation(line: 278, column: 16, scope: !672)
!688 = !DILocation(line: 278, column: 22, scope: !672)
!689 = !DILocation(line: 278, column: 10, scope: !672)
!690 = !DILocation(line: 278, column: 8, scope: !672)
!691 = !DILocation(line: 280, column: 15, scope: !672)
!692 = !DILocation(line: 280, column: 4, scope: !672)
!693 = !DILocation(line: 281, column: 11, scope: !672)
!694 = !DILocation(line: 281, column: 4, scope: !672)
!695 = !DILocation(line: 282, column: 1, scope: !672)
!696 = distinct !DISubprogram(name: "Posix_Rename", scope: !351, file: !351, line: 303, type: !697, isLocal: false, isDefinition: true, scopeLine: 305, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!697 = !DISubroutineType(types: !698)
!698 = !{!363, !429, !429}
!699 = !DILocalVariable(name: "fromPathName", arg: 1, scope: !696, file: !351, line: 303, type: !429)
!700 = !DILocation(line: 303, column: 26, scope: !696)
!701 = !DILocalVariable(name: "toPathName", arg: 2, scope: !696, file: !351, line: 304, type: !429)
!702 = !DILocation(line: 304, column: 26, scope: !696)
!703 = !DILocalVariable(name: "toPath", scope: !696, file: !351, line: 306, type: !338)
!704 = !DILocation(line: 306, column: 10, scope: !696)
!705 = !DILocalVariable(name: "fromPath", scope: !696, file: !351, line: 307, type: !338)
!706 = !DILocation(line: 307, column: 10, scope: !696)
!707 = !DILocalVariable(name: "result", scope: !696, file: !351, line: 308, type: !363)
!708 = !DILocation(line: 308, column: 8, scope: !696)
!709 = !DILocation(line: 310, column: 31, scope: !710)
!710 = distinct !DILexicalBlock(scope: !696, file: !351, line: 310, column: 8)
!711 = !DILocation(line: 310, column: 9, scope: !710)
!712 = !DILocation(line: 310, column: 8, scope: !696)
!713 = !DILocation(line: 311, column: 7, scope: !714)
!714 = distinct !DILexicalBlock(scope: !710, file: !351, line: 310, column: 57)
!715 = !DILocation(line: 313, column: 31, scope: !716)
!716 = distinct !DILexicalBlock(scope: !696, file: !351, line: 313, column: 8)
!717 = !DILocation(line: 313, column: 9, scope: !716)
!718 = !DILocation(line: 313, column: 8, scope: !696)
!719 = !DILocation(line: 314, column: 18, scope: !720)
!720 = distinct !DILexicalBlock(scope: !716, file: !351, line: 313, column: 53)
!721 = !DILocation(line: 314, column: 7, scope: !720)
!722 = !DILocation(line: 315, column: 7, scope: !720)
!723 = !DILocation(line: 318, column: 20, scope: !696)
!724 = !DILocation(line: 318, column: 30, scope: !696)
!725 = !DILocation(line: 318, column: 13, scope: !696)
!726 = !DILocation(line: 318, column: 11, scope: !696)
!727 = !DILocation(line: 320, column: 15, scope: !696)
!728 = !DILocation(line: 320, column: 4, scope: !696)
!729 = !DILocation(line: 321, column: 15, scope: !696)
!730 = !DILocation(line: 321, column: 4, scope: !696)
!731 = !DILocation(line: 322, column: 11, scope: !696)
!732 = !DILocation(line: 322, column: 4, scope: !696)
!733 = !DILocation(line: 323, column: 1, scope: !696)
!734 = distinct !DISubprogram(name: "Posix_Unlink", scope: !351, file: !351, line: 344, type: !735, isLocal: false, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!735 = !DISubroutineType(types: !736)
!736 = !{!363, !429}
!737 = !DILocalVariable(name: "pathName", arg: 1, scope: !734, file: !351, line: 344, type: !429)
!738 = !DILocation(line: 344, column: 26, scope: !734)
!739 = !DILocalVariable(name: "path", scope: !734, file: !351, line: 346, type: !338)
!740 = !DILocation(line: 346, column: 10, scope: !734)
!741 = !DILocalVariable(name: "ret", scope: !734, file: !351, line: 347, type: !363)
!742 = !DILocation(line: 347, column: 8, scope: !734)
!743 = !DILocation(line: 349, column: 31, scope: !744)
!744 = distinct !DILexicalBlock(scope: !734, file: !351, line: 349, column: 8)
!745 = !DILocation(line: 349, column: 9, scope: !744)
!746 = !DILocation(line: 349, column: 8, scope: !734)
!747 = !DILocation(line: 350, column: 7, scope: !748)
!748 = distinct !DILexicalBlock(scope: !744, file: !351, line: 349, column: 49)
!749 = !DILocation(line: 353, column: 17, scope: !734)
!750 = !DILocation(line: 353, column: 10, scope: !734)
!751 = !DILocation(line: 353, column: 8, scope: !734)
!752 = !DILocation(line: 355, column: 15, scope: !734)
!753 = !DILocation(line: 355, column: 4, scope: !734)
!754 = !DILocation(line: 356, column: 11, scope: !734)
!755 = !DILocation(line: 356, column: 4, scope: !734)
!756 = !DILocation(line: 357, column: 1, scope: !734)
!757 = distinct !DISubprogram(name: "Posix_Rmdir", scope: !351, file: !351, line: 378, type: !735, isLocal: false, isDefinition: true, scopeLine: 379, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!758 = !DILocalVariable(name: "pathName", arg: 1, scope: !757, file: !351, line: 378, type: !429)
!759 = !DILocation(line: 378, column: 25, scope: !757)
!760 = !DILocalVariable(name: "path", scope: !757, file: !351, line: 380, type: !338)
!761 = !DILocation(line: 380, column: 10, scope: !757)
!762 = !DILocalVariable(name: "ret", scope: !757, file: !351, line: 381, type: !363)
!763 = !DILocation(line: 381, column: 8, scope: !757)
!764 = !DILocation(line: 383, column: 31, scope: !765)
!765 = distinct !DILexicalBlock(scope: !757, file: !351, line: 383, column: 8)
!766 = !DILocation(line: 383, column: 9, scope: !765)
!767 = !DILocation(line: 383, column: 8, scope: !757)
!768 = !DILocation(line: 384, column: 7, scope: !769)
!769 = distinct !DILexicalBlock(scope: !765, file: !351, line: 383, column: 49)
!770 = !DILocation(line: 387, column: 16, scope: !757)
!771 = !DILocation(line: 387, column: 10, scope: !757)
!772 = !DILocation(line: 387, column: 8, scope: !757)
!773 = !DILocation(line: 389, column: 15, scope: !757)
!774 = !DILocation(line: 389, column: 4, scope: !757)
!775 = !DILocation(line: 391, column: 11, scope: !757)
!776 = !DILocation(line: 391, column: 4, scope: !757)
!777 = !DILocation(line: 392, column: 1, scope: !757)
!778 = distinct !DISubprogram(name: "Posix_Freopen", scope: !351, file: !351, line: 413, type: !779, isLocal: false, isDefinition: true, scopeLine: 416, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!779 = !DISubroutineType(types: !780)
!780 = !{!365, !429, !429, !365}
!781 = !DILocalVariable(name: "pathName", arg: 1, scope: !778, file: !351, line: 413, type: !429)
!782 = !DILocation(line: 413, column: 27, scope: !778)
!783 = !DILocalVariable(name: "mode", arg: 2, scope: !778, file: !351, line: 414, type: !429)
!784 = !DILocation(line: 414, column: 27, scope: !778)
!785 = !DILocalVariable(name: "input_stream", arg: 3, scope: !778, file: !351, line: 415, type: !365)
!786 = !DILocation(line: 415, column: 21, scope: !778)
!787 = !DILocalVariable(name: "path", scope: !778, file: !351, line: 417, type: !338)
!788 = !DILocation(line: 417, column: 10, scope: !778)
!789 = !DILocalVariable(name: "stream", scope: !778, file: !351, line: 418, type: !365)
!790 = !DILocation(line: 418, column: 10, scope: !778)
!791 = !DILocation(line: 422, column: 31, scope: !792)
!792 = distinct !DILexicalBlock(scope: !778, file: !351, line: 422, column: 8)
!793 = !DILocation(line: 422, column: 9, scope: !792)
!794 = !DILocation(line: 422, column: 8, scope: !778)
!795 = !DILocation(line: 423, column: 7, scope: !796)
!796 = distinct !DILexicalBlock(scope: !792, file: !351, line: 422, column: 49)
!797 = !DILocation(line: 426, column: 21, scope: !778)
!798 = !DILocation(line: 426, column: 27, scope: !778)
!799 = !DILocation(line: 426, column: 33, scope: !778)
!800 = !DILocation(line: 426, column: 13, scope: !778)
!801 = !DILocation(line: 426, column: 11, scope: !778)
!802 = !DILocation(line: 428, column: 15, scope: !778)
!803 = !DILocation(line: 428, column: 4, scope: !778)
!804 = !DILocation(line: 429, column: 11, scope: !778)
!805 = !DILocation(line: 429, column: 4, scope: !778)
!806 = !DILocation(line: 430, column: 1, scope: !778)
!807 = distinct !DISubprogram(name: "Posix_Access", scope: !351, file: !351, line: 451, type: !808, isLocal: false, isDefinition: true, scopeLine: 453, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!808 = !DISubroutineType(types: !809)
!809 = !{!363, !429, !363}
!810 = !DILocalVariable(name: "pathName", arg: 1, scope: !807, file: !351, line: 451, type: !429)
!811 = !DILocation(line: 451, column: 26, scope: !807)
!812 = !DILocalVariable(name: "mode", arg: 2, scope: !807, file: !351, line: 452, type: !363)
!813 = !DILocation(line: 452, column: 18, scope: !807)
!814 = !DILocalVariable(name: "path", scope: !807, file: !351, line: 454, type: !338)
!815 = !DILocation(line: 454, column: 10, scope: !807)
!816 = !DILocalVariable(name: "ret", scope: !807, file: !351, line: 455, type: !363)
!817 = !DILocation(line: 455, column: 8, scope: !807)
!818 = !DILocation(line: 457, column: 31, scope: !819)
!819 = distinct !DILexicalBlock(scope: !807, file: !351, line: 457, column: 8)
!820 = !DILocation(line: 457, column: 9, scope: !819)
!821 = !DILocation(line: 457, column: 8, scope: !807)
!822 = !DILocation(line: 458, column: 7, scope: !823)
!823 = distinct !DILexicalBlock(scope: !819, file: !351, line: 457, column: 49)
!824 = !DILocation(line: 472, column: 17, scope: !807)
!825 = !DILocation(line: 472, column: 23, scope: !807)
!826 = !DILocation(line: 472, column: 10, scope: !807)
!827 = !DILocation(line: 472, column: 8, scope: !807)
!828 = !DILocation(line: 475, column: 15, scope: !807)
!829 = !DILocation(line: 475, column: 4, scope: !807)
!830 = !DILocation(line: 477, column: 11, scope: !807)
!831 = !DILocation(line: 477, column: 4, scope: !807)
!832 = !DILocation(line: 478, column: 1, scope: !807)
!833 = distinct !DISubprogram(name: "Posix_EuidAccess", scope: !351, file: !351, line: 499, type: !808, isLocal: false, isDefinition: true, scopeLine: 501, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!834 = !DILocalVariable(name: "pathName", arg: 1, scope: !833, file: !351, line: 499, type: !429)
!835 = !DILocation(line: 499, column: 30, scope: !833)
!836 = !DILocalVariable(name: "mode", arg: 2, scope: !833, file: !351, line: 500, type: !363)
!837 = !DILocation(line: 500, column: 22, scope: !833)
!838 = !DILocalVariable(name: "path", scope: !833, file: !351, line: 503, type: !338)
!839 = !DILocation(line: 503, column: 10, scope: !833)
!840 = !DILocalVariable(name: "ret", scope: !833, file: !351, line: 504, type: !363)
!841 = !DILocation(line: 504, column: 8, scope: !833)
!842 = !DILocation(line: 506, column: 31, scope: !843)
!843 = distinct !DILexicalBlock(scope: !833, file: !351, line: 506, column: 8)
!844 = !DILocation(line: 506, column: 9, scope: !843)
!845 = !DILocation(line: 506, column: 8, scope: !833)
!846 = !DILocation(line: 507, column: 7, scope: !847)
!847 = distinct !DILexicalBlock(scope: !843, file: !351, line: 506, column: 49)
!848 = !DILocation(line: 510, column: 21, scope: !833)
!849 = !DILocation(line: 510, column: 27, scope: !833)
!850 = !DILocation(line: 510, column: 10, scope: !833)
!851 = !DILocation(line: 510, column: 8, scope: !833)
!852 = !DILocation(line: 512, column: 15, scope: !833)
!853 = !DILocation(line: 512, column: 4, scope: !833)
!854 = !DILocation(line: 513, column: 11, scope: !833)
!855 = !DILocation(line: 513, column: 4, scope: !833)
!856 = !DILocation(line: 518, column: 1, scope: !833)
!857 = distinct !DISubprogram(name: "Posix_Utime", scope: !351, file: !351, line: 539, type: !858, isLocal: false, isDefinition: true, scopeLine: 541, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!858 = !DISubroutineType(types: !859)
!859 = !{!363, !429, !860}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64, align: 64)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utimbuf", file: !863, line: 37, size: 128, align: 64, elements: !864)
!863 = !DIFile(filename: "/usr/include/utime.h", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "actime", scope: !862, file: !863, line: 39, baseType: !640, size: 64, align: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "modtime", scope: !862, file: !863, line: 40, baseType: !640, size: 64, align: 64, offset: 64)
!867 = !DILocalVariable(name: "pathName", arg: 1, scope: !857, file: !351, line: 539, type: !429)
!868 = !DILocation(line: 539, column: 25, scope: !857)
!869 = !DILocalVariable(name: "times", arg: 2, scope: !857, file: !351, line: 540, type: !860)
!870 = !DILocation(line: 540, column: 35, scope: !857)
!871 = !DILocalVariable(name: "path", scope: !857, file: !351, line: 542, type: !338)
!872 = !DILocation(line: 542, column: 10, scope: !857)
!873 = !DILocalVariable(name: "ret", scope: !857, file: !351, line: 543, type: !363)
!874 = !DILocation(line: 543, column: 8, scope: !857)
!875 = !DILocation(line: 545, column: 31, scope: !876)
!876 = distinct !DILexicalBlock(scope: !857, file: !351, line: 545, column: 8)
!877 = !DILocation(line: 545, column: 9, scope: !876)
!878 = !DILocation(line: 545, column: 8, scope: !857)
!879 = !DILocation(line: 546, column: 7, scope: !880)
!880 = distinct !DILexicalBlock(scope: !876, file: !351, line: 545, column: 49)
!881 = !DILocation(line: 549, column: 16, scope: !857)
!882 = !DILocation(line: 549, column: 22, scope: !857)
!883 = !DILocation(line: 549, column: 10, scope: !857)
!884 = !DILocation(line: 549, column: 8, scope: !857)
!885 = !DILocation(line: 551, column: 15, scope: !857)
!886 = !DILocation(line: 551, column: 4, scope: !857)
!887 = !DILocation(line: 553, column: 11, scope: !857)
!888 = !DILocation(line: 553, column: 4, scope: !857)
!889 = !DILocation(line: 554, column: 1, scope: !857)
!890 = distinct !DISubprogram(name: "Posix_Perror", scope: !351, file: !351, line: 575, type: !891, isLocal: false, isDefinition: true, scopeLine: 576, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!891 = !DISubroutineType(types: !892)
!892 = !{null, !429}
!893 = !DILocalVariable(name: "str", arg: 1, scope: !890, file: !351, line: 575, type: !429)
!894 = !DILocation(line: 575, column: 26, scope: !890)
!895 = !DILocalVariable(name: "tmpstr", scope: !890, file: !351, line: 577, type: !338)
!896 = !DILocation(line: 577, column: 10, scope: !890)
!897 = !DILocation(line: 577, column: 41, scope: !890)
!898 = !DILocation(line: 577, column: 19, scope: !890)
!899 = !DILocation(line: 580, column: 11, scope: !890)
!900 = !DILocation(line: 580, column: 4, scope: !890)
!901 = !DILocation(line: 582, column: 15, scope: !890)
!902 = !DILocation(line: 582, column: 4, scope: !890)
!903 = !DILocation(line: 583, column: 1, scope: !890)
!904 = distinct !DISubprogram(name: "Posix_Pathconf", scope: !351, file: !351, line: 603, type: !905, isLocal: false, isDefinition: true, scopeLine: 605, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!905 = !DISubroutineType(types: !906)
!906 = !{!397, !429, !363}
!907 = !DILocalVariable(name: "pathName", arg: 1, scope: !904, file: !351, line: 603, type: !429)
!908 = !DILocation(line: 603, column: 28, scope: !904)
!909 = !DILocalVariable(name: "name", arg: 2, scope: !904, file: !351, line: 604, type: !363)
!910 = !DILocation(line: 604, column: 20, scope: !904)
!911 = !DILocalVariable(name: "path", scope: !904, file: !351, line: 606, type: !338)
!912 = !DILocation(line: 606, column: 10, scope: !904)
!913 = !DILocalVariable(name: "ret", scope: !904, file: !351, line: 607, type: !397)
!914 = !DILocation(line: 607, column: 9, scope: !904)
!915 = !DILocation(line: 609, column: 31, scope: !916)
!916 = distinct !DILexicalBlock(scope: !904, file: !351, line: 609, column: 8)
!917 = !DILocation(line: 609, column: 9, scope: !916)
!918 = !DILocation(line: 609, column: 8, scope: !904)
!919 = !DILocation(line: 610, column: 7, scope: !920)
!920 = distinct !DILexicalBlock(scope: !916, file: !351, line: 609, column: 49)
!921 = !DILocation(line: 613, column: 19, scope: !904)
!922 = !DILocation(line: 613, column: 25, scope: !904)
!923 = !DILocation(line: 613, column: 10, scope: !904)
!924 = !DILocation(line: 613, column: 8, scope: !904)
!925 = !DILocation(line: 615, column: 15, scope: !904)
!926 = !DILocation(line: 615, column: 4, scope: !904)
!927 = !DILocation(line: 617, column: 11, scope: !904)
!928 = !DILocation(line: 617, column: 4, scope: !904)
!929 = !DILocation(line: 618, column: 1, scope: !904)
!930 = distinct !DISubprogram(name: "Posix_Popen", scope: !351, file: !351, line: 638, type: !585, isLocal: false, isDefinition: true, scopeLine: 640, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!931 = !DILocalVariable(name: "pathName", arg: 1, scope: !930, file: !351, line: 638, type: !429)
!932 = !DILocation(line: 638, column: 25, scope: !930)
!933 = !DILocalVariable(name: "mode", arg: 2, scope: !930, file: !351, line: 639, type: !429)
!934 = !DILocation(line: 639, column: 25, scope: !930)
!935 = !DILocalVariable(name: "path", scope: !930, file: !351, line: 641, type: !338)
!936 = !DILocation(line: 641, column: 10, scope: !930)
!937 = !DILocalVariable(name: "stream", scope: !930, file: !351, line: 642, type: !365)
!938 = !DILocation(line: 642, column: 10, scope: !930)
!939 = !DILocation(line: 646, column: 31, scope: !940)
!940 = distinct !DILexicalBlock(scope: !930, file: !351, line: 646, column: 8)
!941 = !DILocation(line: 646, column: 9, scope: !940)
!942 = !DILocation(line: 646, column: 8, scope: !930)
!943 = !DILocation(line: 647, column: 7, scope: !944)
!944 = distinct !DILexicalBlock(scope: !940, file: !351, line: 646, column: 49)
!945 = !DILocation(line: 650, column: 19, scope: !930)
!946 = !DILocation(line: 650, column: 25, scope: !930)
!947 = !DILocation(line: 650, column: 13, scope: !930)
!948 = !DILocation(line: 650, column: 11, scope: !930)
!949 = !DILocation(line: 652, column: 15, scope: !930)
!950 = !DILocation(line: 652, column: 4, scope: !930)
!951 = !DILocation(line: 654, column: 11, scope: !930)
!952 = !DILocation(line: 654, column: 4, scope: !930)
!953 = !DILocation(line: 655, column: 1, scope: !930)
!954 = distinct !DISubprogram(name: "Posix_Mknod", scope: !351, file: !351, line: 676, type: !955, isLocal: false, isDefinition: true, scopeLine: 679, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!955 = !DISubroutineType(types: !956)
!956 = !{!363, !429, !452, !957}
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !453, line: 60, baseType: !618)
!958 = !DILocalVariable(name: "pathName", arg: 1, scope: !954, file: !351, line: 676, type: !429)
!959 = !DILocation(line: 676, column: 25, scope: !954)
!960 = !DILocalVariable(name: "mode", arg: 2, scope: !954, file: !351, line: 677, type: !452)
!961 = !DILocation(line: 677, column: 20, scope: !954)
!962 = !DILocalVariable(name: "dev", arg: 3, scope: !954, file: !351, line: 678, type: !957)
!963 = !DILocation(line: 678, column: 19, scope: !954)
!964 = !DILocalVariable(name: "path", scope: !954, file: !351, line: 680, type: !338)
!965 = !DILocation(line: 680, column: 10, scope: !954)
!966 = !DILocalVariable(name: "ret", scope: !954, file: !351, line: 681, type: !363)
!967 = !DILocation(line: 681, column: 8, scope: !954)
!968 = !DILocation(line: 683, column: 31, scope: !969)
!969 = distinct !DILexicalBlock(scope: !954, file: !351, line: 683, column: 8)
!970 = !DILocation(line: 683, column: 9, scope: !969)
!971 = !DILocation(line: 683, column: 8, scope: !954)
!972 = !DILocation(line: 684, column: 7, scope: !973)
!973 = distinct !DILexicalBlock(scope: !969, file: !351, line: 683, column: 49)
!974 = !DILocation(line: 687, column: 16, scope: !954)
!975 = !DILocation(line: 687, column: 22, scope: !954)
!976 = !DILocation(line: 687, column: 28, scope: !954)
!977 = !DILocation(line: 687, column: 10, scope: !954)
!978 = !DILocation(line: 687, column: 8, scope: !954)
!979 = !DILocation(line: 689, column: 15, scope: !954)
!980 = !DILocation(line: 689, column: 4, scope: !954)
!981 = !DILocation(line: 691, column: 11, scope: !954)
!982 = !DILocation(line: 691, column: 4, scope: !954)
!983 = !DILocation(line: 692, column: 1, scope: !954)
!984 = distinct !DISubprogram(name: "Posix_Chown", scope: !351, file: !351, line: 713, type: !985, isLocal: false, isDefinition: true, scopeLine: 716, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!985 = !DISubroutineType(types: !986)
!986 = !{!363, !429, !987, !988}
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !453, line: 80, baseType: !625)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !453, line: 65, baseType: !627)
!989 = !DILocalVariable(name: "pathName", arg: 1, scope: !984, file: !351, line: 713, type: !429)
!990 = !DILocation(line: 713, column: 25, scope: !984)
!991 = !DILocalVariable(name: "owner", arg: 2, scope: !984, file: !351, line: 714, type: !987)
!992 = !DILocation(line: 714, column: 19, scope: !984)
!993 = !DILocalVariable(name: "group", arg: 3, scope: !984, file: !351, line: 715, type: !988)
!994 = !DILocation(line: 715, column: 19, scope: !984)
!995 = !DILocalVariable(name: "path", scope: !984, file: !351, line: 717, type: !338)
!996 = !DILocation(line: 717, column: 10, scope: !984)
!997 = !DILocalVariable(name: "ret", scope: !984, file: !351, line: 718, type: !363)
!998 = !DILocation(line: 718, column: 8, scope: !984)
!999 = !DILocation(line: 720, column: 31, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !984, file: !351, line: 720, column: 8)
!1001 = !DILocation(line: 720, column: 9, scope: !1000)
!1002 = !DILocation(line: 720, column: 8, scope: !984)
!1003 = !DILocation(line: 721, column: 7, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !1000, file: !351, line: 720, column: 49)
!1005 = !DILocation(line: 724, column: 16, scope: !984)
!1006 = !DILocation(line: 724, column: 22, scope: !984)
!1007 = !DILocation(line: 724, column: 29, scope: !984)
!1008 = !DILocation(line: 724, column: 10, scope: !984)
!1009 = !DILocation(line: 724, column: 8, scope: !984)
!1010 = !DILocation(line: 726, column: 15, scope: !984)
!1011 = !DILocation(line: 726, column: 4, scope: !984)
!1012 = !DILocation(line: 728, column: 11, scope: !984)
!1013 = !DILocation(line: 728, column: 4, scope: !984)
!1014 = !DILocation(line: 729, column: 1, scope: !984)
!1015 = distinct !DISubprogram(name: "Posix_Lchown", scope: !351, file: !351, line: 750, type: !985, isLocal: false, isDefinition: true, scopeLine: 753, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!1016 = !DILocalVariable(name: "pathName", arg: 1, scope: !1015, file: !351, line: 750, type: !429)
!1017 = !DILocation(line: 750, column: 26, scope: !1015)
!1018 = !DILocalVariable(name: "owner", arg: 2, scope: !1015, file: !351, line: 751, type: !987)
!1019 = !DILocation(line: 751, column: 20, scope: !1015)
!1020 = !DILocalVariable(name: "group", arg: 3, scope: !1015, file: !351, line: 752, type: !988)
!1021 = !DILocation(line: 752, column: 20, scope: !1015)
!1022 = !DILocalVariable(name: "path", scope: !1015, file: !351, line: 754, type: !338)
!1023 = !DILocation(line: 754, column: 10, scope: !1015)
!1024 = !DILocalVariable(name: "ret", scope: !1015, file: !351, line: 755, type: !363)
!1025 = !DILocation(line: 755, column: 8, scope: !1015)
!1026 = !DILocation(line: 757, column: 31, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1015, file: !351, line: 757, column: 8)
!1028 = !DILocation(line: 757, column: 9, scope: !1027)
!1029 = !DILocation(line: 757, column: 8, scope: !1015)
!1030 = !DILocation(line: 758, column: 7, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1027, file: !351, line: 757, column: 49)
!1032 = !DILocation(line: 761, column: 17, scope: !1015)
!1033 = !DILocation(line: 761, column: 23, scope: !1015)
!1034 = !DILocation(line: 761, column: 30, scope: !1015)
!1035 = !DILocation(line: 761, column: 10, scope: !1015)
!1036 = !DILocation(line: 761, column: 8, scope: !1015)
!1037 = !DILocation(line: 763, column: 15, scope: !1015)
!1038 = !DILocation(line: 763, column: 4, scope: !1015)
!1039 = !DILocation(line: 765, column: 11, scope: !1015)
!1040 = !DILocation(line: 765, column: 4, scope: !1015)
!1041 = !DILocation(line: 766, column: 1, scope: !1015)
!1042 = distinct !DISubprogram(name: "Posix_Link", scope: !351, file: !351, line: 787, type: !697, isLocal: false, isDefinition: true, scopeLine: 789, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!1043 = !DILocalVariable(name: "uOldPath", arg: 1, scope: !1042, file: !351, line: 787, type: !429)
!1044 = !DILocation(line: 787, column: 24, scope: !1042)
!1045 = !DILocalVariable(name: "uNewPath", arg: 2, scope: !1042, file: !351, line: 788, type: !429)
!1046 = !DILocation(line: 788, column: 24, scope: !1042)
!1047 = !DILocalVariable(name: "oldPath", scope: !1042, file: !351, line: 790, type: !338)
!1048 = !DILocation(line: 790, column: 10, scope: !1042)
!1049 = !DILocalVariable(name: "newPath", scope: !1042, file: !351, line: 791, type: !338)
!1050 = !DILocation(line: 791, column: 10, scope: !1042)
!1051 = !DILocalVariable(name: "ret", scope: !1042, file: !351, line: 792, type: !363)
!1052 = !DILocation(line: 792, column: 8, scope: !1042)
!1053 = !DILocation(line: 794, column: 31, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1042, file: !351, line: 794, column: 8)
!1055 = !DILocation(line: 794, column: 9, scope: !1054)
!1056 = !DILocation(line: 794, column: 8, scope: !1042)
!1057 = !DILocation(line: 795, column: 7, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1054, file: !351, line: 794, column: 52)
!1059 = !DILocation(line: 797, column: 31, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1042, file: !351, line: 797, column: 8)
!1061 = !DILocation(line: 797, column: 9, scope: !1060)
!1062 = !DILocation(line: 797, column: 8, scope: !1042)
!1063 = !DILocation(line: 798, column: 18, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1060, file: !351, line: 797, column: 52)
!1065 = !DILocation(line: 798, column: 7, scope: !1064)
!1066 = !DILocation(line: 799, column: 7, scope: !1064)
!1067 = !DILocation(line: 802, column: 15, scope: !1042)
!1068 = !DILocation(line: 802, column: 24, scope: !1042)
!1069 = !DILocation(line: 802, column: 10, scope: !1042)
!1070 = !DILocation(line: 802, column: 8, scope: !1042)
!1071 = !DILocation(line: 804, column: 15, scope: !1042)
!1072 = !DILocation(line: 804, column: 4, scope: !1042)
!1073 = !DILocation(line: 805, column: 15, scope: !1042)
!1074 = !DILocation(line: 805, column: 4, scope: !1042)
!1075 = !DILocation(line: 807, column: 11, scope: !1042)
!1076 = !DILocation(line: 807, column: 4, scope: !1042)
!1077 = !DILocation(line: 808, column: 1, scope: !1042)
!1078 = distinct !DISubprogram(name: "Posix_Symlink", scope: !351, file: !351, line: 829, type: !697, isLocal: false, isDefinition: true, scopeLine: 831, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!1079 = !DILocalVariable(name: "uOldPath", arg: 1, scope: !1078, file: !351, line: 829, type: !429)
!1080 = !DILocation(line: 829, column: 27, scope: !1078)
!1081 = !DILocalVariable(name: "uNewPath", arg: 2, scope: !1078, file: !351, line: 830, type: !429)
!1082 = !DILocation(line: 830, column: 27, scope: !1078)
!1083 = !DILocalVariable(name: "oldPath", scope: !1078, file: !351, line: 832, type: !338)
!1084 = !DILocation(line: 832, column: 10, scope: !1078)
!1085 = !DILocalVariable(name: "newPath", scope: !1078, file: !351, line: 833, type: !338)
!1086 = !DILocation(line: 833, column: 10, scope: !1078)
!1087 = !DILocalVariable(name: "ret", scope: !1078, file: !351, line: 834, type: !363)
!1088 = !DILocation(line: 834, column: 8, scope: !1078)
!1089 = !DILocation(line: 836, column: 31, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1078, file: !351, line: 836, column: 8)
!1091 = !DILocation(line: 836, column: 9, scope: !1090)
!1092 = !DILocation(line: 836, column: 8, scope: !1078)
!1093 = !DILocation(line: 837, column: 7, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1090, file: !351, line: 836, column: 52)
!1095 = !DILocation(line: 839, column: 31, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1078, file: !351, line: 839, column: 8)
!1097 = !DILocation(line: 839, column: 9, scope: !1096)
!1098 = !DILocation(line: 839, column: 8, scope: !1078)
!1099 = !DILocation(line: 840, column: 18, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1096, file: !351, line: 839, column: 52)
!1101 = !DILocation(line: 840, column: 7, scope: !1100)
!1102 = !DILocation(line: 841, column: 7, scope: !1100)
!1103 = !DILocation(line: 844, column: 18, scope: !1078)
!1104 = !DILocation(line: 844, column: 27, scope: !1078)
!1105 = !DILocation(line: 844, column: 10, scope: !1078)
!1106 = !DILocation(line: 844, column: 8, scope: !1078)
!1107 = !DILocation(line: 846, column: 15, scope: !1078)
!1108 = !DILocation(line: 846, column: 4, scope: !1078)
!1109 = !DILocation(line: 847, column: 15, scope: !1078)
!1110 = !DILocation(line: 847, column: 4, scope: !1078)
!1111 = !DILocation(line: 849, column: 11, scope: !1078)
!1112 = !DILocation(line: 849, column: 4, scope: !1078)
!1113 = !DILocation(line: 850, column: 1, scope: !1078)
!1114 = distinct !DISubprogram(name: "Posix_Mkfifo", scope: !351, file: !351, line: 871, type: !574, isLocal: false, isDefinition: true, scopeLine: 873, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!1115 = !DILocalVariable(name: "pathName", arg: 1, scope: !1114, file: !351, line: 871, type: !429)
!1116 = !DILocation(line: 871, column: 26, scope: !1114)
!1117 = !DILocalVariable(name: "mode", arg: 2, scope: !1114, file: !351, line: 872, type: !452)
!1118 = !DILocation(line: 872, column: 21, scope: !1114)
!1119 = !DILocalVariable(name: "path", scope: !1114, file: !351, line: 874, type: !338)
!1120 = !DILocation(line: 874, column: 10, scope: !1114)
!1121 = !DILocalVariable(name: "ret", scope: !1114, file: !351, line: 875, type: !363)
!1122 = !DILocation(line: 875, column: 8, scope: !1114)
!1123 = !DILocation(line: 877, column: 31, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1114, file: !351, line: 877, column: 8)
!1125 = !DILocation(line: 877, column: 9, scope: !1124)
!1126 = !DILocation(line: 877, column: 8, scope: !1114)
!1127 = !DILocation(line: 878, column: 7, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1124, file: !351, line: 877, column: 49)
!1129 = !DILocation(line: 881, column: 17, scope: !1114)
!1130 = !DILocation(line: 881, column: 23, scope: !1114)
!1131 = !DILocation(line: 881, column: 10, scope: !1114)
!1132 = !DILocation(line: 881, column: 8, scope: !1114)
!1133 = !DILocation(line: 883, column: 15, scope: !1114)
!1134 = !DILocation(line: 883, column: 4, scope: !1114)
!1135 = !DILocation(line: 885, column: 11, scope: !1114)
!1136 = !DILocation(line: 885, column: 4, scope: !1114)
!1137 = !DILocation(line: 886, column: 1, scope: !1114)
!1138 = distinct !DISubprogram(name: "Posix_Truncate", scope: !351, file: !351, line: 907, type: !1139, isLocal: false, isDefinition: true, scopeLine: 909, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!363, !429, !1141}
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !367, line: 92, baseType: !410)
!1142 = !DILocalVariable(name: "pathName", arg: 1, scope: !1138, file: !351, line: 907, type: !429)
!1143 = !DILocation(line: 907, column: 28, scope: !1138)
!1144 = !DILocalVariable(name: "length", arg: 2, scope: !1138, file: !351, line: 908, type: !1141)
!1145 = !DILocation(line: 908, column: 22, scope: !1138)
!1146 = !DILocalVariable(name: "path", scope: !1138, file: !351, line: 910, type: !338)
!1147 = !DILocation(line: 910, column: 10, scope: !1138)
!1148 = !DILocalVariable(name: "ret", scope: !1138, file: !351, line: 911, type: !363)
!1149 = !DILocation(line: 911, column: 8, scope: !1138)
!1150 = !DILocation(line: 913, column: 31, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1138, file: !351, line: 913, column: 8)
!1152 = !DILocation(line: 913, column: 9, scope: !1151)
!1153 = !DILocation(line: 913, column: 8, scope: !1138)
!1154 = !DILocation(line: 914, column: 7, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1151, file: !351, line: 913, column: 49)
!1156 = !DILocation(line: 917, column: 19, scope: !1138)
!1157 = !DILocation(line: 917, column: 25, scope: !1138)
!1158 = !DILocation(line: 917, column: 10, scope: !1138)
!1159 = !DILocation(line: 917, column: 8, scope: !1138)
!1160 = !DILocation(line: 919, column: 15, scope: !1138)
!1161 = !DILocation(line: 919, column: 4, scope: !1138)
!1162 = !DILocation(line: 921, column: 11, scope: !1138)
!1163 = !DILocation(line: 921, column: 4, scope: !1138)
!1164 = !DILocation(line: 922, column: 1, scope: !1138)
!1165 = distinct !DISubprogram(name: "Posix_Utimes", scope: !351, file: !351, line: 943, type: !1166, isLocal: false, isDefinition: true, scopeLine: 945, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!363, !429, !1168}
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !1171, line: 30, size: 128, align: 64, elements: !1172)
!1171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!1172 = !{!1173, !1174}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1170, file: !1171, line: 32, baseType: !640, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1170, file: !1171, line: 33, baseType: !1175, size: 64, align: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !396, line: 141, baseType: !397)
!1176 = !DILocalVariable(name: "pathName", arg: 1, scope: !1165, file: !351, line: 943, type: !429)
!1177 = !DILocation(line: 943, column: 26, scope: !1165)
!1178 = !DILocalVariable(name: "times", arg: 2, scope: !1165, file: !351, line: 944, type: !1168)
!1179 = !DILocation(line: 944, column: 36, scope: !1165)
!1180 = !DILocalVariable(name: "path", scope: !1165, file: !351, line: 946, type: !338)
!1181 = !DILocation(line: 946, column: 10, scope: !1165)
!1182 = !DILocalVariable(name: "ret", scope: !1165, file: !351, line: 947, type: !363)
!1183 = !DILocation(line: 947, column: 8, scope: !1165)
!1184 = !DILocation(line: 949, column: 31, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1165, file: !351, line: 949, column: 8)
!1186 = !DILocation(line: 949, column: 9, scope: !1185)
!1187 = !DILocation(line: 949, column: 8, scope: !1165)
!1188 = !DILocation(line: 950, column: 7, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1185, file: !351, line: 949, column: 49)
!1190 = !DILocation(line: 953, column: 17, scope: !1165)
!1191 = !DILocation(line: 953, column: 23, scope: !1165)
!1192 = !DILocation(line: 953, column: 10, scope: !1165)
!1193 = !DILocation(line: 953, column: 8, scope: !1165)
!1194 = !DILocation(line: 955, column: 15, scope: !1165)
!1195 = !DILocation(line: 955, column: 4, scope: !1165)
!1196 = !DILocation(line: 957, column: 11, scope: !1165)
!1197 = !DILocation(line: 957, column: 4, scope: !1165)
!1198 = !DILocation(line: 958, column: 1, scope: !1165)
!1199 = distinct !DISubprogram(name: "Posix_Execl", scope: !351, file: !351, line: 979, type: !1200, isLocal: false, isDefinition: true, scopeLine: 982, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!363, !429, !429, null}
!1202 = !DILocalVariable(name: "pathName", arg: 1, scope: !1199, file: !351, line: 979, type: !429)
!1203 = !DILocation(line: 979, column: 25, scope: !1199)
!1204 = !DILocalVariable(name: "arg0", arg: 2, scope: !1199, file: !351, line: 980, type: !429)
!1205 = !DILocation(line: 980, column: 25, scope: !1199)
!1206 = !DILocalVariable(name: "ret", scope: !1199, file: !351, line: 983, type: !363)
!1207 = !DILocation(line: 983, column: 8, scope: !1199)
!1208 = !DILocalVariable(name: "path", scope: !1199, file: !351, line: 984, type: !338)
!1209 = !DILocation(line: 984, column: 10, scope: !1199)
!1210 = !DILocalVariable(name: "vl", scope: !1199, file: !351, line: 985, type: !472)
!1211 = !DILocation(line: 985, column: 12, scope: !1199)
!1212 = !DILocalVariable(name: "argv", scope: !1199, file: !351, line: 986, type: !337)
!1213 = !DILocation(line: 986, column: 11, scope: !1199)
!1214 = !DILocalVariable(name: "i", scope: !1199, file: !351, line: 987, type: !363)
!1215 = !DILocation(line: 987, column: 8, scope: !1199)
!1216 = !DILocalVariable(name: "count", scope: !1199, file: !351, line: 987, type: !363)
!1217 = !DILocation(line: 987, column: 11, scope: !1199)
!1218 = !DILocation(line: 989, column: 31, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1199, file: !351, line: 989, column: 8)
!1220 = !DILocation(line: 989, column: 9, scope: !1219)
!1221 = !DILocation(line: 989, column: 8, scope: !1199)
!1222 = !DILocation(line: 990, column: 7, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1219, file: !351, line: 989, column: 49)
!1224 = !DILocation(line: 993, column: 8, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1199, file: !351, line: 993, column: 8)
!1226 = !DILocation(line: 993, column: 8, scope: !1199)
!1227 = !DILocation(line: 994, column: 13, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1225, file: !351, line: 993, column: 14)
!1229 = !DILocation(line: 995, column: 6, scope: !1228)
!1230 = !DILocation(line: 996, column: 7, scope: !1228)
!1231 = !DILocation(line: 996, column: 13, scope: !1232)
!1232 = !DILexicalBlockFile(scope: !1228, file: !351, discriminator: 1)
!1233 = !DILocation(line: 996, column: 13, scope: !1234)
!1234 = !DILexicalBlockFile(scope: !1228, file: !351, discriminator: 2)
!1235 = !DILocation(line: 996, column: 13, scope: !1236)
!1236 = !DILexicalBlockFile(scope: !1228, file: !351, discriminator: 3)
!1237 = !DILocation(line: 996, column: 13, scope: !1238)
!1238 = !DILexicalBlockFile(scope: !1228, file: !351, discriminator: 4)
!1239 = !DILocation(line: 996, column: 7, scope: !1238)
!1240 = !DILocation(line: 997, column: 16, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1228, file: !351, line: 996, column: 33)
!1242 = !DILocation(line: 996, column: 7, scope: !1243)
!1243 = !DILexicalBlockFile(scope: !1228, file: !351, discriminator: 5)
!1244 = distinct !{!1244, !1230}
!1245 = !DILocation(line: 999, column: 6, scope: !1228)
!1246 = !DILocation(line: 1000, column: 4, scope: !1228)
!1247 = !DILocation(line: 1002, column: 46, scope: !1199)
!1248 = !DILocation(line: 1002, column: 52, scope: !1199)
!1249 = !DILocation(line: 1002, column: 45, scope: !1199)
!1250 = !DILocation(line: 1002, column: 43, scope: !1199)
!1251 = !DILocation(line: 1002, column: 21, scope: !1199)
!1252 = !DILocation(line: 1002, column: 11, scope: !1199)
!1253 = !DILocation(line: 1002, column: 9, scope: !1199)
!1254 = !DILocation(line: 1003, column: 8, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1199, file: !351, line: 1003, column: 8)
!1256 = !DILocation(line: 1003, column: 13, scope: !1255)
!1257 = !DILocation(line: 1003, column: 8, scope: !1199)
!1258 = !DILocation(line: 1004, column: 8, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1255, file: !351, line: 1003, column: 21)
!1260 = !DILocation(line: 1004, column: 12, scope: !1259)
!1261 = !DILocation(line: 1005, column: 7, scope: !1259)
!1262 = !DILocation(line: 1007, column: 8, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1199, file: !351, line: 1007, column: 8)
!1264 = !DILocation(line: 1007, column: 8, scope: !1199)
!1265 = !DILocation(line: 1008, column: 8, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1263, file: !351, line: 1007, column: 14)
!1267 = !DILocation(line: 1008, column: 12, scope: !1266)
!1268 = !DILocation(line: 1009, column: 11, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1266, file: !351, line: 1009, column: 11)
!1270 = !DILocation(line: 1009, column: 17, scope: !1269)
!1271 = !DILocation(line: 1009, column: 11, scope: !1266)
!1272 = !DILocation(line: 1010, column: 37, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1274, file: !351, line: 1010, column: 14)
!1274 = distinct !DILexicalBlock(scope: !1269, file: !351, line: 1009, column: 22)
!1275 = !DILocation(line: 1010, column: 44, scope: !1273)
!1276 = !DILocation(line: 1010, column: 15, scope: !1273)
!1277 = !DILocation(line: 1010, column: 14, scope: !1274)
!1278 = !DILocation(line: 1011, column: 13, scope: !1279)
!1279 = distinct !DILexicalBlock(scope: !1273, file: !351, line: 1010, column: 54)
!1280 = !DILocation(line: 1013, column: 9, scope: !1274)
!1281 = !DILocation(line: 1014, column: 17, scope: !1282)
!1282 = distinct !DILexicalBlock(scope: !1274, file: !351, line: 1014, column: 10)
!1283 = !DILocation(line: 1014, column: 15, scope: !1282)
!1284 = !DILocation(line: 1014, column: 22, scope: !1285)
!1285 = !DILexicalBlockFile(scope: !1286, file: !351, discriminator: 1)
!1286 = distinct !DILexicalBlock(scope: !1282, file: !351, line: 1014, column: 10)
!1287 = !DILocation(line: 1014, column: 26, scope: !1285)
!1288 = !DILocation(line: 1014, column: 24, scope: !1285)
!1289 = !DILocation(line: 1014, column: 10, scope: !1285)
!1290 = !DILocation(line: 1015, column: 39, scope: !1291)
!1291 = distinct !DILexicalBlock(scope: !1292, file: !351, line: 1015, column: 17)
!1292 = distinct !DILexicalBlock(scope: !1286, file: !351, line: 1014, column: 38)
!1293 = !DILocation(line: 1015, column: 39, scope: !1294)
!1294 = !DILexicalBlockFile(scope: !1291, file: !351, discriminator: 1)
!1295 = !DILocation(line: 1015, column: 39, scope: !1296)
!1296 = !DILexicalBlockFile(scope: !1291, file: !351, discriminator: 2)
!1297 = !DILocation(line: 1015, column: 39, scope: !1298)
!1298 = !DILexicalBlockFile(scope: !1291, file: !351, discriminator: 3)
!1299 = !DILocation(line: 1015, column: 65, scope: !1298)
!1300 = !DILocation(line: 1015, column: 60, scope: !1298)
!1301 = !DILocation(line: 1015, column: 18, scope: !1298)
!1302 = !DILocation(line: 1015, column: 17, scope: !1298)
!1303 = !DILocation(line: 1016, column: 15, scope: !1304)
!1304 = distinct !DILexicalBlock(scope: !1291, file: !351, line: 1015, column: 70)
!1305 = !DILocation(line: 1017, column: 16, scope: !1304)
!1306 = !DILocation(line: 1019, column: 10, scope: !1292)
!1307 = !DILocation(line: 1014, column: 34, scope: !1308)
!1308 = !DILexicalBlockFile(scope: !1286, file: !351, discriminator: 2)
!1309 = !DILocation(line: 1014, column: 10, scope: !1308)
!1310 = distinct !{!1310, !1311}
!1311 = !DILocation(line: 1014, column: 10, scope: !1274)
!1312 = !DILocation(line: 1020, column: 9, scope: !1274)
!1313 = !DILocation(line: 1021, column: 7, scope: !1274)
!1314 = !DILocation(line: 1022, column: 12, scope: !1266)
!1315 = !DILocation(line: 1022, column: 7, scope: !1266)
!1316 = !DILocation(line: 1022, column: 19, scope: !1266)
!1317 = !DILocation(line: 1023, column: 12, scope: !1318)
!1318 = distinct !DILexicalBlock(scope: !1266, file: !351, line: 1023, column: 10)
!1319 = !DILocation(line: 1023, column: 11, scope: !1318)
!1320 = !DILocation(line: 1023, column: 16, scope: !1318)
!1321 = !DILocation(line: 1023, column: 10, scope: !1266)
!1322 = !DILocation(line: 1024, column: 10, scope: !1323)
!1323 = distinct !DILexicalBlock(scope: !1318, file: !351, line: 1023, column: 22)
!1324 = !DILocation(line: 1026, column: 4, scope: !1266)
!1325 = !DILocation(line: 1028, column: 16, scope: !1199)
!1326 = !DILocation(line: 1028, column: 22, scope: !1199)
!1327 = !DILocation(line: 1028, column: 10, scope: !1199)
!1328 = !DILocation(line: 1028, column: 8, scope: !1199)
!1329 = !DILocation(line: 1028, column: 4, scope: !1199)
!1330 = !DILocation(line: 1031, column: 24, scope: !1199)
!1331 = !DILocation(line: 1031, column: 4, scope: !1199)
!1332 = !DILocation(line: 1032, column: 15, scope: !1199)
!1333 = !DILocation(line: 1032, column: 4, scope: !1199)
!1334 = !DILocation(line: 1034, column: 11, scope: !1199)
!1335 = !DILocation(line: 1034, column: 4, scope: !1199)
!1336 = distinct !DISubprogram(name: "Util_FreeStringList", scope: !1337, file: !1337, line: 368, type: !1338, isLocal: true, isDefinition: true, scopeLine: 370, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!1337 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/util.h", directory: "/home/lichi/Desktop/open-vm-tools/line663")
!1338 = !DISubroutineType(types: !1339)
!1339 = !{null, !337, !1340}
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !367, line: 102, baseType: !1341)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !396, line: 172, baseType: !397)
!1342 = !DILocalVariable(name: "list", arg: 1, scope: !1336, file: !1337, line: 368, type: !337)
!1343 = !DILocation(line: 368, column: 28, scope: !1336)
!1344 = !DILocalVariable(name: "length", arg: 2, scope: !1336, file: !1337, line: 369, type: !1340)
!1345 = !DILocation(line: 369, column: 29, scope: !1336)
!1346 = !DILocation(line: 371, column: 28, scope: !1336)
!1347 = !DILocation(line: 371, column: 34, scope: !1336)
!1348 = !DILocation(line: 371, column: 4, scope: !1336)
!1349 = !DILocation(line: 372, column: 1, scope: !1336)
!1350 = distinct !DISubprogram(name: "Posix_Execlp", scope: !351, file: !351, line: 1056, type: !1200, isLocal: false, isDefinition: true, scopeLine: 1059, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!1351 = !DILocalVariable(name: "fileName", arg: 1, scope: !1350, file: !351, line: 1056, type: !429)
!1352 = !DILocation(line: 1056, column: 26, scope: !1350)
!1353 = !DILocalVariable(name: "arg0", arg: 2, scope: !1350, file: !351, line: 1057, type: !429)
!1354 = !DILocation(line: 1057, column: 26, scope: !1350)
!1355 = !DILocalVariable(name: "ret", scope: !1350, file: !351, line: 1060, type: !363)
!1356 = !DILocation(line: 1060, column: 8, scope: !1350)
!1357 = !DILocalVariable(name: "file", scope: !1350, file: !351, line: 1061, type: !338)
!1358 = !DILocation(line: 1061, column: 10, scope: !1350)
!1359 = !DILocalVariable(name: "vl", scope: !1350, file: !351, line: 1062, type: !472)
!1360 = !DILocation(line: 1062, column: 12, scope: !1350)
!1361 = !DILocalVariable(name: "argv", scope: !1350, file: !351, line: 1063, type: !337)
!1362 = !DILocation(line: 1063, column: 11, scope: !1350)
!1363 = !DILocalVariable(name: "i", scope: !1350, file: !351, line: 1064, type: !363)
!1364 = !DILocation(line: 1064, column: 8, scope: !1350)
!1365 = !DILocalVariable(name: "count", scope: !1350, file: !351, line: 1064, type: !363)
!1366 = !DILocation(line: 1064, column: 11, scope: !1350)
!1367 = !DILocation(line: 1066, column: 31, scope: !1368)
!1368 = distinct !DILexicalBlock(scope: !1350, file: !351, line: 1066, column: 8)
!1369 = !DILocation(line: 1066, column: 9, scope: !1368)
!1370 = !DILocation(line: 1066, column: 8, scope: !1350)
!1371 = !DILocation(line: 1067, column: 7, scope: !1372)
!1372 = distinct !DILexicalBlock(scope: !1368, file: !351, line: 1066, column: 49)
!1373 = !DILocation(line: 1070, column: 8, scope: !1374)
!1374 = distinct !DILexicalBlock(scope: !1350, file: !351, line: 1070, column: 8)
!1375 = !DILocation(line: 1070, column: 8, scope: !1350)
!1376 = !DILocation(line: 1071, column: 13, scope: !1377)
!1377 = distinct !DILexicalBlock(scope: !1374, file: !351, line: 1070, column: 14)
!1378 = !DILocation(line: 1072, column: 6, scope: !1377)
!1379 = !DILocation(line: 1073, column: 7, scope: !1377)
!1380 = !DILocation(line: 1073, column: 13, scope: !1381)
!1381 = !DILexicalBlockFile(scope: !1377, file: !351, discriminator: 1)
!1382 = !DILocation(line: 1073, column: 13, scope: !1383)
!1383 = !DILexicalBlockFile(scope: !1377, file: !351, discriminator: 2)
!1384 = !DILocation(line: 1073, column: 13, scope: !1385)
!1385 = !DILexicalBlockFile(scope: !1377, file: !351, discriminator: 3)
!1386 = !DILocation(line: 1073, column: 13, scope: !1387)
!1387 = !DILexicalBlockFile(scope: !1377, file: !351, discriminator: 4)
!1388 = !DILocation(line: 1073, column: 7, scope: !1387)
!1389 = !DILocation(line: 1074, column: 16, scope: !1390)
!1390 = distinct !DILexicalBlock(scope: !1377, file: !351, line: 1073, column: 33)
!1391 = !DILocation(line: 1073, column: 7, scope: !1392)
!1392 = !DILexicalBlockFile(scope: !1377, file: !351, discriminator: 5)
!1393 = distinct !{!1393, !1379}
!1394 = !DILocation(line: 1076, column: 6, scope: !1377)
!1395 = !DILocation(line: 1077, column: 4, scope: !1377)
!1396 = !DILocation(line: 1079, column: 46, scope: !1350)
!1397 = !DILocation(line: 1079, column: 52, scope: !1350)
!1398 = !DILocation(line: 1079, column: 45, scope: !1350)
!1399 = !DILocation(line: 1079, column: 43, scope: !1350)
!1400 = !DILocation(line: 1079, column: 21, scope: !1350)
!1401 = !DILocation(line: 1079, column: 11, scope: !1350)
!1402 = !DILocation(line: 1079, column: 9, scope: !1350)
!1403 = !DILocation(line: 1080, column: 8, scope: !1404)
!1404 = distinct !DILexicalBlock(scope: !1350, file: !351, line: 1080, column: 8)
!1405 = !DILocation(line: 1080, column: 13, scope: !1404)
!1406 = !DILocation(line: 1080, column: 8, scope: !1350)
!1407 = !DILocation(line: 1081, column: 8, scope: !1408)
!1408 = distinct !DILexicalBlock(scope: !1404, file: !351, line: 1080, column: 21)
!1409 = !DILocation(line: 1081, column: 12, scope: !1408)
!1410 = !DILocation(line: 1082, column: 7, scope: !1408)
!1411 = !DILocation(line: 1084, column: 8, scope: !1412)
!1412 = distinct !DILexicalBlock(scope: !1350, file: !351, line: 1084, column: 8)
!1413 = !DILocation(line: 1084, column: 8, scope: !1350)
!1414 = !DILocation(line: 1085, column: 8, scope: !1415)
!1415 = distinct !DILexicalBlock(scope: !1412, file: !351, line: 1084, column: 14)
!1416 = !DILocation(line: 1085, column: 12, scope: !1415)
!1417 = !DILocation(line: 1086, column: 11, scope: !1418)
!1418 = distinct !DILexicalBlock(scope: !1415, file: !351, line: 1086, column: 11)
!1419 = !DILocation(line: 1086, column: 17, scope: !1418)
!1420 = !DILocation(line: 1086, column: 11, scope: !1415)
!1421 = !DILocation(line: 1087, column: 37, scope: !1422)
!1422 = distinct !DILexicalBlock(scope: !1423, file: !351, line: 1087, column: 14)
!1423 = distinct !DILexicalBlock(scope: !1418, file: !351, line: 1086, column: 22)
!1424 = !DILocation(line: 1087, column: 44, scope: !1422)
!1425 = !DILocation(line: 1087, column: 15, scope: !1422)
!1426 = !DILocation(line: 1087, column: 14, scope: !1423)
!1427 = !DILocation(line: 1088, column: 13, scope: !1428)
!1428 = distinct !DILexicalBlock(scope: !1422, file: !351, line: 1087, column: 54)
!1429 = !DILocation(line: 1090, column: 9, scope: !1423)
!1430 = !DILocation(line: 1091, column: 17, scope: !1431)
!1431 = distinct !DILexicalBlock(scope: !1423, file: !351, line: 1091, column: 10)
!1432 = !DILocation(line: 1091, column: 15, scope: !1431)
!1433 = !DILocation(line: 1091, column: 22, scope: !1434)
!1434 = !DILexicalBlockFile(scope: !1435, file: !351, discriminator: 1)
!1435 = distinct !DILexicalBlock(scope: !1431, file: !351, line: 1091, column: 10)
!1436 = !DILocation(line: 1091, column: 26, scope: !1434)
!1437 = !DILocation(line: 1091, column: 24, scope: !1434)
!1438 = !DILocation(line: 1091, column: 10, scope: !1434)
!1439 = !DILocation(line: 1092, column: 39, scope: !1440)
!1440 = distinct !DILexicalBlock(scope: !1441, file: !351, line: 1092, column: 17)
!1441 = distinct !DILexicalBlock(scope: !1435, file: !351, line: 1091, column: 38)
!1442 = !DILocation(line: 1092, column: 39, scope: !1443)
!1443 = !DILexicalBlockFile(scope: !1440, file: !351, discriminator: 1)
!1444 = !DILocation(line: 1092, column: 39, scope: !1445)
!1445 = !DILexicalBlockFile(scope: !1440, file: !351, discriminator: 2)
!1446 = !DILocation(line: 1092, column: 39, scope: !1447)
!1447 = !DILexicalBlockFile(scope: !1440, file: !351, discriminator: 3)
!1448 = !DILocation(line: 1092, column: 65, scope: !1447)
!1449 = !DILocation(line: 1092, column: 60, scope: !1447)
!1450 = !DILocation(line: 1092, column: 18, scope: !1447)
!1451 = !DILocation(line: 1092, column: 17, scope: !1447)
!1452 = !DILocation(line: 1093, column: 15, scope: !1453)
!1453 = distinct !DILexicalBlock(scope: !1440, file: !351, line: 1092, column: 70)
!1454 = !DILocation(line: 1094, column: 16, scope: !1453)
!1455 = !DILocation(line: 1096, column: 10, scope: !1441)
!1456 = !DILocation(line: 1091, column: 34, scope: !1457)
!1457 = !DILexicalBlockFile(scope: !1435, file: !351, discriminator: 2)
!1458 = !DILocation(line: 1091, column: 10, scope: !1457)
!1459 = distinct !{!1459, !1460}
!1460 = !DILocation(line: 1091, column: 10, scope: !1423)
!1461 = !DILocation(line: 1097, column: 9, scope: !1423)
!1462 = !DILocation(line: 1098, column: 7, scope: !1423)
!1463 = !DILocation(line: 1099, column: 12, scope: !1415)
!1464 = !DILocation(line: 1099, column: 7, scope: !1415)
!1465 = !DILocation(line: 1099, column: 19, scope: !1415)
!1466 = !DILocation(line: 1100, column: 12, scope: !1467)
!1467 = distinct !DILexicalBlock(scope: !1415, file: !351, line: 1100, column: 10)
!1468 = !DILocation(line: 1100, column: 11, scope: !1467)
!1469 = !DILocation(line: 1100, column: 16, scope: !1467)
!1470 = !DILocation(line: 1100, column: 10, scope: !1415)
!1471 = !DILocation(line: 1101, column: 10, scope: !1472)
!1472 = distinct !DILexicalBlock(scope: !1467, file: !351, line: 1100, column: 22)
!1473 = !DILocation(line: 1103, column: 4, scope: !1415)
!1474 = !DILocation(line: 1105, column: 17, scope: !1350)
!1475 = !DILocation(line: 1105, column: 23, scope: !1350)
!1476 = !DILocation(line: 1105, column: 10, scope: !1350)
!1477 = !DILocation(line: 1105, column: 8, scope: !1350)
!1478 = !DILocation(line: 1105, column: 4, scope: !1350)
!1479 = !DILocation(line: 1108, column: 24, scope: !1350)
!1480 = !DILocation(line: 1108, column: 4, scope: !1350)
!1481 = !DILocation(line: 1109, column: 15, scope: !1350)
!1482 = !DILocation(line: 1109, column: 4, scope: !1350)
!1483 = !DILocation(line: 1111, column: 11, scope: !1350)
!1484 = !DILocation(line: 1111, column: 4, scope: !1350)
!1485 = distinct !DISubprogram(name: "Posix_Execv", scope: !351, file: !351, line: 1133, type: !1486, isLocal: false, isDefinition: true, scopeLine: 1135, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{!363, !429, !1488}
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !338)
!1490 = !DILocalVariable(name: "pathName", arg: 1, scope: !1485, file: !351, line: 1133, type: !429)
!1491 = !DILocation(line: 1133, column: 25, scope: !1485)
!1492 = !DILocalVariable(name: "argVal", arg: 2, scope: !1485, file: !351, line: 1134, type: !1488)
!1493 = !DILocation(line: 1134, column: 25, scope: !1485)
!1494 = !DILocalVariable(name: "ret", scope: !1485, file: !351, line: 1136, type: !363)
!1495 = !DILocation(line: 1136, column: 8, scope: !1485)
!1496 = !DILocalVariable(name: "path", scope: !1485, file: !351, line: 1137, type: !338)
!1497 = !DILocation(line: 1137, column: 10, scope: !1485)
!1498 = !DILocalVariable(name: "argv", scope: !1485, file: !351, line: 1138, type: !337)
!1499 = !DILocation(line: 1138, column: 11, scope: !1485)
!1500 = !DILocation(line: 1140, column: 31, scope: !1501)
!1501 = distinct !DILexicalBlock(scope: !1485, file: !351, line: 1140, column: 8)
!1502 = !DILocation(line: 1140, column: 9, scope: !1501)
!1503 = !DILocation(line: 1140, column: 8, scope: !1485)
!1504 = !DILocation(line: 1141, column: 7, scope: !1505)
!1505 = distinct !DILexicalBlock(scope: !1501, file: !351, line: 1140, column: 49)
!1506 = !DILocation(line: 1143, column: 35, scope: !1507)
!1507 = distinct !DILexicalBlock(scope: !1485, file: !351, line: 1143, column: 8)
!1508 = !DILocation(line: 1143, column: 9, scope: !1507)
!1509 = !DILocation(line: 1143, column: 8, scope: !1485)
!1510 = !DILocation(line: 1144, column: 7, scope: !1511)
!1511 = distinct !DILexicalBlock(scope: !1507, file: !351, line: 1143, column: 51)
!1512 = !DILocation(line: 1147, column: 16, scope: !1485)
!1513 = !DILocation(line: 1147, column: 22, scope: !1485)
!1514 = !DILocation(line: 1147, column: 10, scope: !1485)
!1515 = !DILocation(line: 1147, column: 8, scope: !1485)
!1516 = !DILocation(line: 1147, column: 4, scope: !1485)
!1517 = !DILocation(line: 1150, column: 24, scope: !1485)
!1518 = !DILocation(line: 1150, column: 4, scope: !1485)
!1519 = !DILocation(line: 1151, column: 15, scope: !1485)
!1520 = !DILocation(line: 1151, column: 4, scope: !1485)
!1521 = !DILocation(line: 1153, column: 11, scope: !1485)
!1522 = !DILocation(line: 1153, column: 4, scope: !1485)
!1523 = distinct !DISubprogram(name: "PosixConvertToCurrentList", scope: !426, file: !426, line: 100, type: !1524, isLocal: true, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{!513, !1488, !1526}
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!1527 = !DILocalVariable(name: "in", arg: 1, scope: !1523, file: !426, line: 100, type: !1488)
!1528 = !DILocation(line: 100, column: 40, scope: !1523)
!1529 = !DILocalVariable(name: "out", arg: 2, scope: !1523, file: !426, line: 101, type: !1526)
!1530 = !DILocation(line: 101, column: 35, scope: !1523)
!1531 = !DILocalVariable(name: "e", scope: !1523, file: !426, line: 103, type: !363)
!1532 = !DILocation(line: 103, column: 8, scope: !1523)
!1533 = !DILocation(line: 103, column: 13, scope: !1523)
!1534 = !DILocation(line: 103, column: 12, scope: !1523)
!1535 = !DILocalVariable(name: "p", scope: !1523, file: !426, line: 104, type: !337)
!1536 = !DILocation(line: 104, column: 11, scope: !1523)
!1537 = !DILocalVariable(name: "success", scope: !1523, file: !426, line: 105, type: !513)
!1538 = !DILocation(line: 105, column: 9, scope: !1523)
!1539 = !DILocation(line: 107, column: 8, scope: !1540)
!1540 = distinct !DILexicalBlock(scope: !1523, file: !426, line: 107, column: 8)
!1541 = !DILocation(line: 107, column: 11, scope: !1540)
!1542 = !DILocation(line: 107, column: 8, scope: !1523)
!1543 = !DILocation(line: 108, column: 9, scope: !1544)
!1544 = distinct !DILexicalBlock(scope: !1540, file: !426, line: 107, column: 19)
!1545 = !DILocation(line: 109, column: 15, scope: !1544)
!1546 = !DILocation(line: 110, column: 4, scope: !1544)
!1547 = !DILocation(line: 111, column: 32, scope: !1548)
!1548 = distinct !DILexicalBlock(scope: !1540, file: !426, line: 110, column: 11)
!1549 = !DILocation(line: 111, column: 11, scope: !1548)
!1550 = !DILocation(line: 111, column: 9, scope: !1548)
!1551 = !DILocation(line: 112, column: 17, scope: !1548)
!1552 = !DILocation(line: 112, column: 19, scope: !1548)
!1553 = !DILocation(line: 112, column: 15, scope: !1548)
!1554 = !DILocation(line: 115, column: 9, scope: !1555)
!1555 = distinct !DILexicalBlock(scope: !1523, file: !426, line: 115, column: 8)
!1556 = !DILocation(line: 115, column: 8, scope: !1523)
!1557 = !DILocation(line: 116, column: 9, scope: !1558)
!1558 = distinct !DILexicalBlock(scope: !1555, file: !426, line: 115, column: 18)
!1559 = !DILocation(line: 117, column: 4, scope: !1558)
!1560 = !DILocation(line: 118, column: 11, scope: !1523)
!1561 = !DILocation(line: 118, column: 5, scope: !1523)
!1562 = !DILocation(line: 118, column: 9, scope: !1523)
!1563 = !DILocation(line: 119, column: 11, scope: !1523)
!1564 = !DILocation(line: 119, column: 5, scope: !1523)
!1565 = !DILocation(line: 119, column: 9, scope: !1523)
!1566 = !DILocation(line: 120, column: 11, scope: !1523)
!1567 = !DILocation(line: 120, column: 4, scope: !1523)
!1568 = distinct !DISubprogram(name: "Posix_Execve", scope: !351, file: !351, line: 1175, type: !1569, isLocal: false, isDefinition: true, scopeLine: 1178, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!1569 = !DISubroutineType(types: !1570)
!1570 = !{!363, !429, !1488, !1488}
!1571 = !DILocalVariable(name: "pathName", arg: 1, scope: !1568, file: !351, line: 1175, type: !429)
!1572 = !DILocation(line: 1175, column: 26, scope: !1568)
!1573 = !DILocalVariable(name: "argVal", arg: 2, scope: !1568, file: !351, line: 1176, type: !1488)
!1574 = !DILocation(line: 1176, column: 26, scope: !1568)
!1575 = !DILocalVariable(name: "envPtr", arg: 3, scope: !1568, file: !351, line: 1177, type: !1488)
!1576 = !DILocation(line: 1177, column: 26, scope: !1568)
!1577 = !DILocalVariable(name: "ret", scope: !1568, file: !351, line: 1179, type: !363)
!1578 = !DILocation(line: 1179, column: 8, scope: !1568)
!1579 = !DILocalVariable(name: "path", scope: !1568, file: !351, line: 1180, type: !338)
!1580 = !DILocation(line: 1180, column: 10, scope: !1568)
!1581 = !DILocalVariable(name: "argv", scope: !1568, file: !351, line: 1181, type: !337)
!1582 = !DILocation(line: 1181, column: 11, scope: !1568)
!1583 = !DILocalVariable(name: "envp", scope: !1568, file: !351, line: 1182, type: !337)
!1584 = !DILocation(line: 1182, column: 11, scope: !1568)
!1585 = !DILocation(line: 1184, column: 31, scope: !1586)
!1586 = distinct !DILexicalBlock(scope: !1568, file: !351, line: 1184, column: 8)
!1587 = !DILocation(line: 1184, column: 9, scope: !1586)
!1588 = !DILocation(line: 1184, column: 8, scope: !1568)
!1589 = !DILocation(line: 1185, column: 7, scope: !1590)
!1590 = distinct !DILexicalBlock(scope: !1586, file: !351, line: 1184, column: 49)
!1591 = !DILocation(line: 1187, column: 35, scope: !1592)
!1592 = distinct !DILexicalBlock(scope: !1568, file: !351, line: 1187, column: 8)
!1593 = !DILocation(line: 1187, column: 9, scope: !1592)
!1594 = !DILocation(line: 1187, column: 8, scope: !1568)
!1595 = !DILocation(line: 1188, column: 7, scope: !1596)
!1596 = distinct !DILexicalBlock(scope: !1592, file: !351, line: 1187, column: 51)
!1597 = !DILocation(line: 1190, column: 35, scope: !1598)
!1598 = distinct !DILexicalBlock(scope: !1568, file: !351, line: 1190, column: 8)
!1599 = !DILocation(line: 1190, column: 9, scope: !1598)
!1600 = !DILocation(line: 1190, column: 8, scope: !1568)
!1601 = !DILocation(line: 1191, column: 7, scope: !1602)
!1602 = distinct !DILexicalBlock(scope: !1598, file: !351, line: 1190, column: 51)
!1603 = !DILocation(line: 1194, column: 17, scope: !1568)
!1604 = !DILocation(line: 1194, column: 23, scope: !1568)
!1605 = !DILocation(line: 1194, column: 29, scope: !1568)
!1606 = !DILocation(line: 1194, column: 10, scope: !1568)
!1607 = !DILocation(line: 1194, column: 8, scope: !1568)
!1608 = !DILocation(line: 1194, column: 4, scope: !1568)
!1609 = !DILocation(line: 1197, column: 24, scope: !1568)
!1610 = !DILocation(line: 1197, column: 4, scope: !1568)
!1611 = !DILocation(line: 1198, column: 24, scope: !1568)
!1612 = !DILocation(line: 1198, column: 4, scope: !1568)
!1613 = !DILocation(line: 1199, column: 15, scope: !1568)
!1614 = !DILocation(line: 1199, column: 4, scope: !1568)
!1615 = !DILocation(line: 1201, column: 11, scope: !1568)
!1616 = !DILocation(line: 1201, column: 4, scope: !1568)
!1617 = distinct !DISubprogram(name: "Posix_Execvp", scope: !351, file: !351, line: 1223, type: !1486, isLocal: false, isDefinition: true, scopeLine: 1225, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !423)
!1618 = !DILocalVariable(name: "fileName", arg: 1, scope: !1617, file: !351, line: 1223, type: !429)
!1619 = !DILocation(line: 1223, column: 26, scope: !1617)
!1620 = !DILocalVariable(name: "argVal", arg: 2, scope: !1617, file: !351, line: 1224, type: !1488)
!1621 = !DILocation(line: 1224, column: 26, scope: !1617)
!1622 = !DILocalVariable(name: "ret", scope: !1617, file: !351, line: 1226, type: !363)
!1623 = !DILocation(line: 1226, column: 8, scope: !1617)
