; ModuleID = './[inter]keepalived--vrrp--vrrp_static_track.o.i'
source_filename = "./[inter]keepalived--vrrp--vrrp_static_track.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._vrrp_data = type { %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._static_track_group = type { i8*, %struct._vector*, %struct._list* }
%struct._vector = type { i32, i32, i8** }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !44)
!1 = !DIFile(filename: "[inter]keepalived--vrrp--vrrp_static_track.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!2 = !{!3, !11, !32}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chksum_compatibility", file: !4, line: 173, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./../include/vrrp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NONE", value: 0)
!7 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NEVER", value: 1)
!8 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_MIN_COMPAT", value: 2)
!9 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_CONFIG", value: 3)
!10 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_AUTO", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 41, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "../../lib/scheduler.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!14 = !DIEnumerator(name: "THREAD_READ", value: 0)
!15 = !DIEnumerator(name: "THREAD_WRITE", value: 1)
!16 = !DIEnumerator(name: "THREAD_TIMER", value: 2)
!17 = !DIEnumerator(name: "THREAD_TIMER_SHUTDOWN", value: 3)
!18 = !DIEnumerator(name: "THREAD_EVENT", value: 4)
!19 = !DIEnumerator(name: "THREAD_CHILD", value: 5)
!20 = !DIEnumerator(name: "THREAD_READY", value: 6)
!21 = !DIEnumerator(name: "THREAD_UNUSED", value: 7)
!22 = !DIEnumerator(name: "THREAD_WRITE_TIMEOUT", value: 8)
!23 = !DIEnumerator(name: "THREAD_READ_TIMEOUT", value: 9)
!24 = !DIEnumerator(name: "THREAD_CHILD_TIMEOUT", value: 10)
!25 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!26 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!27 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!28 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!29 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!30 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!31 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 119, size: 32, align: 32, elements: !34)
!33 = !DIFile(filename: "./../include/vrrp_track.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43}
!35 = !DIEnumerator(name: "TRACK_VRRP", value: 1)
!36 = !DIEnumerator(name: "TRACK_IF", value: 2)
!37 = !DIEnumerator(name: "TRACK_SG", value: 4)
!38 = !DIEnumerator(name: "TRACK_ADDR", value: 4)
!39 = !DIEnumerator(name: "TRACK_ROUTE", value: 8)
!40 = !DIEnumerator(name: "TRACK_RULE", value: 16)
!41 = !DIEnumerator(name: "TRACK_SADDR", value: 32)
!42 = !DIEnumerator(name: "TRACK_SROUTE", value: 64)
!43 = !DIEnumerator(name: "TRACK_SRULE", value: 128)
!44 = !{!45}
!45 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !46, line: 150, type: !47, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!46 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !48, line: 31, baseType: !49)
!48 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !48, line: 39, size: 320, align: 64, elements: !51)
!51 = !{!52, !60, !61, !63, !67}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !50, file: !48, line: 40, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !48, line: 33, size: 192, align: 64, elements: !55)
!55 = !{!56, !57, !58}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !48, line: 34, baseType: !53, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !54, file: !48, line: 35, baseType: !53, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !54, file: !48, line: 36, baseType: !59, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !50, file: !48, line: 41, baseType: !53, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !50, file: !48, line: 42, baseType: !62, size: 32, align: 32, offset: 128)
!62 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !50, file: !48, line: 43, baseType: !64, size: 64, align: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !59}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !50, file: !48, line: 44, baseType: !68, size: 64, align: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !71, !59}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !73, line: 48, baseType: !74)
!73 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 241, size: 1728, align: 64, elements: !76)
!75 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!76 = !{!77, !79, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !100, !101, !102, !103, !107, !109, !111, !115, !118, !120, !121, !122, !123, !124, !128, !129}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !74, file: !75, line: 242, baseType: !78, size: 32, align: 32)
!78 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !74, file: !75, line: 247, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !74, file: !75, line: 248, baseType: !80, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !74, file: !75, line: 249, baseType: !80, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !74, file: !75, line: 250, baseType: !80, size: 64, align: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !74, file: !75, line: 251, baseType: !80, size: 64, align: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !74, file: !75, line: 252, baseType: !80, size: 64, align: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !74, file: !75, line: 253, baseType: !80, size: 64, align: 64, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !74, file: !75, line: 254, baseType: !80, size: 64, align: 64, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !74, file: !75, line: 256, baseType: !80, size: 64, align: 64, offset: 576)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !74, file: !75, line: 257, baseType: !80, size: 64, align: 64, offset: 640)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !74, file: !75, line: 258, baseType: !80, size: 64, align: 64, offset: 704)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !74, file: !75, line: 260, baseType: !93, size: 64, align: 64, offset: 768)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !75, line: 156, size: 192, align: 64, elements: !95)
!95 = !{!96, !97, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !94, file: !75, line: 157, baseType: !93, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !94, file: !75, line: 158, baseType: !98, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !94, file: !75, line: 162, baseType: !78, size: 32, align: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !74, file: !75, line: 262, baseType: !98, size: 64, align: 64, offset: 832)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !74, file: !75, line: 264, baseType: !78, size: 32, align: 32, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !74, file: !75, line: 268, baseType: !78, size: 32, align: 32, offset: 928)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !74, file: !75, line: 270, baseType: !104, size: 64, align: 64, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !105, line: 131, baseType: !106)
!105 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!106 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !74, file: !75, line: 274, baseType: !108, size: 16, align: 16, offset: 1024)
!108 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !74, file: !75, line: 275, baseType: !110, size: 8, align: 8, offset: 1040)
!110 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !74, file: !75, line: 276, baseType: !112, size: 8, align: 8, offset: 1048)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 8, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 1)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !74, file: !75, line: 280, baseType: !116, size: 64, align: 64, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !75, line: 150, baseType: null)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !74, file: !75, line: 289, baseType: !119, size: 64, align: 64, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !105, line: 132, baseType: !106)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !74, file: !75, line: 297, baseType: !59, size: 64, align: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !74, file: !75, line: 298, baseType: !59, size: 64, align: 64, offset: 1280)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !74, file: !75, line: 299, baseType: !59, size: 64, align: 64, offset: 1344)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !74, file: !75, line: 300, baseType: !59, size: 64, align: 64, offset: 1408)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !74, file: !75, line: 302, baseType: !125, size: 64, align: 64, offset: 1472)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !126, line: 216, baseType: !127)
!126 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!127 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !74, file: !75, line: 303, baseType: !78, size: 32, align: 32, offset: 1536)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !74, file: !75, line: 305, baseType: !130, size: 160, align: 8, offset: 1568)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 160, align: 8, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 20)
!133 = !{i32 2, !"Dwarf Version", i32 4}
!134 = !{i32 2, !"Debug Info Version", i32 3}
!135 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!136 = distinct !DISubprogram(name: "free_tgroup", scope: !137, file: !137, line: 39, type: !65, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !138)
!137 = !DIFile(filename: "vrrp_static_track.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!138 = !{}
!139 = !DILocalVariable(name: "data", arg: 1, scope: !136, file: !137, line: 39, type: !59)
!140 = !DIExpression()
!141 = !DILocation(line: 39, column: 19, scope: !136)
!142 = !DILocalVariable(name: "tgroup", scope: !136, file: !137, line: 41, type: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "static_track_group_t", file: !145, line: 39, baseType: !146)
!145 = !DIFile(filename: "./../include/vrrp_static_track.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_track_group", file: !145, line: 35, size: 192, align: 64, elements: !147)
!147 = !{!148, !149, !159}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !146, file: !145, line: 36, baseType: !80, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !146, file: !145, line: 37, baseType: !150, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !152, line: 34, baseType: !153)
!152 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !152, line: 30, size: 128, align: 64, elements: !154)
!154 = !{!155, !156, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !153, file: !152, line: 31, baseType: !62, size: 32, align: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !153, file: !152, line: 32, baseType: !62, size: 32, align: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !153, file: !152, line: 33, baseType: !158, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !146, file: !145, line: 38, baseType: !47, size: 64, align: 64, offset: 128)
!160 = !DILocation(line: 41, column: 24, scope: !136)
!161 = !DILocation(line: 41, column: 33, scope: !136)
!162 = !DILocation(line: 43, column: 6, scope: !163)
!163 = distinct !DILexicalBlock(scope: !136, file: !137, line: 43, column: 6)
!164 = !DILocation(line: 43, column: 14, scope: !163)
!165 = !DILocation(line: 43, column: 6, scope: !136)
!166 = !DILocation(line: 44, column: 83, scope: !167)
!167 = distinct !DILexicalBlock(scope: !163, file: !137, line: 43, column: 21)
!168 = !DILocation(line: 44, column: 91, scope: !167)
!169 = !DILocation(line: 44, column: 3, scope: !167)
!170 = !DILocation(line: 45, column: 15, scope: !167)
!171 = !DILocation(line: 45, column: 23, scope: !167)
!172 = !DILocation(line: 45, column: 3, scope: !167)
!173 = !DILocation(line: 46, column: 2, scope: !167)
!174 = !DILocation(line: 47, column: 8, scope: !136)
!175 = !DILocation(line: 47, column: 16, scope: !136)
!176 = !DILocation(line: 47, column: 3, scope: !136)
!177 = !DILocation(line: 47, column: 25, scope: !136)
!178 = !DILocation(line: 47, column: 33, scope: !136)
!179 = !DILocation(line: 47, column: 40, scope: !136)
!180 = !DILocation(line: 48, column: 13, scope: !136)
!181 = !DILocation(line: 48, column: 21, scope: !136)
!182 = !DILocation(line: 48, column: 2, scope: !136)
!183 = !DILocation(line: 49, column: 8, scope: !136)
!184 = !DILocation(line: 49, column: 3, scope: !136)
!185 = !DILocation(line: 49, column: 26, scope: !136)
!186 = !DILocation(line: 50, column: 1, scope: !136)
!187 = distinct !DISubprogram(name: "dump_tgroup", scope: !137, file: !137, line: 53, type: !69, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !138)
!188 = !DILocalVariable(name: "fp", arg: 1, scope: !187, file: !137, line: 53, type: !71)
!189 = !DILocation(line: 53, column: 19, scope: !187)
!190 = !DILocalVariable(name: "data", arg: 2, scope: !187, file: !137, line: 53, type: !59)
!191 = !DILocation(line: 53, column: 29, scope: !187)
!192 = !DILocalVariable(name: "tgroup", scope: !187, file: !137, line: 55, type: !143)
!193 = !DILocation(line: 55, column: 24, scope: !187)
!194 = !DILocation(line: 55, column: 33, scope: !187)
!195 = !DILocalVariable(name: "vrrp", scope: !187, file: !137, line: 56, type: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_t", file: !4, line: 310, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_t", file: !4, line: 183, size: 7040, align: 64, elements: !199)
!199 = !{!200, !203, !204, !245, !267, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !373, !374, !375, !376, !377, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !535, !542}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !198, file: !4, line: 184, baseType: !201, size: 16, align: 16)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !202, line: 28, baseType: !108)
!202 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!203 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !198, file: !4, line: 185, baseType: !80, size: 64, align: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !198, file: !4, line: 186, baseType: !205, size: 64, align: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_sgroup_t", file: !4, line: 133, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_sgroup", file: !4, line: 109, size: 1024, align: 64, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !217, !218, !219, !220, !221, !222, !239, !240, !241, !242, !243, !244}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !207, file: !4, line: 110, baseType: !80, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !207, file: !4, line: 111, baseType: !150, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !207, file: !4, line: 112, baseType: !47, size: 64, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_fault", scope: !207, file: !4, line: 113, baseType: !62, size: 32, align: 32, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_init", scope: !207, file: !4, line: 114, baseType: !62, size: 32, align: 32, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !207, file: !4, line: 115, baseType: !78, size: 32, align: 32, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sgroup_tracking_weight", scope: !207, file: !4, line: 116, baseType: !216, size: 8, align: 8, offset: 288)
!216 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !207, file: !4, line: 119, baseType: !47, size: 64, align: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !207, file: !4, line: 120, baseType: !47, size: 64, align: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !207, file: !4, line: 121, baseType: !47, size: 64, align: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "track_bfd", scope: !207, file: !4, line: 122, baseType: !47, size: 64, align: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !207, file: !4, line: 125, baseType: !216, size: 8, align: 8, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !207, file: !4, line: 126, baseType: !223, size: 64, align: 64, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !225, line: 65, baseType: !226)
!225 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !225, line: 59, size: 192, align: 64, elements: !227)
!227 = !{!228, !230, !231, !232, !236}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !226, file: !225, line: 60, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !226, file: !225, line: 61, baseType: !78, size: 32, align: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !226, file: !225, line: 62, baseType: !78, size: 32, align: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !226, file: !225, line: 63, baseType: !233, size: 32, align: 32, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !234, line: 80, baseType: !235)
!234 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !105, line: 125, baseType: !62)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !226, file: !225, line: 64, baseType: !237, size: 32, align: 32, offset: 160)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !234, line: 65, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !105, line: 126, baseType: !62)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !207, file: !4, line: 127, baseType: !223, size: 64, align: 64, offset: 704)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !207, file: !4, line: 128, baseType: !223, size: 64, align: 64, offset: 768)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !207, file: !4, line: 129, baseType: !223, size: 64, align: 64, offset: 832)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !207, file: !4, line: 130, baseType: !223, size: 64, align: 64, offset: 896)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !207, file: !4, line: 131, baseType: !78, size: 32, align: 32, offset: 960)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !207, file: !4, line: 132, baseType: !78, size: 32, align: 32, offset: 992)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !198, file: !4, line: 187, baseType: !246, size: 64, align: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_stats", file: !4, line: 169, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_stats", file: !4, line: 136, size: 768, align: 64, elements: !249)
!249 = !{!250, !253, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "advert_rcvd", scope: !248, file: !4, line: 137, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !252, line: 55, baseType: !127)
!252 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!253 = !DIDerivedType(tag: DW_TAG_member, name: "advert_sent", scope: !248, file: !4, line: 138, baseType: !254, size: 32, align: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !252, line: 51, baseType: !62)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "become_master", scope: !248, file: !4, line: 140, baseType: !254, size: 32, align: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "release_master", scope: !248, file: !4, line: 141, baseType: !254, size: 32, align: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "packet_len_err", scope: !248, file: !4, line: 143, baseType: !251, size: 64, align: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "advert_interval_err", scope: !248, file: !4, line: 144, baseType: !251, size: 64, align: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl_err", scope: !248, file: !4, line: 145, baseType: !251, size: 64, align: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_type_rcvd", scope: !248, file: !4, line: 146, baseType: !251, size: 64, align: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list_err", scope: !248, file: !4, line: 147, baseType: !251, size: 64, align: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_authtype", scope: !248, file: !4, line: 149, baseType: !254, size: 32, align: 32, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "authtype_mismatch", scope: !248, file: !4, line: 151, baseType: !254, size: 32, align: 32, offset: 544)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "auth_failure", scope: !248, file: !4, line: 152, baseType: !254, size: 32, align: 32, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_rcvd", scope: !248, file: !4, line: 155, baseType: !251, size: 64, align: 64, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_sent", scope: !248, file: !4, line: 156, baseType: !251, size: 64, align: 64, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !198, file: !4, line: 188, baseType: !268, size: 64, align: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !46, line: 111, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !46, line: 76, size: 1792, align: 64, elements: !271)
!271 = !{!272, !276, !278, !284, !303, !304, !305, !306, !307, !313, !314, !315, !316, !317, !318, !320, !321, !322, !323, !344, !345, !346, !347, !348, !349, !350, !351}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !270, file: !46, line: 77, baseType: !273, size: 128, align: 8)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 128, align: 8, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 16)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !270, file: !46, line: 78, baseType: !277, size: 32, align: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !46, line: 62, baseType: !254)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !270, file: !46, line: 79, baseType: !279, size: 32, align: 32, offset: 160)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !280, line: 31, size: 32, align: 32, elements: !281)
!280 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!281 = !{!282}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !279, file: !280, line: 33, baseType: !283, size: 32, align: 32)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !280, line: 30, baseType: !254)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !270, file: !46, line: 80, baseType: !285, size: 128, align: 32, offset: 192)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !280, line: 211, size: 128, align: 32, elements: !286)
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !285, file: !280, line: 220, baseType: !288, size: 128, align: 32)
!288 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !285, file: !280, line: 213, size: 128, align: 32, elements: !289)
!289 = !{!290, !294, !299}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !288, file: !280, line: 215, baseType: !291, size: 128, align: 8)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 128, align: 8, elements: !274)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !252, line: 48, baseType: !293)
!293 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !288, file: !280, line: 217, baseType: !295, size: 128, align: 16)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 128, align: 16, elements: !297)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !252, line: 49, baseType: !108)
!297 = !{!298}
!298 = !DISubrange(count: 8)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !288, file: !280, line: 218, baseType: !300, size: 128, align: 32)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 128, align: 32, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 4)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !270, file: !46, line: 81, baseType: !62, size: 32, align: 32, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !270, file: !46, line: 82, baseType: !216, size: 8, align: 8, offset: 352)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !270, file: !46, line: 83, baseType: !254, size: 32, align: 32, offset: 384)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !270, file: !46, line: 84, baseType: !108, size: 16, align: 16, offset: 416)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !270, file: !46, line: 85, baseType: !308, size: 256, align: 8, offset: 432)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 256, align: 8, elements: !311)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !234, line: 33, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !105, line: 30, baseType: !293)
!311 = !{!312}
!312 = !DISubrange(count: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !270, file: !46, line: 86, baseType: !308, size: 256, align: 8, offset: 688)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !270, file: !46, line: 87, baseType: !125, size: 64, align: 64, offset: 960)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !270, file: !46, line: 88, baseType: !78, size: 32, align: 32, offset: 1024)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !270, file: !46, line: 90, baseType: !216, size: 8, align: 8, offset: 1056)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !270, file: !46, line: 91, baseType: !277, size: 32, align: 32, offset: 1088)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !270, file: !46, line: 92, baseType: !319, size: 64, align: 64, offset: 1152)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !270, file: !46, line: 94, baseType: !277, size: 32, align: 32, offset: 1216)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !270, file: !46, line: 96, baseType: !319, size: 64, align: 64, offset: 1280)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !270, file: !46, line: 97, baseType: !216, size: 8, align: 8, offset: 1344)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !270, file: !46, line: 100, baseType: !324, size: 64, align: 64, offset: 1408)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !46, line: 73, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !46, line: 65, size: 704, align: 64, elements: !327)
!327 = !{!328, !338, !339, !340, !341, !342, !343}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !326, file: !46, line: 66, baseType: !329, size: 128, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !330, line: 31, baseType: !331)
!330 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !332, line: 30, size: 128, align: 64, elements: !333)
!332 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!333 = !{!334, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !331, file: !332, line: 32, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !105, line: 139, baseType: !106)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !331, file: !332, line: 33, baseType: !337, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !105, line: 141, baseType: !106)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !326, file: !46, line: 67, baseType: !216, size: 8, align: 8, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !326, file: !46, line: 68, baseType: !329, size: 128, align: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !326, file: !46, line: 69, baseType: !216, size: 8, align: 8, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !326, file: !46, line: 70, baseType: !329, size: 128, align: 64, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !326, file: !46, line: 71, baseType: !329, size: 128, align: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !326, file: !46, line: 72, baseType: !78, size: 32, align: 32, offset: 640)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !270, file: !46, line: 101, baseType: !216, size: 8, align: 8, offset: 1472)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !270, file: !46, line: 102, baseType: !78, size: 32, align: 32, offset: 1504)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !270, file: !46, line: 103, baseType: !254, size: 32, align: 32, offset: 1536)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !270, file: !46, line: 104, baseType: !254, size: 32, align: 32, offset: 1568)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !270, file: !46, line: 105, baseType: !254, size: 32, align: 32, offset: 1600)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !270, file: !46, line: 107, baseType: !62, size: 32, align: 32, offset: 1632)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !270, file: !46, line: 109, baseType: !216, size: 8, align: 8, offset: 1664)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !270, file: !46, line: 110, baseType: !47, size: 64, align: 64, offset: 1728)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track_primary", scope: !198, file: !4, line: 189, baseType: !216, size: 8, align: 8, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !198, file: !4, line: 190, baseType: !216, size: 8, align: 8, offset: 328)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "skip_check_adv_addr", scope: !198, file: !4, line: 191, baseType: !216, size: 8, align: 8, offset: 336)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "strict_mode", scope: !198, file: !4, line: 193, baseType: !62, size: 32, align: 32, offset: 352)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_flags", scope: !198, file: !4, line: 195, baseType: !127, size: 64, align: 64, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_ifname", scope: !198, file: !4, line: 196, baseType: !273, size: 128, align: 8, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !198, file: !4, line: 198, baseType: !47, size: 64, align: 64, offset: 576)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !198, file: !4, line: 199, baseType: !47, size: 64, align: 64, offset: 640)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !198, file: !4, line: 200, baseType: !47, size: 64, align: 64, offset: 704)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_if_fault", scope: !198, file: !4, line: 204, baseType: !62, size: 32, align: 32, offset: 768)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_init", scope: !198, file: !4, line: 205, baseType: !62, size: 32, align: 32, offset: 800)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !198, file: !4, line: 206, baseType: !364, size: 1024, align: 64, offset: 832)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !365, line: 166, size: 1024, align: 64, elements: !366)
!365 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!366 = !{!367, !368, !372}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !364, file: !365, line: 168, baseType: !201, size: 16, align: 16)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !364, file: !365, line: 169, baseType: !369, size: 944, align: 8, offset: 16)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 944, align: 8, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 118)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !364, file: !365, line: 170, baseType: !127, size: 64, align: 64, offset: 960)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "saddr_from_config", scope: !198, file: !4, line: 207, baseType: !216, size: 8, align: 8, offset: 1856)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "track_saddr", scope: !198, file: !4, line: 208, baseType: !216, size: 8, align: 8, offset: 1864)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_saddr", scope: !198, file: !4, line: 209, baseType: !364, size: 1024, align: 64, offset: 1920)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_peer", scope: !198, file: !4, line: 210, baseType: !47, size: 64, align: 64, offset: 2944)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_chksum_compat", scope: !198, file: !4, line: 212, baseType: !378, size: 32, align: 32, offset: 3008)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "chksum_compatibility_t", file: !4, line: 179, baseType: !3)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "master_saddr", scope: !198, file: !4, line: 214, baseType: !364, size: 1024, align: 64, offset: 3072)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "master_priority", scope: !198, file: !4, line: 215, baseType: !292, size: 8, align: 8, offset: 4096)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "last_transition", scope: !198, file: !4, line: 216, baseType: !329, size: 128, align: 64, offset: 4160)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !198, file: !4, line: 217, baseType: !62, size: 32, align: 32, offset: 4288)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh", scope: !198, file: !4, line: 218, baseType: !329, size: 128, align: 64, offset: 4352)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_timer", scope: !198, file: !4, line: 219, baseType: !329, size: 128, align: 64, offset: 4480)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "garp_rep", scope: !198, file: !4, line: 220, baseType: !62, size: 32, align: 32, offset: 4608)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_rep", scope: !198, file: !4, line: 221, baseType: !62, size: 32, align: 32, offset: 4640)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_delay", scope: !198, file: !4, line: 222, baseType: !62, size: 32, align: 32, offset: 4672)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "garp_pending", scope: !198, file: !4, line: 223, baseType: !216, size: 8, align: 8, offset: 4704)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "gna_pending", scope: !198, file: !4, line: 224, baseType: !216, size: 8, align: 8, offset: 4712)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_rep", scope: !198, file: !4, line: 225, baseType: !62, size: 32, align: 32, offset: 4736)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "lower_prio_no_advert", scope: !198, file: !4, line: 226, baseType: !62, size: 32, align: 32, offset: 4768)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "higher_prio_send_advert", scope: !198, file: !4, line: 227, baseType: !62, size: 32, align: 32, offset: 4800)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "vrid", scope: !198, file: !4, line: 228, baseType: !292, size: 8, align: 8, offset: 4832)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "base_priority", scope: !198, file: !4, line: 229, baseType: !292, size: 8, align: 8, offset: 4840)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "effective_priority", scope: !198, file: !4, line: 230, baseType: !292, size: 8, align: 8, offset: 4848)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "total_priority", scope: !198, file: !4, line: 231, baseType: !78, size: 32, align: 32, offset: 4864)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "vipset", scope: !198, file: !4, line: 233, baseType: !216, size: 8, align: 8, offset: 4896)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !198, file: !4, line: 234, baseType: !47, size: 64, align: 64, offset: 4928)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "evip", scope: !198, file: !4, line: 235, baseType: !47, size: 64, align: 64, offset: 4992)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries", scope: !198, file: !4, line: 239, baseType: !216, size: 8, align: 8, offset: 5056)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "evip_add_ipv6", scope: !198, file: !4, line: 240, baseType: !216, size: 8, align: 8, offset: 5064)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "vroutes", scope: !198, file: !4, line: 241, baseType: !47, size: 64, align: 64, offset: 5120)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "vrules", scope: !198, file: !4, line: 242, baseType: !47, size: 64, align: 64, offset: 5184)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "adver_int", scope: !198, file: !4, line: 243, baseType: !62, size: 32, align: 32, offset: 5248)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "master_adver_int", scope: !198, file: !4, line: 244, baseType: !62, size: 32, align: 32, offset: 5280)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !198, file: !4, line: 249, baseType: !62, size: 32, align: 32, offset: 5312)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_rx_buf_size", scope: !198, file: !4, line: 252, baseType: !125, size: 64, align: 64, offset: 5376)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rules_set", scope: !198, file: !4, line: 254, baseType: !216, size: 8, align: 8, offset: 5440)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "nopreempt", scope: !198, file: !4, line: 255, baseType: !216, size: 8, align: 8, offset: 5448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_delay", scope: !198, file: !4, line: 256, baseType: !127, size: 64, align: 64, offset: 5504)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_time", scope: !198, file: !4, line: 260, baseType: !329, size: 128, align: 64, offset: 5568)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !198, file: !4, line: 261, baseType: !78, size: 32, align: 32, offset: 5696)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "wantstate", scope: !198, file: !4, line: 265, baseType: !78, size: 32, align: 32, offset: 5728)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "reload_master", scope: !198, file: !4, line: 266, baseType: !216, size: 8, align: 8, offset: 5760)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sockets", scope: !198, file: !4, line: 267, baseType: !416, size: 64, align: 64, offset: 5824)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_t", file: !418, line: 50, baseType: !419)
!418 = !DIFile(filename: "./../include/vrrp_sock.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sock", file: !418, line: 40, size: 1344, align: 64, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428, !429}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !419, file: !418, line: 41, baseType: !201, size: 16, align: 16)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !419, file: !418, line: 42, baseType: !364, size: 1024, align: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !419, file: !418, line: 43, baseType: !78, size: 32, align: 32, offset: 1088)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !419, file: !418, line: 44, baseType: !277, size: 32, align: 32, offset: 1120)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "unicast", scope: !419, file: !418, line: 45, baseType: !216, size: 8, align: 8, offset: 1152)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "fd_in", scope: !419, file: !418, line: 46, baseType: !78, size: 32, align: 32, offset: 1184)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "fd_out", scope: !419, file: !418, line: 47, baseType: !78, size: 32, align: 32, offset: 1216)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_size", scope: !419, file: !418, line: 48, baseType: !78, size: 32, align: 32, offset: 1248)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !419, file: !418, line: 49, baseType: !430, size: 64, align: 64, offset: 1280)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !12, line: 99, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !12, line: 78, size: 768, align: 64, elements: !433)
!433 = !{!434, !435, !437, !490, !495, !496, !497, !509, !511}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !432, file: !12, line: 79, baseType: !127, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !432, file: !12, line: 80, baseType: !436, size: 32, align: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !12, line: 63, baseType: !11)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !432, file: !12, line: 81, baseType: !438, size: 64, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !12, line: 112, size: 1280, align: 64, elements: !440)
!440 = !{!441, !453, !454, !455, !456, !464, !465, !466, !467, !468, !471, !482, !483, !484, !485, !486, !487, !488, !489}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !439, file: !12, line: 113, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !443, line: 109, baseType: !444)
!443 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !443, line: 106, size: 64, align: 64, elements: !445)
!445 = !{!446}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !444, file: !443, line: 108, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !443, line: 97, size: 192, align: 64, elements: !449)
!449 = !{!450, !451, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !448, file: !443, line: 99, baseType: !127, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !448, file: !443, line: 102, baseType: !447, size: 64, align: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !448, file: !443, line: 103, baseType: !447, size: 64, align: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !439, file: !12, line: 114, baseType: !442, size: 64, align: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !439, file: !12, line: 115, baseType: !442, size: 64, align: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !439, file: !12, line: 116, baseType: !442, size: 64, align: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !439, file: !12, line: 117, baseType: !457, size: 128, align: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !458, line: 62, baseType: !459)
!458 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !458, line: 60, size: 128, align: 64, elements: !460)
!460 = !{!461, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !459, file: !458, line: 61, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !459, file: !458, line: 61, baseType: !462, size: 64, align: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !439, file: !12, line: 121, baseType: !457, size: 128, align: 64, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !439, file: !12, line: 122, baseType: !457, size: 128, align: 64, offset: 512)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !439, file: !12, line: 124, baseType: !47, size: 64, align: 64, offset: 640)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !439, file: !12, line: 127, baseType: !442, size: 64, align: 64, offset: 704)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !439, file: !12, line: 128, baseType: !469, size: 64, align: 64, offset: 768)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !12, line: 128, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !439, file: !12, line: 129, baseType: !472, size: 64, align: 64, offset: 832)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !12, line: 109, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !12, line: 102, size: 448, align: 64, elements: !475)
!475 = !{!476, !477, !478, !479, !480}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !474, file: !12, line: 103, baseType: !430, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !474, file: !12, line: 104, baseType: !430, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !474, file: !12, line: 105, baseType: !127, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !474, file: !12, line: 106, baseType: !78, size: 32, align: 32, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !474, file: !12, line: 108, baseType: !481, size: 192, align: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !443, line: 104, baseType: !448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !439, file: !12, line: 130, baseType: !62, size: 32, align: 32, offset: 896)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !439, file: !12, line: 131, baseType: !62, size: 32, align: 32, offset: 928)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !439, file: !12, line: 132, baseType: !78, size: 32, align: 32, offset: 960)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !439, file: !12, line: 135, baseType: !78, size: 32, align: 32, offset: 992)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !439, file: !12, line: 136, baseType: !430, size: 64, align: 64, offset: 1024)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !439, file: !12, line: 146, baseType: !127, size: 64, align: 64, offset: 1088)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !439, file: !12, line: 147, baseType: !127, size: 64, align: 64, offset: 1152)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !439, file: !12, line: 148, baseType: !216, size: 8, align: 8, offset: 1216)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !432, file: !12, line: 82, baseType: !491, size: 64, align: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!78, !494}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !432, file: !12, line: 83, baseType: !59, size: 64, align: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !432, file: !12, line: 84, baseType: !329, size: 128, align: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !432, file: !12, line: 92, baseType: !498, size: 64, align: 32, offset: 448)
!498 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !432, file: !12, line: 85, size: 64, align: 32, elements: !499)
!499 = !{!500, !501, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !498, file: !12, line: 86, baseType: !78, size: 32, align: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !498, file: !12, line: 87, baseType: !78, size: 32, align: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !498, file: !12, line: 91, baseType: !503, size: 64, align: 32)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !498, file: !12, line: 88, size: 64, align: 32, elements: !504)
!504 = !{!505, !508}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !503, file: !12, line: 89, baseType: !506, size: 32, align: 32)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !234, line: 98, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !105, line: 133, baseType: !78)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !503, file: !12, line: 90, baseType: !78, size: 32, align: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !432, file: !12, line: 93, baseType: !510, size: 64, align: 64, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, scope: !432, file: !12, line: 95, baseType: !512, size: 192, align: 64, offset: 576)
!512 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !432, file: !12, line: 95, size: 192, align: 64, elements: !513)
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !512, file: !12, line: 96, baseType: !481, size: 192, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !512, file: !12, line: 97, baseType: !457, size: 128, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !198, file: !4, line: 269, baseType: !78, size: 32, align: 32, offset: 5888)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !198, file: !4, line: 271, baseType: !78, size: 32, align: 32, offset: 5920)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !198, file: !4, line: 274, baseType: !78, size: 32, align: 32, offset: 5952)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !198, file: !4, line: 275, baseType: !78, size: 32, align: 32, offset: 5984)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !198, file: !4, line: 276, baseType: !216, size: 8, align: 8, offset: 6016)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !198, file: !4, line: 277, baseType: !223, size: 64, align: 64, offset: 6080)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !198, file: !4, line: 278, baseType: !223, size: 64, align: 64, offset: 6144)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !198, file: !4, line: 279, baseType: !223, size: 64, align: 64, offset: 6208)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !198, file: !4, line: 280, baseType: !223, size: 64, align: 64, offset: 6272)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "script_master_rx_lower_pri", scope: !198, file: !4, line: 281, baseType: !223, size: 64, align: 64, offset: 6336)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !198, file: !4, line: 282, baseType: !223, size: 64, align: 64, offset: 6400)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ms_down_timer", scope: !198, file: !4, line: 285, baseType: !254, size: 32, align: 32, offset: 6464)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !198, file: !4, line: 286, baseType: !329, size: 128, align: 64, offset: 6528)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !198, file: !4, line: 289, baseType: !80, size: 64, align: 64, offset: 6656)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer_size", scope: !198, file: !4, line: 290, baseType: !125, size: 64, align: 64, offset: 6720)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_csum", scope: !198, file: !4, line: 291, baseType: !254, size: 32, align: 32, offset: 6784)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "auth_type", scope: !198, file: !4, line: 295, baseType: !292, size: 8, align: 8, offset: 6816)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "auth_data", scope: !198, file: !4, line: 296, baseType: !534, size: 64, align: 8, offset: 6824)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 64, align: 8, elements: !297)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ipsecah_counter", scope: !198, file: !4, line: 299, baseType: !536, size: 64, align: 32, offset: 6912)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_counter_t", file: !537, line: 58, baseType: !538)
!537 = !DIFile(filename: "./../include/vrrp_ipsecah.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seq_counter", file: !537, line: 55, size: 64, align: 32, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !538, file: !537, line: 56, baseType: !216, size: 8, align: 8)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "seq_number", scope: !538, file: !537, line: 57, baseType: !254, size: 32, align: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !198, file: !4, line: 309, baseType: !78, size: 32, align: 32, offset: 6976)
!543 = !DILocation(line: 56, column: 10, scope: !187)
!544 = !DILocalVariable(name: "e", scope: !187, file: !137, line: 57, type: !545)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "element", file: !48, line: 30, baseType: !53)
!546 = !DILocation(line: 57, column: 10, scope: !187)
!547 = !DILocation(line: 59, column: 13, scope: !187)
!548 = !DILocation(line: 59, column: 45, scope: !187)
!549 = !DILocation(line: 59, column: 53, scope: !187)
!550 = !DILocation(line: 59, column: 2, scope: !187)
!551 = !DILocation(line: 60, column: 6, scope: !552)
!552 = distinct !DILexicalBlock(scope: !187, file: !137, line: 60, column: 6)
!553 = !DILocation(line: 60, column: 14, scope: !552)
!554 = !DILocation(line: 60, column: 6, scope: !187)
!555 = !DILocation(line: 61, column: 14, scope: !556)
!556 = distinct !DILexicalBlock(scope: !552, file: !137, line: 60, column: 30)
!557 = !DILocation(line: 61, column: 53, scope: !556)
!558 = !DILocation(line: 61, column: 61, scope: !556)
!559 = !DILocation(line: 61, column: 78, scope: !556)
!560 = !DILocation(line: 61, column: 3, scope: !556)
!561 = !DILocation(line: 62, column: 16, scope: !562)
!562 = distinct !DILexicalBlock(scope: !556, file: !137, line: 62, column: 3)
!563 = !DILocation(line: 62, column: 24, scope: !562)
!564 = !DILocation(line: 62, column: 15, scope: !562)
!565 = !DILocation(line: 62, column: 45, scope: !566)
!566 = !DILexicalBlockFile(scope: !562, file: !137, discriminator: 1)
!567 = !DILocation(line: 62, column: 53, scope: !566)
!568 = !DILocation(line: 62, column: 44, scope: !566)
!569 = !DILocation(line: 62, column: 43, scope: !566)
!570 = !DILocation(line: 62, column: 43, scope: !571)
!571 = !DILexicalBlockFile(scope: !562, file: !137, discriminator: 2)
!572 = !DILocation(line: 62, column: 5, scope: !573)
!573 = !DILexicalBlockFile(scope: !562, file: !137, discriminator: 3)
!574 = !DILocation(line: 62, column: 13, scope: !573)
!575 = !DILocation(line: 62, column: 30, scope: !573)
!576 = !DILocation(line: 62, column: 43, scope: !573)
!577 = !DILocation(line: 62, column: 43, scope: !578)
!578 = !DILexicalBlockFile(scope: !562, file: !137, discriminator: 4)
!579 = !DILocation(line: 62, column: 15, scope: !578)
!580 = !DILocation(line: 62, column: 15, scope: !581)
!581 = !DILexicalBlockFile(scope: !562, file: !137, discriminator: 5)
!582 = !DILocation(line: 62, column: 15, scope: !583)
!583 = !DILexicalBlockFile(scope: !562, file: !137, discriminator: 6)
!584 = !DILocation(line: 62, column: 12, scope: !583)
!585 = !DILocation(line: 62, column: 8, scope: !583)
!586 = !DILocation(line: 62, column: 6, scope: !587)
!587 = !DILexicalBlockFile(scope: !588, file: !137, discriminator: 7)
!588 = distinct !DILexicalBlock(scope: !562, file: !137, line: 62, column: 3)
!589 = !DILocation(line: 62, column: 5, scope: !587)
!590 = !DILocation(line: 62, column: 9, scope: !587)
!591 = !DILocation(line: 62, column: 24, scope: !592)
!592 = !DILexicalBlockFile(scope: !588, file: !137, discriminator: 8)
!593 = !DILocation(line: 62, column: 28, scope: !592)
!594 = !DILocation(line: 62, column: 22, scope: !592)
!595 = !DILocation(line: 62, column: 20, scope: !592)
!596 = !DILocation(line: 62, column: 3, scope: !597)
!597 = !DILexicalBlockFile(scope: !562, file: !137, discriminator: 9)
!598 = !DILocation(line: 63, column: 15, scope: !588)
!599 = !DILocation(line: 63, column: 30, scope: !588)
!600 = !DILocation(line: 63, column: 36, scope: !588)
!601 = !DILocation(line: 63, column: 4, scope: !588)
!602 = !DILocation(line: 62, column: 47, scope: !603)
!603 = !DILexicalBlockFile(scope: !588, file: !137, discriminator: 10)
!604 = !DILocation(line: 62, column: 51, scope: !603)
!605 = !DILocation(line: 62, column: 44, scope: !603)
!606 = !DILocation(line: 62, column: 3, scope: !603)
!607 = distinct !{!607, !608}
!608 = !DILocation(line: 62, column: 3, scope: !556)
!609 = !DILocation(line: 64, column: 2, scope: !556)
!610 = !DILocation(line: 65, column: 1, scope: !187)
!611 = distinct !DISubprogram(name: "find_track_group", scope: !137, file: !137, line: 68, type: !612, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !138)
!612 = !DISubroutineType(types: !613)
!613 = !{!143, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!616 = !DILocalVariable(name: "gname", arg: 1, scope: !611, file: !137, line: 68, type: !614)
!617 = !DILocation(line: 68, column: 30, scope: !611)
!618 = !DILocalVariable(name: "e", scope: !611, file: !137, line: 70, type: !545)
!619 = !DILocation(line: 70, column: 10, scope: !611)
!620 = !DILocalVariable(name: "tg", scope: !611, file: !137, line: 71, type: !143)
!621 = !DILocation(line: 71, column: 24, scope: !611)
!622 = !DILocation(line: 73, column: 15, scope: !623)
!623 = distinct !DILexicalBlock(scope: !611, file: !137, line: 73, column: 2)
!624 = !DILocation(line: 73, column: 26, scope: !623)
!625 = !DILocation(line: 73, column: 14, scope: !623)
!626 = !DILocation(line: 73, column: 52, scope: !627)
!627 = !DILexicalBlockFile(scope: !623, file: !137, discriminator: 1)
!628 = !DILocation(line: 73, column: 63, scope: !627)
!629 = !DILocation(line: 73, column: 51, scope: !627)
!630 = !DILocation(line: 73, column: 50, scope: !627)
!631 = !DILocation(line: 73, column: 50, scope: !632)
!632 = !DILexicalBlockFile(scope: !623, file: !137, discriminator: 2)
!633 = !DILocation(line: 73, column: 4, scope: !634)
!634 = !DILexicalBlockFile(scope: !623, file: !137, discriminator: 3)
!635 = !DILocation(line: 73, column: 15, scope: !634)
!636 = !DILocation(line: 73, column: 37, scope: !634)
!637 = !DILocation(line: 73, column: 50, scope: !634)
!638 = !DILocation(line: 73, column: 50, scope: !639)
!639 = !DILexicalBlockFile(scope: !623, file: !137, discriminator: 4)
!640 = !DILocation(line: 73, column: 14, scope: !639)
!641 = !DILocation(line: 73, column: 14, scope: !642)
!642 = !DILexicalBlockFile(scope: !623, file: !137, discriminator: 5)
!643 = !DILocation(line: 73, column: 14, scope: !644)
!644 = !DILexicalBlockFile(scope: !623, file: !137, discriminator: 6)
!645 = !DILocation(line: 73, column: 11, scope: !644)
!646 = !DILocation(line: 73, column: 7, scope: !644)
!647 = !DILocation(line: 73, column: 5, scope: !648)
!648 = !DILexicalBlockFile(scope: !649, file: !137, discriminator: 7)
!649 = distinct !DILexicalBlock(scope: !623, file: !137, line: 73, column: 2)
!650 = !DILocation(line: 73, column: 4, scope: !648)
!651 = !DILocation(line: 73, column: 8, scope: !648)
!652 = !DILocation(line: 73, column: 21, scope: !653)
!653 = !DILexicalBlockFile(scope: !649, file: !137, discriminator: 8)
!654 = !DILocation(line: 73, column: 25, scope: !653)
!655 = !DILocation(line: 73, column: 19, scope: !653)
!656 = !DILocation(line: 73, column: 17, scope: !653)
!657 = !DILocation(line: 73, column: 2, scope: !658)
!658 = !DILexicalBlockFile(scope: !623, file: !137, discriminator: 9)
!659 = !DILocation(line: 74, column: 15, scope: !660)
!660 = distinct !DILexicalBlock(scope: !649, file: !137, line: 74, column: 7)
!661 = !DILocation(line: 74, column: 22, scope: !660)
!662 = !DILocation(line: 74, column: 26, scope: !660)
!663 = !DILocation(line: 74, column: 8, scope: !660)
!664 = !DILocation(line: 74, column: 7, scope: !649)
!665 = !DILocation(line: 75, column: 11, scope: !660)
!666 = !DILocation(line: 75, column: 4, scope: !660)
!667 = !DILocation(line: 74, column: 31, scope: !668)
!668 = !DILexicalBlockFile(scope: !660, file: !137, discriminator: 1)
!669 = !DILocation(line: 73, column: 44, scope: !670)
!670 = !DILexicalBlockFile(scope: !649, file: !137, discriminator: 10)
!671 = !DILocation(line: 73, column: 48, scope: !670)
!672 = !DILocation(line: 73, column: 41, scope: !670)
!673 = !DILocation(line: 73, column: 2, scope: !670)
!674 = distinct !{!674, !675}
!675 = !DILocation(line: 73, column: 2, scope: !611)
!676 = !DILocation(line: 77, column: 2, scope: !611)
!677 = !DILocation(line: 78, column: 1, scope: !611)
!678 = distinct !DISubprogram(name: "static_track_group_init", scope: !137, file: !137, line: 110, type: !679, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !138)
!679 = !DISubroutineType(types: !680)
!680 = !{null}
!681 = !DILocalVariable(name: "tg", scope: !678, file: !137, line: 112, type: !143)
!682 = !DILocation(line: 112, column: 24, scope: !678)
!683 = !DILocalVariable(name: "vrrp", scope: !678, file: !137, line: 113, type: !196)
!684 = !DILocation(line: 113, column: 10, scope: !678)
!685 = !DILocalVariable(name: "addr", scope: !678, file: !137, line: 114, type: !686)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_address_t", file: !688, line: 73, baseType: !689)
!688 = !DIFile(filename: "./../include/vrrp_ipaddress.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_address", file: !688, line: 41, size: 704, align: 64, elements: !690)
!690 = !{!691, !703, !712, !713, !714, !715, !716, !717, !722, !723, !724, !725, !726}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ifa", scope: !689, file: !688, line: 42, baseType: !692, size: 64, align: 32)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifaddrmsg", file: !693, line: 7, size: 64, align: 32, elements: !694)
!693 = !DIFile(filename: "/usr/include/linux/if_addr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!694 = !{!695, !698, !699, !700, !701}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_family", scope: !692, file: !693, line: 8, baseType: !696, size: 8, align: 8)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !697, line: 20, baseType: !293)
!697 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_prefixlen", scope: !692, file: !693, line: 9, baseType: !696, size: 8, align: 8, offset: 8)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_flags", scope: !692, file: !693, line: 10, baseType: !696, size: 8, align: 8, offset: 16)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_scope", scope: !692, file: !693, line: 11, baseType: !696, size: 8, align: 8, offset: 24)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_index", scope: !692, file: !693, line: 12, baseType: !702, size: 32, align: 32, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !697, line: 26, baseType: !62)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !689, file: !688, line: 50, baseType: !704, size: 128, align: 32, offset: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !689, file: !688, line: 44, size: 128, align: 32, elements: !705)
!705 = !{!706, !711}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !704, file: !688, line: 48, baseType: !707, size: 64, align: 32)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !688, line: 45, size: 64, align: 32, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !707, file: !688, line: 46, baseType: !279, size: 32, align: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "sin_brd", scope: !707, file: !688, line: 47, baseType: !279, size: 32, align: 32, offset: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !704, file: !688, line: 49, baseType: !285, size: 128, align: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !689, file: !688, line: 52, baseType: !268, size: 64, align: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !689, file: !688, line: 53, baseType: !80, size: 64, align: 64, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !689, file: !688, line: 55, baseType: !254, size: 32, align: 32, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flagmask", scope: !689, file: !688, line: 56, baseType: !254, size: 32, align: 32, offset: 352)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "have_peer", scope: !689, file: !688, line: 61, baseType: !216, size: 8, align: 8, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !689, file: !688, line: 65, baseType: !718, size: 128, align: 32, offset: 416)
!718 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !689, file: !688, line: 62, size: 128, align: 32, elements: !719)
!719 = !{!720, !721}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !718, file: !688, line: 63, baseType: !279, size: 32, align: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !718, file: !688, line: 64, baseType: !285, size: 128, align: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track", scope: !689, file: !688, line: 66, baseType: !216, size: 8, align: 8, offset: 544)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "track_group", scope: !689, file: !688, line: 67, baseType: !143, size: 64, align: 64, offset: 576)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !689, file: !688, line: 69, baseType: !216, size: 8, align: 8, offset: 640)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rule_set", scope: !689, file: !688, line: 70, baseType: !216, size: 8, align: 8, offset: 648)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "garp_gna_pending", scope: !689, file: !688, line: 72, baseType: !216, size: 8, align: 8, offset: 656)
!727 = !DILocation(line: 114, column: 16, scope: !678)
!728 = !DILocalVariable(name: "route", scope: !678, file: !137, line: 116, type: !729)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_route_t", file: !731, line: 239, baseType: !732)
!731 = !DIFile(filename: "./../include/vrrp_iproute.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_route", file: !731, line: 182, size: 1664, align: 64, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !815, !816, !817, !818, !819, !820}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !732, file: !731, line: 183, baseType: !686, size: 64, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !732, file: !731, line: 184, baseType: !686, size: 64, align: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "pref_src", scope: !732, file: !731, line: 185, baseType: !686, size: 64, align: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !732, file: !731, line: 186, baseType: !292, size: 8, align: 8, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !732, file: !731, line: 187, baseType: !292, size: 8, align: 8, offset: 200)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !732, file: !731, line: 188, baseType: !254, size: 32, align: 32, offset: 224)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !732, file: !731, line: 189, baseType: !292, size: 8, align: 8, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !732, file: !731, line: 190, baseType: !292, size: 8, align: 8, offset: 264)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "metric", scope: !732, file: !731, line: 191, baseType: !254, size: 32, align: 32, offset: 288)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "via", scope: !732, file: !731, line: 192, baseType: !686, size: 64, align: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "oif", scope: !732, file: !731, line: 193, baseType: !268, size: 64, align: 64, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !732, file: !731, line: 194, baseType: !254, size: 32, align: 32, offset: 448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !732, file: !731, line: 195, baseType: !254, size: 32, align: 32, offset: 480)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "quickack", scope: !732, file: !731, line: 197, baseType: !216, size: 8, align: 8, offset: 512)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !732, file: !731, line: 202, baseType: !254, size: 32, align: 32, offset: 544)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !732, file: !731, line: 203, baseType: !254, size: 32, align: 32, offset: 576)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "hoplimit", scope: !732, file: !731, line: 204, baseType: !292, size: 8, align: 8, offset: 608)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "advmss", scope: !732, file: !731, line: 205, baseType: !254, size: 32, align: 32, offset: 640)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "rtt", scope: !732, file: !731, line: 209, baseType: !254, size: 32, align: 32, offset: 672)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "rttvar", scope: !732, file: !731, line: 210, baseType: !254, size: 32, align: 32, offset: 704)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "reordering", scope: !732, file: !731, line: 211, baseType: !254, size: 32, align: 32, offset: 736)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !732, file: !731, line: 212, baseType: !254, size: 32, align: 32, offset: 768)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "cwnd", scope: !732, file: !731, line: 213, baseType: !254, size: 32, align: 32, offset: 800)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ssthresh", scope: !732, file: !731, line: 214, baseType: !254, size: 32, align: 32, offset: 832)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "rto_min", scope: !732, file: !731, line: 215, baseType: !254, size: 32, align: 32, offset: 864)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "initcwnd", scope: !732, file: !731, line: 216, baseType: !254, size: 32, align: 32, offset: 896)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "initrwnd", scope: !732, file: !731, line: 217, baseType: !254, size: 32, align: 32, offset: 928)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "congctl", scope: !732, file: !731, line: 219, baseType: !80, size: 64, align: 64, offset: 960)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "pref", scope: !732, file: !731, line: 222, baseType: !292, size: 8, align: 8, offset: 1024)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !732, file: !731, line: 227, baseType: !292, size: 8, align: 8, offset: 1032)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "realms", scope: !732, file: !731, line: 229, baseType: !254, size: 32, align: 32, offset: 1056)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "encap", scope: !732, file: !731, line: 231, baseType: !766, size: 320, align: 64, offset: 1088)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "encap_t", file: !731, line: 116, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_encap", file: !731, line: 103, size: 320, align: 64, elements: !768)
!768 = !{!769, !770, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !767, file: !731, line: 104, baseType: !296, size: 16, align: 16)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !767, file: !731, line: 105, baseType: !254, size: 32, align: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, scope: !767, file: !731, line: 106, baseType: !772, size: 256, align: 64, offset: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !767, file: !731, line: 106, size: 256, align: 64, elements: !773)
!773 = !{!774, !790, !800, !805}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mpls", scope: !772, file: !731, line: 108, baseType: !775, size: 128, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "encap_mpls_t", file: !731, line: 76, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_encap_mpls", file: !731, line: 73, size: 128, align: 64, elements: !777)
!777 = !{!778, !789}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !776, file: !731, line: 74, baseType: !779, size: 64, align: 32)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpls_labels", file: !731, line: 71, baseType: !780)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !781, size: 64, align: 32, elements: !787)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpls_label", file: !782, line: 21, size: 32, align: 32, elements: !783)
!782 = !DIFile(filename: "/usr/include/linux/mpls.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!783 = !{!784}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !781, file: !782, line: 22, baseType: !785, size: 32, align: 32)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !786, line: 30, baseType: !702)
!786 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!787 = !{!788}
!788 = !DISubrange(count: 2)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "num_labels", scope: !776, file: !731, line: 75, baseType: !125, size: 64, align: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !772, file: !731, line: 110, baseType: !791, size: 256, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "encap_ip_t", file: !731, line: 86, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_encap_ip", file: !731, line: 79, size: 256, align: 64, elements: !793)
!793 = !{!794, !795, !796, !797, !798, !799}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !792, file: !731, line: 80, baseType: !251, size: 64, align: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !792, file: !731, line: 81, baseType: !686, size: 64, align: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !792, file: !731, line: 82, baseType: !686, size: 64, align: 64, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !792, file: !731, line: 83, baseType: !292, size: 8, align: 8, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !792, file: !731, line: 84, baseType: !296, size: 16, align: 16, offset: 208)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !792, file: !731, line: 85, baseType: !292, size: 8, align: 8, offset: 224)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ila", scope: !772, file: !731, line: 112, baseType: !801, size: 64, align: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "encap_ila_t", file: !731, line: 91, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_encap_ila", file: !731, line: 89, size: 64, align: 64, elements: !803)
!803 = !{!804}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "locator", scope: !802, file: !731, line: 90, baseType: !251, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !772, file: !731, line: 114, baseType: !806, size: 256, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "encap_ip6_t", file: !731, line: 101, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_encap_ip6", file: !731, line: 94, size: 256, align: 64, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !807, file: !731, line: 95, baseType: !251, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !807, file: !731, line: 96, baseType: !686, size: 64, align: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !807, file: !731, line: 97, baseType: !686, size: 64, align: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !807, file: !731, line: 98, baseType: !292, size: 8, align: 8, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !807, file: !731, line: 99, baseType: !296, size: 16, align: 16, offset: 208)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "hoplimit", scope: !807, file: !731, line: 100, baseType: !292, size: 8, align: 8, offset: 224)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "nhs", scope: !732, file: !731, line: 233, baseType: !47, size: 64, align: 64, offset: 1408)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !732, file: !731, line: 234, baseType: !254, size: 32, align: 32, offset: 1472)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track", scope: !732, file: !731, line: 235, baseType: !216, size: 8, align: 8, offset: 1504)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "track_group", scope: !732, file: !731, line: 236, baseType: !143, size: 64, align: 64, offset: 1536)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !732, file: !731, line: 237, baseType: !216, size: 8, align: 8, offset: 1600)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "configured_ifindex", scope: !732, file: !731, line: 238, baseType: !254, size: 32, align: 32, offset: 1632)
!821 = !DILocation(line: 116, column: 14, scope: !678)
!822 = !DILocalVariable(name: "rule", scope: !678, file: !137, line: 117, type: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_rule_t", file: !825, line: 113, baseType: !826)
!825 = !DIFile(filename: "./../include/vrrp_iprule.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_rule", file: !825, line: 65, size: 1024, align: 64, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !826, file: !825, line: 66, baseType: !254, size: 32, align: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !826, file: !825, line: 67, baseType: !216, size: 8, align: 8, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !826, file: !825, line: 68, baseType: !78, size: 32, align: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "from_addr", scope: !826, file: !825, line: 69, baseType: !686, size: 64, align: 64, offset: 128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "to_addr", scope: !826, file: !825, line: 70, baseType: !686, size: 64, align: 64, offset: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !826, file: !825, line: 71, baseType: !254, size: 32, align: 32, offset: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !826, file: !825, line: 72, baseType: !292, size: 8, align: 8, offset: 288)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "fwmark", scope: !826, file: !825, line: 73, baseType: !254, size: 32, align: 32, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "fwmask", scope: !826, file: !825, line: 74, baseType: !254, size: 32, align: 32, offset: 352)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "realms", scope: !826, file: !825, line: 75, baseType: !254, size: 32, align: 32, offset: 384)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_prefix_len", scope: !826, file: !825, line: 77, baseType: !839, size: 32, align: 32, offset: 416)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !234, line: 196, baseType: !78)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_group", scope: !826, file: !825, line: 80, baseType: !254, size: 32, align: 32, offset: 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "iif", scope: !826, file: !825, line: 82, baseType: !268, size: 64, align: 64, offset: 512)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "oif", scope: !826, file: !825, line: 84, baseType: !268, size: 64, align: 64, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "goto_target", scope: !826, file: !825, line: 86, baseType: !254, size: 32, align: 32, offset: 640)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !826, file: !825, line: 87, baseType: !254, size: 32, align: 32, offset: 672)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !826, file: !825, line: 88, baseType: !292, size: 8, align: 8, offset: 704)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "tunnel_id", scope: !826, file: !825, line: 90, baseType: !251, size: 64, align: 64, offset: 768)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track", scope: !826, file: !825, line: 110, baseType: !216, size: 8, align: 8, offset: 832)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "track_group", scope: !826, file: !825, line: 111, baseType: !143, size: 64, align: 64, offset: 896)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !826, file: !825, line: 112, baseType: !216, size: 8, align: 8, offset: 960)
!850 = !DILocation(line: 117, column: 13, scope: !678)
!851 = !DILocalVariable(name: "e", scope: !678, file: !137, line: 119, type: !545)
!852 = !DILocation(line: 119, column: 10, scope: !678)
!853 = !DILocalVariable(name: "e1", scope: !678, file: !137, line: 119, type: !545)
!854 = !DILocation(line: 119, column: 13, scope: !678)
!855 = !DILocalVariable(name: "next", scope: !678, file: !137, line: 119, type: !545)
!856 = !DILocation(line: 119, column: 17, scope: !678)
!857 = !DILocation(line: 121, column: 15, scope: !858)
!858 = distinct !DILexicalBlock(scope: !678, file: !137, line: 121, column: 2)
!859 = !DILocation(line: 121, column: 26, scope: !858)
!860 = !DILocation(line: 121, column: 14, scope: !858)
!861 = !DILocation(line: 121, column: 52, scope: !862)
!862 = !DILexicalBlockFile(scope: !858, file: !137, discriminator: 1)
!863 = !DILocation(line: 121, column: 63, scope: !862)
!864 = !DILocation(line: 121, column: 51, scope: !862)
!865 = !DILocation(line: 121, column: 50, scope: !862)
!866 = !DILocation(line: 121, column: 50, scope: !867)
!867 = !DILexicalBlockFile(scope: !858, file: !137, discriminator: 2)
!868 = !DILocation(line: 121, column: 4, scope: !869)
!869 = !DILexicalBlockFile(scope: !858, file: !137, discriminator: 3)
!870 = !DILocation(line: 121, column: 15, scope: !869)
!871 = !DILocation(line: 121, column: 37, scope: !869)
!872 = !DILocation(line: 121, column: 50, scope: !869)
!873 = !DILocation(line: 121, column: 50, scope: !874)
!874 = !DILexicalBlockFile(scope: !858, file: !137, discriminator: 4)
!875 = !DILocation(line: 121, column: 14, scope: !874)
!876 = !DILocation(line: 121, column: 14, scope: !877)
!877 = !DILexicalBlockFile(scope: !858, file: !137, discriminator: 5)
!878 = !DILocation(line: 121, column: 14, scope: !879)
!879 = !DILexicalBlockFile(scope: !858, file: !137, discriminator: 6)
!880 = !DILocation(line: 121, column: 11, scope: !879)
!881 = !DILocation(line: 121, column: 7, scope: !879)
!882 = !DILocation(line: 121, column: 5, scope: !883)
!883 = !DILexicalBlockFile(scope: !884, file: !137, discriminator: 7)
!884 = distinct !DILexicalBlock(scope: !858, file: !137, line: 121, column: 2)
!885 = !DILocation(line: 121, column: 4, scope: !883)
!886 = !DILocation(line: 121, column: 8, scope: !883)
!887 = !DILocation(line: 121, column: 22, scope: !888)
!888 = !DILexicalBlockFile(scope: !884, file: !137, discriminator: 8)
!889 = !DILocation(line: 121, column: 26, scope: !888)
!890 = !DILocation(line: 121, column: 19, scope: !888)
!891 = !DILocation(line: 121, column: 41, scope: !888)
!892 = !DILocation(line: 121, column: 45, scope: !888)
!893 = !DILocation(line: 121, column: 39, scope: !888)
!894 = !DILocation(line: 121, column: 37, scope: !888)
!895 = !DILocation(line: 121, column: 2, scope: !896)
!896 = !DILexicalBlockFile(scope: !858, file: !137, discriminator: 9)
!897 = !DILocation(line: 122, column: 8, scope: !898)
!898 = distinct !DILexicalBlock(scope: !899, file: !137, line: 122, column: 7)
!899 = distinct !DILexicalBlock(scope: !884, file: !137, line: 121, column: 70)
!900 = !DILocation(line: 122, column: 12, scope: !898)
!901 = !DILocation(line: 122, column: 7, scope: !899)
!902 = !DILocation(line: 123, column: 107, scope: !903)
!903 = distinct !DILexicalBlock(scope: !898, file: !137, line: 122, column: 19)
!904 = !DILocation(line: 123, column: 111, scope: !903)
!905 = !DILocation(line: 123, column: 25, scope: !903)
!906 = !DILocation(line: 124, column: 43, scope: !903)
!907 = !DILocation(line: 124, column: 54, scope: !903)
!908 = !DILocation(line: 124, column: 75, scope: !903)
!909 = !DILocation(line: 124, column: 25, scope: !903)
!910 = !DILocation(line: 125, column: 25, scope: !903)
!911 = !DILocation(line: 128, column: 26, scope: !899)
!912 = !DILocation(line: 128, column: 3, scope: !899)
!913 = !DILocation(line: 130, column: 8, scope: !914)
