; ModuleID = './[inter]keepalived--vrrp--vrrp_parser.o.i'
source_filename = "./[inter]keepalived--vrrp--vrrp_parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._vector = type { i32, i32, i8** }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._vrrp_data = type { %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list* }
%struct._data = type { i8*, i8, i8*, i8, i8*, i8*, %struct.sockaddr_storage, i8*, i64, %struct._list*, i32, i8, i8, i32, i8*, %struct._interface*, i32, i32, i32, i32, %struct.lvs_syncd_config, i8, %struct.sockaddr_in, %struct.sockaddr_in6, i32, %struct.timeval, i32, i32, i32, i32, i32, i32, i8, i8, i32, [29 x i8], [29 x i8], i8, [32 x i8], [32 x i8], [32 x i8], i8, i8, i8, i8, i8, i8, i32, i64, i8, i8, i8, i32, i64, %struct._notify_fifo, %struct._notify_fifo, %struct._notify_fifo, i32, i8, i32, i8, i32, i8, i32, i8, i8, i8, i32, i64, i32 }

!66 = !DIEnumerator(name: "SCRIPT_STATE_REQUESTING_TERMINATION", value: 2)
!67 = !DIEnumerator(name: "SCRIPT_STATE_FORCING_TERMINATION", value: 3)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 52, size: 32, align: 32, elements: !69)
!69 = !{!70, !71, !72}
!70 = !DIEnumerator(name: "SCRIPT_INIT_STATE_DONE", value: 0)
!71 = !DIEnumerator(name: "SCRIPT_INIT_STATE_INIT", value: 1)
!72 = !DIEnumerator(name: "SCRIPT_INIT_STATE_FAILED", value: 2)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !74, line: 66, size: 32, align: 32, elements: !75)
!74 = !DIFile(filename: "vrrp_parser.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!75 = !{!76, !77, !78}
!76 = !DIEnumerator(name: "TRACK_FILE_NO_INIT", value: 0)
!77 = !DIEnumerator(name: "TRACK_FILE_CREATE", value: 1)
!78 = !DIEnumerator(name: "TRACK_FILE_INIT", value: 2)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !80, line: 46, size: 32, align: 32, elements: !81)
!80 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!82 = !DIEnumerator(name: "_ISupper", value: 256)
!83 = !DIEnumerator(name: "_ISlower", value: 512)
!84 = !DIEnumerator(name: "_ISalpha", value: 1024)
!85 = !DIEnumerator(name: "_ISdigit", value: 2048)
!86 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!87 = !DIEnumerator(name: "_ISspace", value: 8192)
!88 = !DIEnumerator(name: "_ISprint", value: 16384)
!89 = !DIEnumerator(name: "_ISgraph", value: 32768)
!90 = !DIEnumerator(name: "_ISblank", value: 1)
!91 = !DIEnumerator(name: "_IScntrl", value: 2)
!92 = !DIEnumerator(name: "_ISpunct", value: 4)
!93 = !DIEnumerator(name: "_ISalnum", value: 8)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "global_bits", file: !95, line: 53, size: 32, align: 32, elements: !96)
!95 = !DIFile(filename: "../../lib/bitops.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108}
!97 = !DIEnumerator(name: "LOG_CONSOLE_BIT", value: 0)
!98 = !DIEnumerator(name: "NO_SYSLOG_BIT", value: 1)
!99 = !DIEnumerator(name: "DONT_FORK_BIT", value: 2)
!100 = !DIEnumerator(name: "DUMP_CONF_BIT", value: 3)
!101 = !DIEnumerator(name: "DONT_RELEASE_VRRP_BIT", value: 4)
!102 = !DIEnumerator(name: "RELEASE_VIPS_BIT", value: 5)
!103 = !DIEnumerator(name: "DONT_RELEASE_IPVS_BIT", value: 6)
!104 = !DIEnumerator(name: "LOG_DETAIL_BIT", value: 7)
!105 = !DIEnumerator(name: "LOG_EXTRA_DETAIL_BIT", value: 8)
!106 = !DIEnumerator(name: "DONT_RESPAWN_BIT", value: 9)
!107 = !DIEnumerator(name: "LOG_ADDRESS_CHANGES", value: 10)
!108 = !DIEnumerator(name: "CONFIG_TEST_BIT", value: 11)
!109 = !{!110, !111, !113, !118, !121, !124, !125, !126, !127, !128}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !114, line: 75, baseType: !115)
!114 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !116, line: 139, baseType: !117)
!116 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!117 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "suseconds_t", file: !119, line: 140, baseType: !120)
!119 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !116, line: 141, baseType: !117)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !122, line: 48, baseType: !123)
!122 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!123 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!125 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!126 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!127 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!128 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!129 = !{!130, !208, !209, !210, !211}
!130 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !20, line: 150, type: !131, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !132, line: 31, baseType: !133)
!132 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !132, line: 39, size: 320, align: 64, elements: !135)
!135 = !{!136, !143, !144, !145, !149}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !134, file: !132, line: 40, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !132, line: 33, size: 192, align: 64, elements: !139)
!139 = !{!140, !141, !142}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !138, file: !132, line: 34, baseType: !137, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !138, file: !132, line: 35, baseType: !137, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !138, file: !132, line: 36, baseType: !110, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !134, file: !132, line: 41, baseType: !137, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !134, file: !132, line: 42, baseType: !124, size: 32, align: 32, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !134, file: !132, line: 43, baseType: !146, size: 64, align: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !110}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !134, file: !132, line: 44, baseType: !150, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{null, !153, !110}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !155, line: 48, baseType: !156)
!155 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !157, line: 241, size: 1728, align: 64, elements: !158)
!157 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !179, !180, !181, !182, !184, !185, !187, !191, !194, !196, !197, !198, !199, !200, !203, !204}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !156, file: !157, line: 242, baseType: !127, size: 32, align: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !156, file: !157, line: 247, baseType: !111, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !156, file: !157, line: 248, baseType: !111, size: 64, align: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !156, file: !157, line: 249, baseType: !111, size: 64, align: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !156, file: !157, line: 250, baseType: !111, size: 64, align: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !156, file: !157, line: 251, baseType: !111, size: 64, align: 64, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !156, file: !157, line: 252, baseType: !111, size: 64, align: 64, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !156, file: !157, line: 253, baseType: !111, size: 64, align: 64, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !156, file: !157, line: 254, baseType: !111, size: 64, align: 64, offset: 512)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !156, file: !157, line: 256, baseType: !111, size: 64, align: 64, offset: 576)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !156, file: !157, line: 257, baseType: !111, size: 64, align: 64, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !156, file: !157, line: 258, baseType: !111, size: 64, align: 64, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !156, file: !157, line: 260, baseType: !172, size: 64, align: 64, offset: 768)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !157, line: 156, size: 192, align: 64, elements: !174)
!174 = !{!175, !176, !178}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !173, file: !157, line: 157, baseType: !172, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !173, file: !157, line: 158, baseType: !177, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !173, file: !157, line: 162, baseType: !127, size: 32, align: 32, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !156, file: !157, line: 262, baseType: !177, size: 64, align: 64, offset: 832)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !156, file: !157, line: 264, baseType: !127, size: 32, align: 32, offset: 896)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !156, file: !157, line: 268, baseType: !127, size: 32, align: 32, offset: 928)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !156, file: !157, line: 270, baseType: !183, size: 64, align: 64, offset: 960)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !116, line: 131, baseType: !117)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !156, file: !157, line: 274, baseType: !128, size: 16, align: 16, offset: 1024)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !156, file: !157, line: 275, baseType: !186, size: 8, align: 8, offset: 1040)
!186 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !156, file: !157, line: 276, baseType: !188, size: 8, align: 8, offset: 1048)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 8, align: 8, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 1)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !156, file: !157, line: 280, baseType: !192, size: 64, align: 64, offset: 1088)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !157, line: 150, baseType: null)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !156, file: !157, line: 289, baseType: !195, size: 64, align: 64, offset: 1152)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !116, line: 132, baseType: !117)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !156, file: !157, line: 297, baseType: !110, size: 64, align: 64, offset: 1216)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !156, file: !157, line: 298, baseType: !110, size: 64, align: 64, offset: 1280)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !156, file: !157, line: 299, baseType: !110, size: 64, align: 64, offset: 1344)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !156, file: !157, line: 300, baseType: !110, size: 64, align: 64, offset: 1408)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !156, file: !157, line: 302, baseType: !201, size: 64, align: 64, offset: 1472)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !202, line: 216, baseType: !126)
!202 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !156, file: !157, line: 303, baseType: !127, size: 32, align: 32, offset: 1536)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !156, file: !157, line: 305, baseType: !205, size: 160, align: 8, offset: 1568)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 160, align: 8, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 20)
!208 = distinct !DIGlobalVariable(name: "script_user_set", scope: !0, file: !74, line: 73, type: !125, isLocal: true, isDefinition: true, variable: i8* @script_user_set)
!209 = distinct !DIGlobalVariable(name: "remove_script", scope: !0, file: !74, line: 74, type: !125, isLocal: true, isDefinition: true, variable: i8* @remove_script)
!210 = distinct !DIGlobalVariable(name: "track_file_init", scope: !0, file: !74, line: 70, type: !73, isLocal: true, isDefinition: true, variable: i32* @track_file_init)
!211 = distinct !DIGlobalVariable(name: "track_file_init_value", scope: !0, file: !74, line: 71, type: !127, isLocal: true, isDefinition: true, variable: i32* @track_file_init_value)
!212 = !{i32 2, !"Dwarf Version", i32 4}
!213 = !{i32 2, !"Debug Info Version", i32 3}
!214 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!215 = distinct !DISubprogram(name: "init_vrrp_keywords", scope: !74, file: !74, line: 1388, type: !216, isLocal: false, isDefinition: true, scopeLine: 1389, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !125}
!218 = !{}
!219 = !DILocalVariable(name: "active", arg: 1, scope: !215, file: !74, line: 1388, type: !125)
!220 = !DIExpression()
!221 = !DILocation(line: 1388, column: 24, scope: !215)
!222 = !DILocation(line: 1391, column: 67, scope: !215)
!223 = !DILocation(line: 1391, column: 2, scope: !215)
!224 = !DILocation(line: 1392, column: 2, scope: !215)
!225 = !DILocation(line: 1393, column: 70, scope: !215)
!226 = !DILocation(line: 1393, column: 2, scope: !215)
!227 = !DILocation(line: 1395, column: 64, scope: !215)
!228 = !DILocation(line: 1395, column: 2, scope: !215)
!229 = !DILocation(line: 1396, column: 62, scope: !215)
!230 = !DILocation(line: 1396, column: 2, scope: !215)
!231 = !DILocation(line: 1400, column: 68, scope: !215)
!232 = !DILocation(line: 1400, column: 2, scope: !215)
!233 = !DILocation(line: 1401, column: 2, scope: !215)
!234 = !DILocation(line: 1402, column: 2, scope: !215)
!235 = !DILocation(line: 1403, column: 2, scope: !215)
!236 = !DILocation(line: 1404, column: 2, scope: !215)
!237 = !DILocation(line: 1408, column: 2, scope: !215)
!238 = !DILocation(line: 1409, column: 2, scope: !215)
!239 = !DILocation(line: 1410, column: 2, scope: !215)
!240 = !DILocation(line: 1411, column: 2, scope: !215)
!241 = !DILocation(line: 1412, column: 2, scope: !215)
!242 = !DILocation(line: 1413, column: 2, scope: !215)
!243 = !DILocation(line: 1414, column: 2, scope: !215)
!244 = !DILocation(line: 1415, column: 2, scope: !215)
!245 = !DILocation(line: 1417, column: 58, scope: !215)
!246 = !DILocation(line: 1417, column: 2, scope: !215)
!247 = !DILocation(line: 1418, column: 2, scope: !215)
!248 = !DILocation(line: 1419, column: 2, scope: !215)
!249 = !DILocation(line: 1420, column: 2, scope: !215)
!250 = !DILocation(line: 1421, column: 2, scope: !215)
!251 = !DILocation(line: 1422, column: 2, scope: !215)
!252 = !DILocation(line: 1425, column: 55, scope: !215)
!253 = !DILocation(line: 1425, column: 2, scope: !215)
!254 = !DILocation(line: 1427, column: 2, scope: !215)
!255 = !DILocation(line: 1428, column: 2, scope: !215)
!256 = !DILocation(line: 1430, column: 2, scope: !215)
!257 = !DILocation(line: 1432, column: 2, scope: !215)
!258 = !DILocation(line: 1434, column: 2, scope: !215)
!259 = !DILocation(line: 1435, column: 2, scope: !215)
!260 = !DILocation(line: 1436, column: 2, scope: !215)
!261 = !DILocation(line: 1437, column: 2, scope: !215)
!262 = !DILocation(line: 1438, column: 2, scope: !215)
!263 = !DILocation(line: 1439, column: 2, scope: !215)
!264 = !DILocation(line: 1440, column: 2, scope: !215)
!265 = !DILocation(line: 1444, column: 2, scope: !215)
!266 = !DILocation(line: 1445, column: 2, scope: !215)
!267 = !DILocation(line: 1446, column: 2, scope: !215)
!268 = !DILocation(line: 1447, column: 2, scope: !215)
!269 = !DILocation(line: 1448, column: 2, scope: !215)
!270 = !DILocation(line: 1449, column: 2, scope: !215)
!271 = !DILocation(line: 1450, column: 2, scope: !215)
!272 = !DILocation(line: 1451, column: 2, scope: !215)
!273 = !DILocation(line: 1452, column: 2, scope: !215)
!274 = !DILocation(line: 1453, column: 2, scope: !215)
!275 = !DILocation(line: 1454, column: 2, scope: !215)
!276 = !DILocation(line: 1456, column: 2, scope: !215)
!277 = !DILocation(line: 1457, column: 2, scope: !215)
!278 = !DILocation(line: 1459, column: 2, scope: !215)
!279 = !DILocation(line: 1460, column: 2, scope: !215)
!280 = !DILocation(line: 1461, column: 2, scope: !215)
!281 = !DILocation(line: 1462, column: 2, scope: !215)
!282 = !DILocation(line: 1463, column: 2, scope: !215)
!283 = !DILocation(line: 1464, column: 2, scope: !215)
!284 = !DILocation(line: 1465, column: 2, scope: !215)
!285 = !DILocation(line: 1466, column: 2, scope: !215)
!286 = !DILocation(line: 1467, column: 2, scope: !215)
!287 = !DILocation(line: 1468, column: 2, scope: !215)
!288 = !DILocation(line: 1469, column: 2, scope: !215)
!289 = !DILocation(line: 1470, column: 2, scope: !215)
!290 = !DILocation(line: 1471, column: 2, scope: !215)
!291 = !DILocation(line: 1472, column: 2, scope: !215)
!292 = !DILocation(line: 1473, column: 2, scope: !215)
!293 = !DILocation(line: 1475, column: 2, scope: !215)
!294 = !DILocation(line: 1477, column: 2, scope: !215)
!295 = !DILocation(line: 1478, column: 2, scope: !215)
!296 = !DILocation(line: 1479, column: 2, scope: !215)
!297 = !DILocation(line: 1480, column: 2, scope: !215)
!298 = !DILocation(line: 1481, column: 2, scope: !215)
!299 = !DILocation(line: 1482, column: 2, scope: !215)
!300 = !DILocation(line: 1483, column: 2, scope: !215)
!301 = !DILocation(line: 1484, column: 2, scope: !215)
!302 = !DILocation(line: 1485, column: 2, scope: !215)
!303 = !DILocation(line: 1487, column: 2, scope: !215)
!304 = !DILocation(line: 1488, column: 2, scope: !215)
!305 = !DILocation(line: 1489, column: 2, scope: !215)
!306 = !DILocation(line: 1490, column: 2, scope: !215)
!307 = !DILocation(line: 1491, column: 2, scope: !215)
!308 = !DILocation(line: 1493, column: 60, scope: !215)
!309 = !DILocation(line: 1493, column: 2, scope: !215)
!310 = !DILocation(line: 1494, column: 2, scope: !215)
!311 = !DILocation(line: 1495, column: 2, scope: !215)
!312 = !DILocation(line: 1496, column: 2, scope: !215)
!313 = !DILocation(line: 1497, column: 2, scope: !215)
!314 = !DILocation(line: 1498, column: 2, scope: !215)
!315 = !DILocation(line: 1499, column: 2, scope: !215)
!316 = !DILocation(line: 1500, column: 2, scope: !215)
!317 = !DILocation(line: 1501, column: 2, scope: !215)
!318 = !DILocation(line: 1502, column: 2, scope: !215)
!319 = !DILocation(line: 1505, column: 63, scope: !215)
!320 = !DILocation(line: 1505, column: 2, scope: !215)
!321 = !DILocation(line: 1506, column: 2, scope: !215)
!322 = !DILocation(line: 1507, column: 2, scope: !215)
!323 = !DILocation(line: 1508, column: 2, scope: !215)
!324 = !DILocation(line: 1509, column: 2, scope: !215)
!325 = !DILocation(line: 1510, column: 1, scope: !215)
!326 = distinct !DISubprogram(name: "static_track_group_handler", scope: !74, file: !74, line: 78, type: !327, isLocal: true, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !329}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !331, line: 34, baseType: !332)
!331 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !331, line: 30, size: 128, align: 64, elements: !333)
!333 = !{!334, !335, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !332, file: !331, line: 31, baseType: !124, size: 32, align: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !332, file: !331, line: 32, baseType: !124, size: 32, align: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !332, file: !331, line: 33, baseType: !337, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!338 = !DILocalVariable(name: "strvec", arg: 1, scope: !326, file: !74, line: 78, type: !329)
!339 = !DILocation(line: 78, column: 38, scope: !326)
!340 = !DILocalVariable(name: "e", scope: !326, file: !74, line: 80, type: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "element", file: !132, line: 30, baseType: !137)
!342 = !DILocation(line: 80, column: 10, scope: !326)
!343 = !DILocalVariable(name: "tg", scope: !326, file: !74, line: 81, type: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "static_track_group_t", file: !346, line: 39, baseType: !347)
!346 = !DIFile(filename: "./../include/vrrp_static_track.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_track_group", file: !346, line: 35, size: 192, align: 64, elements: !348)
!348 = !{!349, !350, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !347, file: !346, line: 36, baseType: !111, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !347, file: !346, line: 37, baseType: !329, size: 64, align: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !347, file: !346, line: 38, baseType: !131, size: 64, align: 64, offset: 128)
!352 = !DILocation(line: 81, column: 24, scope: !326)
!353 = !DILocalVariable(name: "gname", scope: !326, file: !74, line: 82, type: !111)
!354 = !DILocation(line: 82, column: 8, scope: !326)
!355 = !DILocation(line: 84, column: 7, scope: !356)
!356 = distinct !DILexicalBlock(scope: !326, file: !74, line: 84, column: 6)
!357 = !DILocation(line: 84, column: 6, scope: !326)
!358 = !DILocation(line: 85, column: 3, scope: !356)
!359 = !DILocation(line: 87, column: 19, scope: !360)
!360 = distinct !DILexicalBlock(scope: !326, file: !74, line: 87, column: 6)
!361 = !DILocation(line: 87, column: 6, scope: !360)
!362 = !DILocation(line: 87, column: 27, scope: !360)
!363 = !DILocation(line: 87, column: 6, scope: !326)
!364 = !DILocation(line: 88, column: 3, scope: !365)
!365 = distinct !DILexicalBlock(scope: !360, file: !74, line: 87, column: 33)
!366 = !DILocation(line: 89, column: 3, scope: !365)
!367 = !DILocation(line: 90, column: 3, scope: !365)
!368 = !DILocation(line: 93, column: 22, scope: !326)
!369 = !DILocation(line: 93, column: 10, scope: !326)
!370 = !DILocation(line: 93, column: 8, scope: !326)
!371 = !DILocation(line: 96, column: 15, scope: !372)
!372 = distinct !DILexicalBlock(scope: !326, file: !74, line: 96, column: 2)
!373 = !DILocation(line: 96, column: 26, scope: !372)
!374 = !DILocation(line: 96, column: 14, scope: !372)
!375 = !DILocation(line: 96, column: 52, scope: !376)
!376 = !DILexicalBlockFile(scope: !372, file: !74, discriminator: 1)
!377 = !DILocation(line: 96, column: 63, scope: !376)
!378 = !DILocation(line: 96, column: 51, scope: !376)
!379 = !DILocation(line: 96, column: 50, scope: !376)
!380 = !DILocation(line: 96, column: 50, scope: !381)
!381 = !DILexicalBlockFile(scope: !372, file: !74, discriminator: 2)
!382 = !DILocation(line: 96, column: 4, scope: !383)
!383 = !DILexicalBlockFile(scope: !372, file: !74, discriminator: 3)
!384 = !DILocation(line: 96, column: 15, scope: !383)
!385 = !DILocation(line: 96, column: 37, scope: !383)
!386 = !DILocation(line: 96, column: 50, scope: !383)
!387 = !DILocation(line: 96, column: 50, scope: !388)
!388 = !DILexicalBlockFile(scope: !372, file: !74, discriminator: 4)
!389 = !DILocation(line: 96, column: 14, scope: !388)
!390 = !DILocation(line: 96, column: 14, scope: !391)
!391 = !DILexicalBlockFile(scope: !372, file: !74, discriminator: 5)
!392 = !DILocation(line: 96, column: 14, scope: !393)
!393 = !DILexicalBlockFile(scope: !372, file: !74, discriminator: 6)
!394 = !DILocation(line: 96, column: 11, scope: !393)
!395 = !DILocation(line: 96, column: 7, scope: !393)
!396 = !DILocation(line: 96, column: 5, scope: !397)
!397 = !DILexicalBlockFile(scope: !398, file: !74, discriminator: 7)
!398 = distinct !DILexicalBlock(scope: !372, file: !74, line: 96, column: 2)
!399 = !DILocation(line: 96, column: 4, scope: !397)
!400 = !DILocation(line: 96, column: 8, scope: !397)
!401 = !DILocation(line: 96, column: 21, scope: !402)
!402 = !DILexicalBlockFile(scope: !398, file: !74, discriminator: 8)
!403 = !DILocation(line: 96, column: 25, scope: !402)
!404 = !DILocation(line: 96, column: 19, scope: !402)
!405 = !DILocation(line: 96, column: 17, scope: !402)
!406 = !DILocation(line: 96, column: 2, scope: !407)
!407 = !DILexicalBlockFile(scope: !372, file: !74, discriminator: 9)
!408 = !DILocation(line: 97, column: 15, scope: !409)
!409 = distinct !DILexicalBlock(scope: !410, file: !74, line: 97, column: 7)
!410 = distinct !DILexicalBlock(scope: !398, file: !74, line: 96, column: 55)
!411 = !DILocation(line: 97, column: 21, scope: !409)
!412 = !DILocation(line: 97, column: 25, scope: !409)
!413 = !DILocation(line: 97, column: 8, scope: !409)
!414 = !DILocation(line: 97, column: 7, scope: !410)
!415 = !DILocation(line: 98, column: 80, scope: !416)
!416 = distinct !DILexicalBlock(scope: !409, file: !74, line: 97, column: 33)
!417 = !DILocation(line: 98, column: 4, scope: !416)
!418 = !DILocation(line: 99, column: 4, scope: !416)
!419 = !DILocation(line: 100, column: 4, scope: !416)
!420 = !DILocation(line: 102, column: 2, scope: !410)
!421 = !DILocation(line: 96, column: 44, scope: !422)
!422 = !DILexicalBlockFile(scope: !398, file: !74, discriminator: 10)
!423 = !DILocation(line: 96, column: 48, scope: !422)
!424 = !DILocation(line: 96, column: 41, scope: !422)
!425 = !DILocation(line: 96, column: 2, scope: !422)
!426 = distinct !{!426, !427}
!427 = !DILocation(line: 96, column: 2, scope: !326)
!428 = !DILocation(line: 104, column: 27, scope: !326)
!429 = !DILocation(line: 104, column: 2, scope: !326)
!430 = !DILocation(line: 105, column: 1, scope: !326)
!431 = !DILocation(line: 105, column: 1, scope: !432)
!432 = !DILexicalBlockFile(scope: !326, file: !74, discriminator: 1)
!433 = distinct !DISubprogram(name: "static_track_group_group_handler", scope: !74, file: !74, line: 108, type: !327, isLocal: true, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!434 = !DILocalVariable(name: "strvec", arg: 1, scope: !433, file: !74, line: 108, type: !329)
!435 = !DILocation(line: 108, column: 44, scope: !433)
!436 = !DILocalVariable(name: "tgroup", scope: !433, file: !74, line: 110, type: !344)
!437 = !DILocation(line: 110, column: 24, scope: !433)
!438 = !DILocation(line: 110, column: 35, scope: !433)
!439 = !DILocation(line: 110, column: 46, scope: !433)
!440 = !DILocation(line: 110, column: 68, scope: !433)
!441 = !DILocation(line: 110, column: 74, scope: !433)
!442 = !DILocation(line: 110, column: 33, scope: !433)
!443 = !DILocation(line: 112, column: 6, scope: !444)
!444 = distinct !DILexicalBlock(scope: !433, file: !74, line: 112, column: 6)
!445 = !DILocation(line: 112, column: 14, scope: !444)
!446 = !DILocation(line: 112, column: 6, scope: !433)
!447 = !DILocation(line: 113, column: 95, scope: !448)
!448 = distinct !DILexicalBlock(scope: !444, file: !74, line: 112, column: 21)
!449 = !DILocation(line: 113, column: 103, scope: !448)
!450 = !DILocation(line: 113, column: 3, scope: !448)
!451 = !DILocation(line: 114, column: 3, scope: !448)
!452 = !DILocation(line: 115, column: 3, scope: !448)
!453 = !DILocation(line: 118, column: 35, scope: !433)
!454 = !DILocation(line: 118, column: 18, scope: !433)
!455 = !DILocation(line: 118, column: 2, scope: !433)
!456 = !DILocation(line: 118, column: 10, scope: !433)
!457 = !DILocation(line: 118, column: 16, scope: !433)
!458 = !DILocation(line: 120, column: 7, scope: !459)
!459 = distinct !DILexicalBlock(scope: !433, file: !74, line: 120, column: 6)
!460 = !DILocation(line: 120, column: 15, scope: !459)
!461 = !DILocation(line: 120, column: 6, scope: !433)
!462 = !DILocation(line: 121, column: 95, scope: !459)
!463 = !DILocation(line: 121, column: 103, scope: !459)
!464 = !DILocation(line: 121, column: 3, scope: !459)
!465 = !DILocation(line: 122, column: 1, scope: !433)
!466 = distinct !DISubprogram(name: "static_addresses_handler", scope: !74, file: !74, line: 126, type: !327, isLocal: true, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!467 = !DILocalVariable(name: "strvec", arg: 1, scope: !466, file: !74, line: 126, type: !329)
!468 = !DILocation(line: 126, column: 36, scope: !466)
!469 = !DILocation(line: 128, column: 2, scope: !466)
!470 = !DILocation(line: 128, column: 15, scope: !466)
!471 = !DILocation(line: 128, column: 32, scope: !466)
!472 = !DILocation(line: 130, column: 7, scope: !473)
!473 = distinct !DILexicalBlock(scope: !466, file: !74, line: 130, column: 6)
!474 = !DILocation(line: 130, column: 6, scope: !466)
!475 = !DILocation(line: 131, column: 3, scope: !473)
!476 = !DILocation(line: 133, column: 38, scope: !466)
!477 = !DILocation(line: 133, column: 47, scope: !466)
!478 = !DILocation(line: 133, column: 37, scope: !466)
!479 = !DILocation(line: 133, column: 2, scope: !466)
!480 = !DILocation(line: 134, column: 1, scope: !466)
!481 = !DILocation(line: 134, column: 1, scope: !482)
!482 = !DILexicalBlockFile(scope: !466, file: !74, discriminator: 1)
!483 = distinct !DISubprogram(name: "static_routes_handler", scope: !74, file: !74, line: 139, type: !327, isLocal: true, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!484 = !DILocalVariable(name: "strvec", arg: 1, scope: !483, file: !74, line: 139, type: !329)
!485 = !DILocation(line: 139, column: 33, scope: !483)
!486 = !DILocation(line: 141, column: 2, scope: !483)
!487 = !DILocation(line: 141, column: 15, scope: !483)
!488 = !DILocation(line: 141, column: 32, scope: !483)
!489 = !DILocation(line: 143, column: 7, scope: !490)
!490 = distinct !DILexicalBlock(scope: !483, file: !74, line: 143, column: 6)
!491 = !DILocation(line: 143, column: 6, scope: !483)
!492 = !DILocation(line: 144, column: 3, scope: !490)
!493 = !DILocation(line: 146, column: 36, scope: !483)
!494 = !DILocation(line: 146, column: 45, scope: !483)
!495 = !DILocation(line: 146, column: 35, scope: !483)
!496 = !DILocation(line: 146, column: 2, scope: !483)
!497 = !DILocation(line: 147, column: 1, scope: !483)
!498 = !DILocation(line: 147, column: 1, scope: !499)
!499 = !DILexicalBlockFile(scope: !483, file: !74, discriminator: 1)
!500 = distinct !DISubprogram(name: "static_rules_handler", scope: !74, file: !74, line: 151, type: !327, isLocal: true, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!501 = !DILocalVariable(name: "strvec", arg: 1, scope: !500, file: !74, line: 151, type: !329)
!502 = !DILocation(line: 151, column: 32, scope: !500)
!503 = !DILocation(line: 153, column: 2, scope: !500)
!504 = !DILocation(line: 153, column: 15, scope: !500)
!505 = !DILocation(line: 153, column: 32, scope: !500)
!506 = !DILocation(line: 155, column: 7, scope: !507)
!507 = distinct !DILexicalBlock(scope: !500, file: !74, line: 155, column: 6)
!508 = !DILocation(line: 155, column: 6, scope: !500)
!509 = !DILocation(line: 156, column: 3, scope: !507)
!510 = !DILocation(line: 158, column: 35, scope: !500)
!511 = !DILocation(line: 158, column: 44, scope: !500)
!512 = !DILocation(line: 158, column: 34, scope: !500)
!513 = !DILocation(line: 158, column: 2, scope: !500)
!514 = !DILocation(line: 159, column: 1, scope: !500)
!515 = !DILocation(line: 159, column: 1, scope: !516)
!516 = !DILexicalBlockFile(scope: !500, file: !74, discriminator: 1)
!517 = distinct !DISubprogram(name: "vrrp_sync_group_handler", scope: !74, file: !74, line: 164, type: !327, isLocal: true, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!518 = !DILocalVariable(name: "strvec", arg: 1, scope: !517, file: !74, line: 164, type: !329)
!519 = !DILocation(line: 164, column: 35, scope: !517)
!520 = !DILocalVariable(name: "l", scope: !517, file: !74, line: 166, type: !131)
!521 = !DILocation(line: 166, column: 7, scope: !517)
!522 = !DILocalVariable(name: "e", scope: !517, file: !74, line: 167, type: !341)
!523 = !DILocation(line: 167, column: 10, scope: !517)
!524 = !DILocalVariable(name: "sg", scope: !517, file: !74, line: 168, type: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_sgroup_t", file: !27, line: 133, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_sgroup", file: !27, line: 109, size: 1024, align: 64, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !557, !558, !559, !560, !561, !562}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !527, file: !27, line: 110, baseType: !111, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !527, file: !27, line: 111, baseType: !329, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !527, file: !27, line: 112, baseType: !131, size: 64, align: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_fault", scope: !527, file: !27, line: 113, baseType: !124, size: 32, align: 32, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_init", scope: !527, file: !27, line: 114, baseType: !124, size: 32, align: 32, offset: 224)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !527, file: !27, line: 115, baseType: !127, size: 32, align: 32, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "sgroup_tracking_weight", scope: !527, file: !27, line: 116, baseType: !125, size: 8, align: 8, offset: 288)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !527, file: !27, line: 119, baseType: !131, size: 64, align: 64, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !527, file: !27, line: 120, baseType: !131, size: 64, align: 64, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !527, file: !27, line: 121, baseType: !131, size: 64, align: 64, offset: 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "track_bfd", scope: !527, file: !27, line: 122, baseType: !131, size: 64, align: 64, offset: 512)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !527, file: !27, line: 125, baseType: !125, size: 8, align: 8, offset: 576)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !527, file: !27, line: 126, baseType: !542, size: 64, align: 64, offset: 640)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !62, line: 65, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !62, line: 59, size: 192, align: 64, elements: !545)
!545 = !{!546, !548, !549, !550, !554}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !544, file: !62, line: 60, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !544, file: !62, line: 61, baseType: !127, size: 32, align: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !544, file: !62, line: 62, baseType: !127, size: 32, align: 32, offset: 96)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !544, file: !62, line: 63, baseType: !551, size: 32, align: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !552, line: 240, baseType: !553)
!552 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !116, line: 125, baseType: !124)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !544, file: !62, line: 64, baseType: !555, size: 32, align: 32, offset: 160)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !552, line: 235, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !116, line: 126, baseType: !124)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !527, file: !27, line: 127, baseType: !542, size: 64, align: 64, offset: 704)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !527, file: !27, line: 128, baseType: !542, size: 64, align: 64, offset: 768)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !527, file: !27, line: 129, baseType: !542, size: 64, align: 64, offset: 832)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !527, file: !27, line: 130, baseType: !542, size: 64, align: 64, offset: 896)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !527, file: !27, line: 131, baseType: !127, size: 32, align: 32, offset: 960)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !527, file: !27, line: 132, baseType: !127, size: 32, align: 32, offset: 992)
!563 = !DILocation(line: 168, column: 17, scope: !517)
!564 = !DILocalVariable(name: "gname", scope: !517, file: !74, line: 169, type: !111)
!565 = !DILocation(line: 169, column: 8, scope: !517)
!566 = !DILocation(line: 171, column: 7, scope: !567)
!567 = distinct !DILexicalBlock(scope: !517, file: !74, line: 171, column: 6)
!568 = !DILocation(line: 171, column: 6, scope: !517)
!569 = !DILocation(line: 172, column: 3, scope: !567)
!570 = !DILocation(line: 174, column: 19, scope: !571)
!571 = distinct !DILexicalBlock(scope: !517, file: !74, line: 174, column: 6)
!572 = !DILocation(line: 174, column: 6, scope: !571)
!573 = !DILocation(line: 174, column: 27, scope: !571)
!574 = !DILocation(line: 174, column: 6, scope: !517)
!575 = !DILocation(line: 175, column: 3, scope: !576)
!576 = distinct !DILexicalBlock(scope: !571, file: !74, line: 174, column: 33)
!577 = !DILocation(line: 176, column: 3, scope: !576)
!578 = !DILocation(line: 177, column: 3, scope: !576)
!579 = !DILocation(line: 180, column: 22, scope: !517)
!580 = !DILocation(line: 180, column: 10, scope: !517)
!581 = !DILocation(line: 180, column: 8, scope: !517)
!582 = !DILocation(line: 183, column: 9, scope: !583)
!583 = distinct !DILexicalBlock(scope: !517, file: !74, line: 183, column: 6)
!584 = !DILocation(line: 183, column: 20, scope: !583)
!585 = !DILocation(line: 183, column: 37, scope: !583)
!586 = !DILocation(line: 183, column: 6, scope: !583)
!587 = !DILocation(line: 183, column: 11, scope: !588)
!588 = !DILexicalBlockFile(scope: !583, file: !74, discriminator: 1)
!589 = !DILocation(line: 183, column: 22, scope: !588)
!590 = !DILocation(line: 183, column: 40, scope: !588)
!591 = !DILocation(line: 183, column: 45, scope: !588)
!592 = !DILocation(line: 183, column: 6, scope: !588)
!593 = !DILocation(line: 183, column: 10, scope: !594)
!594 = !DILexicalBlockFile(scope: !583, file: !74, discriminator: 2)
!595 = !DILocation(line: 183, column: 21, scope: !594)
!596 = !DILocation(line: 183, column: 39, scope: !594)
!597 = !DILocation(line: 183, column: 44, scope: !594)
!598 = !DILocation(line: 183, column: 6, scope: !594)
!599 = !DILocation(line: 184, column: 7, scope: !600)
!600 = distinct !DILexicalBlock(scope: !583, file: !74, line: 183, column: 10)
!601 = !DILocation(line: 184, column: 18, scope: !600)
!602 = !DILocation(line: 184, column: 5, scope: !600)
!603 = !DILocation(line: 185, column: 15, scope: !604)
!604 = distinct !DILexicalBlock(scope: !600, file: !74, line: 185, column: 3)
!605 = !DILocation(line: 185, column: 14, scope: !604)
!606 = !DILocation(line: 185, column: 13, scope: !604)
!607 = !DILocation(line: 185, column: 13, scope: !608)
!608 = !DILexicalBlockFile(scope: !604, file: !74, discriminator: 1)
!609 = !DILocation(line: 185, column: 14, scope: !610)
!610 = !DILexicalBlockFile(scope: !604, file: !74, discriminator: 2)
!611 = !DILocation(line: 185, column: 18, scope: !610)
!612 = !DILocation(line: 185, column: 13, scope: !610)
!613 = !DILocation(line: 185, column: 13, scope: !614)
!614 = !DILexicalBlockFile(scope: !604, file: !74, discriminator: 3)
!615 = !DILocation(line: 185, column: 10, scope: !614)
!616 = !DILocation(line: 185, column: 8, scope: !614)
!617 = !DILocation(line: 185, column: 25, scope: !618)
!618 = !DILexicalBlockFile(scope: !619, file: !74, discriminator: 4)
!619 = distinct !DILexicalBlock(scope: !604, file: !74, line: 185, column: 3)
!620 = !DILocation(line: 185, column: 3, scope: !618)
!621 = !DILocation(line: 186, column: 11, scope: !622)
!622 = distinct !DILexicalBlock(scope: !619, file: !74, line: 185, column: 47)
!623 = !DILocation(line: 186, column: 15, scope: !622)
!624 = !DILocation(line: 186, column: 9, scope: !622)
!625 = !DILocation(line: 186, column: 7, scope: !622)
!626 = !DILocation(line: 187, column: 16, scope: !627)
!627 = distinct !DILexicalBlock(scope: !622, file: !74, line: 187, column: 8)
!628 = !DILocation(line: 187, column: 22, scope: !627)
!629 = !DILocation(line: 187, column: 26, scope: !627)
!630 = !DILocation(line: 187, column: 9, scope: !627)
!631 = !DILocation(line: 187, column: 8, scope: !622)
!632 = !DILocation(line: 188, column: 85, scope: !633)
!633 = distinct !DILexicalBlock(scope: !627, file: !74, line: 187, column: 34)
!634 = !DILocation(line: 188, column: 5, scope: !633)
!635 = !DILocation(line: 189, column: 5, scope: !633)
!636 = !DILocation(line: 190, column: 5, scope: !633)
!637 = !DILocation(line: 192, column: 3, scope: !622)
!638 = !DILocation(line: 185, column: 36, scope: !639)
!639 = !DILexicalBlockFile(scope: !619, file: !74, discriminator: 5)
!640 = !DILocation(line: 185, column: 40, scope: !639)
!641 = !DILocation(line: 185, column: 33, scope: !639)
!642 = !DILocation(line: 185, column: 3, scope: !639)
!643 = distinct !{!643, !644}
!644 = !DILocation(line: 185, column: 3, scope: !600)
!645 = !DILocation(line: 193, column: 2, scope: !600)
!646 = !DILocation(line: 195, column: 24, scope: !517)
!647 = !DILocation(line: 195, column: 2, scope: !517)
!648 = !DILocation(line: 196, column: 1, scope: !517)
!649 = !DILocation(line: 196, column: 1, scope: !650)
!650 = !DILexicalBlockFile(scope: !517, file: !74, discriminator: 1)
!651 = distinct !DISubprogram(name: "vrrp_group_handler", scope: !74, file: !74, line: 199, type: !327, isLocal: true, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!652 = !DILocalVariable(name: "strvec", arg: 1, scope: !651, file: !74, line: 199, type: !329)
!653 = !DILocation(line: 199, column: 30, scope: !651)
!654 = !DILocalVariable(name: "vgroup", scope: !651, file: !74, line: 201, type: !525)
!655 = !DILocation(line: 201, column: 17, scope: !651)
!656 = !DILocation(line: 201, column: 28, scope: !651)
!657 = !DILocation(line: 201, column: 39, scope: !651)
!658 = !DILocation(line: 201, column: 57, scope: !651)
!659 = !DILocation(line: 201, column: 63, scope: !651)
!660 = !DILocation(line: 201, column: 26, scope: !651)
!661 = !DILocation(line: 203, column: 6, scope: !662)
!662 = distinct !DILexicalBlock(scope: !651, file: !74, line: 203, column: 6)
!663 = !DILocation(line: 203, column: 14, scope: !662)
!664 = !DILocation(line: 203, column: 6, scope: !651)
!665 = !DILocation(line: 204, column: 95, scope: !666)
!666 = distinct !DILexicalBlock(scope: !662, file: !74, line: 203, column: 21)
!667 = !DILocation(line: 204, column: 103, scope: !666)
!668 = !DILocation(line: 204, column: 3, scope: !666)
!669 = !DILocation(line: 205, column: 3, scope: !666)
!670 = !DILocation(line: 206, column: 3, scope: !666)
!671 = !DILocation(line: 209, column: 35, scope: !651)
!672 = !DILocation(line: 209, column: 18, scope: !651)
!673 = !DILocation(line: 209, column: 2, scope: !651)
!674 = !DILocation(line: 209, column: 10, scope: !651)
!675 = !DILocation(line: 209, column: 16, scope: !651)
!676 = !DILocation(line: 211, column: 7, scope: !677)
!677 = distinct !DILexicalBlock(scope: !651, file: !74, line: 211, column: 6)
!678 = !DILocation(line: 211, column: 15, scope: !677)
!679 = !DILocation(line: 211, column: 6, scope: !651)
!680 = !DILocation(line: 212, column: 94, scope: !677)
!681 = !DILocation(line: 212, column: 102, scope: !677)
!682 = !DILocation(line: 212, column: 3, scope: !677)
!683 = !DILocation(line: 213, column: 1, scope: !651)
!684 = distinct !DISubprogram(name: "vrrp_group_track_if_handler", scope: !74, file: !74, line: 216, type: !327, isLocal: true, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!685 = !DILocalVariable(name: "strvec", arg: 1, scope: !684, file: !74, line: 216, type: !329)
!686 = !DILocation(line: 216, column: 39, scope: !684)
!687 = !DILocation(line: 218, column: 49, scope: !684)
!688 = !DILocation(line: 218, column: 58, scope: !684)
!689 = !DILocation(line: 218, column: 48, scope: !684)
!690 = !DILocation(line: 218, column: 2, scope: !684)
!691 = !DILocation(line: 219, column: 1, scope: !684)
!692 = distinct !DISubprogram(name: "vrrp_group_track_scr_handler", scope: !74, file: !74, line: 222, type: !327, isLocal: true, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!693 = !DILocalVariable(name: "strvec", arg: 1, scope: !692, file: !74, line: 222, type: !329)
!694 = !DILocation(line: 222, column: 40, scope: !692)
!695 = !DILocation(line: 224, column: 53, scope: !692)
!696 = !DILocation(line: 224, column: 62, scope: !692)
!697 = !DILocation(line: 224, column: 52, scope: !692)
!698 = !DILocation(line: 224, column: 2, scope: !692)
!699 = !DILocation(line: 225, column: 1, scope: !692)
!700 = distinct !DISubprogram(name: "vrrp_group_track_file_handler", scope: !74, file: !74, line: 228, type: !327, isLocal: true, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!701 = !DILocalVariable(name: "strvec", arg: 1, scope: !700, file: !74, line: 228, type: !329)
!702 = !DILocation(line: 228, column: 41, scope: !700)
!703 = !DILocation(line: 230, column: 51, scope: !700)
!704 = !DILocation(line: 230, column: 60, scope: !700)
!705 = !DILocation(line: 230, column: 50, scope: !700)
!706 = !DILocation(line: 230, column: 2, scope: !700)
!707 = !DILocation(line: 231, column: 1, scope: !700)
!708 = distinct !DISubprogram(name: "vrrp_gnotify_backup_handler", scope: !74, file: !74, line: 248, type: !327, isLocal: true, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!709 = !DILocalVariable(name: "strvec", arg: 1, scope: !708, file: !74, line: 248, type: !329)
!710 = !DILocation(line: 248, column: 39, scope: !708)
!711 = !DILocalVariable(name: "vgroup", scope: !708, file: !74, line: 250, type: !525)
!712 = !DILocation(line: 250, column: 17, scope: !708)
!713 = !DILocation(line: 250, column: 28, scope: !708)
!714 = !DILocation(line: 250, column: 39, scope: !708)
!715 = !DILocation(line: 250, column: 57, scope: !708)
!716 = !DILocation(line: 250, column: 63, scope: !708)
!717 = !DILocation(line: 250, column: 26, scope: !708)
!718 = !DILocation(line: 251, column: 6, scope: !719)
!719 = distinct !DILexicalBlock(scope: !708, file: !74, line: 251, column: 6)
!720 = !DILocation(line: 251, column: 14, scope: !719)
!721 = !DILocation(line: 251, column: 6, scope: !708)
!722 = !DILocation(line: 252, column: 116, scope: !723)
!723 = distinct !DILexicalBlock(scope: !719, file: !74, line: 251, column: 29)
!724 = !DILocation(line: 252, column: 124, scope: !723)
!725 = !DILocation(line: 252, column: 151, scope: !723)
!726 = !DILocation(line: 252, column: 139, scope: !723)
!727 = !DILocation(line: 252, column: 3, scope: !728)
!728 = !DILexicalBlockFile(scope: !723, file: !74, discriminator: 1)
!729 = !DILocation(line: 253, column: 3, scope: !723)
!730 = !DILocation(line: 255, column: 49, scope: !708)
!731 = !DILocation(line: 255, column: 26, scope: !708)
!732 = !DILocation(line: 255, column: 2, scope: !708)
!733 = !DILocation(line: 255, column: 10, scope: !708)
!734 = !DILocation(line: 255, column: 24, scope: !708)
!735 = !DILocation(line: 256, column: 2, scope: !708)
!736 = !DILocation(line: 256, column: 10, scope: !708)
!737 = !DILocation(line: 256, column: 22, scope: !708)
!738 = !DILocation(line: 257, column: 1, scope: !708)
!739 = !DILocation(line: 257, column: 1, scope: !740)
!740 = !DILexicalBlockFile(scope: !708, file: !74, discriminator: 1)
!741 = distinct !DISubprogram(name: "vrrp_gnotify_master_handler", scope: !74, file: !74, line: 259, type: !327, isLocal: true, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!742 = !DILocalVariable(name: "strvec", arg: 1, scope: !741, file: !74, line: 259, type: !329)
!743 = !DILocation(line: 259, column: 39, scope: !741)
!744 = !DILocalVariable(name: "vgroup", scope: !741, file: !74, line: 261, type: !525)
!745 = !DILocation(line: 261, column: 17, scope: !741)
!746 = !DILocation(line: 261, column: 28, scope: !741)
!747 = !DILocation(line: 261, column: 39, scope: !741)
!748 = !DILocation(line: 261, column: 57, scope: !741)
!749 = !DILocation(line: 261, column: 63, scope: !741)
!750 = !DILocation(line: 261, column: 26, scope: !741)
!751 = !DILocation(line: 262, column: 6, scope: !752)
!752 = distinct !DILexicalBlock(scope: !741, file: !74, line: 262, column: 6)
!753 = !DILocation(line: 262, column: 14, scope: !752)
!754 = !DILocation(line: 262, column: 6, scope: !741)
!755 = !DILocation(line: 263, column: 116, scope: !756)
!756 = distinct !DILexicalBlock(scope: !752, file: !74, line: 262, column: 29)
!757 = !DILocation(line: 263, column: 124, scope: !756)
!758 = !DILocation(line: 263, column: 151, scope: !756)
!759 = !DILocation(line: 263, column: 139, scope: !756)
!760 = !DILocation(line: 263, column: 3, scope: !761)
!761 = !DILexicalBlockFile(scope: !756, file: !74, discriminator: 1)
!762 = !DILocation(line: 264, column: 3, scope: !756)
!763 = !DILocation(line: 266, column: 49, scope: !741)
!764 = !DILocation(line: 266, column: 26, scope: !741)
!765 = !DILocation(line: 266, column: 2, scope: !741)
!766 = !DILocation(line: 266, column: 10, scope: !741)
!767 = !DILocation(line: 266, column: 24, scope: !741)
!768 = !DILocation(line: 267, column: 2, scope: !741)
!769 = !DILocation(line: 267, column: 10, scope: !741)
!770 = !DILocation(line: 267, column: 22, scope: !741)
!771 = !DILocation(line: 268, column: 1, scope: !741)
!772 = !DILocation(line: 268, column: 1, scope: !773)
!773 = !DILexicalBlockFile(scope: !741, file: !74, discriminator: 1)
!774 = distinct !DISubprogram(name: "vrrp_gnotify_fault_handler", scope: !74, file: !74, line: 270, type: !327, isLocal: true, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!775 = !DILocalVariable(name: "strvec", arg: 1, scope: !774, file: !74, line: 270, type: !329)
!776 = !DILocation(line: 270, column: 38, scope: !774)
!777 = !DILocalVariable(name: "vgroup", scope: !774, file: !74, line: 272, type: !525)
!778 = !DILocation(line: 272, column: 17, scope: !774)
!779 = !DILocation(line: 272, column: 28, scope: !774)
!780 = !DILocation(line: 272, column: 39, scope: !774)
!781 = !DILocation(line: 272, column: 57, scope: !774)
!782 = !DILocation(line: 272, column: 63, scope: !774)
!783 = !DILocation(line: 272, column: 26, scope: !774)
!784 = !DILocation(line: 273, column: 6, scope: !785)
!785 = distinct !DILexicalBlock(scope: !774, file: !74, line: 273, column: 6)
!786 = !DILocation(line: 273, column: 14, scope: !785)
!787 = !DILocation(line: 273, column: 6, scope: !774)
!788 = !DILocation(line: 274, column: 115, scope: !789)
!789 = distinct !DILexicalBlock(scope: !785, file: !74, line: 273, column: 28)
!790 = !DILocation(line: 274, column: 123, scope: !789)
!791 = !DILocation(line: 274, column: 150, scope: !789)
!792 = !DILocation(line: 274, column: 138, scope: !789)
!793 = !DILocation(line: 274, column: 3, scope: !794)
!794 = !DILexicalBlockFile(scope: !789, file: !74, discriminator: 1)
!795 = !DILocation(line: 275, column: 3, scope: !789)
!796 = !DILocation(line: 277, column: 48, scope: !774)
!797 = !DILocation(line: 277, column: 25, scope: !774)
!798 = !DILocation(line: 277, column: 2, scope: !774)
!799 = !DILocation(line: 277, column: 10, scope: !774)
!800 = !DILocation(line: 277, column: 23, scope: !774)
!801 = !DILocation(line: 278, column: 2, scope: !774)
!802 = !DILocation(line: 278, column: 10, scope: !774)
!803 = !DILocation(line: 278, column: 22, scope: !774)
!804 = !DILocation(line: 279, column: 1, scope: !774)
!805 = !DILocation(line: 279, column: 1, scope: !806)
!806 = !DILexicalBlockFile(scope: !774, file: !74, discriminator: 1)
!807 = distinct !DISubprogram(name: "vrrp_gnotify_stop_handler", scope: !74, file: !74, line: 281, type: !327, isLocal: true, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!808 = !DILocalVariable(name: "strvec", arg: 1, scope: !807, file: !74, line: 281, type: !329)
!809 = !DILocation(line: 281, column: 37, scope: !807)
!810 = !DILocalVariable(name: "vgroup", scope: !807, file: !74, line: 283, type: !525)
!811 = !DILocation(line: 283, column: 17, scope: !807)
!812 = !DILocation(line: 283, column: 28, scope: !807)
!813 = !DILocation(line: 283, column: 39, scope: !807)
!814 = !DILocation(line: 283, column: 57, scope: !807)
!815 = !DILocation(line: 283, column: 63, scope: !807)
!816 = !DILocation(line: 283, column: 26, scope: !807)
!817 = !DILocation(line: 284, column: 6, scope: !818)
!818 = distinct !DILexicalBlock(scope: !807, file: !74, line: 284, column: 6)
!819 = !DILocation(line: 284, column: 14, scope: !818)
!820 = !DILocation(line: 284, column: 6, scope: !807)
!821 = !DILocation(line: 285, column: 114, scope: !822)
!822 = distinct !DILexicalBlock(scope: !818, file: !74, line: 284, column: 27)
!823 = !DILocation(line: 285, column: 122, scope: !822)
!824 = !DILocation(line: 285, column: 149, scope: !822)
!825 = !DILocation(line: 285, column: 137, scope: !822)
!826 = !DILocation(line: 285, column: 3, scope: !827)
!827 = !DILexicalBlockFile(scope: !822, file: !74, discriminator: 1)
!828 = !DILocation(line: 286, column: 3, scope: !822)
!829 = !DILocation(line: 288, column: 47, scope: !807)
!830 = !DILocation(line: 288, column: 24, scope: !807)
!831 = !DILocation(line: 288, column: 2, scope: !807)
!832 = !DILocation(line: 288, column: 10, scope: !807)
!833 = !DILocation(line: 288, column: 22, scope: !807)
!834 = !DILocation(line: 289, column: 2, scope: !807)
!835 = !DILocation(line: 289, column: 10, scope: !807)
!836 = !DILocation(line: 289, column: 22, scope: !807)
!837 = !DILocation(line: 290, column: 1, scope: !807)
!838 = !DILocation(line: 290, column: 1, scope: !839)
!839 = !DILexicalBlockFile(scope: !807, file: !74, discriminator: 1)
!840 = distinct !DISubprogram(name: "vrrp_gnotify_handler", scope: !74, file: !74, line: 292, type: !327, isLocal: true, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!841 = !DILocalVariable(name: "strvec", arg: 1, scope: !840, file: !74, line: 292, type: !329)
!842 = !DILocation(line: 292, column: 32, scope: !840)
!843 = !DILocalVariable(name: "vgroup", scope: !840, file: !74, line: 294, type: !525)
!844 = !DILocation(line: 294, column: 17, scope: !840)
!845 = !DILocation(line: 294, column: 28, scope: !840)
!846 = !DILocation(line: 294, column: 39, scope: !840)
!847 = !DILocation(line: 294, column: 57, scope: !840)
!848 = !DILocation(line: 294, column: 63, scope: !840)
!849 = !DILocation(line: 294, column: 26, scope: !840)
!850 = !DILocation(line: 295, column: 6, scope: !851)
!851 = distinct !DILexicalBlock(scope: !840, file: !74, line: 295, column: 6)
!852 = !DILocation(line: 295, column: 14, scope: !851)
!853 = !DILocation(line: 295, column: 6, scope: !840)
!854 = !DILocation(line: 296, column: 109, scope: !855)
!855 = distinct !DILexicalBlock(scope: !851, file: !74, line: 295, column: 22)
!856 = !DILocation(line: 296, column: 117, scope: !855)
!857 = !DILocation(line: 296, column: 144, scope: !855)
!858 = !DILocation(line: 296, column: 132, scope: !855)
!859 = !DILocation(line: 296, column: 3, scope: !860)
!860 = !DILexicalBlockFile(scope: !855, file: !74, discriminator: 1)
!861 = !DILocation(line: 297, column: 3, scope: !855)
!862 = !DILocation(line: 299, column: 42, scope: !840)
!863 = !DILocation(line: 299, column: 19, scope: !840)
!864 = !DILocation(line: 299, column: 2, scope: !840)
!865 = !DILocation(line: 299, column: 10, scope: !840)
!866 = !DILocation(line: 299, column: 17, scope: !840)
!867 = !DILocation(line: 300, column: 2, scope: !840)
!868 = !DILocation(line: 300, column: 10, scope: !840)
!869 = !DILocation(line: 300, column: 22, scope: !840)
!870 = !DILocation(line: 301, column: 1, scope: !840)
!871 = !DILocation(line: 301, column: 1, scope: !872)
!872 = !DILexicalBlockFile(scope: !840, file: !74, discriminator: 1)
!873 = distinct !DISubprogram(name: "vrrp_gsmtp_handler", scope: !74, file: !74, line: 303, type: !327, isLocal: true, isDefinition: true, scopeLine: 304, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!874 = !DILocalVariable(name: "strvec", arg: 1, scope: !873, file: !74, line: 303, type: !329)
!875 = !DILocation(line: 303, column: 54, scope: !873)
!876 = !DILocalVariable(name: "vgroup", scope: !873, file: !74, line: 305, type: !525)
!877 = !DILocation(line: 305, column: 17, scope: !873)
!878 = !DILocation(line: 305, column: 28, scope: !873)
!879 = !DILocation(line: 305, column: 39, scope: !873)
!880 = !DILocation(line: 305, column: 57, scope: !873)
!881 = !DILocation(line: 305, column: 63, scope: !873)
!882 = !DILocation(line: 305, column: 26, scope: !873)
!883 = !DILocalVariable(name: "res", scope: !873, file: !74, line: 306, type: !127)
!884 = !DILocation(line: 306, column: 6, scope: !873)
!885 = !DILocation(line: 308, column: 8, scope: !886)
!886 = distinct !DILexicalBlock(scope: !873, file: !74, line: 308, column: 6)
!887 = !DILocation(line: 308, column: 17, scope: !886)
!888 = !DILocation(line: 308, column: 28, scope: !886)
!889 = !DILocation(line: 308, column: 6, scope: !873)
!890 = !DILocation(line: 309, column: 38, scope: !891)
!891 = distinct !DILexicalBlock(scope: !886, file: !74, line: 308, column: 34)
!892 = !DILocation(line: 309, column: 26, scope: !891)
!893 = !DILocation(line: 309, column: 9, scope: !894)
!894 = !DILexicalBlockFile(scope: !891, file: !74, discriminator: 1)
!895 = !DILocation(line: 309, column: 7, scope: !891)
!896 = !DILocation(line: 310, column: 7, scope: !897)
!897 = distinct !DILexicalBlock(scope: !891, file: !74, line: 310, column: 7)
!898 = !DILocation(line: 310, column: 11, scope: !897)
!899 = !DILocation(line: 310, column: 7, scope: !891)
!900 = !DILocation(line: 311, column: 112, scope: !901)
!901 = distinct !DILexicalBlock(scope: !897, file: !74, line: 310, column: 18)
!902 = !DILocation(line: 311, column: 100, scope: !901)
!903 = !DILocation(line: 311, column: 4, scope: !904)
!904 = !DILexicalBlockFile(scope: !901, file: !74, discriminator: 1)
!905 = !DILocation(line: 312, column: 4, scope: !901)
!906 = !DILocation(line: 314, column: 2, scope: !891)
!907 = !DILocation(line: 315, column: 23, scope: !873)
!908 = !DILocation(line: 315, column: 2, scope: !873)
!909 = !DILocation(line: 315, column: 10, scope: !873)
!910 = !DILocation(line: 315, column: 21, scope: !873)
!911 = !DILocation(line: 316, column: 1, scope: !873)
!912 = !DILocation(line: 316, column: 1, scope: !913)
!913 = !DILexicalBlockFile(scope: !873, file: !74, discriminator: 1)
!914 = distinct !DISubprogram(name: "vrrp_gglobal_tracking_handler", scope: !74, file: !74, line: 318, type: !327, isLocal: true, isDefinition: true, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!915 = !DILocalVariable(name: "strvec", arg: 1, scope: !914, file: !74, line: 318, type: !329)
!916 = !DILocation(line: 318, column: 65, scope: !914)
!917 = !DILocalVariable(name: "vgroup", scope: !914, file: !74, line: 320, type: !525)
!918 = !DILocation(line: 320, column: 17, scope: !914)
!919 = !DILocation(line: 320, column: 28, scope: !914)
!920 = !DILocation(line: 320, column: 39, scope: !914)
!921 = !DILocation(line: 320, column: 57, scope: !914)
!922 = !DILocation(line: 320, column: 63, scope: !914)
!923 = !DILocation(line: 320, column: 26, scope: !914)
!924 = !DILocation(line: 322, column: 133, scope: !914)
!925 = !DILocation(line: 322, column: 141, scope: !914)
!926 = !DILocation(line: 322, column: 2, scope: !914)
!927 = !DILocation(line: 323, column: 2, scope: !914)
!928 = !DILocation(line: 323, column: 10, scope: !914)
!929 = !DILocation(line: 323, column: 33, scope: !914)
!930 = !DILocation(line: 324, column: 1, scope: !914)
!931 = distinct !DISubprogram(name: "vrrp_sg_tracking_weight_handler", scope: !74, file: !74, line: 326, type: !327, isLocal: true, isDefinition: true, scopeLine: 327, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!932 = !DILocalVariable(name: "strvec", arg: 1, scope: !931, file: !74, line: 326, type: !329)
!933 = !DILocation(line: 326, column: 67, scope: !931)
!934 = !DILocalVariable(name: "vgroup", scope: !931, file: !74, line: 328, type: !525)
!935 = !DILocation(line: 328, column: 17, scope: !931)
!936 = !DILocation(line: 328, column: 28, scope: !931)
!937 = !DILocation(line: 328, column: 39, scope: !931)
!938 = !DILocation(line: 328, column: 57, scope: !931)
!939 = !DILocation(line: 328, column: 63, scope: !931)
!940 = !DILocation(line: 328, column: 26, scope: !931)
!941 = !DILocation(line: 329, column: 2, scope: !931)
!942 = !DILocation(line: 329, column: 10, scope: !931)
!943 = !DILocation(line: 329, column: 33, scope: !931)
!944 = !DILocation(line: 330, column: 1, scope: !931)
!945 = distinct !DISubprogram(name: "garp_group_handler", scope: !74, file: !74, line: 1251, type: !327, isLocal: true, isDefinition: true, scopeLine: 1252, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!946 = !DILocalVariable(name: "strvec", arg: 1, scope: !945, file: !74, line: 1251, type: !329)
!947 = !DILocation(line: 1251, column: 30, scope: !945)
!948 = !DILocation(line: 1253, column: 7, scope: !949)
!949 = distinct !DILexicalBlock(scope: !945, file: !74, line: 1253, column: 6)
!950 = !DILocation(line: 1253, column: 6, scope: !945)
!951 = !DILocation(line: 1254, column: 3, scope: !949)
!952 = !DILocation(line: 1256, column: 2, scope: !945)
!953 = !DILocation(line: 1257, column: 1, scope: !945)
!954 = !DILocation(line: 1257, column: 1, scope: !955)
!955 = !DILexicalBlockFile(scope: !945, file: !74, discriminator: 1)
!956 = distinct !DISubprogram(name: "garp_group_garp_interval_handler", scope: !74, file: !74, line: 1259, type: !327, isLocal: true, isDefinition: true, scopeLine: 1260, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!957 = !DILocalVariable(name: "strvec", arg: 1, scope: !956, file: !74, line: 1259, type: !329)
!958 = !DILocation(line: 1259, column: 44, scope: !956)
!959 = !DILocalVariable(name: "delay", scope: !956, file: !74, line: 1261, type: !960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !20, line: 73, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !20, line: 65, size: 704, align: 64, elements: !963)
!963 = !{!964, !972, !973, !974, !975, !976, !977}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !962, file: !20, line: 66, baseType: !965, size: 128, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !966, line: 31, baseType: !967)
!966 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !968, line: 30, size: 128, align: 64, elements: !969)
!968 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !967, file: !968, line: 32, baseType: !115, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !967, file: !968, line: 33, baseType: !120, size: 64, align: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !962, file: !20, line: 67, baseType: !125, size: 8, align: 8, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !962, file: !20, line: 68, baseType: !965, size: 128, align: 64, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !962, file: !20, line: 69, baseType: !125, size: 8, align: 8, offset: 320)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !962, file: !20, line: 70, baseType: !965, size: 128, align: 64, offset: 384)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !962, file: !20, line: 71, baseType: !965, size: 128, align: 64, offset: 512)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !962, file: !20, line: 72, baseType: !127, size: 32, align: 32, offset: 640)
!978 = !DILocation(line: 1261, column: 16, scope: !956)
!979 = !DILocation(line: 1261, column: 26, scope: !956)
!980 = !DILocation(line: 1261, column: 39, scope: !956)
!981 = !DILocation(line: 1261, column: 45, scope: !956)
!982 = !DILocation(line: 1261, column: 24, scope: !956)
!983 = !DILocalVariable(name: "val", scope: !956, file: !74, line: 1262, type: !984)
!984 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!985 = !DILocation(line: 1262, column: 9, scope: !956)
!986 = !DILocation(line: 1264, column: 26, scope: !987)
!987 = distinct !DILexicalBlock(scope: !956, file: !74, line: 1264, column: 6)
!988 = !DILocation(line: 1264, column: 7, scope: !987)
!989 = !DILocation(line: 1264, column: 6, scope: !956)
!990 = !DILocation(line: 1265, column: 106, scope: !991)
!991 = distinct !DILexicalBlock(scope: !987, file: !74, line: 1264, column: 71)
!992 = !DILocation(line: 1265, column: 94, scope: !991)
!993 = !DILocation(line: 1265, column: 3, scope: !994)
!994 = !DILexicalBlockFile(scope: !991, file: !74, discriminator: 1)
!995 = !DILocation(line: 1266, column: 3, scope: !991)
!996 = !DILocation(line: 1269, column: 40, scope: !956)
!997 = !DILocation(line: 1269, column: 32, scope: !956)
!998 = !DILocation(line: 1269, column: 2, scope: !956)
!999 = !DILocation(line: 1269, column: 9, scope: !956)
!1000 = !DILocation(line: 1269, column: 23, scope: !956)
!1001 = !DILocation(line: 1269, column: 30, scope: !956)
!1002 = !DILocation(line: 1270, column: 48, scope: !956)
!1003 = !DILocation(line: 1270, column: 54, scope: !956)
!1004 = !DILocation(line: 1270, column: 61, scope: !956)
!1005 = !DILocation(line: 1270, column: 75, scope: !956)
!1006 = !DILocation(line: 1270, column: 52, scope: !956)
!1007 = !DILocation(line: 1270, column: 83, scope: !956)
!1008 = !DILocation(line: 1270, column: 33, scope: !956)
!1009 = !DILocation(line: 1270, column: 2, scope: !956)
!1010 = !DILocation(line: 1270, column: 9, scope: !956)
!1011 = !DILocation(line: 1270, column: 23, scope: !956)
!1012 = !DILocation(line: 1270, column: 31, scope: !956)
!1013 = !DILocation(line: 1271, column: 2, scope: !956)
!1014 = !DILocation(line: 1271, column: 9, scope: !956)
!1015 = !DILocation(line: 1271, column: 28, scope: !956)
!1016 = !DILocation(line: 1273, column: 6, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !956, file: !74, line: 1273, column: 6)
!1018 = !DILocation(line: 1273, column: 13, scope: !1017)
!1019 = !DILocation(line: 1273, column: 27, scope: !1017)
!1020 = !DILocation(line: 1273, column: 34, scope: !1017)
!1021 = !DILocation(line: 1273, column: 6, scope: !956)
!1022 = !DILocation(line: 1274, column: 92, scope: !1017)
!1023 = !DILocation(line: 1274, column: 80, scope: !1017)
!1024 = !DILocation(line: 1274, column: 3, scope: !1025)
!1025 = !DILexicalBlockFile(scope: !1017, file: !74, discriminator: 1)
!1026 = !DILocation(line: 1274, column: 3, scope: !1017)
!1027 = !DILocation(line: 1275, column: 1, scope: !956)
!1028 = distinct !DISubprogram(name: "garp_group_gna_interval_handler", scope: !74, file: !74, line: 1277, type: !327, isLocal: true, isDefinition: true, scopeLine: 1278, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!1029 = !DILocalVariable(name: "strvec", arg: 1, scope: !1028, file: !74, line: 1277, type: !329)
!1030 = !DILocation(line: 1277, column: 43, scope: !1028)
!1031 = !DILocalVariable(name: "delay", scope: !1028, file: !74, line: 1279, type: !960)
!1032 = !DILocation(line: 1279, column: 16, scope: !1028)
!1033 = !DILocation(line: 1279, column: 26, scope: !1028)
!1034 = !DILocation(line: 1279, column: 39, scope: !1028)
!1035 = !DILocation(line: 1279, column: 45, scope: !1028)
!1036 = !DILocation(line: 1279, column: 24, scope: !1028)
!1037 = !DILocalVariable(name: "val", scope: !1028, file: !74, line: 1280, type: !984)
!1038 = !DILocation(line: 1280, column: 9, scope: !1028)
!1039 = !DILocation(line: 1282, column: 26, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1028, file: !74, line: 1282, column: 6)
!1041 = !DILocation(line: 1282, column: 7, scope: !1040)
!1042 = !DILocation(line: 1282, column: 6, scope: !1028)
!1043 = !DILocation(line: 1283, column: 105, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1040, file: !74, line: 1282, column: 71)
!1045 = !DILocation(line: 1283, column: 93, scope: !1044)
!1046 = !DILocation(line: 1283, column: 3, scope: !1047)
!1047 = !DILexicalBlockFile(scope: !1044, file: !74, discriminator: 1)
!1048 = !DILocation(line: 1284, column: 3, scope: !1044)
!1049 = !DILocation(line: 1287, column: 39, scope: !1028)
!1050 = !DILocation(line: 1287, column: 31, scope: !1028)
!1051 = !DILocation(line: 1287, column: 2, scope: !1028)
!1052 = !DILocation(line: 1287, column: 9, scope: !1028)
!1053 = !DILocation(line: 1287, column: 22, scope: !1028)
!1054 = !DILocation(line: 1287, column: 29, scope: !1028)
!1055 = !DILocation(line: 1288, column: 47, scope: !1028)
!1056 = !DILocation(line: 1288, column: 53, scope: !1028)
!1057 = !DILocation(line: 1288, column: 60, scope: !1028)
!1058 = !DILocation(line: 1288, column: 73, scope: !1028)
!1059 = !DILocation(line: 1288, column: 51, scope: !1028)
!1060 = !DILocation(line: 1288, column: 81, scope: !1028)
!1061 = !DILocation(line: 1288, column: 32, scope: !1028)
!1062 = !DILocation(line: 1288, column: 2, scope: !1028)
!1063 = !DILocation(line: 1288, column: 9, scope: !1028)
!1064 = !DILocation(line: 1288, column: 22, scope: !1028)
!1065 = !DILocation(line: 1288, column: 30, scope: !1028)
!1066 = !DILocation(line: 1289, column: 2, scope: !1028)
!1067 = !DILocation(line: 1289, column: 9, scope: !1028)
!1068 = !DILocation(line: 1289, column: 27, scope: !1028)
!1069 = !DILocation(line: 1291, column: 6, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1028, file: !74, line: 1291, column: 6)
!1071 = !DILocation(line: 1291, column: 13, scope: !1070)
!1072 = !DILocation(line: 1291, column: 26, scope: !1070)
!1073 = !DILocation(line: 1291, column: 33, scope: !1070)
!1074 = !DILocation(line: 1291, column: 6, scope: !1028)
!1075 = !DILocation(line: 1292, column: 91, scope: !1070)
!1076 = !DILocation(line: 1292, column: 79, scope: !1070)
!1077 = !DILocation(line: 1292, column: 3, scope: !1078)
!1078 = !DILexicalBlockFile(scope: !1070, file: !74, discriminator: 1)
!1079 = !DILocation(line: 1292, column: 3, scope: !1070)
!1080 = !DILocation(line: 1293, column: 1, scope: !1028)
!1081 = distinct !DISubprogram(name: "garp_group_interface_handler", scope: !74, file: !74, line: 1295, type: !327, isLocal: true, isDefinition: true, scopeLine: 1296, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!1082 = !DILocalVariable(name: "strvec", arg: 1, scope: !1081, file: !74, line: 1295, type: !329)
!1083 = !DILocation(line: 1295, column: 40, scope: !1081)
!1084 = !DILocalVariable(name: "ifp", scope: !1081, file: !74, line: 1297, type: !1085)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !20, line: 111, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !20, line: 76, size: 1792, align: 64, elements: !1088)
!1088 = !{!1089, !1093, !1096, !1102, !1119, !1120, !1121, !1122, !1123, !1129, !1130, !1131, !1132, !1133, !1134, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !1087, file: !20, line: 77, baseType: !1090, size: 128, align: 8)
!1090 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 128, align: 8, elements: !1091)
!1091 = !{!1092}
!1092 = !DISubrange(count: 16)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !1087, file: !20, line: 78, baseType: !1094, size: 32, align: 32, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !20, line: 62, baseType: !1095)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !122, line: 51, baseType: !124)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !1087, file: !20, line: 79, baseType: !1097, size: 32, align: 32, offset: 160)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !1098, line: 31, size: 32, align: 32, elements: !1099)
!1098 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!1099 = !{!1100}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !1097, file: !1098, line: 33, baseType: !1101, size: 32, align: 32)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !1098, line: 30, baseType: !1095)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !1087, file: !20, line: 80, baseType: !1103, size: 128, align: 32, offset: 192)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !1098, line: 211, size: 128, align: 32, elements: !1104)
!1104 = !{!1105}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !1103, file: !1098, line: 220, baseType: !1106, size: 128, align: 32)
!1106 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1103, file: !1098, line: 213, size: 128, align: 32, elements: !1107)
!1107 = !{!1108, !1110, !1115}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !1106, file: !1098, line: 215, baseType: !1109, size: 128, align: 8)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 128, align: 8, elements: !1091)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !1106, file: !1098, line: 217, baseType: !1111, size: 128, align: 16)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1112, size: 128, align: 16, elements: !1113)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !122, line: 49, baseType: !128)
!1113 = !{!1114}
!1114 = !DISubrange(count: 8)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !1106, file: !1098, line: 218, baseType: !1116, size: 128, align: 32)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1095, size: 128, align: 32, elements: !1117)
!1117 = !{!1118}
!1118 = !DISubrange(count: 4)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !1087, file: !20, line: 81, baseType: !124, size: 32, align: 32, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !1087, file: !20, line: 82, baseType: !125, size: 8, align: 8, offset: 352)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !1087, file: !20, line: 83, baseType: !1095, size: 32, align: 32, offset: 384)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !1087, file: !20, line: 84, baseType: !128, size: 16, align: 16, offset: 416)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !1087, file: !20, line: 85, baseType: !1124, size: 256, align: 8, offset: 432)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1125, size: 256, align: 8, elements: !1127)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !119, line: 33, baseType: !1126)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !116, line: 30, baseType: !123)
!1127 = !{!1128}
!1128 = !DISubrange(count: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !1087, file: !20, line: 86, baseType: !1124, size: 256, align: 8, offset: 688)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !1087, file: !20, line: 87, baseType: !201, size: 64, align: 64, offset: 960)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !1087, file: !20, line: 88, baseType: !127, size: 32, align: 32, offset: 1024)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !1087, file: !20, line: 90, baseType: !125, size: 8, align: 8, offset: 1056)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !1087, file: !20, line: 91, baseType: !1094, size: 32, align: 32, offset: 1088)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !1087, file: !20, line: 92, baseType: !1135, size: 64, align: 64, offset: 1152)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !1087, file: !20, line: 94, baseType: !1094, size: 32, align: 32, offset: 1216)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !1087, file: !20, line: 96, baseType: !1135, size: 64, align: 64, offset: 1280)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !1087, file: !20, line: 97, baseType: !125, size: 8, align: 8, offset: 1344)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !1087, file: !20, line: 100, baseType: !960, size: 64, align: 64, offset: 1408)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !1087, file: !20, line: 101, baseType: !125, size: 8, align: 8, offset: 1472)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !1087, file: !20, line: 102, baseType: !127, size: 32, align: 32, offset: 1504)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !1087, file: !20, line: 103, baseType: !1095, size: 32, align: 32, offset: 1536)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !1087, file: !20, line: 104, baseType: !1095, size: 32, align: 32, offset: 1568)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !1087, file: !20, line: 105, baseType: !1095, size: 32, align: 32, offset: 1600)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !1087, file: !20, line: 107, baseType: !124, size: 32, align: 32, offset: 1632)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !1087, file: !20, line: 109, baseType: !125, size: 8, align: 8, offset: 1664)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !1087, file: !20, line: 110, baseType: !131, size: 64, align: 64, offset: 1728)
!1148 = !DILocation(line: 1297, column: 15, scope: !1081)
!1149 = !DILocation(line: 1297, column: 50, scope: !1081)
!1150 = !DILocation(line: 1297, column: 38, scope: !1081)
!1151 = !DILocation(line: 1297, column: 21, scope: !1152)
!1152 = !DILexicalBlockFile(scope: !1081, file: !74, discriminator: 1)
!1153 = !DILocation(line: 1298, column: 7, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1081, file: !74, line: 1298, column: 6)
!1155 = !DILocation(line: 1298, column: 6, scope: !1081)
!1156 = !DILocation(line: 1299, column: 130, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1154, file: !74, line: 1298, column: 12)
!1158 = !DILocation(line: 1299, column: 118, scope: !1157)
!1159 = !DILocation(line: 1299, column: 3, scope: !1160)
!1160 = !DILexicalBlockFile(scope: !1157, file: !74, discriminator: 1)
!1161 = !DILocation(line: 1300, column: 3, scope: !1157)
!1162 = !DILocation(line: 1303, column: 6, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1081, file: !74, line: 1303, column: 6)
!1164 = !DILocation(line: 1303, column: 11, scope: !1163)
!1165 = !DILocation(line: 1303, column: 6, scope: !1081)
!1166 = !DILocation(line: 1304, column: 115, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1163, file: !74, line: 1303, column: 23)
!1168 = !DILocation(line: 1304, column: 103, scope: !1167)
!1169 = !DILocation(line: 1304, column: 3, scope: !1170)
!1170 = !DILexicalBlockFile(scope: !1167, file: !74, discriminator: 1)
!1171 = !DILocation(line: 1305, column: 3, scope: !1167)
!1172 = !DILocation(line: 1310, column: 6, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1081, file: !74, line: 1310, column: 6)
!1174 = !DILocation(line: 1310, column: 11, scope: !1173)
!1175 = !DILocation(line: 1310, column: 6, scope: !1081)
!1176 = !DILocation(line: 1311, column: 100, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1173, file: !74, line: 1310, column: 17)
!1178 = !DILocation(line: 1311, column: 105, scope: !1177)
!1179 = !DILocation(line: 1311, column: 3, scope: !1177)
!1180 = !DILocation(line: 1312, column: 3, scope: !1177)
!1181 = !DILocation(line: 1315, column: 22, scope: !1081)
!1182 = !DILocation(line: 1315, column: 35, scope: !1081)
!1183 = !DILocation(line: 1315, column: 41, scope: !1081)
!1184 = !DILocation(line: 1315, column: 20, scope: !1081)
!1185 = !DILocation(line: 1315, column: 2, scope: !1081)
!1186 = !DILocation(line: 1315, column: 7, scope: !1081)
!1187 = !DILocation(line: 1315, column: 18, scope: !1081)
!1188 = !DILocation(line: 1316, column: 1, scope: !1081)
!1189 = !DILocation(line: 1316, column: 1, scope: !1152)
!1190 = distinct !DISubprogram(name: "garp_group_interfaces_handler", scope: !74, file: !74, line: 1318, type: !327, isLocal: true, isDefinition: true, scopeLine: 1319, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!1191 = !DILocalVariable(name: "strvec", arg: 1, scope: !1190, file: !74, line: 1318, type: !329)
!1192 = !DILocation(line: 1318, column: 41, scope: !1190)
!1193 = !DILocalVariable(name: "delay", scope: !1190, file: !74, line: 1320, type: !960)
!1194 = !DILocation(line: 1320, column: 16, scope: !1190)
!1195 = !DILocation(line: 1320, column: 26, scope: !1190)
!1196 = !DILocation(line: 1320, column: 39, scope: !1190)
!1197 = !DILocation(line: 1320, column: 45, scope: !1190)
!1198 = !DILocation(line: 1320, column: 24, scope: !1190)
!1199 = !DILocalVariable(name: "ifp", scope: !1190, file: !74, line: 1321, type: !1085)
!1200 = !DILocation(line: 1321, column: 15, scope: !1190)
!1201 = !DILocalVariable(name: "interface_vec", scope: !1190, file: !74, line: 1322, type: !329)
!1202 = !DILocation(line: 1322, column: 12, scope: !1190)
!1203 = !DILocation(line: 1322, column: 45, scope: !1190)
!1204 = !DILocation(line: 1322, column: 28, scope: !1190)
!1205 = !DILocalVariable(name: "i", scope: !1190, file: !74, line: 1323, type: !201)
!1206 = !DILocation(line: 1323, column: 9, scope: !1190)
!1207 = !DILocalVariable(name: "gd", scope: !1190, file: !74, line: 1324, type: !960)
!1208 = !DILocation(line: 1324, column: 16, scope: !1190)
!1209 = !DILocalVariable(name: "e", scope: !1190, file: !74, line: 1325, type: !341)
!1210 = !DILocation(line: 1325, column: 10, scope: !1190)
!1211 = !DILocation(line: 1328, column: 7, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1190, file: !74, line: 1328, column: 6)
!1213 = !DILocation(line: 1328, column: 6, scope: !1190)
!1214 = !DILocation(line: 1329, column: 3, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1212, file: !74, line: 1328, column: 22)
!1216 = !DILocation(line: 1330, column: 3, scope: !1215)
!1217 = !DILocation(line: 1334, column: 2, scope: !1190)
!1218 = !DILocation(line: 1334, column: 9, scope: !1190)
!1219 = !DILocation(line: 1334, column: 27, scope: !1190)
!1220 = !DILocation(line: 1335, column: 14, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1190, file: !74, line: 1335, column: 2)
!1222 = !DILocation(line: 1335, column: 13, scope: !1221)
!1223 = !DILocation(line: 1335, column: 12, scope: !1221)
!1224 = !DILocation(line: 1335, column: 12, scope: !1225)
!1225 = !DILexicalBlockFile(scope: !1221, file: !74, discriminator: 1)
!1226 = !DILocation(line: 1335, column: 13, scope: !1227)
!1227 = !DILexicalBlockFile(scope: !1221, file: !74, discriminator: 2)
!1228 = !DILocation(line: 1335, column: 26, scope: !1227)
!1229 = !DILocation(line: 1335, column: 12, scope: !1227)
!1230 = !DILocation(line: 1335, column: 12, scope: !1231)
!1231 = !DILexicalBlockFile(scope: !1221, file: !74, discriminator: 3)
!1232 = !DILocation(line: 1335, column: 9, scope: !1231)
!1233 = !DILocation(line: 1335, column: 7, scope: !1231)
!1234 = !DILocation(line: 1335, column: 33, scope: !1235)
!1235 = !DILexicalBlockFile(scope: !1236, file: !74, discriminator: 4)
!1236 = distinct !DILexicalBlock(scope: !1221, file: !74, line: 1335, column: 2)
!1237 = !DILocation(line: 1335, column: 2, scope: !1235)
!1238 = !DILocation(line: 1336, column: 10, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1236, file: !74, line: 1335, column: 55)
!1240 = !DILocation(line: 1336, column: 14, scope: !1239)
!1241 = !DILocation(line: 1336, column: 8, scope: !1239)
!1242 = !DILocation(line: 1336, column: 6, scope: !1239)
!1243 = !DILocation(line: 1337, column: 7, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1239, file: !74, line: 1337, column: 7)
!1245 = !DILocation(line: 1337, column: 11, scope: !1244)
!1246 = !DILocation(line: 1337, column: 29, scope: !1244)
!1247 = !DILocation(line: 1337, column: 32, scope: !1248)
!1248 = !DILexicalBlockFile(scope: !1244, file: !74, discriminator: 1)
!1249 = !DILocation(line: 1337, column: 38, scope: !1248)
!1250 = !DILocation(line: 1337, column: 35, scope: !1248)
!1251 = !DILocation(line: 1337, column: 7, scope: !1248)
!1252 = !DILocation(line: 1338, column: 4, scope: !1244)
!1253 = !DILocation(line: 1338, column: 11, scope: !1244)
!1254 = !DILocation(line: 1338, column: 28, scope: !1244)
!1255 = !DILocation(line: 1339, column: 2, scope: !1239)
!1256 = !DILocation(line: 1335, column: 44, scope: !1257)
!1257 = !DILexicalBlockFile(scope: !1236, file: !74, discriminator: 5)
!1258 = !DILocation(line: 1335, column: 48, scope: !1257)
!1259 = !DILocation(line: 1335, column: 41, scope: !1257)
!1260 = !DILocation(line: 1335, column: 2, scope: !1257)
!1261 = distinct !{!1261, !1262}
!1262 = !DILocation(line: 1335, column: 2, scope: !1190)
!1263 = !DILocation(line: 1341, column: 9, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1190, file: !74, line: 1341, column: 2)
!1265 = !DILocation(line: 1341, column: 7, scope: !1264)
!1266 = !DILocation(line: 1341, column: 14, scope: !1267)
!1267 = !DILexicalBlockFile(scope: !1268, file: !74, discriminator: 1)
!1268 = distinct !DILexicalBlock(scope: !1264, file: !74, line: 1341, column: 2)
!1269 = !DILocation(line: 1341, column: 20, scope: !1267)
!1270 = !DILocation(line: 1341, column: 36, scope: !1267)
!1271 = !DILocation(line: 1341, column: 18, scope: !1267)
!1272 = !DILocation(line: 1341, column: 16, scope: !1267)
!1273 = !DILocation(line: 1341, column: 2, scope: !1267)
!1274 = !DILocation(line: 1342, column: 50, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1268, file: !74, line: 1341, column: 53)
!1276 = !DILocation(line: 1342, column: 28, scope: !1275)
!1277 = !DILocation(line: 1342, column: 44, scope: !1275)
!1278 = !DILocation(line: 1342, column: 27, scope: !1275)
!1279 = !DILocation(line: 1342, column: 9, scope: !1275)
!1280 = !DILocation(line: 1342, column: 7, scope: !1275)
!1281 = !DILocation(line: 1343, column: 8, scope: !1282)
!1282 = distinct !DILexicalBlock(scope: !1275, file: !74, line: 1343, column: 7)
!1283 = !DILocation(line: 1343, column: 7, scope: !1275)
!1284 = !DILocation(line: 1344, column: 8, scope: !1285)
!1285 = distinct !DILexicalBlock(scope: !1286, file: !74, line: 1344, column: 8)
!1286 = distinct !DILexicalBlock(scope: !1282, file: !74, line: 1343, column: 13)
!1287 = !DILocation(line: 1344, column: 21, scope: !1285)
!1288 = !DILocation(line: 1344, column: 8, scope: !1286)
!1289 = !DILocation(line: 1345, column: 111, scope: !1285)
!1290 = !DILocation(line: 1345, column: 118, scope: !1285)
!1291 = !DILocation(line: 1345, column: 99, scope: !1285)
!1292 = !DILocation(line: 1345, column: 5, scope: !1293)
!1293 = !DILexicalBlockFile(scope: !1285, file: !74, discriminator: 1)
!1294 = !DILocation(line: 1345, column: 5, scope: !1285)
!1295 = !DILocation(line: 1347, column: 132, scope: !1285)
!1296 = !DILocation(line: 1347, column: 139, scope: !1285)
!1297 = !DILocation(line: 1347, column: 120, scope: !1285)
!1298 = !DILocation(line: 1347, column: 5, scope: !1293)
!1299 = !DILocation(line: 1348, column: 4, scope: !1286)
!1300 = !DILocation(line: 1351, column: 7, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !1275, file: !74, line: 1351, column: 7)
!1302 = !DILocation(line: 1351, column: 12, scope: !1301)
!1303 = !DILocation(line: 1351, column: 7, scope: !1275)
!1304 = !DILocation(line: 1352, column: 116, scope: !1305)
!1305 = distinct !DILexicalBlock(scope: !1301, file: !74, line: 1351, column: 24)
!1306 = !DILocation(line: 1352, column: 104, scope: !1305)
!1307 = !DILocation(line: 1352, column: 4, scope: !1308)
!1308 = !DILexicalBlockFile(scope: !1305, file: !74, discriminator: 1)
!1309 = !DILocation(line: 1353, column: 4, scope: !1305)
!1310 = !DILocation(line: 1357, column: 7, scope: !1311)
!1311 = distinct !DILexicalBlock(scope: !1275, file: !74, line: 1357, column: 7)
!1312 = !DILocation(line: 1357, column: 12, scope: !1311)
!1313 = !DILocation(line: 1357, column: 7, scope: !1275)
!1314 = !DILocation(line: 1358, column: 101, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1311, file: !74, line: 1357, column: 18)
!1316 = !DILocation(line: 1358, column: 106, scope: !1315)
!1317 = !DILocation(line: 1358, column: 4, scope: !1315)
!1318 = !DILocation(line: 1359, column: 4, scope: !1315)
!1319 = !DILocation(line: 1362, column: 21, scope: !1275)
!1320 = !DILocation(line: 1362, column: 3, scope: !1275)
!1321 = !DILocation(line: 1362, column: 8, scope: !1275)
!1322 = !DILocation(line: 1362, column: 19, scope: !1275)
!1323 = !DILocation(line: 1363, column: 2, scope: !1275)
!1324 = !DILocation(line: 1341, column: 49, scope: !1325)
!1325 = !DILexicalBlockFile(scope: !1268, file: !74, discriminator: 2)
!1326 = !DILocation(line: 1341, column: 2, scope: !1325)
!1327 = distinct !{!1327, !1328}
!1328 = !DILocation(line: 1341, column: 2, scope: !1190)
!1329 = !DILocation(line: 1365, column: 14, scope: !1190)
!1330 = !DILocation(line: 1365, column: 2, scope: !1190)
!1331 = !DILocation(line: 1366, column: 1, scope: !1190)
!1332 = !DILocation(line: 1366, column: 1, scope: !1333)
!1333 = !DILexicalBlockFile(scope: !1190, file: !74, discriminator: 1)
!1334 = distinct !DISubprogram(name: "garp_group_end_handler", scope: !74, file: !74, line: 1368, type: !1335, isLocal: true, isDefinition: true, scopeLine: 1369, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!1335 = !DISubroutineType(types: !1336)
!1336 = !{null}
!1337 = !DILocalVariable(name: "delay", scope: !1334, file: !74, line: 1370, type: !960)
!1338 = !DILocation(line: 1370, column: 16, scope: !1334)
!1339 = !DILocation(line: 1370, column: 26, scope: !1334)
!1340 = !DILocation(line: 1370, column: 39, scope: !1334)
!1341 = !DILocation(line: 1370, column: 45, scope: !1334)
!1342 = !DILocation(line: 1370, column: 24, scope: !1334)
!1343 = !DILocalVariable(name: "e", scope: !1334, file: !74, line: 1371, type: !341)
!1344 = !DILocation(line: 1371, column: 10, scope: !1334)
!1345 = !DILocalVariable(name: "next", scope: !1334, file: !74, line: 1371, type: !341)
!1346 = !DILocation(line: 1371, column: 13, scope: !1334)
!1347 = !DILocalVariable(name: "ifp", scope: !1334, file: !74, line: 1372, type: !1085)
!1348 = !DILocation(line: 1372, column: 15, scope: !1334)
!1349 = !DILocation(line: 1374, column: 7, scope: !1350)
!1350 = distinct !DILexicalBlock(scope: !1334, file: !74, line: 1374, column: 6)
!1351 = !DILocation(line: 1374, column: 14, scope: !1350)
!1352 = !DILocation(line: 1374, column: 33, scope: !1350)
!1353 = !DILocation(line: 1374, column: 37, scope: !1354)
!1354 = !DILexicalBlockFile(scope: !1350, file: !74, discriminator: 1)
!1355 = !DILocation(line: 1374, column: 44, scope: !1354)
!1356 = !DILocation(line: 1374, column: 6, scope: !1354)
!1357 = !DILocation(line: 1375, column: 101, scope: !1358)
!1358 = distinct !DILexicalBlock(scope: !1350, file: !74, line: 1374, column: 63)
!1359 = !DILocation(line: 1375, column: 108, scope: !1358)
!1360 = !DILocation(line: 1375, column: 3, scope: !1358)
!1361 = !DILocation(line: 1378, column: 16, scope: !1362)
!1362 = distinct !DILexicalBlock(scope: !1358, file: !74, line: 1378, column: 3)
!1363 = !DILocation(line: 1378, column: 15, scope: !1362)
!1364 = !DILocation(line: 1378, column: 36, scope: !1365)
!1365 = !DILexicalBlockFile(scope: !1362, file: !74, discriminator: 1)
!1366 = !DILocation(line: 1378, column: 34, scope: !1365)
!1367 = !DILocation(line: 1378, column: 34, scope: !1368)
!1368 = !DILexicalBlockFile(scope: !1362, file: !74, discriminator: 2)
!1369 = !DILocation(line: 1378, column: 5, scope: !1370)
!1370 = !DILexicalBlockFile(scope: !1362, file: !74, discriminator: 3)
!1371 = !DILocation(line: 1378, column: 21, scope: !1370)
!1372 = !DILocation(line: 1378, column: 34, scope: !1370)
!1373 = !DILocation(line: 1378, column: 34, scope: !1374)
!1374 = !DILexicalBlockFile(scope: !1362, file: !74, discriminator: 4)
!1375 = !DILocation(line: 1378, column: 15, scope: !1374)
!1376 = !DILocation(line: 1378, column: 15, scope: !1377)
!1377 = !DILexicalBlockFile(scope: !1362, file: !74, discriminator: 5)
!1378 = !DILocation(line: 1378, column: 15, scope: !1379)
!1379 = !DILexicalBlockFile(scope: !1362, file: !74, discriminator: 6)
!1380 = !DILocation(line: 1378, column: 12, scope: !1379)
!1381 = !DILocation(line: 1378, column: 8, scope: !1379)
!1382 = !DILocation(line: 1378, column: 6, scope: !1383)
!1383 = !DILexicalBlockFile(scope: !1384, file: !74, discriminator: 7)
!1384 = distinct !DILexicalBlock(scope: !1362, file: !74, line: 1378, column: 3)
!1385 = !DILocation(line: 1378, column: 5, scope: !1383)
!1386 = !DILocation(line: 1378, column: 9, scope: !1383)
!1387 = !DILocation(line: 1378, column: 23, scope: !1388)
!1388 = !DILexicalBlockFile(scope: !1384, file: !74, discriminator: 8)
!1389 = !DILocation(line: 1378, column: 27, scope: !1388)
!1390 = !DILocation(line: 1378, column: 20, scope: !1388)
!1391 = !DILocation(line: 1378, column: 43, scope: !1388)
!1392 = !DILocation(line: 1378, column: 47, scope: !1388)
!1393 = !DILocation(line: 1378, column: 41, scope: !1388)
!1394 = !DILocation(line: 1378, column: 39, scope: !1388)
!1395 = !DILocation(line: 1378, column: 3, scope: !1396)
!1396 = !DILexicalBlockFile(scope: !1362, file: !74, discriminator: 9)
!1397 = !DILocation(line: 1379, column: 8, scope: !1398)
!1398 = distinct !DILexicalBlock(scope: !1399, file: !74, line: 1379, column: 8)
!1399 = distinct !DILexicalBlock(scope: !1384, file: !74, line: 1378, column: 72)
!1400 = !DILocation(line: 1379, column: 13, scope: !1398)
