; ModuleID = './[inter]keepalived--vrrp--vrrp_sync.o.i'
source_filename = "./[inter]keepalived--vrrp--vrrp_sync.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._vrrp_data = type { %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !48)
!1 = !DIFile(filename: "[inter]keepalived--vrrp--vrrp_sync.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!2 = !{!3, !11, !32}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chksum_compatibility", file: !4, line: 173, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./../include/vrrp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NONE", value: 0)
!7 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NEVER", value: 1)
!8 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_MIN_COMPAT", value: 2)
!9 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_CONFIG", value: 3)
!10 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_AUTO", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 41, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "../../lib/scheduler.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!14 = !DIEnumerator(name: "THREAD_READ", value: 0)
!15 = !DIEnumerator(name: "THREAD_WRITE", value: 1)
!16 = !DIEnumerator(name: "THREAD_TIMER", value: 2)
!17 = !DIEnumerator(name: "THREAD_TIMER_SHUTDOWN", value: 3)
!18 = !DIEnumerator(name: "THREAD_EVENT", value: 4)
!19 = !DIEnumerator(name: "THREAD_CHILD", value: 5)
!20 = !DIEnumerator(name: "THREAD_READY", value: 6)
!21 = !DIEnumerator(name: "THREAD_UNUSED", value: 7)
!22 = !DIEnumerator(name: "THREAD_WRITE_TIMEOUT", value: 8)
!23 = !DIEnumerator(name: "THREAD_READ_TIMEOUT", value: 9)
!24 = !DIEnumerator(name: "THREAD_CHILD_TIMEOUT", value: 10)
!25 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!26 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!27 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!28 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!29 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!30 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!31 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 44, size: 32, align: 32, elements: !34)
!33 = !DIFile(filename: "../../lib/parser.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47}
!35 = !DIEnumerator(name: "CONFIG_OK", value: 0)
!36 = !DIEnumerator(name: "CONFIG_FILE_NOT_FOUND", value: 1)
!37 = !DIEnumerator(name: "CONFIG_BAD_IF", value: 2)
!38 = !DIEnumerator(name: "CONFIG_FATAL", value: 3)
!39 = !DIEnumerator(name: "CONFIG_MULTIPLE_FILES", value: 4)
!40 = !DIEnumerator(name: "CONFIG_UNKNOWN_KEYWORD", value: 5)
!41 = !DIEnumerator(name: "CONFIG_UNEXPECTED_BOB", value: 6)
!42 = !DIEnumerator(name: "CONFIG_MISSING_BOB", value: 7)
!43 = !DIEnumerator(name: "CONFIG_UNMATCHED_QUOTE", value: 8)
!44 = !DIEnumerator(name: "CONFIG_MISSING_PARAMETER", value: 9)
!45 = !DIEnumerator(name: "CONFIG_INVALID_NUMBER", value: 10)
!46 = !DIEnumerator(name: "CONFIG_GENERAL_ERROR", value: 11)
!47 = !DIEnumerator(name: "CONFIG_SECURITY_ERROR", value: 12)
!48 = !{!49}
!49 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !50, line: 150, type: !51, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!50 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !52, line: 31, baseType: !53)
!52 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !52, line: 39, size: 320, align: 64, elements: !55)
!55 = !{!56, !64, !65, !67, !71}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !54, file: !52, line: 40, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !52, line: 33, size: 192, align: 64, elements: !59)
!59 = !{!60, !61, !62}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !58, file: !52, line: 34, baseType: !57, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !58, file: !52, line: 35, baseType: !57, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !58, file: !52, line: 36, baseType: !63, size: 64, align: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !54, file: !52, line: 41, baseType: !57, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !54, file: !52, line: 42, baseType: !66, size: 32, align: 32, offset: 128)
!66 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !54, file: !52, line: 43, baseType: !68, size: 64, align: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !63}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !54, file: !52, line: 44, baseType: !72, size: 64, align: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !75, !63}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !77, line: 48, baseType: !78)
!77 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !79, line: 241, size: 1728, align: 64, elements: !80)
!79 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!80 = !{!81, !83, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !104, !105, !106, !107, !111, !113, !115, !119, !122, !124, !125, !126, !127, !128, !132, !133}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !79, line: 242, baseType: !82, size: 32, align: 32)
!82 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !78, file: !79, line: 247, baseType: !84, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !78, file: !79, line: 248, baseType: !84, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !78, file: !79, line: 249, baseType: !84, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !78, file: !79, line: 250, baseType: !84, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !78, file: !79, line: 251, baseType: !84, size: 64, align: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !78, file: !79, line: 252, baseType: !84, size: 64, align: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !78, file: !79, line: 253, baseType: !84, size: 64, align: 64, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !78, file: !79, line: 254, baseType: !84, size: 64, align: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !78, file: !79, line: 256, baseType: !84, size: 64, align: 64, offset: 576)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !78, file: !79, line: 257, baseType: !84, size: 64, align: 64, offset: 640)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !78, file: !79, line: 258, baseType: !84, size: 64, align: 64, offset: 704)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !78, file: !79, line: 260, baseType: !97, size: 64, align: 64, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !79, line: 156, size: 192, align: 64, elements: !99)
!99 = !{!100, !101, !103}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !98, file: !79, line: 157, baseType: !97, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !98, file: !79, line: 158, baseType: !102, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !98, file: !79, line: 162, baseType: !82, size: 32, align: 32, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !78, file: !79, line: 262, baseType: !102, size: 64, align: 64, offset: 832)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !78, file: !79, line: 264, baseType: !82, size: 32, align: 32, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !78, file: !79, line: 268, baseType: !82, size: 32, align: 32, offset: 928)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !78, file: !79, line: 270, baseType: !108, size: 64, align: 64, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !109, line: 131, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!110 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !78, file: !79, line: 274, baseType: !112, size: 16, align: 16, offset: 1024)
!112 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !78, file: !79, line: 275, baseType: !114, size: 8, align: 8, offset: 1040)
!114 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !78, file: !79, line: 276, baseType: !116, size: 8, align: 8, offset: 1048)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 8, align: 8, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 1)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !78, file: !79, line: 280, baseType: !120, size: 64, align: 64, offset: 1088)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !79, line: 150, baseType: null)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !79, line: 289, baseType: !123, size: 64, align: 64, offset: 1152)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !109, line: 132, baseType: !110)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !78, file: !79, line: 297, baseType: !63, size: 64, align: 64, offset: 1216)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !78, file: !79, line: 298, baseType: !63, size: 64, align: 64, offset: 1280)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !78, file: !79, line: 299, baseType: !63, size: 64, align: 64, offset: 1344)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !78, file: !79, line: 300, baseType: !63, size: 64, align: 64, offset: 1408)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !78, file: !79, line: 302, baseType: !129, size: 64, align: 64, offset: 1472)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !130, line: 216, baseType: !131)
!130 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!131 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !78, file: !79, line: 303, baseType: !82, size: 32, align: 32, offset: 1536)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !78, file: !79, line: 305, baseType: !134, size: 160, align: 8, offset: 1568)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 160, align: 8, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 20)
!137 = !{i32 2, !"Dwarf Version", i32 4}
!138 = !{i32 2, !"Debug Info Version", i32 3}
!139 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!140 = distinct !DISubprogram(name: "vrrp_get_instance", scope: !141, file: !141, line: 37, type: !142, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !500)
!141 = !DIFile(filename: "vrrp_sync.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!142 = !DISubroutineType(types: !143)
!143 = !{!144, !84}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_t", file: !4, line: 310, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_t", file: !4, line: 183, size: 7040, align: 64, elements: !147)
!147 = !{!148, !151, !152, !202, !224, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !330, !331, !332, !333, !334, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !492, !499}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !146, file: !4, line: 184, baseType: !149, size: 16, align: 16)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !150, line: 28, baseType: !112)
!150 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!151 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !146, file: !4, line: 185, baseType: !84, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !146, file: !4, line: 186, baseType: !153, size: 64, align: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_sgroup_t", file: !4, line: 133, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_sgroup", file: !4, line: 109, size: 1024, align: 64, elements: !156)
!156 = !{!157, !158, !168, !169, !170, !171, !172, !174, !175, !176, !177, !178, !179, !196, !197, !198, !199, !200, !201}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !155, file: !4, line: 110, baseType: !84, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !155, file: !4, line: 111, baseType: !159, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !161, line: 34, baseType: !162)
!161 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !161, line: 30, size: 128, align: 64, elements: !163)
!163 = !{!164, !165, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !162, file: !161, line: 31, baseType: !66, size: 32, align: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !162, file: !161, line: 32, baseType: !66, size: 32, align: 32, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !162, file: !161, line: 33, baseType: !167, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !155, file: !4, line: 112, baseType: !51, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_fault", scope: !155, file: !4, line: 113, baseType: !66, size: 32, align: 32, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_init", scope: !155, file: !4, line: 114, baseType: !66, size: 32, align: 32, offset: 224)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !155, file: !4, line: 115, baseType: !82, size: 32, align: 32, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sgroup_tracking_weight", scope: !155, file: !4, line: 116, baseType: !173, size: 8, align: 8, offset: 288)
!173 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !155, file: !4, line: 119, baseType: !51, size: 64, align: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !155, file: !4, line: 120, baseType: !51, size: 64, align: 64, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !155, file: !4, line: 121, baseType: !51, size: 64, align: 64, offset: 448)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "track_bfd", scope: !155, file: !4, line: 122, baseType: !51, size: 64, align: 64, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !155, file: !4, line: 125, baseType: !173, size: 8, align: 8, offset: 576)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !155, file: !4, line: 126, baseType: !180, size: 64, align: 64, offset: 640)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !182, line: 65, baseType: !183)
!182 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !182, line: 59, size: 192, align: 64, elements: !184)
!184 = !{!185, !187, !188, !189, !193}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !183, file: !182, line: 60, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !183, file: !182, line: 61, baseType: !82, size: 32, align: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !183, file: !182, line: 62, baseType: !82, size: 32, align: 32, offset: 96)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !183, file: !182, line: 63, baseType: !190, size: 32, align: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !191, line: 80, baseType: !192)
!191 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !109, line: 125, baseType: !66)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !183, file: !182, line: 64, baseType: !194, size: 32, align: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !191, line: 65, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !109, line: 126, baseType: !66)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !155, file: !4, line: 127, baseType: !180, size: 64, align: 64, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !155, file: !4, line: 128, baseType: !180, size: 64, align: 64, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !155, file: !4, line: 129, baseType: !180, size: 64, align: 64, offset: 832)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !155, file: !4, line: 130, baseType: !180, size: 64, align: 64, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !155, file: !4, line: 131, baseType: !82, size: 32, align: 32, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !155, file: !4, line: 132, baseType: !82, size: 32, align: 32, offset: 992)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !146, file: !4, line: 187, baseType: !203, size: 64, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_stats", file: !4, line: 169, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_stats", file: !4, line: 136, size: 768, align: 64, elements: !206)
!206 = !{!207, !210, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "advert_rcvd", scope: !205, file: !4, line: 137, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !209, line: 55, baseType: !131)
!209 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!210 = !DIDerivedType(tag: DW_TAG_member, name: "advert_sent", scope: !205, file: !4, line: 138, baseType: !211, size: 32, align: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !209, line: 51, baseType: !66)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "become_master", scope: !205, file: !4, line: 140, baseType: !211, size: 32, align: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "release_master", scope: !205, file: !4, line: 141, baseType: !211, size: 32, align: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "packet_len_err", scope: !205, file: !4, line: 143, baseType: !208, size: 64, align: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "advert_interval_err", scope: !205, file: !4, line: 144, baseType: !208, size: 64, align: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl_err", scope: !205, file: !4, line: 145, baseType: !208, size: 64, align: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_type_rcvd", scope: !205, file: !4, line: 146, baseType: !208, size: 64, align: 64, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list_err", scope: !205, file: !4, line: 147, baseType: !208, size: 64, align: 64, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_authtype", scope: !205, file: !4, line: 149, baseType: !211, size: 32, align: 32, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "authtype_mismatch", scope: !205, file: !4, line: 151, baseType: !211, size: 32, align: 32, offset: 544)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "auth_failure", scope: !205, file: !4, line: 152, baseType: !211, size: 32, align: 32, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_rcvd", scope: !205, file: !4, line: 155, baseType: !208, size: 64, align: 64, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_sent", scope: !205, file: !4, line: 156, baseType: !208, size: 64, align: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !146, file: !4, line: 188, baseType: !225, size: 64, align: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !50, line: 111, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !50, line: 76, size: 1792, align: 64, elements: !228)
!228 = !{!229, !233, !235, !241, !260, !261, !262, !263, !264, !270, !271, !272, !273, !274, !275, !277, !278, !279, !280, !301, !302, !303, !304, !305, !306, !307, !308}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !227, file: !50, line: 77, baseType: !230, size: 128, align: 8)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 128, align: 8, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 16)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !227, file: !50, line: 78, baseType: !234, size: 32, align: 32, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !50, line: 62, baseType: !211)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !227, file: !50, line: 79, baseType: !236, size: 32, align: 32, offset: 160)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !237, line: 31, size: 32, align: 32, elements: !238)
!237 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !236, file: !237, line: 33, baseType: !240, size: 32, align: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !237, line: 30, baseType: !211)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !227, file: !50, line: 80, baseType: !242, size: 128, align: 32, offset: 192)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !237, line: 211, size: 128, align: 32, elements: !243)
!243 = !{!244}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !242, file: !237, line: 220, baseType: !245, size: 128, align: 32)
!245 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !242, file: !237, line: 213, size: 128, align: 32, elements: !246)
!246 = !{!247, !251, !256}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !245, file: !237, line: 215, baseType: !248, size: 128, align: 8)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 128, align: 8, elements: !231)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !209, line: 48, baseType: !250)
!250 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !245, file: !237, line: 217, baseType: !252, size: 128, align: 16)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 128, align: 16, elements: !254)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !209, line: 49, baseType: !112)
!254 = !{!255}
!255 = !DISubrange(count: 8)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !245, file: !237, line: 218, baseType: !257, size: 128, align: 32)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 128, align: 32, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 4)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !227, file: !50, line: 81, baseType: !66, size: 32, align: 32, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !227, file: !50, line: 82, baseType: !173, size: 8, align: 8, offset: 352)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !227, file: !50, line: 83, baseType: !211, size: 32, align: 32, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !227, file: !50, line: 84, baseType: !112, size: 16, align: 16, offset: 416)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !227, file: !50, line: 85, baseType: !265, size: 256, align: 8, offset: 432)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 256, align: 8, elements: !268)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !191, line: 33, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !109, line: 30, baseType: !250)
!268 = !{!269}
!269 = !DISubrange(count: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !227, file: !50, line: 86, baseType: !265, size: 256, align: 8, offset: 688)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !227, file: !50, line: 87, baseType: !129, size: 64, align: 64, offset: 960)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !227, file: !50, line: 88, baseType: !82, size: 32, align: 32, offset: 1024)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !227, file: !50, line: 90, baseType: !173, size: 8, align: 8, offset: 1056)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !227, file: !50, line: 91, baseType: !234, size: 32, align: 32, offset: 1088)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !227, file: !50, line: 92, baseType: !276, size: 64, align: 64, offset: 1152)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !227, file: !50, line: 94, baseType: !234, size: 32, align: 32, offset: 1216)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !227, file: !50, line: 96, baseType: !276, size: 64, align: 64, offset: 1280)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !227, file: !50, line: 97, baseType: !173, size: 8, align: 8, offset: 1344)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !227, file: !50, line: 100, baseType: !281, size: 64, align: 64, offset: 1408)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !50, line: 73, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !50, line: 65, size: 704, align: 64, elements: !284)
!284 = !{!285, !295, !296, !297, !298, !299, !300}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !283, file: !50, line: 66, baseType: !286, size: 128, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !287, line: 31, baseType: !288)
!287 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !289, line: 30, size: 128, align: 64, elements: !290)
!289 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!290 = !{!291, !293}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !288, file: !289, line: 32, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !109, line: 139, baseType: !110)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !288, file: !289, line: 33, baseType: !294, size: 64, align: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !109, line: 141, baseType: !110)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !283, file: !50, line: 67, baseType: !173, size: 8, align: 8, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !283, file: !50, line: 68, baseType: !286, size: 128, align: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !283, file: !50, line: 69, baseType: !173, size: 8, align: 8, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !283, file: !50, line: 70, baseType: !286, size: 128, align: 64, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !283, file: !50, line: 71, baseType: !286, size: 128, align: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !283, file: !50, line: 72, baseType: !82, size: 32, align: 32, offset: 640)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !227, file: !50, line: 101, baseType: !173, size: 8, align: 8, offset: 1472)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !227, file: !50, line: 102, baseType: !82, size: 32, align: 32, offset: 1504)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !227, file: !50, line: 103, baseType: !211, size: 32, align: 32, offset: 1536)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !227, file: !50, line: 104, baseType: !211, size: 32, align: 32, offset: 1568)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !227, file: !50, line: 105, baseType: !211, size: 32, align: 32, offset: 1600)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !227, file: !50, line: 107, baseType: !66, size: 32, align: 32, offset: 1632)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !227, file: !50, line: 109, baseType: !173, size: 8, align: 8, offset: 1664)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !227, file: !50, line: 110, baseType: !51, size: 64, align: 64, offset: 1728)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track_primary", scope: !146, file: !4, line: 189, baseType: !173, size: 8, align: 8, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !146, file: !4, line: 190, baseType: !173, size: 8, align: 8, offset: 328)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "skip_check_adv_addr", scope: !146, file: !4, line: 191, baseType: !173, size: 8, align: 8, offset: 336)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "strict_mode", scope: !146, file: !4, line: 193, baseType: !66, size: 32, align: 32, offset: 352)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_flags", scope: !146, file: !4, line: 195, baseType: !131, size: 64, align: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_ifname", scope: !146, file: !4, line: 196, baseType: !230, size: 128, align: 8, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !146, file: !4, line: 198, baseType: !51, size: 64, align: 64, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !146, file: !4, line: 199, baseType: !51, size: 64, align: 64, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !146, file: !4, line: 200, baseType: !51, size: 64, align: 64, offset: 704)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_if_fault", scope: !146, file: !4, line: 204, baseType: !66, size: 32, align: 32, offset: 768)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_init", scope: !146, file: !4, line: 205, baseType: !66, size: 32, align: 32, offset: 800)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !146, file: !4, line: 206, baseType: !321, size: 1024, align: 64, offset: 832)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !322, line: 166, size: 1024, align: 64, elements: !323)
!322 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!323 = !{!324, !325, !329}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !321, file: !322, line: 168, baseType: !149, size: 16, align: 16)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !321, file: !322, line: 169, baseType: !326, size: 944, align: 8, offset: 16)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 944, align: 8, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 118)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !321, file: !322, line: 170, baseType: !131, size: 64, align: 64, offset: 960)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "saddr_from_config", scope: !146, file: !4, line: 207, baseType: !173, size: 8, align: 8, offset: 1856)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "track_saddr", scope: !146, file: !4, line: 208, baseType: !173, size: 8, align: 8, offset: 1864)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_saddr", scope: !146, file: !4, line: 209, baseType: !321, size: 1024, align: 64, offset: 1920)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_peer", scope: !146, file: !4, line: 210, baseType: !51, size: 64, align: 64, offset: 2944)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_chksum_compat", scope: !146, file: !4, line: 212, baseType: !335, size: 32, align: 32, offset: 3008)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "chksum_compatibility_t", file: !4, line: 179, baseType: !3)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "master_saddr", scope: !146, file: !4, line: 214, baseType: !321, size: 1024, align: 64, offset: 3072)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "master_priority", scope: !146, file: !4, line: 215, baseType: !249, size: 8, align: 8, offset: 4096)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "last_transition", scope: !146, file: !4, line: 216, baseType: !286, size: 128, align: 64, offset: 4160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !146, file: !4, line: 217, baseType: !66, size: 32, align: 32, offset: 4288)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh", scope: !146, file: !4, line: 218, baseType: !286, size: 128, align: 64, offset: 4352)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_timer", scope: !146, file: !4, line: 219, baseType: !286, size: 128, align: 64, offset: 4480)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "garp_rep", scope: !146, file: !4, line: 220, baseType: !66, size: 32, align: 32, offset: 4608)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_rep", scope: !146, file: !4, line: 221, baseType: !66, size: 32, align: 32, offset: 4640)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_delay", scope: !146, file: !4, line: 222, baseType: !66, size: 32, align: 32, offset: 4672)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "garp_pending", scope: !146, file: !4, line: 223, baseType: !173, size: 8, align: 8, offset: 4704)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "gna_pending", scope: !146, file: !4, line: 224, baseType: !173, size: 8, align: 8, offset: 4712)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_rep", scope: !146, file: !4, line: 225, baseType: !66, size: 32, align: 32, offset: 4736)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "lower_prio_no_advert", scope: !146, file: !4, line: 226, baseType: !66, size: 32, align: 32, offset: 4768)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "higher_prio_send_advert", scope: !146, file: !4, line: 227, baseType: !66, size: 32, align: 32, offset: 4800)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "vrid", scope: !146, file: !4, line: 228, baseType: !249, size: 8, align: 8, offset: 4832)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "base_priority", scope: !146, file: !4, line: 229, baseType: !249, size: 8, align: 8, offset: 4840)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "effective_priority", scope: !146, file: !4, line: 230, baseType: !249, size: 8, align: 8, offset: 4848)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "total_priority", scope: !146, file: !4, line: 231, baseType: !82, size: 32, align: 32, offset: 4864)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "vipset", scope: !146, file: !4, line: 233, baseType: !173, size: 8, align: 8, offset: 4896)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !146, file: !4, line: 234, baseType: !51, size: 64, align: 64, offset: 4928)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "evip", scope: !146, file: !4, line: 235, baseType: !51, size: 64, align: 64, offset: 4992)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries", scope: !146, file: !4, line: 239, baseType: !173, size: 8, align: 8, offset: 5056)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "evip_add_ipv6", scope: !146, file: !4, line: 240, baseType: !173, size: 8, align: 8, offset: 5064)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "vroutes", scope: !146, file: !4, line: 241, baseType: !51, size: 64, align: 64, offset: 5120)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "vrules", scope: !146, file: !4, line: 242, baseType: !51, size: 64, align: 64, offset: 5184)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "adver_int", scope: !146, file: !4, line: 243, baseType: !66, size: 32, align: 32, offset: 5248)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "master_adver_int", scope: !146, file: !4, line: 244, baseType: !66, size: 32, align: 32, offset: 5280)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !146, file: !4, line: 249, baseType: !66, size: 32, align: 32, offset: 5312)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_rx_buf_size", scope: !146, file: !4, line: 252, baseType: !129, size: 64, align: 64, offset: 5376)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rules_set", scope: !146, file: !4, line: 254, baseType: !173, size: 8, align: 8, offset: 5440)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "nopreempt", scope: !146, file: !4, line: 255, baseType: !173, size: 8, align: 8, offset: 5448)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_delay", scope: !146, file: !4, line: 256, baseType: !131, size: 64, align: 64, offset: 5504)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_time", scope: !146, file: !4, line: 260, baseType: !286, size: 128, align: 64, offset: 5568)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !146, file: !4, line: 261, baseType: !82, size: 32, align: 32, offset: 5696)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "wantstate", scope: !146, file: !4, line: 265, baseType: !82, size: 32, align: 32, offset: 5728)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "reload_master", scope: !146, file: !4, line: 266, baseType: !173, size: 8, align: 8, offset: 5760)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sockets", scope: !146, file: !4, line: 267, baseType: !373, size: 64, align: 64, offset: 5824)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_t", file: !375, line: 50, baseType: !376)
!375 = !DIFile(filename: "./../include/vrrp_sock.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sock", file: !375, line: 40, size: 1344, align: 64, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !376, file: !375, line: 41, baseType: !149, size: 16, align: 16)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !376, file: !375, line: 42, baseType: !321, size: 1024, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !376, file: !375, line: 43, baseType: !82, size: 32, align: 32, offset: 1088)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !376, file: !375, line: 44, baseType: !234, size: 32, align: 32, offset: 1120)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "unicast", scope: !376, file: !375, line: 45, baseType: !173, size: 8, align: 8, offset: 1152)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "fd_in", scope: !376, file: !375, line: 46, baseType: !82, size: 32, align: 32, offset: 1184)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "fd_out", scope: !376, file: !375, line: 47, baseType: !82, size: 32, align: 32, offset: 1216)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_size", scope: !376, file: !375, line: 48, baseType: !82, size: 32, align: 32, offset: 1248)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !376, file: !375, line: 49, baseType: !387, size: 64, align: 64, offset: 1280)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !12, line: 99, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !12, line: 78, size: 768, align: 64, elements: !390)
!390 = !{!391, !392, !394, !447, !452, !453, !454, !466, !468}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !389, file: !12, line: 79, baseType: !131, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !389, file: !12, line: 80, baseType: !393, size: 32, align: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !12, line: 63, baseType: !11)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !389, file: !12, line: 81, baseType: !395, size: 64, align: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !12, line: 112, size: 1280, align: 64, elements: !397)
!397 = !{!398, !410, !411, !412, !413, !421, !422, !423, !424, !425, !428, !439, !440, !441, !442, !443, !444, !445, !446}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !396, file: !12, line: 113, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !400, line: 109, baseType: !401)
!400 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !400, line: 106, size: 64, align: 64, elements: !402)
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !401, file: !400, line: 108, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !400, line: 97, size: 192, align: 64, elements: !406)
!406 = !{!407, !408, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !405, file: !400, line: 99, baseType: !131, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !405, file: !400, line: 102, baseType: !404, size: 64, align: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !405, file: !400, line: 103, baseType: !404, size: 64, align: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !396, file: !12, line: 114, baseType: !399, size: 64, align: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !396, file: !12, line: 115, baseType: !399, size: 64, align: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !396, file: !12, line: 116, baseType: !399, size: 64, align: 64, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !396, file: !12, line: 117, baseType: !414, size: 128, align: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !415, line: 62, baseType: !416)
!415 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !415, line: 60, size: 128, align: 64, elements: !417)
!417 = !{!418, !420}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !416, file: !415, line: 61, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !416, file: !415, line: 61, baseType: !419, size: 64, align: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !396, file: !12, line: 121, baseType: !414, size: 128, align: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !396, file: !12, line: 122, baseType: !414, size: 128, align: 64, offset: 512)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !396, file: !12, line: 124, baseType: !51, size: 64, align: 64, offset: 640)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !396, file: !12, line: 127, baseType: !399, size: 64, align: 64, offset: 704)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !396, file: !12, line: 128, baseType: !426, size: 64, align: 64, offset: 768)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !12, line: 128, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !396, file: !12, line: 129, baseType: !429, size: 64, align: 64, offset: 832)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !12, line: 109, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !12, line: 102, size: 448, align: 64, elements: !432)
!432 = !{!433, !434, !435, !436, !437}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !431, file: !12, line: 103, baseType: !387, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !431, file: !12, line: 104, baseType: !387, size: 64, align: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !431, file: !12, line: 105, baseType: !131, size: 64, align: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !431, file: !12, line: 106, baseType: !82, size: 32, align: 32, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !431, file: !12, line: 108, baseType: !438, size: 192, align: 64, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !400, line: 104, baseType: !405)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !396, file: !12, line: 130, baseType: !66, size: 32, align: 32, offset: 896)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !396, file: !12, line: 131, baseType: !66, size: 32, align: 32, offset: 928)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !396, file: !12, line: 132, baseType: !82, size: 32, align: 32, offset: 960)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !396, file: !12, line: 135, baseType: !82, size: 32, align: 32, offset: 992)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !396, file: !12, line: 136, baseType: !387, size: 64, align: 64, offset: 1024)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !396, file: !12, line: 146, baseType: !131, size: 64, align: 64, offset: 1088)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !396, file: !12, line: 147, baseType: !131, size: 64, align: 64, offset: 1152)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !396, file: !12, line: 148, baseType: !173, size: 8, align: 8, offset: 1216)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !389, file: !12, line: 82, baseType: !448, size: 64, align: 64, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!82, !451}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !389, file: !12, line: 83, baseType: !63, size: 64, align: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !389, file: !12, line: 84, baseType: !286, size: 128, align: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !389, file: !12, line: 92, baseType: !455, size: 64, align: 32, offset: 448)
!455 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !389, file: !12, line: 85, size: 64, align: 32, elements: !456)
!456 = !{!457, !458, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !455, file: !12, line: 86, baseType: !82, size: 32, align: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !455, file: !12, line: 87, baseType: !82, size: 32, align: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !455, file: !12, line: 91, baseType: !460, size: 64, align: 32)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !455, file: !12, line: 88, size: 64, align: 32, elements: !461)
!461 = !{!462, !465}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !460, file: !12, line: 89, baseType: !463, size: 32, align: 32)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !191, line: 98, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !109, line: 133, baseType: !82)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !460, file: !12, line: 90, baseType: !82, size: 32, align: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !389, file: !12, line: 93, baseType: !467, size: 64, align: 64, offset: 512)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, scope: !389, file: !12, line: 95, baseType: !469, size: 192, align: 64, offset: 576)
!469 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !389, file: !12, line: 95, size: 192, align: 64, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !469, file: !12, line: 96, baseType: !438, size: 192, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !469, file: !12, line: 97, baseType: !414, size: 128, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !146, file: !4, line: 269, baseType: !82, size: 32, align: 32, offset: 5888)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !146, file: !4, line: 271, baseType: !82, size: 32, align: 32, offset: 5920)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !146, file: !4, line: 274, baseType: !82, size: 32, align: 32, offset: 5952)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !146, file: !4, line: 275, baseType: !82, size: 32, align: 32, offset: 5984)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !146, file: !4, line: 276, baseType: !173, size: 8, align: 8, offset: 6016)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !146, file: !4, line: 277, baseType: !180, size: 64, align: 64, offset: 6080)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !146, file: !4, line: 278, baseType: !180, size: 64, align: 64, offset: 6144)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !146, file: !4, line: 279, baseType: !180, size: 64, align: 64, offset: 6208)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !146, file: !4, line: 280, baseType: !180, size: 64, align: 64, offset: 6272)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "script_master_rx_lower_pri", scope: !146, file: !4, line: 281, baseType: !180, size: 64, align: 64, offset: 6336)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !146, file: !4, line: 282, baseType: !180, size: 64, align: 64, offset: 6400)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ms_down_timer", scope: !146, file: !4, line: 285, baseType: !211, size: 32, align: 32, offset: 6464)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !146, file: !4, line: 286, baseType: !286, size: 128, align: 64, offset: 6528)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !146, file: !4, line: 289, baseType: !84, size: 64, align: 64, offset: 6656)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer_size", scope: !146, file: !4, line: 290, baseType: !129, size: 64, align: 64, offset: 6720)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_csum", scope: !146, file: !4, line: 291, baseType: !211, size: 32, align: 32, offset: 6784)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "auth_type", scope: !146, file: !4, line: 295, baseType: !249, size: 8, align: 8, offset: 6816)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "auth_data", scope: !146, file: !4, line: 296, baseType: !491, size: 64, align: 8, offset: 6824)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 64, align: 8, elements: !254)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ipsecah_counter", scope: !146, file: !4, line: 299, baseType: !493, size: 64, align: 32, offset: 6912)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_counter_t", file: !494, line: 58, baseType: !495)
!494 = !DIFile(filename: "./../include/vrrp_ipsecah.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seq_counter", file: !494, line: 55, size: 64, align: 32, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !495, file: !494, line: 56, baseType: !173, size: 8, align: 8)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "seq_number", scope: !495, file: !494, line: 57, baseType: !211, size: 32, align: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !146, file: !4, line: 309, baseType: !82, size: 32, align: 32, offset: 6976)
!500 = !{}
!501 = !DILocalVariable(name: "iname", arg: 1, scope: !140, file: !141, line: 37, type: !84)
!502 = !DIExpression()
!503 = !DILocation(line: 37, column: 25, scope: !140)
!504 = !DILocalVariable(name: "vrrp", scope: !140, file: !141, line: 39, type: !144)
!505 = !DILocation(line: 39, column: 10, scope: !140)
!506 = !DILocalVariable(name: "l", scope: !140, file: !141, line: 40, type: !51)
!507 = !DILocation(line: 40, column: 7, scope: !140)
!508 = !DILocation(line: 40, column: 11, scope: !140)
!509 = !DILocation(line: 40, column: 22, scope: !140)
!510 = !DILocalVariable(name: "e", scope: !140, file: !141, line: 41, type: !511)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "element", file: !52, line: 30, baseType: !57)
!512 = !DILocation(line: 41, column: 10, scope: !140)
!513 = !DILocation(line: 43, column: 14, scope: !514)
!514 = distinct !DILexicalBlock(scope: !140, file: !141, line: 43, column: 2)
!515 = !DILocation(line: 43, column: 13, scope: !514)
!516 = !DILocation(line: 43, column: 12, scope: !514)
!517 = !DILocation(line: 43, column: 12, scope: !518)
!518 = !DILexicalBlockFile(scope: !514, file: !141, discriminator: 1)
!519 = !DILocation(line: 43, column: 13, scope: !520)
!520 = !DILexicalBlockFile(scope: !514, file: !141, discriminator: 2)
!521 = !DILocation(line: 43, column: 17, scope: !520)
!522 = !DILocation(line: 43, column: 12, scope: !520)
!523 = !DILocation(line: 43, column: 12, scope: !524)
!524 = !DILexicalBlockFile(scope: !514, file: !141, discriminator: 3)
!525 = !DILocation(line: 43, column: 9, scope: !524)
!526 = !DILocation(line: 43, column: 7, scope: !524)
!527 = !DILocation(line: 43, column: 24, scope: !528)
!528 = !DILexicalBlockFile(scope: !529, file: !141, discriminator: 4)
!529 = distinct !DILexicalBlock(scope: !514, file: !141, line: 43, column: 2)
!530 = !DILocation(line: 43, column: 2, scope: !528)
!531 = !DILocation(line: 44, column: 12, scope: !532)
!532 = distinct !DILexicalBlock(scope: !529, file: !141, line: 43, column: 46)
!533 = !DILocation(line: 44, column: 16, scope: !532)
!534 = !DILocation(line: 44, column: 10, scope: !532)
!535 = !DILocation(line: 44, column: 8, scope: !532)
!536 = !DILocation(line: 45, column: 14, scope: !537)
!537 = distinct !DILexicalBlock(scope: !532, file: !141, line: 45, column: 7)
!538 = !DILocation(line: 45, column: 20, scope: !537)
!539 = !DILocation(line: 45, column: 27, scope: !537)
!540 = !DILocation(line: 45, column: 7, scope: !537)
!541 = !DILocation(line: 45, column: 34, scope: !537)
!542 = !DILocation(line: 45, column: 7, scope: !532)
!543 = !DILocation(line: 46, column: 11, scope: !537)
!544 = !DILocation(line: 46, column: 4, scope: !537)
!545 = !DILocation(line: 47, column: 2, scope: !532)
!546 = !DILocation(line: 43, column: 35, scope: !547)
!547 = !DILexicalBlockFile(scope: !529, file: !141, discriminator: 5)
!548 = !DILocation(line: 43, column: 39, scope: !547)
!549 = !DILocation(line: 43, column: 32, scope: !547)
!550 = !DILocation(line: 43, column: 2, scope: !547)
!551 = distinct !{!551, !552}
!552 = !DILocation(line: 43, column: 2, scope: !140)
!553 = !DILocation(line: 48, column: 2, scope: !140)
!554 = !DILocation(line: 49, column: 1, scope: !140)
!555 = distinct !DISubprogram(name: "vrrp_sync_set_group", scope: !141, file: !141, line: 53, type: !556, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !500)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !153}
!558 = !DILocalVariable(name: "vgroup", arg: 1, scope: !555, file: !141, line: 53, type: !153)
!559 = !DILocation(line: 53, column: 36, scope: !555)
!560 = !DILocalVariable(name: "vrrp", scope: !555, file: !141, line: 55, type: !144)
!561 = !DILocation(line: 55, column: 10, scope: !555)
!562 = !DILocalVariable(name: "str", scope: !555, file: !141, line: 56, type: !84)
