; ModuleID = './[inter]keepalived--vrrp--vrrp_iptables_calls.o.i'
source_filename = "./[inter]keepalived--vrrp--vrrp_iptables_calls.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.xtc_handle = type opaque
%struct._ip_address = type { %struct.ifaddrmsg, %union.anon, %struct._interface*, i8*, i32, i32, i8, %union.anon.1, i8, %struct._static_track_group*, i8, i8, i8 }
%struct.ifaddrmsg = type { i8, i8, i8, i8, i32 }
%union.anon = type { %struct.in6_addr }
%struct.in6_addr = type { %union.anon.0 }
%union.anon.0 = type { [4 x i32] }
%struct._interface = type { [16 x i8], i32, %struct.in_addr, %struct.in6_addr, i32, i8, i32, i16, [32 x i8], [32 x i8], i64, i32, i8, i32, %struct._interface*, i32, %struct._interface*, i8, %struct._garp_delay*, i8, i32, i32, i32, i32, i32, i8, %struct._list* }
%struct.in_addr = type { i32 }
%struct._garp_delay = type { %struct.timeval, i8, %struct.timeval, i8, %struct.timeval, %struct.timeval, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !65, globals: !229)
!1 = !DIFile(filename: "[inter]keepalived--vrrp--vrrp_iptables_calls.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!2 = !{!3, !32, !41, !53}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 40, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!6 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!7 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!8 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!9 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!10 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!11 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!12 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!13 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!14 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!15 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!16 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!17 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!18 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!19 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!20 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!21 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!22 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!23 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!24 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!25 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!26 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!27 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!28 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!29 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!30 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!31 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 99, size: 32, align: 32, elements: !33)
!33 = !{!34, !35, !36, !37, !38, !39, !40}
!34 = !DIEnumerator(name: "IPPROTO_HOPOPTS", value: 0)
!35 = !DIEnumerator(name: "IPPROTO_ROUTING", value: 43)
!36 = !DIEnumerator(name: "IPPROTO_FRAGMENT", value: 44)
!37 = !DIEnumerator(name: "IPPROTO_ICMPV6", value: 58)
!38 = !DIEnumerator(name: "IPPROTO_NONE", value: 59)
!39 = !DIEnumerator(name: "IPPROTO_DSTOPTS", value: 60)
!40 = !DIEnumerator(name: "IPPROTO_MH", value: 135)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !42, line: 58, size: 32, align: 32, elements: !43)
!42 = !DIFile(filename: "/usr/include/linux/netfilter.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52}
!44 = !DIEnumerator(name: "NFPROTO_UNSPEC", value: 0)
!45 = !DIEnumerator(name: "NFPROTO_INET", value: 1)
!46 = !DIEnumerator(name: "NFPROTO_IPV4", value: 2)
!47 = !DIEnumerator(name: "NFPROTO_ARP", value: 3)
!48 = !DIEnumerator(name: "NFPROTO_NETDEV", value: 5)
!49 = !DIEnumerator(name: "NFPROTO_BRIDGE", value: 7)
!50 = !DIEnumerator(name: "NFPROTO_IPV6", value: 10)
!51 = !DIEnumerator(name: "NFPROTO_DECNET", value: 12)
!52 = !DIEnumerator(name: "NFPROTO_NUMPROTO", value: 13)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !54, line: 24, size: 32, align: 32, elements: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64}
!56 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!57 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!58 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!59 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!60 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!61 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!62 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!63 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!64 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!65 = !{!66, !67, !118, !142, !143, !144, !153, !194, !200, !206, !226, !227}
!66 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipt_entry", file: !69, line: 102, size: 896, align: 64, elements: !70)
!69 = !DIFile(filename: "/usr/include/linux/netfilter_ipv4/ip_tables.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!70 = !{!71, !102, !103, !104, !105, !106, !114}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !68, file: !69, line: 103, baseType: !72, size: 672, align: 32)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipt_ip", file: !69, line: 67, size: 672, align: 32, elements: !73)
!73 = !{!74, !82, !83, !84, !85, !90, !91, !94, !95, !99, !101}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !72, file: !69, line: 69, baseType: !75, size: 32, align: 32)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !4, line: 31, size: 32, align: 32, elements: !76)
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !75, file: !4, line: 33, baseType: !78, size: 32, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !4, line: 30, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !80, line: 51, baseType: !81)
!80 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!81 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !72, file: !69, line: 69, baseType: !75, size: 32, align: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "smsk", scope: !72, file: !69, line: 71, baseType: !75, size: 32, align: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "dmsk", scope: !72, file: !69, line: 71, baseType: !75, size: 32, align: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "iniface", scope: !72, file: !69, line: 72, baseType: !86, size: 128, align: 8, offset: 128)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 128, align: 8, elements: !88)
!87 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!88 = !{!89}
!89 = !DISubrange(count: 16)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "outiface", scope: !72, file: !69, line: 72, baseType: !86, size: 128, align: 8, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "iniface_mask", scope: !72, file: !69, line: 73, baseType: !92, size: 128, align: 8, offset: 384)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 128, align: 8, elements: !88)
!93 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "outiface_mask", scope: !72, file: !69, line: 73, baseType: !92, size: 128, align: 8, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !72, file: !69, line: 76, baseType: !96, size: 16, align: 16, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !97, line: 23, baseType: !98)
!97 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!98 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !72, file: !69, line: 79, baseType: !100, size: 8, align: 8, offset: 656)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !97, line: 20, baseType: !93)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "invflags", scope: !72, file: !69, line: 81, baseType: !100, size: 8, align: 8, offset: 664)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "nfcache", scope: !68, file: !69, line: 106, baseType: !81, size: 32, align: 32, offset: 672)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "target_offset", scope: !68, file: !69, line: 109, baseType: !96, size: 16, align: 16, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "next_offset", scope: !68, file: !69, line: 111, baseType: !96, size: 16, align: 16, offset: 720)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "comefrom", scope: !68, file: !69, line: 114, baseType: !81, size: 32, align: 32, offset: 736)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "counters", scope: !68, file: !69, line: 117, baseType: !107, size: 128, align: 64, offset: 768)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xt_counters", file: !108, line: 109, size: 128, align: 64, elements: !109)
!108 = !DIFile(filename: "/usr/include/linux/netfilter/x_tables.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!109 = !{!110, !113}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pcnt", scope: !107, file: !108, line: 110, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !97, line: 30, baseType: !112)
!112 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "bcnt", scope: !107, file: !108, line: 110, baseType: !111, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !68, file: !69, line: 120, baseType: !115, align: 8, offset: 896)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 0)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xt_entry_match", file: !108, line: 10, size: 256, align: 64, elements: !120)
!120 = !{!121, !141}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !119, file: !108, line: 28, baseType: !122, size: 256, align: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !119, file: !108, line: 11, size: 256, align: 64, elements: !123)
!123 = !{!124, !133, !140}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !122, file: !108, line: 18, baseType: !125, size: 256, align: 16)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !122, file: !108, line: 12, size: 256, align: 16, elements: !126)
!126 = !{!127, !128, !132}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "match_size", scope: !125, file: !108, line: 13, baseType: !96, size: 16, align: 16)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !125, file: !108, line: 16, baseType: !129, size: 232, align: 8, offset: 16)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 232, align: 8, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 29)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !125, file: !108, line: 17, baseType: !100, size: 8, align: 8, offset: 248)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "kernel", scope: !122, file: !108, line: 24, baseType: !134, size: 128, align: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !122, file: !108, line: 19, size: 128, align: 64, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "match_size", scope: !134, file: !108, line: 20, baseType: !96, size: 16, align: 16)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !134, file: !108, line: 23, baseType: !138, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "xt_match", file: !108, line: 23, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "match_size", scope: !122, file: !108, line: 27, baseType: !96, size: 16, align: 16)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !119, file: !108, line: 30, baseType: !115, align: 8, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !80, line: 49, baseType: !98)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipt_icmp", file: !69, line: 143, size: 32, align: 8, elements: !146)
!146 = !{!147, !148, !152}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !145, file: !69, line: 144, baseType: !100, size: 8, align: 8)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !145, file: !69, line: 145, baseType: !149, size: 16, align: 8, offset: 8)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 16, align: 8, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 2)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "invflags", scope: !145, file: !69, line: 146, baseType: !100, size: 8, align: 8, offset: 24)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6t_entry", file: !155, line: 106, size: 1344, align: 64, elements: !156)
!155 = !DIFile(filename: "/usr/include/linux/netfilter_ipv6/ip6_tables.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!156 = !{!157, !188, !189, !190, !191, !192, !193}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6", scope: !154, file: !155, line: 107, baseType: !158, size: 1088, align: 32)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6t_ip6", file: !155, line: 60, size: 1088, align: 32, elements: !159)
!159 = !{!160, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !158, file: !155, line: 62, baseType: !161, size: 128, align: 32)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !4, line: 211, size: 128, align: 32, elements: !162)
!162 = !{!163}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !161, file: !4, line: 220, baseType: !164, size: 128, align: 32)
!164 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !4, line: 213, size: 128, align: 32, elements: !165)
!165 = !{!166, !169, !173}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !164, file: !4, line: 215, baseType: !167, size: 128, align: 8)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 128, align: 8, elements: !88)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !80, line: 48, baseType: !93)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !164, file: !4, line: 217, baseType: !170, size: 128, align: 16)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 128, align: 16, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 8)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !164, file: !4, line: 218, baseType: !174, size: 128, align: 32)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 128, align: 32, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 4)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !158, file: !155, line: 62, baseType: !161, size: 128, align: 32, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "smsk", scope: !158, file: !155, line: 64, baseType: !161, size: 128, align: 32, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "dmsk", scope: !158, file: !155, line: 64, baseType: !161, size: 128, align: 32, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "iniface", scope: !158, file: !155, line: 65, baseType: !86, size: 128, align: 8, offset: 512)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "outiface", scope: !158, file: !155, line: 65, baseType: !86, size: 128, align: 8, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "iniface_mask", scope: !158, file: !155, line: 66, baseType: !92, size: 128, align: 8, offset: 768)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "outiface_mask", scope: !158, file: !155, line: 66, baseType: !92, size: 128, align: 8, offset: 896)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !158, file: !155, line: 76, baseType: !96, size: 16, align: 16, offset: 1024)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !158, file: !155, line: 78, baseType: !100, size: 8, align: 8, offset: 1040)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !158, file: !155, line: 81, baseType: !100, size: 8, align: 8, offset: 1048)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "invflags", scope: !158, file: !155, line: 83, baseType: !100, size: 8, align: 8, offset: 1056)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nfcache", scope: !154, file: !155, line: 110, baseType: !81, size: 32, align: 32, offset: 1088)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "target_offset", scope: !154, file: !155, line: 113, baseType: !96, size: 16, align: 16, offset: 1120)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "next_offset", scope: !154, file: !155, line: 115, baseType: !96, size: 16, align: 16, offset: 1136)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "comefrom", scope: !154, file: !155, line: 118, baseType: !81, size: 32, align: 32, offset: 1152)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "counters", scope: !154, file: !155, line: 121, baseType: !107, size: 128, align: 64, offset: 1216)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !154, file: !155, line: 124, baseType: !115, align: 8, offset: 1344)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip6t_icmp", file: !155, line: 183, size: 32, align: 8, elements: !196)
!196 = !{!197, !198, !199}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !155, line: 184, baseType: !100, size: 8, align: 8)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !195, file: !155, line: 185, baseType: !149, size: 16, align: 8, offset: 8)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "invflags", scope: !195, file: !155, line: 186, baseType: !100, size: 8, align: 8, offset: 24)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !201, line: 85, baseType: !202)
!201 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !205}
!205 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xt_set_info_match_v4", file: !208, line: 86, size: 384, align: 64, elements: !209)
!208 = !DIFile(filename: "/usr/include/linux/netfilter/xt_set.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!209 = !{!210, !218, !223, !224}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "match_set", scope: !207, file: !208, line: 87, baseType: !211, size: 32, align: 16)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xt_set_info", file: !208, line: 40, size: 32, align: 16, elements: !212)
!212 = !{!213, !216, !217}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !211, file: !208, line: 41, baseType: !214, size: 16, align: 16)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_set_id_t", file: !215, line: 225, baseType: !96)
!215 = !DIFile(filename: "/usr/include/linux/netfilter/ipset/ip_set.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !211, file: !208, line: 42, baseType: !100, size: 8, align: 8, offset: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !211, file: !208, line: 43, baseType: !100, size: 8, align: 8, offset: 24)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "packets", scope: !207, file: !208, line: 88, baseType: !219, size: 128, align: 64, offset: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_set_counter_match", file: !215, line: 265, size: 128, align: 64, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !219, file: !215, line: 266, baseType: !111, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !219, file: !215, line: 267, baseType: !100, size: 8, align: 8, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !207, file: !208, line: 89, baseType: !219, size: 128, align: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !207, file: !208, line: 90, baseType: !225, size: 32, align: 32, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !97, line: 26, baseType: !81)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !228, line: 216, baseType: !66)
!228 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!229 = !{!230}
!230 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !231, line: 150, type: !232, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!231 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !233, line: 31, baseType: !234)
!233 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !233, line: 39, size: 320, align: 64, elements: !236)
!236 = !{!237, !244, !245, !246, !250}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !235, file: !233, line: 40, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !233, line: 33, size: 192, align: 64, elements: !240)
!240 = !{!241, !242, !243}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !233, line: 34, baseType: !238, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !239, file: !233, line: 35, baseType: !238, size: 64, align: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !239, file: !233, line: 36, baseType: !226, size: 64, align: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !235, file: !233, line: 41, baseType: !238, size: 64, align: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !235, file: !233, line: 42, baseType: !81, size: 32, align: 32, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !235, file: !233, line: 43, baseType: !247, size: 64, align: 64, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !226}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !235, file: !233, line: 44, baseType: !251, size: 64, align: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !254, !226}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !256, line: 48, baseType: !257)
!256 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !258, line: 241, size: 1728, align: 64, elements: !259)
!258 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !280, !281, !282, !283, !287, !288, !290, !294, !297, !299, !300, !301, !302, !303, !304, !305}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !257, file: !258, line: 242, baseType: !205, size: 32, align: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !257, file: !258, line: 247, baseType: !142, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !257, file: !258, line: 248, baseType: !142, size: 64, align: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !257, file: !258, line: 249, baseType: !142, size: 64, align: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !257, file: !258, line: 250, baseType: !142, size: 64, align: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !257, file: !258, line: 251, baseType: !142, size: 64, align: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !257, file: !258, line: 252, baseType: !142, size: 64, align: 64, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !257, file: !258, line: 253, baseType: !142, size: 64, align: 64, offset: 448)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !257, file: !258, line: 254, baseType: !142, size: 64, align: 64, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !257, file: !258, line: 256, baseType: !142, size: 64, align: 64, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !257, file: !258, line: 257, baseType: !142, size: 64, align: 64, offset: 640)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !257, file: !258, line: 258, baseType: !142, size: 64, align: 64, offset: 704)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !257, file: !258, line: 260, baseType: !273, size: 64, align: 64, offset: 768)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !258, line: 156, size: 192, align: 64, elements: !275)
!275 = !{!276, !277, !279}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !274, file: !258, line: 157, baseType: !273, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !274, file: !258, line: 158, baseType: !278, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !274, file: !258, line: 162, baseType: !205, size: 32, align: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !257, file: !258, line: 262, baseType: !278, size: 64, align: 64, offset: 832)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !257, file: !258, line: 264, baseType: !205, size: 32, align: 32, offset: 896)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !257, file: !258, line: 268, baseType: !205, size: 32, align: 32, offset: 928)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !257, file: !258, line: 270, baseType: !284, size: 64, align: 64, offset: 960)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !285, line: 131, baseType: !286)
!285 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!286 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !257, file: !258, line: 274, baseType: !98, size: 16, align: 16, offset: 1024)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !257, file: !258, line: 275, baseType: !289, size: 8, align: 8, offset: 1040)
!289 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !257, file: !258, line: 276, baseType: !291, size: 8, align: 8, offset: 1048)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 8, align: 8, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 1)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !257, file: !258, line: 280, baseType: !295, size: 64, align: 64, offset: 1088)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !258, line: 150, baseType: null)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !257, file: !258, line: 289, baseType: !298, size: 64, align: 64, offset: 1152)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !285, line: 132, baseType: !286)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !257, file: !258, line: 297, baseType: !226, size: 64, align: 64, offset: 1216)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !257, file: !258, line: 298, baseType: !226, size: 64, align: 64, offset: 1280)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !257, file: !258, line: 299, baseType: !226, size: 64, align: 64, offset: 1344)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !257, file: !258, line: 300, baseType: !226, size: 64, align: 64, offset: 1408)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !257, file: !258, line: 302, baseType: !227, size: 64, align: 64, offset: 1472)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !257, file: !258, line: 303, baseType: !205, size: 32, align: 32, offset: 1536)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !257, file: !258, line: 305, baseType: !306, size: 160, align: 8, offset: 1568)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 160, align: 8, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 20)
!309 = !{i32 2, !"Dwarf Version", i32 4}
!310 = !{i32 2, !"Debug Info Version", i32 3}
!311 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!312 = distinct !DISubprogram(name: "ip4tables_open", scope: !313, file: !313, line: 148, type: !314, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !321)
!313 = !DIFile(filename: "vrrp_iptables_calls.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!314 = !DISubroutineType(types: !315)
!315 = !{!316, !319}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "xtc_handle", file: !318, line: 5, flags: DIFlagFwdDecl)
!318 = !DIFile(filename: "/usr/include/libiptc/xtcshared.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!321 = !{}
!322 = !DILocalVariable(name: "tablename", arg: 1, scope: !312, file: !313, line: 148, type: !319)
!323 = !DIExpression()
!324 = !DILocation(line: 148, column: 49, scope: !312)
!325 = !DILocalVariable(name: "h", scope: !312, file: !313, line: 150, type: !316)
!326 = !DILocation(line: 150, column: 21, scope: !312)
!327 = !DILocation(line: 152, column: 26, scope: !328)
!328 = distinct !DILexicalBlock(scope: !312, file: !313, line: 152, column: 7)
!329 = !DILocation(line: 152, column: 14, scope: !328)
!330 = !DILocation(line: 152, column: 12, scope: !328)
!331 = !DILocation(line: 152, column: 7, scope: !312)
!332 = !DILocation(line: 153, column: 3, scope: !328)
!333 = !DILocation(line: 155, column: 9, scope: !312)
!334 = !DILocation(line: 155, column: 2, scope: !312)
!335 = !DILocation(line: 156, column: 1, scope: !312)
!336 = distinct !DISubprogram(name: "ip4tables_close", scope: !313, file: !313, line: 158, type: !337, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !321)
!337 = !DISubroutineType(types: !338)
!338 = !{!205, !316, !205}
!339 = !DILocalVariable(name: "handle", arg: 1, scope: !336, file: !313, line: 158, type: !316)
!340 = !DILocation(line: 158, column: 42, scope: !336)
!341 = !DILocalVariable(name: "updated", arg: 2, scope: !336, file: !313, line: 158, type: !205)
!342 = !DILocation(line: 158, column: 54, scope: !336)
!343 = !DILocalVariable(name: "res", scope: !336, file: !313, line: 160, type: !205)
!344 = !DILocation(line: 160, column: 6, scope: !336)
!345 = !DILocalVariable(name: "sav_errno", scope: !336, file: !313, line: 161, type: !205)
!346 = !DILocation(line: 161, column: 6, scope: !336)
!347 = !DILocation(line: 163, column: 6, scope: !348)
!348 = distinct !DILexicalBlock(scope: !336, file: !313, line: 163, column: 6)
!349 = !DILocation(line: 163, column: 6, scope: !336)
!350 = !DILocation(line: 164, column: 30, scope: !351)
!351 = distinct !DILexicalBlock(scope: !352, file: !313, line: 164, column: 8)
!352 = distinct !DILexicalBlock(scope: !348, file: !313, line: 163, column: 15)
!353 = !DILocation(line: 164, column: 16, scope: !351)
!354 = !DILocation(line: 164, column: 14, scope: !351)
!355 = !DILocation(line: 164, column: 41, scope: !351)
!356 = !DILocation(line: 164, column: 8, scope: !352)
!357 = !DILocation(line: 166, column: 17, scope: !358)
!358 = distinct !DILexicalBlock(scope: !351, file: !313, line: 165, column: 3)
!359 = !DILocation(line: 166, column: 16, scope: !358)
!360 = !DILocation(line: 166, column: 14, scope: !358)
!361 = !DILocation(line: 167, column: 56, scope: !358)
!362 = !DILocation(line: 167, column: 76, scope: !358)
!363 = !DILocation(line: 167, column: 61, scope: !358)
!364 = !DILocation(line: 167, column: 4, scope: !365)
!365 = !DILexicalBlockFile(scope: !358, file: !313, discriminator: 1)
!366 = !DILocation(line: 168, column: 3, scope: !358)
!367 = !DILocation(line: 169, column: 2, scope: !352)
!368 = !DILocation(line: 171, column: 14, scope: !336)
!369 = !DILocation(line: 171, column: 2, scope: !336)
!370 = !DILocation(line: 173, column: 7, scope: !371)
!371 = distinct !DILexicalBlock(scope: !336, file: !313, line: 173, column: 7)
!372 = !DILocation(line: 173, column: 11, scope: !371)
!373 = !DILocation(line: 173, column: 7, scope: !336)
!374 = !DILocation(line: 174, column: 3, scope: !371)
!375 = !DILocation(line: 176, column: 12, scope: !371)
!376 = !DILocation(line: 176, column: 3, scope: !371)
!377 = !DILocation(line: 177, column: 1, scope: !336)
!378 = distinct !DISubprogram(name: "ip4tables_is_chain", scope: !313, file: !313, line: 179, type: !379, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !321)
!379 = !DISubroutineType(types: !380)
!380 = !{!205, !316, !319}
!381 = !DILocalVariable(name: "handle", arg: 1, scope: !378, file: !313, line: 179, type: !316)
!382 = !DILocation(line: 179, column: 43, scope: !378)
!383 = !DILocalVariable(name: "chain_name", arg: 2, scope: !378, file: !313, line: 179, type: !319)
!384 = !DILocation(line: 179, column: 63, scope: !378)
!385 = !DILocation(line: 181, column: 23, scope: !378)
!386 = !DILocation(line: 181, column: 35, scope: !378)
!387 = !DILocation(line: 181, column: 9, scope: !378)
!388 = !DILocation(line: 181, column: 2, scope: !378)
!389 = distinct !DISubprogram(name: "ip4tables_process_entry", scope: !313, file: !313, line: 184, type: !390, isLocal: false, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !321)
!390 = !DISubroutineType(types: !391)
!391 = !{!205, !316, !319, !81, !319, !392, !392, !319, !319, !143, !168, !205, !428}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_address_t", file: !395, line: 73, baseType: !396)
!395 = !DIFile(filename: "./../include/vrrp_ipaddress.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_address", file: !395, line: 41, size: 704, align: 64, elements: !397)
!397 = !{!398, !407, !416, !477, !478, !479, !480, !481, !486, !487, !505, !506, !507}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ifa", scope: !396, file: !395, line: 42, baseType: !399, size: 64, align: 32)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifaddrmsg", file: !400, line: 7, size: 64, align: 32, elements: !401)
!400 = !DIFile(filename: "/usr/include/linux/if_addr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!401 = !{!402, !403, !404, !405, !406}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_family", scope: !399, file: !400, line: 8, baseType: !100, size: 8, align: 8)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_prefixlen", scope: !399, file: !400, line: 9, baseType: !100, size: 8, align: 8, offset: 8)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_flags", scope: !399, file: !400, line: 10, baseType: !100, size: 8, align: 8, offset: 16)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_scope", scope: !399, file: !400, line: 11, baseType: !100, size: 8, align: 8, offset: 24)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_index", scope: !399, file: !400, line: 12, baseType: !225, size: 32, align: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !396, file: !395, line: 50, baseType: !408, size: 128, align: 32, offset: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !395, line: 44, size: 128, align: 32, elements: !409)
!409 = !{!410, !415}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !408, file: !395, line: 48, baseType: !411, size: 64, align: 32)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !408, file: !395, line: 45, size: 64, align: 32, elements: !412)
!412 = !{!413, !414}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !411, file: !395, line: 46, baseType: !75, size: 32, align: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "sin_brd", scope: !411, file: !395, line: 47, baseType: !75, size: 32, align: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !408, file: !395, line: 49, baseType: !161, size: 128, align: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !396, file: !395, line: 52, baseType: !417, size: 64, align: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !231, line: 111, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !231, line: 76, size: 1792, align: 64, elements: !420)
!420 = !{!421, !422, !424, !425, !426, !427, !429, !430, !431, !438, !439, !440, !441, !442, !443, !445, !446, !447, !448, !469, !470, !471, !472, !473, !474, !475, !476}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !419, file: !231, line: 77, baseType: !86, size: 128, align: 8)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !419, file: !231, line: 78, baseType: !423, size: 32, align: 32, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !231, line: 62, baseType: !79)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !419, file: !231, line: 79, baseType: !75, size: 32, align: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !419, file: !231, line: 80, baseType: !161, size: 128, align: 32, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !419, file: !231, line: 81, baseType: !81, size: 32, align: 32, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !419, file: !231, line: 82, baseType: !428, size: 8, align: 8, offset: 352)
!428 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !419, file: !231, line: 83, baseType: !79, size: 32, align: 32, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !419, file: !231, line: 84, baseType: !98, size: 16, align: 16, offset: 416)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !419, file: !231, line: 85, baseType: !432, size: 256, align: 8, offset: 432)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 256, align: 8, elements: !436)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !434, line: 33, baseType: !435)
!434 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !285, line: 30, baseType: !93)
!436 = !{!437}
!437 = !DISubrange(count: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !419, file: !231, line: 86, baseType: !432, size: 256, align: 8, offset: 688)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !419, file: !231, line: 87, baseType: !227, size: 64, align: 64, offset: 960)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !419, file: !231, line: 88, baseType: !205, size: 32, align: 32, offset: 1024)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !419, file: !231, line: 90, baseType: !428, size: 8, align: 8, offset: 1056)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !419, file: !231, line: 91, baseType: !423, size: 32, align: 32, offset: 1088)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !419, file: !231, line: 92, baseType: !444, size: 64, align: 64, offset: 1152)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !419, file: !231, line: 94, baseType: !423, size: 32, align: 32, offset: 1216)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !419, file: !231, line: 96, baseType: !444, size: 64, align: 64, offset: 1280)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !419, file: !231, line: 97, baseType: !428, size: 8, align: 8, offset: 1344)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !419, file: !231, line: 100, baseType: !449, size: 64, align: 64, offset: 1408)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !231, line: 73, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !231, line: 65, size: 704, align: 64, elements: !452)
!452 = !{!453, !463, !464, !465, !466, !467, !468}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !451, file: !231, line: 66, baseType: !454, size: 128, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !455, line: 31, baseType: !456)
!455 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !457, line: 30, size: 128, align: 64, elements: !458)
!457 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!458 = !{!459, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !456, file: !457, line: 32, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !285, line: 139, baseType: !286)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !456, file: !457, line: 33, baseType: !462, size: 64, align: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !285, line: 141, baseType: !286)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !451, file: !231, line: 67, baseType: !428, size: 8, align: 8, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !451, file: !231, line: 68, baseType: !454, size: 128, align: 64, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !451, file: !231, line: 69, baseType: !428, size: 8, align: 8, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !451, file: !231, line: 70, baseType: !454, size: 128, align: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !451, file: !231, line: 71, baseType: !454, size: 128, align: 64, offset: 512)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !451, file: !231, line: 72, baseType: !205, size: 32, align: 32, offset: 640)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !419, file: !231, line: 101, baseType: !428, size: 8, align: 8, offset: 1472)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !419, file: !231, line: 102, baseType: !205, size: 32, align: 32, offset: 1504)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !419, file: !231, line: 103, baseType: !79, size: 32, align: 32, offset: 1536)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !419, file: !231, line: 104, baseType: !79, size: 32, align: 32, offset: 1568)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !419, file: !231, line: 105, baseType: !79, size: 32, align: 32, offset: 1600)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !419, file: !231, line: 107, baseType: !81, size: 32, align: 32, offset: 1632)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !419, file: !231, line: 109, baseType: !428, size: 8, align: 8, offset: 1664)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !419, file: !231, line: 110, baseType: !232, size: 64, align: 64, offset: 1728)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !396, file: !395, line: 53, baseType: !142, size: 64, align: 64, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !396, file: !395, line: 55, baseType: !79, size: 32, align: 32, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "flagmask", scope: !396, file: !395, line: 56, baseType: !79, size: 32, align: 32, offset: 352)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "have_peer", scope: !396, file: !395, line: 61, baseType: !428, size: 8, align: 8, offset: 384)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !396, file: !395, line: 65, baseType: !482, size: 128, align: 32, offset: 416)
!482 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !396, file: !395, line: 62, size: 128, align: 32, elements: !483)
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !482, file: !395, line: 63, baseType: !75, size: 32, align: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !482, file: !395, line: 64, baseType: !161, size: 128, align: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track", scope: !396, file: !395, line: 66, baseType: !428, size: 8, align: 8, offset: 544)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "track_group", scope: !396, file: !395, line: 67, baseType: !488, size: 64, align: 64, offset: 576)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "static_track_group_t", file: !490, line: 39, baseType: !491)
!490 = !DIFile(filename: "./../include/vrrp_static_track.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_track_group", file: !490, line: 35, size: 192, align: 64, elements: !492)
!492 = !{!493, !494, !504}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !491, file: !490, line: 36, baseType: !142, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !491, file: !490, line: 37, baseType: !495, size: 64, align: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !497, line: 34, baseType: !498)
!497 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !497, line: 30, size: 128, align: 64, elements: !499)
!499 = !{!500, !501, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !498, file: !497, line: 31, baseType: !81, size: 32, align: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !498, file: !497, line: 32, baseType: !81, size: 32, align: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !498, file: !497, line: 33, baseType: !503, size: 64, align: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !491, file: !490, line: 38, baseType: !232, size: 64, align: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !396, file: !395, line: 69, baseType: !428, size: 8, align: 8, offset: 640)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rule_set", scope: !396, file: !395, line: 70, baseType: !428, size: 8, align: 8, offset: 648)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "garp_gna_pending", scope: !396, file: !395, line: 72, baseType: !428, size: 8, align: 8, offset: 656)
!508 = !DILocalVariable(name: "handle", arg: 1, scope: !389, file: !313, line: 184, type: !316)
!509 = !DILocation(line: 184, column: 49, scope: !389)
!510 = !DILocalVariable(name: "chain_name", arg: 2, scope: !389, file: !313, line: 184, type: !319)
!511 = !DILocation(line: 184, column: 69, scope: !389)
!512 = !DILocalVariable(name: "rulenum", arg: 3, scope: !389, file: !313, line: 184, type: !81)
!513 = !DILocation(line: 184, column: 94, scope: !389)
!514 = !DILocalVariable(name: "target_name", arg: 4, scope: !389, file: !313, line: 184, type: !319)
!515 = !DILocation(line: 184, column: 115, scope: !389)
!516 = !DILocalVariable(name: "src_ip_address", arg: 5, scope: !389, file: !313, line: 184, type: !392)
!517 = !DILocation(line: 184, column: 148, scope: !389)
!518 = !DILocalVariable(name: "dst_ip_address", arg: 6, scope: !389, file: !313, line: 184, type: !392)
!519 = !DILocation(line: 184, column: 184, scope: !389)
!520 = !DILocalVariable(name: "in_iface", arg: 7, scope: !389, file: !313, line: 184, type: !319)
!521 = !DILocation(line: 184, column: 212, scope: !389)
!522 = !DILocalVariable(name: "out_iface", arg: 8, scope: !389, file: !313, line: 184, type: !319)
!523 = !DILocation(line: 184, column: 234, scope: !389)
!524 = !DILocalVariable(name: "protocol", arg: 9, scope: !389, file: !313, line: 184, type: !143)
!525 = !DILocation(line: 184, column: 254, scope: !389)
!526 = !DILocalVariable(name: "type", arg: 10, scope: !389, file: !313, line: 184, type: !168)
!527 = !DILocation(line: 184, column: 272, scope: !389)
!528 = !DILocalVariable(name: "cmd", arg: 11, scope: !389, file: !313, line: 184, type: !205)
!529 = !DILocation(line: 184, column: 282, scope: !389)
!530 = !DILocalVariable(name: "force", arg: 12, scope: !389, file: !313, line: 184, type: !428)
!531 = !DILocation(line: 184, column: 292, scope: !389)
!532 = !DILocalVariable(name: "size", scope: !389, file: !313, line: 186, type: !227)
!533 = !DILocation(line: 186, column: 9, scope: !389)
!534 = !DILocalVariable(name: "fw", scope: !389, file: !313, line: 187, type: !67)
!535 = !DILocation(line: 187, column: 20, scope: !389)
!536 = !DILocalVariable(name: "target", scope: !389, file: !313, line: 188, type: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xt_entry_target", file: !108, line: 33, size: 256, align: 64, elements: !539)
!539 = !{!540, !557}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !538, file: !108, line: 51, baseType: !541, size: 256, align: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !538, file: !108, line: 34, size: 256, align: 64, elements: !542)
!542 = !{!543, !549, !556}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !541, file: !108, line: 41, baseType: !544, size: 256, align: 16)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !541, file: !108, line: 35, size: 256, align: 16, elements: !545)
!545 = !{!546, !547, !548}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "target_size", scope: !544, file: !108, line: 36, baseType: !96, size: 16, align: 16)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !544, file: !108, line: 39, baseType: !129, size: 232, align: 8, offset: 16)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !544, file: !108, line: 40, baseType: !100, size: 8, align: 8, offset: 248)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "kernel", scope: !541, file: !108, line: 47, baseType: !550, size: 128, align: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !541, file: !108, line: 42, size: 128, align: 64, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "target_size", scope: !550, file: !108, line: 43, baseType: !96, size: 16, align: 16)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !550, file: !108, line: 46, baseType: !554, size: 64, align: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "xt_target", file: !108, line: 46, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "target_size", scope: !541, file: !108, line: 50, baseType: !96, size: 16, align: 16)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !538, file: !108, line: 53, baseType: !115, align: 8, offset: 256)
!558 = !DILocation(line: 188, column: 26, scope: !389)
!559 = !DILocalVariable(name: "match", scope: !389, file: !313, line: 189, type: !118)
!560 = !DILocation(line: 189, column: 25, scope: !389)
!561 = !DILocalVariable(name: "chain", scope: !389, file: !313, line: 190, type: !562)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "xt_chainlabel", file: !318, line: 4, baseType: !563)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 256, align: 8, elements: !436)
!564 = !DILocation(line: 190, column: 16, scope: !389)
!565 = !DILocalVariable(name: "res", scope: !389, file: !313, line: 191, type: !205)
!566 = !DILocation(line: 191, column: 6, scope: !389)
!567 = !DILocalVariable(name: "sav_errno", scope: !389, file: !313, line: 192, type: !205)
!568 = !DILocation(line: 192, column: 6, scope: !389)
!569 = !DILocation(line: 196, column: 2, scope: !389)
!570 = !DILocation(line: 198, column: 7, scope: !389)
!571 = !DILocation(line: 201, column: 7, scope: !572)
!572 = distinct !DILexicalBlock(scope: !389, file: !313, line: 201, column: 7)
!573 = !DILocation(line: 201, column: 16, scope: !572)
!574 = !DILocation(line: 201, column: 7, scope: !389)
!575 = !DILocation(line: 202, column: 8, scope: !572)
!576 = !DILocation(line: 202, column: 3, scope: !572)
!577 = !DILocation(line: 204, column: 34, scope: !389)
!578 = !DILocation(line: 204, column: 27, scope: !389)
!579 = !DILocation(line: 204, column: 7, scope: !389)
!580 = !DILocation(line: 204, column: 5, scope: !389)
!581 = !DILocation(line: 206, column: 2, scope: !389)
!582 = !DILocation(line: 206, column: 6, scope: !389)
!583 = !DILocation(line: 206, column: 20, scope: !389)
!584 = !DILocation(line: 208, column: 7, scope: !585)
!585 = distinct !DILexicalBlock(scope: !389, file: !313, line: 208, column: 7)
!586 = !DILocation(line: 208, column: 22, scope: !585)
!587 = !DILocation(line: 208, column: 25, scope: !588)
!588 = !DILexicalBlockFile(scope: !585, file: !313, discriminator: 1)
!589 = !DILocation(line: 208, column: 41, scope: !588)
!590 = !DILocation(line: 208, column: 45, scope: !588)
!591 = !DILocation(line: 208, column: 56, scope: !588)
!592 = !DILocation(line: 208, column: 7, scope: !588)
!593 = !DILocation(line: 210, column: 11, scope: !594)
!594 = distinct !DILexicalBlock(scope: !585, file: !313, line: 209, column: 2)
!595 = !DILocation(line: 210, column: 15, scope: !594)
!596 = !DILocation(line: 210, column: 18, scope: !594)
!597 = !DILocation(line: 210, column: 3, scope: !594)
!598 = !DILocation(line: 210, column: 24, scope: !594)
!599 = !DILocation(line: 210, column: 40, scope: !594)
!600 = !DILocation(line: 210, column: 42, scope: !594)
!601 = !DILocation(line: 210, column: 46, scope: !594)
!602 = !DILocation(line: 211, column: 13, scope: !594)
!603 = !DILocation(line: 211, column: 17, scope: !594)
!604 = !DILocation(line: 211, column: 20, scope: !594)
!605 = !DILocation(line: 211, column: 3, scope: !594)
!606 = !DILocation(line: 212, column: 2, scope: !594)
!607 = !DILocation(line: 214, column: 7, scope: !608)
!608 = distinct !DILexicalBlock(scope: !389, file: !313, line: 214, column: 7)
!609 = !DILocation(line: 214, column: 22, scope: !608)
!610 = !DILocation(line: 214, column: 25, scope: !611)
!611 = !DILexicalBlockFile(scope: !608, file: !313, discriminator: 1)
!612 = !DILocation(line: 214, column: 41, scope: !611)
!613 = !DILocation(line: 214, column: 45, scope: !611)
!614 = !DILocation(line: 214, column: 56, scope: !611)
!615 = !DILocation(line: 214, column: 7, scope: !611)
!616 = !DILocation(line: 216, column: 11, scope: !617)
!617 = distinct !DILexicalBlock(scope: !608, file: !313, line: 215, column: 2)
!618 = !DILocation(line: 216, column: 15, scope: !617)
!619 = !DILocation(line: 216, column: 18, scope: !617)
!620 = !DILocation(line: 216, column: 3, scope: !617)
!621 = !DILocation(line: 216, column: 24, scope: !617)
!622 = !DILocation(line: 216, column: 40, scope: !617)
!623 = !DILocation(line: 216, column: 42, scope: !617)
!624 = !DILocation(line: 216, column: 46, scope: !617)
!625 = !DILocation(line: 217, column: 13, scope: !617)
!626 = !DILocation(line: 217, column: 17, scope: !617)
!627 = !DILocation(line: 217, column: 20, scope: !617)
!628 = !DILocation(line: 217, column: 3, scope: !617)
!629 = !DILocation(line: 218, column: 2, scope: !617)
!630 = !DILocation(line: 220, column: 6, scope: !631)
!631 = distinct !DILexicalBlock(scope: !389, file: !313, line: 220, column: 6)
!632 = !DILocation(line: 220, column: 6, scope: !389)
!633 = !DILocation(line: 221, column: 13, scope: !631)
!634 = !DILocation(line: 221, column: 17, scope: !631)
!635 = !DILocation(line: 221, column: 20, scope: !631)
!636 = !DILocation(line: 221, column: 29, scope: !631)
!637 = !DILocation(line: 221, column: 33, scope: !631)
!638 = !DILocation(line: 221, column: 36, scope: !631)
!639 = !DILocation(line: 221, column: 50, scope: !631)
!640 = !DILocation(line: 221, column: 3, scope: !631)
!641 = !DILocation(line: 222, column: 6, scope: !642)
!642 = distinct !DILexicalBlock(scope: !389, file: !313, line: 222, column: 6)
!643 = !DILocation(line: 222, column: 6, scope: !389)
!644 = !DILocation(line: 223, column: 13, scope: !642)
!645 = !DILocation(line: 223, column: 17, scope: !642)
!646 = !DILocation(line: 223, column: 20, scope: !642)
!647 = !DILocation(line: 223, column: 30, scope: !642)
!648 = !DILocation(line: 223, column: 34, scope: !642)
!649 = !DILocation(line: 223, column: 37, scope: !642)
!650 = !DILocation(line: 223, column: 52, scope: !642)
!651 = !DILocation(line: 223, column: 3, scope: !642)
!652 = !DILocation(line: 225, column: 7, scope: !653)
!653 = distinct !DILexicalBlock(scope: !389, file: !313, line: 225, column: 7)
!654 = !DILocation(line: 225, column: 16, scope: !653)
!655 = !DILocation(line: 225, column: 7, scope: !389)
!656 = !DILocation(line: 226, column: 18, scope: !657)
!657 = distinct !DILexicalBlock(scope: !653, file: !313, line: 225, column: 33)
!658 = !DILocation(line: 226, column: 3, scope: !657)
!659 = !DILocation(line: 226, column: 7, scope: !657)
!660 = !DILocation(line: 226, column: 10, scope: !657)
!661 = !DILocation(line: 226, column: 16, scope: !657)
!662 = !DILocation(line: 230, column: 8, scope: !663)
!663 = distinct !DILexicalBlock(scope: !657, file: !313, line: 230, column: 8)
!664 = !DILocation(line: 230, column: 17, scope: !663)
!665 = !DILocation(line: 230, column: 8, scope: !657)
!666 = !DILocation(line: 232, column: 44, scope: !667)
!667 = distinct !DILexicalBlock(scope: !663, file: !313, line: 231, column: 3)
!668 = !DILocation(line: 232, column: 37, scope: !667)
!669 = !DILocation(line: 232, column: 49, scope: !667)
!670 = !DILocation(line: 232, column: 53, scope: !667)
!671 = !DILocation(line: 232, column: 47, scope: !667)
!672 = !DILocation(line: 232, column: 12, scope: !667)
!673 = !DILocation(line: 232, column: 10, scope: !667)
!674 = !DILocation(line: 233, column: 4, scope: !667)
!675 = !DILocation(line: 233, column: 11, scope: !667)
!676 = !DILocation(line: 233, column: 13, scope: !667)
!677 = !DILocation(line: 233, column: 24, scope: !667)
!678 = !DILocation(line: 234, column: 4, scope: !667)
!679 = !DILocation(line: 234, column: 11, scope: !667)
!680 = !DILocation(line: 234, column: 13, scope: !667)
!681 = !DILocation(line: 234, column: 18, scope: !667)
!682 = !DILocation(line: 234, column: 27, scope: !667)
!683 = !DILocation(line: 235, column: 35, scope: !667)
!684 = !DILocation(line: 235, column: 39, scope: !667)
!685 = !DILocation(line: 235, column: 55, scope: !667)
!686 = !DILocation(line: 235, column: 62, scope: !667)
!687 = !DILocation(line: 235, column: 64, scope: !667)
!688 = !DILocation(line: 235, column: 53, scope: !667)
!689 = !DILocation(line: 235, column: 24, scope: !667)
!690 = !DILocation(line: 235, column: 4, scope: !667)
!691 = !DILocation(line: 235, column: 8, scope: !667)
!692 = !DILocation(line: 235, column: 22, scope: !667)
!693 = !DILocation(line: 236, column: 13, scope: !667)
!694 = !DILocation(line: 236, column: 20, scope: !667)
!695 = !DILocation(line: 236, column: 22, scope: !667)
!696 = !DILocation(line: 236, column: 27, scope: !667)
!697 = !DILocation(line: 236, column: 4, scope: !667)
!698 = !DILocalVariable(name: "icmpinfo", scope: !667, file: !313, line: 238, type: !144)
!699 = !DILocation(line: 238, column: 21, scope: !667)
!700 = !DILocation(line: 238, column: 52, scope: !667)
!701 = !DILocation(line: 238, column: 59, scope: !667)
!702 = !DILocation(line: 238, column: 32, scope: !667)
!703 = !DILocation(line: 239, column: 21, scope: !667)
!704 = !DILocation(line: 239, column: 4, scope: !667)
!705 = !DILocation(line: 239, column: 14, scope: !667)
!706 = !DILocation(line: 239, column: 19, scope: !667)
!707 = !DILocation(line: 240, column: 4, scope: !667)
!708 = !DILocation(line: 240, column: 14, scope: !667)
!709 = !DILocation(line: 240, column: 22, scope: !667)
!710 = !DILocation(line: 241, column: 4, scope: !667)
!711 = !DILocation(line: 241, column: 14, scope: !667)
!712 = !DILocation(line: 241, column: 22, scope: !667)
!713 = !DILocation(line: 242, column: 4, scope: !667)
!714 = !DILocation(line: 242, column: 14, scope: !667)
!715 = !DILocation(line: 242, column: 23, scope: !667)
!716 = !DILocation(line: 243, column: 3, scope: !667)
!717 = !DILocation(line: 244, column: 2, scope: !657)
!718 = !DILocation(line: 247, column: 30, scope: !389)
!719 = !DILocation(line: 247, column: 20, scope: !389)
!720 = !DILocation(line: 247, column: 2, scope: !389)
!721 = !DILocation(line: 247, column: 6, scope: !389)
!722 = !DILocation(line: 247, column: 18, scope: !389)
!723 = !DILocation(line: 248, column: 28, scope: !389)
!724 = !DILocation(line: 248, column: 11, scope: !389)
!725 = !DILocation(line: 248, column: 9, scope: !389)
!726 = !DILocation(line: 249, column: 2, scope: !389)
!727 = !DILocation(line: 249, column: 10, scope: !389)
!728 = !DILocation(line: 249, column: 12, scope: !389)
!729 = !DILocation(line: 249, column: 17, scope: !389)
!730 = !DILocation(line: 249, column: 29, scope: !389)
!731 = !DILocation(line: 250, column: 10, scope: !389)
!732 = !DILocation(line: 250, column: 18, scope: !389)
!733 = !DILocation(line: 250, column: 20, scope: !389)
!734 = !DILocation(line: 250, column: 25, scope: !389)
!735 = !DILocation(line: 250, column: 31, scope: !389)
!736 = !DILocation(line: 250, column: 2, scope: !389)
!737 = !DILocation(line: 252, column: 10, scope: !389)
!738 = !DILocation(line: 252, column: 17, scope: !389)
!739 = !DILocation(line: 252, column: 2, scope: !389)
!740 = !DILocation(line: 254, column: 6, scope: !741)
!741 = distinct !DILexicalBlock(scope: !389, file: !313, line: 254, column: 6)
!742 = !DILocation(line: 254, column: 10, scope: !741)
!743 = !DILocation(line: 254, column: 6, scope: !389)
!744 = !DILocation(line: 255, column: 27, scope: !745)
!745 = distinct !DILexicalBlock(scope: !741, file: !313, line: 254, column: 16)
!746 = !DILocation(line: 255, column: 31, scope: !745)
!747 = !DILocation(line: 255, column: 3, scope: !745)
!748 = !DILocalVariable(name: "matchmask", scope: !745, file: !313, line: 255, type: !749)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, align: 8, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: -1)
!752 = !DIExpression(DW_OP_deref)
!753 = !DILocation(line: 255, column: 17, scope: !745)
!754 = !DILocation(line: 256, column: 27, scope: !745)
!755 = !DILocation(line: 256, column: 31, scope: !745)
!756 = !DILocation(line: 256, column: 3, scope: !745)
!757 = !DILocation(line: 257, column: 27, scope: !745)
!758 = !DILocation(line: 257, column: 34, scope: !745)
!759 = !DILocation(line: 257, column: 49, scope: !745)
!760 = !DILocation(line: 257, column: 9, scope: !745)
!761 = !DILocation(line: 257, column: 7, scope: !745)
!762 = !DILocation(line: 258, column: 2, scope: !741)
!763 = !DILocation(line: 258, column: 2, scope: !745)
!764 = !DILocation(line: 259, column: 11, scope: !765)
!765 = distinct !DILexicalBlock(scope: !741, file: !313, line: 259, column: 11)
!766 = !DILocation(line: 259, column: 19, scope: !765)
!767 = !DILocation(line: 259, column: 11, scope: !741)
!768 = !DILocation(line: 260, column: 28, scope: !765)
!769 = !DILocation(line: 260, column: 35, scope: !765)
!770 = !DILocation(line: 260, column: 39, scope: !765)
!771 = !DILocation(line: 260, column: 9, scope: !765)
!772 = !DILocation(line: 260, column: 7, scope: !765)
!773 = !DILocation(line: 260, column: 3, scope: !765)
!774 = !DILocation(line: 262, column: 28, scope: !765)
!775 = !DILocation(line: 262, column: 35, scope: !765)
!776 = !DILocation(line: 262, column: 39, scope: !765)
!777 = !DILocation(line: 262, column: 48, scope: !765)
!778 = !DILocation(line: 262, column: 9, scope: !765)
!779 = !DILocation(line: 262, column: 7, scope: !765)
!780 = !DILocation(line: 264, column: 15, scope: !389)
!781 = !DILocation(line: 264, column: 14, scope: !389)
!782 = !DILocation(line: 264, column: 12, scope: !389)
!783 = !DILocation(line: 266, column: 8, scope: !389)
!784 = !DILocation(line: 266, column: 3, scope: !389)
!785 = !DILocation(line: 266, column: 18, scope: !389)
!786 = !DILocation(line: 268, column: 6, scope: !787)
!787 = distinct !DILexicalBlock(scope: !389, file: !313, line: 268, column: 6)
!788 = !DILocation(line: 268, column: 10, scope: !787)
!789 = !DILocation(line: 268, column: 15, scope: !787)
!790 = !DILocation(line: 268, column: 20, scope: !791)
!791 = !DILexicalBlockFile(scope: !787, file: !313, discriminator: 1)
!792 = !DILocation(line: 268, column: 26, scope: !791)
!793 = !DILocation(line: 268, column: 29, scope: !794)
!794 = !DILexicalBlockFile(scope: !787, file: !313, discriminator: 2)
!795 = !DILocation(line: 268, column: 39, scope: !794)
!796 = !DILocation(line: 268, column: 6, scope: !794)
!797 = !DILocation(line: 270, column: 80, scope: !798)
!798 = distinct !DILexicalBlock(scope: !787, file: !313, line: 269, column: 2)
!799 = !DILocation(line: 270, column: 87, scope: !798)
!800 = !DILocation(line: 270, column: 107, scope: !798)
!801 = !DILocation(line: 270, column: 92, scope: !798)
!802 = !DILocation(line: 270, column: 3, scope: !803)
!803 = !DILexicalBlockFile(scope: !798, file: !313, discriminator: 1)
!804 = !DILocation(line: 272, column: 10, scope: !798)
!805 = !DILocation(line: 272, column: 3, scope: !798)
!806 = !DILocation(line: 275, column: 2, scope: !389)
!807 = !DILocation(line: 276, column: 1, scope: !389)
!808 = distinct !DISubprogram(name: "set_iface", scope: !313, file: !313, line: 133, type: !809, isLocal: true, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !321)
!809 = !DISubroutineType(types: !810)
!810 = !{null, !142, !811, !319}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!812 = !DILocalVariable(name: "vianame", arg: 1, scope: !808, file: !313, line: 133, type: !142)
!813 = !DILocation(line: 133, column: 17, scope: !808)
!814 = !DILocalVariable(name: "mask", arg: 2, scope: !808, file: !313, line: 133, type: !811)
!815 = !DILocation(line: 133, column: 41, scope: !808)
!816 = !DILocalVariable(name: "iface", arg: 3, scope: !808, file: !313, line: 133, type: !319)
!817 = !DILocation(line: 133, column: 59, scope: !808)
!818 = !DILocalVariable(name: "vialen", scope: !808, file: !313, line: 135, type: !227)
!819 = !DILocation(line: 135, column: 9, scope: !808)
!820 = !DILocation(line: 135, column: 25, scope: !808)
!821 = !DILocation(line: 135, column: 18, scope: !808)
!822 = !DILocation(line: 137, column: 9, scope: !808)
!823 = !DILocation(line: 137, column: 2, scope: !808)
!824 = !DILocation(line: 138, column: 9, scope: !808)
!825 = !DILocation(line: 138, column: 2, scope: !808)
!826 = !DILocation(line: 140, column: 9, scope: !808)
!827 = !DILocation(line: 140, column: 18, scope: !808)
!828 = !DILocation(line: 140, column: 2, scope: !808)
!829 = !DILocation(line: 141, column: 7, scope: !830)
!830 = distinct !DILexicalBlock(scope: !808, file: !313, line: 141, column: 6)
!831 = !DILocation(line: 141, column: 6, scope: !808)
!832 = !DILocation(line: 142, column: 3, scope: !830)
!833 = !DILocation(line: 144, column: 9, scope: !808)
!834 = !DILocation(line: 144, column: 21, scope: !808)
!835 = !DILocation(line: 144, column: 28, scope: !808)
!836 = !DILocation(line: 144, column: 2, scope: !808)
!837 = !DILocation(line: 145, column: 1, scope: !808)
!838 = !DILocation(line: 145, column: 1, scope: !839)
!839 = !DILexicalBlockFile(scope: !808, file: !313, discriminator: 1)
!840 = distinct !DISubprogram(name: "ipt_get_target", scope: !69, file: !69, line: 219, type: !841, isLocal: true, isDefinition: true, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !321)
!841 = !DISubroutineType(types: !842)
!842 = !{!537, !67}
!843 = !DILocalVariable(name: "e", arg: 1, scope: !840, file: !69, line: 219, type: !67)
!844 = !DILocation(line: 219, column: 34, scope: !840)
!845 = !DILocation(line: 221, column: 17, scope: !840)
!846 = !DILocation(line: 221, column: 9, scope: !840)
!847 = !DILocation(line: 221, column: 21, scope: !840)
!848 = !DILocation(line: 221, column: 24, scope: !840)
!849 = !DILocation(line: 221, column: 19, scope: !840)
!850 = !DILocation(line: 221, column: 2, scope: !840)
!851 = distinct !DISubprogram(name: "ip6tables_open", scope: !313, file: !313, line: 279, type: !314, isLocal: false, isDefinition: true, scopeLine: 280, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !321)
!852 = !DILocalVariable(name: "tablename", arg: 1, scope: !851, file: !313, line: 279, type: !319)
!853 = !DILocation(line: 279, column: 50, scope: !851)
!854 = !DILocalVariable(name: "h", scope: !851, file: !313, line: 281, type: !316)
!855 = !DILocation(line: 281, column: 22, scope: !851)
!856 = !DILocation(line: 283, column: 27, scope: !857)
!857 = distinct !DILexicalBlock(scope: !851, file: !313, line: 283, column: 7)
!858 = !DILocation(line: 283, column: 14, scope: !857)
!859 = !DILocation(line: 283, column: 12, scope: !857)
!860 = !DILocation(line: 283, column: 7, scope: !851)
!861 = !DILocation(line: 284, column: 3, scope: !857)
!862 = !DILocation(line: 286, column: 9, scope: !851)
!863 = !DILocation(line: 286, column: 2, scope: !851)
!864 = !DILocation(line: 287, column: 1, scope: !851)
!865 = distinct !DISubprogram(name: "ip6tables_close", scope: !313, file: !313, line: 289, type: !337, isLocal: false, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !321)
!866 = !DILocalVariable(name: "handle", arg: 1, scope: !865, file: !313, line: 289, type: !316)
!867 = !DILocation(line: 289, column: 43, scope: !865)
!868 = !DILocalVariable(name: "updated", arg: 2, scope: !865, file: !313, line: 289, type: !205)
!869 = !DILocation(line: 289, column: 55, scope: !865)
!870 = !DILocalVariable(name: "res", scope: !865, file: !313, line: 291, type: !205)
!871 = !DILocation(line: 291, column: 6, scope: !865)
!872 = !DILocalVariable(name: "sav_errno", scope: !865, file: !313, line: 292, type: !205)
!873 = !DILocation(line: 292, column: 6, scope: !865)
!874 = !DILocation(line: 294, column: 6, scope: !875)
!875 = distinct !DILexicalBlock(scope: !865, file: !313, line: 294, column: 6)
!876 = !DILocation(line: 294, column: 6, scope: !865)
!877 = !DILocation(line: 295, column: 31, scope: !878)
!878 = distinct !DILexicalBlock(scope: !879, file: !313, line: 295, column: 8)
!879 = distinct !DILexicalBlock(scope: !875, file: !313, line: 294, column: 15)
!880 = !DILocation(line: 295, column: 16, scope: !878)
!881 = !DILocation(line: 295, column: 14, scope: !878)
!882 = !DILocation(line: 295, column: 42, scope: !878)
!883 = !DILocation(line: 295, column: 8, scope: !879)
!884 = !DILocation(line: 297, column: 17, scope: !885)
!885 = distinct !DILexicalBlock(scope: !878, file: !313, line: 296, column: 3)
!886 = !DILocation(line: 297, column: 16, scope: !885)
!887 = !DILocation(line: 297, column: 14, scope: !885)
!888 = !DILocation(line: 298, column: 56, scope: !885)
!889 = !DILocation(line: 298, column: 77, scope: !885)
!890 = !DILocation(line: 298, column: 61, scope: !885)
!891 = !DILocation(line: 298, column: 4, scope: !892)
!892 = !DILexicalBlockFile(scope: !885, file: !313, discriminator: 1)
!893 = !DILocation(line: 299, column: 3, scope: !885)
!894 = !DILocation(line: 300, column: 2, scope: !879)
!895 = !DILocation(line: 302, column: 15, scope: !865)
!896 = !DILocation(line: 302, column: 2, scope: !865)
!897 = !DILocation(line: 304, column: 7, scope: !898)
!898 = distinct !DILexicalBlock(scope: !865, file: !313, line: 304, column: 7)
!899 = !DILocation(line: 304, column: 11, scope: !898)
!900 = !DILocation(line: 304, column: 7, scope: !865)
!901 = !DILocation(line: 305, column: 3, scope: !898)
!902 = !DILocation(line: 307, column: 12, scope: !898)
!903 = !DILocation(line: 307, column: 3, scope: !898)
!904 = !DILocation(line: 308, column: 1, scope: !865)
!905 = distinct !DISubprogram(name: "ip6tables_is_chain", scope: !313, file: !313, line: 310, type: !379, isLocal: false, isDefinition: true, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !321)
!906 = !DILocalVariable(name: "handle", arg: 1, scope: !905, file: !313, line: 310, type: !316)
!907 = !DILocation(line: 310, column: 44, scope: !905)
!908 = !DILocalVariable(name: "chain_name", arg: 2, scope: !905, file: !313, line: 310, type: !319)
!909 = !DILocation(line: 310, column: 64, scope: !905)
!910 = !DILocation(line: 312, column: 24, scope: !905)
!911 = !DILocation(line: 312, column: 36, scope: !905)
!912 = !DILocation(line: 312, column: 9, scope: !905)
!913 = !DILocation(line: 312, column: 2, scope: !905)
!914 = distinct !DISubprogram(name: "ip6tables_process_entry", scope: !313, file: !313, line: 315, type: !390, isLocal: false, isDefinition: true, scopeLine: 316, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !321)
!915 = !DILocalVariable(name: "handle", arg: 1, scope: !914, file: !313, line: 315, type: !316)
!916 = !DILocation(line: 315, column: 50, scope: !914)
!917 = !DILocalVariable(name: "chain_name", arg: 2, scope: !914, file: !313, line: 315, type: !319)
!918 = !DILocation(line: 315, column: 70, scope: !914)
!919 = !DILocalVariable(name: "rulenum", arg: 3, scope: !914, file: !313, line: 315, type: !81)
!920 = !DILocation(line: 315, column: 95, scope: !914)
!921 = !DILocalVariable(name: "target_name", arg: 4, scope: !914, file: !313, line: 315, type: !319)
!922 = !DILocation(line: 315, column: 116, scope: !914)
!923 = !DILocalVariable(name: "src_ip_address", arg: 5, scope: !914, file: !313, line: 315, type: !392)
!924 = !DILocation(line: 315, column: 149, scope: !914)
!925 = !DILocalVariable(name: "dst_ip_address", arg: 6, scope: !914, file: !313, line: 315, type: !392)
!926 = !DILocation(line: 315, column: 185, scope: !914)
!927 = !DILocalVariable(name: "in_iface", arg: 7, scope: !914, file: !313, line: 315, type: !319)
!928 = !DILocation(line: 315, column: 213, scope: !914)
!929 = !DILocalVariable(name: "out_iface", arg: 8, scope: !914, file: !313, line: 315, type: !319)
!930 = !DILocation(line: 315, column: 235, scope: !914)
!931 = !DILocalVariable(name: "protocol", arg: 9, scope: !914, file: !313, line: 315, type: !143)
!932 = !DILocation(line: 315, column: 255, scope: !914)
!933 = !DILocalVariable(name: "type", arg: 10, scope: !914, file: !313, line: 315, type: !168)
!934 = !DILocation(line: 315, column: 273, scope: !914)
!935 = !DILocalVariable(name: "cmd", arg: 11, scope: !914, file: !313, line: 315, type: !205)
!936 = !DILocation(line: 315, column: 283, scope: !914)
!937 = !DILocalVariable(name: "force", arg: 12, scope: !914, file: !313, line: 315, type: !428)
!938 = !DILocation(line: 315, column: 293, scope: !914)
!939 = !DILocalVariable(name: "size", scope: !914, file: !313, line: 317, type: !227)
!940 = !DILocation(line: 317, column: 9, scope: !914)
!941 = !DILocalVariable(name: "fw", scope: !914, file: !313, line: 318, type: !153)
!942 = !DILocation(line: 318, column: 21, scope: !914)
!943 = !DILocalVariable(name: "target", scope: !914, file: !313, line: 319, type: !537)
!944 = !DILocation(line: 319, column: 26, scope: !914)
!945 = !DILocalVariable(name: "match", scope: !914, file: !313, line: 320, type: !118)
!946 = !DILocation(line: 320, column: 25, scope: !914)
!947 = !DILocalVariable(name: "chain", scope: !914, file: !313, line: 321, type: !562)
!948 = !DILocation(line: 321, column: 17, scope: !914)
!949 = !DILocalVariable(name: "res", scope: !914, file: !313, line: 322, type: !205)
!950 = !DILocation(line: 322, column: 6, scope: !914)
!951 = !DILocalVariable(name: "sav_errno", scope: !914, file: !313, line: 323, type: !205)
!952 = !DILocation(line: 323, column: 6, scope: !914)
!953 = !DILocation(line: 327, column: 2, scope: !914)
!954 = !DILocation(line: 329, column: 7, scope: !914)
!955 = !DILocation(line: 332, column: 7, scope: !956)
!956 = distinct !DILexicalBlock(scope: !914, file: !313, line: 332, column: 7)
!957 = !DILocation(line: 332, column: 16, scope: !956)
!958 = !DILocation(line: 332, column: 7, scope: !914)
!959 = !DILocation(line: 333, column: 8, scope: !956)
!960 = !DILocation(line: 333, column: 3, scope: !956)
!961 = !DILocation(line: 335, column: 35, scope: !914)
!962 = !DILocation(line: 335, column: 28, scope: !914)
!963 = !DILocation(line: 335, column: 7, scope: !914)
!964 = !DILocation(line: 335, column: 5, scope: !914)
!965 = !DILocation(line: 337, column: 2, scope: !914)
!966 = !DILocation(line: 337, column: 6, scope: !914)
!967 = !DILocation(line: 337, column: 20, scope: !914)
!968 = !DILocation(line: 339, column: 7, scope: !969)
!969 = distinct !DILexicalBlock(scope: !914, file: !313, line: 339, column: 7)
!970 = !DILocation(line: 339, column: 22, scope: !969)
!971 = !DILocation(line: 339, column: 25, scope: !972)
!972 = !DILexicalBlockFile(scope: !969, file: !313, discriminator: 1)
!973 = !DILocation(line: 339, column: 41, scope: !972)
!974 = !DILocation(line: 339, column: 45, scope: !972)
!975 = !DILocation(line: 339, column: 56, scope: !972)
!976 = !DILocation(line: 339, column: 7, scope: !972)
!977 = !DILocation(line: 340, column: 11, scope: !978)
!978 = distinct !DILexicalBlock(scope: !969, file: !313, line: 339, column: 70)
!979 = !DILocation(line: 340, column: 15, scope: !978)
!980 = !DILocation(line: 340, column: 20, scope: !978)
!981 = !DILocation(line: 340, column: 3, scope: !978)
!982 = !DILocation(line: 340, column: 26, scope: !978)
!983 = !DILocation(line: 340, column: 42, scope: !978)
!984 = !DILocation(line: 340, column: 44, scope: !978)
!985 = !DILocation(line: 341, column: 13, scope: !978)
!986 = !DILocation(line: 341, column: 17, scope: !978)
!987 = !DILocation(line: 341, column: 22, scope: !978)
!988 = !DILocation(line: 341, column: 3, scope: !978)
!989 = !DILocation(line: 342, column: 2, scope: !978)
!990 = !DILocation(line: 344, column: 7, scope: !991)
!991 = distinct !DILexicalBlock(scope: !914, file: !313, line: 344, column: 7)
!992 = !DILocation(line: 344, column: 22, scope: !991)
!993 = !DILocation(line: 344, column: 25, scope: !994)
!994 = !DILexicalBlockFile(scope: !991, file: !313, discriminator: 1)
!995 = !DILocation(line: 344, column: 41, scope: !994)
!996 = !DILocation(line: 344, column: 45, scope: !994)
!997 = !DILocation(line: 344, column: 56, scope: !994)
!998 = !DILocation(line: 344, column: 7, scope: !994)
!999 = !DILocation(line: 345, column: 11, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !991, file: !313, line: 344, column: 70)
!1001 = !DILocation(line: 345, column: 15, scope: !1000)
!1002 = !DILocation(line: 345, column: 20, scope: !1000)
!1003 = !DILocation(line: 345, column: 3, scope: !1000)
!1004 = !DILocation(line: 345, column: 26, scope: !1000)
!1005 = !DILocation(line: 345, column: 42, scope: !1000)
!1006 = !DILocation(line: 345, column: 44, scope: !1000)
!1007 = !DILocation(line: 346, column: 13, scope: !1000)
!1008 = !DILocation(line: 346, column: 17, scope: !1000)
!1009 = !DILocation(line: 346, column: 22, scope: !1000)
!1010 = !DILocation(line: 346, column: 3, scope: !1000)
!1011 = !DILocation(line: 347, column: 2, scope: !1000)
!1012 = !DILocation(line: 349, column: 6, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !914, file: !313, line: 349, column: 6)
!1014 = !DILocation(line: 349, column: 6, scope: !914)
!1015 = !DILocation(line: 350, column: 13, scope: !1013)
!1016 = !DILocation(line: 350, column: 17, scope: !1013)
!1017 = !DILocation(line: 350, column: 22, scope: !1013)
!1018 = !DILocation(line: 350, column: 31, scope: !1013)
!1019 = !DILocation(line: 350, column: 35, scope: !1013)
!1020 = !DILocation(line: 350, column: 40, scope: !1013)
!1021 = !DILocation(line: 350, column: 54, scope: !1013)
!1022 = !DILocation(line: 350, column: 3, scope: !1013)
!1023 = !DILocation(line: 351, column: 6, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !914, file: !313, line: 351, column: 6)
!1025 = !DILocation(line: 351, column: 6, scope: !914)
!1026 = !DILocation(line: 352, column: 13, scope: !1024)
!1027 = !DILocation(line: 352, column: 17, scope: !1024)
!1028 = !DILocation(line: 352, column: 22, scope: !1024)
!1029 = !DILocation(line: 352, column: 32, scope: !1024)
!1030 = !DILocation(line: 352, column: 36, scope: !1024)
!1031 = !DILocation(line: 352, column: 41, scope: !1024)
!1032 = !DILocation(line: 352, column: 56, scope: !1024)
!1033 = !DILocation(line: 352, column: 3, scope: !1024)
!1034 = !DILocation(line: 354, column: 7, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !914, file: !313, line: 354, column: 7)
!1036 = !DILocation(line: 354, column: 16, scope: !1035)
!1037 = !DILocation(line: 354, column: 7, scope: !914)
!1038 = !DILocation(line: 355, column: 20, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1035, file: !313, line: 354, column: 33)
!1040 = !DILocation(line: 355, column: 3, scope: !1039)
!1041 = !DILocation(line: 355, column: 7, scope: !1039)
!1042 = !DILocation(line: 355, column: 12, scope: !1039)
!1043 = !DILocation(line: 355, column: 18, scope: !1039)
!1044 = !DILocation(line: 357, column: 3, scope: !1039)
!1045 = !DILocation(line: 357, column: 7, scope: !1039)
!1046 = !DILocation(line: 357, column: 12, scope: !1039)
!1047 = !DILocation(line: 357, column: 18, scope: !1039)
!1048 = !DILocation(line: 359, column: 8, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1039, file: !313, line: 359, column: 8)
!1050 = !DILocation(line: 359, column: 17, scope: !1049)
!1051 = !DILocation(line: 359, column: 8, scope: !1039)
!1052 = !DILocation(line: 361, column: 44, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1049, file: !313, line: 360, column: 3)
!1054 = !DILocation(line: 361, column: 37, scope: !1053)
!1055 = !DILocation(line: 361, column: 49, scope: !1053)
!1056 = !DILocation(line: 361, column: 53, scope: !1053)
!1057 = !DILocation(line: 361, column: 47, scope: !1053)
!1058 = !DILocation(line: 361, column: 12, scope: !1053)
!1059 = !DILocation(line: 361, column: 10, scope: !1053)
!1060 = !DILocation(line: 362, column: 4, scope: !1053)
!1061 = !DILocation(line: 362, column: 11, scope: !1053)
!1062 = !DILocation(line: 362, column: 13, scope: !1053)
!1063 = !DILocation(line: 362, column: 24, scope: !1053)
!1064 = !DILocation(line: 363, column: 4, scope: !1053)
!1065 = !DILocation(line: 363, column: 11, scope: !1053)
!1066 = !DILocation(line: 363, column: 13, scope: !1053)
!1067 = !DILocation(line: 363, column: 18, scope: !1053)
!1068 = !DILocation(line: 363, column: 27, scope: !1053)
!1069 = !DILocation(line: 364, column: 35, scope: !1053)
!1070 = !DILocation(line: 364, column: 39, scope: !1053)
!1071 = !DILocation(line: 364, column: 55, scope: !1053)
!1072 = !DILocation(line: 364, column: 62, scope: !1053)
!1073 = !DILocation(line: 364, column: 64, scope: !1053)
!1074 = !DILocation(line: 364, column: 53, scope: !1053)
!1075 = !DILocation(line: 364, column: 24, scope: !1053)
!1076 = !DILocation(line: 364, column: 4, scope: !1053)
!1077 = !DILocation(line: 364, column: 8, scope: !1053)
!1078 = !DILocation(line: 364, column: 22, scope: !1053)
!1079 = !DILocation(line: 365, column: 13, scope: !1053)
!1080 = !DILocation(line: 365, column: 20, scope: !1053)
!1081 = !DILocation(line: 365, column: 22, scope: !1053)
!1082 = !DILocation(line: 365, column: 27, scope: !1053)
!1083 = !DILocation(line: 365, column: 4, scope: !1053)
!1084 = !DILocalVariable(name: "icmpinfo", scope: !1053, file: !313, line: 367, type: !194)
!1085 = !DILocation(line: 367, column: 22, scope: !1053)
!1086 = !DILocation(line: 367, column: 54, scope: !1053)
!1087 = !DILocation(line: 367, column: 61, scope: !1053)
!1088 = !DILocation(line: 367, column: 33, scope: !1053)
!1089 = !DILocation(line: 368, column: 21, scope: !1053)
!1090 = !DILocation(line: 368, column: 4, scope: !1053)
!1091 = !DILocation(line: 368, column: 14, scope: !1053)
!1092 = !DILocation(line: 368, column: 19, scope: !1053)
!1093 = !DILocation(line: 369, column: 4, scope: !1053)
!1094 = !DILocation(line: 369, column: 14, scope: !1053)
!1095 = !DILocation(line: 369, column: 22, scope: !1053)
!1096 = !DILocation(line: 370, column: 4, scope: !1053)
!1097 = !DILocation(line: 370, column: 14, scope: !1053)
!1098 = !DILocation(line: 370, column: 22, scope: !1053)
!1099 = !DILocation(line: 371, column: 4, scope: !1053)
!1100 = !DILocation(line: 371, column: 14, scope: !1053)
!1101 = !DILocation(line: 371, column: 23, scope: !1053)
!1102 = !DILocation(line: 372, column: 3, scope: !1053)
!1103 = !DILocation(line: 373, column: 2, scope: !1039)
!1104 = !DILocation(line: 376, column: 30, scope: !914)
!1105 = !DILocation(line: 376, column: 20, scope: !914)
!1106 = !DILocation(line: 376, column: 2, scope: !914)
!1107 = !DILocation(line: 376, column: 6, scope: !914)
!1108 = !DILocation(line: 376, column: 18, scope: !914)
!1109 = !DILocation(line: 377, column: 29, scope: !914)
!1110 = !DILocation(line: 377, column: 11, scope: !914)
!1111 = !DILocation(line: 377, column: 9, scope: !914)
!1112 = !DILocation(line: 378, column: 2, scope: !914)
!1113 = !DILocation(line: 378, column: 10, scope: !914)
!1114 = !DILocation(line: 378, column: 12, scope: !914)
!1115 = !DILocation(line: 378, column: 17, scope: !914)
!1116 = !DILocation(line: 378, column: 29, scope: !914)
!1117 = !DILocation(line: 379, column: 10, scope: !914)
!1118 = !DILocation(line: 379, column: 18, scope: !914)
!1119 = !DILocation(line: 379, column: 20, scope: !914)
!1120 = !DILocation(line: 379, column: 25, scope: !914)
!1121 = !DILocation(line: 379, column: 31, scope: !914)
!1122 = !DILocation(line: 379, column: 2, scope: !914)
!1123 = !DILocation(line: 381, column: 10, scope: !914)
!1124 = !DILocation(line: 381, column: 17, scope: !914)
!1125 = !DILocation(line: 381, column: 2, scope: !914)
!1126 = !DILocation(line: 384, column: 6, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !914, file: !313, line: 384, column: 6)
!1128 = !DILocation(line: 384, column: 10, scope: !1127)
!1129 = !DILocation(line: 384, column: 6, scope: !914)
!1130 = !DILocation(line: 385, column: 27, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1127, file: !313, line: 384, column: 16)
!1132 = !DILocation(line: 385, column: 31, scope: !1131)
!1133 = !DILocation(line: 385, column: 3, scope: !1131)
!1134 = !DILocalVariable(name: "matchmask", scope: !1131, file: !313, line: 385, type: !749)
!1135 = !DILocation(line: 385, column: 17, scope: !1131)
!1136 = !DILocation(line: 386, column: 27, scope: !1131)
!1137 = !DILocation(line: 386, column: 31, scope: !1131)
!1138 = !DILocation(line: 386, column: 3, scope: !1131)
!1139 = !DILocation(line: 387, column: 30, scope: !1131)
!1140 = !DILocation(line: 387, column: 37, scope: !1131)
!1141 = !DILocation(line: 387, column: 52, scope: !1131)
!1142 = !DILocation(line: 387, column: 9, scope: !1131)
!1143 = !DILocation(line: 387, column: 7, scope: !1131)
!1144 = !DILocation(line: 388, column: 2, scope: !1127)
!1145 = !DILocation(line: 388, column: 2, scope: !1131)
!1146 = !DILocation(line: 389, column: 11, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1127, file: !313, line: 389, column: 11)
!1148 = !DILocation(line: 389, column: 19, scope: !1147)
!1149 = !DILocation(line: 389, column: 11, scope: !1127)
!1150 = !DILocation(line: 390, column: 29, scope: !1147)
!1151 = !DILocation(line: 390, column: 36, scope: !1147)
!1152 = !DILocation(line: 390, column: 40, scope: !1147)
!1153 = !DILocation(line: 390, column: 9, scope: !1147)
!1154 = !DILocation(line: 390, column: 7, scope: !1147)
!1155 = !DILocation(line: 390, column: 3, scope: !1147)
!1156 = !DILocation(line: 392, column: 29, scope: !1147)
!1157 = !DILocation(line: 392, column: 36, scope: !1147)
!1158 = !DILocation(line: 392, column: 40, scope: !1147)
!1159 = !DILocation(line: 392, column: 49, scope: !1147)
!1160 = !DILocation(line: 392, column: 9, scope: !1147)
!1161 = !DILocation(line: 392, column: 7, scope: !1147)
!1162 = !DILocation(line: 394, column: 15, scope: !914)
!1163 = !DILocation(line: 394, column: 14, scope: !914)
!1164 = !DILocation(line: 394, column: 12, scope: !914)
!1165 = !DILocation(line: 396, column: 8, scope: !914)
!1166 = !DILocation(line: 396, column: 3, scope: !914)
!1167 = !DILocation(line: 396, column: 18, scope: !914)
!1168 = !DILocation(line: 398, column: 6, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !914, file: !313, line: 398, column: 6)
!1170 = !DILocation(line: 398, column: 10, scope: !1169)
!1171 = !DILocation(line: 398, column: 15, scope: !1169)
!1172 = !DILocation(line: 398, column: 20, scope: !1173)
!1173 = !DILexicalBlockFile(scope: !1169, file: !313, discriminator: 1)
!1174 = !DILocation(line: 398, column: 26, scope: !1173)
!1175 = !DILocation(line: 398, column: 29, scope: !1176)
!1176 = !DILexicalBlockFile(scope: !1169, file: !313, discriminator: 2)
!1177 = !DILocation(line: 398, column: 39, scope: !1176)
!1178 = !DILocation(line: 398, column: 6, scope: !1176)
!1179 = !DILocation(line: 400, column: 80, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1169, file: !313, line: 399, column: 2)
!1181 = !DILocation(line: 400, column: 87, scope: !1180)
!1182 = !DILocation(line: 400, column: 108, scope: !1180)
!1183 = !DILocation(line: 400, column: 92, scope: !1180)
!1184 = !DILocation(line: 400, column: 3, scope: !1185)
!1185 = !DILexicalBlockFile(scope: !1180, file: !313, discriminator: 1)
!1186 = !DILocation(line: 402, column: 10, scope: !1180)
!1187 = !DILocation(line: 402, column: 3, scope: !1180)
!1188 = !DILocation(line: 405, column: 2, scope: !914)
!1189 = !DILocation(line: 406, column: 1, scope: !914)
!1190 = distinct !DISubprogram(name: "ip6t_get_target", scope: !155, file: !155, line: 259, type: !1191, isLocal: true, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !321)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!537, !153}
!1193 = !DILocalVariable(name: "e", arg: 1, scope: !1190, file: !155, line: 259, type: !153)
!1194 = !DILocation(line: 259, column: 36, scope: !1190)
!1195 = !DILocation(line: 261, column: 17, scope: !1190)
!1196 = !DILocation(line: 261, column: 9, scope: !1190)
!1197 = !DILocation(line: 261, column: 21, scope: !1190)
!1198 = !DILocation(line: 261, column: 24, scope: !1190)
!1199 = !DILocation(line: 261, column: 19, scope: !1190)
!1200 = !DILocation(line: 261, column: 2, scope: !1190)
!1201 = distinct !DISubprogram(name: "load_xtables_module", scope: !313, file: !313, line: 444, type: !1202, isLocal: false, isDefinition: true, scopeLine: 449, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !321)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!428, !319, !319}
!1204 = !DILocalVariable(name: "module", arg: 1, scope: !1201, file: !313, line: 444, type: !319)
!1205 = !DILocation(line: 444, column: 33, scope: !1201)
!1206 = !DILocalVariable(name: "function", arg: 2, scope: !1201, file: !313, line: 448, type: !319)
!1207 = !DILocation(line: 448, column: 21, scope: !1201)
!1208 = !DILocalVariable(name: "act", scope: !1201, file: !313, line: 450, type: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !1210, line: 24, size: 1216, align: 64, elements: !1211)
!1210 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!1211 = !{!1212, !1291, !1298, !1299}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !1209, file: !1210, line: 35, baseType: !1213, size: 64, align: 64)
!1213 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1209, file: !1210, line: 28, size: 64, align: 64, elements: !1214)
!1214 = !{!1215, !1216}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !1213, file: !1210, line: 31, baseType: !200, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !1213, file: !1210, line: 33, baseType: !1217, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{null, !205, !1220, !226}
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !1222, line: 133, baseType: !1223)
!1222 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/siginfo.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1222, line: 62, size: 1024, align: 64, elements: !1224)
!1224 = !{!1225, !1226, !1227, !1228}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !1223, file: !1222, line: 64, baseType: !205, size: 32, align: 32)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !1223, file: !1222, line: 65, baseType: !205, size: 32, align: 32, offset: 32)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !1223, file: !1222, line: 67, baseType: !205, size: 32, align: 32, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !1223, file: !1222, line: 132, baseType: !1229, size: 896, align: 64, offset: 128)
!1229 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1223, file: !1222, line: 69, size: 896, align: 64, elements: !1230)
!1230 = !{!1231, !1235, !1242, !1253, !1259, !1269, !1280, !1285}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !1229, file: !1222, line: 71, baseType: !1232, size: 896, align: 32)
!1232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 896, align: 32, elements: !1233)
!1233 = !{!1234}
!1234 = !DISubrange(count: 28)
