; ModuleID = './[inter]keepalived--vrrp--vrrp_data.o.i'
source_filename = "./[inter]keepalived--vrrp--vrrp_data.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._vrrp_data = type { %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._data = type { i8*, i8, i8*, i8, i8*, i8*, %struct.sockaddr_storage, i8*, i64, %struct._list*, i32, i8, i8, i32, i8*, %struct._interface*, i32, i32, i32, i32, %struct.lvs_syncd_config, i8, %struct.sockaddr_in, %struct.sockaddr_in6, i32, %struct.timeval, i32, i32, i32, i32, i32, i32, i8, i8, i32, [29 x i8], [29 x i8], i8, [32 x i8], [32 x i8], [32 x i8], i8, i8, i8, i8, i8, i8, i32, i64, i8, i8, i8, i32, i64, %struct._notify_fifo, %struct._notify_fifo, %struct._notify_fifo, i32, i8, i32, i8, i32, i8, i32, i8, i8, i8, i32, i64, i32 }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }

!1 = !DIFile(filename: "[inter]keepalived--vrrp--vrrp_data.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!2 = !{!3, !11, !32, !44, !60, !67, !72}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chksum_compatibility", file: !4, line: 173, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./../include/vrrp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NONE", value: 0)
!7 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NEVER", value: 1)
!8 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_MIN_COMPAT", value: 2)
!9 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_CONFIG", value: 3)
!10 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_AUTO", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 41, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "../../lib/scheduler.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!14 = !DIEnumerator(name: "THREAD_READ", value: 0)
!15 = !DIEnumerator(name: "THREAD_WRITE", value: 1)
!16 = !DIEnumerator(name: "THREAD_TIMER", value: 2)
!17 = !DIEnumerator(name: "THREAD_TIMER_SHUTDOWN", value: 3)
!18 = !DIEnumerator(name: "THREAD_EVENT", value: 4)
!19 = !DIEnumerator(name: "THREAD_CHILD", value: 5)
!20 = !DIEnumerator(name: "THREAD_READY", value: 6)
!21 = !DIEnumerator(name: "THREAD_UNUSED", value: 7)
!22 = !DIEnumerator(name: "THREAD_WRITE_TIMEOUT", value: 8)
!23 = !DIEnumerator(name: "THREAD_READ_TIMEOUT", value: 9)
!24 = !DIEnumerator(name: "THREAD_CHILD_TIMEOUT", value: 10)
!25 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!26 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!27 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!28 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!29 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!30 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!31 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 119, size: 32, align: 32, elements: !34)
!33 = !DIFile(filename: "./../include/vrrp_track.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43}
!35 = !DIEnumerator(name: "TRACK_VRRP", value: 1)
!36 = !DIEnumerator(name: "TRACK_IF", value: 2)
!37 = !DIEnumerator(name: "TRACK_SG", value: 4)
!38 = !DIEnumerator(name: "TRACK_ADDR", value: 4)
!39 = !DIEnumerator(name: "TRACK_ROUTE", value: 8)
!40 = !DIEnumerator(name: "TRACK_RULE", value: 16)
!41 = !DIEnumerator(name: "TRACK_SADDR", value: 32)
!42 = !DIEnumerator(name: "TRACK_SROUTE", value: 64)
!43 = !DIEnumerator(name: "TRACK_SRULE", value: 128)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 44, size: 32, align: 32, elements: !46)
!45 = !DIFile(filename: "../../lib/parser.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59}
!47 = !DIEnumerator(name: "CONFIG_OK", value: 0)
!48 = !DIEnumerator(name: "CONFIG_FILE_NOT_FOUND", value: 1)
!49 = !DIEnumerator(name: "CONFIG_BAD_IF", value: 2)
!50 = !DIEnumerator(name: "CONFIG_FATAL", value: 3)
!51 = !DIEnumerator(name: "CONFIG_MULTIPLE_FILES", value: 4)
!52 = !DIEnumerator(name: "CONFIG_UNKNOWN_KEYWORD", value: 5)
!53 = !DIEnumerator(name: "CONFIG_UNEXPECTED_BOB", value: 6)
!54 = !DIEnumerator(name: "CONFIG_MISSING_BOB", value: 7)
!55 = !DIEnumerator(name: "CONFIG_UNMATCHED_QUOTE", value: 8)
!56 = !DIEnumerator(name: "CONFIG_MISSING_PARAMETER", value: 9)
!57 = !DIEnumerator(name: "CONFIG_INVALID_NUMBER", value: 10)
!58 = !DIEnumerator(name: "CONFIG_GENERAL_ERROR", value: 11)
!59 = !DIEnumerator(name: "CONFIG_SECURITY_ERROR", value: 12)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 45, size: 32, align: 32, elements: !62)
!61 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!62 = !{!63, !64, !65, !66}
!63 = !DIEnumerator(name: "SCRIPT_STATE_IDLE", value: 0)
!64 = !DIEnumerator(name: "SCRIPT_STATE_RUNNING", value: 1)
!65 = !DIEnumerator(name: "SCRIPT_STATE_REQUESTING_TERMINATION", value: 2)
!66 = !DIEnumerator(name: "SCRIPT_STATE_FORCING_TERMINATION", value: 3)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 52, size: 32, align: 32, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "SCRIPT_INIT_STATE_DONE", value: 0)
!70 = !DIEnumerator(name: "SCRIPT_INIT_STATE_INIT", value: 1)
!71 = !DIEnumerator(name: "SCRIPT_INIT_STATE_FAILED", value: 2)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vrrp_vmac_bits", file: !73, line: 40, size: 32, align: 32, elements: !74)
!73 = !DIFile(filename: "./../include/vrrp_vmac.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!74 = !{!75, !76, !77}
!75 = !DIEnumerator(name: "VRRP_VMAC_BIT", value: 0)
!76 = !DIEnumerator(name: "VRRP_VMAC_UP_BIT", value: 1)
!77 = !DIEnumerator(name: "VRRP_VMAC_XMITBASE_BIT", value: 2)
!78 = !{!79, !80, !529, !95, !98, !228, !537, !539, !540, !581, !600, !611, !627}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "tracking_vrrp_t", file: !33, line: 136, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tracking_vrrp", file: !33, line: 132, size: 192, align: 64, elements: !83)
!83 = !{!84, !86, !527}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !82, file: !33, line: 133, baseType: !85, size: 32, align: 32)
!85 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp", scope: !82, file: !33, line: 134, baseType: !87, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_t", file: !4, line: 183, size: 7040, align: 64, elements: !89)
!89 = !{!90, !94, !97, !227, !249, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !357, !358, !359, !360, !361, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !519, !526}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !88, file: !4, line: 184, baseType: !91, size: 16, align: 16)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !92, line: 28, baseType: !93)
!92 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!93 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !88, file: !4, line: 185, baseType: !95, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !88, file: !4, line: 186, baseType: !98, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_sgroup_t", file: !4, line: 133, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_sgroup", file: !4, line: 109, size: 1024, align: 64, elements: !101)
!101 = !{!102, !103, !114, !195, !196, !197, !198, !200, !201, !202, !203, !204, !205, !221, !222, !223, !224, !225, !226}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !100, file: !4, line: 110, baseType: !95, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !100, file: !4, line: 111, baseType: !104, size: 64, align: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !106, line: 34, baseType: !107)
!106 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !106, line: 30, size: 128, align: 64, elements: !108)
!108 = !{!109, !111, !112}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !107, file: !106, line: 31, baseType: !110, size: 32, align: 32)
!110 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !107, file: !106, line: 32, baseType: !110, size: 32, align: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !107, file: !106, line: 33, baseType: !113, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !100, file: !4, line: 112, baseType: !115, size: 64, align: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !116, line: 31, baseType: !117)
!116 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !116, line: 39, size: 320, align: 64, elements: !119)
!119 = !{!120, !127, !128, !129, !133}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !118, file: !116, line: 40, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !116, line: 33, size: 192, align: 64, elements: !123)
!123 = !{!124, !125, !126}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !122, file: !116, line: 34, baseType: !121, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !122, file: !116, line: 35, baseType: !121, size: 64, align: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !122, file: !116, line: 36, baseType: !79, size: 64, align: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !118, file: !116, line: 41, baseType: !121, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !118, file: !116, line: 42, baseType: !110, size: 32, align: 32, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !118, file: !116, line: 43, baseType: !130, size: 64, align: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !79}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !118, file: !116, line: 44, baseType: !134, size: 64, align: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !137, !79}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !139, line: 48, baseType: !140)
!139 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !141, line: 241, size: 1728, align: 64, elements: !142)
!141 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!142 = !{!143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !163, !164, !165, !166, !170, !171, !173, !177, !180, !182, !183, !184, !185, !186, !190, !191}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !140, file: !141, line: 242, baseType: !85, size: 32, align: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !140, file: !141, line: 247, baseType: !95, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !140, file: !141, line: 248, baseType: !95, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !140, file: !141, line: 249, baseType: !95, size: 64, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !140, file: !141, line: 250, baseType: !95, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !140, file: !141, line: 251, baseType: !95, size: 64, align: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !140, file: !141, line: 252, baseType: !95, size: 64, align: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !140, file: !141, line: 253, baseType: !95, size: 64, align: 64, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !140, file: !141, line: 254, baseType: !95, size: 64, align: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !140, file: !141, line: 256, baseType: !95, size: 64, align: 64, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !140, file: !141, line: 257, baseType: !95, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !140, file: !141, line: 258, baseType: !95, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !140, file: !141, line: 260, baseType: !156, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !141, line: 156, size: 192, align: 64, elements: !158)
!158 = !{!159, !160, !162}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !157, file: !141, line: 157, baseType: !156, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !157, file: !141, line: 158, baseType: !161, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !157, file: !141, line: 162, baseType: !85, size: 32, align: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !140, file: !141, line: 262, baseType: !161, size: 64, align: 64, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !140, file: !141, line: 264, baseType: !85, size: 32, align: 32, offset: 896)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !140, file: !141, line: 268, baseType: !85, size: 32, align: 32, offset: 928)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !140, file: !141, line: 270, baseType: !167, size: 64, align: 64, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !168, line: 131, baseType: !169)
!168 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!169 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !140, file: !141, line: 274, baseType: !93, size: 16, align: 16, offset: 1024)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !140, file: !141, line: 275, baseType: !172, size: 8, align: 8, offset: 1040)
!172 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !140, file: !141, line: 276, baseType: !174, size: 8, align: 8, offset: 1048)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 8, align: 8, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 1)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !140, file: !141, line: 280, baseType: !178, size: 64, align: 64, offset: 1088)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !141, line: 150, baseType: null)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !140, file: !141, line: 289, baseType: !181, size: 64, align: 64, offset: 1152)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !168, line: 132, baseType: !169)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !140, file: !141, line: 297, baseType: !79, size: 64, align: 64, offset: 1216)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !140, file: !141, line: 298, baseType: !79, size: 64, align: 64, offset: 1280)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !140, file: !141, line: 299, baseType: !79, size: 64, align: 64, offset: 1344)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !140, file: !141, line: 300, baseType: !79, size: 64, align: 64, offset: 1408)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !140, file: !141, line: 302, baseType: !187, size: 64, align: 64, offset: 1472)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !188, line: 216, baseType: !189)
!188 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!189 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !140, file: !141, line: 303, baseType: !85, size: 32, align: 32, offset: 1536)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !140, file: !141, line: 305, baseType: !192, size: 160, align: 8, offset: 1568)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 160, align: 8, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 20)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_fault", scope: !100, file: !4, line: 113, baseType: !110, size: 32, align: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_init", scope: !100, file: !4, line: 114, baseType: !110, size: 32, align: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !100, file: !4, line: 115, baseType: !85, size: 32, align: 32, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sgroup_tracking_weight", scope: !100, file: !4, line: 116, baseType: !199, size: 8, align: 8, offset: 288)
!199 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !100, file: !4, line: 119, baseType: !115, size: 64, align: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !100, file: !4, line: 120, baseType: !115, size: 64, align: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !100, file: !4, line: 121, baseType: !115, size: 64, align: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "track_bfd", scope: !100, file: !4, line: 122, baseType: !115, size: 64, align: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !100, file: !4, line: 125, baseType: !199, size: 8, align: 8, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !100, file: !4, line: 126, baseType: !206, size: 64, align: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !61, line: 65, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !61, line: 59, size: 192, align: 64, elements: !209)
!209 = !{!210, !212, !213, !214, !218}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !208, file: !61, line: 60, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !208, file: !61, line: 61, baseType: !85, size: 32, align: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !208, file: !61, line: 62, baseType: !85, size: 32, align: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !208, file: !61, line: 63, baseType: !215, size: 32, align: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !216, line: 240, baseType: !217)
!216 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !168, line: 125, baseType: !110)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !208, file: !61, line: 64, baseType: !219, size: 32, align: 32, offset: 160)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !216, line: 235, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !168, line: 126, baseType: !110)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !100, file: !4, line: 127, baseType: !206, size: 64, align: 64, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !100, file: !4, line: 128, baseType: !206, size: 64, align: 64, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !100, file: !4, line: 129, baseType: !206, size: 64, align: 64, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !100, file: !4, line: 130, baseType: !206, size: 64, align: 64, offset: 896)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !100, file: !4, line: 131, baseType: !85, size: 32, align: 32, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !100, file: !4, line: 132, baseType: !85, size: 32, align: 32, offset: 992)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !88, file: !4, line: 187, baseType: !228, size: 64, align: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_stats", file: !4, line: 169, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_stats", file: !4, line: 136, size: 768, align: 64, elements: !231)
!231 = !{!232, !235, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "advert_rcvd", scope: !230, file: !4, line: 137, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !234, line: 55, baseType: !189)
!234 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!235 = !DIDerivedType(tag: DW_TAG_member, name: "advert_sent", scope: !230, file: !4, line: 138, baseType: !236, size: 32, align: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !234, line: 51, baseType: !110)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "become_master", scope: !230, file: !4, line: 140, baseType: !236, size: 32, align: 32, offset: 96)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "release_master", scope: !230, file: !4, line: 141, baseType: !236, size: 32, align: 32, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "packet_len_err", scope: !230, file: !4, line: 143, baseType: !233, size: 64, align: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "advert_interval_err", scope: !230, file: !4, line: 144, baseType: !233, size: 64, align: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl_err", scope: !230, file: !4, line: 145, baseType: !233, size: 64, align: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_type_rcvd", scope: !230, file: !4, line: 146, baseType: !233, size: 64, align: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list_err", scope: !230, file: !4, line: 147, baseType: !233, size: 64, align: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_authtype", scope: !230, file: !4, line: 149, baseType: !236, size: 32, align: 32, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "authtype_mismatch", scope: !230, file: !4, line: 151, baseType: !236, size: 32, align: 32, offset: 544)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "auth_failure", scope: !230, file: !4, line: 152, baseType: !236, size: 32, align: 32, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_rcvd", scope: !230, file: !4, line: 155, baseType: !233, size: 64, align: 64, offset: 640)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_sent", scope: !230, file: !4, line: 156, baseType: !233, size: 64, align: 64, offset: 704)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !88, file: !4, line: 188, baseType: !250, size: 64, align: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !252, line: 111, baseType: !253)
!252 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !252, line: 76, size: 1792, align: 64, elements: !254)
!254 = !{!255, !259, !261, !267, !286, !287, !288, !289, !290, !297, !298, !299, !300, !301, !302, !304, !305, !306, !307, !328, !329, !330, !331, !332, !333, !334, !335}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !253, file: !252, line: 77, baseType: !256, size: 128, align: 8)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, align: 8, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 16)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !253, file: !252, line: 78, baseType: !260, size: 32, align: 32, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !252, line: 62, baseType: !236)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !253, file: !252, line: 79, baseType: !262, size: 32, align: 32, offset: 160)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !263, line: 31, size: 32, align: 32, elements: !264)
!263 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !262, file: !263, line: 33, baseType: !266, size: 32, align: 32)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !263, line: 30, baseType: !236)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !253, file: !252, line: 80, baseType: !268, size: 128, align: 32, offset: 192)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !263, line: 211, size: 128, align: 32, elements: !269)
!269 = !{!270}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !268, file: !263, line: 220, baseType: !271, size: 128, align: 32)
!271 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !268, file: !263, line: 213, size: 128, align: 32, elements: !272)
!272 = !{!273, !277, !282}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !271, file: !263, line: 215, baseType: !274, size: 128, align: 8)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 128, align: 8, elements: !257)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !234, line: 48, baseType: !276)
!276 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !271, file: !263, line: 217, baseType: !278, size: 128, align: 16)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 128, align: 16, elements: !280)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !234, line: 49, baseType: !93)
!280 = !{!281}
!281 = !DISubrange(count: 8)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !271, file: !263, line: 218, baseType: !283, size: 128, align: 32)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 128, align: 32, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 4)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !253, file: !252, line: 81, baseType: !110, size: 32, align: 32, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !253, file: !252, line: 82, baseType: !199, size: 8, align: 8, offset: 352)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !253, file: !252, line: 83, baseType: !236, size: 32, align: 32, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !253, file: !252, line: 84, baseType: !93, size: 16, align: 16, offset: 416)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !253, file: !252, line: 85, baseType: !291, size: 256, align: 8, offset: 432)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 256, align: 8, elements: !295)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !293, line: 33, baseType: !294)
!293 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !168, line: 30, baseType: !276)
!295 = !{!296}
!296 = !DISubrange(count: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !253, file: !252, line: 86, baseType: !291, size: 256, align: 8, offset: 688)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !253, file: !252, line: 87, baseType: !187, size: 64, align: 64, offset: 960)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !253, file: !252, line: 88, baseType: !85, size: 32, align: 32, offset: 1024)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !253, file: !252, line: 90, baseType: !199, size: 8, align: 8, offset: 1056)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !253, file: !252, line: 91, baseType: !260, size: 32, align: 32, offset: 1088)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !253, file: !252, line: 92, baseType: !303, size: 64, align: 64, offset: 1152)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !253, file: !252, line: 94, baseType: !260, size: 32, align: 32, offset: 1216)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !253, file: !252, line: 96, baseType: !303, size: 64, align: 64, offset: 1280)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !253, file: !252, line: 97, baseType: !199, size: 8, align: 8, offset: 1344)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !253, file: !252, line: 100, baseType: !308, size: 64, align: 64, offset: 1408)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !252, line: 73, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !252, line: 65, size: 704, align: 64, elements: !311)
!311 = !{!312, !322, !323, !324, !325, !326, !327}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !310, file: !252, line: 66, baseType: !313, size: 128, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !314, line: 31, baseType: !315)
!314 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !316, line: 30, size: 128, align: 64, elements: !317)
!316 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!317 = !{!318, !320}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !315, file: !316, line: 32, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !168, line: 139, baseType: !169)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !315, file: !316, line: 33, baseType: !321, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !168, line: 141, baseType: !169)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !310, file: !252, line: 67, baseType: !199, size: 8, align: 8, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !310, file: !252, line: 68, baseType: !313, size: 128, align: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !310, file: !252, line: 69, baseType: !199, size: 8, align: 8, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !310, file: !252, line: 70, baseType: !313, size: 128, align: 64, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !310, file: !252, line: 71, baseType: !313, size: 128, align: 64, offset: 512)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !310, file: !252, line: 72, baseType: !85, size: 32, align: 32, offset: 640)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !253, file: !252, line: 101, baseType: !199, size: 8, align: 8, offset: 1472)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !253, file: !252, line: 102, baseType: !85, size: 32, align: 32, offset: 1504)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !253, file: !252, line: 103, baseType: !236, size: 32, align: 32, offset: 1536)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !253, file: !252, line: 104, baseType: !236, size: 32, align: 32, offset: 1568)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !253, file: !252, line: 105, baseType: !236, size: 32, align: 32, offset: 1600)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !253, file: !252, line: 107, baseType: !110, size: 32, align: 32, offset: 1632)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !253, file: !252, line: 109, baseType: !199, size: 8, align: 8, offset: 1664)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !253, file: !252, line: 110, baseType: !115, size: 64, align: 64, offset: 1728)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track_primary", scope: !88, file: !4, line: 189, baseType: !199, size: 8, align: 8, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !88, file: !4, line: 190, baseType: !199, size: 8, align: 8, offset: 328)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "skip_check_adv_addr", scope: !88, file: !4, line: 191, baseType: !199, size: 8, align: 8, offset: 336)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "strict_mode", scope: !88, file: !4, line: 193, baseType: !110, size: 32, align: 32, offset: 352)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_flags", scope: !88, file: !4, line: 195, baseType: !189, size: 64, align: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_ifname", scope: !88, file: !4, line: 196, baseType: !256, size: 128, align: 8, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !88, file: !4, line: 198, baseType: !115, size: 64, align: 64, offset: 576)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !88, file: !4, line: 199, baseType: !115, size: 64, align: 64, offset: 640)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !88, file: !4, line: 200, baseType: !115, size: 64, align: 64, offset: 704)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_if_fault", scope: !88, file: !4, line: 204, baseType: !110, size: 32, align: 32, offset: 768)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_init", scope: !88, file: !4, line: 205, baseType: !110, size: 32, align: 32, offset: 800)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !88, file: !4, line: 206, baseType: !348, size: 1024, align: 64, offset: 832)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !349, line: 166, size: 1024, align: 64, elements: !350)
!349 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!350 = !{!351, !352, !356}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !348, file: !349, line: 168, baseType: !91, size: 16, align: 16)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !348, file: !349, line: 169, baseType: !353, size: 944, align: 8, offset: 16)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 944, align: 8, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 118)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !348, file: !349, line: 170, baseType: !189, size: 64, align: 64, offset: 960)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "saddr_from_config", scope: !88, file: !4, line: 207, baseType: !199, size: 8, align: 8, offset: 1856)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "track_saddr", scope: !88, file: !4, line: 208, baseType: !199, size: 8, align: 8, offset: 1864)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_saddr", scope: !88, file: !4, line: 209, baseType: !348, size: 1024, align: 64, offset: 1920)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_peer", scope: !88, file: !4, line: 210, baseType: !115, size: 64, align: 64, offset: 2944)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_chksum_compat", scope: !88, file: !4, line: 212, baseType: !362, size: 32, align: 32, offset: 3008)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "chksum_compatibility_t", file: !4, line: 179, baseType: !3)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "master_saddr", scope: !88, file: !4, line: 214, baseType: !348, size: 1024, align: 64, offset: 3072)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "master_priority", scope: !88, file: !4, line: 215, baseType: !275, size: 8, align: 8, offset: 4096)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "last_transition", scope: !88, file: !4, line: 216, baseType: !313, size: 128, align: 64, offset: 4160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !88, file: !4, line: 217, baseType: !110, size: 32, align: 32, offset: 4288)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh", scope: !88, file: !4, line: 218, baseType: !313, size: 128, align: 64, offset: 4352)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_timer", scope: !88, file: !4, line: 219, baseType: !313, size: 128, align: 64, offset: 4480)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "garp_rep", scope: !88, file: !4, line: 220, baseType: !110, size: 32, align: 32, offset: 4608)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_rep", scope: !88, file: !4, line: 221, baseType: !110, size: 32, align: 32, offset: 4640)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_delay", scope: !88, file: !4, line: 222, baseType: !110, size: 32, align: 32, offset: 4672)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "garp_pending", scope: !88, file: !4, line: 223, baseType: !199, size: 8, align: 8, offset: 4704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "gna_pending", scope: !88, file: !4, line: 224, baseType: !199, size: 8, align: 8, offset: 4712)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_rep", scope: !88, file: !4, line: 225, baseType: !110, size: 32, align: 32, offset: 4736)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "lower_prio_no_advert", scope: !88, file: !4, line: 226, baseType: !110, size: 32, align: 32, offset: 4768)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "higher_prio_send_advert", scope: !88, file: !4, line: 227, baseType: !110, size: 32, align: 32, offset: 4800)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "vrid", scope: !88, file: !4, line: 228, baseType: !275, size: 8, align: 8, offset: 4832)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "base_priority", scope: !88, file: !4, line: 229, baseType: !275, size: 8, align: 8, offset: 4840)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "effective_priority", scope: !88, file: !4, line: 230, baseType: !275, size: 8, align: 8, offset: 4848)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "total_priority", scope: !88, file: !4, line: 231, baseType: !85, size: 32, align: 32, offset: 4864)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "vipset", scope: !88, file: !4, line: 233, baseType: !199, size: 8, align: 8, offset: 4896)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !88, file: !4, line: 234, baseType: !115, size: 64, align: 64, offset: 4928)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "evip", scope: !88, file: !4, line: 235, baseType: !115, size: 64, align: 64, offset: 4992)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries", scope: !88, file: !4, line: 239, baseType: !199, size: 8, align: 8, offset: 5056)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "evip_add_ipv6", scope: !88, file: !4, line: 240, baseType: !199, size: 8, align: 8, offset: 5064)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "vroutes", scope: !88, file: !4, line: 241, baseType: !115, size: 64, align: 64, offset: 5120)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "vrules", scope: !88, file: !4, line: 242, baseType: !115, size: 64, align: 64, offset: 5184)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "adver_int", scope: !88, file: !4, line: 243, baseType: !110, size: 32, align: 32, offset: 5248)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "master_adver_int", scope: !88, file: !4, line: 244, baseType: !110, size: 32, align: 32, offset: 5280)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !88, file: !4, line: 249, baseType: !110, size: 32, align: 32, offset: 5312)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_rx_buf_size", scope: !88, file: !4, line: 252, baseType: !187, size: 64, align: 64, offset: 5376)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rules_set", scope: !88, file: !4, line: 254, baseType: !199, size: 8, align: 8, offset: 5440)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "nopreempt", scope: !88, file: !4, line: 255, baseType: !199, size: 8, align: 8, offset: 5448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_delay", scope: !88, file: !4, line: 256, baseType: !189, size: 64, align: 64, offset: 5504)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_time", scope: !88, file: !4, line: 260, baseType: !313, size: 128, align: 64, offset: 5568)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !88, file: !4, line: 261, baseType: !85, size: 32, align: 32, offset: 5696)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "wantstate", scope: !88, file: !4, line: 265, baseType: !85, size: 32, align: 32, offset: 5728)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "reload_master", scope: !88, file: !4, line: 266, baseType: !199, size: 8, align: 8, offset: 5760)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sockets", scope: !88, file: !4, line: 267, baseType: !400, size: 64, align: 64, offset: 5824)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_t", file: !402, line: 50, baseType: !403)
!402 = !DIFile(filename: "./../include/vrrp_sock.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sock", file: !402, line: 40, size: 1344, align: 64, elements: !404)
!404 = !{!405, !406, !407, !408, !409, !410, !411, !412, !413}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !403, file: !402, line: 41, baseType: !91, size: 16, align: 16)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !403, file: !402, line: 42, baseType: !348, size: 1024, align: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !403, file: !402, line: 43, baseType: !85, size: 32, align: 32, offset: 1088)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !403, file: !402, line: 44, baseType: !260, size: 32, align: 32, offset: 1120)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "unicast", scope: !403, file: !402, line: 45, baseType: !199, size: 8, align: 8, offset: 1152)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "fd_in", scope: !403, file: !402, line: 46, baseType: !85, size: 32, align: 32, offset: 1184)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "fd_out", scope: !403, file: !402, line: 47, baseType: !85, size: 32, align: 32, offset: 1216)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_size", scope: !403, file: !402, line: 48, baseType: !85, size: 32, align: 32, offset: 1248)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !403, file: !402, line: 49, baseType: !414, size: 64, align: 64, offset: 1280)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !12, line: 99, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !12, line: 78, size: 768, align: 64, elements: !417)
!417 = !{!418, !419, !421, !474, !479, !480, !481, !493, !495}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !416, file: !12, line: 79, baseType: !189, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !416, file: !12, line: 80, baseType: !420, size: 32, align: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !12, line: 63, baseType: !11)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !416, file: !12, line: 81, baseType: !422, size: 64, align: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !12, line: 112, size: 1280, align: 64, elements: !424)
!424 = !{!425, !437, !438, !439, !440, !448, !449, !450, !451, !452, !455, !466, !467, !468, !469, !470, !471, !472, !473}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !423, file: !12, line: 113, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !427, line: 109, baseType: !428)
!427 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !427, line: 106, size: 64, align: 64, elements: !429)
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !428, file: !427, line: 108, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !427, line: 97, size: 192, align: 64, elements: !433)
!433 = !{!434, !435, !436}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !432, file: !427, line: 99, baseType: !189, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !432, file: !427, line: 102, baseType: !431, size: 64, align: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !432, file: !427, line: 103, baseType: !431, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !423, file: !12, line: 114, baseType: !426, size: 64, align: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !423, file: !12, line: 115, baseType: !426, size: 64, align: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !423, file: !12, line: 116, baseType: !426, size: 64, align: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !423, file: !12, line: 117, baseType: !441, size: 128, align: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !442, line: 62, baseType: !443)
!442 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !442, line: 60, size: 128, align: 64, elements: !444)
!444 = !{!445, !447}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !443, file: !442, line: 61, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !443, file: !442, line: 61, baseType: !446, size: 64, align: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !423, file: !12, line: 121, baseType: !441, size: 128, align: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !423, file: !12, line: 122, baseType: !441, size: 128, align: 64, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !423, file: !12, line: 124, baseType: !115, size: 64, align: 64, offset: 640)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !423, file: !12, line: 127, baseType: !426, size: 64, align: 64, offset: 704)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !423, file: !12, line: 128, baseType: !453, size: 64, align: 64, offset: 768)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !12, line: 128, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !423, file: !12, line: 129, baseType: !456, size: 64, align: 64, offset: 832)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !12, line: 109, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !12, line: 102, size: 448, align: 64, elements: !459)
!459 = !{!460, !461, !462, !463, !464}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !458, file: !12, line: 103, baseType: !414, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !458, file: !12, line: 104, baseType: !414, size: 64, align: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !458, file: !12, line: 105, baseType: !189, size: 64, align: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !458, file: !12, line: 106, baseType: !85, size: 32, align: 32, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !458, file: !12, line: 108, baseType: !465, size: 192, align: 64, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !427, line: 104, baseType: !432)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !423, file: !12, line: 130, baseType: !110, size: 32, align: 32, offset: 896)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !423, file: !12, line: 131, baseType: !110, size: 32, align: 32, offset: 928)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !423, file: !12, line: 132, baseType: !85, size: 32, align: 32, offset: 960)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !423, file: !12, line: 135, baseType: !85, size: 32, align: 32, offset: 992)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !423, file: !12, line: 136, baseType: !414, size: 64, align: 64, offset: 1024)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !423, file: !12, line: 146, baseType: !189, size: 64, align: 64, offset: 1088)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !423, file: !12, line: 147, baseType: !189, size: 64, align: 64, offset: 1152)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !423, file: !12, line: 148, baseType: !199, size: 8, align: 8, offset: 1216)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !416, file: !12, line: 82, baseType: !475, size: 64, align: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!85, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !416, file: !12, line: 83, baseType: !79, size: 64, align: 64, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !416, file: !12, line: 84, baseType: !313, size: 128, align: 64, offset: 320)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !416, file: !12, line: 92, baseType: !482, size: 64, align: 32, offset: 448)
!482 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !416, file: !12, line: 85, size: 64, align: 32, elements: !483)
!483 = !{!484, !485, !486}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !482, file: !12, line: 86, baseType: !85, size: 32, align: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !482, file: !12, line: 87, baseType: !85, size: 32, align: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !482, file: !12, line: 91, baseType: !487, size: 64, align: 32)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !12, line: 88, size: 64, align: 32, elements: !488)
!488 = !{!489, !492}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !487, file: !12, line: 89, baseType: !490, size: 32, align: 32)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !216, line: 263, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !168, line: 133, baseType: !85)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !487, file: !12, line: 90, baseType: !85, size: 32, align: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !416, file: !12, line: 93, baseType: !494, size: 64, align: 64, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, scope: !416, file: !12, line: 95, baseType: !496, size: 192, align: 64, offset: 576)
!496 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !416, file: !12, line: 95, size: 192, align: 64, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !496, file: !12, line: 96, baseType: !465, size: 192, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !12, line: 97, baseType: !441, size: 128, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !88, file: !4, line: 269, baseType: !85, size: 32, align: 32, offset: 5888)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !88, file: !4, line: 271, baseType: !85, size: 32, align: 32, offset: 5920)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !88, file: !4, line: 274, baseType: !85, size: 32, align: 32, offset: 5952)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !88, file: !4, line: 275, baseType: !85, size: 32, align: 32, offset: 5984)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !88, file: !4, line: 276, baseType: !199, size: 8, align: 8, offset: 6016)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !88, file: !4, line: 277, baseType: !206, size: 64, align: 64, offset: 6080)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !88, file: !4, line: 278, baseType: !206, size: 64, align: 64, offset: 6144)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !88, file: !4, line: 279, baseType: !206, size: 64, align: 64, offset: 6208)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !88, file: !4, line: 280, baseType: !206, size: 64, align: 64, offset: 6272)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "script_master_rx_lower_pri", scope: !88, file: !4, line: 281, baseType: !206, size: 64, align: 64, offset: 6336)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !88, file: !4, line: 282, baseType: !206, size: 64, align: 64, offset: 6400)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ms_down_timer", scope: !88, file: !4, line: 285, baseType: !236, size: 32, align: 32, offset: 6464)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !88, file: !4, line: 286, baseType: !313, size: 128, align: 64, offset: 6528)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !88, file: !4, line: 289, baseType: !95, size: 64, align: 64, offset: 6656)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer_size", scope: !88, file: !4, line: 290, baseType: !187, size: 64, align: 64, offset: 6720)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_csum", scope: !88, file: !4, line: 291, baseType: !236, size: 32, align: 32, offset: 6784)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "auth_type", scope: !88, file: !4, line: 295, baseType: !275, size: 8, align: 8, offset: 6816)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "auth_data", scope: !88, file: !4, line: 296, baseType: !518, size: 64, align: 8, offset: 6824)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 64, align: 8, elements: !280)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ipsecah_counter", scope: !88, file: !4, line: 299, baseType: !520, size: 64, align: 32, offset: 6912)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_counter_t", file: !521, line: 58, baseType: !522)
!521 = !DIFile(filename: "./../include/vrrp_ipsecah.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seq_counter", file: !521, line: 55, size: 64, align: 32, elements: !523)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !522, file: !521, line: 56, baseType: !199, size: 8, align: 8)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "seq_number", scope: !522, file: !521, line: 57, baseType: !236, size: 32, align: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !88, file: !4, line: 309, baseType: !85, size: 32, align: 32, offset: 6976)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !33, line: 135, baseType: !528, size: 32, align: 32, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "track_t", file: !33, line: 129, baseType: !32)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "static_track_group_t", file: !531, line: 39, baseType: !532)
!531 = !DIFile(filename: "./../include/vrrp_static_track.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_track_group", file: !531, line: 35, size: 192, align: 64, elements: !533)
!533 = !{!534, !535, !536}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !532, file: !531, line: 36, baseType: !95, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !532, file: !531, line: 37, baseType: !104, size: 64, align: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !532, file: !531, line: 38, baseType: !115, size: 64, align: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_t", file: !4, line: 310, baseType: !88)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_address_t", file: !542, line: 73, baseType: !543)
!542 = !DIFile(filename: "./../include/vrrp_ipaddress.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_address", file: !542, line: 41, size: 704, align: 64, elements: !544)
!544 = !{!545, !557, !566, !567, !568, !569, !570, !571, !576, !577, !578, !579, !580}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ifa", scope: !543, file: !542, line: 42, baseType: !546, size: 64, align: 32)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifaddrmsg", file: !547, line: 7, size: 64, align: 32, elements: !548)
!547 = !DIFile(filename: "/usr/include/linux/if_addr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!548 = !{!549, !552, !553, !554, !555}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_family", scope: !546, file: !547, line: 8, baseType: !550, size: 8, align: 8)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !551, line: 20, baseType: !276)
!551 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_prefixlen", scope: !546, file: !547, line: 9, baseType: !550, size: 8, align: 8, offset: 8)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_flags", scope: !546, file: !547, line: 10, baseType: !550, size: 8, align: 8, offset: 16)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_scope", scope: !546, file: !547, line: 11, baseType: !550, size: 8, align: 8, offset: 24)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_index", scope: !546, file: !547, line: 12, baseType: !556, size: 32, align: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !551, line: 26, baseType: !110)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !543, file: !542, line: 50, baseType: !558, size: 128, align: 32, offset: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !543, file: !542, line: 44, size: 128, align: 32, elements: !559)
!559 = !{!560, !565}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !558, file: !542, line: 48, baseType: !561, size: 64, align: 32)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !558, file: !542, line: 45, size: 64, align: 32, elements: !562)
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !561, file: !542, line: 46, baseType: !262, size: 32, align: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "sin_brd", scope: !561, file: !542, line: 47, baseType: !262, size: 32, align: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !558, file: !542, line: 49, baseType: !268, size: 128, align: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !543, file: !542, line: 52, baseType: !250, size: 64, align: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !543, file: !542, line: 53, baseType: !95, size: 64, align: 64, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !543, file: !542, line: 55, baseType: !236, size: 32, align: 32, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "flagmask", scope: !543, file: !542, line: 56, baseType: !236, size: 32, align: 32, offset: 352)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "have_peer", scope: !543, file: !542, line: 61, baseType: !199, size: 8, align: 8, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !543, file: !542, line: 65, baseType: !572, size: 128, align: 32, offset: 416)
!572 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !543, file: !542, line: 62, size: 128, align: 32, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !572, file: !542, line: 63, baseType: !262, size: 32, align: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !572, file: !542, line: 64, baseType: !268, size: 128, align: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track", scope: !543, file: !542, line: 66, baseType: !199, size: 8, align: 8, offset: 544)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "track_group", scope: !543, file: !542, line: 67, baseType: !529, size: 64, align: 64, offset: 576)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !543, file: !542, line: 69, baseType: !199, size: 8, align: 8, offset: 640)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rule_set", scope: !543, file: !542, line: 70, baseType: !199, size: 8, align: 8, offset: 648)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "garp_gna_pending", scope: !543, file: !542, line: 72, baseType: !199, size: 8, align: 8, offset: 656)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_script_t", file: !33, line: 74, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_script", file: !33, line: 60, size: 704, align: 64, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !597, !599}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !583, file: !33, line: 61, baseType: !95, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !583, file: !33, line: 62, baseType: !207, size: 192, align: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !583, file: !33, line: 63, baseType: !189, size: 64, align: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !583, file: !33, line: 64, baseType: !189, size: 64, align: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !583, file: !33, line: 65, baseType: !85, size: 32, align: 32, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !583, file: !33, line: 66, baseType: !85, size: 32, align: 32, offset: 416)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "rise", scope: !583, file: !33, line: 67, baseType: !85, size: 32, align: 32, offset: 448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "fall", scope: !583, file: !33, line: 68, baseType: !85, size: 32, align: 32, offset: 480)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !583, file: !33, line: 69, baseType: !115, size: 64, align: 64, offset: 512)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "last_status", scope: !583, file: !33, line: 70, baseType: !85, size: 32, align: 32, offset: 576)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !583, file: !33, line: 71, baseType: !596, size: 32, align: 32, offset: 608)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "script_state_t", file: !61, line: 50, baseType: !60)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !583, file: !33, line: 72, baseType: !598, size: 32, align: 32, offset: 640)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "script_init_state_t", file: !61, line: 56, baseType: !67)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "insecure", scope: !583, file: !33, line: 73, baseType: !199, size: 8, align: 8, offset: 672)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_tracked_file_t", file: !33, line: 91, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_file", file: !33, line: 83, size: 384, align: 64, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !602, file: !33, line: 84, baseType: !95, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "file_path", scope: !602, file: !33, line: 85, baseType: !95, size: 64, align: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "file_part", scope: !602, file: !33, line: 86, baseType: !95, size: 64, align: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !602, file: !33, line: 87, baseType: !85, size: 32, align: 32, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !602, file: !33, line: 88, baseType: !85, size: 32, align: 32, offset: 224)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !602, file: !33, line: 89, baseType: !115, size: 64, align: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "last_status", scope: !602, file: !33, line: 90, baseType: !85, size: 32, align: 32, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_data_t", file: !613, line: 52, baseType: !614)
!613 = !DIFile(filename: "./../include/vrrp_data.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_data", file: !613, line: 35, size: 704, align: 64, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "static_track_groups", scope: !614, file: !613, line: 36, baseType: !115, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "static_addresses", scope: !614, file: !613, line: 37, baseType: !115, size: 64, align: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "static_routes", scope: !614, file: !613, line: 39, baseType: !115, size: 64, align: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "static_rules", scope: !614, file: !613, line: 40, baseType: !115, size: 64, align: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_sync_group", scope: !614, file: !613, line: 42, baseType: !115, size: 64, align: 64, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp", scope: !614, file: !613, line: 43, baseType: !115, size: 64, align: 64, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_index", scope: !614, file: !613, line: 44, baseType: !115, size: 64, align: 64, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_index_fd", scope: !614, file: !613, line: 45, baseType: !115, size: 64, align: 64, offset: 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_socket_pool", scope: !614, file: !613, line: 46, baseType: !115, size: 64, align: 64, offset: 512)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_script", scope: !614, file: !613, line: 47, baseType: !115, size: 64, align: 64, offset: 576)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_track_files", scope: !614, file: !613, line: 48, baseType: !115, size: 64, align: 64, offset: 640)
!627 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!628 = !{!629, !631, !632, !633, !634}
!629 = distinct !DIGlobalVariable(name: "vrrp_data", scope: !0, file: !630, line: 54, type: !611, isLocal: false, isDefinition: true, variable: %struct._vrrp_data** @vrrp_data)
!630 = !DIFile(filename: "vrrp_data.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!631 = distinct !DIGlobalVariable(name: "old_vrrp_data", scope: !0, file: !630, line: 55, type: !611, isLocal: false, isDefinition: true, variable: %struct._vrrp_data** @old_vrrp_data)
!632 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !252, line: 150, type: !115, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!633 = distinct !DIGlobalVariable(name: "vrrp_buffer", scope: !0, file: !630, line: 56, type: !95, isLocal: false, isDefinition: true, variable: i8** @vrrp_buffer)
!634 = distinct !DIGlobalVariable(name: "vrrp_buffer_len", scope: !0, file: !630, line: 57, type: !187, isLocal: false, isDefinition: true, variable: i64* @vrrp_buffer_len)
!635 = !{i32 2, !"Dwarf Version", i32 4}
!636 = !{i32 2, !"Debug Info Version", i32 3}
!637 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!638 = distinct !DISubprogram(name: "alloc_saddress", scope: !630, file: !630, line: 72, type: !639, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !641)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !104}
!641 = !{}
!642 = !DILocalVariable(name: "strvec", arg: 1, scope: !638, file: !630, line: 72, type: !104)
!643 = !DIExpression()
!644 = !DILocation(line: 72, column: 26, scope: !638)
!645 = !DILocation(line: 74, column: 9, scope: !646)
!646 = distinct !DILexicalBlock(scope: !638, file: !630, line: 74, column: 6)
!647 = !DILocation(line: 74, column: 20, scope: !646)
!648 = !DILocation(line: 74, column: 38, scope: !646)
!649 = !DILocation(line: 74, column: 6, scope: !638)
!650 = !DILocation(line: 75, column: 33, scope: !646)
!651 = !DILocation(line: 75, column: 3, scope: !646)
!652 = !DILocation(line: 75, column: 14, scope: !646)
!653 = !DILocation(line: 75, column: 31, scope: !646)
!654 = !DILocation(line: 76, column: 18, scope: !638)
!655 = !DILocation(line: 76, column: 29, scope: !638)
!656 = !DILocation(line: 76, column: 47, scope: !638)
!657 = !DILocation(line: 76, column: 2, scope: !638)
!658 = !DILocation(line: 77, column: 1, scope: !638)
!659 = distinct !DISubprogram(name: "alloc_sroute", scope: !630, file: !630, line: 82, type: !639, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !641)
!660 = !DILocalVariable(name: "strvec", arg: 1, scope: !659, file: !630, line: 82, type: !104)
!661 = !DILocation(line: 82, column: 24, scope: !659)
!662 = !DILocation(line: 84, column: 9, scope: !663)
!663 = distinct !DILexicalBlock(scope: !659, file: !630, line: 84, column: 6)
!664 = !DILocation(line: 84, column: 20, scope: !663)
!665 = !DILocation(line: 84, column: 35, scope: !663)
!666 = !DILocation(line: 84, column: 6, scope: !659)
!667 = !DILocation(line: 85, column: 30, scope: !663)
!668 = !DILocation(line: 85, column: 3, scope: !663)
!669 = !DILocation(line: 85, column: 14, scope: !663)
!670 = !DILocation(line: 85, column: 28, scope: !663)
!671 = !DILocation(line: 86, column: 14, scope: !659)
!672 = !DILocation(line: 86, column: 25, scope: !659)
!673 = !DILocation(line: 86, column: 40, scope: !659)
!674 = !DILocation(line: 86, column: 2, scope: !659)
!675 = !DILocation(line: 87, column: 1, scope: !659)
