; ModuleID = './[inter]keepalived--vrrp--vrrp_ipaddress.o.i'
source_filename = "./[inter]keepalived--vrrp--vrrp_ipaddress.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._nl_handle = type { %struct.nl_sock*, i32, i32, i32, %struct._thread* }
%struct.nl_sock = type opaque
%struct._thread = type { i64, i32, %struct._thread_master*, i32 (%struct._thread*)*, i8*, %struct.timeval, %union.anon.3, %struct._thread_event*, %union.anon.5 }
%struct._thread_master = type { %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.list_head, %struct.list_head, %struct.list_head, %struct._list*, %struct.rb_root, %struct.epoll_event*, %struct._thread_event*, i32, i32, i32, i32, %struct._thread*, i64, i64, i8 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.rb_root = type { %struct.rb_node* }
%struct.rb_node = type { i64, %struct.rb_node*, %struct.rb_node* }
%struct.epoll_event = type opaque

!57 = !DIFile(filename: "/usr/include/linux/if_addr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!59 = !DIEnumerator(name: "IFA_UNSPEC", value: 0)
!60 = !DIEnumerator(name: "IFA_ADDRESS", value: 1)
!61 = !DIEnumerator(name: "IFA_LOCAL", value: 2)
!62 = !DIEnumerator(name: "IFA_LABEL", value: 3)
!63 = !DIEnumerator(name: "IFA_BROADCAST", value: 4)
!64 = !DIEnumerator(name: "IFA_ANYCAST", value: 5)
!65 = !DIEnumerator(name: "IFA_CACHEINFO", value: 6)
!66 = !DIEnumerator(name: "IFA_MULTICAST", value: 7)
!67 = !DIEnumerator(name: "IFA_FLAGS", value: 8)
!68 = !DIEnumerator(name: "__IFA_MAX", value: 9)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 42, size: 32, align: 32, elements: !71)
!70 = !DIFile(filename: "/usr/include/net/if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!72 = !DIEnumerator(name: "IFF_UP", value: 1)
!73 = !DIEnumerator(name: "IFF_BROADCAST", value: 2)
!74 = !DIEnumerator(name: "IFF_DEBUG", value: 4)
!75 = !DIEnumerator(name: "IFF_LOOPBACK", value: 8)
!76 = !DIEnumerator(name: "IFF_POINTOPOINT", value: 16)
!77 = !DIEnumerator(name: "IFF_NOTRAILERS", value: 32)
!78 = !DIEnumerator(name: "IFF_RUNNING", value: 64)
!79 = !DIEnumerator(name: "IFF_NOARP", value: 128)
!80 = !DIEnumerator(name: "IFF_PROMISC", value: 256)
!81 = !DIEnumerator(name: "IFF_ALLMULTI", value: 512)
!82 = !DIEnumerator(name: "IFF_MASTER", value: 1024)
!83 = !DIEnumerator(name: "IFF_SLAVE", value: 2048)
!84 = !DIEnumerator(name: "IFF_MULTICAST", value: 4096)
!85 = !DIEnumerator(name: "IFF_PORTSEL", value: 8192)
!86 = !DIEnumerator(name: "IFF_AUTOMEDIA", value: 16384)
!87 = !DIEnumerator(name: "IFF_DYNAMIC", value: 32768)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "global_bits", file: !89, line: 53, size: 32, align: 32, elements: !90)
!89 = !DIFile(filename: "../../lib/bitops.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!91 = !DIEnumerator(name: "LOG_CONSOLE_BIT", value: 0)
!92 = !DIEnumerator(name: "NO_SYSLOG_BIT", value: 1)
!93 = !DIEnumerator(name: "DONT_FORK_BIT", value: 2)
!94 = !DIEnumerator(name: "DUMP_CONF_BIT", value: 3)
!95 = !DIEnumerator(name: "DONT_RELEASE_VRRP_BIT", value: 4)
!96 = !DIEnumerator(name: "RELEASE_VIPS_BIT", value: 5)
!97 = !DIEnumerator(name: "DONT_RELEASE_IPVS_BIT", value: 6)
!98 = !DIEnumerator(name: "LOG_DETAIL_BIT", value: 7)
!99 = !DIEnumerator(name: "LOG_EXTRA_DETAIL_BIT", value: 8)
!100 = !DIEnumerator(name: "DONT_RESPAWN_BIT", value: 9)
!101 = !DIEnumerator(name: "LOG_ADDRESS_CHANGES", value: 10)
!102 = !DIEnumerator(name: "CONFIG_TEST_BIT", value: 11)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 44, size: 32, align: 32, elements: !105)
!104 = !DIFile(filename: "../../lib/parser.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!106 = !DIEnumerator(name: "CONFIG_OK", value: 0)
!107 = !DIEnumerator(name: "CONFIG_FILE_NOT_FOUND", value: 1)
!108 = !DIEnumerator(name: "CONFIG_BAD_IF", value: 2)
!109 = !DIEnumerator(name: "CONFIG_FATAL", value: 3)
!110 = !DIEnumerator(name: "CONFIG_MULTIPLE_FILES", value: 4)
!111 = !DIEnumerator(name: "CONFIG_UNKNOWN_KEYWORD", value: 5)
!112 = !DIEnumerator(name: "CONFIG_UNEXPECTED_BOB", value: 6)
!113 = !DIEnumerator(name: "CONFIG_MISSING_BOB", value: 7)
!114 = !DIEnumerator(name: "CONFIG_UNMATCHED_QUOTE", value: 8)
!115 = !DIEnumerator(name: "CONFIG_MISSING_PARAMETER", value: 9)
!116 = !DIEnumerator(name: "CONFIG_INVALID_NUMBER", value: 10)
!117 = !DIEnumerator(name: "CONFIG_GENERAL_ERROR", value: 11)
!118 = !DIEnumerator(name: "CONFIG_SECURITY_ERROR", value: 12)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "if_lookup", file: !120, line: 142, size: 32, align: 32, elements: !121)
!120 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!121 = !{!122, !123, !124, !125}
!122 = !DIEnumerator(name: "IF_NO_CREATE", value: 0)
!123 = !DIEnumerator(name: "IF_CREATE_IF_DYNAMIC", value: 1)
!124 = !DIEnumerator(name: "IF_CREATE_ALWAYS", value: 2)
!125 = !DIEnumerator(name: "IF_CREATE_NETLINK", value: 3)
!126 = !{!127, !128, !129, !281}
!127 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_address_t", file: !131, line: 73, baseType: !132)
!131 = !DIFile(filename: "./../include/vrrp_ipaddress.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_address", file: !131, line: 41, size: 704, align: 64, elements: !133)
!133 = !{!134, !147, !183, !327, !328, !329, !330, !331, !336, !337, !355, !356, !357}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ifa", scope: !132, file: !131, line: 42, baseType: !135, size: 64, align: 32)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifaddrmsg", file: !57, line: 7, size: 64, align: 32, elements: !136)
!136 = !{!137, !141, !142, !143, !144}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_family", scope: !135, file: !57, line: 8, baseType: !138, size: 8, align: 8)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !139, line: 20, baseType: !140)
!139 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!140 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_prefixlen", scope: !135, file: !57, line: 9, baseType: !138, size: 8, align: 8, offset: 8)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_flags", scope: !135, file: !57, line: 10, baseType: !138, size: 8, align: 8, offset: 16)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_scope", scope: !135, file: !57, line: 11, baseType: !138, size: 8, align: 8, offset: 24)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_index", scope: !135, file: !57, line: 12, baseType: !145, size: 32, align: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !139, line: 26, baseType: !146)
!146 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !132, file: !131, line: 50, baseType: !148, size: 128, align: 32, offset: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !132, file: !131, line: 44, size: 128, align: 32, elements: !149)
!149 = !{!150, !162}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !148, file: !131, line: 48, baseType: !151, size: 64, align: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !131, line: 45, size: 64, align: 32, elements: !152)
!152 = !{!153, !161}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !151, file: !131, line: 46, baseType: !154, size: 32, align: 32)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !155, line: 31, size: 32, align: 32, elements: !156)
!155 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !154, file: !155, line: 33, baseType: !158, size: 32, align: 32)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !155, line: 30, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !160, line: 51, baseType: !146)
!160 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!161 = !DIDerivedType(tag: DW_TAG_member, name: "sin_brd", scope: !151, file: !131, line: 47, baseType: !154, size: 32, align: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !148, file: !131, line: 49, baseType: !163, size: 128, align: 32)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !155, line: 211, size: 128, align: 32, elements: !164)
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !163, file: !155, line: 220, baseType: !166, size: 128, align: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !163, file: !155, line: 213, size: 128, align: 32, elements: !167)
!167 = !{!168, !173, !179}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !166, file: !155, line: 215, baseType: !169, size: 128, align: 8)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 128, align: 8, elements: !171)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !160, line: 48, baseType: !140)
!171 = !{!172}
!172 = !DISubrange(count: 16)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !166, file: !155, line: 217, baseType: !174, size: 128, align: 16)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 128, align: 16, elements: !177)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !160, line: 49, baseType: !176)
!176 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!177 = !{!178}
!178 = !DISubrange(count: 8)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !166, file: !155, line: 218, baseType: !180, size: 128, align: 32)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 128, align: 32, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 4)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !132, file: !131, line: 52, baseType: !184, size: 64, align: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !120, line: 111, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !120, line: 76, size: 1792, align: 64, elements: !187)
!187 = !{!188, !191, !193, !194, !195, !196, !198, !199, !200, !208, !209, !213, !214, !215, !216, !218, !219, !220, !221, !243, !244, !245, !246, !247, !248, !249, !250}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !186, file: !120, line: 77, baseType: !189, size: 128, align: 8)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 128, align: 8, elements: !171)
!190 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !186, file: !120, line: 78, baseType: !192, size: 32, align: 32, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !120, line: 62, baseType: !159)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !186, file: !120, line: 79, baseType: !154, size: 32, align: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !186, file: !120, line: 80, baseType: !163, size: 128, align: 32, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !186, file: !120, line: 81, baseType: !146, size: 32, align: 32, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !186, file: !120, line: 82, baseType: !197, size: 8, align: 8, offset: 352)
!197 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !186, file: !120, line: 83, baseType: !159, size: 32, align: 32, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !186, file: !120, line: 84, baseType: !176, size: 16, align: 16, offset: 416)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !186, file: !120, line: 85, baseType: !201, size: 256, align: 8, offset: 432)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 256, align: 8, elements: !206)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !203, line: 33, baseType: !204)
!203 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !205, line: 30, baseType: !140)
!205 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!206 = !{!207}
!207 = !DISubrange(count: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !186, file: !120, line: 86, baseType: !201, size: 256, align: 8, offset: 688)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !186, file: !120, line: 87, baseType: !210, size: 64, align: 64, offset: 960)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !211, line: 216, baseType: !212)
!211 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!212 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !186, file: !120, line: 88, baseType: !127, size: 32, align: 32, offset: 1024)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !186, file: !120, line: 90, baseType: !197, size: 8, align: 8, offset: 1056)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !186, file: !120, line: 91, baseType: !192, size: 32, align: 32, offset: 1088)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !186, file: !120, line: 92, baseType: !217, size: 64, align: 64, offset: 1152)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !186, file: !120, line: 94, baseType: !192, size: 32, align: 32, offset: 1216)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !186, file: !120, line: 96, baseType: !217, size: 64, align: 64, offset: 1280)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !186, file: !120, line: 97, baseType: !197, size: 8, align: 8, offset: 1344)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !186, file: !120, line: 100, baseType: !222, size: 64, align: 64, offset: 1408)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !120, line: 73, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !120, line: 65, size: 704, align: 64, elements: !225)
!225 = !{!226, !237, !238, !239, !240, !241, !242}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !224, file: !120, line: 66, baseType: !227, size: 128, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !228, line: 31, baseType: !229)
!228 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !230, line: 30, size: 128, align: 64, elements: !231)
!230 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!231 = !{!232, !235}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !229, file: !230, line: 32, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !205, line: 139, baseType: !234)
!234 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !229, file: !230, line: 33, baseType: !236, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !205, line: 141, baseType: !234)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !224, file: !120, line: 67, baseType: !197, size: 8, align: 8, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !224, file: !120, line: 68, baseType: !227, size: 128, align: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !224, file: !120, line: 69, baseType: !197, size: 8, align: 8, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !224, file: !120, line: 70, baseType: !227, size: 128, align: 64, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !224, file: !120, line: 71, baseType: !227, size: 128, align: 64, offset: 512)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !224, file: !120, line: 72, baseType: !127, size: 32, align: 32, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !186, file: !120, line: 101, baseType: !197, size: 8, align: 8, offset: 1472)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !186, file: !120, line: 102, baseType: !127, size: 32, align: 32, offset: 1504)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !186, file: !120, line: 103, baseType: !159, size: 32, align: 32, offset: 1536)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !186, file: !120, line: 104, baseType: !159, size: 32, align: 32, offset: 1568)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !186, file: !120, line: 105, baseType: !159, size: 32, align: 32, offset: 1600)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !186, file: !120, line: 107, baseType: !146, size: 32, align: 32, offset: 1632)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !186, file: !120, line: 109, baseType: !197, size: 8, align: 8, offset: 1664)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !186, file: !120, line: 110, baseType: !251, size: 64, align: 64, offset: 1728)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !252, line: 31, baseType: !253)
!252 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !252, line: 39, size: 320, align: 64, elements: !255)
!255 = !{!256, !263, !264, !265, !269}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !254, file: !252, line: 40, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !252, line: 33, size: 192, align: 64, elements: !259)
!259 = !{!260, !261, !262}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !258, file: !252, line: 34, baseType: !257, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !258, file: !252, line: 35, baseType: !257, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !258, file: !252, line: 36, baseType: !128, size: 64, align: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !254, file: !252, line: 41, baseType: !257, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !254, file: !252, line: 42, baseType: !146, size: 32, align: 32, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !254, file: !252, line: 43, baseType: !266, size: 64, align: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !128}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !254, file: !252, line: 44, baseType: !270, size: 64, align: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !273, !128}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !275, line: 48, baseType: !276)
!275 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !277, line: 241, size: 1728, align: 64, elements: !278)
!277 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!278 = !{!279, !280, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !300, !301, !302, !303, !305, !306, !308, !312, !315, !317, !318, !319, !320, !321, !322, !323}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !276, file: !277, line: 242, baseType: !127, size: 32, align: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !276, file: !277, line: 247, baseType: !281, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !276, file: !277, line: 248, baseType: !281, size: 64, align: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !276, file: !277, line: 249, baseType: !281, size: 64, align: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !276, file: !277, line: 250, baseType: !281, size: 64, align: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !276, file: !277, line: 251, baseType: !281, size: 64, align: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !276, file: !277, line: 252, baseType: !281, size: 64, align: 64, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !276, file: !277, line: 253, baseType: !281, size: 64, align: 64, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !276, file: !277, line: 254, baseType: !281, size: 64, align: 64, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !276, file: !277, line: 256, baseType: !281, size: 64, align: 64, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !276, file: !277, line: 257, baseType: !281, size: 64, align: 64, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !276, file: !277, line: 258, baseType: !281, size: 64, align: 64, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !276, file: !277, line: 260, baseType: !293, size: 64, align: 64, offset: 768)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !277, line: 156, size: 192, align: 64, elements: !295)
!295 = !{!296, !297, !299}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !294, file: !277, line: 157, baseType: !293, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !294, file: !277, line: 158, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !294, file: !277, line: 162, baseType: !127, size: 32, align: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !276, file: !277, line: 262, baseType: !298, size: 64, align: 64, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !276, file: !277, line: 264, baseType: !127, size: 32, align: 32, offset: 896)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !276, file: !277, line: 268, baseType: !127, size: 32, align: 32, offset: 928)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !276, file: !277, line: 270, baseType: !304, size: 64, align: 64, offset: 960)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !205, line: 131, baseType: !234)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !276, file: !277, line: 274, baseType: !176, size: 16, align: 16, offset: 1024)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !276, file: !277, line: 275, baseType: !307, size: 8, align: 8, offset: 1040)
!307 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !276, file: !277, line: 276, baseType: !309, size: 8, align: 8, offset: 1048)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 8, align: 8, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 1)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !276, file: !277, line: 280, baseType: !313, size: 64, align: 64, offset: 1088)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !277, line: 150, baseType: null)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !276, file: !277, line: 289, baseType: !316, size: 64, align: 64, offset: 1152)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !205, line: 132, baseType: !234)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !276, file: !277, line: 297, baseType: !128, size: 64, align: 64, offset: 1216)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !276, file: !277, line: 298, baseType: !128, size: 64, align: 64, offset: 1280)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !276, file: !277, line: 299, baseType: !128, size: 64, align: 64, offset: 1344)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !276, file: !277, line: 300, baseType: !128, size: 64, align: 64, offset: 1408)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !276, file: !277, line: 302, baseType: !210, size: 64, align: 64, offset: 1472)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !276, file: !277, line: 303, baseType: !127, size: 32, align: 32, offset: 1536)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !276, file: !277, line: 305, baseType: !324, size: 160, align: 8, offset: 1568)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 160, align: 8, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 20)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !132, file: !131, line: 53, baseType: !281, size: 64, align: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !132, file: !131, line: 55, baseType: !159, size: 32, align: 32, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flagmask", scope: !132, file: !131, line: 56, baseType: !159, size: 32, align: 32, offset: 352)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "have_peer", scope: !132, file: !131, line: 61, baseType: !197, size: 8, align: 8, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !132, file: !131, line: 65, baseType: !332, size: 128, align: 32, offset: 416)
!332 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !132, file: !131, line: 62, size: 128, align: 32, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !332, file: !131, line: 63, baseType: !154, size: 32, align: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !332, file: !131, line: 64, baseType: !163, size: 128, align: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track", scope: !132, file: !131, line: 66, baseType: !197, size: 8, align: 8, offset: 544)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "track_group", scope: !132, file: !131, line: 67, baseType: !338, size: 64, align: 64, offset: 576)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "static_track_group_t", file: !340, line: 39, baseType: !341)
!340 = !DIFile(filename: "./../include/vrrp_static_track.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_track_group", file: !340, line: 35, size: 192, align: 64, elements: !342)
!342 = !{!343, !344, !354}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !341, file: !340, line: 36, baseType: !281, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !341, file: !340, line: 37, baseType: !345, size: 64, align: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !347, line: 34, baseType: !348)
!347 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !347, line: 30, size: 128, align: 64, elements: !349)
!349 = !{!350, !351, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !348, file: !347, line: 31, baseType: !146, size: 32, align: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !348, file: !347, line: 32, baseType: !146, size: 32, align: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !348, file: !347, line: 33, baseType: !353, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !341, file: !340, line: 38, baseType: !251, size: 64, align: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !132, file: !131, line: 69, baseType: !197, size: 8, align: 8, offset: 640)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rule_set", scope: !132, file: !131, line: 70, baseType: !197, size: 8, align: 8, offset: 648)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "garp_gna_pending", scope: !132, file: !131, line: 72, baseType: !197, size: 8, align: 8, offset: 656)
!358 = !{!359, !368}
!359 = distinct !DIGlobalVariable(name: "addr_str", scope: !360, file: !361, line: 63, type: !365, isLocal: true, isDefinition: true, variable: [46 x i8]* @ipaddresstos.addr_str)
!360 = distinct !DISubprogram(name: "ipaddresstos", scope: !361, file: !361, line: 61, type: !362, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !364)
!361 = !DIFile(filename: "vrrp_ipaddress.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!362 = !DISubroutineType(types: !363)
!363 = !{!281, !281, !129}
!364 = !{}
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 368, align: 8, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 46)
!368 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !120, line: 150, type: !251, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!369 = !{i32 2, !"Dwarf Version", i32 4}
!370 = !{i32 2, !"Debug Info Version", i32 3}
!371 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!372 = !DILocalVariable(name: "buf", arg: 1, scope: !360, file: !361, line: 61, type: !281)
!373 = !DIExpression()
!374 = !DILocation(line: 61, column: 20, scope: !360)
!375 = !DILocalVariable(name: "ipaddress", arg: 2, scope: !360, file: !361, line: 61, type: !129)
!376 = !DILocation(line: 61, column: 39, scope: !360)
!377 = !DILocation(line: 65, column: 7, scope: !378)
!378 = distinct !DILexicalBlock(scope: !360, file: !361, line: 65, column: 6)
!379 = !DILocation(line: 65, column: 6, scope: !360)
!380 = !DILocation(line: 66, column: 7, scope: !378)
!381 = !DILocation(line: 66, column: 3, scope: !378)
!382 = !DILocation(line: 68, column: 8, scope: !383)
!383 = distinct !DILexicalBlock(scope: !360, file: !361, line: 68, column: 6)
!384 = !DILocation(line: 68, column: 20, scope: !383)
!385 = !DILocation(line: 68, column: 24, scope: !383)
!386 = !DILocation(line: 68, column: 7, scope: !383)
!387 = !DILocation(line: 68, column: 35, scope: !383)
!388 = !DILocation(line: 68, column: 6, scope: !360)
!389 = !DILocation(line: 69, column: 23, scope: !390)
!390 = distinct !DILexicalBlock(scope: !383, file: !361, line: 68, column: 8)
!391 = !DILocation(line: 69, column: 34, scope: !390)
!392 = !DILocation(line: 69, column: 36, scope: !390)
!393 = !DILocation(line: 69, column: 22, scope: !390)
!394 = !DILocation(line: 69, column: 47, scope: !390)
!395 = !DILocation(line: 69, column: 3, scope: !390)
!396 = !DILocation(line: 70, column: 2, scope: !390)
!397 = !DILocation(line: 71, column: 22, scope: !398)
!398 = distinct !DILexicalBlock(scope: !383, file: !361, line: 70, column: 9)
!399 = !DILocation(line: 71, column: 33, scope: !398)
!400 = !DILocation(line: 71, column: 35, scope: !398)
!401 = !DILocation(line: 71, column: 39, scope: !398)
!402 = !DILocation(line: 71, column: 21, scope: !398)
!403 = !DILocation(line: 71, column: 49, scope: !398)
!404 = !DILocation(line: 71, column: 3, scope: !398)
!405 = !DILocation(line: 74, column: 9, scope: !360)
!406 = !DILocation(line: 74, column: 2, scope: !360)
!407 = distinct !DISubprogram(name: "netlink_ipaddress", scope: !361, file: !361, line: 79, type: !408, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !364)
!408 = !DISubroutineType(types: !409)
!409 = !{!127, !129, !127}
!410 = !DILocalVariable(name: "ipaddress", arg: 1, scope: !407, file: !361, line: 79, type: !129)
!411 = !DILocation(line: 79, column: 33, scope: !407)
!412 = !DILocalVariable(name: "cmd", arg: 2, scope: !407, file: !361, line: 79, type: !127)
!413 = !DILocation(line: 79, column: 48, scope: !407)
!414 = !DILocalVariable(name: "cinfo", scope: !407, file: !361, line: 81, type: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifa_cacheinfo", file: !57, line: 56, size: 128, align: 32, elements: !416)
!416 = !{!417, !418, !419, !420}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_prefered", scope: !415, file: !57, line: 57, baseType: !145, size: 32, align: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_valid", scope: !415, file: !57, line: 58, baseType: !145, size: 32, align: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "cstamp", scope: !415, file: !57, line: 59, baseType: !145, size: 32, align: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !415, file: !57, line: 60, baseType: !145, size: 32, align: 32, offset: 96)
!421 = !DILocation(line: 81, column: 23, scope: !407)
!422 = !DILocalVariable(name: "status", scope: !407, file: !361, line: 82, type: !127)
!423 = !DILocation(line: 82, column: 6, scope: !407)
!424 = !DILocalVariable(name: "req", scope: !407, file: !361, line: 87, type: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !407, file: !361, line: 83, size: 2240, align: 32, elements: !426)
!426 = !{!427, !437, !438}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !425, file: !361, line: 84, baseType: !428, size: 128, align: 32)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !429, line: 42, size: 128, align: 32, elements: !430)
!429 = !DIFile(filename: "/usr/include/linux/netlink.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!430 = !{!431, !432, !434, !435, !436}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !428, file: !429, line: 43, baseType: !145, size: 32, align: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !428, file: !429, line: 44, baseType: !433, size: 16, align: 16, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !139, line: 23, baseType: !176)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !428, file: !429, line: 45, baseType: !433, size: 16, align: 16, offset: 48)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !428, file: !429, line: 46, baseType: !145, size: 32, align: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !428, file: !429, line: 47, baseType: !145, size: 32, align: 32, offset: 96)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ifa", scope: !425, file: !361, line: 85, baseType: !135, size: 64, align: 32, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !425, file: !361, line: 86, baseType: !439, size: 2048, align: 8, offset: 192)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 2048, align: 8, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 256)
!442 = !DILocation(line: 87, column: 4, scope: !407)
!443 = !DILocalVariable(name: "ifa_flags", scope: !407, file: !361, line: 89, type: !159)
!444 = !DILocation(line: 89, column: 11, scope: !407)
!445 = !DILocation(line: 94, column: 6, scope: !446)
!446 = distinct !DILexicalBlock(scope: !407, file: !361, line: 94, column: 6)
!447 = !DILocation(line: 94, column: 10, scope: !446)
!448 = !DILocation(line: 94, column: 6, scope: !407)
!449 = !DILocation(line: 96, column: 8, scope: !450)
!450 = distinct !DILexicalBlock(scope: !451, file: !361, line: 96, column: 7)
!451 = distinct !DILexicalBlock(scope: !446, file: !361, line: 94, column: 16)
!452 = !DILocation(line: 96, column: 19, scope: !450)
!453 = !DILocation(line: 96, column: 24, scope: !450)
!454 = !DILocation(line: 96, column: 7, scope: !451)
!455 = !DILocation(line: 97, column: 105, scope: !456)
!456 = distinct !DILexicalBlock(scope: !450, file: !361, line: 96, column: 33)
!457 = !DILocation(line: 97, column: 86, scope: !456)
!458 = !DILocation(line: 97, column: 117, scope: !456)
!459 = !DILocation(line: 97, column: 128, scope: !456)
!460 = !DILocation(line: 97, column: 133, scope: !456)
!461 = !DILocation(line: 97, column: 4, scope: !462)
!462 = !DILexicalBlockFile(scope: !456, file: !361, discriminator: 1)
!463 = !DILocation(line: 98, column: 4, scope: !456)
!464 = !DILocation(line: 102, column: 30, scope: !451)
!465 = !DILocation(line: 102, column: 41, scope: !451)
!466 = !DILocation(line: 102, column: 46, scope: !451)
!467 = !DILocation(line: 102, column: 3, scope: !451)
!468 = !DILocation(line: 102, column: 14, scope: !451)
!469 = !DILocation(line: 102, column: 18, scope: !451)
!470 = !DILocation(line: 102, column: 28, scope: !451)
!471 = !DILocation(line: 103, column: 2, scope: !451)
!472 = !DILocation(line: 104, column: 12, scope: !473)
!473 = distinct !DILexicalBlock(scope: !446, file: !361, line: 104, column: 11)
!474 = !DILocation(line: 104, column: 23, scope: !473)
!475 = !DILocation(line: 104, column: 28, scope: !473)
!476 = !DILocation(line: 104, column: 11, scope: !446)
!477 = !DILocation(line: 106, column: 3, scope: !478)
!478 = distinct !DILexicalBlock(scope: !473, file: !361, line: 104, column: 37)
!479 = !DILocation(line: 109, column: 2, scope: !407)
!480 = !DILocation(line: 111, column: 6, scope: !407)
!481 = !DILocation(line: 111, column: 8, scope: !407)
!482 = !DILocation(line: 111, column: 18, scope: !407)
!483 = !DILocation(line: 112, column: 6, scope: !407)
!484 = !DILocation(line: 112, column: 8, scope: !407)
!485 = !DILocation(line: 112, column: 20, scope: !407)
!486 = !DILocation(line: 113, column: 22, scope: !407)
!487 = !DILocation(line: 113, column: 26, scope: !407)
!488 = !DILocation(line: 113, column: 21, scope: !407)
!489 = !DILocation(line: 113, column: 6, scope: !407)
!490 = !DILocation(line: 113, column: 8, scope: !407)
!491 = !DILocation(line: 113, column: 19, scope: !407)
!492 = !DILocation(line: 114, column: 6, scope: !407)
!493 = !DILocation(line: 114, column: 12, scope: !407)
!494 = !DILocation(line: 114, column: 23, scope: !407)
!495 = !DILocation(line: 116, column: 6, scope: !496)
!496 = distinct !DILexicalBlock(scope: !407, file: !361, line: 116, column: 6)
!497 = !DILocation(line: 116, column: 10, scope: !496)
!498 = !DILocation(line: 116, column: 6, scope: !407)
!499 = !DILocation(line: 117, column: 15, scope: !496)
!500 = !DILocation(line: 117, column: 26, scope: !496)
!501 = !DILocation(line: 117, column: 13, scope: !496)
!502 = !DILocation(line: 117, column: 3, scope: !496)
!503 = !DILocation(line: 119, column: 8, scope: !504)
!504 = distinct !DILexicalBlock(scope: !407, file: !361, line: 119, column: 6)
!505 = !DILocation(line: 119, column: 20, scope: !504)
