; ModuleID = './[inter]keepalived--vrrp--vrrp_track.o.i'
source_filename = "./[inter]keepalived--vrrp--vrrp_track.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._vrrp_data = type { %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._thread_master = type { %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.list_head, %struct.list_head, %struct.list_head, %struct._list*, %struct.rb_root, %struct.epoll_event*, %struct._thread_event*, i32, i32, i32, i32, %struct._thread*, i64, i64, i8 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.rb_root = type { %struct.rb_node* }
%struct.rb_node = type { i64, %struct.rb_node*, %struct.rb_node* }
%struct.epoll_event = type opaque
%struct._thread_event = type { %struct._thread*, %struct._thread*, i64, i32, %struct.rb_node }

!25 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!26 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!27 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!28 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!29 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!30 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!31 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "if_lookup", file: !33, line: 142, size: 32, align: 32, elements: !34)
!33 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!34 = !{!35, !36, !37, !38}
!35 = !DIEnumerator(name: "IF_NO_CREATE", value: 0)
!36 = !DIEnumerator(name: "IF_CREATE_IF_DYNAMIC", value: 1)
!37 = !DIEnumerator(name: "IF_CREATE_ALWAYS", value: 2)
!38 = !DIEnumerator(name: "IF_CREATE_NETLINK", value: 3)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 44, size: 32, align: 32, elements: !41)
!40 = !DIFile(filename: "../../lib/parser.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54}
!42 = !DIEnumerator(name: "CONFIG_OK", value: 0)
!43 = !DIEnumerator(name: "CONFIG_FILE_NOT_FOUND", value: 1)
!44 = !DIEnumerator(name: "CONFIG_BAD_IF", value: 2)
!45 = !DIEnumerator(name: "CONFIG_FATAL", value: 3)
!46 = !DIEnumerator(name: "CONFIG_MULTIPLE_FILES", value: 4)
!47 = !DIEnumerator(name: "CONFIG_UNKNOWN_KEYWORD", value: 5)
!48 = !DIEnumerator(name: "CONFIG_UNEXPECTED_BOB", value: 6)
!49 = !DIEnumerator(name: "CONFIG_MISSING_BOB", value: 7)
!50 = !DIEnumerator(name: "CONFIG_UNMATCHED_QUOTE", value: 8)
!51 = !DIEnumerator(name: "CONFIG_MISSING_PARAMETER", value: 9)
!52 = !DIEnumerator(name: "CONFIG_INVALID_NUMBER", value: 10)
!53 = !DIEnumerator(name: "CONFIG_GENERAL_ERROR", value: 11)
!54 = !DIEnumerator(name: "CONFIG_SECURITY_ERROR", value: 12)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 45, size: 32, align: 32, elements: !57)
!56 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!57 = !{!58, !59, !60, !61}
!58 = !DIEnumerator(name: "SCRIPT_STATE_IDLE", value: 0)
!59 = !DIEnumerator(name: "SCRIPT_STATE_RUNNING", value: 1)
!60 = !DIEnumerator(name: "SCRIPT_STATE_REQUESTING_TERMINATION", value: 2)
!61 = !DIEnumerator(name: "SCRIPT_STATE_FORCING_TERMINATION", value: 3)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 52, size: 32, align: 32, elements: !63)
!63 = !{!64, !65, !66}
!64 = !DIEnumerator(name: "SCRIPT_INIT_STATE_DONE", value: 0)
!65 = !DIEnumerator(name: "SCRIPT_INIT_STATE_INIT", value: 1)
!66 = !DIEnumerator(name: "SCRIPT_INIT_STATE_FAILED", value: 2)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 119, size: 32, align: 32, elements: !69)
!68 = !DIFile(filename: "./../include/vrrp_track.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78}
!70 = !DIEnumerator(name: "TRACK_VRRP", value: 1)
!71 = !DIEnumerator(name: "TRACK_IF", value: 2)
!72 = !DIEnumerator(name: "TRACK_SG", value: 4)
!73 = !DIEnumerator(name: "TRACK_ADDR", value: 4)
!74 = !DIEnumerator(name: "TRACK_ROUTE", value: 8)
!75 = !DIEnumerator(name: "TRACK_RULE", value: 16)
!76 = !DIEnumerator(name: "TRACK_SADDR", value: 32)
!77 = !DIEnumerator(name: "TRACK_SROUTE", value: 64)
!78 = !DIEnumerator(name: "TRACK_SRULE", value: 128)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !80, line: 42, size: 32, align: 32, elements: !81)
!80 = !DIFile(filename: "/usr/include/net/if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!82 = !DIEnumerator(name: "IFF_UP", value: 1)
!83 = !DIEnumerator(name: "IFF_BROADCAST", value: 2)
!84 = !DIEnumerator(name: "IFF_DEBUG", value: 4)
!85 = !DIEnumerator(name: "IFF_LOOPBACK", value: 8)
!86 = !DIEnumerator(name: "IFF_POINTOPOINT", value: 16)
!87 = !DIEnumerator(name: "IFF_NOTRAILERS", value: 32)
!88 = !DIEnumerator(name: "IFF_RUNNING", value: 64)
!89 = !DIEnumerator(name: "IFF_NOARP", value: 128)
!90 = !DIEnumerator(name: "IFF_PROMISC", value: 256)
!91 = !DIEnumerator(name: "IFF_ALLMULTI", value: 512)
!92 = !DIEnumerator(name: "IFF_MASTER", value: 1024)
!93 = !DIEnumerator(name: "IFF_SLAVE", value: 2048)
!94 = !DIEnumerator(name: "IFF_MULTICAST", value: 4096)
!95 = !DIEnumerator(name: "IFF_PORTSEL", value: 8192)
!96 = !DIEnumerator(name: "IFF_AUTOMEDIA", value: 16384)
!97 = !DIEnumerator(name: "IFF_DYNAMIC", value: 32768)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !99, line: 23, size: 32, align: 32, elements: !100)
!99 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/inotify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!100 = !{!101, !102}
!101 = !DIEnumerator(name: "IN_CLOEXEC", value: 524288)
!102 = !DIEnumerator(name: "IN_NONBLOCK", value: 2048)
!103 = !{!104, !105, !107, !284, !322, !141, !112, !339, !341}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "tracked_if_t", file: !33, line: 117, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tracked_if", file: !33, line: 114, size: 128, align: 64, elements: !110)
!110 = !{!111, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !109, file: !33, line: 115, baseType: !112, size: 32, align: 32)
!112 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !109, file: !33, line: 116, baseType: !114, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !33, line: 111, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !33, line: 76, size: 1792, align: 64, elements: !117)
!117 = !{!118, !122, !127, !133, !153, !154, !156, !157, !158, !166, !167, !171, !172, !173, !174, !176, !177, !178, !179, !201, !202, !203, !204, !205, !206, !207, !208}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !116, file: !33, line: 77, baseType: !119, size: 128, align: 8)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 128, align: 8, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 16)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !116, file: !33, line: 78, baseType: !123, size: 32, align: 32, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !33, line: 62, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !125, line: 51, baseType: !126)
!125 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!126 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !116, file: !33, line: 79, baseType: !128, size: 32, align: 32, offset: 160)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !129, line: 31, size: 32, align: 32, elements: !130)
!129 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !128, file: !129, line: 33, baseType: !132, size: 32, align: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !129, line: 30, baseType: !124)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !116, file: !33, line: 80, baseType: !134, size: 128, align: 32, offset: 192)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !129, line: 211, size: 128, align: 32, elements: !135)
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !134, file: !129, line: 220, baseType: !137, size: 128, align: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !134, file: !129, line: 213, size: 128, align: 32, elements: !138)
!138 = !{!139, !143, !149}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !137, file: !129, line: 215, baseType: !140, size: 128, align: 8)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 128, align: 8, elements: !120)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !125, line: 48, baseType: !142)
!142 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !137, file: !129, line: 217, baseType: !144, size: 128, align: 16)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 128, align: 16, elements: !147)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !125, line: 49, baseType: !146)
!146 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!147 = !{!148}
!148 = !DISubrange(count: 8)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !137, file: !129, line: 218, baseType: !150, size: 128, align: 32)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 128, align: 32, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 4)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !116, file: !33, line: 81, baseType: !126, size: 32, align: 32, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !116, file: !33, line: 82, baseType: !155, size: 8, align: 8, offset: 352)
!155 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !116, file: !33, line: 83, baseType: !124, size: 32, align: 32, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !116, file: !33, line: 84, baseType: !146, size: 16, align: 16, offset: 416)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !116, file: !33, line: 85, baseType: !159, size: 256, align: 8, offset: 432)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 256, align: 8, elements: !164)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !161, line: 33, baseType: !162)
!161 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !163, line: 30, baseType: !142)
!163 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!164 = !{!165}
!165 = !DISubrange(count: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !116, file: !33, line: 86, baseType: !159, size: 256, align: 8, offset: 688)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !116, file: !33, line: 87, baseType: !168, size: 64, align: 64, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !169, line: 216, baseType: !170)
!169 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!170 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !116, file: !33, line: 88, baseType: !112, size: 32, align: 32, offset: 1024)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !116, file: !33, line: 90, baseType: !155, size: 8, align: 8, offset: 1056)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !116, file: !33, line: 91, baseType: !123, size: 32, align: 32, offset: 1088)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !116, file: !33, line: 92, baseType: !175, size: 64, align: 64, offset: 1152)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !116, file: !33, line: 94, baseType: !123, size: 32, align: 32, offset: 1216)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !116, file: !33, line: 96, baseType: !175, size: 64, align: 64, offset: 1280)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !116, file: !33, line: 97, baseType: !155, size: 8, align: 8, offset: 1344)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !116, file: !33, line: 100, baseType: !180, size: 64, align: 64, offset: 1408)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !33, line: 73, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !33, line: 65, size: 704, align: 64, elements: !183)
!183 = !{!184, !195, !196, !197, !198, !199, !200}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !182, file: !33, line: 66, baseType: !185, size: 128, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !186, line: 31, baseType: !187)
!186 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !188, line: 30, size: 128, align: 64, elements: !189)
!188 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!189 = !{!190, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !187, file: !188, line: 32, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !163, line: 139, baseType: !192)
!192 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !187, file: !188, line: 33, baseType: !194, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !163, line: 141, baseType: !192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !182, file: !33, line: 67, baseType: !155, size: 8, align: 8, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !182, file: !33, line: 68, baseType: !185, size: 128, align: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !182, file: !33, line: 69, baseType: !155, size: 8, align: 8, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !182, file: !33, line: 70, baseType: !185, size: 128, align: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !182, file: !33, line: 71, baseType: !185, size: 128, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !182, file: !33, line: 72, baseType: !112, size: 32, align: 32, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !116, file: !33, line: 101, baseType: !155, size: 8, align: 8, offset: 1472)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !116, file: !33, line: 102, baseType: !112, size: 32, align: 32, offset: 1504)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !116, file: !33, line: 103, baseType: !124, size: 32, align: 32, offset: 1536)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !116, file: !33, line: 104, baseType: !124, size: 32, align: 32, offset: 1568)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !116, file: !33, line: 105, baseType: !124, size: 32, align: 32, offset: 1600)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !116, file: !33, line: 107, baseType: !126, size: 32, align: 32, offset: 1632)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !116, file: !33, line: 109, baseType: !155, size: 8, align: 8, offset: 1664)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !116, file: !33, line: 110, baseType: !209, size: 64, align: 64, offset: 1728)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !210, line: 31, baseType: !211)
!210 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !210, line: 39, size: 320, align: 64, elements: !213)
!213 = !{!214, !221, !222, !223, !227}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !212, file: !210, line: 40, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !210, line: 33, size: 192, align: 64, elements: !217)
!217 = !{!218, !219, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !216, file: !210, line: 34, baseType: !215, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !216, file: !210, line: 35, baseType: !215, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !216, file: !210, line: 36, baseType: !104, size: 64, align: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !212, file: !210, line: 41, baseType: !215, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !212, file: !210, line: 42, baseType: !126, size: 32, align: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !212, file: !210, line: 43, baseType: !224, size: 64, align: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !104}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !212, file: !210, line: 44, baseType: !228, size: 64, align: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !231, !104}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !233, line: 48, baseType: !234)
!233 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !235, line: 241, size: 1728, align: 64, elements: !236)
!235 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !257, !258, !259, !260, !262, !263, !265, !269, !272, !274, !275, !276, !277, !278, !279, !280}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !234, file: !235, line: 242, baseType: !112, size: 32, align: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !234, file: !235, line: 247, baseType: !105, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !234, file: !235, line: 248, baseType: !105, size: 64, align: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !234, file: !235, line: 249, baseType: !105, size: 64, align: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !234, file: !235, line: 250, baseType: !105, size: 64, align: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !234, file: !235, line: 251, baseType: !105, size: 64, align: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !234, file: !235, line: 252, baseType: !105, size: 64, align: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !234, file: !235, line: 253, baseType: !105, size: 64, align: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !234, file: !235, line: 254, baseType: !105, size: 64, align: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !234, file: !235, line: 256, baseType: !105, size: 64, align: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !234, file: !235, line: 257, baseType: !105, size: 64, align: 64, offset: 640)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !234, file: !235, line: 258, baseType: !105, size: 64, align: 64, offset: 704)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !234, file: !235, line: 260, baseType: !250, size: 64, align: 64, offset: 768)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !235, line: 156, size: 192, align: 64, elements: !252)
!252 = !{!253, !254, !256}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !251, file: !235, line: 157, baseType: !250, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !251, file: !235, line: 158, baseType: !255, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !251, file: !235, line: 162, baseType: !112, size: 32, align: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !234, file: !235, line: 262, baseType: !255, size: 64, align: 64, offset: 832)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !234, file: !235, line: 264, baseType: !112, size: 32, align: 32, offset: 896)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !234, file: !235, line: 268, baseType: !112, size: 32, align: 32, offset: 928)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !234, file: !235, line: 270, baseType: !261, size: 64, align: 64, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !163, line: 131, baseType: !192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !234, file: !235, line: 274, baseType: !146, size: 16, align: 16, offset: 1024)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !234, file: !235, line: 275, baseType: !264, size: 8, align: 8, offset: 1040)
!264 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !234, file: !235, line: 276, baseType: !266, size: 8, align: 8, offset: 1048)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 8, align: 8, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 1)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !234, file: !235, line: 280, baseType: !270, size: 64, align: 64, offset: 1088)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !235, line: 150, baseType: null)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !234, file: !235, line: 289, baseType: !273, size: 64, align: 64, offset: 1152)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !163, line: 132, baseType: !192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !234, file: !235, line: 297, baseType: !104, size: 64, align: 64, offset: 1216)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !234, file: !235, line: 298, baseType: !104, size: 64, align: 64, offset: 1280)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !234, file: !235, line: 299, baseType: !104, size: 64, align: 64, offset: 1344)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !234, file: !235, line: 300, baseType: !104, size: 64, align: 64, offset: 1408)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !234, file: !235, line: 302, baseType: !168, size: 64, align: 64, offset: 1472)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !234, file: !235, line: 303, baseType: !112, size: 32, align: 32, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !234, file: !235, line: 305, baseType: !281, size: 160, align: 8, offset: 1568)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 160, align: 8, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 20)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "tracked_sc_t", file: !68, line: 80, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tracked_sc", file: !68, line: 77, size: 128, align: 64, elements: !287)
!287 = !{!288, !321}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "scr", scope: !286, file: !68, line: 78, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_script_t", file: !68, line: 74, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_script", file: !68, line: 60, size: 704, align: 64, elements: !292)
!292 = !{!293, !294, !308, !309, !310, !311, !312, !313, !314, !315, !316, !318, !320}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "sname", scope: !291, file: !68, line: 61, baseType: !105, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !291, file: !68, line: 62, baseType: !295, size: 192, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !56, line: 65, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !56, line: 59, size: 192, align: 64, elements: !297)
!297 = !{!298, !300, !301, !302, !305}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !296, file: !56, line: 60, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !296, file: !56, line: 61, baseType: !112, size: 32, align: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !296, file: !56, line: 62, baseType: !112, size: 32, align: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !296, file: !56, line: 63, baseType: !303, size: 32, align: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !161, line: 80, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !163, line: 125, baseType: !126)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !296, file: !56, line: 64, baseType: !306, size: 32, align: 32, offset: 160)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !161, line: 65, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !163, line: 126, baseType: !126)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !291, file: !68, line: 63, baseType: !170, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !291, file: !68, line: 64, baseType: !170, size: 64, align: 64, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !291, file: !68, line: 65, baseType: !112, size: 32, align: 32, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !291, file: !68, line: 66, baseType: !112, size: 32, align: 32, offset: 416)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "rise", scope: !291, file: !68, line: 67, baseType: !112, size: 32, align: 32, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "fall", scope: !291, file: !68, line: 68, baseType: !112, size: 32, align: 32, offset: 480)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !291, file: !68, line: 69, baseType: !209, size: 64, align: 64, offset: 512)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "last_status", scope: !291, file: !68, line: 70, baseType: !112, size: 32, align: 32, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !291, file: !68, line: 71, baseType: !317, size: 32, align: 32, offset: 608)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "script_state_t", file: !56, line: 50, baseType: !55)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !291, file: !68, line: 72, baseType: !319, size: 32, align: 32, offset: 640)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "script_init_state_t", file: !56, line: 56, baseType: !62)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "insecure", scope: !291, file: !68, line: 73, baseType: !155, size: 8, align: 8, offset: 672)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !286, file: !68, line: 79, baseType: !112, size: 32, align: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "tracked_file_t", file: !68, line: 97, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_tracked_file", file: !68, line: 94, size: 128, align: 64, elements: !325)
!325 = !{!326, !338}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !324, file: !68, line: 95, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_tracked_file_t", file: !68, line: 91, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_file", file: !68, line: 83, size: 384, align: 64, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !337}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !329, file: !68, line: 84, baseType: !105, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "file_path", scope: !329, file: !68, line: 85, baseType: !105, size: 64, align: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "file_part", scope: !329, file: !68, line: 86, baseType: !105, size: 64, align: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !329, file: !68, line: 87, baseType: !112, size: 32, align: 32, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !329, file: !68, line: 88, baseType: !112, size: 32, align: 32, offset: 224)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !329, file: !68, line: 89, baseType: !209, size: 64, align: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "last_status", scope: !329, file: !68, line: 90, baseType: !112, size: 32, align: 32, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !324, file: !68, line: 96, baseType: !112, size: 32, align: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !161, line: 109, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !163, line: 172, baseType: !192)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inotify_event", file: !343, line: 28, size: 128, align: 32, elements: !344)
!343 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/inotify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!344 = !{!345, !346, !347, !348, !349}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !342, file: !343, line: 30, baseType: !112, size: 32, align: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !342, file: !343, line: 31, baseType: !124, size: 32, align: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !342, file: !343, line: 32, baseType: !124, size: 32, align: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !342, file: !343, line: 33, baseType: !124, size: 32, align: 32, offset: 96)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !342, file: !343, line: 34, baseType: !350, offset: 128)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, align: 8, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: -1)
!353 = !{!354, !355, !443}
!354 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !33, line: 150, type: !209, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!355 = distinct !DIGlobalVariable(name: "inotify_thread", scope: !0, file: !356, line: 48, type: !357, isLocal: true, isDefinition: true, variable: %struct._thread** @inotify_thread)
!356 = !DIFile(filename: "vrrp_track.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !12, line: 99, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !12, line: 78, size: 768, align: 64, elements: !360)
!360 = !{!361, !362, !364, !417, !422, !423, !424, !436, !438}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !359, file: !12, line: 79, baseType: !170, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !359, file: !12, line: 80, baseType: !363, size: 32, align: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !12, line: 63, baseType: !11)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !359, file: !12, line: 81, baseType: !365, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !12, line: 112, size: 1280, align: 64, elements: !367)
!367 = !{!368, !380, !381, !382, !383, !391, !392, !393, !394, !395, !398, !409, !410, !411, !412, !413, !414, !415, !416}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !366, file: !12, line: 113, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !370, line: 109, baseType: !371)
!370 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !370, line: 106, size: 64, align: 64, elements: !372)
!372 = !{!373}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !371, file: !370, line: 108, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !370, line: 97, size: 192, align: 64, elements: !376)
!376 = !{!377, !378, !379}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !375, file: !370, line: 99, baseType: !170, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !375, file: !370, line: 102, baseType: !374, size: 64, align: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !375, file: !370, line: 103, baseType: !374, size: 64, align: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !366, file: !12, line: 114, baseType: !369, size: 64, align: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !366, file: !12, line: 115, baseType: !369, size: 64, align: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !366, file: !12, line: 116, baseType: !369, size: 64, align: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !366, file: !12, line: 117, baseType: !384, size: 128, align: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !385, line: 62, baseType: !386)
!385 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !385, line: 60, size: 128, align: 64, elements: !387)
!387 = !{!388, !390}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !386, file: !385, line: 61, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !386, file: !385, line: 61, baseType: !389, size: 64, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !366, file: !12, line: 121, baseType: !384, size: 128, align: 64, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !366, file: !12, line: 122, baseType: !384, size: 128, align: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !366, file: !12, line: 124, baseType: !209, size: 64, align: 64, offset: 640)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !366, file: !12, line: 127, baseType: !369, size: 64, align: 64, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !366, file: !12, line: 128, baseType: !396, size: 64, align: 64, offset: 768)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !12, line: 128, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !366, file: !12, line: 129, baseType: !399, size: 64, align: 64, offset: 832)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !12, line: 109, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !12, line: 102, size: 448, align: 64, elements: !402)
!402 = !{!403, !404, !405, !406, !407}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !401, file: !12, line: 103, baseType: !357, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !401, file: !12, line: 104, baseType: !357, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !401, file: !12, line: 105, baseType: !170, size: 64, align: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !401, file: !12, line: 106, baseType: !112, size: 32, align: 32, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !401, file: !12, line: 108, baseType: !408, size: 192, align: 64, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !370, line: 104, baseType: !375)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !366, file: !12, line: 130, baseType: !126, size: 32, align: 32, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !366, file: !12, line: 131, baseType: !126, size: 32, align: 32, offset: 928)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !366, file: !12, line: 132, baseType: !112, size: 32, align: 32, offset: 960)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !366, file: !12, line: 135, baseType: !112, size: 32, align: 32, offset: 992)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !366, file: !12, line: 136, baseType: !357, size: 64, align: 64, offset: 1024)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !366, file: !12, line: 146, baseType: !170, size: 64, align: 64, offset: 1088)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !366, file: !12, line: 147, baseType: !170, size: 64, align: 64, offset: 1152)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !366, file: !12, line: 148, baseType: !155, size: 8, align: 8, offset: 1216)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !359, file: !12, line: 82, baseType: !418, size: 64, align: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!112, !421}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !359, file: !12, line: 83, baseType: !104, size: 64, align: 64, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !359, file: !12, line: 84, baseType: !185, size: 128, align: 64, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !359, file: !12, line: 92, baseType: !425, size: 64, align: 32, offset: 448)
!425 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !359, file: !12, line: 85, size: 64, align: 32, elements: !426)
!426 = !{!427, !428, !429}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !425, file: !12, line: 86, baseType: !112, size: 32, align: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !425, file: !12, line: 87, baseType: !112, size: 32, align: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !425, file: !12, line: 91, baseType: !430, size: 64, align: 32)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !425, file: !12, line: 88, size: 64, align: 32, elements: !431)
!431 = !{!432, !435}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !430, file: !12, line: 89, baseType: !433, size: 32, align: 32)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !161, line: 98, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !163, line: 133, baseType: !112)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !430, file: !12, line: 90, baseType: !112, size: 32, align: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !359, file: !12, line: 93, baseType: !437, size: 64, align: 64, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, scope: !359, file: !12, line: 95, baseType: !439, size: 192, align: 64, offset: 576)
!439 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !359, file: !12, line: 95, size: 192, align: 64, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !439, file: !12, line: 96, baseType: !408, size: 192, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !439, file: !12, line: 97, baseType: !384, size: 128, align: 64)
!443 = distinct !DIGlobalVariable(name: "inotify_fd", scope: !0, file: !356, line: 47, type: !112, isLocal: true, isDefinition: true, variable: i32* @inotify_fd)
!444 = !{i32 2, !"Dwarf Version", i32 4}
!445 = !{i32 2, !"Debug Info Version", i32 3}
!446 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!447 = distinct !DISubprogram(name: "dump_track_if", scope: !356, file: !356, line: 52, type: !229, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !448)
!448 = !{}
!449 = !DILocalVariable(name: "fp", arg: 1, scope: !447, file: !356, line: 52, type: !231)
!450 = !DIExpression()
!451 = !DILocation(line: 52, column: 21, scope: !447)
!452 = !DILocalVariable(name: "track_data", arg: 2, scope: !447, file: !356, line: 52, type: !104)
!453 = !DILocation(line: 52, column: 31, scope: !447)
!454 = !DILocalVariable(name: "tip", scope: !447, file: !356, line: 54, type: !107)
!455 = !DILocation(line: 54, column: 16, scope: !447)
!456 = !DILocation(line: 54, column: 22, scope: !447)
!457 = !DILocation(line: 55, column: 13, scope: !447)
!458 = !DILocation(line: 55, column: 40, scope: !447)
!459 = !DILocation(line: 55, column: 45, scope: !447)
!460 = !DILocation(line: 55, column: 51, scope: !447)
!461 = !DILocation(line: 55, column: 38, scope: !447)
!462 = !DILocation(line: 55, column: 60, scope: !447)
!463 = !DILocation(line: 55, column: 65, scope: !447)
!464 = !DILocation(line: 55, column: 2, scope: !447)
!465 = !DILocation(line: 56, column: 1, scope: !447)
!466 = distinct !DISubprogram(name: "free_track_if", scope: !356, file: !356, line: 59, type: !225, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !448)
!467 = !DILocalVariable(name: "tip", arg: 1, scope: !466, file: !356, line: 59, type: !104)
!468 = !DILocation(line: 59, column: 21, scope: !466)
!469 = !DILocation(line: 61, column: 8, scope: !466)
!470 = !DILocation(line: 61, column: 3, scope: !466)
!471 = !DILocation(line: 61, column: 20, scope: !466)
!472 = !DILocation(line: 62, column: 1, scope: !466)
!473 = distinct !DISubprogram(name: "alloc_track_if", scope: !356, file: !356, line: 65, type: !474, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !448)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !476, !491}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_t", file: !4, line: 310, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_t", file: !4, line: 183, size: 7040, align: 64, elements: !479)
!479 = !{!480, !483, !484, !518, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !560, !561, !562, !563, !564, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !636, !643}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !478, file: !4, line: 184, baseType: !481, size: 16, align: 16)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !482, line: 28, baseType: !146)
!482 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!483 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !478, file: !4, line: 185, baseType: !105, size: 64, align: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !478, file: !4, line: 186, baseType: !485, size: 64, align: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_sgroup_t", file: !4, line: 133, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_sgroup", file: !4, line: 109, size: 1024, align: 64, elements: !488)
!488 = !{!489, !490, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !512, !513, !514, !515, !516, !517}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !487, file: !4, line: 110, baseType: !105, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !487, file: !4, line: 111, baseType: !491, size: 64, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !493, line: 34, baseType: !494)
!493 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !493, line: 30, size: 128, align: 64, elements: !495)
!495 = !{!496, !497, !498}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !494, file: !493, line: 31, baseType: !126, size: 32, align: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !494, file: !493, line: 32, baseType: !126, size: 32, align: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !494, file: !493, line: 33, baseType: !499, size: 64, align: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !487, file: !4, line: 112, baseType: !209, size: 64, align: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_fault", scope: !487, file: !4, line: 113, baseType: !126, size: 32, align: 32, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_init", scope: !487, file: !4, line: 114, baseType: !126, size: 32, align: 32, offset: 224)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !487, file: !4, line: 115, baseType: !112, size: 32, align: 32, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "sgroup_tracking_weight", scope: !487, file: !4, line: 116, baseType: !155, size: 8, align: 8, offset: 288)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !487, file: !4, line: 119, baseType: !209, size: 64, align: 64, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !487, file: !4, line: 120, baseType: !209, size: 64, align: 64, offset: 384)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !487, file: !4, line: 121, baseType: !209, size: 64, align: 64, offset: 448)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "track_bfd", scope: !487, file: !4, line: 122, baseType: !209, size: 64, align: 64, offset: 512)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !487, file: !4, line: 125, baseType: !155, size: 8, align: 8, offset: 576)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !487, file: !4, line: 126, baseType: !511, size: 64, align: 64, offset: 640)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !487, file: !4, line: 127, baseType: !511, size: 64, align: 64, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !487, file: !4, line: 128, baseType: !511, size: 64, align: 64, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !487, file: !4, line: 129, baseType: !511, size: 64, align: 64, offset: 832)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !487, file: !4, line: 130, baseType: !511, size: 64, align: 64, offset: 896)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !487, file: !4, line: 131, baseType: !112, size: 32, align: 32, offset: 960)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !487, file: !4, line: 132, baseType: !112, size: 32, align: 32, offset: 992)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !478, file: !4, line: 187, baseType: !519, size: 64, align: 64, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_stats", file: !4, line: 169, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_stats", file: !4, line: 136, size: 768, align: 64, elements: !522)
!522 = !{!523, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "advert_rcvd", scope: !521, file: !4, line: 137, baseType: !524, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !125, line: 55, baseType: !170)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "advert_sent", scope: !521, file: !4, line: 138, baseType: !124, size: 32, align: 32, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "become_master", scope: !521, file: !4, line: 140, baseType: !124, size: 32, align: 32, offset: 96)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "release_master", scope: !521, file: !4, line: 141, baseType: !124, size: 32, align: 32, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "packet_len_err", scope: !521, file: !4, line: 143, baseType: !524, size: 64, align: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "advert_interval_err", scope: !521, file: !4, line: 144, baseType: !524, size: 64, align: 64, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl_err", scope: !521, file: !4, line: 145, baseType: !524, size: 64, align: 64, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_type_rcvd", scope: !521, file: !4, line: 146, baseType: !524, size: 64, align: 64, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list_err", scope: !521, file: !4, line: 147, baseType: !524, size: 64, align: 64, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_authtype", scope: !521, file: !4, line: 149, baseType: !124, size: 32, align: 32, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "authtype_mismatch", scope: !521, file: !4, line: 151, baseType: !124, size: 32, align: 32, offset: 544)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "auth_failure", scope: !521, file: !4, line: 152, baseType: !124, size: 32, align: 32, offset: 576)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_rcvd", scope: !521, file: !4, line: 155, baseType: !524, size: 64, align: 64, offset: 640)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_sent", scope: !521, file: !4, line: 156, baseType: !524, size: 64, align: 64, offset: 704)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !478, file: !4, line: 188, baseType: !114, size: 64, align: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track_primary", scope: !478, file: !4, line: 189, baseType: !155, size: 8, align: 8, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !478, file: !4, line: 190, baseType: !155, size: 8, align: 8, offset: 328)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "skip_check_adv_addr", scope: !478, file: !4, line: 191, baseType: !155, size: 8, align: 8, offset: 336)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "strict_mode", scope: !478, file: !4, line: 193, baseType: !126, size: 32, align: 32, offset: 352)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_flags", scope: !478, file: !4, line: 195, baseType: !170, size: 64, align: 64, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_ifname", scope: !478, file: !4, line: 196, baseType: !119, size: 128, align: 8, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !478, file: !4, line: 198, baseType: !209, size: 64, align: 64, offset: 576)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !478, file: !4, line: 199, baseType: !209, size: 64, align: 64, offset: 640)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !478, file: !4, line: 200, baseType: !209, size: 64, align: 64, offset: 704)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_if_fault", scope: !478, file: !4, line: 204, baseType: !126, size: 32, align: 32, offset: 768)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_init", scope: !478, file: !4, line: 205, baseType: !126, size: 32, align: 32, offset: 800)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !478, file: !4, line: 206, baseType: !551, size: 1024, align: 64, offset: 832)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !552, line: 166, size: 1024, align: 64, elements: !553)
!552 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!553 = !{!554, !555, !559}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !551, file: !552, line: 168, baseType: !481, size: 16, align: 16)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !551, file: !552, line: 169, baseType: !556, size: 944, align: 8, offset: 16)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 944, align: 8, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 118)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !551, file: !552, line: 170, baseType: !170, size: 64, align: 64, offset: 960)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "saddr_from_config", scope: !478, file: !4, line: 207, baseType: !155, size: 8, align: 8, offset: 1856)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "track_saddr", scope: !478, file: !4, line: 208, baseType: !155, size: 8, align: 8, offset: 1864)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_saddr", scope: !478, file: !4, line: 209, baseType: !551, size: 1024, align: 64, offset: 1920)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_peer", scope: !478, file: !4, line: 210, baseType: !209, size: 64, align: 64, offset: 2944)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_chksum_compat", scope: !478, file: !4, line: 212, baseType: !565, size: 32, align: 32, offset: 3008)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "chksum_compatibility_t", file: !4, line: 179, baseType: !3)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "master_saddr", scope: !478, file: !4, line: 214, baseType: !551, size: 1024, align: 64, offset: 3072)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "master_priority", scope: !478, file: !4, line: 215, baseType: !141, size: 8, align: 8, offset: 4096)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "last_transition", scope: !478, file: !4, line: 216, baseType: !185, size: 128, align: 64, offset: 4160)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !478, file: !4, line: 217, baseType: !126, size: 32, align: 32, offset: 4288)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh", scope: !478, file: !4, line: 218, baseType: !185, size: 128, align: 64, offset: 4352)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_timer", scope: !478, file: !4, line: 219, baseType: !185, size: 128, align: 64, offset: 4480)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "garp_rep", scope: !478, file: !4, line: 220, baseType: !126, size: 32, align: 32, offset: 4608)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_rep", scope: !478, file: !4, line: 221, baseType: !126, size: 32, align: 32, offset: 4640)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_delay", scope: !478, file: !4, line: 222, baseType: !126, size: 32, align: 32, offset: 4672)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "garp_pending", scope: !478, file: !4, line: 223, baseType: !155, size: 8, align: 8, offset: 4704)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "gna_pending", scope: !478, file: !4, line: 224, baseType: !155, size: 8, align: 8, offset: 4712)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_rep", scope: !478, file: !4, line: 225, baseType: !126, size: 32, align: 32, offset: 4736)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "lower_prio_no_advert", scope: !478, file: !4, line: 226, baseType: !126, size: 32, align: 32, offset: 4768)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "higher_prio_send_advert", scope: !478, file: !4, line: 227, baseType: !126, size: 32, align: 32, offset: 4800)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "vrid", scope: !478, file: !4, line: 228, baseType: !141, size: 8, align: 8, offset: 4832)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "base_priority", scope: !478, file: !4, line: 229, baseType: !141, size: 8, align: 8, offset: 4840)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "effective_priority", scope: !478, file: !4, line: 230, baseType: !141, size: 8, align: 8, offset: 4848)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "total_priority", scope: !478, file: !4, line: 231, baseType: !112, size: 32, align: 32, offset: 4864)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "vipset", scope: !478, file: !4, line: 233, baseType: !155, size: 8, align: 8, offset: 4896)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !478, file: !4, line: 234, baseType: !209, size: 64, align: 64, offset: 4928)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "evip", scope: !478, file: !4, line: 235, baseType: !209, size: 64, align: 64, offset: 4992)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries", scope: !478, file: !4, line: 239, baseType: !155, size: 8, align: 8, offset: 5056)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "evip_add_ipv6", scope: !478, file: !4, line: 240, baseType: !155, size: 8, align: 8, offset: 5064)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "vroutes", scope: !478, file: !4, line: 241, baseType: !209, size: 64, align: 64, offset: 5120)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "vrules", scope: !478, file: !4, line: 242, baseType: !209, size: 64, align: 64, offset: 5184)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "adver_int", scope: !478, file: !4, line: 243, baseType: !126, size: 32, align: 32, offset: 5248)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "master_adver_int", scope: !478, file: !4, line: 244, baseType: !126, size: 32, align: 32, offset: 5280)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !478, file: !4, line: 249, baseType: !126, size: 32, align: 32, offset: 5312)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_rx_buf_size", scope: !478, file: !4, line: 252, baseType: !168, size: 64, align: 64, offset: 5376)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rules_set", scope: !478, file: !4, line: 254, baseType: !155, size: 8, align: 8, offset: 5440)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "nopreempt", scope: !478, file: !4, line: 255, baseType: !155, size: 8, align: 8, offset: 5448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_delay", scope: !478, file: !4, line: 256, baseType: !170, size: 64, align: 64, offset: 5504)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_time", scope: !478, file: !4, line: 260, baseType: !185, size: 128, align: 64, offset: 5568)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !478, file: !4, line: 261, baseType: !112, size: 32, align: 32, offset: 5696)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "wantstate", scope: !478, file: !4, line: 265, baseType: !112, size: 32, align: 32, offset: 5728)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "reload_master", scope: !478, file: !4, line: 266, baseType: !155, size: 8, align: 8, offset: 5760)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "sockets", scope: !478, file: !4, line: 267, baseType: !603, size: 64, align: 64, offset: 5824)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_t", file: !605, line: 50, baseType: !606)
!605 = !DIFile(filename: "./../include/vrrp_sock.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sock", file: !605, line: 40, size: 1344, align: 64, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !606, file: !605, line: 41, baseType: !481, size: 16, align: 16)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !606, file: !605, line: 42, baseType: !551, size: 1024, align: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !606, file: !605, line: 43, baseType: !112, size: 32, align: 32, offset: 1088)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !606, file: !605, line: 44, baseType: !123, size: 32, align: 32, offset: 1120)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "unicast", scope: !606, file: !605, line: 45, baseType: !155, size: 8, align: 8, offset: 1152)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "fd_in", scope: !606, file: !605, line: 46, baseType: !112, size: 32, align: 32, offset: 1184)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "fd_out", scope: !606, file: !605, line: 47, baseType: !112, size: 32, align: 32, offset: 1216)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_size", scope: !606, file: !605, line: 48, baseType: !112, size: 32, align: 32, offset: 1248)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !606, file: !605, line: 49, baseType: !357, size: 64, align: 64, offset: 1280)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !478, file: !4, line: 269, baseType: !112, size: 32, align: 32, offset: 5888)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !478, file: !4, line: 271, baseType: !112, size: 32, align: 32, offset: 5920)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !478, file: !4, line: 274, baseType: !112, size: 32, align: 32, offset: 5952)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !478, file: !4, line: 275, baseType: !112, size: 32, align: 32, offset: 5984)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !478, file: !4, line: 276, baseType: !155, size: 8, align: 8, offset: 6016)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !478, file: !4, line: 277, baseType: !511, size: 64, align: 64, offset: 6080)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !478, file: !4, line: 278, baseType: !511, size: 64, align: 64, offset: 6144)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !478, file: !4, line: 279, baseType: !511, size: 64, align: 64, offset: 6208)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !478, file: !4, line: 280, baseType: !511, size: 64, align: 64, offset: 6272)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "script_master_rx_lower_pri", scope: !478, file: !4, line: 281, baseType: !511, size: 64, align: 64, offset: 6336)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !478, file: !4, line: 282, baseType: !511, size: 64, align: 64, offset: 6400)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ms_down_timer", scope: !478, file: !4, line: 285, baseType: !124, size: 32, align: 32, offset: 6464)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !478, file: !4, line: 286, baseType: !185, size: 128, align: 64, offset: 6528)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !478, file: !4, line: 289, baseType: !105, size: 64, align: 64, offset: 6656)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer_size", scope: !478, file: !4, line: 290, baseType: !168, size: 64, align: 64, offset: 6720)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_csum", scope: !478, file: !4, line: 291, baseType: !124, size: 32, align: 32, offset: 6784)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "auth_type", scope: !478, file: !4, line: 295, baseType: !141, size: 8, align: 8, offset: 6816)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "auth_data", scope: !478, file: !4, line: 296, baseType: !635, size: 64, align: 8, offset: 6824)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 64, align: 8, elements: !147)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ipsecah_counter", scope: !478, file: !4, line: 299, baseType: !637, size: 64, align: 32, offset: 6912)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_counter_t", file: !638, line: 58, baseType: !639)
!638 = !DIFile(filename: "./../include/vrrp_ipsecah.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seq_counter", file: !638, line: 55, size: 64, align: 32, elements: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !639, file: !638, line: 56, baseType: !155, size: 8, align: 8)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "seq_number", scope: !639, file: !638, line: 57, baseType: !124, size: 32, align: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !478, file: !4, line: 309, baseType: !112, size: 32, align: 32, offset: 6976)
!644 = !DILocalVariable(name: "vrrp", arg: 1, scope: !473, file: !356, line: 65, type: !476)
!645 = !DILocation(line: 65, column: 24, scope: !473)
!646 = !DILocalVariable(name: "strvec", arg: 2, scope: !473, file: !356, line: 65, type: !491)
!647 = !DILocation(line: 65, column: 40, scope: !473)
!648 = !DILocalVariable(name: "ifp", scope: !473, file: !356, line: 67, type: !114)
!649 = !DILocation(line: 67, column: 15, scope: !473)
!650 = !DILocalVariable(name: "tip", scope: !473, file: !356, line: 68, type: !107)
!651 = !DILocation(line: 68, column: 16, scope: !473)
!652 = !DILocalVariable(name: "weight", scope: !473, file: !356, line: 69, type: !112)
!653 = !DILocation(line: 69, column: 6, scope: !473)
!654 = !DILocalVariable(name: "tracked", scope: !473, file: !356, line: 70, type: !105)
!655 = !DILocation(line: 70, column: 8, scope: !473)
!656 = !DILocation(line: 70, column: 30, scope: !473)
!657 = !DILocation(line: 70, column: 18, scope: !473)
!658 = !DILocalVariable(name: "e", scope: !473, file: !356, line: 71, type: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "element", file: !210, line: 30, baseType: !215)
!660 = !DILocation(line: 71, column: 10, scope: !473)
!661 = !DILocation(line: 73, column: 25, scope: !473)
!662 = !DILocation(line: 73, column: 8, scope: !473)
!663 = !DILocation(line: 73, column: 6, scope: !473)
!664 = !DILocation(line: 75, column: 7, scope: !665)
!665 = distinct !DILexicalBlock(scope: !473, file: !356, line: 75, column: 6)
!666 = !DILocation(line: 75, column: 6, scope: !473)
!667 = !DILocation(line: 76, column: 88, scope: !668)
!668 = distinct !DILexicalBlock(scope: !665, file: !356, line: 75, column: 12)
!669 = !DILocation(line: 76, column: 94, scope: !668)
!670 = !DILocation(line: 76, column: 101, scope: !668)
!671 = !DILocation(line: 76, column: 3, scope: !668)
!672 = !DILocation(line: 77, column: 3, scope: !668)
!673 = !DILocation(line: 81, column: 15, scope: !674)
!674 = distinct !DILexicalBlock(scope: !473, file: !356, line: 81, column: 2)
!675 = !DILocation(line: 81, column: 21, scope: !674)
!676 = !DILocation(line: 81, column: 14, scope: !674)
!677 = !DILocation(line: 81, column: 37, scope: !678)
!678 = !DILexicalBlockFile(scope: !674, file: !356, discriminator: 1)
!679 = !DILocation(line: 81, column: 43, scope: !678)
!680 = !DILocation(line: 81, column: 36, scope: !678)
!681 = !DILocation(line: 81, column: 35, scope: !678)
!682 = !DILocation(line: 81, column: 35, scope: !683)
!683 = !DILexicalBlockFile(scope: !674, file: !356, discriminator: 2)
!684 = !DILocation(line: 81, column: 4, scope: !685)
!685 = !DILexicalBlockFile(scope: !674, file: !356, discriminator: 3)
!686 = !DILocation(line: 81, column: 10, scope: !685)
!687 = !DILocation(line: 81, column: 22, scope: !685)
!688 = !DILocation(line: 81, column: 35, scope: !685)
!689 = !DILocation(line: 81, column: 35, scope: !690)
!690 = !DILexicalBlockFile(scope: !674, file: !356, discriminator: 4)
!691 = !DILocation(line: 81, column: 14, scope: !690)
!692 = !DILocation(line: 81, column: 14, scope: !693)
!693 = !DILexicalBlockFile(scope: !674, file: !356, discriminator: 5)
!694 = !DILocation(line: 81, column: 14, scope: !695)
!695 = !DILexicalBlockFile(scope: !674, file: !356, discriminator: 6)
!696 = !DILocation(line: 81, column: 11, scope: !695)
!697 = !DILocation(line: 81, column: 7, scope: !695)
!698 = !DILocation(line: 81, column: 5, scope: !699)
!699 = !DILexicalBlockFile(scope: !700, file: !356, discriminator: 7)
!700 = distinct !DILexicalBlock(scope: !674, file: !356, line: 81, column: 2)
!701 = !DILocation(line: 81, column: 4, scope: !699)
!702 = !DILocation(line: 81, column: 8, scope: !699)
!703 = !DILocation(line: 81, column: 22, scope: !704)
!704 = !DILexicalBlockFile(scope: !700, file: !356, discriminator: 8)
!705 = !DILocation(line: 81, column: 26, scope: !704)
!706 = !DILocation(line: 81, column: 20, scope: !704)
!707 = !DILocation(line: 81, column: 18, scope: !704)
!708 = !DILocation(line: 81, column: 2, scope: !709)
!709 = !DILexicalBlockFile(scope: !674, file: !356, discriminator: 9)
!710 = !DILocation(line: 82, column: 7, scope: !711)
!711 = distinct !DILexicalBlock(scope: !712, file: !356, line: 82, column: 7)
!712 = distinct !DILexicalBlock(scope: !700, file: !356, line: 81, column: 56)
!713 = !DILocation(line: 82, column: 12, scope: !711)
!714 = !DILocation(line: 82, column: 19, scope: !711)
!715 = !DILocation(line: 82, column: 16, scope: !711)
!716 = !DILocation(line: 82, column: 7, scope: !712)
!717 = !DILocation(line: 83, column: 94, scope: !718)
!718 = distinct !DILexicalBlock(scope: !711, file: !356, line: 82, column: 24)
!719 = !DILocation(line: 83, column: 100, scope: !718)
!720 = !DILocation(line: 83, column: 107, scope: !718)
!721 = !DILocation(line: 83, column: 4, scope: !718)
!722 = !DILocation(line: 84, column: 4, scope: !718)
!723 = !DILocation(line: 86, column: 2, scope: !712)
!724 = !DILocation(line: 81, column: 45, scope: !725)
!725 = !DILexicalBlockFile(scope: !700, file: !356, discriminator: 10)
!726 = !DILocation(line: 81, column: 49, scope: !725)
!727 = !DILocation(line: 81, column: 42, scope: !725)
!728 = !DILocation(line: 81, column: 2, scope: !725)
!729 = distinct !{!729, !730}
!730 = !DILocation(line: 81, column: 2, scope: !473)
!731 = !DILocation(line: 88, column: 8, scope: !732)
!732 = distinct !DILexicalBlock(scope: !473, file: !356, line: 88, column: 6)
!733 = !DILocation(line: 88, column: 17, scope: !732)
!734 = !DILocation(line: 88, column: 28, scope: !732)
!735 = !DILocation(line: 88, column: 33, scope: !732)
!736 = !DILocation(line: 89, column: 26, scope: !732)
!737 = !DILocation(line: 89, column: 14, scope: !732)
!738 = !DILocation(line: 89, column: 7, scope: !739)
!739 = !DILexicalBlockFile(scope: !732, file: !356, discriminator: 1)
!740 = !DILocation(line: 89, column: 7, scope: !732)
!741 = !DILocation(line: 88, column: 6, scope: !742)
!742 = !DILexicalBlockFile(scope: !473, file: !356, discriminator: 1)
!743 = !DILocation(line: 90, column: 24, scope: !744)
!744 = distinct !DILexicalBlock(scope: !745, file: !356, line: 90, column: 7)
!745 = distinct !DILexicalBlock(scope: !732, file: !356, line: 89, column: 49)
!746 = !DILocation(line: 90, column: 8, scope: !744)
!747 = !DILocation(line: 90, column: 7, scope: !745)
!748 = !DILocation(line: 92, column: 45, scope: !749)
!749 = distinct !DILexicalBlock(scope: !744, file: !356, line: 90, column: 61)
!750 = !DILocation(line: 92, column: 51, scope: !749)
!751 = !DILocation(line: 92, column: 78, scope: !749)
!752 = !DILocation(line: 92, column: 66, scope: !749)
!753 = !DILocation(line: 92, column: 90, scope: !749)
!754 = !DILocation(line: 91, column: 4, scope: !749)
!755 = !DILocation(line: 93, column: 11, scope: !749)
!756 = !DILocation(line: 94, column: 3, scope: !749)
!757 = !DILocation(line: 95, column: 12, scope: !758)
!758 = distinct !DILexicalBlock(scope: !744, file: !356, line: 95, column: 12)
!759 = !DILocation(line: 95, column: 19, scope: !758)
!760 = !DILocation(line: 95, column: 27, scope: !758)
!761 = !DILocation(line: 95, column: 30, scope: !762)
!762 = !DILexicalBlockFile(scope: !758, file: !356, discriminator: 1)
!763 = !DILocation(line: 95, column: 37, scope: !762)
!764 = !DILocation(line: 95, column: 12, scope: !762)
!765 = !DILocation(line: 97, column: 104, scope: !766)
!766 = distinct !DILexicalBlock(scope: !758, file: !356, line: 95, column: 45)
!767 = !DILocation(line: 97, column: 110, scope: !766)
!768 = !DILocation(line: 97, column: 117, scope: !766)
!769 = !DILocation(line: 97, column: 4, scope: !766)
!770 = !DILocation(line: 98, column: 13, scope: !766)
!771 = !DILocation(line: 98, column: 20, scope: !766)
!772 = !DILocation(line: 98, column: 11, scope: !766)
!773 = !DILocation(line: 99, column: 3, scope: !766)
!774 = !DILocation(line: 100, column: 2, scope: !745)
!775 = !DILocation(line: 102, column: 26, scope: !473)
!776 = !DILocation(line: 102, column: 8, scope: !473)
!777 = !DILocation(line: 102, column: 6, scope: !473)
!778 = !DILocation(line: 103, column: 13, scope: !473)
!779 = !DILocation(line: 103, column: 2, scope: !473)
!780 = !DILocation(line: 103, column: 7, scope: !473)
!781 = !DILocation(line: 103, column: 11, scope: !473)
!782 = !DILocation(line: 104, column: 16, scope: !473)
!783 = !DILocation(line: 104, column: 2, scope: !473)
!784 = !DILocation(line: 104, column: 7, scope: !473)
!785 = !DILocation(line: 104, column: 14, scope: !473)
!786 = !DILocation(line: 106, column: 11, scope: !473)
!787 = !DILocation(line: 106, column: 17, scope: !473)
!788 = !DILocation(line: 106, column: 28, scope: !473)
!789 = !DILocation(line: 106, column: 2, scope: !473)
!790 = !DILocation(line: 107, column: 1, scope: !473)
!791 = !DILocation(line: 107, column: 1, scope: !742)
!792 = distinct !DISubprogram(name: "alloc_group_track_if", scope: !356, file: !356, line: 110, type: !793, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !448)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !485, !491}
!795 = !DILocalVariable(name: "sgroup", arg: 1, scope: !792, file: !356, line: 110, type: !485)
!796 = !DILocation(line: 110, column: 37, scope: !792)
!797 = !DILocalVariable(name: "strvec", arg: 2, scope: !792, file: !356, line: 110, type: !491)
!798 = !DILocation(line: 110, column: 55, scope: !792)
!799 = !DILocalVariable(name: "ifp", scope: !792, file: !356, line: 112, type: !114)
!800 = !DILocation(line: 112, column: 15, scope: !792)
!801 = !DILocalVariable(name: "tip", scope: !792, file: !356, line: 113, type: !107)
!802 = !DILocation(line: 113, column: 16, scope: !792)
!803 = !DILocalVariable(name: "weight", scope: !792, file: !356, line: 114, type: !112)
!804 = !DILocation(line: 114, column: 6, scope: !792)
!805 = !DILocalVariable(name: "tracked", scope: !792, file: !356, line: 115, type: !105)
!806 = !DILocation(line: 115, column: 8, scope: !792)
!807 = !DILocation(line: 115, column: 30, scope: !792)
!808 = !DILocation(line: 115, column: 18, scope: !792)
!809 = !DILocalVariable(name: "e", scope: !792, file: !356, line: 116, type: !659)
!810 = !DILocation(line: 116, column: 10, scope: !792)
!811 = !DILocation(line: 118, column: 25, scope: !792)
!812 = !DILocation(line: 118, column: 8, scope: !792)
!813 = !DILocation(line: 118, column: 6, scope: !792)
!814 = !DILocation(line: 120, column: 7, scope: !815)
!815 = distinct !DILexicalBlock(scope: !792, file: !356, line: 120, column: 6)
!816 = !DILocation(line: 120, column: 6, scope: !792)
!817 = !DILocation(line: 121, column: 88, scope: !818)
!818 = distinct !DILexicalBlock(scope: !815, file: !356, line: 120, column: 12)
!819 = !DILocation(line: 121, column: 96, scope: !818)
!820 = !DILocation(line: 121, column: 103, scope: !818)
!821 = !DILocation(line: 121, column: 3, scope: !818)
!822 = !DILocation(line: 122, column: 3, scope: !818)
!823 = !DILocation(line: 126, column: 15, scope: !824)
!824 = distinct !DILexicalBlock(scope: !792, file: !356, line: 126, column: 2)
!825 = !DILocation(line: 126, column: 23, scope: !824)
!826 = !DILocation(line: 126, column: 14, scope: !824)
!827 = !DILocation(line: 126, column: 39, scope: !828)
!828 = !DILexicalBlockFile(scope: !824, file: !356, discriminator: 1)
!829 = !DILocation(line: 126, column: 47, scope: !828)
!830 = !DILocation(line: 126, column: 38, scope: !828)
!831 = !DILocation(line: 126, column: 37, scope: !828)
!832 = !DILocation(line: 126, column: 37, scope: !833)
!833 = !DILexicalBlockFile(scope: !824, file: !356, discriminator: 2)
!834 = !DILocation(line: 126, column: 4, scope: !835)
!835 = !DILexicalBlockFile(scope: !824, file: !356, discriminator: 3)
!836 = !DILocation(line: 126, column: 12, scope: !835)
!837 = !DILocation(line: 126, column: 24, scope: !835)
!838 = !DILocation(line: 126, column: 37, scope: !835)
!839 = !DILocation(line: 126, column: 37, scope: !840)
!840 = !DILexicalBlockFile(scope: !824, file: !356, discriminator: 4)
!841 = !DILocation(line: 126, column: 14, scope: !840)
!842 = !DILocation(line: 126, column: 14, scope: !843)
!843 = !DILexicalBlockFile(scope: !824, file: !356, discriminator: 5)
!844 = !DILocation(line: 126, column: 14, scope: !845)
!845 = !DILexicalBlockFile(scope: !824, file: !356, discriminator: 6)
!846 = !DILocation(line: 126, column: 11, scope: !845)
!847 = !DILocation(line: 126, column: 7, scope: !845)
!848 = !DILocation(line: 126, column: 5, scope: !849)
!849 = !DILexicalBlockFile(scope: !850, file: !356, discriminator: 7)
!850 = distinct !DILexicalBlock(scope: !824, file: !356, line: 126, column: 2)
!851 = !DILocation(line: 126, column: 4, scope: !849)
!852 = !DILocation(line: 126, column: 8, scope: !849)
!853 = !DILocation(line: 126, column: 22, scope: !854)
!854 = !DILexicalBlockFile(scope: !850, file: !356, discriminator: 8)
!855 = !DILocation(line: 126, column: 26, scope: !854)
!856 = !DILocation(line: 126, column: 20, scope: !854)
!857 = !DILocation(line: 126, column: 18, scope: !854)
!858 = !DILocation(line: 126, column: 2, scope: !859)
!859 = !DILexicalBlockFile(scope: !824, file: !356, discriminator: 9)
!860 = !DILocation(line: 127, column: 7, scope: !861)
!861 = distinct !DILexicalBlock(scope: !862, file: !356, line: 127, column: 7)
!862 = distinct !DILexicalBlock(scope: !850, file: !356, line: 126, column: 56)
!863 = !DILocation(line: 127, column: 12, scope: !861)
!864 = !DILocation(line: 127, column: 19, scope: !861)
!865 = !DILocation(line: 127, column: 16, scope: !861)
!866 = !DILocation(line: 127, column: 7, scope: !862)
!867 = !DILocation(line: 128, column: 94, scope: !868)
!868 = distinct !DILexicalBlock(scope: !861, file: !356, line: 127, column: 24)
!869 = !DILocation(line: 128, column: 102, scope: !868)
!870 = !DILocation(line: 128, column: 109, scope: !868)
!871 = !DILocation(line: 128, column: 4, scope: !868)
!872 = !DILocation(line: 129, column: 4, scope: !868)
!873 = !DILocation(line: 131, column: 2, scope: !862)
!874 = !DILocation(line: 126, column: 45, scope: !875)
!875 = !DILexicalBlockFile(scope: !850, file: !356, discriminator: 10)
!876 = !DILocation(line: 126, column: 49, scope: !875)
!877 = !DILocation(line: 126, column: 42, scope: !875)
!878 = !DILocation(line: 126, column: 2, scope: !875)
!879 = distinct !{!879, !880}
!880 = !DILocation(line: 126, column: 2, scope: !792)
!881 = !DILocation(line: 133, column: 8, scope: !882)
!882 = distinct !DILexicalBlock(scope: !792, file: !356, line: 133, column: 6)
!883 = !DILocation(line: 133, column: 17, scope: !882)
!884 = !DILocation(line: 133, column: 28, scope: !882)
!885 = !DILocation(line: 133, column: 33, scope: !882)
!886 = !DILocation(line: 134, column: 26, scope: !882)
!887 = !DILocation(line: 134, column: 14, scope: !882)
!888 = !DILocation(line: 134, column: 7, scope: !889)
!889 = !DILexicalBlockFile(scope: !882, file: !356, discriminator: 1)
!890 = !DILocation(line: 134, column: 7, scope: !882)
!891 = !DILocation(line: 133, column: 6, scope: !892)
!892 = !DILexicalBlockFile(scope: !792, file: !356, discriminator: 1)
!893 = !DILocation(line: 135, column: 24, scope: !894)
!894 = distinct !DILexicalBlock(scope: !895, file: !356, line: 135, column: 7)
!895 = distinct !DILexicalBlock(scope: !882, file: !356, line: 134, column: 49)
!896 = !DILocation(line: 135, column: 8, scope: !894)
!897 = !DILocation(line: 135, column: 7, scope: !895)
!898 = !DILocation(line: 137, column: 45, scope: !899)
!899 = distinct !DILexicalBlock(scope: !894, file: !356, line: 135, column: 61)
!900 = !DILocation(line: 137, column: 53, scope: !899)
!901 = !DILocation(line: 137, column: 60, scope: !899)
!902 = !DILocation(line: 136, column: 4, scope: !899)
!903 = !DILocation(line: 138, column: 11, scope: !899)
!904 = !DILocation(line: 139, column: 3, scope: !899)
!905 = !DILocation(line: 140, column: 12, scope: !906)
!906 = distinct !DILexicalBlock(scope: !894, file: !356, line: 140, column: 12)
!907 = !DILocation(line: 140, column: 19, scope: !906)
!908 = !DILocation(line: 140, column: 27, scope: !906)
!909 = !DILocation(line: 140, column: 30, scope: !910)
!910 = !DILexicalBlockFile(scope: !906, file: !356, discriminator: 1)
!911 = !DILocation(line: 140, column: 37, scope: !910)
!912 = !DILocation(line: 140, column: 12, scope: !910)
!913 = !DILocation(line: 142, column: 104, scope: !914)
!914 = distinct !DILexicalBlock(scope: !906, file: !356, line: 140, column: 45)
!915 = !DILocation(line: 142, column: 112, scope: !914)
!916 = !DILocation(line: 142, column: 119, scope: !914)
!917 = !DILocation(line: 142, column: 4, scope: !914)
!918 = !DILocation(line: 143, column: 13, scope: !914)
!919 = !DILocation(line: 143, column: 20, scope: !914)
!920 = !DILocation(line: 143, column: 11, scope: !914)
!921 = !DILocation(line: 144, column: 3, scope: !914)
!922 = !DILocation(line: 145, column: 2, scope: !895)
!923 = !DILocation(line: 147, column: 26, scope: !792)
!924 = !DILocation(line: 147, column: 8, scope: !792)
!925 = !DILocation(line: 147, column: 6, scope: !792)
!926 = !DILocation(line: 148, column: 13, scope: !792)
!927 = !DILocation(line: 148, column: 2, scope: !792)
!928 = !DILocation(line: 148, column: 7, scope: !792)
!929 = !DILocation(line: 148, column: 11, scope: !792)
!930 = !DILocation(line: 149, column: 16, scope: !792)
!931 = !DILocation(line: 149, column: 2, scope: !792)
!932 = !DILocation(line: 149, column: 7, scope: !792)
!933 = !DILocation(line: 149, column: 14, scope: !792)
!934 = !DILocation(line: 151, column: 11, scope: !792)
!935 = !DILocation(line: 151, column: 19, scope: !792)
!936 = !DILocation(line: 151, column: 30, scope: !792)
!937 = !DILocation(line: 151, column: 2, scope: !792)
!938 = !DILocation(line: 152, column: 1, scope: !792)
!939 = !DILocation(line: 152, column: 1, scope: !892)
!940 = distinct !DISubprogram(name: "find_script_by_name", scope: !356, file: !356, line: 155, type: !941, isLocal: false, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !448)
!941 = !DISubroutineType(types: !942)
!942 = !{!289, !105}
!943 = !DILocalVariable(name: "name", arg: 1, scope: !940, file: !356, line: 155, type: !105)
!944 = !DILocation(line: 155, column: 27, scope: !940)
!945 = !DILocalVariable(name: "e", scope: !940, file: !356, line: 157, type: !659)
!946 = !DILocation(line: 157, column: 10, scope: !940)
!947 = !DILocalVariable(name: "scr", scope: !940, file: !356, line: 158, type: !289)
!948 = !DILocation(line: 158, column: 17, scope: !940)
!949 = !DILocation(line: 160, column: 8, scope: !950)
!950 = distinct !DILexicalBlock(scope: !940, file: !356, line: 160, column: 6)
!951 = !DILocation(line: 160, column: 19, scope: !950)
!952 = !DILocation(line: 160, column: 32, scope: !950)
!953 = !DILocation(line: 160, column: 5, scope: !950)
!954 = !DILocation(line: 160, column: 10, scope: !955)
!955 = !DILexicalBlockFile(scope: !950, file: !356, discriminator: 1)
!956 = !DILocation(line: 160, column: 21, scope: !955)
!957 = !DILocation(line: 160, column: 35, scope: !955)
!958 = !DILocation(line: 160, column: 40, scope: !955)
!959 = !DILocation(line: 160, column: 5, scope: !955)
!960 = !DILocation(line: 160, column: 9, scope: !961)
!961 = !DILexicalBlockFile(scope: !950, file: !356, discriminator: 2)
!962 = !DILocation(line: 160, column: 20, scope: !961)
!963 = !DILocation(line: 160, column: 34, scope: !961)
!964 = !DILocation(line: 160, column: 39, scope: !961)
!965 = !DILocation(line: 160, column: 6, scope: !961)
!966 = !DILocation(line: 161, column: 3, scope: !950)
!967 = !DILocation(line: 163, column: 14, scope: !968)
!968 = distinct !DILexicalBlock(scope: !940, file: !356, line: 163, column: 2)
!969 = !DILocation(line: 163, column: 25, scope: !968)
!970 = !DILocation(line: 163, column: 13, scope: !968)
!971 = !DILocation(line: 163, column: 12, scope: !968)
!972 = !DILocation(line: 163, column: 12, scope: !973)
!973 = !DILexicalBlockFile(scope: !968, file: !356, discriminator: 1)
!974 = !DILocation(line: 163, column: 13, scope: !975)
!975 = !DILexicalBlockFile(scope: !968, file: !356, discriminator: 2)
!976 = !DILocation(line: 163, column: 24, scope: !975)
!977 = !DILocation(line: 163, column: 38, scope: !975)
!978 = !DILocation(line: 163, column: 12, scope: !975)
!979 = !DILocation(line: 163, column: 12, scope: !980)
!980 = !DILexicalBlockFile(scope: !968, file: !356, discriminator: 3)
!981 = !DILocation(line: 163, column: 9, scope: !980)
!982 = !DILocation(line: 163, column: 7, scope: !980)
!983 = !DILocation(line: 163, column: 45, scope: !984)
!984 = !DILexicalBlockFile(scope: !985, file: !356, discriminator: 4)
!985 = distinct !DILexicalBlock(scope: !968, file: !356, line: 163, column: 2)
!986 = !DILocation(line: 163, column: 2, scope: !984)
!987 = !DILocation(line: 164, column: 11, scope: !988)
!988 = distinct !DILexicalBlock(scope: !985, file: !356, line: 163, column: 67)
!989 = !DILocation(line: 164, column: 15, scope: !988)
!990 = !DILocation(line: 164, column: 9, scope: !988)
!991 = !DILocation(line: 164, column: 7, scope: !988)
!992 = !DILocation(line: 165, column: 15, scope: !993)
!993 = distinct !DILexicalBlock(scope: !988, file: !356, line: 165, column: 7)
!994 = !DILocation(line: 165, column: 20, scope: !993)
!995 = !DILocation(line: 165, column: 27, scope: !993)
!996 = !DILocation(line: 165, column: 8, scope: !993)
!997 = !DILocation(line: 165, column: 7, scope: !988)
!998 = !DILocation(line: 166, column: 11, scope: !993)
!999 = !DILocation(line: 166, column: 4, scope: !993)
!1000 = !DILocation(line: 167, column: 2, scope: !988)
!1001 = !DILocation(line: 163, column: 56, scope: !1002)
!1002 = !DILexicalBlockFile(scope: !985, file: !356, discriminator: 5)
!1003 = !DILocation(line: 163, column: 60, scope: !1002)
!1004 = !DILocation(line: 163, column: 53, scope: !1002)
!1005 = !DILocation(line: 163, column: 2, scope: !1002)
!1006 = distinct !{!1006, !1007}
!1007 = !DILocation(line: 163, column: 2, scope: !940)
!1008 = !DILocation(line: 168, column: 2, scope: !940)
!1009 = !DILocation(line: 169, column: 1, scope: !940)
!1010 = distinct !DISubprogram(name: "dump_track_script", scope: !356, file: !356, line: 173, type: !229, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !448)
!1011 = !DILocalVariable(name: "fp", arg: 1, scope: !1010, file: !356, line: 173, type: !231)
!1012 = !DILocation(line: 173, column: 25, scope: !1010)
!1013 = !DILocalVariable(name: "track_data", arg: 2, scope: !1010, file: !356, line: 173, type: !104)
!1014 = !DILocation(line: 173, column: 35, scope: !1010)
!1015 = !DILocalVariable(name: "tsc", scope: !1010, file: !356, line: 175, type: !284)
!1016 = !DILocation(line: 175, column: 16, scope: !1010)
!1017 = !DILocation(line: 175, column: 22, scope: !1010)
!1018 = !DILocation(line: 176, column: 13, scope: !1010)
!1019 = !DILocation(line: 176, column: 38, scope: !1010)
!1020 = !DILocation(line: 176, column: 43, scope: !1010)
!1021 = !DILocation(line: 176, column: 48, scope: !1010)
!1022 = !DILocation(line: 176, column: 55, scope: !1010)
!1023 = !DILocation(line: 176, column: 60, scope: !1010)
!1024 = !DILocation(line: 176, column: 2, scope: !1010)
!1025 = !DILocation(line: 177, column: 1, scope: !1010)
!1026 = distinct !DISubprogram(name: "free_track_script", scope: !356, file: !356, line: 180, type: !225, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !448)
!1027 = !DILocalVariable(name: "tsc", arg: 1, scope: !1026, file: !356, line: 180, type: !104)
!1028 = !DILocation(line: 180, column: 25, scope: !1026)
!1029 = !DILocation(line: 182, column: 8, scope: !1026)
!1030 = !DILocation(line: 182, column: 3, scope: !1026)
!1031 = !DILocation(line: 182, column: 20, scope: !1026)
!1032 = !DILocation(line: 183, column: 1, scope: !1026)
!1033 = distinct !DISubprogram(name: "alloc_track_script", scope: !356, file: !356, line: 186, type: !474, isLocal: false, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !448)
!1034 = !DILocalVariable(name: "vrrp", arg: 1, scope: !1033, file: !356, line: 186, type: !476)
!1035 = !DILocation(line: 186, column: 28, scope: !1033)
!1036 = !DILocalVariable(name: "strvec", arg: 2, scope: !1033, file: !356, line: 186, type: !491)
!1037 = !DILocation(line: 186, column: 44, scope: !1033)
!1038 = !DILocalVariable(name: "vsc", scope: !1033, file: !356, line: 188, type: !289)
!1039 = !DILocation(line: 188, column: 17, scope: !1033)
!1040 = !DILocalVariable(name: "tsc", scope: !1033, file: !356, line: 189, type: !284)
!1041 = !DILocation(line: 189, column: 16, scope: !1033)
!1042 = !DILocalVariable(name: "weight", scope: !1033, file: !356, line: 190, type: !112)
!1043 = !DILocation(line: 190, column: 6, scope: !1033)
!1044 = !DILocalVariable(name: "tracked", scope: !1033, file: !356, line: 191, type: !105)
!1045 = !DILocation(line: 191, column: 8, scope: !1033)
!1046 = !DILocation(line: 191, column: 30, scope: !1033)
!1047 = !DILocation(line: 191, column: 18, scope: !1033)
!1048 = !DILocalVariable(name: "e", scope: !1033, file: !356, line: 192, type: !659)
!1049 = !DILocation(line: 192, column: 10, scope: !1033)
!1050 = !DILocalVariable(name: "etsc", scope: !1033, file: !356, line: 193, type: !284)
!1051 = !DILocation(line: 193, column: 16, scope: !1033)
!1052 = !DILocation(line: 195, column: 28, scope: !1033)
!1053 = !DILocation(line: 195, column: 8, scope: !1033)
!1054 = !DILocation(line: 195, column: 6, scope: !1033)
!1055 = !DILocation(line: 198, column: 7, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1033, file: !356, line: 198, column: 6)
!1057 = !DILocation(line: 198, column: 6, scope: !1033)
!1058 = !DILocation(line: 199, column: 92, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1056, file: !356, line: 198, column: 12)
!1060 = !DILocation(line: 199, column: 98, scope: !1059)
!1061 = !DILocation(line: 199, column: 105, scope: !1059)
!1062 = !DILocation(line: 199, column: 3, scope: !1059)
!1063 = !DILocation(line: 200, column: 3, scope: !1059)
!1064 = !DILocation(line: 203, column: 9, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1033, file: !356, line: 203, column: 6)
!1066 = !DILocation(line: 203, column: 15, scope: !1065)
!1067 = !DILocation(line: 203, column: 29, scope: !1065)
!1068 = !DILocation(line: 203, column: 6, scope: !1065)
!1069 = !DILocation(line: 203, column: 11, scope: !1070)
!1070 = !DILexicalBlockFile(scope: !1065, file: !356, discriminator: 1)
!1071 = !DILocation(line: 203, column: 17, scope: !1070)
!1072 = !DILocation(line: 203, column: 32, scope: !1070)
!1073 = !DILocation(line: 203, column: 37, scope: !1070)
!1074 = !DILocation(line: 203, column: 6, scope: !1070)
!1075 = !DILocation(line: 203, column: 10, scope: !1076)
!1076 = !DILexicalBlockFile(scope: !1065, file: !356, discriminator: 2)
!1077 = !DILocation(line: 203, column: 16, scope: !1076)
!1078 = !DILocation(line: 203, column: 31, scope: !1076)
!1079 = !DILocation(line: 203, column: 36, scope: !1076)
!1080 = !DILocation(line: 203, column: 6, scope: !1076)
!1081 = !DILocation(line: 205, column: 15, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !356, line: 205, column: 3)
!1083 = distinct !DILexicalBlock(scope: !1065, file: !356, line: 203, column: 10)
!1084 = !DILocation(line: 205, column: 21, scope: !1082)
!1085 = !DILocation(line: 205, column: 14, scope: !1082)
!1086 = !DILocation(line: 205, column: 13, scope: !1082)
!1087 = !DILocation(line: 205, column: 13, scope: !1088)
!1088 = !DILexicalBlockFile(scope: !1082, file: !356, discriminator: 1)
!1089 = !DILocation(line: 205, column: 14, scope: !1090)
!1090 = !DILexicalBlockFile(scope: !1082, file: !356, discriminator: 2)
!1091 = !DILocation(line: 205, column: 20, scope: !1090)
!1092 = !DILocation(line: 205, column: 35, scope: !1090)
!1093 = !DILocation(line: 205, column: 13, scope: !1090)
!1094 = !DILocation(line: 205, column: 13, scope: !1095)
!1095 = !DILexicalBlockFile(scope: !1082, file: !356, discriminator: 3)
!1096 = !DILocation(line: 205, column: 10, scope: !1095)
!1097 = !DILocation(line: 205, column: 8, scope: !1095)
!1098 = !DILocation(line: 205, column: 42, scope: !1099)
!1099 = !DILexicalBlockFile(scope: !1100, file: !356, discriminator: 4)
!1100 = distinct !DILexicalBlock(scope: !1082, file: !356, line: 205, column: 3)
!1101 = !DILocation(line: 205, column: 3, scope: !1099)
!1102 = !DILocation(line: 206, column: 13, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1100, file: !356, line: 205, column: 64)
!1104 = !DILocation(line: 206, column: 17, scope: !1103)
!1105 = !DILocation(line: 206, column: 11, scope: !1103)
