; ModuleID = './[inter]keepalived--vrrp--vrrp_vmac.o.i'
source_filename = "./[inter]keepalived--vrrp--vrrp_vmac.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._nl_handle = type { %struct.nl_sock*, i32, i32, i32, %struct._thread* }
%struct.nl_sock = type opaque
%struct._thread = type { i64, i32, %struct._thread_master*, i32 (%struct._thread*)*, i8*, %struct.timeval, %union.anon.2, %struct._thread_event*, %union.anon.4 }
%struct._thread_master = type { %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.list_head, %struct.list_head, %struct.list_head, %struct._list*, %struct.rb_root, %struct.epoll_event*, %struct._thread_event*, i32, i32, i32, i32, %struct._thread*, i64, i64, i8 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.rb_root = type { %struct.rb_node* }
%struct.rb_node = type { i64, %struct.rb_node*, %struct.rb_node* }
%struct.epoll_event = type opaque
%struct.timeval = type { i64, i64 }

!130 = !DIEnumerator(name: "IFLA_EXT_MASK", value: 29)
!131 = !DIEnumerator(name: "IFLA_PROMISCUITY", value: 30)
!132 = !DIEnumerator(name: "IFLA_NUM_TX_QUEUES", value: 31)
!133 = !DIEnumerator(name: "IFLA_NUM_RX_QUEUES", value: 32)
!134 = !DIEnumerator(name: "IFLA_CARRIER", value: 33)
!135 = !DIEnumerator(name: "IFLA_PHYS_PORT_ID", value: 34)
!136 = !DIEnumerator(name: "IFLA_CARRIER_CHANGES", value: 35)
!137 = !DIEnumerator(name: "IFLA_PHYS_SWITCH_ID", value: 36)
!138 = !DIEnumerator(name: "IFLA_LINK_NETNSID", value: 37)
!139 = !DIEnumerator(name: "IFLA_PHYS_PORT_NAME", value: 38)
!140 = !DIEnumerator(name: "IFLA_PROTO_DOWN", value: 39)
!141 = !DIEnumerator(name: "__IFLA_MAX", value: 40)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !99, line: 317, size: 32, align: 32, elements: !143)
!143 = !{!144, !145, !146, !147, !148, !149, !150}
!144 = !DIEnumerator(name: "IFLA_INFO_UNSPEC", value: 0)
!145 = !DIEnumerator(name: "IFLA_INFO_KIND", value: 1)
!146 = !DIEnumerator(name: "IFLA_INFO_DATA", value: 2)
!147 = !DIEnumerator(name: "IFLA_INFO_XSTATS", value: 3)
!148 = !DIEnumerator(name: "IFLA_INFO_SLAVE_KIND", value: 4)
!149 = !DIEnumerator(name: "IFLA_INFO_SLAVE_DATA", value: 5)
!150 = !DIEnumerator(name: "__IFLA_INFO_MAX", value: 6)
!151 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !99, line: 362, size: 32, align: 32, elements: !152)
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160}
!153 = !DIEnumerator(name: "IFLA_MACVLAN_UNSPEC", value: 0)
!154 = !DIEnumerator(name: "IFLA_MACVLAN_MODE", value: 1)
!155 = !DIEnumerator(name: "IFLA_MACVLAN_FLAGS", value: 2)
!156 = !DIEnumerator(name: "IFLA_MACVLAN_MACADDR_MODE", value: 3)
!157 = !DIEnumerator(name: "IFLA_MACVLAN_MACADDR", value: 4)
!158 = !DIEnumerator(name: "IFLA_MACVLAN_MACADDR_DATA", value: 5)
!159 = !DIEnumerator(name: "IFLA_MACVLAN_MACADDR_COUNT", value: 6)
!160 = !DIEnumerator(name: "__IFLA_MACVLAN_MAX", value: 7)
!161 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "macvlan_mode", file: !99, line: 375, size: 32, align: 32, elements: !162)
!162 = !{!163, !164, !165, !166, !167}
!163 = !DIEnumerator(name: "MACVLAN_MODE_PRIVATE", value: 1)
!164 = !DIEnumerator(name: "MACVLAN_MODE_VEPA", value: 2)
!165 = !DIEnumerator(name: "MACVLAN_MODE_BRIDGE", value: 4)
!166 = !DIEnumerator(name: "MACVLAN_MODE_PASSTHRU", value: 8)
!167 = !DIEnumerator(name: "MACVLAN_MODE_SOURCE", value: 16)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !99, line: 200, size: 32, align: 32, elements: !169)
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178, !179}
!170 = !DIEnumerator(name: "IFLA_INET6_UNSPEC", value: 0)
!171 = !DIEnumerator(name: "IFLA_INET6_FLAGS", value: 1)
!172 = !DIEnumerator(name: "IFLA_INET6_CONF", value: 2)
!173 = !DIEnumerator(name: "IFLA_INET6_STATS", value: 3)
!174 = !DIEnumerator(name: "IFLA_INET6_MCAST", value: 4)
!175 = !DIEnumerator(name: "IFLA_INET6_CACHEINFO", value: 5)
!176 = !DIEnumerator(name: "IFLA_INET6_ICMP6STATS", value: 6)
!177 = !DIEnumerator(name: "IFLA_INET6_TOKEN", value: 7)
!178 = !DIEnumerator(name: "IFLA_INET6_ADDR_GEN_MODE", value: 8)
!179 = !DIEnumerator(name: "__IFLA_INET6_MAX", value: 9)
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "in6_addr_gen_mode", file: !99, line: 215, size: 32, align: 32, elements: !181)
!181 = !{!182, !183, !184}
!182 = !DIEnumerator(name: "IN6_ADDR_GEN_MODE_EUI64", value: 0)
!183 = !DIEnumerator(name: "IN6_ADDR_GEN_MODE_NONE", value: 1)
!184 = !DIEnumerator(name: "IN6_ADDR_GEN_MODE_STABLE_PRIVACY", value: 2)
!185 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !186, line: 42, size: 32, align: 32, elements: !187)
!186 = !DIFile(filename: "/usr/include/net/if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!187 = !{!188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203}
!188 = !DIEnumerator(name: "IFF_UP", value: 1)
!189 = !DIEnumerator(name: "IFF_BROADCAST", value: 2)
!190 = !DIEnumerator(name: "IFF_DEBUG", value: 4)
!191 = !DIEnumerator(name: "IFF_LOOPBACK", value: 8)
!192 = !DIEnumerator(name: "IFF_POINTOPOINT", value: 16)
!193 = !DIEnumerator(name: "IFF_NOTRAILERS", value: 32)
!194 = !DIEnumerator(name: "IFF_RUNNING", value: 64)
!195 = !DIEnumerator(name: "IFF_NOARP", value: 128)
!196 = !DIEnumerator(name: "IFF_PROMISC", value: 256)
!197 = !DIEnumerator(name: "IFF_ALLMULTI", value: 512)
!198 = !DIEnumerator(name: "IFF_MASTER", value: 1024)
!199 = !DIEnumerator(name: "IFF_SLAVE", value: 2048)
!200 = !DIEnumerator(name: "IFF_MULTICAST", value: 4096)
!201 = !DIEnumerator(name: "IFF_PORTSEL", value: 8192)
!202 = !DIEnumerator(name: "IFF_AUTOMEDIA", value: 16384)
!203 = !DIEnumerator(name: "IFF_DYNAMIC", value: 32768)
!204 = !{!205, !207, !208, !209, !210, !245, !246}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!207 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!209 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !212, line: 254, size: 224, align: 32, elements: !213)
!212 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!213 = !{!214, !217, !221, !224, !244}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !211, file: !212, line: 256, baseType: !215, size: 16, align: 16)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !216, line: 28, baseType: !209)
!216 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !211, file: !212, line: 257, baseType: !218, size: 16, align: 16, offset: 16)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !212, line: 119, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !220, line: 49, baseType: !209)
!220 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!221 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !211, file: !212, line: 258, baseType: !222, size: 32, align: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !220, line: 51, baseType: !223)
!223 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !211, file: !212, line: 259, baseType: !225, size: 128, align: 32, offset: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !212, line: 211, size: 128, align: 32, elements: !226)
!226 = !{!227}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !225, file: !212, line: 220, baseType: !228, size: 128, align: 32)
!228 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !225, file: !212, line: 213, size: 128, align: 32, elements: !229)
!229 = !{!230, !236, !240}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !228, file: !212, line: 215, baseType: !231, size: 128, align: 8)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 128, align: 8, elements: !234)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !220, line: 48, baseType: !233)
!233 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!234 = !{!235}
!235 = !DISubrange(count: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !228, file: !212, line: 217, baseType: !237, size: 128, align: 16)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 128, align: 16, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 8)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !228, file: !212, line: 218, baseType: !241, size: 128, align: 32)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 128, align: 32, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 4)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !211, file: !212, line: 260, baseType: !222, size: 32, align: 32, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !212, line: 31, size: 32, align: 32, elements: !248)
!248 = !{!249}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !247, file: !212, line: 33, baseType: !250, size: 32, align: 32)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !212, line: 30, baseType: !222)
!251 = !{!252, !258, !266}
!252 = distinct !DIGlobalVariable(name: "macvlan_ll_kind", scope: !0, file: !253, line: 41, type: !254, isLocal: false, isDefinition: true, variable: i8** @macvlan_ll_kind)
!253 = !DIFile(filename: "vrrp_vmac.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!257 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!258 = distinct !DIGlobalVariable(name: "ll_addr", scope: !0, file: !253, line: 42, type: !259, isLocal: false, isDefinition: true, variable: [6 x i8]* @ll_addr)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 48, align: 8, elements: !264)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !261, line: 33, baseType: !262)
!261 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !263, line: 30, baseType: !233)
!263 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!264 = !{!265}
!265 = !DISubrange(count: 6)
!266 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !39, line: 150, type: !267, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !268, line: 31, baseType: !269)
!268 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !268, line: 39, size: 320, align: 64, elements: !271)
!271 = !{!272, !279, !280, !281, !285}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !270, file: !268, line: 40, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !268, line: 33, size: 192, align: 64, elements: !275)
!275 = !{!276, !277, !278}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !268, line: 34, baseType: !273, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !274, file: !268, line: 35, baseType: !273, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !274, file: !268, line: 36, baseType: !208, size: 64, align: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !270, file: !268, line: 41, baseType: !273, size: 64, align: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !270, file: !268, line: 42, baseType: !223, size: 32, align: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !270, file: !268, line: 43, baseType: !282, size: 64, align: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !208}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !270, file: !268, line: 44, baseType: !286, size: 64, align: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !289, !208}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !291, line: 48, baseType: !292)
!291 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !293, line: 241, size: 1728, align: 64, elements: !294)
!293 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!294 = !{!295, !296, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !316, !317, !318, !319, !322, !323, !325, !329, !332, !334, !335, !336, !337, !338, !342, !343}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !292, file: !293, line: 242, baseType: !207, size: 32, align: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !292, file: !293, line: 247, baseType: !297, size: 64, align: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !292, file: !293, line: 248, baseType: !297, size: 64, align: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !292, file: !293, line: 249, baseType: !297, size: 64, align: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !292, file: !293, line: 250, baseType: !297, size: 64, align: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !292, file: !293, line: 251, baseType: !297, size: 64, align: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !292, file: !293, line: 252, baseType: !297, size: 64, align: 64, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !292, file: !293, line: 253, baseType: !297, size: 64, align: 64, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !292, file: !293, line: 254, baseType: !297, size: 64, align: 64, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !292, file: !293, line: 256, baseType: !297, size: 64, align: 64, offset: 576)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !292, file: !293, line: 257, baseType: !297, size: 64, align: 64, offset: 640)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !292, file: !293, line: 258, baseType: !297, size: 64, align: 64, offset: 704)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !292, file: !293, line: 260, baseType: !309, size: 64, align: 64, offset: 768)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !293, line: 156, size: 192, align: 64, elements: !311)
!311 = !{!312, !313, !315}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !310, file: !293, line: 157, baseType: !309, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !310, file: !293, line: 158, baseType: !314, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !310, file: !293, line: 162, baseType: !207, size: 32, align: 32, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !292, file: !293, line: 262, baseType: !314, size: 64, align: 64, offset: 832)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !292, file: !293, line: 264, baseType: !207, size: 32, align: 32, offset: 896)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !292, file: !293, line: 268, baseType: !207, size: 32, align: 32, offset: 928)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !292, file: !293, line: 270, baseType: !320, size: 64, align: 64, offset: 960)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !263, line: 131, baseType: !321)
!321 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !292, file: !293, line: 274, baseType: !209, size: 16, align: 16, offset: 1024)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !292, file: !293, line: 275, baseType: !324, size: 8, align: 8, offset: 1040)
!324 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !292, file: !293, line: 276, baseType: !326, size: 8, align: 8, offset: 1048)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 8, align: 8, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 1)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !292, file: !293, line: 280, baseType: !330, size: 64, align: 64, offset: 1088)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !293, line: 150, baseType: null)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !292, file: !293, line: 289, baseType: !333, size: 64, align: 64, offset: 1152)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !263, line: 132, baseType: !321)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !292, file: !293, line: 297, baseType: !208, size: 64, align: 64, offset: 1216)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !292, file: !293, line: 298, baseType: !208, size: 64, align: 64, offset: 1280)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !292, file: !293, line: 299, baseType: !208, size: 64, align: 64, offset: 1344)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !292, file: !293, line: 300, baseType: !208, size: 64, align: 64, offset: 1408)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !292, file: !293, line: 302, baseType: !339, size: 64, align: 64, offset: 1472)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !340, line: 216, baseType: !341)
!340 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!341 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !292, file: !293, line: 303, baseType: !207, size: 32, align: 32, offset: 1536)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !292, file: !293, line: 305, baseType: !344, size: 160, align: 8, offset: 1568)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 160, align: 8, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 20)
!347 = !{i32 2, !"Dwarf Version", i32 4}
!348 = !{i32 2, !"Debug Info Version", i32 3}
!349 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!350 = distinct !DISubprogram(name: "add_link_local_address", scope: !253, file: !253, line: 62, type: !351, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !411)
!351 = !DISubroutineType(types: !352)
!352 = !{!353, !354, !245}
!353 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !39, line: 111, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !39, line: 76, size: 1792, align: 64, elements: !357)
!357 = !{!358, !360, !362, !363, !364, !365, !366, !367, !368, !372, !373, !374, !375, !376, !377, !379, !380, !381, !382, !403, !404, !405, !406, !407, !408, !409, !410}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !356, file: !39, line: 77, baseType: !359, size: 128, align: 8)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 128, align: 8, elements: !234)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !356, file: !39, line: 78, baseType: !361, size: 32, align: 32, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !39, line: 62, baseType: !222)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !356, file: !39, line: 79, baseType: !247, size: 32, align: 32, offset: 160)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !356, file: !39, line: 80, baseType: !225, size: 128, align: 32, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !356, file: !39, line: 81, baseType: !223, size: 32, align: 32, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !356, file: !39, line: 82, baseType: !353, size: 8, align: 8, offset: 352)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !356, file: !39, line: 83, baseType: !222, size: 32, align: 32, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !356, file: !39, line: 84, baseType: !209, size: 16, align: 16, offset: 416)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !356, file: !39, line: 85, baseType: !369, size: 256, align: 8, offset: 432)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 256, align: 8, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !356, file: !39, line: 86, baseType: !369, size: 256, align: 8, offset: 688)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !356, file: !39, line: 87, baseType: !339, size: 64, align: 64, offset: 960)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !356, file: !39, line: 88, baseType: !207, size: 32, align: 32, offset: 1024)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !356, file: !39, line: 90, baseType: !353, size: 8, align: 8, offset: 1056)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !356, file: !39, line: 91, baseType: !361, size: 32, align: 32, offset: 1088)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !356, file: !39, line: 92, baseType: !378, size: 64, align: 64, offset: 1152)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !356, file: !39, line: 94, baseType: !361, size: 32, align: 32, offset: 1216)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !356, file: !39, line: 96, baseType: !378, size: 64, align: 64, offset: 1280)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !356, file: !39, line: 97, baseType: !353, size: 8, align: 8, offset: 1344)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !356, file: !39, line: 100, baseType: !383, size: 64, align: 64, offset: 1408)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !39, line: 73, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !39, line: 65, size: 704, align: 64, elements: !386)
!386 = !{!387, !397, !398, !399, !400, !401, !402}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !385, file: !39, line: 66, baseType: !388, size: 128, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !389, line: 31, baseType: !390)
!389 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !391, line: 30, size: 128, align: 64, elements: !392)
!391 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!392 = !{!393, !395}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !390, file: !391, line: 32, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !263, line: 139, baseType: !321)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !390, file: !391, line: 33, baseType: !396, size: 64, align: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !263, line: 141, baseType: !321)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !385, file: !39, line: 67, baseType: !353, size: 8, align: 8, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !385, file: !39, line: 68, baseType: !388, size: 128, align: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !385, file: !39, line: 69, baseType: !353, size: 8, align: 8, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !385, file: !39, line: 70, baseType: !388, size: 128, align: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !385, file: !39, line: 71, baseType: !388, size: 128, align: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !385, file: !39, line: 72, baseType: !207, size: 32, align: 32, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !356, file: !39, line: 101, baseType: !353, size: 8, align: 8, offset: 1472)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !356, file: !39, line: 102, baseType: !207, size: 32, align: 32, offset: 1504)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !356, file: !39, line: 103, baseType: !222, size: 32, align: 32, offset: 1536)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !356, file: !39, line: 104, baseType: !222, size: 32, align: 32, offset: 1568)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !356, file: !39, line: 105, baseType: !222, size: 32, align: 32, offset: 1600)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !356, file: !39, line: 107, baseType: !223, size: 32, align: 32, offset: 1632)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !356, file: !39, line: 109, baseType: !353, size: 8, align: 8, offset: 1664)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !356, file: !39, line: 110, baseType: !267, size: 64, align: 64, offset: 1728)
!411 = !{}
!412 = !DILocalVariable(name: "ifp", arg: 1, scope: !350, file: !253, line: 62, type: !354)
!413 = !DIExpression()
!414 = !DILocation(line: 62, column: 37, scope: !350)
!415 = !DILocalVariable(name: "sin6_addr", arg: 2, scope: !350, file: !253, line: 62, type: !245)
!416 = !DILocation(line: 62, column: 59, scope: !350)
!417 = !DILocalVariable(name: "ipaddress", scope: !350, file: !253, line: 64, type: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_address_t", file: !419, line: 73, baseType: !420)
!419 = !DIFile(filename: "./../include/vrrp_ipaddress.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_address", file: !419, line: 41, size: 704, align: 64, elements: !421)
!421 = !{!422, !434, !443, !444, !445, !446, !447, !448, !453, !454, !472, !473, !474}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ifa", scope: !420, file: !419, line: 42, baseType: !423, size: 64, align: 32)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifaddrmsg", file: !424, line: 7, size: 64, align: 32, elements: !425)
!424 = !DIFile(filename: "/usr/include/linux/if_addr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!425 = !{!426, !429, !430, !431, !432}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_family", scope: !423, file: !424, line: 8, baseType: !427, size: 8, align: 8)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !428, line: 20, baseType: !233)
!428 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_prefixlen", scope: !423, file: !424, line: 9, baseType: !427, size: 8, align: 8, offset: 8)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_flags", scope: !423, file: !424, line: 10, baseType: !427, size: 8, align: 8, offset: 16)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_scope", scope: !423, file: !424, line: 11, baseType: !427, size: 8, align: 8, offset: 24)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_index", scope: !423, file: !424, line: 12, baseType: !433, size: 32, align: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !428, line: 26, baseType: !223)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !420, file: !419, line: 50, baseType: !435, size: 128, align: 32, offset: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !420, file: !419, line: 44, size: 128, align: 32, elements: !436)
!436 = !{!437, !442}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !435, file: !419, line: 48, baseType: !438, size: 64, align: 32)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !435, file: !419, line: 45, size: 64, align: 32, elements: !439)
!439 = !{!440, !441}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !438, file: !419, line: 46, baseType: !247, size: 32, align: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sin_brd", scope: !438, file: !419, line: 47, baseType: !247, size: 32, align: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !435, file: !419, line: 49, baseType: !225, size: 128, align: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !420, file: !419, line: 52, baseType: !354, size: 64, align: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !420, file: !419, line: 53, baseType: !297, size: 64, align: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !420, file: !419, line: 55, baseType: !222, size: 32, align: 32, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "flagmask", scope: !420, file: !419, line: 56, baseType: !222, size: 32, align: 32, offset: 352)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "have_peer", scope: !420, file: !419, line: 61, baseType: !353, size: 8, align: 8, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !420, file: !419, line: 65, baseType: !449, size: 128, align: 32, offset: 416)
!449 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !420, file: !419, line: 62, size: 128, align: 32, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !449, file: !419, line: 63, baseType: !247, size: 32, align: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !449, file: !419, line: 64, baseType: !225, size: 128, align: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track", scope: !420, file: !419, line: 66, baseType: !353, size: 8, align: 8, offset: 544)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "track_group", scope: !420, file: !419, line: 67, baseType: !455, size: 64, align: 64, offset: 576)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "static_track_group_t", file: !457, line: 39, baseType: !458)
!457 = !DIFile(filename: "./../include/vrrp_static_track.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_track_group", file: !457, line: 35, size: 192, align: 64, elements: !459)
!459 = !{!460, !461, !471}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !458, file: !457, line: 36, baseType: !297, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !458, file: !457, line: 37, baseType: !462, size: 64, align: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !464, line: 34, baseType: !465)
!464 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !464, line: 30, size: 128, align: 64, elements: !466)
!466 = !{!467, !468, !469}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !465, file: !464, line: 31, baseType: !223, size: 32, align: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !465, file: !464, line: 32, baseType: !223, size: 32, align: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !465, file: !464, line: 33, baseType: !470, size: 64, align: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !458, file: !457, line: 38, baseType: !267, size: 64, align: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !420, file: !419, line: 69, baseType: !353, size: 8, align: 8, offset: 640)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rule_set", scope: !420, file: !419, line: 70, baseType: !353, size: 8, align: 8, offset: 648)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "garp_gna_pending", scope: !420, file: !419, line: 72, baseType: !353, size: 8, align: 8, offset: 656)
!475 = !DILocation(line: 64, column: 15, scope: !350)
!476 = !DILocation(line: 66, column: 2, scope: !350)
!477 = !DILocation(line: 69, column: 18, scope: !350)
!478 = !DILocation(line: 69, column: 12, scope: !350)
!479 = !DILocation(line: 69, column: 16, scope: !350)
!480 = !DILocation(line: 70, column: 12, scope: !350)
!481 = !DILocation(line: 70, column: 14, scope: !350)
!482 = !DILocation(line: 70, column: 27, scope: !350)
!483 = !DILocation(line: 70, column: 26, scope: !350)
!484 = !DILocation(line: 72, column: 12, scope: !350)
!485 = !DILocation(line: 72, column: 16, scope: !350)
!486 = !DILocation(line: 72, column: 27, scope: !350)
!487 = !DILocation(line: 73, column: 12, scope: !350)
!488 = !DILocation(line: 73, column: 16, scope: !350)
!489 = !DILocation(line: 73, column: 30, scope: !350)
!490 = !DILocation(line: 74, column: 28, scope: !350)
!491 = !DILocation(line: 74, column: 33, scope: !350)
!492 = !DILocation(line: 74, column: 12, scope: !350)
!493 = !DILocation(line: 74, column: 16, scope: !350)
!494 = !DILocation(line: 74, column: 26, scope: !350)
!495 = !DILocation(line: 76, column: 6, scope: !496)
!496 = distinct !DILexicalBlock(scope: !350, file: !253, line: 76, column: 6)
!497 = !DILocation(line: 76, column: 39, scope: !496)
!498 = !DILocation(line: 76, column: 6, scope: !350)
!499 = !DILocation(line: 77, column: 3, scope: !500)
!500 = distinct !DILexicalBlock(scope: !496, file: !253, line: 76, column: 45)
!501 = !DILocation(line: 78, column: 3, scope: !500)
!502 = !DILocation(line: 78, column: 8, scope: !500)
!503 = !DILocation(line: 78, column: 17, scope: !500)
!504 = !DILocation(line: 78, column: 25, scope: !500)
!505 = !DILocation(line: 78, column: 30, scope: !500)
!506 = !DILocation(line: 80, column: 3, scope: !500)
!507 = !DILocation(line: 84, column: 2, scope: !350)
!508 = !DILocation(line: 84, column: 7, scope: !350)
!509 = !DILocation(line: 84, column: 29, scope: !350)
!510 = !DILocation(line: 84, column: 31, scope: !350)
!511 = !DILocation(line: 86, column: 2, scope: !350)
!512 = !DILocation(line: 87, column: 1, scope: !350)
!513 = distinct !DISubprogram(name: "replace_link_local_address", scope: !253, file: !253, line: 90, type: !514, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !411)
!514 = !DISubroutineType(types: !515)
!515 = !{!353, !354}
!516 = !DILocalVariable(name: "ifp", arg: 1, scope: !513, file: !253, line: 90, type: !354)
!517 = !DILocation(line: 90, column: 41, scope: !513)
!518 = !DILocalVariable(name: "ipaddress", scope: !513, file: !253, line: 92, type: !418)
!519 = !DILocation(line: 92, column: 15, scope: !513)
!520 = !DILocalVariable(name: "ipaddress_new", scope: !513, file: !253, line: 93, type: !225)
!521 = !DILocation(line: 93, column: 18, scope: !513)
!522 = !DILocation(line: 95, column: 2, scope: !513)
!523 = !DILocation(line: 98, column: 42, scope: !513)
!524 = !DILocation(line: 98, column: 47, scope: !513)
!525 = !DILocation(line: 98, column: 57, scope: !513)
!526 = !DILocation(line: 98, column: 2, scope: !513)
!527 = !DILocation(line: 101, column: 28, scope: !528)
!528 = distinct !DILexicalBlock(scope: !513, file: !253, line: 101, column: 6)
!529 = !DILocation(line: 101, column: 45, scope: !528)
!530 = !DILocation(line: 101, column: 50, scope: !528)
!531 = !DILocation(line: 101, column: 44, scope: !528)
!532 = !DILocation(line: 101, column: 6, scope: !528)
!533 = !DILocation(line: 101, column: 6, scope: !513)
!534 = !DILocation(line: 102, column: 3, scope: !528)
!535 = !DILocation(line: 105, column: 18, scope: !513)
!536 = !DILocation(line: 105, column: 12, scope: !513)
!537 = !DILocation(line: 105, column: 16, scope: !513)
!538 = !DILocation(line: 106, column: 12, scope: !513)
!539 = !DILocation(line: 106, column: 14, scope: !513)
!540 = !DILocation(line: 106, column: 26, scope: !513)
!541 = !DILocation(line: 106, column: 31, scope: !513)
!542 = !DILocation(line: 108, column: 12, scope: !513)
!543 = !DILocation(line: 108, column: 16, scope: !513)
!544 = !DILocation(line: 108, column: 27, scope: !513)
!545 = !DILocation(line: 109, column: 12, scope: !513)
!546 = !DILocation(line: 109, column: 16, scope: !513)
!547 = !DILocation(line: 109, column: 30, scope: !513)
!548 = !DILocation(line: 110, column: 28, scope: !513)
!549 = !DILocation(line: 110, column: 33, scope: !513)
!550 = !DILocation(line: 110, column: 12, scope: !513)
!551 = !DILocation(line: 110, column: 16, scope: !513)
!552 = !DILocation(line: 110, column: 26, scope: !513)
!553 = !DILocation(line: 112, column: 6, scope: !554)
!554 = distinct !DILexicalBlock(scope: !513, file: !253, line: 112, column: 6)
!555 = !DILocation(line: 112, column: 39, scope: !554)
!556 = !DILocation(line: 112, column: 6, scope: !513)
!557 = !DILocation(line: 113, column: 3, scope: !554)
!558 = !DILocation(line: 115, column: 3, scope: !554)
!559 = !DILocation(line: 115, column: 8, scope: !554)
!560 = !DILocation(line: 115, column: 17, scope: !554)
!561 = !DILocation(line: 115, column: 25, scope: !554)
!562 = !DILocation(line: 115, column: 30, scope: !554)
!563 = !DILocation(line: 117, column: 12, scope: !513)
!564 = !DILocation(line: 117, column: 14, scope: !513)
!565 = !DILocation(line: 117, column: 26, scope: !513)
!566 = !DILocation(line: 118, column: 6, scope: !567)
!567 = distinct !DILexicalBlock(scope: !513, file: !253, line: 118, column: 6)
!568 = !DILocation(line: 118, column: 39, scope: !567)
!569 = !DILocation(line: 118, column: 6, scope: !513)
!570 = !DILocation(line: 119, column: 3, scope: !571)
!571 = distinct !DILexicalBlock(scope: !567, file: !253, line: 118, column: 45)
!572 = !DILocation(line: 120, column: 3, scope: !571)
!573 = !DILocation(line: 120, column: 8, scope: !571)
!574 = !DILocation(line: 120, column: 17, scope: !571)
!575 = !DILocation(line: 120, column: 25, scope: !571)
!576 = !DILocation(line: 120, column: 30, scope: !571)
!577 = !DILocation(line: 122, column: 3, scope: !571)
!578 = !DILocation(line: 126, column: 2, scope: !513)
!579 = !DILocation(line: 126, column: 7, scope: !513)
!580 = !DILocation(line: 126, column: 29, scope: !513)
!581 = !DILocation(line: 126, column: 31, scope: !513)
!582 = !DILocation(line: 128, column: 2, scope: !513)
!583 = !DILocation(line: 129, column: 1, scope: !513)
!584 = distinct !DISubprogram(name: "make_link_local_address", scope: !253, file: !253, line: 45, type: !585, isLocal: true, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !411)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !245, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!589 = !DILocalVariable(name: "l3_addr", arg: 1, scope: !584, file: !253, line: 45, type: !245)
!590 = !DILocation(line: 45, column: 42, scope: !584)
!591 = !DILocalVariable(name: "ll_addr", arg: 2, scope: !584, file: !253, line: 45, type: !587)
!592 = !DILocation(line: 45, column: 65, scope: !584)
!593 = !DILocation(line: 47, column: 2, scope: !584)
!594 = !DILocation(line: 47, column: 10, scope: !584)
!595 = !DILocation(line: 47, column: 18, scope: !584)
!596 = !DILocation(line: 47, column: 21, scope: !584)
!597 = !DILocation(line: 48, column: 2, scope: !584)
!598 = !DILocation(line: 48, column: 10, scope: !584)
!599 = !DILocation(line: 48, column: 18, scope: !584)
!600 = !DILocation(line: 48, column: 21, scope: !584)
!601 = !DILocation(line: 49, column: 2, scope: !584)
!602 = !DILocation(line: 49, column: 10, scope: !584)
!603 = !DILocation(line: 49, column: 18, scope: !584)
!604 = !DILocation(line: 49, column: 23, scope: !584)
!605 = !DILocation(line: 50, column: 2, scope: !584)
!606 = !DILocation(line: 50, column: 10, scope: !584)
!607 = !DILocation(line: 50, column: 18, scope: !584)
!608 = !DILocation(line: 50, column: 23, scope: !584)
!609 = !DILocation(line: 51, column: 23, scope: !584)
!610 = !DILocation(line: 51, column: 34, scope: !584)
!611 = !DILocation(line: 51, column: 2, scope: !584)
!612 = !DILocation(line: 51, column: 10, scope: !584)
!613 = !DILocation(line: 51, column: 18, scope: !584)
!614 = !DILocation(line: 51, column: 21, scope: !584)
!615 = !DILocation(line: 52, column: 23, scope: !584)
!616 = !DILocation(line: 52, column: 2, scope: !584)
!617 = !DILocation(line: 52, column: 10, scope: !584)
!618 = !DILocation(line: 52, column: 18, scope: !584)
!619 = !DILocation(line: 52, column: 21, scope: !584)
!620 = !DILocation(line: 53, column: 24, scope: !584)
!621 = !DILocation(line: 53, column: 2, scope: !584)
!622 = !DILocation(line: 53, column: 10, scope: !584)
!623 = !DILocation(line: 53, column: 18, scope: !584)
!624 = !DILocation(line: 53, column: 22, scope: !584)
!625 = !DILocation(line: 54, column: 2, scope: !584)
!626 = !DILocation(line: 54, column: 10, scope: !584)
!627 = !DILocation(line: 54, column: 18, scope: !584)
!628 = !DILocation(line: 54, column: 22, scope: !584)
!629 = !DILocation(line: 55, column: 2, scope: !584)
!630 = !DILocation(line: 55, column: 10, scope: !584)
!631 = !DILocation(line: 55, column: 18, scope: !584)
!632 = !DILocation(line: 55, column: 22, scope: !584)
!633 = !DILocation(line: 56, column: 24, scope: !584)
!634 = !DILocation(line: 56, column: 2, scope: !584)
!635 = !DILocation(line: 56, column: 10, scope: !584)
!636 = !DILocation(line: 56, column: 18, scope: !584)
!637 = !DILocation(line: 56, column: 22, scope: !584)
!638 = !DILocation(line: 57, column: 24, scope: !584)
!639 = !DILocation(line: 57, column: 2, scope: !584)
!640 = !DILocation(line: 57, column: 10, scope: !584)
!641 = !DILocation(line: 57, column: 18, scope: !584)
!642 = !DILocation(line: 57, column: 22, scope: !584)
!643 = !DILocation(line: 58, column: 24, scope: !584)
!644 = !DILocation(line: 58, column: 2, scope: !584)
!645 = !DILocation(line: 58, column: 10, scope: !584)
!646 = !DILocation(line: 58, column: 18, scope: !584)
!647 = !DILocation(line: 58, column: 22, scope: !584)
!648 = !DILocation(line: 59, column: 1, scope: !584)
!649 = distinct !DISubprogram(name: "inaddr_equal", scope: !650, file: !650, line: 96, type: !651, isLocal: true, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !411)
!650 = !DIFile(filename: "../../lib/utils.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!651 = !DISubroutineType(types: !652)
!652 = !{!353, !215, !208, !208}
!653 = !DILocalVariable(name: "family", arg: 1, scope: !649, file: !650, line: 96, type: !215)
!654 = !DILocation(line: 96, column: 44, scope: !649)
!655 = !DILocalVariable(name: "addr1", arg: 2, scope: !649, file: !650, line: 96, type: !208)
!656 = !DILocation(line: 96, column: 58, scope: !649)
!657 = !DILocalVariable(name: "addr2", arg: 3, scope: !649, file: !650, line: 96, type: !208)
!658 = !DILocation(line: 96, column: 71, scope: !649)
!659 = !DILocation(line: 98, column: 6, scope: !660)
!660 = distinct !DILexicalBlock(scope: !649, file: !650, line: 98, column: 6)
!661 = !DILocation(line: 98, column: 13, scope: !660)
!662 = !DILocation(line: 98, column: 6, scope: !649)
!663 = !DILocalVariable(name: "a1", scope: !664, file: !650, line: 99, type: !245)
!664 = distinct !DILexicalBlock(scope: !660, file: !650, line: 98, column: 25)
!665 = !DILocation(line: 99, column: 20, scope: !664)
!666 = !DILocation(line: 99, column: 45, scope: !664)
!667 = !DILocation(line: 99, column: 25, scope: !664)
!668 = !DILocalVariable(name: "a2", scope: !664, file: !650, line: 100, type: !245)
!669 = !DILocation(line: 100, column: 20, scope: !664)
!670 = !DILocation(line: 100, column: 45, scope: !664)
!671 = !DILocation(line: 100, column: 25, scope: !664)
!672 = !DILocation(line: 102, column: 24, scope: !673)
!673 = distinct !DILexicalBlock(scope: !664, file: !650, line: 102, column: 7)
!674 = !DILocation(line: 102, column: 28, scope: !673)
!675 = !DILocation(line: 102, column: 7, scope: !673)
!676 = !DILocation(line: 102, column: 7, scope: !664)
!677 = !DILocation(line: 103, column: 4, scope: !673)
!678 = !DILocation(line: 104, column: 2, scope: !664)
!679 = !DILocation(line: 104, column: 13, scope: !680)
!680 = !DILexicalBlockFile(scope: !681, file: !650, discriminator: 1)
!681 = distinct !DILexicalBlock(scope: !660, file: !650, line: 104, column: 13)
!682 = !DILocation(line: 104, column: 20, scope: !680)
!683 = !DILocalVariable(name: "a1", scope: !684, file: !650, line: 105, type: !246)
!684 = distinct !DILexicalBlock(scope: !681, file: !650, line: 104, column: 31)
!685 = !DILocation(line: 105, column: 19, scope: !684)
!686 = !DILocation(line: 105, column: 43, scope: !684)
!687 = !DILocation(line: 105, column: 24, scope: !684)
!688 = !DILocalVariable(name: "a2", scope: !684, file: !650, line: 106, type: !246)
!689 = !DILocation(line: 106, column: 19, scope: !684)
!690 = !DILocation(line: 106, column: 43, scope: !684)
!691 = !DILocation(line: 106, column: 24, scope: !684)
!692 = !DILocation(line: 108, column: 7, scope: !693)
!693 = distinct !DILexicalBlock(scope: !684, file: !650, line: 108, column: 7)
!694 = !DILocation(line: 108, column: 11, scope: !693)
!695 = !DILocation(line: 108, column: 21, scope: !693)
!696 = !DILocation(line: 108, column: 25, scope: !693)
!697 = !DILocation(line: 108, column: 18, scope: !693)
!698 = !DILocation(line: 108, column: 7, scope: !684)
!699 = !DILocation(line: 109, column: 4, scope: !693)
!700 = !DILocation(line: 110, column: 2, scope: !684)
!701 = !DILocation(line: 112, column: 2, scope: !649)
!702 = !DILocation(line: 113, column: 1, scope: !649)
!703 = distinct !DISubprogram(name: "netlink_link_add_vmac", scope: !253, file: !253, line: 184, type: !704, isLocal: false, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !411)
!704 = !DISubroutineType(types: !705)
!705 = !{!353, !706}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_t", file: !4, line: 310, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_t", file: !4, line: 183, size: 7040, align: 64, elements: !709)
!709 = !{!710, !711, !712, !751, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !793, !794, !795, !796, !797, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !955, !962}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !708, file: !4, line: 184, baseType: !215, size: 16, align: 16)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !708, file: !4, line: 185, baseType: !297, size: 64, align: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !708, file: !4, line: 186, baseType: !713, size: 64, align: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_sgroup_t", file: !4, line: 133, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_sgroup", file: !4, line: 109, size: 1024, align: 64, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !745, !746, !747, !748, !749, !750}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !715, file: !4, line: 110, baseType: !297, size: 64, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !715, file: !4, line: 111, baseType: !462, size: 64, align: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !715, file: !4, line: 112, baseType: !267, size: 64, align: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_fault", scope: !715, file: !4, line: 113, baseType: !223, size: 32, align: 32, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_init", scope: !715, file: !4, line: 114, baseType: !223, size: 32, align: 32, offset: 224)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !715, file: !4, line: 115, baseType: !207, size: 32, align: 32, offset: 256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "sgroup_tracking_weight", scope: !715, file: !4, line: 116, baseType: !353, size: 8, align: 8, offset: 288)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !715, file: !4, line: 119, baseType: !267, size: 64, align: 64, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !715, file: !4, line: 120, baseType: !267, size: 64, align: 64, offset: 384)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !715, file: !4, line: 121, baseType: !267, size: 64, align: 64, offset: 448)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "track_bfd", scope: !715, file: !4, line: 122, baseType: !267, size: 64, align: 64, offset: 512)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !715, file: !4, line: 125, baseType: !353, size: 8, align: 8, offset: 576)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !715, file: !4, line: 126, baseType: !730, size: 64, align: 64, offset: 640)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !732, line: 65, baseType: !733)
!732 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !732, line: 59, size: 192, align: 64, elements: !734)
!734 = !{!735, !737, !738, !739, !742}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !733, file: !732, line: 60, baseType: !736, size: 64, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !733, file: !732, line: 61, baseType: !207, size: 32, align: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !733, file: !732, line: 62, baseType: !207, size: 32, align: 32, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !733, file: !732, line: 63, baseType: !740, size: 32, align: 32, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !261, line: 80, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !263, line: 125, baseType: !223)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !733, file: !732, line: 64, baseType: !743, size: 32, align: 32, offset: 160)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !261, line: 65, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !263, line: 126, baseType: !223)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !715, file: !4, line: 127, baseType: !730, size: 64, align: 64, offset: 704)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !715, file: !4, line: 128, baseType: !730, size: 64, align: 64, offset: 768)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !715, file: !4, line: 129, baseType: !730, size: 64, align: 64, offset: 832)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !715, file: !4, line: 130, baseType: !730, size: 64, align: 64, offset: 896)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !715, file: !4, line: 131, baseType: !207, size: 32, align: 32, offset: 960)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !715, file: !4, line: 132, baseType: !207, size: 32, align: 32, offset: 992)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !708, file: !4, line: 187, baseType: !752, size: 64, align: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_stats", file: !4, line: 169, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_stats", file: !4, line: 136, size: 768, align: 64, elements: !755)
!755 = !{!756, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "advert_rcvd", scope: !754, file: !4, line: 137, baseType: !757, size: 64, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !220, line: 55, baseType: !341)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "advert_sent", scope: !754, file: !4, line: 138, baseType: !222, size: 32, align: 32, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "become_master", scope: !754, file: !4, line: 140, baseType: !222, size: 32, align: 32, offset: 96)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "release_master", scope: !754, file: !4, line: 141, baseType: !222, size: 32, align: 32, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "packet_len_err", scope: !754, file: !4, line: 143, baseType: !757, size: 64, align: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "advert_interval_err", scope: !754, file: !4, line: 144, baseType: !757, size: 64, align: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl_err", scope: !754, file: !4, line: 145, baseType: !757, size: 64, align: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_type_rcvd", scope: !754, file: !4, line: 146, baseType: !757, size: 64, align: 64, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list_err", scope: !754, file: !4, line: 147, baseType: !757, size: 64, align: 64, offset: 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_authtype", scope: !754, file: !4, line: 149, baseType: !222, size: 32, align: 32, offset: 512)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "authtype_mismatch", scope: !754, file: !4, line: 151, baseType: !222, size: 32, align: 32, offset: 544)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "auth_failure", scope: !754, file: !4, line: 152, baseType: !222, size: 32, align: 32, offset: 576)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_rcvd", scope: !754, file: !4, line: 155, baseType: !757, size: 64, align: 64, offset: 640)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_sent", scope: !754, file: !4, line: 156, baseType: !757, size: 64, align: 64, offset: 704)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !708, file: !4, line: 188, baseType: !354, size: 64, align: 64, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track_primary", scope: !708, file: !4, line: 189, baseType: !353, size: 8, align: 8, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !708, file: !4, line: 190, baseType: !353, size: 8, align: 8, offset: 328)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "skip_check_adv_addr", scope: !708, file: !4, line: 191, baseType: !353, size: 8, align: 8, offset: 336)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "strict_mode", scope: !708, file: !4, line: 193, baseType: !223, size: 32, align: 32, offset: 352)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_flags", scope: !708, file: !4, line: 195, baseType: !341, size: 64, align: 64, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_ifname", scope: !708, file: !4, line: 196, baseType: !359, size: 128, align: 8, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !708, file: !4, line: 198, baseType: !267, size: 64, align: 64, offset: 576)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !708, file: !4, line: 199, baseType: !267, size: 64, align: 64, offset: 640)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !708, file: !4, line: 200, baseType: !267, size: 64, align: 64, offset: 704)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_if_fault", scope: !708, file: !4, line: 204, baseType: !223, size: 32, align: 32, offset: 768)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_init", scope: !708, file: !4, line: 205, baseType: !223, size: 32, align: 32, offset: 800)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !708, file: !4, line: 206, baseType: !784, size: 1024, align: 64, offset: 832)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !785, line: 166, size: 1024, align: 64, elements: !786)
!785 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!786 = !{!787, !788, !792}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !784, file: !785, line: 168, baseType: !215, size: 16, align: 16)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !784, file: !785, line: 169, baseType: !789, size: 944, align: 8, offset: 16)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 944, align: 8, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 118)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !784, file: !785, line: 170, baseType: !341, size: 64, align: 64, offset: 960)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "saddr_from_config", scope: !708, file: !4, line: 207, baseType: !353, size: 8, align: 8, offset: 1856)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "track_saddr", scope: !708, file: !4, line: 208, baseType: !353, size: 8, align: 8, offset: 1864)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_saddr", scope: !708, file: !4, line: 209, baseType: !784, size: 1024, align: 64, offset: 1920)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_peer", scope: !708, file: !4, line: 210, baseType: !267, size: 64, align: 64, offset: 2944)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_chksum_compat", scope: !708, file: !4, line: 212, baseType: !798, size: 32, align: 32, offset: 3008)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "chksum_compatibility_t", file: !4, line: 179, baseType: !3)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "master_saddr", scope: !708, file: !4, line: 214, baseType: !784, size: 1024, align: 64, offset: 3072)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "master_priority", scope: !708, file: !4, line: 215, baseType: !232, size: 8, align: 8, offset: 4096)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "last_transition", scope: !708, file: !4, line: 216, baseType: !388, size: 128, align: 64, offset: 4160)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !708, file: !4, line: 217, baseType: !223, size: 32, align: 32, offset: 4288)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh", scope: !708, file: !4, line: 218, baseType: !388, size: 128, align: 64, offset: 4352)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_timer", scope: !708, file: !4, line: 219, baseType: !388, size: 128, align: 64, offset: 4480)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "garp_rep", scope: !708, file: !4, line: 220, baseType: !223, size: 32, align: 32, offset: 4608)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_rep", scope: !708, file: !4, line: 221, baseType: !223, size: 32, align: 32, offset: 4640)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_delay", scope: !708, file: !4, line: 222, baseType: !223, size: 32, align: 32, offset: 4672)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "garp_pending", scope: !708, file: !4, line: 223, baseType: !353, size: 8, align: 8, offset: 4704)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "gna_pending", scope: !708, file: !4, line: 224, baseType: !353, size: 8, align: 8, offset: 4712)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_rep", scope: !708, file: !4, line: 225, baseType: !223, size: 32, align: 32, offset: 4736)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "lower_prio_no_advert", scope: !708, file: !4, line: 226, baseType: !223, size: 32, align: 32, offset: 4768)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "higher_prio_send_advert", scope: !708, file: !4, line: 227, baseType: !223, size: 32, align: 32, offset: 4800)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "vrid", scope: !708, file: !4, line: 228, baseType: !232, size: 8, align: 8, offset: 4832)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "base_priority", scope: !708, file: !4, line: 229, baseType: !232, size: 8, align: 8, offset: 4840)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "effective_priority", scope: !708, file: !4, line: 230, baseType: !232, size: 8, align: 8, offset: 4848)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "total_priority", scope: !708, file: !4, line: 231, baseType: !207, size: 32, align: 32, offset: 4864)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "vipset", scope: !708, file: !4, line: 233, baseType: !353, size: 8, align: 8, offset: 4896)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !708, file: !4, line: 234, baseType: !267, size: 64, align: 64, offset: 4928)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "evip", scope: !708, file: !4, line: 235, baseType: !267, size: 64, align: 64, offset: 4992)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries", scope: !708, file: !4, line: 239, baseType: !353, size: 8, align: 8, offset: 5056)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "evip_add_ipv6", scope: !708, file: !4, line: 240, baseType: !353, size: 8, align: 8, offset: 5064)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "vroutes", scope: !708, file: !4, line: 241, baseType: !267, size: 64, align: 64, offset: 5120)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "vrules", scope: !708, file: !4, line: 242, baseType: !267, size: 64, align: 64, offset: 5184)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "adver_int", scope: !708, file: !4, line: 243, baseType: !223, size: 32, align: 32, offset: 5248)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "master_adver_int", scope: !708, file: !4, line: 244, baseType: !223, size: 32, align: 32, offset: 5280)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !708, file: !4, line: 249, baseType: !223, size: 32, align: 32, offset: 5312)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_rx_buf_size", scope: !708, file: !4, line: 252, baseType: !339, size: 64, align: 64, offset: 5376)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rules_set", scope: !708, file: !4, line: 254, baseType: !353, size: 8, align: 8, offset: 5440)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "nopreempt", scope: !708, file: !4, line: 255, baseType: !353, size: 8, align: 8, offset: 5448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_delay", scope: !708, file: !4, line: 256, baseType: !341, size: 64, align: 64, offset: 5504)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_time", scope: !708, file: !4, line: 260, baseType: !388, size: 128, align: 64, offset: 5568)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !708, file: !4, line: 261, baseType: !207, size: 32, align: 32, offset: 5696)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "wantstate", scope: !708, file: !4, line: 265, baseType: !207, size: 32, align: 32, offset: 5728)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "reload_master", scope: !708, file: !4, line: 266, baseType: !353, size: 8, align: 8, offset: 5760)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "sockets", scope: !708, file: !4, line: 267, baseType: !836, size: 64, align: 64, offset: 5824)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64, align: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_t", file: !838, line: 50, baseType: !839)
!838 = !DIFile(filename: "./../include/vrrp_sock.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sock", file: !838, line: 40, size: 1344, align: 64, elements: !840)
!840 = !{!841, !842, !843, !844, !845, !846, !847, !848, !849}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !839, file: !838, line: 41, baseType: !215, size: 16, align: 16)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !839, file: !838, line: 42, baseType: !784, size: 1024, align: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !839, file: !838, line: 43, baseType: !207, size: 32, align: 32, offset: 1088)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !839, file: !838, line: 44, baseType: !361, size: 32, align: 32, offset: 1120)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "unicast", scope: !839, file: !838, line: 45, baseType: !353, size: 8, align: 8, offset: 1152)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "fd_in", scope: !839, file: !838, line: 46, baseType: !207, size: 32, align: 32, offset: 1184)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "fd_out", scope: !839, file: !838, line: 47, baseType: !207, size: 32, align: 32, offset: 1216)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_size", scope: !839, file: !838, line: 48, baseType: !207, size: 32, align: 32, offset: 1248)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !839, file: !838, line: 49, baseType: !850, size: 64, align: 64, offset: 1280)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64, align: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !12, line: 99, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !12, line: 78, size: 768, align: 64, elements: !853)
!853 = !{!854, !855, !857, !910, !915, !916, !917, !929, !931}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !852, file: !12, line: 79, baseType: !341, size: 64, align: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !852, file: !12, line: 80, baseType: !856, size: 32, align: 32, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !12, line: 63, baseType: !11)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !852, file: !12, line: 81, baseType: !858, size: 64, align: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64, align: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !12, line: 112, size: 1280, align: 64, elements: !860)
!860 = !{!861, !873, !874, !875, !876, !884, !885, !886, !887, !888, !891, !902, !903, !904, !905, !906, !907, !908, !909}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !859, file: !12, line: 113, baseType: !862, size: 64, align: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !863, line: 109, baseType: !864)
!863 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !863, line: 106, size: 64, align: 64, elements: !865)
!865 = !{!866}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !864, file: !863, line: 108, baseType: !867, size: 64, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64, align: 64)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !863, line: 97, size: 192, align: 64, elements: !869)
!869 = !{!870, !871, !872}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !868, file: !863, line: 99, baseType: !341, size: 64, align: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !868, file: !863, line: 102, baseType: !867, size: 64, align: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !868, file: !863, line: 103, baseType: !867, size: 64, align: 64, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !859, file: !12, line: 114, baseType: !862, size: 64, align: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !859, file: !12, line: 115, baseType: !862, size: 64, align: 64, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !859, file: !12, line: 116, baseType: !862, size: 64, align: 64, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !859, file: !12, line: 117, baseType: !877, size: 128, align: 64, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !878, line: 62, baseType: !879)
!878 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !878, line: 60, size: 128, align: 64, elements: !880)
!880 = !{!881, !883}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !879, file: !878, line: 61, baseType: !882, size: 64, align: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64, align: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !879, file: !878, line: 61, baseType: !882, size: 64, align: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !859, file: !12, line: 121, baseType: !877, size: 128, align: 64, offset: 384)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !859, file: !12, line: 122, baseType: !877, size: 128, align: 64, offset: 512)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !859, file: !12, line: 124, baseType: !267, size: 64, align: 64, offset: 640)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !859, file: !12, line: 127, baseType: !862, size: 64, align: 64, offset: 704)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !859, file: !12, line: 128, baseType: !889, size: 64, align: 64, offset: 768)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64, align: 64)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !12, line: 128, flags: DIFlagFwdDecl)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !859, file: !12, line: 129, baseType: !892, size: 64, align: 64, offset: 832)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !12, line: 109, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !12, line: 102, size: 448, align: 64, elements: !895)
!895 = !{!896, !897, !898, !899, !900}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !894, file: !12, line: 103, baseType: !850, size: 64, align: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !894, file: !12, line: 104, baseType: !850, size: 64, align: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !894, file: !12, line: 105, baseType: !341, size: 64, align: 64, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !894, file: !12, line: 106, baseType: !207, size: 32, align: 32, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !894, file: !12, line: 108, baseType: !901, size: 192, align: 64, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !863, line: 104, baseType: !868)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !859, file: !12, line: 130, baseType: !223, size: 32, align: 32, offset: 896)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !859, file: !12, line: 131, baseType: !223, size: 32, align: 32, offset: 928)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !859, file: !12, line: 132, baseType: !207, size: 32, align: 32, offset: 960)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !859, file: !12, line: 135, baseType: !207, size: 32, align: 32, offset: 992)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !859, file: !12, line: 136, baseType: !850, size: 64, align: 64, offset: 1024)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !859, file: !12, line: 146, baseType: !341, size: 64, align: 64, offset: 1088)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !859, file: !12, line: 147, baseType: !341, size: 64, align: 64, offset: 1152)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !859, file: !12, line: 148, baseType: !353, size: 8, align: 8, offset: 1216)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !852, file: !12, line: 82, baseType: !911, size: 64, align: 64, offset: 192)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!207, !914}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !852, file: !12, line: 83, baseType: !208, size: 64, align: 64, offset: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !852, file: !12, line: 84, baseType: !388, size: 128, align: 64, offset: 320)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !852, file: !12, line: 92, baseType: !918, size: 64, align: 32, offset: 448)
!918 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !852, file: !12, line: 85, size: 64, align: 32, elements: !919)
!919 = !{!920, !921, !922}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !918, file: !12, line: 86, baseType: !207, size: 32, align: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !918, file: !12, line: 87, baseType: !207, size: 32, align: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !918, file: !12, line: 91, baseType: !923, size: 64, align: 32)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !918, file: !12, line: 88, size: 64, align: 32, elements: !924)
!924 = !{!925, !928}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !923, file: !12, line: 89, baseType: !926, size: 32, align: 32)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !261, line: 98, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !263, line: 133, baseType: !207)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !923, file: !12, line: 90, baseType: !207, size: 32, align: 32, offset: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !852, file: !12, line: 93, baseType: !930, size: 64, align: 64, offset: 512)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, scope: !852, file: !12, line: 95, baseType: !932, size: 192, align: 64, offset: 576)
!932 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !852, file: !12, line: 95, size: 192, align: 64, elements: !933)
!933 = !{!934, !935}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !932, file: !12, line: 96, baseType: !901, size: 192, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !932, file: !12, line: 97, baseType: !877, size: 128, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !708, file: !4, line: 269, baseType: !207, size: 32, align: 32, offset: 5888)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !708, file: !4, line: 271, baseType: !207, size: 32, align: 32, offset: 5920)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !708, file: !4, line: 274, baseType: !207, size: 32, align: 32, offset: 5952)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !708, file: !4, line: 275, baseType: !207, size: 32, align: 32, offset: 5984)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !708, file: !4, line: 276, baseType: !353, size: 8, align: 8, offset: 6016)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !708, file: !4, line: 277, baseType: !730, size: 64, align: 64, offset: 6080)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !708, file: !4, line: 278, baseType: !730, size: 64, align: 64, offset: 6144)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !708, file: !4, line: 279, baseType: !730, size: 64, align: 64, offset: 6208)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !708, file: !4, line: 280, baseType: !730, size: 64, align: 64, offset: 6272)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "script_master_rx_lower_pri", scope: !708, file: !4, line: 281, baseType: !730, size: 64, align: 64, offset: 6336)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !708, file: !4, line: 282, baseType: !730, size: 64, align: 64, offset: 6400)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "ms_down_timer", scope: !708, file: !4, line: 285, baseType: !222, size: 32, align: 32, offset: 6464)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !708, file: !4, line: 286, baseType: !388, size: 128, align: 64, offset: 6528)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !708, file: !4, line: 289, baseType: !297, size: 64, align: 64, offset: 6656)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer_size", scope: !708, file: !4, line: 290, baseType: !339, size: 64, align: 64, offset: 6720)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_csum", scope: !708, file: !4, line: 291, baseType: !222, size: 32, align: 32, offset: 6784)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "auth_type", scope: !708, file: !4, line: 295, baseType: !232, size: 8, align: 8, offset: 6816)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "auth_data", scope: !708, file: !4, line: 296, baseType: !954, size: 64, align: 8, offset: 6824)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 64, align: 8, elements: !238)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ipsecah_counter", scope: !708, file: !4, line: 299, baseType: !956, size: 64, align: 32, offset: 6912)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_counter_t", file: !957, line: 58, baseType: !958)
!957 = !DIFile(filename: "./../include/vrrp_ipsecah.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seq_counter", file: !957, line: 55, size: 64, align: 32, elements: !959)
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !958, file: !957, line: 56, baseType: !353, size: 8, align: 8)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "seq_number", scope: !958, file: !957, line: 57, baseType: !222, size: 32, align: 32, offset: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !708, file: !4, line: 309, baseType: !207, size: 32, align: 32, offset: 6976)
!963 = !DILocalVariable(name: "vrrp", arg: 1, scope: !703, file: !253, line: 184, type: !706)
!964 = !DILocation(line: 184, column: 31, scope: !703)
!965 = !DILocalVariable(name: "linkinfo", scope: !703, file: !253, line: 186, type: !966)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtattr", file: !46, line: 156, size: 32, align: 16, elements: !968)
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "rta_len", scope: !967, file: !46, line: 157, baseType: !209, size: 16, align: 16)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "rta_type", scope: !967, file: !46, line: 158, baseType: !209, size: 16, align: 16, offset: 16)
!971 = !DILocation(line: 186, column: 17, scope: !703)
!972 = !DILocalVariable(name: "data", scope: !703, file: !253, line: 187, type: !966)
!973 = !DILocation(line: 187, column: 17, scope: !703)
!974 = !DILocalVariable(name: "ifp", scope: !703, file: !253, line: 188, type: !354)
!975 = !DILocation(line: 188, column: 15, scope: !703)
!976 = !DILocalVariable(name: "create_interface", scope: !703, file: !253, line: 189, type: !353)
!977 = !DILocation(line: 189, column: 6, scope: !703)
!978 = !DILocalVariable(name: "req", scope: !703, file: !253, line: 194, type: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !703, file: !253, line: 190, size: 2304, align: 32, elements: !980)
!980 = !{!981, !991, !1000}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !979, file: !253, line: 191, baseType: !982, size: 128, align: 32)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !983, line: 42, size: 128, align: 32, elements: !984)
!983 = !DIFile(filename: "/usr/include/linux/netlink.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!984 = !{!985, !986, !988, !989, !990}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !982, file: !983, line: 43, baseType: !433, size: 32, align: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !982, file: !983, line: 44, baseType: !987, size: 16, align: 16, offset: 32)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !428, line: 23, baseType: !209)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !982, file: !983, line: 45, baseType: !987, size: 16, align: 16, offset: 48)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !982, file: !983, line: 46, baseType: !433, size: 32, align: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !982, file: !983, line: 47, baseType: !433, size: 32, align: 32, offset: 96)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ifi", scope: !979, file: !253, line: 192, baseType: !992, size: 128, align: 32, offset: 128)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifinfomsg", file: !46, line: 474, size: 128, align: 32, elements: !993)
!993 = !{!994, !995, !996, !997, !998, !999}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_family", scope: !992, file: !46, line: 475, baseType: !233, size: 8, align: 8)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "__ifi_pad", scope: !992, file: !46, line: 476, baseType: !233, size: 8, align: 8, offset: 8)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_type", scope: !992, file: !46, line: 477, baseType: !209, size: 16, align: 16, offset: 16)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_index", scope: !992, file: !46, line: 478, baseType: !207, size: 32, align: 32, offset: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !992, file: !46, line: 479, baseType: !223, size: 32, align: 32, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_change", scope: !992, file: !46, line: 480, baseType: !223, size: 32, align: 32, offset: 96)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !979, file: !253, line: 193, baseType: !1001, size: 2048, align: 8, offset: 256)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 2048, align: 8, elements: !1002)
!1002 = !{!1003}
!1003 = !DISubrange(count: 256)
!1004 = !DILocation(line: 194, column: 4, scope: !703)
!1005 = !DILocation(line: 196, column: 7, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !703, file: !253, line: 196, column: 6)
!1007 = !DILocation(line: 196, column: 13, scope: !1006)
!1008 = !DILocation(line: 196, column: 17, scope: !1006)
!1009 = !DILocation(line: 196, column: 50, scope: !1010)
!1010 = !DILexicalBlockFile(scope: !1006, file: !253, discriminator: 1)
!1011 = !DILocation(line: 196, column: 56, scope: !1010)
!1012 = !DILocation(line: 196, column: 20, scope: !1010)
!1013 = !DILocation(line: 196, column: 68, scope: !1010)
!1014 = !DILocation(line: 196, column: 72, scope: !1015)
!1015 = !DILexicalBlockFile(scope: !1006, file: !253, discriminator: 2)
!1016 = !DILocation(line: 196, column: 78, scope: !1015)
!1017 = !DILocation(line: 196, column: 6, scope: !1015)
!1018 = !DILocation(line: 197, column: 3, scope: !1006)
!1019 = !DILocation(line: 199, column: 6, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !703, file: !253, line: 199, column: 6)
!1021 = !DILocation(line: 199, column: 12, scope: !1020)
!1022 = !DILocation(line: 199, column: 19, scope: !1020)
!1023 = !DILocation(line: 199, column: 6, scope: !703)
!1024 = !DILocation(line: 200, column: 22, scope: !1020)
!1025 = !DILocation(line: 200, column: 3, scope: !1020)
!1026 = !DILocation(line: 202, column: 22, scope: !1020)
!1027 = !DILocation(line: 204, column: 23, scope: !703)
!1028 = !DILocation(line: 204, column: 29, scope: !703)
!1029 = !DILocation(line: 204, column: 21, scope: !703)
!1030 = !DILocation(line: 206, column: 2, scope: !703)
!1031 = !DILocation(line: 212, column: 30, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !703, file: !253, line: 212, column: 6)
!1033 = !DILocation(line: 212, column: 36, scope: !1032)
!1034 = !DILocation(line: 212, column: 13, scope: !1032)
!1035 = !DILocation(line: 212, column: 11, scope: !1032)
!1036 = !DILocation(line: 212, column: 68, scope: !1032)
!1037 = !DILocation(line: 213, column: 7, scope: !1032)
!1038 = !DILocation(line: 213, column: 12, scope: !1032)
!1039 = !DILocation(line: 212, column: 6, scope: !1040)
!1040 = !DILexicalBlockFile(scope: !703, file: !253, discriminator: 1)
!1041 = !DILocation(line: 215, column: 30, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !253, line: 215, column: 7)
!1043 = distinct !DILexicalBlock(scope: !1032, file: !253, line: 213, column: 21)
!1044 = !DILocation(line: 215, column: 35, scope: !1042)
!1045 = !DILocation(line: 215, column: 8, scope: !1042)
!1046 = !DILocation(line: 215, column: 77, scope: !1042)
!1047 = !DILocation(line: 215, column: 82, scope: !1042)
!1048 = !DILocation(line: 216, column: 8, scope: !1042)
!1049 = !DILocation(line: 216, column: 13, scope: !1042)
!1050 = !DILocation(line: 216, column: 29, scope: !1042)
!1051 = !DILocation(line: 216, column: 35, scope: !1042)
!1052 = !DILocation(line: 216, column: 40, scope: !1042)
!1053 = !DILocation(line: 216, column: 26, scope: !1042)
!1054 = !DILocation(line: 215, column: 7, scope: !1055)
!1055 = !DILexicalBlockFile(scope: !1043, file: !253, discriminator: 1)
!1056 = !DILocation(line: 219, column: 8, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1058, file: !253, line: 219, column: 8)
!1058 = distinct !DILexicalBlock(scope: !1042, file: !253, line: 216, column: 50)
!1059 = !DILocation(line: 219, column: 13, scope: !1057)
!1060 = !DILocation(line: 219, column: 8, scope: !1058)
!1061 = !DILocation(line: 223, column: 13, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1057, file: !253, line: 219, column: 19)
!1063 = !DILocation(line: 223, column: 19, scope: !1062)
!1064 = !DILocation(line: 223, column: 32, scope: !1062)
!1065 = !DILocation(line: 223, column: 38, scope: !1062)
!1066 = !DILocation(line: 221, column: 5, scope: !1062)
!1067 = !DILocation(line: 226, column: 5, scope: !1062)
!1068 = !DILocation(line: 227, column: 9, scope: !1062)
!1069 = !DILocation(line: 227, column: 11, scope: !1062)
!1070 = !DILocation(line: 227, column: 21, scope: !1062)
!1071 = !DILocation(line: 228, column: 9, scope: !1062)
!1072 = !DILocation(line: 228, column: 11, scope: !1062)
!1073 = !DILocation(line: 228, column: 23, scope: !1062)
!1074 = !DILocation(line: 229, column: 9, scope: !1062)
!1075 = !DILocation(line: 229, column: 11, scope: !1062)
!1076 = !DILocation(line: 229, column: 22, scope: !1062)
!1077 = !DILocation(line: 230, column: 9, scope: !1062)
!1078 = !DILocation(line: 230, column: 13, scope: !1062)
!1079 = !DILocation(line: 230, column: 24, scope: !1062)
!1080 = !DILocation(line: 231, column: 32, scope: !1062)
!1081 = !DILocation(line: 231, column: 38, scope: !1062)
!1082 = !DILocation(line: 231, column: 9, scope: !1062)
!1083 = !DILocation(line: 231, column: 13, scope: !1062)
!1084 = !DILocation(line: 231, column: 23, scope: !1062)
!1085 = !DILocation(line: 233, column: 36, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1062, file: !253, line: 233, column: 9)
!1087 = !DILocation(line: 233, column: 9, scope: !1086)
!1088 = !DILocation(line: 233, column: 39, scope: !1086)
!1089 = !DILocation(line: 233, column: 9, scope: !1062)
!1090 = !DILocation(line: 236, column: 14, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1086, file: !253, line: 233, column: 44)
!1092 = !DILocation(line: 236, column: 20, scope: !1091)
!1093 = !DILocation(line: 236, column: 33, scope: !1091)
!1094 = !DILocation(line: 236, column: 39, scope: !1091)
!1095 = !DILocation(line: 234, column: 6, scope: !1091)
!1096 = !DILocation(line: 237, column: 6, scope: !1091)
!1097 = !DILocation(line: 239, column: 4, scope: !1062)
!1098 = !DILocation(line: 240, column: 3, scope: !1058)
!1099 = !DILocation(line: 242, column: 21, scope: !1042)
!1100 = !DILocation(line: 243, column: 2, scope: !1043)
!1101 = !DILocation(line: 245, column: 6, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !703, file: !253, line: 245, column: 6)
!1103 = !DILocation(line: 245, column: 23, scope: !1102)
!1104 = !DILocation(line: 245, column: 26, scope: !1105)
!1105 = !DILexicalBlockFile(scope: !1102, file: !253, discriminator: 1)
!1106 = !DILocation(line: 245, column: 32, scope: !1105)
!1107 = !DILocation(line: 245, column: 37, scope: !1105)
!1108 = !DILocation(line: 245, column: 47, scope: !1105)
!1109 = !DILocation(line: 245, column: 6, scope: !1105)
!1110 = !DILocation(line: 247, column: 7, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1102, file: !253, line: 245, column: 56)
!1112 = !DILocation(line: 247, column: 9, scope: !1111)
!1113 = !DILocation(line: 247, column: 19, scope: !1111)
!1114 = !DILocation(line: 248, column: 7, scope: !1111)
!1115 = !DILocation(line: 248, column: 9, scope: !1111)
!1116 = !DILocation(line: 248, column: 21, scope: !1111)
!1117 = !DILocation(line: 249, column: 7, scope: !1111)
!1118 = !DILocation(line: 249, column: 9, scope: !1111)
!1119 = !DILocation(line: 249, column: 20, scope: !1111)
!1120 = !DILocation(line: 250, column: 7, scope: !1111)
!1121 = !DILocation(line: 250, column: 11, scope: !1111)
!1122 = !DILocation(line: 250, column: 22, scope: !1111)
!1123 = !DILocation(line: 253, column: 18, scope: !1111)
!1124 = !DILocation(line: 253, column: 15, scope: !1111)
!1125 = !DILocation(line: 253, column: 16, scope: !1111)
!1126 = !DILocation(line: 253, column: 26, scope: !1111)
!1127 = !DILocation(line: 253, column: 30, scope: !1111)
!1128 = !DILocation(line: 253, column: 34, scope: !1111)
!1129 = !DILocation(line: 253, column: 13, scope: !1111)
!1130 = !DILocation(line: 253, column: 12, scope: !1111)
!1131 = !DILocation(line: 254, column: 18, scope: !1111)
!1132 = !DILocation(line: 254, column: 3, scope: !1111)
!1133 = !DILocation(line: 255, column: 18, scope: !1111)
!1134 = !DILocation(line: 255, column: 58, scope: !1111)
!1135 = !DILocation(line: 255, column: 82, scope: !1111)
!1136 = !DILocation(line: 255, column: 75, scope: !1111)
!1137 = !DILocation(line: 255, column: 3, scope: !1138)
!1138 = !DILexicalBlockFile(scope: !1111, file: !253, discriminator: 1)
!1139 = !DILocation(line: 256, column: 14, scope: !1111)
!1140 = !DILocation(line: 256, column: 11, scope: !1111)
!1141 = !DILocation(line: 256, column: 12, scope: !1111)
!1142 = !DILocation(line: 256, column: 22, scope: !1111)
!1143 = !DILocation(line: 256, column: 26, scope: !1111)
!1144 = !DILocation(line: 256, column: 30, scope: !1111)
!1145 = !DILocation(line: 256, column: 9, scope: !1111)
!1146 = !DILocation(line: 256, column: 8, scope: !1111)
!1147 = !DILocation(line: 257, column: 18, scope: !1111)
!1148 = !DILocation(line: 257, column: 3, scope: !1111)
!1149 = !DILocation(line: 263, column: 18, scope: !1111)
!1150 = !DILocation(line: 263, column: 3, scope: !1111)
!1151 = !DILocation(line: 265, column: 48, scope: !1111)
!1152 = !DILocation(line: 265, column: 45, scope: !1111)
!1153 = !DILocation(line: 265, column: 46, scope: !1111)
!1154 = !DILocation(line: 265, column: 56, scope: !1111)
!1155 = !DILocation(line: 265, column: 60, scope: !1111)
!1156 = !DILocation(line: 265, column: 64, scope: !1111)
!1157 = !DILocation(line: 265, column: 72, scope: !1111)
!1158 = !DILocation(line: 265, column: 62, scope: !1111)
!1159 = !DILocation(line: 265, column: 19, scope: !1111)
!1160 = !DILocation(line: 265, column: 3, scope: !1111)
!1161 = !DILocation(line: 265, column: 9, scope: !1111)
!1162 = !DILocation(line: 265, column: 17, scope: !1111)
!1163 = !DILocation(line: 266, column: 52, scope: !1111)
!1164 = !DILocation(line: 266, column: 49, scope: !1111)
!1165 = !DILocation(line: 266, column: 50, scope: !1111)
!1166 = !DILocation(line: 266, column: 60, scope: !1111)
!1167 = !DILocation(line: 266, column: 64, scope: !1111)
!1168 = !DILocation(line: 266, column: 68, scope: !1111)
!1169 = !DILocation(line: 266, column: 76, scope: !1111)
!1170 = !DILocation(line: 266, column: 66, scope: !1111)
!1171 = !DILocation(line: 266, column: 23, scope: !1111)
!1172 = !DILocation(line: 266, column: 3, scope: !1111)
!1173 = !DILocation(line: 266, column: 13, scope: !1111)
!1174 = !DILocation(line: 266, column: 21, scope: !1111)
!1175 = !DILocation(line: 267, column: 18, scope: !1111)
!1176 = !DILocation(line: 267, column: 45, scope: !1111)
!1177 = !DILocation(line: 267, column: 51, scope: !1111)
!1178 = !DILocation(line: 267, column: 56, scope: !1111)
!1179 = !DILocation(line: 267, column: 66, scope: !1111)
!1180 = !DILocation(line: 267, column: 3, scope: !1111)
!1181 = !DILocation(line: 268, column: 18, scope: !1111)
!1182 = !DILocation(line: 268, column: 47, scope: !1111)
!1183 = !DILocation(line: 268, column: 53, scope: !1111)
!1184 = !DILocation(line: 268, column: 73, scope: !1111)
!1185 = !DILocation(line: 268, column: 79, scope: !1111)
!1186 = !DILocation(line: 268, column: 66, scope: !1111)
!1187 = !DILocation(line: 268, column: 3, scope: !1138)
!1188 = !DILocation(line: 269, column: 18, scope: !1111)
!1189 = !DILocation(line: 269, column: 3, scope: !1111)
!1190 = !DILocation(line: 274, column: 7, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1111, file: !253, line: 274, column: 7)
!1192 = !DILocation(line: 274, column: 13, scope: !1191)
!1193 = !DILocation(line: 274, column: 18, scope: !1191)
!1194 = !DILocation(line: 274, column: 28, scope: !1191)
!1195 = !DILocation(line: 274, column: 7, scope: !1111)
!1196 = !DILocation(line: 275, column: 19, scope: !1191)
!1197 = !DILocation(line: 275, column: 47, scope: !1191)
!1198 = !DILocation(line: 275, column: 53, scope: !1191)
!1199 = !DILocation(line: 275, column: 58, scope: !1191)
!1200 = !DILocation(line: 275, column: 68, scope: !1191)
!1201 = !DILocation(line: 275, column: 84, scope: !1191)
!1202 = !DILocation(line: 275, column: 4, scope: !1191)
!1203 = !DILocation(line: 278, column: 34, scope: !1204)
