; ModuleID = './[inter]keepalived--vrrp--vrrp_iprule.o.i'
source_filename = "./[inter]keepalived--vrrp--vrrp_iprule.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._vrrp_data = type { %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._nl_handle = type { %struct.nl_sock*, i32, i32, i32, %struct._thread* }
%struct.nl_sock = type opaque
%struct._thread = type { i64, i32, %struct._thread_master*, i32 (%struct._thread*)*, i8*, %struct.timeval, %union.anon.3, %struct._thread_event*, %union.anon.5 }
%struct._thread_master = type { %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.list_head, %struct.list_head, %struct.list_head, %struct._list*, %struct.rb_root, %struct.epoll_event*, %struct._thread_event*, i32, i32, i32, i32, %struct._thread*, i64, i64, i8 }

!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129}
!80 = !DIEnumerator(name: "RTM_BASE", value: 16)
!81 = !DIEnumerator(name: "RTM_NEWLINK", value: 16)
!82 = !DIEnumerator(name: "RTM_DELLINK", value: 17)
!83 = !DIEnumerator(name: "RTM_GETLINK", value: 18)
!84 = !DIEnumerator(name: "RTM_SETLINK", value: 19)
!85 = !DIEnumerator(name: "RTM_NEWADDR", value: 20)
!86 = !DIEnumerator(name: "RTM_DELADDR", value: 21)
!87 = !DIEnumerator(name: "RTM_GETADDR", value: 22)
!88 = !DIEnumerator(name: "RTM_NEWROUTE", value: 24)
!89 = !DIEnumerator(name: "RTM_DELROUTE", value: 25)
!90 = !DIEnumerator(name: "RTM_GETROUTE", value: 26)
!91 = !DIEnumerator(name: "RTM_NEWNEIGH", value: 28)
!92 = !DIEnumerator(name: "RTM_DELNEIGH", value: 29)
!93 = !DIEnumerator(name: "RTM_GETNEIGH", value: 30)
!94 = !DIEnumerator(name: "RTM_NEWRULE", value: 32)
!95 = !DIEnumerator(name: "RTM_DELRULE", value: 33)
!96 = !DIEnumerator(name: "RTM_GETRULE", value: 34)
!97 = !DIEnumerator(name: "RTM_NEWQDISC", value: 36)
!98 = !DIEnumerator(name: "RTM_DELQDISC", value: 37)
!99 = !DIEnumerator(name: "RTM_GETQDISC", value: 38)
!100 = !DIEnumerator(name: "RTM_NEWTCLASS", value: 40)
!101 = !DIEnumerator(name: "RTM_DELTCLASS", value: 41)
!102 = !DIEnumerator(name: "RTM_GETTCLASS", value: 42)
!103 = !DIEnumerator(name: "RTM_NEWTFILTER", value: 44)
!104 = !DIEnumerator(name: "RTM_DELTFILTER", value: 45)
!105 = !DIEnumerator(name: "RTM_GETTFILTER", value: 46)
!106 = !DIEnumerator(name: "RTM_NEWACTION", value: 48)
!107 = !DIEnumerator(name: "RTM_DELACTION", value: 49)
!108 = !DIEnumerator(name: "RTM_GETACTION", value: 50)
!109 = !DIEnumerator(name: "RTM_NEWPREFIX", value: 52)
!110 = !DIEnumerator(name: "RTM_GETMULTICAST", value: 58)
!111 = !DIEnumerator(name: "RTM_GETANYCAST", value: 62)
!112 = !DIEnumerator(name: "RTM_NEWNEIGHTBL", value: 64)
!113 = !DIEnumerator(name: "RTM_GETNEIGHTBL", value: 66)
!114 = !DIEnumerator(name: "RTM_SETNEIGHTBL", value: 67)
!115 = !DIEnumerator(name: "RTM_NEWNDUSEROPT", value: 68)
!116 = !DIEnumerator(name: "RTM_NEWADDRLABEL", value: 72)
!117 = !DIEnumerator(name: "RTM_DELADDRLABEL", value: 73)
!118 = !DIEnumerator(name: "RTM_GETADDRLABEL", value: 74)
!119 = !DIEnumerator(name: "RTM_GETDCB", value: 78)
!120 = !DIEnumerator(name: "RTM_SETDCB", value: 79)
!121 = !DIEnumerator(name: "RTM_NEWNETCONF", value: 80)
!122 = !DIEnumerator(name: "RTM_GETNETCONF", value: 82)
!123 = !DIEnumerator(name: "RTM_NEWMDB", value: 84)
!124 = !DIEnumerator(name: "RTM_DELMDB", value: 85)
!125 = !DIEnumerator(name: "RTM_GETMDB", value: 86)
!126 = !DIEnumerator(name: "RTM_NEWNSID", value: 88)
!127 = !DIEnumerator(name: "RTM_DELNSID", value: 89)
!128 = !DIEnumerator(name: "RTM_GETNSID", value: 90)
!129 = !DIEnumerator(name: "__RTM_MAX", value: 91)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rt_class_t", file: !63, line: 277, size: 32, align: 32, elements: !131)
!131 = !{!132, !133, !134, !135, !136, !137}
!132 = !DIEnumerator(name: "RT_TABLE_UNSPEC", value: 0)
!133 = !DIEnumerator(name: "RT_TABLE_COMPAT", value: 252)
!134 = !DIEnumerator(name: "RT_TABLE_DEFAULT", value: 253)
!135 = !DIEnumerator(name: "RT_TABLE_MAIN", value: 254)
!136 = !DIEnumerator(name: "RT_TABLE_LOCAL", value: 255)
!137 = !DIEnumerator(name: "RT_TABLE_MAX", value: -1)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 32, size: 32, align: 32, elements: !139)
!139 = !{!140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158}
!140 = !DIEnumerator(name: "FRA_UNSPEC", value: 0)
!141 = !DIEnumerator(name: "FRA_DST", value: 1)
!142 = !DIEnumerator(name: "FRA_SRC", value: 2)
!143 = !DIEnumerator(name: "FRA_IIFNAME", value: 3)
!144 = !DIEnumerator(name: "FRA_GOTO", value: 4)
!145 = !DIEnumerator(name: "FRA_UNUSED2", value: 5)
!146 = !DIEnumerator(name: "FRA_PRIORITY", value: 6)
!147 = !DIEnumerator(name: "FRA_UNUSED3", value: 7)
!148 = !DIEnumerator(name: "FRA_UNUSED4", value: 8)
!149 = !DIEnumerator(name: "FRA_UNUSED5", value: 9)
!150 = !DIEnumerator(name: "FRA_FWMARK", value: 10)
!151 = !DIEnumerator(name: "FRA_FLOW", value: 11)
!152 = !DIEnumerator(name: "FRA_TUN_ID", value: 12)
!153 = !DIEnumerator(name: "FRA_SUPPRESS_IFGROUP", value: 13)
!154 = !DIEnumerator(name: "FRA_SUPPRESS_PREFIXLEN", value: 14)
!155 = !DIEnumerator(name: "FRA_TABLE", value: 15)
!156 = !DIEnumerator(name: "FRA_FWMASK", value: 16)
!157 = !DIEnumerator(name: "FRA_OIFNAME", value: 17)
!158 = !DIEnumerator(name: "__FRA_MAX", value: 18)
!159 = !{!160, !161, !164, !323, !169, !175, !222, !407}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !162, line: 216, baseType: !163)
!162 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!163 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_rule_t", file: !4, line: 113, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_rule", file: !4, line: 65, size: 1024, align: 64, elements: !167)
!167 = !{!168, !172, !174, !176, !400, !401, !402, !403, !404, !405, !406, !408, !409, !410, !411, !412, !413, !414, !416, !417, !418}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !166, file: !4, line: 66, baseType: !169, size: 32, align: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !170, line: 51, baseType: !171)
!170 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!171 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !166, file: !4, line: 67, baseType: !173, size: 8, align: 8, offset: 32)
!173 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !166, file: !4, line: 68, baseType: !175, size: 32, align: 32, offset: 64)
!175 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "from_addr", scope: !166, file: !4, line: 69, baseType: !177, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_address_t", file: !179, line: 73, baseType: !180)
!179 = !DIFile(filename: "./../include/vrrp_ipaddress.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_address", file: !179, line: 41, size: 704, align: 64, elements: !181)
!181 = !{!182, !195, !229, !369, !370, !371, !372, !373, !378, !379, !397, !398, !399}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ifa", scope: !180, file: !179, line: 42, baseType: !183, size: 64, align: 32)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifaddrmsg", file: !184, line: 7, size: 64, align: 32, elements: !185)
!184 = !DIFile(filename: "/usr/include/linux/if_addr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!185 = !{!186, !190, !191, !192, !193}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_family", scope: !183, file: !184, line: 8, baseType: !187, size: 8, align: 8)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !188, line: 20, baseType: !189)
!188 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!189 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_prefixlen", scope: !183, file: !184, line: 9, baseType: !187, size: 8, align: 8, offset: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_flags", scope: !183, file: !184, line: 10, baseType: !187, size: 8, align: 8, offset: 16)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_scope", scope: !183, file: !184, line: 11, baseType: !187, size: 8, align: 8, offset: 24)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_index", scope: !183, file: !184, line: 12, baseType: !194, size: 32, align: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !188, line: 26, baseType: !171)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !180, file: !179, line: 50, baseType: !196, size: 128, align: 32, offset: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !180, file: !179, line: 44, size: 128, align: 32, elements: !197)
!197 = !{!198, !208}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !196, file: !179, line: 48, baseType: !199, size: 64, align: 32)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !196, file: !179, line: 45, size: 64, align: 32, elements: !200)
!200 = !{!201, !207}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !199, file: !179, line: 46, baseType: !202, size: 32, align: 32)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !203, line: 31, size: 32, align: 32, elements: !204)
!203 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!204 = !{!205}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !202, file: !203, line: 33, baseType: !206, size: 32, align: 32)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !203, line: 30, baseType: !169)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sin_brd", scope: !199, file: !179, line: 47, baseType: !202, size: 32, align: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !196, file: !179, line: 49, baseType: !209, size: 128, align: 32)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !203, line: 211, size: 128, align: 32, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !209, file: !203, line: 220, baseType: !212, size: 128, align: 32)
!212 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !209, file: !203, line: 213, size: 128, align: 32, elements: !213)
!213 = !{!214, !219, !225}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !212, file: !203, line: 215, baseType: !215, size: 128, align: 8)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 128, align: 8, elements: !217)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !170, line: 48, baseType: !189)
!217 = !{!218}
!218 = !DISubrange(count: 16)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !212, file: !203, line: 217, baseType: !220, size: 128, align: 16)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 128, align: 16, elements: !223)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !170, line: 49, baseType: !222)
!222 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!223 = !{!224}
!224 = !DISubrange(count: 8)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !212, file: !203, line: 218, baseType: !226, size: 128, align: 32)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 128, align: 32, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 4)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !180, file: !179, line: 52, baseType: !230, size: 64, align: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !56, line: 111, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !56, line: 76, size: 1792, align: 64, elements: !233)
!233 = !{!234, !237, !239, !240, !241, !242, !243, !244, !245, !253, !254, !255, !256, !257, !258, !260, !261, !262, !263, !285, !286, !287, !288, !289, !290, !291, !292}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !232, file: !56, line: 77, baseType: !235, size: 128, align: 8)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 128, align: 8, elements: !217)
!236 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !232, file: !56, line: 78, baseType: !238, size: 32, align: 32, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !56, line: 62, baseType: !169)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !232, file: !56, line: 79, baseType: !202, size: 32, align: 32, offset: 160)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !232, file: !56, line: 80, baseType: !209, size: 128, align: 32, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !232, file: !56, line: 81, baseType: !171, size: 32, align: 32, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !232, file: !56, line: 82, baseType: !173, size: 8, align: 8, offset: 352)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !232, file: !56, line: 83, baseType: !169, size: 32, align: 32, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !232, file: !56, line: 84, baseType: !222, size: 16, align: 16, offset: 416)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !232, file: !56, line: 85, baseType: !246, size: 256, align: 8, offset: 432)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 256, align: 8, elements: !251)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !248, line: 33, baseType: !249)
!248 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !250, line: 30, baseType: !189)
!250 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!251 = !{!252}
!252 = !DISubrange(count: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !232, file: !56, line: 86, baseType: !246, size: 256, align: 8, offset: 688)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !232, file: !56, line: 87, baseType: !161, size: 64, align: 64, offset: 960)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !232, file: !56, line: 88, baseType: !175, size: 32, align: 32, offset: 1024)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !232, file: !56, line: 90, baseType: !173, size: 8, align: 8, offset: 1056)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !232, file: !56, line: 91, baseType: !238, size: 32, align: 32, offset: 1088)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !232, file: !56, line: 92, baseType: !259, size: 64, align: 64, offset: 1152)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !232, file: !56, line: 94, baseType: !238, size: 32, align: 32, offset: 1216)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !232, file: !56, line: 96, baseType: !259, size: 64, align: 64, offset: 1280)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !232, file: !56, line: 97, baseType: !173, size: 8, align: 8, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !232, file: !56, line: 100, baseType: !264, size: 64, align: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !56, line: 73, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !56, line: 65, size: 704, align: 64, elements: !267)
!267 = !{!268, !279, !280, !281, !282, !283, !284}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !266, file: !56, line: 66, baseType: !269, size: 128, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !270, line: 31, baseType: !271)
!270 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !272, line: 30, size: 128, align: 64, elements: !273)
!272 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!273 = !{!274, !277}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !271, file: !272, line: 32, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !250, line: 139, baseType: !276)
!276 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !271, file: !272, line: 33, baseType: !278, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !250, line: 141, baseType: !276)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !266, file: !56, line: 67, baseType: !173, size: 8, align: 8, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !266, file: !56, line: 68, baseType: !269, size: 128, align: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !266, file: !56, line: 69, baseType: !173, size: 8, align: 8, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !266, file: !56, line: 70, baseType: !269, size: 128, align: 64, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !266, file: !56, line: 71, baseType: !269, size: 128, align: 64, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !266, file: !56, line: 72, baseType: !175, size: 32, align: 32, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !232, file: !56, line: 101, baseType: !173, size: 8, align: 8, offset: 1472)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !232, file: !56, line: 102, baseType: !175, size: 32, align: 32, offset: 1504)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !232, file: !56, line: 103, baseType: !169, size: 32, align: 32, offset: 1536)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !232, file: !56, line: 104, baseType: !169, size: 32, align: 32, offset: 1568)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !232, file: !56, line: 105, baseType: !169, size: 32, align: 32, offset: 1600)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !232, file: !56, line: 107, baseType: !171, size: 32, align: 32, offset: 1632)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !232, file: !56, line: 109, baseType: !173, size: 8, align: 8, offset: 1664)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !232, file: !56, line: 110, baseType: !293, size: 64, align: 64, offset: 1728)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !294, line: 31, baseType: !295)
!294 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !294, line: 39, size: 320, align: 64, elements: !297)
!297 = !{!298, !305, !306, !307, !311}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !296, file: !294, line: 40, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !294, line: 33, size: 192, align: 64, elements: !301)
!301 = !{!302, !303, !304}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !300, file: !294, line: 34, baseType: !299, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !300, file: !294, line: 35, baseType: !299, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !300, file: !294, line: 36, baseType: !160, size: 64, align: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !296, file: !294, line: 41, baseType: !299, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !296, file: !294, line: 42, baseType: !171, size: 32, align: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !296, file: !294, line: 43, baseType: !308, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !160}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !296, file: !294, line: 44, baseType: !312, size: 64, align: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !315, !160}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !317, line: 48, baseType: !318)
!317 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !319, line: 241, size: 1728, align: 64, elements: !320)
!319 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!320 = !{!321, !322, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !342, !343, !344, !345, !347, !348, !350, !354, !357, !359, !360, !361, !362, !363, !364, !365}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !318, file: !319, line: 242, baseType: !175, size: 32, align: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !318, file: !319, line: 247, baseType: !323, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !318, file: !319, line: 248, baseType: !323, size: 64, align: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !318, file: !319, line: 249, baseType: !323, size: 64, align: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !318, file: !319, line: 250, baseType: !323, size: 64, align: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !318, file: !319, line: 251, baseType: !323, size: 64, align: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !318, file: !319, line: 252, baseType: !323, size: 64, align: 64, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !318, file: !319, line: 253, baseType: !323, size: 64, align: 64, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !318, file: !319, line: 254, baseType: !323, size: 64, align: 64, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !318, file: !319, line: 256, baseType: !323, size: 64, align: 64, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !318, file: !319, line: 257, baseType: !323, size: 64, align: 64, offset: 640)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !318, file: !319, line: 258, baseType: !323, size: 64, align: 64, offset: 704)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !318, file: !319, line: 260, baseType: !335, size: 64, align: 64, offset: 768)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !319, line: 156, size: 192, align: 64, elements: !337)
!337 = !{!338, !339, !341}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !336, file: !319, line: 157, baseType: !335, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !336, file: !319, line: 158, baseType: !340, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !336, file: !319, line: 162, baseType: !175, size: 32, align: 32, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !318, file: !319, line: 262, baseType: !340, size: 64, align: 64, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !318, file: !319, line: 264, baseType: !175, size: 32, align: 32, offset: 896)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !318, file: !319, line: 268, baseType: !175, size: 32, align: 32, offset: 928)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !318, file: !319, line: 270, baseType: !346, size: 64, align: 64, offset: 960)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !250, line: 131, baseType: !276)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !318, file: !319, line: 274, baseType: !222, size: 16, align: 16, offset: 1024)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !318, file: !319, line: 275, baseType: !349, size: 8, align: 8, offset: 1040)
!349 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !318, file: !319, line: 276, baseType: !351, size: 8, align: 8, offset: 1048)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 8, align: 8, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 1)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !318, file: !319, line: 280, baseType: !355, size: 64, align: 64, offset: 1088)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !319, line: 150, baseType: null)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !318, file: !319, line: 289, baseType: !358, size: 64, align: 64, offset: 1152)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !250, line: 132, baseType: !276)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !318, file: !319, line: 297, baseType: !160, size: 64, align: 64, offset: 1216)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !318, file: !319, line: 298, baseType: !160, size: 64, align: 64, offset: 1280)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !318, file: !319, line: 299, baseType: !160, size: 64, align: 64, offset: 1344)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !318, file: !319, line: 300, baseType: !160, size: 64, align: 64, offset: 1408)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !318, file: !319, line: 302, baseType: !161, size: 64, align: 64, offset: 1472)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !318, file: !319, line: 303, baseType: !175, size: 32, align: 32, offset: 1536)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !318, file: !319, line: 305, baseType: !366, size: 160, align: 8, offset: 1568)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 160, align: 8, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 20)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !180, file: !179, line: 53, baseType: !323, size: 64, align: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !180, file: !179, line: 55, baseType: !169, size: 32, align: 32, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "flagmask", scope: !180, file: !179, line: 56, baseType: !169, size: 32, align: 32, offset: 352)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "have_peer", scope: !180, file: !179, line: 61, baseType: !173, size: 8, align: 8, offset: 384)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !180, file: !179, line: 65, baseType: !374, size: 128, align: 32, offset: 416)
!374 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !180, file: !179, line: 62, size: 128, align: 32, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !374, file: !179, line: 63, baseType: !202, size: 32, align: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !374, file: !179, line: 64, baseType: !209, size: 128, align: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track", scope: !180, file: !179, line: 66, baseType: !173, size: 8, align: 8, offset: 544)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "track_group", scope: !180, file: !179, line: 67, baseType: !380, size: 64, align: 64, offset: 576)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "static_track_group_t", file: !382, line: 39, baseType: !383)
!382 = !DIFile(filename: "./../include/vrrp_static_track.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_track_group", file: !382, line: 35, size: 192, align: 64, elements: !384)
!384 = !{!385, !386, !396}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !383, file: !382, line: 36, baseType: !323, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !383, file: !382, line: 37, baseType: !387, size: 64, align: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !389, line: 34, baseType: !390)
!389 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !389, line: 30, size: 128, align: 64, elements: !391)
!391 = !{!392, !393, !394}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !390, file: !389, line: 31, baseType: !171, size: 32, align: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !390, file: !389, line: 32, baseType: !171, size: 32, align: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !390, file: !389, line: 33, baseType: !395, size: 64, align: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !383, file: !382, line: 38, baseType: !293, size: 64, align: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !180, file: !179, line: 69, baseType: !173, size: 8, align: 8, offset: 640)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rule_set", scope: !180, file: !179, line: 70, baseType: !173, size: 8, align: 8, offset: 648)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "garp_gna_pending", scope: !180, file: !179, line: 72, baseType: !173, size: 8, align: 8, offset: 656)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "to_addr", scope: !166, file: !4, line: 70, baseType: !177, size: 64, align: 64, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !166, file: !4, line: 71, baseType: !169, size: 32, align: 32, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !166, file: !4, line: 72, baseType: !216, size: 8, align: 8, offset: 288)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "fwmark", scope: !166, file: !4, line: 73, baseType: !169, size: 32, align: 32, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "fwmask", scope: !166, file: !4, line: 74, baseType: !169, size: 32, align: 32, offset: 352)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "realms", scope: !166, file: !4, line: 75, baseType: !169, size: 32, align: 32, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_prefix_len", scope: !166, file: !4, line: 77, baseType: !407, size: 32, align: 32, offset: 416)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !170, line: 38, baseType: !175)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_group", scope: !166, file: !4, line: 80, baseType: !169, size: 32, align: 32, offset: 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "iif", scope: !166, file: !4, line: 82, baseType: !230, size: 64, align: 64, offset: 512)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "oif", scope: !166, file: !4, line: 84, baseType: !230, size: 64, align: 64, offset: 576)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "goto_target", scope: !166, file: !4, line: 86, baseType: !169, size: 32, align: 32, offset: 640)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !166, file: !4, line: 87, baseType: !169, size: 32, align: 32, offset: 672)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !166, file: !4, line: 88, baseType: !216, size: 8, align: 8, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tunnel_id", scope: !166, file: !4, line: 90, baseType: !415, size: 64, align: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !170, line: 55, baseType: !163)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track", scope: !166, file: !4, line: 110, baseType: !173, size: 8, align: 8, offset: 832)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "track_group", scope: !166, file: !4, line: 111, baseType: !380, size: 64, align: 64, offset: 896)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !166, file: !4, line: 112, baseType: !173, size: 8, align: 8, offset: 960)
!419 = !{!420, !421, !423}
!420 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !56, line: 150, type: !293, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!421 = distinct !DIGlobalVariable(name: "next_rule_priority_ipv4", scope: !0, file: !422, line: 60, type: !171, isLocal: true, isDefinition: true, variable: i32* @next_rule_priority_ipv4)
!422 = !DIFile(filename: "vrrp_iprule.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!423 = distinct !DIGlobalVariable(name: "next_rule_priority_ipv6", scope: !0, file: !422, line: 61, type: !171, isLocal: true, isDefinition: true, variable: i32* @next_rule_priority_ipv6)
!424 = !{i32 2, !"Dwarf Version", i32 4}
!425 = !{i32 2, !"Debug Info Version", i32 3}
!426 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!427 = distinct !DISubprogram(name: "reinstate_static_rule", scope: !422, file: !422, line: 283, type: !428, isLocal: false, isDefinition: true, scopeLine: 284, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !164}
!430 = !{}
!431 = !DILocalVariable(name: "rule", arg: 1, scope: !427, file: !422, line: 283, type: !164)
!432 = !DIExpression()
!433 = !DILocation(line: 283, column: 34, scope: !427)
!434 = !DILocalVariable(name: "buf", scope: !427, file: !422, line: 285, type: !435)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 2048, align: 8, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 256)
!438 = !DILocation(line: 285, column: 7, scope: !427)
!439 = !DILocation(line: 287, column: 28, scope: !427)
!440 = !DILocation(line: 287, column: 15, scope: !427)
!441 = !DILocation(line: 287, column: 37, scope: !427)
!442 = !DILocation(line: 287, column: 2, scope: !427)
!443 = !DILocation(line: 287, column: 8, scope: !427)
!444 = !DILocation(line: 287, column: 12, scope: !427)
!445 = !DILocation(line: 289, column: 16, scope: !427)
!446 = !DILocation(line: 289, column: 22, scope: !427)
!447 = !DILocation(line: 289, column: 2, scope: !427)
!448 = !DILocation(line: 290, column: 59, scope: !427)
!449 = !DILocation(line: 290, column: 2, scope: !427)
!450 = !DILocation(line: 291, column: 1, scope: !427)
!451 = distinct !DISubprogram(name: "netlink_rule", scope: !422, file: !422, line: 150, type: !452, isLocal: true, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!452 = !DISubroutineType(types: !453)
!453 = !{!175, !164, !175}
!454 = !DILocalVariable(name: "iprule", arg: 1, scope: !451, file: !422, line: 150, type: !164)
!455 = !DILocation(line: 150, column: 25, scope: !451)
!456 = !DILocalVariable(name: "cmd", arg: 2, scope: !451, file: !422, line: 150, type: !175)
!457 = !DILocation(line: 150, column: 37, scope: !451)
!458 = !DILocalVariable(name: "status", scope: !451, file: !422, line: 152, type: !175)
!459 = !DILocation(line: 152, column: 6, scope: !451)
!460 = !DILocalVariable(name: "req", scope: !451, file: !422, line: 157, type: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !451, file: !422, line: 153, size: 8416, align: 32, elements: !462)
!462 = !{!463, !473, !485}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !461, file: !422, line: 154, baseType: !464, size: 128, align: 32)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !465, line: 42, size: 128, align: 32, elements: !466)
!465 = !DIFile(filename: "/usr/include/linux/netlink.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!466 = !{!467, !468, !470, !471, !472}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !464, file: !465, line: 43, baseType: !194, size: 32, align: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !464, file: !465, line: 44, baseType: !469, size: 16, align: 16, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !188, line: 23, baseType: !222)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !464, file: !465, line: 45, baseType: !469, size: 16, align: 16, offset: 48)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !464, file: !465, line: 46, baseType: !194, size: 32, align: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !464, file: !465, line: 47, baseType: !194, size: 32, align: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "frh", scope: !461, file: !422, line: 155, baseType: !474, size: 96, align: 32, offset: 128)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fib_rule_hdr", file: !12, line: 18, size: 96, align: 32, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !474, file: !12, line: 19, baseType: !187, size: 8, align: 8)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dst_len", scope: !474, file: !12, line: 20, baseType: !187, size: 8, align: 8, offset: 8)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "src_len", scope: !474, file: !12, line: 21, baseType: !187, size: 8, align: 8, offset: 16)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !474, file: !12, line: 22, baseType: !187, size: 8, align: 8, offset: 24)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !474, file: !12, line: 24, baseType: !187, size: 8, align: 8, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !474, file: !12, line: 25, baseType: !187, size: 8, align: 8, offset: 40)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "res2", scope: !474, file: !12, line: 26, baseType: !187, size: 8, align: 8, offset: 48)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !474, file: !12, line: 27, baseType: !187, size: 8, align: 8, offset: 56)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !474, file: !12, line: 29, baseType: !194, size: 32, align: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !461, file: !422, line: 156, baseType: !486, size: 8192, align: 8, offset: 224)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 8192, align: 8, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 1024)
!489 = !DILocation(line: 157, column: 4, scope: !451)
!490 = !DILocation(line: 159, column: 2, scope: !451)
!491 = !DILocation(line: 161, column: 6, scope: !451)
!492 = !DILocation(line: 161, column: 8, scope: !451)
!493 = !DILocation(line: 161, column: 18, scope: !451)
!494 = !DILocation(line: 162, column: 6, scope: !451)
!495 = !DILocation(line: 162, column: 8, scope: !451)
!496 = !DILocation(line: 162, column: 20, scope: !451)
!497 = !DILocation(line: 164, column: 6, scope: !498)
!498 = distinct !DILexicalBlock(scope: !451, file: !422, line: 164, column: 6)
!499 = !DILocation(line: 164, column: 10, scope: !498)
!500 = !DILocation(line: 164, column: 6, scope: !451)
!501 = !DILocation(line: 165, column: 7, scope: !502)
!502 = distinct !DILexicalBlock(scope: !498, file: !422, line: 164, column: 16)
!503 = !DILocation(line: 165, column: 9, scope: !502)
!504 = !DILocation(line: 165, column: 21, scope: !502)
!505 = !DILocation(line: 166, column: 7, scope: !502)
!506 = !DILocation(line: 166, column: 9, scope: !502)
!507 = !DILocation(line: 166, column: 20, scope: !502)
!508 = !DILocation(line: 167, column: 7, scope: !502)
!509 = !DILocation(line: 167, column: 11, scope: !502)
!510 = !DILocation(line: 167, column: 18, scope: !502)
!511 = !DILocation(line: 168, column: 2, scope: !502)
!512 = !DILocation(line: 170, column: 7, scope: !513)
!513 = distinct !DILexicalBlock(scope: !498, file: !422, line: 169, column: 7)
!514 = !DILocation(line: 170, column: 11, scope: !513)
!515 = !DILocation(line: 170, column: 18, scope: !513)
!516 = !DILocation(line: 171, column: 7, scope: !513)
!517 = !DILocation(line: 171, column: 9, scope: !513)
!518 = !DILocation(line: 171, column: 20, scope: !513)
!519 = !DILocation(line: 173, column: 6, scope: !451)
!520 = !DILocation(line: 173, column: 10, scope: !451)
!521 = !DILocation(line: 173, column: 16, scope: !451)
!522 = !DILocation(line: 174, column: 6, scope: !451)
!523 = !DILocation(line: 174, column: 10, scope: !451)
!524 = !DILocation(line: 174, column: 16, scope: !451)
!525 = !DILocation(line: 175, column: 16, scope: !451)
!526 = !DILocation(line: 175, column: 24, scope: !451)
!527 = !DILocation(line: 175, column: 6, scope: !451)
!528 = !DILocation(line: 175, column: 10, scope: !451)
!529 = !DILocation(line: 175, column: 14, scope: !451)
!530 = !DILocation(line: 176, column: 19, scope: !451)
!531 = !DILocation(line: 176, column: 27, scope: !451)
!532 = !DILocation(line: 176, column: 6, scope: !451)
!533 = !DILocation(line: 176, column: 10, scope: !451)
!534 = !DILocation(line: 176, column: 17, scope: !451)
!535 = !DILocation(line: 178, column: 6, scope: !536)
!536 = distinct !DILexicalBlock(scope: !451, file: !422, line: 178, column: 6)
!537 = !DILocation(line: 178, column: 14, scope: !536)
!538 = !DILocation(line: 178, column: 21, scope: !536)
!539 = !DILocation(line: 178, column: 6, scope: !451)
!540 = !DILocation(line: 183, column: 7, scope: !541)
!541 = distinct !DILexicalBlock(scope: !542, file: !422, line: 183, column: 7)
!542 = distinct !DILexicalBlock(scope: !536, file: !422, line: 182, column: 11)
!543 = !DILocation(line: 183, column: 15, scope: !541)
!544 = !DILocation(line: 183, column: 21, scope: !541)
!545 = !DILocation(line: 183, column: 7, scope: !542)
!546 = !DILocation(line: 184, column: 20, scope: !541)
!547 = !DILocation(line: 184, column: 28, scope: !541)
!548 = !DILocation(line: 184, column: 36, scope: !549)
!549 = !DILexicalBlockFile(scope: !541, file: !422, discriminator: 1)
!550 = !DILocation(line: 184, column: 44, scope: !549)
!551 = !DILocation(line: 184, column: 50, scope: !549)
!552 = !DILocation(line: 184, column: 20, scope: !549)
!553 = !DILocation(line: 184, column: 20, scope: !554)
