; ModuleID = './[inter]keepalived--vrrp--vrrp_ipset.o.i'
source_filename = "./[inter]keepalived--vrrp--vrrp_ipset.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ipset_data = type opaque
%struct.ipset_session = type opaque
%struct._data = type { i8*, i8, i8*, i8, i8*, i8*, %struct.sockaddr_storage, i8*, i64, %struct._list*, i32, i8, i8, i32, i8*, %struct._interface*, i32, i32, i32, i32, %struct.lvs_syncd_config, i8, %struct.sockaddr_in, %struct.sockaddr_in6, i32, %struct.timeval, i32, i32, i32, i32, i32, i32, i8, i8, i32, [29 x i8], [29 x i8], i8, [32 x i8], [32 x i8], [32 x i8], i8, i8, i8, i8, i8, i8, i32, i64, i8, i8, i8, i32, i64, %struct._notify_fifo, %struct._notify_fifo, %struct._notify_fifo, i32, i8, i32, i8, i32, i8, i32, i8, i8, i8, i32, i64, i32 }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

!78 = !DIEnumerator(name: "IPSET_MSG_MAX", value: 14)
!79 = !DIEnumerator(name: "IPSET_CMD_RESTORE", value: 14)
!80 = !DIEnumerator(name: "IPSET_CMD_HELP", value: 15)
!81 = !DIEnumerator(name: "IPSET_CMD_VERSION", value: 16)
!82 = !DIEnumerator(name: "IPSET_CMD_QUIT", value: 17)
!83 = !DIEnumerator(name: "IPSET_CMD_MAX", value: 18)
!84 = !DIEnumerator(name: "IPSET_CMD_COMMIT", value: 18)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ipset_envopt", file: !86, line: 67, size: 32, align: 32, elements: !87)
!86 = !DIFile(filename: "/usr/include/libipset/session.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99}
!88 = !DIEnumerator(name: "IPSET_ENV_BIT_SORTED", value: 0)
!89 = !DIEnumerator(name: "IPSET_ENV_SORTED", value: 1)
!90 = !DIEnumerator(name: "IPSET_ENV_BIT_QUIET", value: 1)
!91 = !DIEnumerator(name: "IPSET_ENV_QUIET", value: 2)
!92 = !DIEnumerator(name: "IPSET_ENV_BIT_RESOLVE", value: 2)
!93 = !DIEnumerator(name: "IPSET_ENV_RESOLVE", value: 4)
!94 = !DIEnumerator(name: "IPSET_ENV_BIT_EXIST", value: 3)
!95 = !DIEnumerator(name: "IPSET_ENV_EXIST", value: 8)
!96 = !DIEnumerator(name: "IPSET_ENV_BIT_LIST_SETNAME", value: 4)
!97 = !DIEnumerator(name: "IPSET_ENV_LIST_SETNAME", value: 16)
!98 = !DIEnumerator(name: "IPSET_ENV_BIT_LIST_HEADER", value: 5)
!99 = !DIEnumerator(name: "IPSET_ENV_LIST_HEADER", value: 32)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !101, line: 58, size: 32, align: 32, elements: !102)
!101 = !DIFile(filename: "/usr/include/linux/netfilter.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111}
!103 = !DIEnumerator(name: "NFPROTO_UNSPEC", value: 0)
!104 = !DIEnumerator(name: "NFPROTO_INET", value: 1)
!105 = !DIEnumerator(name: "NFPROTO_IPV4", value: 2)
!106 = !DIEnumerator(name: "NFPROTO_ARP", value: 3)
!107 = !DIEnumerator(name: "NFPROTO_NETDEV", value: 5)
!108 = !DIEnumerator(name: "NFPROTO_BRIDGE", value: 7)
!109 = !DIEnumerator(name: "NFPROTO_IPV6", value: 10)
!110 = !DIEnumerator(name: "NFPROTO_DECNET", value: 12)
!111 = !DIEnumerator(name: "NFPROTO_NUMPROTO", value: 13)
!112 = !{!113, !140}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !116, line: 211, size: 128, align: 32, elements: !117)
!116 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!117 = !{!118}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !115, file: !116, line: 220, baseType: !119, size: 128, align: 32)
!119 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !115, file: !116, line: 213, size: 128, align: 32, elements: !120)
!120 = !{!121, !128, !134}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !119, file: !116, line: 215, baseType: !122, size: 128, align: 8)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, align: 8, elements: !126)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !124, line: 48, baseType: !125)
!124 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!125 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!126 = !{!127}
!127 = !DISubrange(count: 16)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !119, file: !116, line: 217, baseType: !129, size: 128, align: 16)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 128, align: 16, elements: !132)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !124, line: 49, baseType: !131)
!131 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!132 = !{!133}
!133 = !DISubrange(count: 8)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !119, file: !116, line: 218, baseType: !135, size: 128, align: 32)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 128, align: 32, elements: !138)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !124, line: 51, baseType: !137)
!137 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!138 = !{!139}
!139 = !DISubrange(count: 4)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!141 = !{!142, !227, !240, !244, !252, !256, !260, !330, !336, !340, !341}
!142 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !143, line: 150, type: !144, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!143 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !145, line: 31, baseType: !146)
!145 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !145, line: 39, size: 320, align: 64, elements: !148)
!148 = !{!149, !156, !157, !158, !162}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !147, file: !145, line: 40, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !145, line: 33, size: 192, align: 64, elements: !152)
!152 = !{!153, !154, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !151, file: !145, line: 34, baseType: !150, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !151, file: !145, line: 35, baseType: !150, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !151, file: !145, line: 36, baseType: !140, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !147, file: !145, line: 41, baseType: !150, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !147, file: !145, line: 42, baseType: !137, size: 32, align: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !147, file: !145, line: 43, baseType: !159, size: 64, align: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !140}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !147, file: !145, line: 44, baseType: !163, size: 64, align: 64, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !166, !140}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !168, line: 48, baseType: !169)
!168 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !170, line: 241, size: 1728, align: 64, elements: !171)
!170 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!171 = !{!172, !174, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !195, !196, !197, !198, !202, !203, !205, !209, !212, !214, !215, !216, !217, !218, !222, !223}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !169, file: !170, line: 242, baseType: !173, size: 32, align: 32)
!173 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !169, file: !170, line: 247, baseType: !175, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !169, file: !170, line: 248, baseType: !175, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !169, file: !170, line: 249, baseType: !175, size: 64, align: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !169, file: !170, line: 250, baseType: !175, size: 64, align: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !169, file: !170, line: 251, baseType: !175, size: 64, align: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !169, file: !170, line: 252, baseType: !175, size: 64, align: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !169, file: !170, line: 253, baseType: !175, size: 64, align: 64, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !169, file: !170, line: 254, baseType: !175, size: 64, align: 64, offset: 512)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !169, file: !170, line: 256, baseType: !175, size: 64, align: 64, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !169, file: !170, line: 257, baseType: !175, size: 64, align: 64, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !169, file: !170, line: 258, baseType: !175, size: 64, align: 64, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !169, file: !170, line: 260, baseType: !188, size: 64, align: 64, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !170, line: 156, size: 192, align: 64, elements: !190)
!190 = !{!191, !192, !194}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !189, file: !170, line: 157, baseType: !188, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !189, file: !170, line: 158, baseType: !193, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !189, file: !170, line: 162, baseType: !173, size: 32, align: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !169, file: !170, line: 262, baseType: !193, size: 64, align: 64, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !169, file: !170, line: 264, baseType: !173, size: 32, align: 32, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !169, file: !170, line: 268, baseType: !173, size: 32, align: 32, offset: 928)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !169, file: !170, line: 270, baseType: !199, size: 64, align: 64, offset: 960)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !200, line: 131, baseType: !201)
!200 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!201 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !169, file: !170, line: 274, baseType: !131, size: 16, align: 16, offset: 1024)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !169, file: !170, line: 275, baseType: !204, size: 8, align: 8, offset: 1040)
!204 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !169, file: !170, line: 276, baseType: !206, size: 8, align: 8, offset: 1048)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 8, align: 8, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 1)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !169, file: !170, line: 280, baseType: !210, size: 64, align: 64, offset: 1088)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !170, line: 150, baseType: null)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !169, file: !170, line: 289, baseType: !213, size: 64, align: 64, offset: 1152)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !200, line: 132, baseType: !201)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !169, file: !170, line: 297, baseType: !140, size: 64, align: 64, offset: 1216)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !169, file: !170, line: 298, baseType: !140, size: 64, align: 64, offset: 1280)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !169, file: !170, line: 299, baseType: !140, size: 64, align: 64, offset: 1344)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !169, file: !170, line: 300, baseType: !140, size: 64, align: 64, offset: 1408)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !169, file: !170, line: 302, baseType: !219, size: 64, align: 64, offset: 1472)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !220, line: 216, baseType: !221)
!220 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!221 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !169, file: !170, line: 303, baseType: !173, size: 32, align: 32, offset: 1536)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !169, file: !170, line: 305, baseType: !224, size: 160, align: 8, offset: 1568)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 160, align: 8, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 20)
!227 = distinct !DIGlobalVariable(name: "ipset_session_init_addr", scope: !0, file: !228, line: 63, type: !229, isLocal: false, isDefinition: true, variable: %struct.ipset_session* (i32 (i8*, ...)*)** @ipset_session_init_addr)
!228 = !DIFile(filename: "vrrp_ipset.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !234}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "ipset_session", file: !86, line: 20, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipset_outfn", file: !86, line: 101, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!173, !238, null}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!240 = distinct !DIGlobalVariable(name: "ipset_session_fini_addr", scope: !0, file: !228, line: 64, type: !241, isLocal: false, isDefinition: true, variable: i32 (%struct.ipset_session*)** @ipset_session_fini_addr)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!173, !232}
!244 = distinct !DIGlobalVariable(name: "ipset_session_data_addr", scope: !0, file: !228, line: 65, type: !245, isLocal: false, isDefinition: true, variable: %struct.ipset_data* (%struct.ipset_session*)** @ipset_session_data_addr)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!248, !250}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "ipset_data", file: !86, line: 21, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!252 = distinct !DIGlobalVariable(name: "ipset_session_error_addr", scope: !0, file: !228, line: 66, type: !253, isLocal: false, isDefinition: true, variable: i8* (%struct.ipset_session*)** @ipset_session_error_addr)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!238, !250}
!256 = distinct !DIGlobalVariable(name: "ipset_envopt_parse_addr", scope: !0, file: !228, line: 67, type: !257, isLocal: false, isDefinition: true, variable: i32 (%struct.ipset_session*, i32, i8*)** @ipset_envopt_parse_addr)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!173, !232, !173, !238}
!260 = distinct !DIGlobalVariable(name: "ipset_type_get_addr", scope: !0, file: !228, line: 68, type: !261, isLocal: false, isDefinition: true, variable: %struct.ipset_type* (%struct.ipset_session*, i32)** @ipset_type_get_addr)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!264, !232, !61}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipset_type", file: !267, line: 70, size: 1792, align: 64, elements: !268)
!267 = !DIFile(filename: "/usr/include/libipset/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!268 = !{!269, !270, !271, !272, !273, !276, !278, !299, !300, !314, !317, !318, !319, !323, !324, !326}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !266, file: !267, line: 71, baseType: !238, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !266, file: !267, line: 72, baseType: !123, size: 8, align: 8, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !266, file: !267, line: 73, baseType: !123, size: 8, align: 8, offset: 72)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "dimension", scope: !266, file: !267, line: 74, baseType: !123, size: 8, align: 8, offset: 80)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_check", scope: !266, file: !267, line: 75, baseType: !274, size: 8, align: 8, offset: 88)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !275, line: 194, baseType: !204)
!275 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!276 = !DIDerivedType(tag: DW_TAG_member, name: "last_elem_optional", scope: !266, file: !267, line: 76, baseType: !277, size: 8, align: 8, offset: 96)
!277 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !266, file: !267, line: 77, baseType: !279, size: 576, align: 64, offset: 128)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 576, align: 64, elements: !297)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipset_elem", file: !267, line: 60, size: 192, align: 64, elements: !281)
!281 = !{!282, !288, !296}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !280, file: !267, line: 61, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipset_parsefn", file: !284, line: 24, baseType: !285)
!284 = !DIFile(filename: "/usr/include/libipset/parse.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!173, !232, !3, !238}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !280, file: !267, line: 62, baseType: !289, size: 64, align: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipset_printfn", file: !290, line: 12, baseType: !291)
!290 = !DIFile(filename: "/usr/include/libipset/print.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!173, !175, !137, !294, !3, !123}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !280, file: !267, line: 63, baseType: !3, size: 32, align: 32, offset: 128)
!297 = !{!298}
!298 = !DISubrange(count: 3)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "compat_parse_elem", scope: !266, file: !267, line: 78, baseType: !283, size: 64, align: 64, offset: 704)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !266, file: !267, line: 79, baseType: !301, size: 256, align: 64, offset: 768)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 256, align: 64, elements: !138)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipset_arg", file: !267, line: 44, size: 320, align: 64, elements: !305)
!305 = !{!306, !310, !311, !312, !313}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !304, file: !267, line: 45, baseType: !307, size: 128, align: 64)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 128, align: 64, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 2)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !304, file: !267, line: 46, baseType: !173, size: 32, align: 32, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !304, file: !267, line: 47, baseType: !3, size: 32, align: 32, offset: 160)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !304, file: !267, line: 48, baseType: !283, size: 64, align: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !304, file: !267, line: 49, baseType: !289, size: 64, align: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "mandatory", scope: !266, file: !267, line: 80, baseType: !315, size: 256, align: 64, offset: 1024)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 256, align: 64, elements: !138)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !124, line: 55, baseType: !221)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !266, file: !267, line: 81, baseType: !315, size: 256, align: 64, offset: 1280)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !266, file: !267, line: 82, baseType: !238, size: 64, align: 64, offset: 1536)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "usagefn", scope: !266, file: !267, line: 83, baseType: !320, size: 64, align: 64, offset: 1600)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{null}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !266, file: !267, line: 84, baseType: !238, size: 64, align: 64, offset: 1664)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !267, line: 85, baseType: !325, size: 64, align: 64, offset: 1728)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !266, file: !267, line: 86, baseType: !327, offset: 1792)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, align: 64, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: -1)
!330 = distinct !DIGlobalVariable(name: "ipset_data_set_addr", scope: !0, file: !228, line: 69, type: !331, isLocal: false, isDefinition: true, variable: i32 (%struct.ipset_data*, i32, i8*)** @ipset_data_set_addr)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!173, !248, !3, !334}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!336 = distinct !DIGlobalVariable(name: "ipset_cmd_addr", scope: !0, file: !228, line: 70, type: !337, isLocal: false, isDefinition: true, variable: i32 (%struct.ipset_session*, i32, i32)** @ipset_cmd_addr)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!173, !232, !61, !136}
!340 = distinct !DIGlobalVariable(name: "ipset_load_types_addr", scope: !0, file: !228, line: 71, type: !320, isLocal: false, isDefinition: true, variable: void ()** @ipset_load_types_addr)
!341 = distinct !DIGlobalVariable(name: "libipset_handle", scope: !0, file: !228, line: 85, type: !140, isLocal: true, isDefinition: true, variable: i8** @libipset_handle)
!342 = !{i32 2, !"Dwarf Version", i32 4}
!343 = !{i32 2, !"Debug Info Version", i32 3}
!344 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!345 = distinct !DISubprogram(name: "has_ipset_setname", scope: !228, file: !228, line: 152, type: !346, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!346 = !DISubroutineType(types: !347)
!347 = !{!277, !140, !238}
!348 = !{}
!349 = !DILocalVariable(name: "vsession", arg: 1, scope: !345, file: !228, line: 152, type: !140)
!350 = !DIExpression()
!351 = !DILocation(line: 152, column: 25, scope: !345)
!352 = !DILocalVariable(name: "setname", arg: 2, scope: !345, file: !228, line: 152, type: !238)
!353 = !DILocation(line: 152, column: 47, scope: !345)
!354 = !DILocalVariable(name: "session", scope: !345, file: !228, line: 154, type: !232)
!355 = !DILocation(line: 154, column: 24, scope: !345)
!356 = !DILocation(line: 154, column: 34, scope: !345)
!357 = !DILocation(line: 156, column: 4, scope: !345)
!358 = !DILocation(line: 156, column: 3, scope: !345)
!359 = !DILocation(line: 156, column: 1, scope: !345)
!360 = !DILocation(line: 156, column: 2, scope: !361)
!361 = !DILexicalBlockFile(scope: !345, file: !228, discriminator: 1)
!362 = !DILocation(line: 158, column: 11, scope: !345)
!363 = !DILocation(line: 158, column: 27, scope: !345)
!364 = !DILocation(line: 158, column: 9, scope: !345)
!365 = !DILocation(line: 158, column: 57, scope: !345)
!366 = !DILocation(line: 158, column: 2, scope: !345)
!367 = distinct !DISubprogram(name: "ipset_init", scope: !228, file: !228, line: 223, type: !368, isLocal: false, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!368 = !DISubroutineType(types: !369)
!369 = !{!277}
!370 = !DILocation(line: 226, column: 6, scope: !371)
!371 = distinct !DILexicalBlock(scope: !367, file: !228, line: 226, column: 6)
!372 = !DILocation(line: 226, column: 6, scope: !367)
!373 = !DILocation(line: 227, column: 3, scope: !371)
!374 = !DILocation(line: 234, column: 6, scope: !375)
!375 = distinct !DILexicalBlock(scope: !367, file: !228, line: 234, column: 6)
!376 = !DILocation(line: 234, column: 19, scope: !375)
!377 = !DILocation(line: 234, column: 37, scope: !375)
!378 = !DILocation(line: 235, column: 7, scope: !375)
!379 = !DILocation(line: 235, column: 20, scope: !375)
!380 = !DILocation(line: 235, column: 42, scope: !375)
!381 = !DILocation(line: 236, column: 14, scope: !375)
!382 = !DILocation(line: 236, column: 27, scope: !375)
!383 = !DILocation(line: 236, column: 7, scope: !375)
!384 = !DILocation(line: 236, column: 61, scope: !375)
!385 = !DILocation(line: 237, column: 7, scope: !375)
!386 = !DILocation(line: 237, column: 16, scope: !375)
!387 = !DILocation(line: 237, column: 21, scope: !375)
!388 = !DILocation(line: 238, column: 8, scope: !375)
!389 = !DILocation(line: 238, column: 17, scope: !375)
!390 = !DILocation(line: 238, column: 22, scope: !375)
!391 = !DILocation(line: 238, column: 25, scope: !392)
!392 = !DILexicalBlockFile(scope: !375, file: !228, discriminator: 1)
!393 = !DILocation(line: 238, column: 34, scope: !392)
!394 = !DILocation(line: 234, column: 6, scope: !395)
!395 = !DILexicalBlockFile(scope: !367, file: !228, discriminator: 1)
!396 = !DILocation(line: 239, column: 3, scope: !397)
!397 = distinct !DILexicalBlock(scope: !375, file: !228, line: 238, column: 42)
!398 = !DILocation(line: 240, column: 3, scope: !397)
!399 = !DILocation(line: 246, column: 26, scope: !400)
!400 = distinct !DILexicalBlock(scope: !367, file: !228, line: 246, column: 6)
!401 = !DILocation(line: 246, column: 24, scope: !400)
!402 = !DILocation(line: 246, column: 58, scope: !400)
!403 = !DILocation(line: 247, column: 26, scope: !400)
!404 = !DILocation(line: 247, column: 24, scope: !400)
!405 = !DILocation(line: 246, column: 6, scope: !395)
!406 = !DILocation(line: 248, column: 61, scope: !407)
!407 = distinct !DILexicalBlock(scope: !400, file: !228, line: 247, column: 60)
!408 = !DILocation(line: 248, column: 3, scope: !409)
!409 = !DILexicalBlockFile(scope: !407, file: !228, discriminator: 1)
!410 = !DILocation(line: 249, column: 3, scope: !407)
!411 = !DILocation(line: 252, column: 40, scope: !412)
!412 = distinct !DILexicalBlock(scope: !367, file: !228, line: 252, column: 6)
!413 = !DILocation(line: 252, column: 34, scope: !412)
!414 = !DILocation(line: 252, column: 32, scope: !412)
!415 = !DILocation(line: 252, column: 80, scope: !412)
!416 = !DILocation(line: 253, column: 40, scope: !412)
!417 = !DILocation(line: 253, column: 34, scope: !412)
!418 = !DILocation(line: 253, column: 32, scope: !412)
!419 = !DILocation(line: 253, column: 80, scope: !412)
!420 = !DILocation(line: 254, column: 40, scope: !412)
!421 = !DILocation(line: 254, column: 34, scope: !412)
!422 = !DILocation(line: 254, column: 32, scope: !412)
!423 = !DILocation(line: 254, column: 79, scope: !412)
!424 = !DILocation(line: 255, column: 41, scope: !412)
!425 = !DILocation(line: 255, column: 35, scope: !412)
!426 = !DILocation(line: 255, column: 33, scope: !412)
!427 = !DILocation(line: 255, column: 81, scope: !412)
!428 = !DILocation(line: 256, column: 40, scope: !412)
!429 = !DILocation(line: 256, column: 34, scope: !412)
!430 = !DILocation(line: 256, column: 32, scope: !412)
!431 = !DILocation(line: 256, column: 79, scope: !412)
!432 = !DILocation(line: 257, column: 36, scope: !412)
!433 = !DILocation(line: 257, column: 30, scope: !412)
!434 = !DILocation(line: 257, column: 28, scope: !412)
!435 = !DILocation(line: 257, column: 71, scope: !412)
!436 = !DILocation(line: 258, column: 36, scope: !412)
!437 = !DILocation(line: 258, column: 30, scope: !412)
!438 = !DILocation(line: 258, column: 28, scope: !412)
!439 = !DILocation(line: 258, column: 71, scope: !412)
!440 = !DILocation(line: 259, column: 31, scope: !412)
!441 = !DILocation(line: 259, column: 25, scope: !412)
!442 = !DILocation(line: 259, column: 23, scope: !412)
!443 = !DILocation(line: 259, column: 61, scope: !412)
!444 = !DILocation(line: 260, column: 38, scope: !412)
!445 = !DILocation(line: 260, column: 32, scope: !412)
!446 = !DILocation(line: 260, column: 30, scope: !412)
!447 = !DILocation(line: 252, column: 6, scope: !395)
!448 = !DILocation(line: 261, column: 73, scope: !449)
!449 = distinct !DILexicalBlock(scope: !412, file: !228, line: 260, column: 76)
!450 = !DILocation(line: 261, column: 3, scope: !451)
!451 = !DILexicalBlockFile(scope: !449, file: !228, discriminator: 1)
!452 = !DILocation(line: 262, column: 3, scope: !449)
!453 = !DILocation(line: 266, column: 4, scope: !367)
!454 = !DILocation(line: 266, column: 2, scope: !367)
!455 = !DILocation(line: 268, column: 7, scope: !456)
!456 = distinct !DILexicalBlock(scope: !367, file: !228, line: 268, column: 6)
!457 = !DILocation(line: 268, column: 26, scope: !456)
!458 = !DILocation(line: 268, column: 30, scope: !459)
!459 = !DILexicalBlockFile(scope: !456, file: !228, discriminator: 1)
!460 = !DILocation(line: 268, column: 6, scope: !459)
!461 = !DILocation(line: 269, column: 3, scope: !462)
!462 = distinct !DILexicalBlock(scope: !456, file: !228, line: 268, column: 71)
!463 = !DILocation(line: 270, column: 3, scope: !462)
!464 = !DILocation(line: 273, column: 2, scope: !367)
!465 = !DILocation(line: 274, column: 1, scope: !367)
!466 = distinct !DISubprogram(name: "set_match_loaded", scope: !228, file: !228, line: 200, type: !368, isLocal: true, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!467 = !DILocalVariable(name: "buf", scope: !466, file: !228, line: 202, type: !468)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 248, align: 8, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 31)
!471 = !DILocation(line: 202, column: 7, scope: !466)
!472 = !DILocalVariable(name: "fp", scope: !466, file: !228, line: 203, type: !166)
!473 = !DILocation(line: 203, column: 8, scope: !466)
!474 = !DILocalVariable(name: "found", scope: !466, file: !228, line: 204, type: !277)
!475 = !DILocation(line: 204, column: 6, scope: !466)
!476 = !DILocation(line: 206, column: 7, scope: !466)
!477 = !DILocation(line: 206, column: 5, scope: !466)
!478 = !DILocation(line: 207, column: 7, scope: !479)
!479 = distinct !DILexicalBlock(scope: !466, file: !228, line: 207, column: 6)
!480 = !DILocation(line: 207, column: 6, scope: !466)
!481 = !DILocation(line: 208, column: 3, scope: !479)
!482 = !DILocation(line: 210, column: 2, scope: !466)
!483 = !DILocation(line: 210, column: 15, scope: !484)
!484 = !DILexicalBlockFile(scope: !466, file: !228, discriminator: 1)
!485 = !DILocation(line: 210, column: 33, scope: !484)
!486 = !DILocation(line: 210, column: 9, scope: !484)
!487 = !DILocation(line: 210, column: 2, scope: !484)
!488 = !DILocation(line: 211, column: 8, scope: !489)
!489 = distinct !DILexicalBlock(scope: !490, file: !228, line: 211, column: 7)
!490 = distinct !DILexicalBlock(scope: !466, file: !228, line: 210, column: 38)
!491 = !DILocation(line: 211, column: 15, scope: !489)
!492 = !DILocation(line: 211, column: 23, scope: !489)
!493 = !DILocation(line: 211, column: 26, scope: !494)
!494 = !DILexicalBlockFile(scope: !489, file: !228, discriminator: 1)
!495 = !DILocation(line: 211, column: 33, scope: !494)
!496 = !DILocation(line: 211, column: 42, scope: !494)
!497 = !DILocation(line: 212, column: 16, scope: !489)
!498 = !DILocation(line: 212, column: 8, scope: !489)
!499 = !DILocation(line: 211, column: 7, scope: !500)
!500 = !DILexicalBlockFile(scope: !490, file: !228, discriminator: 2)
!501 = !DILocation(line: 213, column: 10, scope: !502)
!502 = distinct !DILexicalBlock(scope: !489, file: !228, line: 212, column: 32)
!503 = !DILocation(line: 214, column: 4, scope: !502)
!504 = !DILocation(line: 210, column: 2, scope: !505)
!505 = !DILexicalBlockFile(scope: !466, file: !228, discriminator: 2)
!506 = distinct !{!506, !482}
!507 = !DILocation(line: 218, column: 9, scope: !466)
!508 = !DILocation(line: 218, column: 2, scope: !466)
!509 = !DILocation(line: 220, column: 9, scope: !466)
!510 = !DILocation(line: 220, column: 2, scope: !466)
!511 = !DILocation(line: 221, column: 1, scope: !466)
!512 = distinct !DISubprogram(name: "remove_ipsets", scope: !228, file: !228, line: 276, type: !368, isLocal: false, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!513 = !DILocalVariable(name: "session", scope: !512, file: !228, line: 278, type: !232)
!514 = !DILocation(line: 278, column: 24, scope: !512)
!515 = !DILocation(line: 280, column: 7, scope: !516)
!516 = distinct !DILexicalBlock(scope: !512, file: !228, line: 280, column: 6)
!517 = !DILocation(line: 280, column: 20, scope: !516)
!518 = !DILocation(line: 280, column: 6, scope: !512)
!519 = !DILocation(line: 281, column: 3, scope: !516)
!520 = !DILocation(line: 284, column: 7, scope: !521)
!521 = distinct !DILexicalBlock(scope: !512, file: !228, line: 284, column: 6)
!522 = !DILocation(line: 284, column: 6, scope: !512)
!523 = !DILocation(line: 285, column: 3, scope: !521)
!524 = !DILocation(line: 288, column: 14, scope: !512)
!525 = !DILocation(line: 288, column: 12, scope: !512)
!526 = !DILocation(line: 288, column: 10, scope: !512)
!527 = !DILocation(line: 289, column: 7, scope: !528)
!528 = distinct !DILexicalBlock(scope: !512, file: !228, line: 289, column: 6)
!529 = !DILocation(line: 289, column: 6, scope: !512)
!530 = !DILocation(line: 290, column: 3, scope: !531)
!531 = distinct !DILexicalBlock(scope: !528, file: !228, line: 289, column: 16)
!532 = !DILocation(line: 291, column: 3, scope: !531)
!533 = !DILocation(line: 294, column: 6, scope: !534)
!534 = distinct !DILexicalBlock(scope: !512, file: !228, line: 294, column: 6)
!535 = !DILocation(line: 294, column: 6, scope: !512)
!536 = !DILocation(line: 295, column: 17, scope: !534)
!537 = !DILocation(line: 295, column: 26, scope: !534)
!538 = !DILocation(line: 295, column: 39, scope: !534)
!539 = !DILocation(line: 295, column: 3, scope: !534)
!540 = !DILocation(line: 297, column: 6, scope: !541)
!541 = distinct !DILexicalBlock(scope: !512, file: !228, line: 297, column: 6)
!542 = !DILocation(line: 297, column: 6, scope: !512)
!543 = !DILocation(line: 298, column: 17, scope: !544)
!544 = distinct !DILexicalBlock(scope: !541, file: !228, line: 297, column: 18)
!545 = !DILocation(line: 298, column: 26, scope: !544)
!546 = !DILocation(line: 298, column: 39, scope: !544)
!547 = !DILocation(line: 298, column: 3, scope: !544)
!548 = !DILocation(line: 299, column: 17, scope: !544)
!549 = !DILocation(line: 299, column: 26, scope: !544)
!550 = !DILocation(line: 299, column: 39, scope: !544)
!551 = !DILocation(line: 299, column: 3, scope: !544)
!552 = !DILocation(line: 300, column: 2, scope: !544)
!553 = !DILocation(line: 302, column: 4, scope: !512)
!554 = !DILocation(line: 302, column: 29, scope: !512)
!555 = !DILocation(line: 302, column: 2, scope: !512)
!556 = !DILocation(line: 304, column: 2, scope: !512)
!557 = !DILocation(line: 305, column: 1, scope: !512)
!558 = distinct !DISubprogram(name: "ipset_destroy", scope: !228, file: !228, line: 141, type: !559, isLocal: true, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!559 = !DISubroutineType(types: !560)
!560 = !{!277, !232, !238}
!561 = !DILocalVariable(name: "session", arg: 1, scope: !558, file: !228, line: 141, type: !232)
!562 = !DILocation(line: 141, column: 37, scope: !558)
!563 = !DILocalVariable(name: "setname", arg: 2, scope: !558, file: !228, line: 141, type: !238)
!564 = !DILocation(line: 141, column: 58, scope: !558)
!565 = !DILocalVariable(name: "r", scope: !558, file: !228, line: 143, type: !173)
!566 = !DILocation(line: 143, column: 6, scope: !558)
!567 = !DILocation(line: 145, column: 4, scope: !558)
!568 = !DILocation(line: 145, column: 3, scope: !558)
!569 = !DILocation(line: 145, column: 1, scope: !558)
!570 = !DILocation(line: 145, column: 2, scope: !571)
!571 = !DILexicalBlockFile(scope: !558, file: !228, discriminator: 1)
!572 = !DILocation(line: 147, column: 8, scope: !558)
!573 = !DILocation(line: 147, column: 24, scope: !558)
!574 = !DILocation(line: 147, column: 6, scope: !558)
!575 = !DILocation(line: 147, column: 4, scope: !558)
!576 = !DILocation(line: 148, column: 9, scope: !558)
!577 = !DILocation(line: 148, column: 11, scope: !558)
!578 = !DILocation(line: 148, column: 2, scope: !558)
!579 = distinct !DISubprogram(name: "add_ipsets", scope: !228, file: !228, line: 307, type: !580, isLocal: false, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!580 = !DISubroutineType(types: !581)
!581 = !{!277, !277}
!582 = !DILocalVariable(name: "reload", arg: 1, scope: !579, file: !228, line: 307, type: !277)
!583 = !DILocation(line: 307, column: 21, scope: !579)
!584 = !DILocation(line: 309, column: 21, scope: !579)
!585 = !DILocation(line: 309, column: 34, scope: !579)
!586 = !DILocation(line: 309, column: 54, scope: !579)
!587 = !DILocation(line: 309, column: 67, scope: !579)
!588 = !DILocation(line: 309, column: 88, scope: !579)
!589 = !DILocation(line: 309, column: 101, scope: !579)
!590 = !DILocation(line: 309, column: 128, scope: !579)
!591 = !DILocation(line: 309, column: 9, scope: !579)
!592 = !DILocation(line: 309, column: 2, scope: !579)
!593 = distinct !DISubprogram(name: "create_sets", scope: !228, file: !228, line: 161, type: !594, isLocal: true, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!594 = !DISubroutineType(types: !595)
!595 = !{!277, !238, !238, !238, !277}
!596 = !DILocalVariable(name: "addr4", arg: 1, scope: !593, file: !228, line: 161, type: !238)
!597 = !DILocation(line: 161, column: 36, scope: !593)
!598 = !DILocalVariable(name: "addr6", arg: 2, scope: !593, file: !228, line: 161, type: !238)
!599 = !DILocation(line: 161, column: 55, scope: !593)
!600 = !DILocalVariable(name: "addr_if6", arg: 3, scope: !593, file: !228, line: 161, type: !238)
!601 = !DILocation(line: 161, column: 74, scope: !593)
!602 = !DILocalVariable(name: "reload", arg: 4, scope: !593, file: !228, line: 161, type: !277)
!603 = !DILocation(line: 161, column: 89, scope: !593)
!604 = !DILocalVariable(name: "session", scope: !593, file: !228, line: 163, type: !232)
!605 = !DILocation(line: 163, column: 24, scope: !593)
!606 = !DILocation(line: 165, column: 14, scope: !593)
!607 = !DILocation(line: 165, column: 12, scope: !593)
!608 = !DILocation(line: 165, column: 10, scope: !593)
!609 = !DILocation(line: 166, column: 7, scope: !610)
!610 = distinct !DILexicalBlock(scope: !593, file: !228, line: 166, column: 6)
!611 = !DILocation(line: 166, column: 6, scope: !593)
!612 = !DILocation(line: 167, column: 3, scope: !613)
!613 = distinct !DILexicalBlock(scope: !610, file: !228, line: 166, column: 16)
!614 = !DILocation(line: 168, column: 3, scope: !613)
!615 = !DILocation(line: 173, column: 7, scope: !616)
!616 = distinct !DILexicalBlock(scope: !593, file: !228, line: 173, column: 6)
!617 = !DILocation(line: 173, column: 6, scope: !593)
!618 = !DILocation(line: 174, column: 5, scope: !616)
!619 = !DILocation(line: 174, column: 30, scope: !616)
!620 = !DILocation(line: 174, column: 3, scope: !616)
!621 = !DILocation(line: 176, column: 6, scope: !622)
!622 = distinct !DILexicalBlock(scope: !593, file: !228, line: 176, column: 6)
!623 = !DILocation(line: 176, column: 6, scope: !593)
!624 = !DILocation(line: 177, column: 8, scope: !625)
!625 = distinct !DILexicalBlock(scope: !626, file: !228, line: 177, column: 7)
!626 = distinct !DILexicalBlock(scope: !622, file: !228, line: 176, column: 18)
!627 = !DILocation(line: 177, column: 15, scope: !625)
!628 = !DILocation(line: 177, column: 37, scope: !629)
!629 = !DILexicalBlockFile(scope: !625, file: !228, discriminator: 1)
!630 = !DILocation(line: 177, column: 46, scope: !629)
!631 = !DILocation(line: 177, column: 19, scope: !629)
!632 = !DILocation(line: 177, column: 7, scope: !629)
!633 = !DILocation(line: 178, column: 17, scope: !625)
!634 = !DILocation(line: 178, column: 26, scope: !625)
!635 = !DILocation(line: 178, column: 4, scope: !625)
!636 = !DILocation(line: 179, column: 2, scope: !626)
!637 = !DILocation(line: 181, column: 6, scope: !638)
!638 = distinct !DILexicalBlock(scope: !593, file: !228, line: 181, column: 6)
!639 = !DILocation(line: 181, column: 6, scope: !593)
!640 = !DILocation(line: 182, column: 8, scope: !641)
!641 = distinct !DILexicalBlock(scope: !642, file: !228, line: 182, column: 7)
!642 = distinct !DILexicalBlock(scope: !638, file: !228, line: 181, column: 18)
!643 = !DILocation(line: 182, column: 15, scope: !641)
!644 = !DILocation(line: 182, column: 37, scope: !645)
!645 = !DILexicalBlockFile(scope: !641, file: !228, discriminator: 1)
!646 = !DILocation(line: 182, column: 46, scope: !645)
!647 = !DILocation(line: 182, column: 19, scope: !645)
!648 = !DILocation(line: 182, column: 7, scope: !645)
!649 = !DILocation(line: 183, column: 17, scope: !641)
!650 = !DILocation(line: 183, column: 26, scope: !641)
!651 = !DILocation(line: 183, column: 4, scope: !641)
!652 = !DILocation(line: 184, column: 8, scope: !653)
!653 = distinct !DILexicalBlock(scope: !642, file: !228, line: 184, column: 7)
!654 = !DILocation(line: 184, column: 15, scope: !653)
!655 = !DILocation(line: 184, column: 37, scope: !656)
!656 = !DILexicalBlockFile(scope: !653, file: !228, discriminator: 1)
!657 = !DILocation(line: 184, column: 46, scope: !656)
!658 = !DILocation(line: 184, column: 19, scope: !656)
!659 = !DILocation(line: 184, column: 7, scope: !656)
!660 = !DILocation(line: 187, column: 17, scope: !661)
!661 = distinct !DILexicalBlock(scope: !653, file: !228, line: 184, column: 57)
!662 = !DILocation(line: 187, column: 26, scope: !661)
!663 = !DILocation(line: 187, column: 4, scope: !661)
!664 = !DILocation(line: 191, column: 3, scope: !661)
!665 = !DILocation(line: 192, column: 2, scope: !642)
!666 = !DILocation(line: 194, column: 4, scope: !593)
!667 = !DILocation(line: 194, column: 29, scope: !593)
!668 = !DILocation(line: 194, column: 2, scope: !593)
!669 = !DILocation(line: 196, column: 2, scope: !593)
!670 = !DILocation(line: 197, column: 1, scope: !593)
!671 = distinct !DISubprogram(name: "ipset_session_start", scope: !228, file: !228, line: 312, type: !672, isLocal: false, isDefinition: true, scopeLine: 313, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!672 = !DISubroutineType(types: !673)
!673 = !{!140}
!674 = !DILocation(line: 314, column: 11, scope: !671)
!675 = !DILocation(line: 314, column: 9, scope: !671)
!676 = !DILocation(line: 314, column: 2, scope: !671)
!677 = distinct !DISubprogram(name: "ipset_session_end", scope: !228, file: !228, line: 317, type: !160, isLocal: false, isDefinition: true, scopeLine: 318, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!678 = !DILocalVariable(name: "vsession", arg: 1, scope: !677, file: !228, line: 317, type: !140)
!679 = !DILocation(line: 317, column: 30, scope: !677)
!680 = !DILocalVariable(name: "session", scope: !677, file: !228, line: 319, type: !232)
!681 = !DILocation(line: 319, column: 24, scope: !677)
!682 = !DILocation(line: 319, column: 34, scope: !677)
!683 = !DILocation(line: 321, column: 4, scope: !677)
!684 = !DILocation(line: 321, column: 29, scope: !677)
!685 = !DILocation(line: 321, column: 2, scope: !677)
!686 = !DILocation(line: 322, column: 1, scope: !677)
!687 = distinct !DISubprogram(name: "ipset_entry", scope: !228, file: !228, line: 324, type: !688, isLocal: false, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !140, !173, !690}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_address_t", file: !693, line: 73, baseType: !694)
!693 = !DIFile(filename: "./../include/vrrp_ipaddress.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_address", file: !693, line: 41, size: 704, align: 64, elements: !695)
!695 = !{!696, !708, !721, !781, !782, !783, !784, !785, !790, !791, !809, !810, !811}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ifa", scope: !694, file: !693, line: 42, baseType: !697, size: 64, align: 32)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifaddrmsg", file: !698, line: 7, size: 64, align: 32, elements: !699)
!698 = !DIFile(filename: "/usr/include/linux/if_addr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!699 = !{!700, !703, !704, !705, !706}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_family", scope: !697, file: !698, line: 8, baseType: !701, size: 8, align: 8)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !702, line: 20, baseType: !125)
!702 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_prefixlen", scope: !697, file: !698, line: 9, baseType: !701, size: 8, align: 8, offset: 8)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_flags", scope: !697, file: !698, line: 10, baseType: !701, size: 8, align: 8, offset: 16)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_scope", scope: !697, file: !698, line: 11, baseType: !701, size: 8, align: 8, offset: 24)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_index", scope: !697, file: !698, line: 12, baseType: !707, size: 32, align: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !702, line: 26, baseType: !137)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !694, file: !693, line: 50, baseType: !709, size: 128, align: 32, offset: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !694, file: !693, line: 44, size: 128, align: 32, elements: !710)
!710 = !{!711, !720}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !709, file: !693, line: 48, baseType: !712, size: 64, align: 32)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !709, file: !693, line: 45, size: 64, align: 32, elements: !713)
!713 = !{!714, !719}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !712, file: !693, line: 46, baseType: !715, size: 32, align: 32)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !116, line: 31, size: 32, align: 32, elements: !716)
!716 = !{!717}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !715, file: !116, line: 33, baseType: !718, size: 32, align: 32)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !116, line: 30, baseType: !136)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "sin_brd", scope: !712, file: !693, line: 47, baseType: !715, size: 32, align: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !709, file: !693, line: 49, baseType: !115, size: 128, align: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !694, file: !693, line: 52, baseType: !722, size: 64, align: 64, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !143, line: 111, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !143, line: 76, size: 1792, align: 64, elements: !725)
!725 = !{!726, !728, !730, !731, !732, !733, !734, !735, !736, !742, !743, !744, !745, !746, !747, !749, !750, !751, !752, !773, !774, !775, !776, !777, !778, !779, !780}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !724, file: !143, line: 77, baseType: !727, size: 128, align: 8)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 128, align: 8, elements: !126)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !724, file: !143, line: 78, baseType: !729, size: 32, align: 32, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !143, line: 62, baseType: !136)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !724, file: !143, line: 79, baseType: !715, size: 32, align: 32, offset: 160)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !724, file: !143, line: 80, baseType: !115, size: 128, align: 32, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !724, file: !143, line: 81, baseType: !137, size: 32, align: 32, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !724, file: !143, line: 82, baseType: !277, size: 8, align: 8, offset: 352)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !724, file: !143, line: 83, baseType: !136, size: 32, align: 32, offset: 384)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !724, file: !143, line: 84, baseType: !131, size: 16, align: 16, offset: 416)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !724, file: !143, line: 85, baseType: !737, size: 256, align: 8, offset: 432)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !738, size: 256, align: 8, elements: !740)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !275, line: 33, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !200, line: 30, baseType: !125)
!740 = !{!741}
!741 = !DISubrange(count: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !724, file: !143, line: 86, baseType: !737, size: 256, align: 8, offset: 688)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !724, file: !143, line: 87, baseType: !219, size: 64, align: 64, offset: 960)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !724, file: !143, line: 88, baseType: !173, size: 32, align: 32, offset: 1024)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !724, file: !143, line: 90, baseType: !277, size: 8, align: 8, offset: 1056)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !724, file: !143, line: 91, baseType: !729, size: 32, align: 32, offset: 1088)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !724, file: !143, line: 92, baseType: !748, size: 64, align: 64, offset: 1152)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64, align: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !724, file: !143, line: 94, baseType: !729, size: 32, align: 32, offset: 1216)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !724, file: !143, line: 96, baseType: !748, size: 64, align: 64, offset: 1280)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !724, file: !143, line: 97, baseType: !277, size: 8, align: 8, offset: 1344)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !724, file: !143, line: 100, baseType: !753, size: 64, align: 64, offset: 1408)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !143, line: 73, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !143, line: 65, size: 704, align: 64, elements: !756)
!756 = !{!757, !767, !768, !769, !770, !771, !772}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !755, file: !143, line: 66, baseType: !758, size: 128, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !759, line: 31, baseType: !760)
!759 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !761, line: 30, size: 128, align: 64, elements: !762)
!761 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!762 = !{!763, !765}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !760, file: !761, line: 32, baseType: !764, size: 64, align: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !200, line: 139, baseType: !201)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !760, file: !761, line: 33, baseType: !766, size: 64, align: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !200, line: 141, baseType: !201)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !755, file: !143, line: 67, baseType: !277, size: 8, align: 8, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !755, file: !143, line: 68, baseType: !758, size: 128, align: 64, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !755, file: !143, line: 69, baseType: !277, size: 8, align: 8, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !755, file: !143, line: 70, baseType: !758, size: 128, align: 64, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !755, file: !143, line: 71, baseType: !758, size: 128, align: 64, offset: 512)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !755, file: !143, line: 72, baseType: !173, size: 32, align: 32, offset: 640)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !724, file: !143, line: 101, baseType: !277, size: 8, align: 8, offset: 1472)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !724, file: !143, line: 102, baseType: !173, size: 32, align: 32, offset: 1504)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !724, file: !143, line: 103, baseType: !136, size: 32, align: 32, offset: 1536)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !724, file: !143, line: 104, baseType: !136, size: 32, align: 32, offset: 1568)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !724, file: !143, line: 105, baseType: !136, size: 32, align: 32, offset: 1600)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !724, file: !143, line: 107, baseType: !137, size: 32, align: 32, offset: 1632)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !724, file: !143, line: 109, baseType: !277, size: 8, align: 8, offset: 1664)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !724, file: !143, line: 110, baseType: !144, size: 64, align: 64, offset: 1728)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !694, file: !693, line: 53, baseType: !175, size: 64, align: 64, offset: 256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !694, file: !693, line: 55, baseType: !136, size: 32, align: 32, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "flagmask", scope: !694, file: !693, line: 56, baseType: !136, size: 32, align: 32, offset: 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "have_peer", scope: !694, file: !693, line: 61, baseType: !277, size: 8, align: 8, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !694, file: !693, line: 65, baseType: !786, size: 128, align: 32, offset: 416)
!786 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !694, file: !693, line: 62, size: 128, align: 32, elements: !787)
!787 = !{!788, !789}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !786, file: !693, line: 63, baseType: !715, size: 32, align: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !786, file: !693, line: 64, baseType: !115, size: 128, align: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track", scope: !694, file: !693, line: 66, baseType: !277, size: 8, align: 8, offset: 544)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "track_group", scope: !694, file: !693, line: 67, baseType: !792, size: 64, align: 64, offset: 576)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64, align: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "static_track_group_t", file: !794, line: 39, baseType: !795)
!794 = !DIFile(filename: "./../include/vrrp_static_track.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_track_group", file: !794, line: 35, size: 192, align: 64, elements: !796)
!796 = !{!797, !798, !808}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !795, file: !794, line: 36, baseType: !175, size: 64, align: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !795, file: !794, line: 37, baseType: !799, size: 64, align: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64, align: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !801, line: 34, baseType: !802)
!801 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !801, line: 30, size: 128, align: 64, elements: !803)
!803 = !{!804, !805, !806}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !802, file: !801, line: 31, baseType: !137, size: 32, align: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !802, file: !801, line: 32, baseType: !137, size: 32, align: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !802, file: !801, line: 33, baseType: !807, size: 64, align: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !795, file: !794, line: 38, baseType: !144, size: 64, align: 64, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !694, file: !693, line: 69, baseType: !277, size: 8, align: 8, offset: 640)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rule_set", scope: !694, file: !693, line: 70, baseType: !277, size: 8, align: 8, offset: 648)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "garp_gna_pending", scope: !694, file: !693, line: 72, baseType: !277, size: 8, align: 8, offset: 656)
!812 = !DILocalVariable(name: "vsession", arg: 1, scope: !687, file: !228, line: 324, type: !140)
!813 = !DILocation(line: 324, column: 24, scope: !687)
!814 = !DILocalVariable(name: "cmd", arg: 2, scope: !687, file: !228, line: 324, type: !173)
!815 = !DILocation(line: 324, column: 38, scope: !687)
!816 = !DILocalVariable(name: "addr", arg: 3, scope: !687, file: !228, line: 324, type: !690)
!817 = !DILocation(line: 324, column: 63, scope: !687)
!818 = !DILocalVariable(name: "set", scope: !687, file: !228, line: 326, type: !238)
!819 = !DILocation(line: 326, column: 14, scope: !687)
!820 = !DILocalVariable(name: "iface", scope: !687, file: !228, line: 327, type: !175)
!821 = !DILocation(line: 327, column: 8, scope: !687)
!822 = !DILocalVariable(name: "session", scope: !687, file: !228, line: 328, type: !232)
!823 = !DILocation(line: 328, column: 24, scope: !687)
!824 = !DILocation(line: 328, column: 34, scope: !687)
!825 = !DILocation(line: 331, column: 6, scope: !826)
!826 = distinct !DILexicalBlock(scope: !687, file: !228, line: 331, column: 6)
!827 = !DILocation(line: 331, column: 12, scope: !826)
!828 = !DILocation(line: 331, column: 16, scope: !826)
!829 = !DILocation(line: 331, column: 27, scope: !826)
!830 = !DILocation(line: 331, column: 6, scope: !687)
!831 = !DILocation(line: 332, column: 8, scope: !832)
!832 = distinct !DILexicalBlock(scope: !833, file: !228, line: 332, column: 7)
!833 = distinct !DILexicalBlock(scope: !826, file: !228, line: 331, column: 38)
!834 = !DILocation(line: 332, column: 7, scope: !833)
!835 = !DILocation(line: 333, column: 4, scope: !832)
!836 = !DILocation(line: 334, column: 9, scope: !833)
!837 = !DILocation(line: 334, column: 22, scope: !833)
!838 = !DILocation(line: 334, column: 7, scope: !833)
!839 = !DILocation(line: 335, column: 2, scope: !833)
!840 = !DILocalVariable(name: "__a", scope: !841, file: !228, line: 336, type: !113)
!841 = distinct !DILexicalBlock(scope: !842, file: !228, line: 336, column: 26)
!842 = distinct !DILexicalBlock(scope: !826, file: !228, line: 336, column: 10)
!843 = !DILocation(line: 336, column: 51, scope: !841)
!844 = !DILocation(line: 336, column: 11, scope: !841)
!845 = !DILocation(line: 336, column: 17, scope: !841)
!846 = !DILocation(line: 336, column: 19, scope: !841)
!847 = !DILocation(line: 336, column: 14, scope: !841)
!848 = !DILocation(line: 336, column: 27, scope: !841)
!849 = !DILocation(line: 336, column: 44, scope: !841)
!850 = !DILocation(line: 336, column: 42, scope: !841)
!851 = !DILocation(line: 336, column: 67, scope: !852)
!852 = !DILexicalBlockFile(scope: !841, file: !228, discriminator: 1)
!853 = !DILocation(line: 336, column: 64, scope: !841)
!854 = !DILocation(line: 336, column: 28, scope: !841)
!855 = !DILocation(line: 336, column: 87, scope: !841)
!856 = !DILocation(line: 336, column: 25, scope: !842)
!857 = !DILocation(line: 336, column: 10, scope: !826)
!858 = !DILocation(line: 337, column: 8, scope: !859)
!859 = distinct !DILexicalBlock(scope: !860, file: !228, line: 337, column: 7)
!860 = distinct !DILexicalBlock(scope: !842, file: !228, line: 336, column: 53)
!861 = !DILocation(line: 337, column: 7, scope: !860)
!862 = !DILocation(line: 338, column: 4, scope: !859)
!863 = !DILocation(line: 340, column: 9, scope: !860)
!864 = !DILocation(line: 340, column: 22, scope: !860)
!865 = !DILocation(line: 340, column: 7, scope: !860)
!866 = !DILocation(line: 342, column: 11, scope: !860)
!867 = !DILocation(line: 342, column: 17, scope: !860)
!868 = !DILocation(line: 342, column: 22, scope: !860)
!869 = !DILocation(line: 342, column: 9, scope: !860)
!870 = !DILocation(line: 344, column: 2, scope: !860)
!871 = !DILocation(line: 346, column: 9, scope: !842)
!872 = !DILocation(line: 346, column: 22, scope: !842)
!873 = !DILocation(line: 346, column: 7, scope: !842)
