; ModuleID = './[inter]keepalived--vrrp--vrrp_daemon.o.i'
source_filename = "./[inter]keepalived--vrrp--vrrp_daemon.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._thread_master = type { %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.list_head, %struct.list_head, %struct.list_head, %struct._list*, %struct.rb_root, %struct.epoll_event*, %struct._thread_event*, i32, i32, i32, i32, %struct._thread*, i64, i64, i8 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.rb_root = type { %struct.rb_node* }
%struct.rb_node = type { i64, %struct.rb_node*, %struct.rb_node* }
%struct.epoll_event = type opaque
%struct._thread_event = type { %struct._thread*, %struct._thread*, i64, i32, %struct.rb_node }
%struct._thread = type { i64, i32, %struct._thread_master*, i32 (%struct._thread*)*, i8*, %struct.timeval, %union.anon, %struct._thread_event*, %union.anon.0 }
%struct.timeval = type { i64, i64 }

!22 = !DIEnumerator(name: "LOG_ADDRESS_CHANGES", value: 10)
!23 = !DIEnumerator(name: "CONFIG_TEST_BIT", value: 11)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 41, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!26 = !DIEnumerator(name: "THREAD_READ", value: 0)
!27 = !DIEnumerator(name: "THREAD_WRITE", value: 1)
!28 = !DIEnumerator(name: "THREAD_TIMER", value: 2)
!29 = !DIEnumerator(name: "THREAD_TIMER_SHUTDOWN", value: 3)
!30 = !DIEnumerator(name: "THREAD_EVENT", value: 4)
!31 = !DIEnumerator(name: "THREAD_CHILD", value: 5)
!32 = !DIEnumerator(name: "THREAD_READY", value: 6)
!33 = !DIEnumerator(name: "THREAD_UNUSED", value: 7)
!34 = !DIEnumerator(name: "THREAD_WRITE_TIMEOUT", value: 8)
!35 = !DIEnumerator(name: "THREAD_READ_TIMEOUT", value: 9)
!36 = !DIEnumerator(name: "THREAD_CHILD_TIMEOUT", value: 10)
!37 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!38 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!39 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!40 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!41 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!42 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!43 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chksum_compatibility", file: !45, line: 173, size: 32, align: 32, elements: !46)
!45 = !DIFile(filename: "./../include/vrrp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!46 = !{!47, !48, !49, !50, !51}
!47 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NONE", value: 0)
!48 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NEVER", value: 1)
!49 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_MIN_COMPAT", value: 2)
!50 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_CONFIG", value: 3)
!51 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_AUTO", value: 4)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "if_lookup", file: !53, line: 142, size: 32, align: 32, elements: !54)
!53 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!54 = !{!55, !56, !57, !58}
!55 = !DIEnumerator(name: "IF_NO_CREATE", value: 0)
!56 = !DIEnumerator(name: "IF_CREATE_IF_DYNAMIC", value: 1)
!57 = !DIEnumerator(name: "IF_CREATE_ALWAYS", value: 2)
!58 = !DIEnumerator(name: "IF_CREATE_NETLINK", value: 3)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 44, size: 32, align: 32, elements: !61)
!60 = !DIFile(filename: "../../lib/parser.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!62 = !DIEnumerator(name: "CONFIG_OK", value: 0)
!63 = !DIEnumerator(name: "CONFIG_FILE_NOT_FOUND", value: 1)
!64 = !DIEnumerator(name: "CONFIG_BAD_IF", value: 2)
!65 = !DIEnumerator(name: "CONFIG_FATAL", value: 3)
!66 = !DIEnumerator(name: "CONFIG_MULTIPLE_FILES", value: 4)
!67 = !DIEnumerator(name: "CONFIG_UNKNOWN_KEYWORD", value: 5)
!68 = !DIEnumerator(name: "CONFIG_UNEXPECTED_BOB", value: 6)
!69 = !DIEnumerator(name: "CONFIG_MISSING_BOB", value: 7)
!70 = !DIEnumerator(name: "CONFIG_UNMATCHED_QUOTE", value: 8)
!71 = !DIEnumerator(name: "CONFIG_MISSING_PARAMETER", value: 9)
!72 = !DIEnumerator(name: "CONFIG_INVALID_NUMBER", value: 10)
!73 = !DIEnumerator(name: "CONFIG_GENERAL_ERROR", value: 11)
!74 = !DIEnumerator(name: "CONFIG_SECURITY_ERROR", value: 12)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rlimit_resource", file: !76, line: 31, size: 32, align: 32, elements: !77)
!76 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/resource.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!78 = !DIEnumerator(name: "RLIMIT_CPU", value: 0)
!79 = !DIEnumerator(name: "RLIMIT_FSIZE", value: 1)
!80 = !DIEnumerator(name: "RLIMIT_DATA", value: 2)
!81 = !DIEnumerator(name: "RLIMIT_STACK", value: 3)
!82 = !DIEnumerator(name: "RLIMIT_CORE", value: 4)
!83 = !DIEnumerator(name: "__RLIMIT_RSS", value: 5)
!84 = !DIEnumerator(name: "RLIMIT_NOFILE", value: 7)
!85 = !DIEnumerator(name: "__RLIMIT_OFILE", value: 7)
!86 = !DIEnumerator(name: "RLIMIT_AS", value: 9)
!87 = !DIEnumerator(name: "__RLIMIT_NPROC", value: 6)
!88 = !DIEnumerator(name: "__RLIMIT_MEMLOCK", value: 8)
!89 = !DIEnumerator(name: "__RLIMIT_LOCKS", value: 10)
!90 = !DIEnumerator(name: "__RLIMIT_SIGPENDING", value: 11)
!91 = !DIEnumerator(name: "__RLIMIT_MSGQUEUE", value: 12)
!92 = !DIEnumerator(name: "__RLIMIT_NICE", value: 13)
!93 = !DIEnumerator(name: "__RLIMIT_RTPRIO", value: 14)
!94 = !DIEnumerator(name: "__RLIMIT_RTTIME", value: 15)
!95 = !DIEnumerator(name: "__RLIMIT_NLIMITS", value: 16)
!96 = !DIEnumerator(name: "__RLIM_NLIMITS", value: 16)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rusage_who", file: !76, line: 158, size: 32, align: 32, elements: !98)
!98 = !{!99, !100, !101}
!99 = !DIEnumerator(name: "RUSAGE_SELF", value: 0)
!100 = !DIEnumerator(name: "RUSAGE_CHILDREN", value: -1)
!101 = !DIEnumerator(name: "RUSAGE_THREAD", value: 1)
!102 = !{!103, !104, !174}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !4, line: 99, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !4, line: 78, size: 768, align: 64, elements: !107)
!107 = !{!108, !110, !112, !250, !255, !256, !266, !279, !281}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !106, file: !4, line: 79, baseType: !109, size: 64, align: 64)
!109 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !106, file: !4, line: 80, baseType: !111, size: 32, align: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !4, line: 63, baseType: !24)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !106, file: !4, line: 81, baseType: !113, size: 64, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !4, line: 112, size: 1280, align: 64, elements: !115)
!115 = !{!116, !128, !129, !130, !131, !139, !140, !141, !226, !227, !230, !241, !242, !243, !244, !245, !246, !247, !248}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !114, file: !4, line: 113, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !118, line: 109, baseType: !119)
!118 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !118, line: 106, size: 64, align: 64, elements: !120)
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !119, file: !118, line: 108, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !118, line: 97, size: 192, align: 64, elements: !124)
!124 = !{!125, !126, !127}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !123, file: !118, line: 99, baseType: !109, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !123, file: !118, line: 102, baseType: !122, size: 64, align: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !123, file: !118, line: 103, baseType: !122, size: 64, align: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !114, file: !4, line: 114, baseType: !117, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !114, file: !4, line: 115, baseType: !117, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !114, file: !4, line: 116, baseType: !117, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !114, file: !4, line: 117, baseType: !132, size: 128, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !133, line: 62, baseType: !134)
!133 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !133, line: 60, size: 128, align: 64, elements: !135)
!135 = !{!136, !138}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !133, line: 61, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !134, file: !133, line: 61, baseType: !137, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !114, file: !4, line: 121, baseType: !132, size: 128, align: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !114, file: !4, line: 122, baseType: !132, size: 128, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !114, file: !4, line: 124, baseType: !142, size: 64, align: 64, offset: 640)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !143, line: 31, baseType: !144)
!143 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !143, line: 39, size: 320, align: 64, elements: !146)
!146 = !{!147, !154, !155, !157, !161}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !145, file: !143, line: 40, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !143, line: 33, size: 192, align: 64, elements: !150)
!150 = !{!151, !152, !153}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !149, file: !143, line: 34, baseType: !148, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !149, file: !143, line: 35, baseType: !148, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !149, file: !143, line: 36, baseType: !103, size: 64, align: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !145, file: !143, line: 41, baseType: !148, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !145, file: !143, line: 42, baseType: !156, size: 32, align: 32, offset: 128)
!156 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !145, file: !143, line: 43, baseType: !158, size: 64, align: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !103}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !145, file: !143, line: 44, baseType: !162, size: 64, align: 64, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !165, !103}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !167, line: 48, baseType: !168)
!167 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !169, line: 241, size: 1728, align: 64, elements: !170)
!169 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!170 = !{!171, !173, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !194, !195, !196, !197, !201, !203, !205, !209, !212, !214, !215, !216, !217, !218, !221, !222}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !168, file: !169, line: 242, baseType: !172, size: 32, align: 32)
!172 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !168, file: !169, line: 247, baseType: !174, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !168, file: !169, line: 248, baseType: !174, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !168, file: !169, line: 249, baseType: !174, size: 64, align: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !168, file: !169, line: 250, baseType: !174, size: 64, align: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !168, file: !169, line: 251, baseType: !174, size: 64, align: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !168, file: !169, line: 252, baseType: !174, size: 64, align: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !168, file: !169, line: 253, baseType: !174, size: 64, align: 64, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !168, file: !169, line: 254, baseType: !174, size: 64, align: 64, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !168, file: !169, line: 256, baseType: !174, size: 64, align: 64, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !168, file: !169, line: 257, baseType: !174, size: 64, align: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !168, file: !169, line: 258, baseType: !174, size: 64, align: 64, offset: 704)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !168, file: !169, line: 260, baseType: !187, size: 64, align: 64, offset: 768)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !169, line: 156, size: 192, align: 64, elements: !189)
!189 = !{!190, !191, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !188, file: !169, line: 157, baseType: !187, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !188, file: !169, line: 158, baseType: !192, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !188, file: !169, line: 162, baseType: !172, size: 32, align: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !168, file: !169, line: 262, baseType: !192, size: 64, align: 64, offset: 832)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !168, file: !169, line: 264, baseType: !172, size: 32, align: 32, offset: 896)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !168, file: !169, line: 268, baseType: !172, size: 32, align: 32, offset: 928)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !168, file: !169, line: 270, baseType: !198, size: 64, align: 64, offset: 960)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !199, line: 131, baseType: !200)
!199 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!200 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !168, file: !169, line: 274, baseType: !202, size: 16, align: 16, offset: 1024)
!202 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !168, file: !169, line: 275, baseType: !204, size: 8, align: 8, offset: 1040)
!204 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !168, file: !169, line: 276, baseType: !206, size: 8, align: 8, offset: 1048)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 8, align: 8, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 1)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !168, file: !169, line: 280, baseType: !210, size: 64, align: 64, offset: 1088)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !169, line: 150, baseType: null)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !168, file: !169, line: 289, baseType: !213, size: 64, align: 64, offset: 1152)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !199, line: 132, baseType: !200)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !168, file: !169, line: 297, baseType: !103, size: 64, align: 64, offset: 1216)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !168, file: !169, line: 298, baseType: !103, size: 64, align: 64, offset: 1280)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !168, file: !169, line: 299, baseType: !103, size: 64, align: 64, offset: 1344)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !168, file: !169, line: 300, baseType: !103, size: 64, align: 64, offset: 1408)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !168, file: !169, line: 302, baseType: !219, size: 64, align: 64, offset: 1472)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !220, line: 216, baseType: !109)
!220 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !168, file: !169, line: 303, baseType: !172, size: 32, align: 32, offset: 1536)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !168, file: !169, line: 305, baseType: !223, size: 160, align: 8, offset: 1568)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 160, align: 8, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 20)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !114, file: !4, line: 127, baseType: !117, size: 64, align: 64, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !114, file: !4, line: 128, baseType: !228, size: 64, align: 64, offset: 768)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !4, line: 128, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !114, file: !4, line: 129, baseType: !231, size: 64, align: 64, offset: 832)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !4, line: 109, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !4, line: 102, size: 448, align: 64, elements: !234)
!234 = !{!235, !236, !237, !238, !239}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !233, file: !4, line: 103, baseType: !104, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !233, file: !4, line: 104, baseType: !104, size: 64, align: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !233, file: !4, line: 105, baseType: !109, size: 64, align: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !233, file: !4, line: 106, baseType: !172, size: 32, align: 32, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !233, file: !4, line: 108, baseType: !240, size: 192, align: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !118, line: 104, baseType: !123)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !114, file: !4, line: 130, baseType: !156, size: 32, align: 32, offset: 896)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !114, file: !4, line: 131, baseType: !156, size: 32, align: 32, offset: 928)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !114, file: !4, line: 132, baseType: !172, size: 32, align: 32, offset: 960)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !114, file: !4, line: 135, baseType: !172, size: 32, align: 32, offset: 992)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !114, file: !4, line: 136, baseType: !104, size: 64, align: 64, offset: 1024)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !114, file: !4, line: 146, baseType: !109, size: 64, align: 64, offset: 1088)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !114, file: !4, line: 147, baseType: !109, size: 64, align: 64, offset: 1152)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !114, file: !4, line: 148, baseType: !249, size: 8, align: 8, offset: 1216)
!249 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !106, file: !4, line: 82, baseType: !251, size: 64, align: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!172, !254}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !106, file: !4, line: 83, baseType: !103, size: 64, align: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !106, file: !4, line: 84, baseType: !257, size: 128, align: 64, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !258, line: 31, baseType: !259)
!258 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !260, line: 30, size: 128, align: 64, elements: !261)
!260 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!261 = !{!262, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !259, file: !260, line: 32, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !199, line: 139, baseType: !200)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !259, file: !260, line: 33, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !199, line: 141, baseType: !200)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !106, file: !4, line: 92, baseType: !267, size: 64, align: 32, offset: 448)
!267 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !106, file: !4, line: 85, size: 64, align: 32, elements: !268)
!268 = !{!269, !270, !271}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !267, file: !4, line: 86, baseType: !172, size: 32, align: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !267, file: !4, line: 87, baseType: !172, size: 32, align: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !267, file: !4, line: 91, baseType: !272, size: 64, align: 32)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !267, file: !4, line: 88, size: 64, align: 32, elements: !273)
!273 = !{!274, !278}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !272, file: !4, line: 89, baseType: !275, size: 32, align: 32)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !276, line: 37, baseType: !277)
!276 = !DIFile(filename: "/usr/include/sched.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !199, line: 133, baseType: !172)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !272, file: !4, line: 90, baseType: !172, size: 32, align: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !106, file: !4, line: 93, baseType: !280, size: 64, align: 64, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, scope: !106, file: !4, line: 95, baseType: !282, size: 192, align: 64, offset: 576)
!282 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !106, file: !4, line: 95, size: 192, align: 64, elements: !283)
!283 = !{!284, !285}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !282, file: !4, line: 96, baseType: !240, size: 192, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !282, file: !4, line: 97, baseType: !132, size: 128, align: 64)
!286 = !{!287, !288, !290, !291}
!287 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !53, line: 150, type: !142, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!288 = distinct !DIGlobalVariable(name: "non_existent_interface_specified", scope: !0, file: !289, line: 86, type: !249, isLocal: false, isDefinition: true, variable: i8* @non_existent_interface_specified)
!289 = !DIFile(filename: "vrrp_daemon.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!290 = distinct !DIGlobalVariable(name: "vrrp_syslog_ident", scope: !0, file: !289, line: 102, type: !174, isLocal: true, isDefinition: true, variable: i8** @vrrp_syslog_ident)
!291 = distinct !DIGlobalVariable(name: "two_phase_terminate", scope: !0, file: !289, line: 104, type: !249, isLocal: true, isDefinition: true, variable: i8* @two_phase_terminate)
!292 = !{i32 2, !"Dwarf Version", i32 4}
!293 = !{i32 2, !"Debug Info Version", i32 3}
!294 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!295 = distinct !DISubprogram(name: "start_vrrp_child", scope: !289, file: !289, line: 859, type: !296, isLocal: false, isDefinition: true, scopeLine: 860, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!296 = !DISubroutineType(types: !297)
!297 = !{!172}
!298 = !{}
!299 = !DILocalVariable(name: "pid", scope: !295, file: !289, line: 862, type: !275)
!300 = !DIExpression()
!301 = !DILocation(line: 862, column: 8, scope: !295)
!302 = !DILocalVariable(name: "syslog_ident", scope: !295, file: !289, line: 863, type: !174)
!303 = !DILocation(line: 863, column: 8, scope: !295)
!304 = !DILocation(line: 866, column: 6, scope: !305)
!305 = distinct !DILexicalBlock(scope: !295, file: !289, line: 866, column: 6)
!306 = !DILocation(line: 866, column: 6, scope: !295)
!307 = !DILocation(line: 867, column: 3, scope: !305)
!308 = !DILocation(line: 869, column: 8, scope: !295)
!309 = !DILocation(line: 869, column: 6, scope: !295)
!310 = !DILocation(line: 871, column: 6, scope: !311)
!311 = distinct !DILexicalBlock(scope: !295, file: !289, line: 871, column: 6)
!312 = !DILocation(line: 871, column: 10, scope: !311)
!313 = !DILocation(line: 871, column: 6, scope: !295)
!314 = !DILocation(line: 873, column: 23, scope: !315)
!315 = distinct !DILexicalBlock(scope: !311, file: !289, line: 871, column: 15)
!316 = !DILocation(line: 873, column: 22, scope: !315)
!317 = !DILocation(line: 873, column: 13, scope: !318)
!318 = !DILexicalBlockFile(scope: !315, file: !289, discriminator: 1)
!319 = !DILocation(line: 872, column: 3, scope: !315)
!320 = !DILocation(line: 874, column: 3, scope: !315)
!321 = !DILocation(line: 875, column: 13, scope: !322)
!322 = distinct !DILexicalBlock(scope: !311, file: !289, line: 875, column: 13)
!323 = !DILocation(line: 875, column: 13, scope: !311)
!324 = !DILocation(line: 876, column: 16, scope: !325)
!325 = distinct !DILexicalBlock(scope: !322, file: !289, line: 875, column: 18)
!326 = !DILocation(line: 876, column: 14, scope: !325)
!327 = !DILocation(line: 878, column: 13, scope: !325)
!328 = !DILocation(line: 877, column: 3, scope: !325)
!329 = !DILocation(line: 881, column: 20, scope: !325)
!330 = !DILocation(line: 882, column: 6, scope: !325)
!331 = !DILocation(line: 881, column: 3, scope: !325)
!332 = !DILocation(line: 884, column: 3, scope: !325)
!333 = !DILocation(line: 887, column: 2, scope: !295)
!334 = !DILocation(line: 894, column: 12, scope: !295)
!335 = !DILocation(line: 896, column: 2, scope: !295)
!336 = !DILocation(line: 909, column: 7, scope: !337)
!337 = distinct !DILexicalBlock(scope: !295, file: !289, line: 909, column: 6)
!338 = !DILocation(line: 909, column: 20, scope: !337)
!339 = !DILocation(line: 911, column: 7, scope: !337)
!340 = !DILocation(line: 911, column: 10, scope: !341)
!341 = !DILexicalBlockFile(scope: !337, file: !289, discriminator: 1)
!342 = !DILocation(line: 911, column: 23, scope: !341)
!343 = !DILocation(line: 913, column: 15, scope: !337)
!344 = !DILocation(line: 914, column: 27, scope: !337)
!345 = !DILocation(line: 914, column: 25, scope: !337)
!346 = !DILocation(line: 909, column: 6, scope: !347)
!347 = !DILexicalBlockFile(scope: !295, file: !289, discriminator: 1)
!348 = !DILocation(line: 915, column: 19, scope: !337)
!349 = !DILocation(line: 915, column: 17, scope: !337)
!350 = !DILocation(line: 915, column: 4, scope: !337)
!351 = !DILocation(line: 917, column: 16, scope: !337)
!352 = !DILocation(line: 919, column: 7, scope: !353)
!353 = distinct !DILexicalBlock(scope: !295, file: !289, line: 919, column: 6)
!354 = !DILocation(line: 919, column: 6, scope: !295)
!355 = !DILocation(line: 920, column: 11, scope: !353)
!356 = !DILocation(line: 920, column: 36, scope: !353)
!357 = !DILocation(line: 920, column: 35, scope: !353)
!358 = !DILocation(line: 920, column: 32, scope: !353)
!359 = !DILocation(line: 921, column: 12, scope: !353)
!360 = !DILocation(line: 921, column: 24, scope: !353)
!361 = !DILocation(line: 921, column: 11, scope: !353)
!362 = !DILocation(line: 921, column: 11, scope: !363)
!363 = !DILexicalBlockFile(scope: !353, file: !289, discriminator: 1)
!364 = !DILocation(line: 921, column: 52, scope: !365)
!365 = !DILexicalBlockFile(scope: !353, file: !289, discriminator: 2)
!366 = !DILocation(line: 921, column: 11, scope: !365)
!367 = !DILocation(line: 921, column: 11, scope: !368)
!368 = !DILexicalBlockFile(scope: !353, file: !289, discriminator: 3)
!369 = !DILocation(line: 920, column: 3, scope: !363)
!370 = !DILocation(line: 923, column: 6, scope: !371)
!371 = distinct !DILexicalBlock(scope: !295, file: !289, line: 923, column: 6)
!372 = !DILocation(line: 923, column: 6, scope: !295)
!373 = !DILocation(line: 924, column: 17, scope: !371)
!374 = !DILocation(line: 927, column: 5, scope: !371)
!375 = !DILocation(line: 927, column: 18, scope: !371)
!376 = !DILocation(line: 931, column: 5, scope: !371)
!377 = !DILocation(line: 931, column: 18, scope: !371)
!378 = !DILocation(line: 924, column: 3, scope: !371)
!379 = !DILocation(line: 937, column: 2, scope: !295)
!380 = !DILocation(line: 940, column: 2, scope: !295)
!381 = !DILocation(line: 941, column: 2, scope: !295)
!382 = !DILocation(line: 944, column: 21, scope: !383)
!383 = distinct !DILexicalBlock(scope: !295, file: !289, line: 944, column: 6)
!384 = !DILocation(line: 944, column: 35, scope: !383)
!385 = !DILocation(line: 944, column: 7, scope: !386)
!386 = !DILexicalBlockFile(scope: !383, file: !289, discriminator: 1)
!387 = !DILocation(line: 944, column: 7, scope: !383)
!388 = !DILocation(line: 944, column: 6, scope: !295)
!389 = !DILocation(line: 946, column: 3, scope: !390)
!390 = distinct !DILexicalBlock(scope: !383, file: !289, line: 944, column: 46)
!391 = !DILocation(line: 947, column: 3, scope: !390)
!392 = !DILocation(line: 951, column: 24, scope: !295)
!393 = !DILocation(line: 951, column: 2, scope: !295)
!394 = !DILocation(line: 952, column: 11, scope: !295)
!395 = !DILocation(line: 952, column: 9, scope: !295)
!396 = !DILocation(line: 958, column: 10, scope: !295)
!397 = !DILocation(line: 962, column: 2, scope: !295)
!398 = !DILocation(line: 970, column: 2, scope: !295)
!399 = !DILocation(line: 985, column: 26, scope: !295)
!400 = !DILocation(line: 985, column: 2, scope: !295)
!401 = !DILocation(line: 992, column: 2, scope: !295)
!402 = !DILocation(line: 995, column: 2, scope: !295)
!403 = !DILocation(line: 996, column: 1, scope: !295)
!404 = distinct !DISubprogram(name: "vrrp_respawn_thread", scope: !289, file: !289, line: 790, type: !405, isLocal: true, isDefinition: true, scopeLine: 791, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!405 = !DISubroutineType(types: !406)
!406 = !{!172, !104}
!407 = !DILocalVariable(name: "thread", arg: 1, scope: !404, file: !289, line: 790, type: !104)
!408 = !DILocation(line: 790, column: 32, scope: !404)
!409 = !DILocalVariable(name: "pid", scope: !404, file: !289, line: 792, type: !275)
!410 = !DILocation(line: 792, column: 8, scope: !404)
!411 = !DILocation(line: 795, column: 10, scope: !404)
!412 = !DILocation(line: 795, column: 19, scope: !404)
!413 = !DILocation(line: 795, column: 21, scope: !404)
!414 = !DILocation(line: 795, column: 23, scope: !404)
!415 = !DILocation(line: 795, column: 6, scope: !404)
!416 = !DILocation(line: 798, column: 6, scope: !417)
!417 = distinct !DILexicalBlock(scope: !404, file: !289, line: 798, column: 6)
!418 = !DILocation(line: 798, column: 14, scope: !417)
!419 = !DILocation(line: 798, column: 19, scope: !417)
!420 = !DILocation(line: 798, column: 6, scope: !404)
!421 = !DILocation(line: 799, column: 20, scope: !422)
!422 = distinct !DILexicalBlock(scope: !417, file: !289, line: 798, column: 44)
!423 = !DILocation(line: 800, column: 6, scope: !422)
!424 = !DILocation(line: 799, column: 3, scope: !422)
!425 = !DILocation(line: 801, column: 3, scope: !422)
!426 = !DILocation(line: 805, column: 7, scope: !427)
!427 = distinct !DILexicalBlock(scope: !404, file: !289, line: 805, column: 6)
!428 = !DILocation(line: 805, column: 6, scope: !404)
!429 = !DILocation(line: 806, column: 68, scope: !430)
!430 = distinct !DILexicalBlock(scope: !427, file: !289, line: 805, column: 45)
!431 = !DILocation(line: 806, column: 3, scope: !430)
!432 = !DILocation(line: 807, column: 3, scope: !430)
!433 = !DILocation(line: 808, column: 2, scope: !430)
!434 = !DILocation(line: 809, column: 65, scope: !435)
!435 = distinct !DILexicalBlock(scope: !427, file: !289, line: 808, column: 9)
!436 = !DILocation(line: 809, column: 3, scope: !435)
!437 = !DILocation(line: 810, column: 14, scope: !435)
!438 = !DILocation(line: 811, column: 3, scope: !435)
!439 = !DILocation(line: 813, column: 2, scope: !404)
!440 = !DILocation(line: 814, column: 1, scope: !404)
!441 = distinct !DISubprogram(name: "__test_bit", scope: !10, file: !10, line: 47, type: !442, isLocal: true, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!442 = !DISubroutineType(types: !443)
!443 = !{!249, !156, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!446 = !DILocalVariable(name: "idx", arg: 1, scope: !441, file: !10, line: 47, type: !156)
!447 = !DILocation(line: 47, column: 39, scope: !441)
!448 = !DILocalVariable(name: "bmap", arg: 2, scope: !441, file: !10, line: 47, type: !444)
!449 = !DILocation(line: 47, column: 65, scope: !441)
!450 = !DILocation(line: 49, column: 19, scope: !441)
!451 = !DILocation(line: 49, column: 18, scope: !441)
!452 = !DILocation(line: 49, column: 24, scope: !441)
!453 = !DILocation(line: 49, column: 12, scope: !441)
!454 = !DILocation(line: 49, column: 68, scope: !441)
!455 = !DILocation(line: 49, column: 67, scope: !441)
!456 = !DILocation(line: 49, column: 73, scope: !441)
!457 = !DILocation(line: 49, column: 63, scope: !441)
!458 = !DILocation(line: 49, column: 56, scope: !441)
!459 = !DILocation(line: 49, column: 10, scope: !441)
!460 = !DILocation(line: 49, column: 9, scope: !441)
!461 = !DILocation(line: 49, column: 2, scope: !441)
!462 = distinct !DISubprogram(name: "vrrp_signal_init", scope: !289, file: !289, line: 677, type: !463, isLocal: true, isDefinition: true, scopeLine: 678, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!463 = !DISubroutineType(types: !464)
!464 = !{null}
!465 = !DILocation(line: 679, column: 2, scope: !462)
!466 = !DILocation(line: 680, column: 2, scope: !462)
!467 = !DILocation(line: 681, column: 2, scope: !462)
!468 = !DILocation(line: 682, column: 2, scope: !462)
!469 = !DILocation(line: 683, column: 2, scope: !462)
!470 = !DILocation(line: 687, column: 2, scope: !462)
!471 = !DILocation(line: 688, column: 1, scope: !462)
!472 = distinct !DISubprogram(name: "start_vrrp", scope: !289, file: !289, line: 398, type: !463, isLocal: true, isDefinition: true, scopeLine: 399, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!473 = !DILocation(line: 401, column: 2, scope: !472)
!474 = !DILocation(line: 404, column: 7, scope: !475)
!475 = distinct !DILexicalBlock(scope: !472, file: !289, line: 404, column: 6)
!476 = !DILocation(line: 404, column: 6, scope: !472)
!477 = !DILocation(line: 405, column: 3, scope: !475)
!478 = !DILocation(line: 407, column: 6, scope: !479)
!479 = distinct !DILexicalBlock(scope: !472, file: !289, line: 407, column: 6)
!480 = !DILocation(line: 407, column: 6, scope: !472)
!481 = !DILocation(line: 408, column: 17, scope: !479)
!482 = !DILocation(line: 408, column: 15, scope: !479)
!483 = !DILocation(line: 408, column: 3, scope: !479)
!484 = !DILocation(line: 409, column: 11, scope: !485)
!485 = distinct !DILexicalBlock(scope: !479, file: !289, line: 409, column: 11)
!486 = !DILocation(line: 409, column: 24, scope: !485)
!487 = !DILocation(line: 409, column: 11, scope: !479)
!488 = !DILocation(line: 412, column: 47, scope: !489)
!489 = distinct !DILexicalBlock(scope: !485, file: !289, line: 409, column: 40)
!490 = !DILocation(line: 412, column: 60, scope: !489)
!491 = !DILocation(line: 412, column: 30, scope: !489)
!492 = !DILocation(line: 412, column: 3, scope: !489)
!493 = !DILocation(line: 412, column: 16, scope: !489)
!494 = !DILocation(line: 412, column: 28, scope: !489)
!495 = !DILocation(line: 413, column: 8, scope: !496)
!496 = distinct !DILexicalBlock(scope: !489, file: !289, line: 413, column: 7)
!497 = !DILocation(line: 413, column: 21, scope: !496)
!498 = !DILocation(line: 413, column: 7, scope: !489)
!499 = !DILocation(line: 414, column: 73, scope: !496)
!500 = !DILocation(line: 414, column: 86, scope: !496)
!501 = !DILocation(line: 414, column: 4, scope: !496)
!502 = !DILocation(line: 415, column: 2, scope: !489)
!503 = !DILocation(line: 418, column: 14, scope: !472)
!504 = !DILocation(line: 418, column: 12, scope: !472)
!505 = !DILocation(line: 419, column: 7, scope: !506)
!506 = distinct !DILexicalBlock(scope: !472, file: !289, line: 419, column: 6)
!507 = !DILocation(line: 419, column: 6, scope: !472)
!508 = !DILocation(line: 420, column: 3, scope: !509)
!509 = distinct !DILexicalBlock(scope: !506, file: !289, line: 419, column: 18)
!510 = !DILocation(line: 421, column: 3, scope: !509)
!511 = !DILocation(line: 424, column: 12, scope: !472)
!512 = !DILocation(line: 424, column: 2, scope: !472)
!513 = !DILocation(line: 426, column: 6, scope: !514)
!514 = distinct !DILexicalBlock(scope: !472, file: !289, line: 426, column: 6)
!515 = !DILocation(line: 426, column: 6, scope: !472)
!516 = !DILocation(line: 427, column: 3, scope: !517)
!517 = distinct !DILexicalBlock(scope: !514, file: !289, line: 426, column: 40)
!518 = !DILocation(line: 428, column: 3, scope: !517)
!519 = !DILocation(line: 429, column: 3, scope: !517)
!520 = !DILocation(line: 432, column: 6, scope: !521)
!521 = distinct !DILexicalBlock(scope: !472, file: !289, line: 432, column: 6)
!522 = !DILocation(line: 432, column: 6, scope: !472)
!523 = !DILocation(line: 433, column: 20, scope: !521)
!524 = !DILocation(line: 433, column: 3, scope: !521)
!525 = !DILocation(line: 436, column: 2, scope: !472)
!526 = !DILocation(line: 438, column: 7, scope: !527)
!527 = distinct !DILexicalBlock(scope: !472, file: !289, line: 438, column: 6)
!528 = !DILocation(line: 438, column: 6, scope: !472)
!529 = !DILocation(line: 459, column: 7, scope: !530)
!530 = distinct !DILexicalBlock(scope: !531, file: !289, line: 459, column: 7)
!531 = distinct !DILexicalBlock(scope: !527, file: !289, line: 438, column: 44)
!532 = !DILocation(line: 459, column: 7, scope: !531)
!533 = !DILocation(line: 461, column: 8, scope: !534)
!534 = distinct !DILexicalBlock(scope: !535, file: !289, line: 461, column: 8)
!535 = distinct !DILexicalBlock(scope: !530, file: !289, line: 459, column: 27)
!536 = !DILocation(line: 461, column: 21, scope: !534)
!537 = !DILocation(line: 461, column: 8, scope: !535)
!538 = !DILocation(line: 462, column: 5, scope: !539)
!539 = distinct !DILexicalBlock(scope: !534, file: !289, line: 461, column: 27)
!540 = !DILocation(line: 463, column: 5, scope: !539)
!541 = !DILocation(line: 467, column: 8, scope: !542)
!542 = distinct !DILexicalBlock(scope: !535, file: !289, line: 467, column: 8)
!543 = !DILocation(line: 467, column: 21, scope: !542)
!544 = !DILocation(line: 467, column: 37, scope: !542)
!545 = !DILocation(line: 468, column: 8, scope: !542)
!546 = !DILocation(line: 468, column: 21, scope: !542)
!547 = !DILocation(line: 468, column: 40, scope: !542)
!548 = !DILocation(line: 469, column: 8, scope: !542)
!549 = !DILocation(line: 469, column: 21, scope: !542)
!550 = !DILocation(line: 467, column: 8, scope: !551)
!551 = !DILexicalBlockFile(scope: !535, file: !289, discriminator: 1)
!552 = !DILocation(line: 470, column: 23, scope: !542)
!553 = !DILocation(line: 470, column: 36, scope: !542)
!554 = !DILocation(line: 470, column: 53, scope: !542)
!555 = !DILocation(line: 470, column: 66, scope: !542)
!556 = !DILocation(line: 470, column: 86, scope: !542)
!557 = !DILocation(line: 470, column: 99, scope: !542)
!558 = !DILocation(line: 470, column: 5, scope: !542)
!559 = !DILocation(line: 475, column: 4, scope: !535)
!560 = !DILocation(line: 476, column: 4, scope: !535)
!561 = !DILocation(line: 477, column: 3, scope: !535)
!562 = !DILocation(line: 480, column: 7, scope: !563)
!563 = distinct !DILexicalBlock(scope: !531, file: !289, line: 480, column: 7)
!564 = !DILocation(line: 480, column: 7, scope: !531)
!565 = !DILocation(line: 481, column: 4, scope: !566)
!566 = distinct !DILexicalBlock(scope: !563, file: !289, line: 480, column: 15)
!567 = !DILocation(line: 483, column: 4, scope: !566)
!568 = !DILocation(line: 485, column: 4, scope: !566)
!569 = !DILocation(line: 486, column: 4, scope: !566)
!570 = !DILocation(line: 488, column: 4, scope: !566)
!571 = !DILocation(line: 492, column: 3, scope: !566)
!572 = !DILocation(line: 495, column: 19, scope: !573)
!573 = distinct !DILexicalBlock(scope: !563, file: !289, line: 493, column: 8)
!574 = !DILocation(line: 495, column: 30, scope: !573)
!575 = !DILocation(line: 495, column: 4, scope: !573)
!576 = !DILocation(line: 497, column: 19, scope: !573)
!577 = !DILocation(line: 497, column: 30, scope: !573)
!578 = !DILocation(line: 497, column: 4, scope: !573)
!579 = !DILocation(line: 498, column: 25, scope: !573)
!580 = !DILocation(line: 499, column: 21, scope: !573)
!581 = !DILocation(line: 499, column: 32, scope: !573)
!582 = !DILocation(line: 499, column: 4, scope: !573)
!583 = !DILocation(line: 500, column: 25, scope: !573)
!584 = !DILocation(line: 509, column: 2, scope: !531)
!585 = !DILocation(line: 512, column: 7, scope: !586)
!586 = distinct !DILexicalBlock(scope: !472, file: !289, line: 512, column: 6)
!587 = !DILocation(line: 512, column: 6, scope: !472)
!588 = !DILocation(line: 513, column: 3, scope: !589)
!589 = distinct !DILexicalBlock(scope: !586, file: !289, line: 512, column: 29)
!590 = !DILocation(line: 514, column: 3, scope: !589)
!591 = !DILocation(line: 518, column: 6, scope: !592)
!592 = distinct !DILexicalBlock(scope: !472, file: !289, line: 518, column: 6)
!593 = !DILocation(line: 518, column: 6, scope: !472)
!594 = !DILocation(line: 519, column: 3, scope: !592)
!595 = !DILocation(line: 522, column: 6, scope: !596)
!596 = distinct !DILexicalBlock(scope: !472, file: !289, line: 522, column: 6)
!597 = !DILocation(line: 522, column: 6, scope: !472)
!598 = !DILocation(line: 523, column: 3, scope: !596)
!599 = !DILocation(line: 525, column: 3, scope: !596)
!600 = !DILocation(line: 526, column: 6, scope: !601)
!601 = distinct !DILexicalBlock(scope: !472, file: !289, line: 526, column: 6)
!602 = !DILocation(line: 526, column: 6, scope: !472)
!603 = !DILocation(line: 527, column: 3, scope: !601)
!604 = !DILocation(line: 529, column: 3, scope: !601)
!605 = !DILocation(line: 533, column: 2, scope: !472)
!606 = !DILocation(line: 536, column: 6, scope: !607)
!607 = distinct !DILexicalBlock(scope: !472, file: !289, line: 536, column: 6)
!608 = !DILocation(line: 536, column: 17, scope: !607)
!609 = !DILocation(line: 536, column: 6, scope: !472)
!610 = !DILocation(line: 537, column: 20, scope: !607)
!611 = !DILocation(line: 537, column: 31, scope: !607)
!612 = !DILocation(line: 537, column: 3, scope: !607)
!613 = !DILocation(line: 541, column: 7, scope: !614)
!614 = distinct !DILexicalBlock(scope: !472, file: !289, line: 541, column: 6)
!615 = !DILocation(line: 541, column: 6, scope: !472)
!616 = !DILocation(line: 542, column: 3, scope: !614)
!617 = !DILocation(line: 544, column: 19, scope: !472)
!618 = !DILocation(line: 544, column: 2, scope: !472)
!619 = !DILocation(line: 547, column: 7, scope: !620)
!620 = distinct !DILexicalBlock(scope: !472, file: !289, line: 547, column: 6)
!621 = !DILocation(line: 547, column: 6, scope: !472)
!622 = !DILocation(line: 548, column: 3, scope: !620)
!623 = !DILocation(line: 552, column: 6, scope: !624)
!624 = distinct !DILexicalBlock(scope: !472, file: !289, line: 552, column: 6)
!625 = !DILocation(line: 552, column: 6, scope: !472)
!626 = !DILocation(line: 553, column: 3, scope: !624)
!627 = !DILocation(line: 566, column: 17, scope: !472)
!628 = !DILocation(line: 566, column: 28, scope: !472)
!629 = !DILocation(line: 566, column: 2, scope: !472)
!630 = !DILocation(line: 568, column: 17, scope: !472)
!631 = !DILocation(line: 568, column: 28, scope: !472)
!632 = !DILocation(line: 568, column: 2, scope: !472)
!633 = !DILocation(line: 569, column: 19, scope: !472)
!634 = !DILocation(line: 569, column: 30, scope: !472)
!635 = !DILocation(line: 569, column: 2, scope: !472)
!636 = !DILocation(line: 573, column: 6, scope: !637)
!637 = distinct !DILexicalBlock(scope: !472, file: !289, line: 573, column: 6)
!638 = !DILocation(line: 573, column: 6, scope: !472)
!639 = !DILocation(line: 574, column: 3, scope: !637)
!640 = !DILocation(line: 577, column: 19, scope: !472)
!641 = !DILocation(line: 577, column: 2, scope: !472)
!642 = !DILocation(line: 583, column: 11, scope: !472)
!643 = !DILocation(line: 583, column: 24, scope: !472)
!644 = !DILocation(line: 585, column: 11, scope: !472)
!645 = !DILocation(line: 585, column: 24, scope: !472)
!646 = !DILocation(line: 588, column: 11, scope: !472)
!647 = !DILocation(line: 588, column: 24, scope: !472)
!648 = !DILocation(line: 588, column: 47, scope: !472)
!649 = !DILocation(line: 588, column: 60, scope: !472)
!650 = !DILocation(line: 581, column: 2, scope: !472)
!651 = !DILocation(line: 591, column: 2, scope: !472)
!652 = !DILocation(line: 592, column: 1, scope: !472)
!653 = !DILocation(line: 592, column: 1, scope: !654)
!654 = !DILexicalBlockFile(scope: !472, file: !289, discriminator: 1)
!655 = distinct !DISubprogram(name: "vrrp_terminate_phase2", scope: !289, file: !289, line: 171, type: !656, isLocal: true, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!656 = !DISubroutineType(types: !657)
!657 = !{!172, !172}
!658 = !DILocalVariable(name: "exit_status", arg: 1, scope: !655, file: !289, line: 171, type: !172)
!659 = !DILocation(line: 171, column: 27, scope: !655)
!660 = !DILocalVariable(name: "usage", scope: !655, file: !289, line: 173, type: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage", file: !76, line: 187, size: 1152, align: 64, elements: !662)
!662 = !{!663, !664, !665, !671, !676, !681, !686, !691, !696, !701, !706, !711, !716, !721, !726, !731}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ru_utime", scope: !661, file: !76, line: 190, baseType: !259, size: 128, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ru_stime", scope: !661, file: !76, line: 192, baseType: !259, size: 128, align: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !76, line: 194, baseType: !666, size: 64, align: 64, offset: 256)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !76, line: 194, size: 64, align: 64, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ru_maxrss", scope: !666, file: !76, line: 196, baseType: !200, size: 64, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_maxrss_word", scope: !666, file: !76, line: 197, baseType: !670, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !199, line: 175, baseType: !200)
!671 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !76, line: 202, baseType: !672, size: 64, align: 64, offset: 320)
!672 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !76, line: 202, size: 64, align: 64, elements: !673)
!673 = !{!674, !675}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ru_ixrss", scope: !672, file: !76, line: 204, baseType: !200, size: 64, align: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_ixrss_word", scope: !672, file: !76, line: 205, baseType: !670, size: 64, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !76, line: 208, baseType: !677, size: 64, align: 64, offset: 384)
!677 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !76, line: 208, size: 64, align: 64, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ru_idrss", scope: !677, file: !76, line: 210, baseType: !200, size: 64, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_idrss_word", scope: !677, file: !76, line: 211, baseType: !670, size: 64, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !76, line: 214, baseType: !682, size: 64, align: 64, offset: 448)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !76, line: 214, size: 64, align: 64, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ru_isrss", scope: !682, file: !76, line: 216, baseType: !200, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_isrss_word", scope: !682, file: !76, line: 217, baseType: !670, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !76, line: 221, baseType: !687, size: 64, align: 64, offset: 512)
!687 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !76, line: 221, size: 64, align: 64, elements: !688)
!688 = !{!689, !690}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ru_minflt", scope: !687, file: !76, line: 223, baseType: !200, size: 64, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_minflt_word", scope: !687, file: !76, line: 224, baseType: !670, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !76, line: 227, baseType: !692, size: 64, align: 64, offset: 576)
!692 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !76, line: 227, size: 64, align: 64, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ru_majflt", scope: !692, file: !76, line: 229, baseType: !200, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_majflt_word", scope: !692, file: !76, line: 230, baseType: !670, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !76, line: 233, baseType: !697, size: 64, align: 64, offset: 640)
!697 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !76, line: 233, size: 64, align: 64, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nswap", scope: !697, file: !76, line: 235, baseType: !200, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_nswap_word", scope: !697, file: !76, line: 236, baseType: !670, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !76, line: 240, baseType: !702, size: 64, align: 64, offset: 704)
!702 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !76, line: 240, size: 64, align: 64, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ru_inblock", scope: !702, file: !76, line: 242, baseType: !200, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_inblock_word", scope: !702, file: !76, line: 243, baseType: !670, size: 64, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !76, line: 246, baseType: !707, size: 64, align: 64, offset: 768)
!707 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !76, line: 246, size: 64, align: 64, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ru_oublock", scope: !707, file: !76, line: 248, baseType: !200, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_oublock_word", scope: !707, file: !76, line: 249, baseType: !670, size: 64, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !76, line: 252, baseType: !712, size: 64, align: 64, offset: 832)
!712 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !76, line: 252, size: 64, align: 64, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgsnd", scope: !712, file: !76, line: 254, baseType: !200, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_msgsnd_word", scope: !712, file: !76, line: 255, baseType: !670, size: 64, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !76, line: 258, baseType: !717, size: 64, align: 64, offset: 896)
!717 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !76, line: 258, size: 64, align: 64, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgrcv", scope: !717, file: !76, line: 260, baseType: !200, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_msgrcv_word", scope: !717, file: !76, line: 261, baseType: !670, size: 64, align: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !76, line: 264, baseType: !722, size: 64, align: 64, offset: 960)
!722 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !76, line: 264, size: 64, align: 64, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nsignals", scope: !722, file: !76, line: 266, baseType: !200, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_nsignals_word", scope: !722, file: !76, line: 267, baseType: !670, size: 64, align: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !76, line: 272, baseType: !727, size: 64, align: 64, offset: 1024)
!727 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !76, line: 272, size: 64, align: 64, elements: !728)
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nvcsw", scope: !727, file: !76, line: 274, baseType: !200, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_nvcsw_word", scope: !727, file: !76, line: 275, baseType: !670, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !76, line: 279, baseType: !732, size: 64, align: 64, offset: 1088)
!732 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !76, line: 279, size: 64, align: 64, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nivcsw", scope: !732, file: !76, line: 281, baseType: !200, size: 64, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_nivcsw_word", scope: !732, file: !76, line: 282, baseType: !670, size: 64, align: 64)
!736 = !DILocation(line: 173, column: 16, scope: !655)
!737 = !DILocation(line: 180, column: 7, scope: !738)
!738 = distinct !DILexicalBlock(scope: !655, file: !289, line: 180, column: 6)
!739 = !DILocation(line: 180, column: 6, scope: !655)
!740 = !DILocation(line: 181, column: 3, scope: !738)
!741 = !DILocation(line: 204, column: 6, scope: !742)
!742 = distinct !DILexicalBlock(scope: !655, file: !289, line: 204, column: 6)
!743 = !DILocation(line: 204, column: 6, scope: !655)
!744 = !DILocation(line: 206, column: 3, scope: !745)
!745 = distinct !DILexicalBlock(scope: !742, file: !289, line: 204, column: 26)
!746 = !DILocation(line: 207, column: 2, scope: !745)
!747 = !DILocation(line: 210, column: 2, scope: !655)
!748 = !DILocation(line: 211, column: 24, scope: !655)
!749 = !DILocation(line: 211, column: 2, scope: !655)
!750 = !DILocation(line: 212, column: 9, scope: !655)
!751 = !DILocation(line: 213, column: 2, scope: !655)
!752 = !DILocation(line: 214, column: 2, scope: !655)
!753 = !DILocation(line: 221, column: 6, scope: !754)
!754 = distinct !DILexicalBlock(scope: !655, file: !289, line: 221, column: 6)
!755 = !DILocation(line: 221, column: 19, scope: !754)
!756 = !DILocation(line: 221, column: 36, scope: !754)
!757 = !DILocation(line: 221, column: 39, scope: !754)
!758 = !DILocation(line: 221, column: 6, scope: !655)
!759 = !DILocation(line: 222, column: 22, scope: !754)
!760 = !DILocation(line: 222, column: 35, scope: !754)
!761 = !DILocation(line: 222, column: 49, scope: !754)
!762 = !DILocation(line: 222, column: 62, scope: !754)
!763 = !DILocation(line: 222, column: 3, scope: !754)
!764 = !DILocation(line: 224, column: 19, scope: !655)
!765 = !DILocation(line: 224, column: 2, scope: !655)
!766 = !DILocation(line: 225, column: 17, scope: !655)
!767 = !DILocation(line: 225, column: 2, scope: !655)
!768 = !DILocation(line: 226, column: 2, scope: !655)
!769 = !DILocation(line: 227, column: 2, scope: !655)
!770 = !DILocation(line: 228, column: 2, scope: !655)
!771 = !DILocation(line: 234, column: 6, scope: !772)
!772 = distinct !DILexicalBlock(scope: !655, file: !289, line: 234, column: 6)
!773 = !DILocation(line: 234, column: 6, scope: !655)
!774 = !DILocation(line: 235, column: 3, scope: !775)
!775 = distinct !DILexicalBlock(scope: !772, file: !289, line: 234, column: 42)
!776 = !DILocation(line: 236, column: 93, scope: !775)
!777 = !DILocation(line: 236, column: 102, scope: !775)
!778 = !DILocation(line: 236, column: 116, scope: !775)
!779 = !DILocation(line: 236, column: 125, scope: !775)
!780 = !DILocation(line: 236, column: 140, scope: !775)
!781 = !DILocation(line: 236, column: 149, scope: !775)
!782 = !DILocation(line: 236, column: 163, scope: !775)
!783 = !DILocation(line: 236, column: 172, scope: !775)
!784 = !DILocation(line: 236, column: 3, scope: !775)
!785 = !DILocation(line: 237, column: 2, scope: !775)
!786 = !DILocation(line: 239, column: 3, scope: !772)
!787 = !DILocation(line: 241, column: 6, scope: !788)
!788 = distinct !DILexicalBlock(scope: !655, file: !289, line: 241, column: 6)
!789 = !DILocation(line: 241, column: 6, scope: !655)
!790 = !DILocation(line: 242, column: 3, scope: !788)
!791 = !DILocation(line: 243, column: 2, scope: !655)
!792 = !DILocation(line: 246, column: 8, scope: !793)
!793 = distinct !DILexicalBlock(scope: !794, file: !289, line: 246, column: 8)
!794 = distinct !DILexicalBlock(scope: !655, file: !289, line: 246, column: 2)
!795 = !DILocation(line: 246, column: 8, scope: !794)
!796 = !DILocation(line: 246, column: 35, scope: !797)
!797 = !DILexicalBlockFile(scope: !798, file: !289, discriminator: 1)
!798 = distinct !DILexicalBlock(scope: !793, file: !289, line: 246, column: 27)
!799 = !DILocation(line: 246, column: 30, scope: !797)
!800 = !DILocation(line: 246, column: 75, scope: !797)
!801 = !DILocation(line: 246, column: 3, scope: !797)
!802 = !DILocation(line: 251, column: 2, scope: !655)
!803 = !DILocation(line: 254, column: 13, scope: !655)
!804 = !DILocation(line: 254, column: 2, scope: !655)
!805 = !DILocation(line: 256, column: 7, scope: !655)
!806 = !DILocation(line: 256, column: 2, scope: !655)
!807 = !DILocation(line: 257, column: 1, scope: !655)
!808 = distinct !DISubprogram(name: "vrrp_validate_config", scope: !289, file: !289, line: 999, type: !463, isLocal: false, isDefinition: true, scopeLine: 1000, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!809 = !DILocation(line: 1001, column: 2, scope: !808)
!810 = !DILocation(line: 1002, column: 1, scope: !808)
!811 = distinct !DISubprogram(name: "sigreload_vrrp", scope: !289, file: !289, line: 612, type: !812, isLocal: true, isDefinition: true, scopeLine: 613, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !298)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !103, !172}
!814 = !DILocalVariable(name: "v", arg: 1, scope: !811, file: !289, line: 612, type: !103)
!815 = !DILocation(line: 612, column: 46, scope: !811)
!816 = !DILocalVariable(name: "sig", arg: 2, scope: !811, file: !289, line: 612, type: !172)
!817 = !DILocation(line: 612, column: 77, scope: !811)
!818 = !DILocalVariable(name: "e", scope: !811, file: !289, line: 614, type: !819)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "element", file: !143, line: 30, baseType: !148)
!820 = !DILocation(line: 614, column: 10, scope: !811)
!821 = !DILocalVariable(name: "vrrp", scope: !811, file: !289, line: 615, type: !822)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64, align: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_t", file: !45, line: 310, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_t", file: !45, line: 183, size: 7040, align: 64, elements: !825)
!825 = !{!826, !829, !830, !880, !902, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !999, !1000, !1001, !1002, !1003, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1075, !1082}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !824, file: !45, line: 184, baseType: !827, size: 16, align: 16)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !828, line: 28, baseType: !202)
!828 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!829 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !824, file: !45, line: 185, baseType: !174, size: 64, align: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !824, file: !45, line: 186, baseType: !831, size: 64, align: 64, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64, align: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_sgroup_t", file: !45, line: 133, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_sgroup", file: !45, line: 109, size: 1024, align: 64, elements: !834)
!834 = !{!835, !836, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !874, !875, !876, !877, !878, !879}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !833, file: !45, line: 110, baseType: !174, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !833, file: !45, line: 111, baseType: !837, size: 64, align: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64, align: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !839, line: 34, baseType: !840)
!839 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !839, line: 30, size: 128, align: 64, elements: !841)
!841 = !{!842, !843, !844}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !840, file: !839, line: 31, baseType: !156, size: 32, align: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !840, file: !839, line: 32, baseType: !156, size: 32, align: 32, offset: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !840, file: !839, line: 33, baseType: !845, size: 64, align: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !833, file: !45, line: 112, baseType: !142, size: 64, align: 64, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_fault", scope: !833, file: !45, line: 113, baseType: !156, size: 32, align: 32, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_init", scope: !833, file: !45, line: 114, baseType: !156, size: 32, align: 32, offset: 224)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !833, file: !45, line: 115, baseType: !172, size: 32, align: 32, offset: 256)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "sgroup_tracking_weight", scope: !833, file: !45, line: 116, baseType: !249, size: 8, align: 8, offset: 288)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !833, file: !45, line: 119, baseType: !142, size: 64, align: 64, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !833, file: !45, line: 120, baseType: !142, size: 64, align: 64, offset: 384)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !833, file: !45, line: 121, baseType: !142, size: 64, align: 64, offset: 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "track_bfd", scope: !833, file: !45, line: 122, baseType: !142, size: 64, align: 64, offset: 512)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !833, file: !45, line: 125, baseType: !249, size: 8, align: 8, offset: 576)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !833, file: !45, line: 126, baseType: !857, size: 64, align: 64, offset: 640)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64, align: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !859, line: 65, baseType: !860)
!859 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !859, line: 59, size: 192, align: 64, elements: !861)
!861 = !{!862, !864, !865, !866, !870}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !860, file: !859, line: 60, baseType: !863, size: 64, align: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !860, file: !859, line: 61, baseType: !172, size: 32, align: 32, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !860, file: !859, line: 62, baseType: !172, size: 32, align: 32, offset: 96)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !860, file: !859, line: 63, baseType: !867, size: 32, align: 32, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !868, line: 67, baseType: !869)
!868 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !199, line: 125, baseType: !156)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !860, file: !859, line: 64, baseType: !871, size: 32, align: 32, offset: 160)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !872, line: 65, baseType: !873)
!872 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !199, line: 126, baseType: !156)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !833, file: !45, line: 127, baseType: !857, size: 64, align: 64, offset: 704)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !833, file: !45, line: 128, baseType: !857, size: 64, align: 64, offset: 768)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !833, file: !45, line: 129, baseType: !857, size: 64, align: 64, offset: 832)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !833, file: !45, line: 130, baseType: !857, size: 64, align: 64, offset: 896)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !833, file: !45, line: 131, baseType: !172, size: 32, align: 32, offset: 960)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !833, file: !45, line: 132, baseType: !172, size: 32, align: 32, offset: 992)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !824, file: !45, line: 187, baseType: !881, size: 64, align: 64, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64, align: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_stats", file: !45, line: 169, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_stats", file: !45, line: 136, size: 768, align: 64, elements: !884)
!884 = !{!885, !888, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "advert_rcvd", scope: !883, file: !45, line: 137, baseType: !886, size: 64, align: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !887, line: 55, baseType: !109)
!887 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!888 = !DIDerivedType(tag: DW_TAG_member, name: "advert_sent", scope: !883, file: !45, line: 138, baseType: !889, size: 32, align: 32, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !887, line: 51, baseType: !156)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "become_master", scope: !883, file: !45, line: 140, baseType: !889, size: 32, align: 32, offset: 96)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "release_master", scope: !883, file: !45, line: 141, baseType: !889, size: 32, align: 32, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "packet_len_err", scope: !883, file: !45, line: 143, baseType: !886, size: 64, align: 64, offset: 192)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "advert_interval_err", scope: !883, file: !45, line: 144, baseType: !886, size: 64, align: 64, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl_err", scope: !883, file: !45, line: 145, baseType: !886, size: 64, align: 64, offset: 320)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_type_rcvd", scope: !883, file: !45, line: 146, baseType: !886, size: 64, align: 64, offset: 384)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list_err", scope: !883, file: !45, line: 147, baseType: !886, size: 64, align: 64, offset: 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_authtype", scope: !883, file: !45, line: 149, baseType: !889, size: 32, align: 32, offset: 512)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "authtype_mismatch", scope: !883, file: !45, line: 151, baseType: !889, size: 32, align: 32, offset: 544)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "auth_failure", scope: !883, file: !45, line: 152, baseType: !889, size: 32, align: 32, offset: 576)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_rcvd", scope: !883, file: !45, line: 155, baseType: !886, size: 64, align: 64, offset: 640)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_sent", scope: !883, file: !45, line: 156, baseType: !886, size: 64, align: 64, offset: 704)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !824, file: !45, line: 188, baseType: !903, size: 64, align: 64, offset: 256)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !53, line: 111, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !53, line: 76, size: 1792, align: 64, elements: !906)
!906 = !{!907, !911, !913, !919, !938, !939, !940, !941, !942, !948, !949, !950, !951, !952, !953, !955, !956, !957, !958, !970, !971, !972, !973, !974, !975, !976, !977}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !905, file: !53, line: 77, baseType: !908, size: 128, align: 8)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 128, align: 8, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 16)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !905, file: !53, line: 78, baseType: !912, size: 32, align: 32, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !53, line: 62, baseType: !889)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !905, file: !53, line: 79, baseType: !914, size: 32, align: 32, offset: 160)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !915, line: 31, size: 32, align: 32, elements: !916)
!915 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!916 = !{!917}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !914, file: !915, line: 33, baseType: !918, size: 32, align: 32)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !915, line: 30, baseType: !889)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !905, file: !53, line: 80, baseType: !920, size: 128, align: 32, offset: 192)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !915, line: 211, size: 128, align: 32, elements: !921)
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !920, file: !915, line: 220, baseType: !923, size: 128, align: 32)
!923 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !920, file: !915, line: 213, size: 128, align: 32, elements: !924)
!924 = !{!925, !929, !934}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !923, file: !915, line: 215, baseType: !926, size: 128, align: 8)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !927, size: 128, align: 8, elements: !909)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !887, line: 48, baseType: !928)
!928 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !923, file: !915, line: 217, baseType: !930, size: 128, align: 16)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 128, align: 16, elements: !932)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !887, line: 49, baseType: !202)
!932 = !{!933}
!933 = !DISubrange(count: 8)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !923, file: !915, line: 218, baseType: !935, size: 128, align: 32)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 128, align: 32, elements: !936)
!936 = !{!937}
!937 = !DISubrange(count: 4)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !905, file: !53, line: 81, baseType: !156, size: 32, align: 32, offset: 320)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !905, file: !53, line: 82, baseType: !249, size: 8, align: 8, offset: 352)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !905, file: !53, line: 83, baseType: !889, size: 32, align: 32, offset: 384)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !905, file: !53, line: 84, baseType: !202, size: 16, align: 16, offset: 416)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !905, file: !53, line: 85, baseType: !943, size: 256, align: 8, offset: 432)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 256, align: 8, elements: !946)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !872, line: 33, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !199, line: 30, baseType: !928)
!946 = !{!947}
!947 = !DISubrange(count: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !905, file: !53, line: 86, baseType: !943, size: 256, align: 8, offset: 688)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !905, file: !53, line: 87, baseType: !219, size: 64, align: 64, offset: 960)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !905, file: !53, line: 88, baseType: !172, size: 32, align: 32, offset: 1024)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !905, file: !53, line: 90, baseType: !249, size: 8, align: 8, offset: 1056)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !905, file: !53, line: 91, baseType: !912, size: 32, align: 32, offset: 1088)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !905, file: !53, line: 92, baseType: !954, size: 64, align: 64, offset: 1152)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !905, file: !53, line: 94, baseType: !912, size: 32, align: 32, offset: 1216)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !905, file: !53, line: 96, baseType: !954, size: 64, align: 64, offset: 1280)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !905, file: !53, line: 97, baseType: !249, size: 8, align: 8, offset: 1344)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !905, file: !53, line: 100, baseType: !959, size: 64, align: 64, offset: 1408)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !53, line: 73, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !53, line: 65, size: 704, align: 64, elements: !962)
!962 = !{!963, !964, !965, !966, !967, !968, !969}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !961, file: !53, line: 66, baseType: !257, size: 128, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !961, file: !53, line: 67, baseType: !249, size: 8, align: 8, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !961, file: !53, line: 68, baseType: !257, size: 128, align: 64, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !961, file: !53, line: 69, baseType: !249, size: 8, align: 8, offset: 320)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !961, file: !53, line: 70, baseType: !257, size: 128, align: 64, offset: 384)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !961, file: !53, line: 71, baseType: !257, size: 128, align: 64, offset: 512)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !961, file: !53, line: 72, baseType: !172, size: 32, align: 32, offset: 640)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !905, file: !53, line: 101, baseType: !249, size: 8, align: 8, offset: 1472)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !905, file: !53, line: 102, baseType: !172, size: 32, align: 32, offset: 1504)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !905, file: !53, line: 103, baseType: !889, size: 32, align: 32, offset: 1536)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !905, file: !53, line: 104, baseType: !889, size: 32, align: 32, offset: 1568)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !905, file: !53, line: 105, baseType: !889, size: 32, align: 32, offset: 1600)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !905, file: !53, line: 107, baseType: !156, size: 32, align: 32, offset: 1632)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !905, file: !53, line: 109, baseType: !249, size: 8, align: 8, offset: 1664)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !905, file: !53, line: 110, baseType: !142, size: 64, align: 64, offset: 1728)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track_primary", scope: !824, file: !45, line: 189, baseType: !249, size: 8, align: 8, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !824, file: !45, line: 190, baseType: !249, size: 8, align: 8, offset: 328)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "skip_check_adv_addr", scope: !824, file: !45, line: 191, baseType: !249, size: 8, align: 8, offset: 336)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "strict_mode", scope: !824, file: !45, line: 193, baseType: !156, size: 32, align: 32, offset: 352)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_flags", scope: !824, file: !45, line: 195, baseType: !109, size: 64, align: 64, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_ifname", scope: !824, file: !45, line: 196, baseType: !908, size: 128, align: 8, offset: 448)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !824, file: !45, line: 198, baseType: !142, size: 64, align: 64, offset: 576)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !824, file: !45, line: 199, baseType: !142, size: 64, align: 64, offset: 640)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !824, file: !45, line: 200, baseType: !142, size: 64, align: 64, offset: 704)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_if_fault", scope: !824, file: !45, line: 204, baseType: !156, size: 32, align: 32, offset: 768)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_init", scope: !824, file: !45, line: 205, baseType: !156, size: 32, align: 32, offset: 800)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !824, file: !45, line: 206, baseType: !990, size: 1024, align: 64, offset: 832)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !991, line: 166, size: 1024, align: 64, elements: !992)
!991 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!992 = !{!993, !994, !998}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !990, file: !991, line: 168, baseType: !827, size: 16, align: 16)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !990, file: !991, line: 169, baseType: !995, size: 944, align: 8, offset: 16)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 944, align: 8, elements: !996)
!996 = !{!997}
!997 = !DISubrange(count: 118)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !990, file: !991, line: 170, baseType: !109, size: 64, align: 64, offset: 960)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "saddr_from_config", scope: !824, file: !45, line: 207, baseType: !249, size: 8, align: 8, offset: 1856)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "track_saddr", scope: !824, file: !45, line: 208, baseType: !249, size: 8, align: 8, offset: 1864)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_saddr", scope: !824, file: !45, line: 209, baseType: !990, size: 1024, align: 64, offset: 1920)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_peer", scope: !824, file: !45, line: 210, baseType: !142, size: 64, align: 64, offset: 2944)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_chksum_compat", scope: !824, file: !45, line: 212, baseType: !1004, size: 32, align: 32, offset: 3008)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "chksum_compatibility_t", file: !45, line: 179, baseType: !44)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "master_saddr", scope: !824, file: !45, line: 214, baseType: !990, size: 1024, align: 64, offset: 3072)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "master_priority", scope: !824, file: !45, line: 215, baseType: !927, size: 8, align: 8, offset: 4096)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "last_transition", scope: !824, file: !45, line: 216, baseType: !257, size: 128, align: 64, offset: 4160)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !824, file: !45, line: 217, baseType: !156, size: 32, align: 32, offset: 4288)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh", scope: !824, file: !45, line: 218, baseType: !257, size: 128, align: 64, offset: 4352)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_timer", scope: !824, file: !45, line: 219, baseType: !257, size: 128, align: 64, offset: 4480)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "garp_rep", scope: !824, file: !45, line: 220, baseType: !156, size: 32, align: 32, offset: 4608)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_rep", scope: !824, file: !45, line: 221, baseType: !156, size: 32, align: 32, offset: 4640)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_delay", scope: !824, file: !45, line: 222, baseType: !156, size: 32, align: 32, offset: 4672)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "garp_pending", scope: !824, file: !45, line: 223, baseType: !249, size: 8, align: 8, offset: 4704)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "gna_pending", scope: !824, file: !45, line: 224, baseType: !249, size: 8, align: 8, offset: 4712)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_rep", scope: !824, file: !45, line: 225, baseType: !156, size: 32, align: 32, offset: 4736)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lower_prio_no_advert", scope: !824, file: !45, line: 226, baseType: !156, size: 32, align: 32, offset: 4768)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "higher_prio_send_advert", scope: !824, file: !45, line: 227, baseType: !156, size: 32, align: 32, offset: 4800)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "vrid", scope: !824, file: !45, line: 228, baseType: !927, size: 8, align: 8, offset: 4832)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "base_priority", scope: !824, file: !45, line: 229, baseType: !927, size: 8, align: 8, offset: 4840)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "effective_priority", scope: !824, file: !45, line: 230, baseType: !927, size: 8, align: 8, offset: 4848)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "total_priority", scope: !824, file: !45, line: 231, baseType: !172, size: 32, align: 32, offset: 4864)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "vipset", scope: !824, file: !45, line: 233, baseType: !249, size: 8, align: 8, offset: 4896)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !824, file: !45, line: 234, baseType: !142, size: 64, align: 64, offset: 4928)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "evip", scope: !824, file: !45, line: 235, baseType: !142, size: 64, align: 64, offset: 4992)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries", scope: !824, file: !45, line: 239, baseType: !249, size: 8, align: 8, offset: 5056)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "evip_add_ipv6", scope: !824, file: !45, line: 240, baseType: !249, size: 8, align: 8, offset: 5064)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "vroutes", scope: !824, file: !45, line: 241, baseType: !142, size: 64, align: 64, offset: 5120)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "vrules", scope: !824, file: !45, line: 242, baseType: !142, size: 64, align: 64, offset: 5184)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "adver_int", scope: !824, file: !45, line: 243, baseType: !156, size: 32, align: 32, offset: 5248)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "master_adver_int", scope: !824, file: !45, line: 244, baseType: !156, size: 32, align: 32, offset: 5280)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !824, file: !45, line: 249, baseType: !156, size: 32, align: 32, offset: 5312)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_rx_buf_size", scope: !824, file: !45, line: 252, baseType: !219, size: 64, align: 64, offset: 5376)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rules_set", scope: !824, file: !45, line: 254, baseType: !249, size: 8, align: 8, offset: 5440)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "nopreempt", scope: !824, file: !45, line: 255, baseType: !249, size: 8, align: 8, offset: 5448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_delay", scope: !824, file: !45, line: 256, baseType: !109, size: 64, align: 64, offset: 5504)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_time", scope: !824, file: !45, line: 260, baseType: !257, size: 128, align: 64, offset: 5568)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !824, file: !45, line: 261, baseType: !172, size: 32, align: 32, offset: 5696)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "wantstate", scope: !824, file: !45, line: 265, baseType: !172, size: 32, align: 32, offset: 5728)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "reload_master", scope: !824, file: !45, line: 266, baseType: !249, size: 8, align: 8, offset: 5760)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "sockets", scope: !824, file: !45, line: 267, baseType: !1042, size: 64, align: 64, offset: 5824)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_t", file: !1044, line: 50, baseType: !1045)
!1044 = !DIFile(filename: "./../include/vrrp_sock.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sock", file: !1044, line: 40, size: 1344, align: 64, elements: !1046)
!1046 = !{!1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1045, file: !1044, line: 41, baseType: !827, size: 16, align: 16)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !1045, file: !1044, line: 42, baseType: !990, size: 1024, align: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !1045, file: !1044, line: 43, baseType: !172, size: 32, align: 32, offset: 1088)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !1045, file: !1044, line: 44, baseType: !912, size: 32, align: 32, offset: 1120)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "unicast", scope: !1045, file: !1044, line: 45, baseType: !249, size: 8, align: 8, offset: 1152)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "fd_in", scope: !1045, file: !1044, line: 46, baseType: !172, size: 32, align: 32, offset: 1184)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "fd_out", scope: !1045, file: !1044, line: 47, baseType: !172, size: 32, align: 32, offset: 1216)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_size", scope: !1045, file: !1044, line: 48, baseType: !172, size: 32, align: 32, offset: 1248)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !1045, file: !1044, line: 49, baseType: !104, size: 64, align: 64, offset: 1280)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !824, file: !45, line: 269, baseType: !172, size: 32, align: 32, offset: 5888)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !824, file: !45, line: 271, baseType: !172, size: 32, align: 32, offset: 5920)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !824, file: !45, line: 274, baseType: !172, size: 32, align: 32, offset: 5952)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !824, file: !45, line: 275, baseType: !172, size: 32, align: 32, offset: 5984)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !824, file: !45, line: 276, baseType: !249, size: 8, align: 8, offset: 6016)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !824, file: !45, line: 277, baseType: !857, size: 64, align: 64, offset: 6080)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !824, file: !45, line: 278, baseType: !857, size: 64, align: 64, offset: 6144)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !824, file: !45, line: 279, baseType: !857, size: 64, align: 64, offset: 6208)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !824, file: !45, line: 280, baseType: !857, size: 64, align: 64, offset: 6272)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "script_master_rx_lower_pri", scope: !824, file: !45, line: 281, baseType: !857, size: 64, align: 64, offset: 6336)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !824, file: !45, line: 282, baseType: !857, size: 64, align: 64, offset: 6400)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ms_down_timer", scope: !824, file: !45, line: 285, baseType: !889, size: 32, align: 32, offset: 6464)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !824, file: !45, line: 286, baseType: !257, size: 128, align: 64, offset: 6528)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !824, file: !45, line: 289, baseType: !174, size: 64, align: 64, offset: 6656)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer_size", scope: !824, file: !45, line: 290, baseType: !219, size: 64, align: 64, offset: 6720)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_csum", scope: !824, file: !45, line: 291, baseType: !889, size: 32, align: 32, offset: 6784)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "auth_type", scope: !824, file: !45, line: 295, baseType: !927, size: 8, align: 8, offset: 6816)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "auth_data", scope: !824, file: !45, line: 296, baseType: !1074, size: 64, align: 8, offset: 6824)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !927, size: 64, align: 8, elements: !932)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ipsecah_counter", scope: !824, file: !45, line: 299, baseType: !1076, size: 64, align: 32, offset: 6912)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_counter_t", file: !1077, line: 58, baseType: !1078)
!1077 = !DIFile(filename: "./../include/vrrp_ipsecah.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seq_counter", file: !1077, line: 55, size: 64, align: 32, elements: !1079)
!1079 = !{!1080, !1081}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !1078, file: !1077, line: 56, baseType: !249, size: 8, align: 8)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "seq_number", scope: !1078, file: !1077, line: 57, baseType: !889, size: 32, align: 32, offset: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !824, file: !45, line: 309, baseType: !172, size: 32, align: 32, offset: 6976)
!1083 = !DILocation(line: 615, column: 10, scope: !811)
!1084 = !DILocalVariable(name: "num_master_inst", scope: !811, file: !289, line: 616, type: !172)
!1085 = !DILocation(line: 616, column: 6, scope: !811)
!1086 = !DILocalVariable(name: "i", scope: !811, file: !289, line: 617, type: !172)
!1087 = !DILocation(line: 617, column: 6, scope: !811)
!1088 = !DILocation(line: 621, column: 9, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !811, file: !289, line: 621, column: 6)
!1090 = !DILocation(line: 621, column: 20, scope: !1089)
!1091 = !DILocation(line: 621, column: 26, scope: !1089)
!1092 = !DILocation(line: 621, column: 6, scope: !1089)
!1093 = !DILocation(line: 621, column: 11, scope: !1094)
!1094 = !DILexicalBlockFile(scope: !1089, file: !289, discriminator: 1)
!1095 = !DILocation(line: 621, column: 22, scope: !1094)
!1096 = !DILocation(line: 621, column: 29, scope: !1094)
!1097 = !DILocation(line: 621, column: 34, scope: !1094)
