; ModuleID = './[inter]keepalived--vrrp--vrrp_notify.o.i'
source_filename = "./[inter]keepalived--vrrp--vrrp_notify.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._thread_master = type { %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.list_head, %struct.list_head, %struct.list_head, %struct._list*, %struct.rb_root, %struct.epoll_event*, %struct._thread_event*, i32, i32, i32, i32, %struct._thread*, i64, i64, i8 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.rb_root = type { %struct.rb_node* }
%struct.rb_node = type { i64, %struct.rb_node*, %struct.rb_node* }
%struct.epoll_event = type opaque
%struct._thread_event = type { %struct._thread*, %struct._thread*, i64, i32, %struct.rb_node }
%struct._thread = type { i64, i32, %struct._thread_master*, i32 (%struct._thread*)*, i8*, %struct.timeval, %union.anon.0, %struct._thread_event*, %union.anon.1 }
%struct.timeval = type { i64, i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !40, globals: !42)
!1 = !DIFile(filename: "[inter]keepalived--vrrp--vrrp_notify.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!2 = !{!3, !11, !32}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chksum_compatibility", file: !4, line: 173, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./../include/vrrp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NONE", value: 0)
!7 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NEVER", value: 1)
!8 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_MIN_COMPAT", value: 2)
!9 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_CONFIG", value: 3)
!10 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_AUTO", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 41, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "../../lib/scheduler.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!14 = !DIEnumerator(name: "THREAD_READ", value: 0)
!15 = !DIEnumerator(name: "THREAD_WRITE", value: 1)
!16 = !DIEnumerator(name: "THREAD_TIMER", value: 2)
!17 = !DIEnumerator(name: "THREAD_TIMER_SHUTDOWN", value: 3)
!18 = !DIEnumerator(name: "THREAD_EVENT", value: 4)
!19 = !DIEnumerator(name: "THREAD_CHILD", value: 5)
!20 = !DIEnumerator(name: "THREAD_READY", value: 6)
!21 = !DIEnumerator(name: "THREAD_UNUSED", value: 7)
!22 = !DIEnumerator(name: "THREAD_WRITE_TIMEOUT", value: 8)
!23 = !DIEnumerator(name: "THREAD_READ_TIMEOUT", value: 9)
!24 = !DIEnumerator(name: "THREAD_CHILD_TIMEOUT", value: 10)
!25 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!26 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!27 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!28 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!29 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!30 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!31 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 57, size: 32, align: 32, elements: !34)
!33 = !DIFile(filename: "./../include/smtp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!34 = !{!35, !36, !37, !38, !39}
!35 = !DIEnumerator(name: "SMTP_MSG_RS", value: 0)
!36 = !DIEnumerator(name: "SMTP_MSG_VS", value: 1)
!37 = !DIEnumerator(name: "SMTP_MSG_RS_SHUT", value: 2)
!38 = !DIEnumerator(name: "SMTP_MSG_VGROUP", value: 3)
!39 = !DIEnumerator(name: "SMTP_MSG_VRRP", value: 4)
!40 = !{!41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!42 = !{!43}
!43 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !44, line: 150, type: !45, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!44 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !46, line: 31, baseType: !47)
!46 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !46, line: 39, size: 320, align: 64, elements: !49)
!49 = !{!50, !57, !58, !60, !64}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !48, file: !46, line: 40, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !46, line: 33, size: 192, align: 64, elements: !53)
!53 = !{!54, !55, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !46, line: 34, baseType: !51, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !52, file: !46, line: 35, baseType: !51, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !52, file: !46, line: 36, baseType: !41, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !48, file: !46, line: 41, baseType: !51, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !48, file: !46, line: 42, baseType: !59, size: 32, align: 32, offset: 128)
!59 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !48, file: !46, line: 43, baseType: !61, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !41}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !48, file: !46, line: 44, baseType: !65, size: 64, align: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !68, !41}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !70, line: 48, baseType: !71)
!70 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !72, line: 241, size: 1728, align: 64, elements: !73)
!72 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!73 = !{!74, !76, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !97, !98, !99, !100, !104, !106, !108, !112, !115, !117, !118, !119, !120, !121, !125, !126}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !71, file: !72, line: 242, baseType: !75, size: 32, align: 32)
!75 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !71, file: !72, line: 247, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !71, file: !72, line: 248, baseType: !77, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !71, file: !72, line: 249, baseType: !77, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !71, file: !72, line: 250, baseType: !77, size: 64, align: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !71, file: !72, line: 251, baseType: !77, size: 64, align: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !71, file: !72, line: 252, baseType: !77, size: 64, align: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !71, file: !72, line: 253, baseType: !77, size: 64, align: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !71, file: !72, line: 254, baseType: !77, size: 64, align: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !71, file: !72, line: 256, baseType: !77, size: 64, align: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !71, file: !72, line: 257, baseType: !77, size: 64, align: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !71, file: !72, line: 258, baseType: !77, size: 64, align: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !71, file: !72, line: 260, baseType: !90, size: 64, align: 64, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !72, line: 156, size: 192, align: 64, elements: !92)
!92 = !{!93, !94, !96}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !91, file: !72, line: 157, baseType: !90, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !91, file: !72, line: 158, baseType: !95, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !91, file: !72, line: 162, baseType: !75, size: 32, align: 32, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !71, file: !72, line: 262, baseType: !95, size: 64, align: 64, offset: 832)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !71, file: !72, line: 264, baseType: !75, size: 32, align: 32, offset: 896)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !71, file: !72, line: 268, baseType: !75, size: 32, align: 32, offset: 928)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !71, file: !72, line: 270, baseType: !101, size: 64, align: 64, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !102, line: 131, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!103 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !71, file: !72, line: 274, baseType: !105, size: 16, align: 16, offset: 1024)
!105 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !71, file: !72, line: 275, baseType: !107, size: 8, align: 8, offset: 1040)
!107 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !71, file: !72, line: 276, baseType: !109, size: 8, align: 8, offset: 1048)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 8, align: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 1)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !71, file: !72, line: 280, baseType: !113, size: 64, align: 64, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !72, line: 150, baseType: null)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !71, file: !72, line: 289, baseType: !116, size: 64, align: 64, offset: 1152)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !102, line: 132, baseType: !103)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !71, file: !72, line: 297, baseType: !41, size: 64, align: 64, offset: 1216)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !71, file: !72, line: 298, baseType: !41, size: 64, align: 64, offset: 1280)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !71, file: !72, line: 299, baseType: !41, size: 64, align: 64, offset: 1344)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !71, file: !72, line: 300, baseType: !41, size: 64, align: 64, offset: 1408)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !71, file: !72, line: 302, baseType: !122, size: 64, align: 64, offset: 1472)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !123, line: 216, baseType: !124)
!123 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!124 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !71, file: !72, line: 303, baseType: !75, size: 32, align: 32, offset: 1536)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !71, file: !72, line: 305, baseType: !127, size: 160, align: 8, offset: 1568)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 160, align: 8, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 20)
!130 = !{i32 2, !"Dwarf Version", i32 4}
!131 = !{i32 2, !"Debug Info Version", i32 3}
!132 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!133 = distinct !DISubprogram(name: "send_event_notify", scope: !134, file: !134, line: 239, type: !135, isLocal: false, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !494)
!134 = !DIFile(filename: "vrrp_notify.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!135 = !DISubroutineType(types: !136)
!136 = !{null, !137, !75}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_t", file: !4, line: 310, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_t", file: !4, line: 183, size: 7040, align: 64, elements: !140)
!140 = !{!141, !144, !145, !195, !217, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !324, !325, !326, !327, !328, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !486, !493}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !139, file: !4, line: 184, baseType: !142, size: 16, align: 16)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !143, line: 28, baseType: !105)
!143 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!144 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !139, file: !4, line: 185, baseType: !77, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !139, file: !4, line: 186, baseType: !146, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_sgroup_t", file: !4, line: 133, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_sgroup", file: !4, line: 109, size: 1024, align: 64, elements: !149)
!149 = !{!150, !151, !161, !162, !163, !164, !165, !167, !168, !169, !170, !171, !172, !189, !190, !191, !192, !193, !194}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !148, file: !4, line: 110, baseType: !77, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !148, file: !4, line: 111, baseType: !152, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !154, line: 34, baseType: !155)
!154 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !154, line: 30, size: 128, align: 64, elements: !156)
!156 = !{!157, !158, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !155, file: !154, line: 31, baseType: !59, size: 32, align: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !155, file: !154, line: 32, baseType: !59, size: 32, align: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !155, file: !154, line: 33, baseType: !160, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !148, file: !4, line: 112, baseType: !45, size: 64, align: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_fault", scope: !148, file: !4, line: 113, baseType: !59, size: 32, align: 32, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_init", scope: !148, file: !4, line: 114, baseType: !59, size: 32, align: 32, offset: 224)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !148, file: !4, line: 115, baseType: !75, size: 32, align: 32, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "sgroup_tracking_weight", scope: !148, file: !4, line: 116, baseType: !166, size: 8, align: 8, offset: 288)
!166 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !148, file: !4, line: 119, baseType: !45, size: 64, align: 64, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !148, file: !4, line: 120, baseType: !45, size: 64, align: 64, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !148, file: !4, line: 121, baseType: !45, size: 64, align: 64, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "track_bfd", scope: !148, file: !4, line: 122, baseType: !45, size: 64, align: 64, offset: 512)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !148, file: !4, line: 125, baseType: !166, size: 8, align: 8, offset: 576)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !148, file: !4, line: 126, baseType: !173, size: 64, align: 64, offset: 640)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !175, line: 65, baseType: !176)
!175 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !175, line: 59, size: 192, align: 64, elements: !177)
!177 = !{!178, !180, !181, !182, !186}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !176, file: !175, line: 60, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !176, file: !175, line: 61, baseType: !75, size: 32, align: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !176, file: !175, line: 62, baseType: !75, size: 32, align: 32, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !176, file: !175, line: 63, baseType: !183, size: 32, align: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !184, line: 240, baseType: !185)
!184 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !102, line: 125, baseType: !59)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !176, file: !175, line: 64, baseType: !187, size: 32, align: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !184, line: 235, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !102, line: 126, baseType: !59)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !148, file: !4, line: 127, baseType: !173, size: 64, align: 64, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !148, file: !4, line: 128, baseType: !173, size: 64, align: 64, offset: 768)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !148, file: !4, line: 129, baseType: !173, size: 64, align: 64, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !148, file: !4, line: 130, baseType: !173, size: 64, align: 64, offset: 896)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !148, file: !4, line: 131, baseType: !75, size: 32, align: 32, offset: 960)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !148, file: !4, line: 132, baseType: !75, size: 32, align: 32, offset: 992)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !139, file: !4, line: 187, baseType: !196, size: 64, align: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_stats", file: !4, line: 169, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_stats", file: !4, line: 136, size: 768, align: 64, elements: !199)
!199 = !{!200, !203, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "advert_rcvd", scope: !198, file: !4, line: 137, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !202, line: 55, baseType: !124)
!202 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!203 = !DIDerivedType(tag: DW_TAG_member, name: "advert_sent", scope: !198, file: !4, line: 138, baseType: !204, size: 32, align: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !202, line: 51, baseType: !59)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "become_master", scope: !198, file: !4, line: 140, baseType: !204, size: 32, align: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "release_master", scope: !198, file: !4, line: 141, baseType: !204, size: 32, align: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "packet_len_err", scope: !198, file: !4, line: 143, baseType: !201, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "advert_interval_err", scope: !198, file: !4, line: 144, baseType: !201, size: 64, align: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl_err", scope: !198, file: !4, line: 145, baseType: !201, size: 64, align: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_type_rcvd", scope: !198, file: !4, line: 146, baseType: !201, size: 64, align: 64, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list_err", scope: !198, file: !4, line: 147, baseType: !201, size: 64, align: 64, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_authtype", scope: !198, file: !4, line: 149, baseType: !204, size: 32, align: 32, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "authtype_mismatch", scope: !198, file: !4, line: 151, baseType: !204, size: 32, align: 32, offset: 544)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "auth_failure", scope: !198, file: !4, line: 152, baseType: !204, size: 32, align: 32, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_rcvd", scope: !198, file: !4, line: 155, baseType: !201, size: 64, align: 64, offset: 640)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_sent", scope: !198, file: !4, line: 156, baseType: !201, size: 64, align: 64, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !139, file: !4, line: 188, baseType: !218, size: 64, align: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !44, line: 111, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !44, line: 76, size: 1792, align: 64, elements: !221)
!221 = !{!222, !226, !228, !234, !253, !254, !255, !256, !257, !264, !265, !266, !267, !268, !269, !271, !272, !273, !274, !295, !296, !297, !298, !299, !300, !301, !302}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !220, file: !44, line: 77, baseType: !223, size: 128, align: 8)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 128, align: 8, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 16)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !220, file: !44, line: 78, baseType: !227, size: 32, align: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !44, line: 62, baseType: !204)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !220, file: !44, line: 79, baseType: !229, size: 32, align: 32, offset: 160)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !230, line: 31, size: 32, align: 32, elements: !231)
!230 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !229, file: !230, line: 33, baseType: !233, size: 32, align: 32)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !230, line: 30, baseType: !204)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !220, file: !44, line: 80, baseType: !235, size: 128, align: 32, offset: 192)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !230, line: 211, size: 128, align: 32, elements: !236)
!236 = !{!237}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !235, file: !230, line: 220, baseType: !238, size: 128, align: 32)
!238 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !235, file: !230, line: 213, size: 128, align: 32, elements: !239)
!239 = !{!240, !244, !249}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !238, file: !230, line: 215, baseType: !241, size: 128, align: 8)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 128, align: 8, elements: !224)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !202, line: 48, baseType: !243)
!243 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !238, file: !230, line: 217, baseType: !245, size: 128, align: 16)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 128, align: 16, elements: !247)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !202, line: 49, baseType: !105)
!247 = !{!248}
!248 = !DISubrange(count: 8)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !238, file: !230, line: 218, baseType: !250, size: 128, align: 32)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 128, align: 32, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 4)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !220, file: !44, line: 81, baseType: !59, size: 32, align: 32, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !220, file: !44, line: 82, baseType: !166, size: 8, align: 8, offset: 352)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !220, file: !44, line: 83, baseType: !204, size: 32, align: 32, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !220, file: !44, line: 84, baseType: !105, size: 16, align: 16, offset: 416)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !220, file: !44, line: 85, baseType: !258, size: 256, align: 8, offset: 432)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 256, align: 8, elements: !262)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !260, line: 33, baseType: !261)
!260 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !102, line: 30, baseType: !243)
!262 = !{!263}
!263 = !DISubrange(count: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !220, file: !44, line: 86, baseType: !258, size: 256, align: 8, offset: 688)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !220, file: !44, line: 87, baseType: !122, size: 64, align: 64, offset: 960)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !220, file: !44, line: 88, baseType: !75, size: 32, align: 32, offset: 1024)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !220, file: !44, line: 90, baseType: !166, size: 8, align: 8, offset: 1056)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !220, file: !44, line: 91, baseType: !227, size: 32, align: 32, offset: 1088)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !220, file: !44, line: 92, baseType: !270, size: 64, align: 64, offset: 1152)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !220, file: !44, line: 94, baseType: !227, size: 32, align: 32, offset: 1216)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !220, file: !44, line: 96, baseType: !270, size: 64, align: 64, offset: 1280)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !220, file: !44, line: 97, baseType: !166, size: 8, align: 8, offset: 1344)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !220, file: !44, line: 100, baseType: !275, size: 64, align: 64, offset: 1408)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !44, line: 73, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !44, line: 65, size: 704, align: 64, elements: !278)
!278 = !{!279, !289, !290, !291, !292, !293, !294}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !277, file: !44, line: 66, baseType: !280, size: 128, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !281, line: 31, baseType: !282)
!281 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !283, line: 30, size: 128, align: 64, elements: !284)
!283 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!284 = !{!285, !287}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !282, file: !283, line: 32, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !102, line: 139, baseType: !103)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !282, file: !283, line: 33, baseType: !288, size: 64, align: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !102, line: 141, baseType: !103)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !277, file: !44, line: 67, baseType: !166, size: 8, align: 8, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !277, file: !44, line: 68, baseType: !280, size: 128, align: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !277, file: !44, line: 69, baseType: !166, size: 8, align: 8, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !277, file: !44, line: 70, baseType: !280, size: 128, align: 64, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !277, file: !44, line: 71, baseType: !280, size: 128, align: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !277, file: !44, line: 72, baseType: !75, size: 32, align: 32, offset: 640)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !220, file: !44, line: 101, baseType: !166, size: 8, align: 8, offset: 1472)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !220, file: !44, line: 102, baseType: !75, size: 32, align: 32, offset: 1504)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !220, file: !44, line: 103, baseType: !204, size: 32, align: 32, offset: 1536)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !220, file: !44, line: 104, baseType: !204, size: 32, align: 32, offset: 1568)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !220, file: !44, line: 105, baseType: !204, size: 32, align: 32, offset: 1600)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !220, file: !44, line: 107, baseType: !59, size: 32, align: 32, offset: 1632)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !220, file: !44, line: 109, baseType: !166, size: 8, align: 8, offset: 1664)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !220, file: !44, line: 110, baseType: !45, size: 64, align: 64, offset: 1728)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track_primary", scope: !139, file: !4, line: 189, baseType: !166, size: 8, align: 8, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !139, file: !4, line: 190, baseType: !166, size: 8, align: 8, offset: 328)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "skip_check_adv_addr", scope: !139, file: !4, line: 191, baseType: !166, size: 8, align: 8, offset: 336)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "strict_mode", scope: !139, file: !4, line: 193, baseType: !59, size: 32, align: 32, offset: 352)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_flags", scope: !139, file: !4, line: 195, baseType: !124, size: 64, align: 64, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_ifname", scope: !139, file: !4, line: 196, baseType: !223, size: 128, align: 8, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !139, file: !4, line: 198, baseType: !45, size: 64, align: 64, offset: 576)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !139, file: !4, line: 199, baseType: !45, size: 64, align: 64, offset: 640)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !139, file: !4, line: 200, baseType: !45, size: 64, align: 64, offset: 704)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_if_fault", scope: !139, file: !4, line: 204, baseType: !59, size: 32, align: 32, offset: 768)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_init", scope: !139, file: !4, line: 205, baseType: !59, size: 32, align: 32, offset: 800)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !139, file: !4, line: 206, baseType: !315, size: 1024, align: 64, offset: 832)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !316, line: 166, size: 1024, align: 64, elements: !317)
!316 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!317 = !{!318, !319, !323}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !315, file: !316, line: 168, baseType: !142, size: 16, align: 16)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !315, file: !316, line: 169, baseType: !320, size: 944, align: 8, offset: 16)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 944, align: 8, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 118)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !315, file: !316, line: 170, baseType: !124, size: 64, align: 64, offset: 960)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "saddr_from_config", scope: !139, file: !4, line: 207, baseType: !166, size: 8, align: 8, offset: 1856)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "track_saddr", scope: !139, file: !4, line: 208, baseType: !166, size: 8, align: 8, offset: 1864)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_saddr", scope: !139, file: !4, line: 209, baseType: !315, size: 1024, align: 64, offset: 1920)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_peer", scope: !139, file: !4, line: 210, baseType: !45, size: 64, align: 64, offset: 2944)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_chksum_compat", scope: !139, file: !4, line: 212, baseType: !329, size: 32, align: 32, offset: 3008)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "chksum_compatibility_t", file: !4, line: 179, baseType: !3)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "master_saddr", scope: !139, file: !4, line: 214, baseType: !315, size: 1024, align: 64, offset: 3072)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "master_priority", scope: !139, file: !4, line: 215, baseType: !242, size: 8, align: 8, offset: 4096)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "last_transition", scope: !139, file: !4, line: 216, baseType: !280, size: 128, align: 64, offset: 4160)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !139, file: !4, line: 217, baseType: !59, size: 32, align: 32, offset: 4288)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh", scope: !139, file: !4, line: 218, baseType: !280, size: 128, align: 64, offset: 4352)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_timer", scope: !139, file: !4, line: 219, baseType: !280, size: 128, align: 64, offset: 4480)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "garp_rep", scope: !139, file: !4, line: 220, baseType: !59, size: 32, align: 32, offset: 4608)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_rep", scope: !139, file: !4, line: 221, baseType: !59, size: 32, align: 32, offset: 4640)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_delay", scope: !139, file: !4, line: 222, baseType: !59, size: 32, align: 32, offset: 4672)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "garp_pending", scope: !139, file: !4, line: 223, baseType: !166, size: 8, align: 8, offset: 4704)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "gna_pending", scope: !139, file: !4, line: 224, baseType: !166, size: 8, align: 8, offset: 4712)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_rep", scope: !139, file: !4, line: 225, baseType: !59, size: 32, align: 32, offset: 4736)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "lower_prio_no_advert", scope: !139, file: !4, line: 226, baseType: !59, size: 32, align: 32, offset: 4768)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "higher_prio_send_advert", scope: !139, file: !4, line: 227, baseType: !59, size: 32, align: 32, offset: 4800)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "vrid", scope: !139, file: !4, line: 228, baseType: !242, size: 8, align: 8, offset: 4832)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "base_priority", scope: !139, file: !4, line: 229, baseType: !242, size: 8, align: 8, offset: 4840)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "effective_priority", scope: !139, file: !4, line: 230, baseType: !242, size: 8, align: 8, offset: 4848)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "total_priority", scope: !139, file: !4, line: 231, baseType: !75, size: 32, align: 32, offset: 4864)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "vipset", scope: !139, file: !4, line: 233, baseType: !166, size: 8, align: 8, offset: 4896)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !139, file: !4, line: 234, baseType: !45, size: 64, align: 64, offset: 4928)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "evip", scope: !139, file: !4, line: 235, baseType: !45, size: 64, align: 64, offset: 4992)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries", scope: !139, file: !4, line: 239, baseType: !166, size: 8, align: 8, offset: 5056)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "evip_add_ipv6", scope: !139, file: !4, line: 240, baseType: !166, size: 8, align: 8, offset: 5064)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "vroutes", scope: !139, file: !4, line: 241, baseType: !45, size: 64, align: 64, offset: 5120)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "vrules", scope: !139, file: !4, line: 242, baseType: !45, size: 64, align: 64, offset: 5184)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "adver_int", scope: !139, file: !4, line: 243, baseType: !59, size: 32, align: 32, offset: 5248)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "master_adver_int", scope: !139, file: !4, line: 244, baseType: !59, size: 32, align: 32, offset: 5280)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !139, file: !4, line: 249, baseType: !59, size: 32, align: 32, offset: 5312)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_rx_buf_size", scope: !139, file: !4, line: 252, baseType: !122, size: 64, align: 64, offset: 5376)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rules_set", scope: !139, file: !4, line: 254, baseType: !166, size: 8, align: 8, offset: 5440)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "nopreempt", scope: !139, file: !4, line: 255, baseType: !166, size: 8, align: 8, offset: 5448)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_delay", scope: !139, file: !4, line: 256, baseType: !124, size: 64, align: 64, offset: 5504)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_time", scope: !139, file: !4, line: 260, baseType: !280, size: 128, align: 64, offset: 5568)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !139, file: !4, line: 261, baseType: !75, size: 32, align: 32, offset: 5696)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "wantstate", scope: !139, file: !4, line: 265, baseType: !75, size: 32, align: 32, offset: 5728)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "reload_master", scope: !139, file: !4, line: 266, baseType: !166, size: 8, align: 8, offset: 5760)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "sockets", scope: !139, file: !4, line: 267, baseType: !367, size: 64, align: 64, offset: 5824)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_t", file: !369, line: 50, baseType: !370)
!369 = !DIFile(filename: "./../include/vrrp_sock.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sock", file: !369, line: 40, size: 1344, align: 64, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !377, !378, !379, !380}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !370, file: !369, line: 41, baseType: !142, size: 16, align: 16)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !370, file: !369, line: 42, baseType: !315, size: 1024, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !370, file: !369, line: 43, baseType: !75, size: 32, align: 32, offset: 1088)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !370, file: !369, line: 44, baseType: !227, size: 32, align: 32, offset: 1120)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "unicast", scope: !370, file: !369, line: 45, baseType: !166, size: 8, align: 8, offset: 1152)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fd_in", scope: !370, file: !369, line: 46, baseType: !75, size: 32, align: 32, offset: 1184)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "fd_out", scope: !370, file: !369, line: 47, baseType: !75, size: 32, align: 32, offset: 1216)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_size", scope: !370, file: !369, line: 48, baseType: !75, size: 32, align: 32, offset: 1248)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !370, file: !369, line: 49, baseType: !381, size: 64, align: 64, offset: 1280)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !12, line: 99, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !12, line: 78, size: 768, align: 64, elements: !384)
!384 = !{!385, !386, !388, !441, !446, !447, !448, !460, !462}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !383, file: !12, line: 79, baseType: !124, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !383, file: !12, line: 80, baseType: !387, size: 32, align: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !12, line: 63, baseType: !11)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !383, file: !12, line: 81, baseType: !389, size: 64, align: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !12, line: 112, size: 1280, align: 64, elements: !391)
!391 = !{!392, !404, !405, !406, !407, !415, !416, !417, !418, !419, !422, !433, !434, !435, !436, !437, !438, !439, !440}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !390, file: !12, line: 113, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !394, line: 109, baseType: !395)
!394 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !394, line: 106, size: 64, align: 64, elements: !396)
!396 = !{!397}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !395, file: !394, line: 108, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !394, line: 97, size: 192, align: 64, elements: !400)
!400 = !{!401, !402, !403}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !399, file: !394, line: 99, baseType: !124, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !399, file: !394, line: 102, baseType: !398, size: 64, align: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !399, file: !394, line: 103, baseType: !398, size: 64, align: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !390, file: !12, line: 114, baseType: !393, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !390, file: !12, line: 115, baseType: !393, size: 64, align: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !390, file: !12, line: 116, baseType: !393, size: 64, align: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !390, file: !12, line: 117, baseType: !408, size: 128, align: 64, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !409, line: 62, baseType: !410)
!409 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !409, line: 60, size: 128, align: 64, elements: !411)
!411 = !{!412, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !410, file: !409, line: 61, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !410, file: !409, line: 61, baseType: !413, size: 64, align: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !390, file: !12, line: 121, baseType: !408, size: 128, align: 64, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !390, file: !12, line: 122, baseType: !408, size: 128, align: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !390, file: !12, line: 124, baseType: !45, size: 64, align: 64, offset: 640)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !390, file: !12, line: 127, baseType: !393, size: 64, align: 64, offset: 704)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !390, file: !12, line: 128, baseType: !420, size: 64, align: 64, offset: 768)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !12, line: 128, flags: DIFlagFwdDecl)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !390, file: !12, line: 129, baseType: !423, size: 64, align: 64, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !12, line: 109, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !12, line: 102, size: 448, align: 64, elements: !426)
!426 = !{!427, !428, !429, !430, !431}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !425, file: !12, line: 103, baseType: !381, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !425, file: !12, line: 104, baseType: !381, size: 64, align: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !425, file: !12, line: 105, baseType: !124, size: 64, align: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !425, file: !12, line: 106, baseType: !75, size: 32, align: 32, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !425, file: !12, line: 108, baseType: !432, size: 192, align: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !394, line: 104, baseType: !399)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !390, file: !12, line: 130, baseType: !59, size: 32, align: 32, offset: 896)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !390, file: !12, line: 131, baseType: !59, size: 32, align: 32, offset: 928)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !390, file: !12, line: 132, baseType: !75, size: 32, align: 32, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !390, file: !12, line: 135, baseType: !75, size: 32, align: 32, offset: 992)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !390, file: !12, line: 136, baseType: !381, size: 64, align: 64, offset: 1024)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !390, file: !12, line: 146, baseType: !124, size: 64, align: 64, offset: 1088)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !390, file: !12, line: 147, baseType: !124, size: 64, align: 64, offset: 1152)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !390, file: !12, line: 148, baseType: !166, size: 8, align: 8, offset: 1216)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !383, file: !12, line: 82, baseType: !442, size: 64, align: 64, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!75, !445}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !383, file: !12, line: 83, baseType: !41, size: 64, align: 64, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !383, file: !12, line: 84, baseType: !280, size: 128, align: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !383, file: !12, line: 92, baseType: !449, size: 64, align: 32, offset: 448)
!449 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !383, file: !12, line: 85, size: 64, align: 32, elements: !450)
!450 = !{!451, !452, !453}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !449, file: !12, line: 86, baseType: !75, size: 32, align: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !449, file: !12, line: 87, baseType: !75, size: 32, align: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !449, file: !12, line: 91, baseType: !454, size: 64, align: 32)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !12, line: 88, size: 64, align: 32, elements: !455)
!455 = !{!456, !459}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !454, file: !12, line: 89, baseType: !457, size: 32, align: 32)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !184, line: 263, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !102, line: 133, baseType: !75)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !454, file: !12, line: 90, baseType: !75, size: 32, align: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !383, file: !12, line: 93, baseType: !461, size: 64, align: 64, offset: 512)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, scope: !383, file: !12, line: 95, baseType: !463, size: 192, align: 64, offset: 576)
!463 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !383, file: !12, line: 95, size: 192, align: 64, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !463, file: !12, line: 96, baseType: !432, size: 192, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !12, line: 97, baseType: !408, size: 128, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !139, file: !4, line: 269, baseType: !75, size: 32, align: 32, offset: 5888)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !139, file: !4, line: 271, baseType: !75, size: 32, align: 32, offset: 5920)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !139, file: !4, line: 274, baseType: !75, size: 32, align: 32, offset: 5952)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !139, file: !4, line: 275, baseType: !75, size: 32, align: 32, offset: 5984)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !139, file: !4, line: 276, baseType: !166, size: 8, align: 8, offset: 6016)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !139, file: !4, line: 277, baseType: !173, size: 64, align: 64, offset: 6080)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !139, file: !4, line: 278, baseType: !173, size: 64, align: 64, offset: 6144)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !139, file: !4, line: 279, baseType: !173, size: 64, align: 64, offset: 6208)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !139, file: !4, line: 280, baseType: !173, size: 64, align: 64, offset: 6272)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "script_master_rx_lower_pri", scope: !139, file: !4, line: 281, baseType: !173, size: 64, align: 64, offset: 6336)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !139, file: !4, line: 282, baseType: !173, size: 64, align: 64, offset: 6400)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ms_down_timer", scope: !139, file: !4, line: 285, baseType: !204, size: 32, align: 32, offset: 6464)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !139, file: !4, line: 286, baseType: !280, size: 128, align: 64, offset: 6528)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !139, file: !4, line: 289, baseType: !77, size: 64, align: 64, offset: 6656)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer_size", scope: !139, file: !4, line: 290, baseType: !122, size: 64, align: 64, offset: 6720)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_csum", scope: !139, file: !4, line: 291, baseType: !204, size: 32, align: 32, offset: 6784)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "auth_type", scope: !139, file: !4, line: 295, baseType: !242, size: 8, align: 8, offset: 6816)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "auth_data", scope: !139, file: !4, line: 296, baseType: !485, size: 64, align: 8, offset: 6824)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 64, align: 8, elements: !247)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ipsecah_counter", scope: !139, file: !4, line: 299, baseType: !487, size: 64, align: 32, offset: 6912)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_counter_t", file: !488, line: 58, baseType: !489)
!488 = !DIFile(filename: "./../include/vrrp_ipsecah.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seq_counter", file: !488, line: 55, size: 64, align: 32, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !489, file: !488, line: 56, baseType: !166, size: 8, align: 8)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "seq_number", scope: !489, file: !488, line: 57, baseType: !204, size: 32, align: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !139, file: !4, line: 309, baseType: !75, size: 32, align: 32, offset: 6976)
!494 = !{}
!495 = !DILocalVariable(name: "vrrp", arg: 1, scope: !133, file: !134, line: 239, type: !137)
!496 = !DIExpression()
!497 = !DILocation(line: 239, column: 27, scope: !133)
!498 = !DILocalVariable(name: "event", arg: 2, scope: !133, file: !134, line: 239, type: !75)
!499 = !DILocation(line: 239, column: 37, scope: !133)
!500 = !DILocalVariable(name: "script", scope: !133, file: !134, line: 241, type: !173)
!501 = !DILocation(line: 241, column: 19, scope: !133)
!502 = !DILocation(line: 241, column: 28, scope: !133)
!503 = !DILocation(line: 241, column: 34, scope: !133)
!504 = !DILocation(line: 244, column: 6, scope: !505)
!505 = distinct !DILexicalBlock(scope: !133, file: !134, line: 244, column: 6)
!506 = !DILocation(line: 244, column: 6, scope: !133)
!507 = !DILocation(line: 245, column: 15, scope: !505)
!508 = !DILocation(line: 245, column: 3, scope: !505)
!509 = !DILocation(line: 247, column: 14, scope: !133)
!510 = !DILocation(line: 247, column: 20, scope: !133)
!511 = !DILocation(line: 247, column: 27, scope: !133)
!512 = !DILocation(line: 247, column: 40, scope: !133)
!513 = !DILocation(line: 247, column: 46, scope: !133)
!514 = !DILocation(line: 247, column: 2, scope: !133)
!515 = !DILocation(line: 248, column: 1, scope: !133)
!516 = distinct !DISubprogram(name: "notify_fifo", scope: !134, file: !134, line: 88, type: !517, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !494)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !519, !75, !166, !242}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!521 = !DILocalVariable(name: "name", arg: 1, scope: !516, file: !134, line: 88, type: !519)
!522 = !DILocation(line: 88, column: 25, scope: !516)
!523 = !DILocalVariable(name: "state_num", arg: 2, scope: !516, file: !134, line: 88, type: !75)
!524 = !DILocation(line: 88, column: 35, scope: !516)
!525 = !DILocalVariable(name: "group", arg: 3, scope: !516, file: !134, line: 88, type: !166)
!526 = !DILocation(line: 88, column: 50, scope: !516)
!527 = !DILocalVariable(name: "priority", arg: 4, scope: !516, file: !134, line: 88, type: !242)
!528 = !DILocation(line: 88, column: 65, scope: !516)
!529 = !DILocalVariable(name: "state", scope: !516, file: !134, line: 90, type: !77)
!530 = !DILocation(line: 90, column: 8, scope: !516)
!531 = !DILocalVariable(name: "size", scope: !516, file: !134, line: 91, type: !122)
!532 = !DILocation(line: 91, column: 9, scope: !516)
!533 = !DILocalVariable(name: "line", scope: !516, file: !134, line: 92, type: !77)
!534 = !DILocation(line: 92, column: 8, scope: !516)
!535 = !DILocalVariable(name: "type", scope: !516, file: !134, line: 93, type: !77)
!536 = !DILocation(line: 93, column: 8, scope: !516)
!537 = !DILocation(line: 95, column: 6, scope: !538)
!538 = distinct !DILexicalBlock(scope: !516, file: !134, line: 95, column: 6)
!539 = !DILocation(line: 95, column: 19, scope: !538)
!540 = !DILocation(line: 95, column: 31, scope: !538)
!541 = !DILocation(line: 95, column: 34, scope: !538)
!542 = !DILocation(line: 95, column: 40, scope: !538)
!543 = !DILocation(line: 96, column: 6, scope: !538)
!544 = !DILocation(line: 96, column: 19, scope: !538)
!545 = !DILocation(line: 96, column: 36, scope: !538)
!546 = !DILocation(line: 96, column: 39, scope: !538)
!547 = !DILocation(line: 95, column: 6, scope: !548)
!548 = !DILexicalBlockFile(scope: !516, file: !134, discriminator: 1)
!549 = !DILocation(line: 97, column: 3, scope: !538)
!550 = !DILocation(line: 99, column: 10, scope: !516)
!551 = !DILocation(line: 99, column: 2, scope: !516)
!552 = !DILocation(line: 101, column: 9, scope: !553)
!553 = distinct !DILexicalBlock(scope: !516, file: !134, line: 99, column: 21)
!554 = !DILocation(line: 102, column: 3, scope: !553)
