; ModuleID = './[inter]keepalived--vrrp--vrrp.o.i'
source_filename = "./[inter]keepalived--vrrp--vrrp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._data = type { i8*, i8, i8*, i8, i8*, i8*, %struct.sockaddr_storage, i8*, i64, %struct._list*, i32, i8, i8, i32, i8*, %struct._interface*, i32, i32, i32, i32, %struct.lvs_syncd_config, i8, %struct.sockaddr_in, %struct.sockaddr_in6, i32, %struct.timeval, i32, i32, i32, i32, i32, i32, i8, i8, i32, [29 x i8], [29 x i8], i8, [32 x i8], [32 x i8], [32 x i8], i8, i8, i8, i8, i8, i8, i32, i64, i8, i8, i8, i32, i64, %struct._notify_fifo, %struct._notify_fifo, %struct._notify_fifo, i32, i8, i32, i8, i32, i8, i32, i8, i8, i8, i32, i64, i32 }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

!107 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !108, line: 24, size: 32, align: 32, elements: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118}
!110 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!111 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!112 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!113 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!114 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!115 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!116 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!117 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!118 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vrrp_vmac_bits", file: !120, line: 40, size: 32, align: 32, elements: !121)
!120 = !DIFile(filename: "./../include/vrrp_vmac.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!121 = !{!122, !123, !124}
!122 = !DIEnumerator(name: "VRRP_VMAC_BIT", value: 0)
!123 = !DIEnumerator(name: "VRRP_VMAC_UP_BIT", value: 1)
!124 = !DIEnumerator(name: "VRRP_VMAC_XMITBASE_BIT", value: 2)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !126, line: 44, size: 32, align: 32, elements: !127)
!126 = !DIFile(filename: "../../lib/parser.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140}
!128 = !DIEnumerator(name: "CONFIG_OK", value: 0)
!129 = !DIEnumerator(name: "CONFIG_FILE_NOT_FOUND", value: 1)
!130 = !DIEnumerator(name: "CONFIG_BAD_IF", value: 2)
!131 = !DIEnumerator(name: "CONFIG_FATAL", value: 3)
!132 = !DIEnumerator(name: "CONFIG_MULTIPLE_FILES", value: 4)
!133 = !DIEnumerator(name: "CONFIG_UNKNOWN_KEYWORD", value: 5)
!134 = !DIEnumerator(name: "CONFIG_UNEXPECTED_BOB", value: 6)
!135 = !DIEnumerator(name: "CONFIG_MISSING_BOB", value: 7)
!136 = !DIEnumerator(name: "CONFIG_UNMATCHED_QUOTE", value: 8)
!137 = !DIEnumerator(name: "CONFIG_MISSING_PARAMETER", value: 9)
!138 = !DIEnumerator(name: "CONFIG_INVALID_NUMBER", value: 10)
!139 = !DIEnumerator(name: "CONFIG_GENERAL_ERROR", value: 11)
!140 = !DIEnumerator(name: "CONFIG_SECURITY_ERROR", value: 12)
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !142, line: 45, size: 32, align: 32, elements: !143)
!142 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!143 = !{!144, !145, !146, !147}
!144 = !DIEnumerator(name: "SCRIPT_STATE_IDLE", value: 0)
!145 = !DIEnumerator(name: "SCRIPT_STATE_RUNNING", value: 1)
!146 = !DIEnumerator(name: "SCRIPT_STATE_REQUESTING_TERMINATION", value: 2)
!147 = !DIEnumerator(name: "SCRIPT_STATE_FORCING_TERMINATION", value: 3)
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !142, line: 52, size: 32, align: 32, elements: !149)
!149 = !{!150, !151, !152}
!150 = !DIEnumerator(name: "SCRIPT_INIT_STATE_DONE", value: 0)
!151 = !DIEnumerator(name: "SCRIPT_INIT_STATE_INIT", value: 1)
!152 = !DIEnumerator(name: "SCRIPT_INIT_STATE_FAILED", value: 2)
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !154, line: 175, size: 32, align: 32, elements: !155)
!154 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175}
!156 = !DIEnumerator(name: "MSG_OOB", value: 1)
!157 = !DIEnumerator(name: "MSG_PEEK", value: 2)
!158 = !DIEnumerator(name: "MSG_DONTROUTE", value: 4)
!159 = !DIEnumerator(name: "MSG_TRYHARD", value: 4)
!160 = !DIEnumerator(name: "MSG_CTRUNC", value: 8)
!161 = !DIEnumerator(name: "MSG_PROXY", value: 16)
!162 = !DIEnumerator(name: "MSG_TRUNC", value: 32)
!163 = !DIEnumerator(name: "MSG_DONTWAIT", value: 64)
!164 = !DIEnumerator(name: "MSG_EOR", value: 128)
!165 = !DIEnumerator(name: "MSG_WAITALL", value: 256)
!166 = !DIEnumerator(name: "MSG_FIN", value: 512)
!167 = !DIEnumerator(name: "MSG_SYN", value: 1024)
!168 = !DIEnumerator(name: "MSG_CONFIRM", value: 2048)
!169 = !DIEnumerator(name: "MSG_RST", value: 4096)
!170 = !DIEnumerator(name: "MSG_ERRQUEUE", value: 8192)
!171 = !DIEnumerator(name: "MSG_NOSIGNAL", value: 16384)
!172 = !DIEnumerator(name: "MSG_MORE", value: 32768)
!173 = !DIEnumerator(name: "MSG_WAITFORONE", value: 65536)
!174 = !DIEnumerator(name: "MSG_FASTOPEN", value: 536870912)
!175 = !DIEnumerator(name: "MSG_CMSG_CLOEXEC", value: 1073741824)
!176 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "if_lookup", file: !177, line: 142, size: 32, align: 32, elements: !178)
!177 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!178 = !{!179, !180, !181, !182}
!179 = !DIEnumerator(name: "IF_NO_CREATE", value: 0)
!180 = !DIEnumerator(name: "IF_CREATE_IF_DYNAMIC", value: 1)
!181 = !DIEnumerator(name: "IF_CREATE_ALWAYS", value: 2)
!182 = !DIEnumerator(name: "IF_CREATE_NETLINK", value: 3)
!183 = !{!184, !206, !230, !232, !233, !251, !268, !246, !276, !290, !291, !292, !295, !306, !311, !506, !228, !211, !507, !508}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !186, line: 44, size: 160, align: 32, elements: !187)
!186 = !DIFile(filename: "/usr/include/netinet/ip.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!187 = !{!188, !190, !191, !195, !198, !199, !200, !201, !202, !203, !205}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !185, file: !186, line: 47, baseType: !189, size: 4, align: 32, flags: DIFlagBitField, extraData: i64 0)
!189 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !185, file: !186, line: 48, baseType: !189, size: 4, align: 32, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !185, file: !186, line: 55, baseType: !192, size: 8, align: 8, offset: 8)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int8_t", file: !193, line: 200, baseType: !194)
!193 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!194 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !185, file: !186, line: 56, baseType: !196, size: 16, align: 16, offset: 16)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int16_t", file: !193, line: 201, baseType: !197)
!197 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !185, file: !186, line: 57, baseType: !196, size: 16, align: 16, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !185, file: !186, line: 58, baseType: !196, size: 16, align: 16, offset: 48)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !185, file: !186, line: 59, baseType: !192, size: 8, align: 8, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !185, file: !186, line: 60, baseType: !192, size: 8, align: 8, offset: 72)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !185, file: !186, line: 61, baseType: !196, size: 16, align: 16, offset: 80)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !185, file: !186, line: 62, baseType: !204, size: 32, align: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !193, line: 202, baseType: !189)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !185, file: !186, line: 63, baseType: !204, size: 32, align: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrphdr_t", file: !4, line: 72, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrphdr", file: !4, line: 55, size: 64, align: 16, elements: !209)
!209 = !{!210, !213, !214, !215, !216, !229}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "vers_type", scope: !208, file: !4, line: 56, baseType: !211, size: 8, align: 8)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !212, line: 48, baseType: !194)
!212 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!213 = !DIDerivedType(tag: DW_TAG_member, name: "vrid", scope: !208, file: !4, line: 57, baseType: !211, size: 8, align: 8, offset: 8)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !208, file: !4, line: 58, baseType: !211, size: 8, align: 8, offset: 16)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "naddr", scope: !208, file: !4, line: 59, baseType: !211, size: 8, align: 8, offset: 24)
!216 = !DIDerivedType(tag: DW_TAG_member, scope: !208, file: !4, line: 60, baseType: !217, size: 16, align: 16, offset: 32)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !208, file: !4, line: 60, size: 16, align: 16, elements: !218)
!218 = !{!219, !224}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !217, file: !4, line: 64, baseType: !220, size: 16, align: 8)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !4, line: 61, size: 16, align: 8, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "auth_type", scope: !220, file: !4, line: 62, baseType: !211, size: 8, align: 8)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "adver_int", scope: !220, file: !4, line: 63, baseType: !211, size: 8, align: 8, offset: 8)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !217, file: !4, line: 67, baseType: !225, size: 16, align: 16)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !4, line: 65, size: 16, align: 16, elements: !226)
!226 = !{!227}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "adver_int", scope: !225, file: !4, line: 66, baseType: !228, size: 16, align: 16)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !212, line: 49, baseType: !197)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !208, file: !4, line: 69, baseType: !228, size: 16, align: 16, offset: 48)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !33, line: 239, size: 128, align: 32, elements: !235)
!235 = !{!236, !239, !241, !247}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !234, file: !33, line: 241, baseType: !237, size: 16, align: 16)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !238, line: 28, baseType: !197)
!238 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !234, file: !33, line: 242, baseType: !240, size: 16, align: 16, offset: 16)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !33, line: 119, baseType: !228)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !234, file: !33, line: 243, baseType: !242, size: 32, align: 32, offset: 32)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !33, line: 31, size: 32, align: 32, elements: !243)
!243 = !{!244}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !242, file: !33, line: 33, baseType: !245, size: 32, align: 32)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !33, line: 30, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !212, line: 51, baseType: !189)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !234, file: !33, line: 246, baseType: !248, size: 64, align: 8, offset: 64)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 64, align: 8, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 8)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !33, line: 211, size: 128, align: 32, elements: !254)
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !253, file: !33, line: 220, baseType: !256, size: 128, align: 32)
!256 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !253, file: !33, line: 213, size: 128, align: 32, elements: !257)
!257 = !{!258, !262, !264}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !256, file: !33, line: 215, baseType: !259, size: 128, align: 8)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 128, align: 8, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 16)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !256, file: !33, line: 217, baseType: !263, size: 128, align: 16)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 128, align: 16, elements: !249)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !256, file: !33, line: 218, baseType: !265, size: 128, align: 32)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 128, align: 32, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 4)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !33, line: 254, size: 224, align: 32, elements: !270)
!270 = !{!271, !272, !273, !274, !275}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !269, file: !33, line: 256, baseType: !237, size: 16, align: 16)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !269, file: !33, line: 257, baseType: !240, size: 16, align: 16, offset: 16)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !269, file: !33, line: 258, baseType: !246, size: 32, align: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !269, file: !33, line: 259, baseType: !253, size: 128, align: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !269, file: !33, line: 260, baseType: !246, size: 32, align: 32, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipsec_ah_t", file: !278, line: 47, baseType: !279)
!278 = !DIFile(filename: "./../include/vrrp_ipsecah.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ipsec_ah", file: !278, line: 39, size: 192, align: 32, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next_header", scope: !279, file: !278, line: 40, baseType: !211, size: 8, align: 8)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !279, file: !278, line: 41, baseType: !211, size: 8, align: 8, offset: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !279, file: !278, line: 42, baseType: !228, size: 16, align: 16, offset: 16)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "spi", scope: !279, file: !278, line: 43, baseType: !246, size: 32, align: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "seq_number", scope: !279, file: !278, line: 44, baseType: !246, size: 32, align: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "auth_data", scope: !279, file: !278, line: 45, baseType: !287, size: 96, align: 8, offset: 96)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 96, align: 8, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 12)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !293, line: 216, baseType: !294)
!293 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!294 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmsghdr", file: !154, line: 246, size: 128, align: 64, elements: !297)
!297 = !{!298, !299, !301, !302}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_len", scope: !296, file: !154, line: 248, baseType: !292, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_level", scope: !296, file: !154, line: 253, baseType: !300, size: 32, align: 32, offset: 64)
!300 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_type", scope: !296, file: !154, line: 254, baseType: !300, size: 32, align: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__cmsg_data", scope: !296, file: !154, line: 256, baseType: !303, offset: 128)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, align: 8, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: -1)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_pktinfo", file: !33, line: 537, size: 160, align: 32, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ipi6_addr", scope: !307, file: !33, line: 539, baseType: !253, size: 128, align: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ipi6_ifindex", scope: !307, file: !33, line: 540, baseType: !189, size: 32, align: 32, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip_address_t", file: !313, line: 73, baseType: !314)
!313 = !DIFile(filename: "./../include/vrrp_ipaddress.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ip_address", file: !313, line: 41, size: 704, align: 64, elements: !315)
!315 = !{!316, !328, !337, !475, !476, !477, !478, !479, !484, !485, !503, !504, !505}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ifa", scope: !314, file: !313, line: 42, baseType: !317, size: 64, align: 32)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifaddrmsg", file: !318, line: 7, size: 64, align: 32, elements: !319)
!318 = !DIFile(filename: "/usr/include/linux/if_addr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!319 = !{!320, !323, !324, !325, !326}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_family", scope: !317, file: !318, line: 8, baseType: !321, size: 8, align: 8)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !322, line: 20, baseType: !194)
!322 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_prefixlen", scope: !317, file: !318, line: 9, baseType: !321, size: 8, align: 8, offset: 8)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_flags", scope: !317, file: !318, line: 10, baseType: !321, size: 8, align: 8, offset: 16)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_scope", scope: !317, file: !318, line: 11, baseType: !321, size: 8, align: 8, offset: 24)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_index", scope: !317, file: !318, line: 12, baseType: !327, size: 32, align: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !322, line: 26, baseType: !189)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !314, file: !313, line: 50, baseType: !329, size: 128, align: 32, offset: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !314, file: !313, line: 44, size: 128, align: 32, elements: !330)
!330 = !{!331, !336}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !329, file: !313, line: 48, baseType: !332, size: 64, align: 32)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !329, file: !313, line: 45, size: 64, align: 32, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !332, file: !313, line: 46, baseType: !242, size: 32, align: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "sin_brd", scope: !332, file: !313, line: 47, baseType: !242, size: 32, align: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !329, file: !313, line: 49, baseType: !253, size: 128, align: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !314, file: !313, line: 52, baseType: !338, size: 64, align: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !177, line: 111, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !177, line: 76, size: 1792, align: 64, elements: !341)
!341 = !{!342, !344, !346, !347, !348, !349, !351, !352, !353, !360, !361, !362, !363, !364, !365, !367, !368, !369, !370, !392, !393, !394, !395, !396, !397, !398, !399}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !340, file: !177, line: 77, baseType: !343, size: 128, align: 8)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 128, align: 8, elements: !260)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !340, file: !177, line: 78, baseType: !345, size: 32, align: 32, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !177, line: 62, baseType: !246)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !340, file: !177, line: 79, baseType: !242, size: 32, align: 32, offset: 160)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !340, file: !177, line: 80, baseType: !253, size: 128, align: 32, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !340, file: !177, line: 81, baseType: !189, size: 32, align: 32, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !340, file: !177, line: 82, baseType: !350, size: 8, align: 8, offset: 352)
!350 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !340, file: !177, line: 83, baseType: !246, size: 32, align: 32, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !340, file: !177, line: 84, baseType: !197, size: 16, align: 16, offset: 416)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !340, file: !177, line: 85, baseType: !354, size: 256, align: 8, offset: 432)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 256, align: 8, elements: !358)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !193, line: 33, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !357, line: 30, baseType: !194)
!357 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!358 = !{!359}
!359 = !DISubrange(count: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !340, file: !177, line: 86, baseType: !354, size: 256, align: 8, offset: 688)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !340, file: !177, line: 87, baseType: !292, size: 64, align: 64, offset: 960)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !340, file: !177, line: 88, baseType: !300, size: 32, align: 32, offset: 1024)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !340, file: !177, line: 90, baseType: !350, size: 8, align: 8, offset: 1056)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !340, file: !177, line: 91, baseType: !345, size: 32, align: 32, offset: 1088)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !340, file: !177, line: 92, baseType: !366, size: 64, align: 64, offset: 1152)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !340, file: !177, line: 94, baseType: !345, size: 32, align: 32, offset: 1216)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !340, file: !177, line: 96, baseType: !366, size: 64, align: 64, offset: 1280)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !340, file: !177, line: 97, baseType: !350, size: 8, align: 8, offset: 1344)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !340, file: !177, line: 100, baseType: !371, size: 64, align: 64, offset: 1408)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !177, line: 73, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !177, line: 65, size: 704, align: 64, elements: !374)
!374 = !{!375, !386, !387, !388, !389, !390, !391}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !373, file: !177, line: 66, baseType: !376, size: 128, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !377, line: 31, baseType: !378)
!377 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !379, line: 30, size: 128, align: 64, elements: !380)
!379 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!380 = !{!381, !384}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !378, file: !379, line: 32, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !357, line: 139, baseType: !383)
!383 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !378, file: !379, line: 33, baseType: !385, size: 64, align: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !357, line: 141, baseType: !383)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !373, file: !177, line: 67, baseType: !350, size: 8, align: 8, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !373, file: !177, line: 68, baseType: !376, size: 128, align: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !373, file: !177, line: 69, baseType: !350, size: 8, align: 8, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !373, file: !177, line: 70, baseType: !376, size: 128, align: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !373, file: !177, line: 71, baseType: !376, size: 128, align: 64, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !373, file: !177, line: 72, baseType: !300, size: 32, align: 32, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !340, file: !177, line: 101, baseType: !350, size: 8, align: 8, offset: 1472)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !340, file: !177, line: 102, baseType: !300, size: 32, align: 32, offset: 1504)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !340, file: !177, line: 103, baseType: !246, size: 32, align: 32, offset: 1536)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !340, file: !177, line: 104, baseType: !246, size: 32, align: 32, offset: 1568)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !340, file: !177, line: 105, baseType: !246, size: 32, align: 32, offset: 1600)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !340, file: !177, line: 107, baseType: !189, size: 32, align: 32, offset: 1632)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !340, file: !177, line: 109, baseType: !350, size: 8, align: 8, offset: 1664)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !340, file: !177, line: 110, baseType: !400, size: 64, align: 64, offset: 1728)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !401, line: 31, baseType: !402)
!401 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !401, line: 39, size: 320, align: 64, elements: !404)
!404 = !{!405, !412, !413, !414, !418}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !403, file: !401, line: 40, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !401, line: 33, size: 192, align: 64, elements: !408)
!408 = !{!409, !410, !411}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !407, file: !401, line: 34, baseType: !406, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !407, file: !401, line: 35, baseType: !406, size: 64, align: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !407, file: !401, line: 36, baseType: !232, size: 64, align: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !403, file: !401, line: 41, baseType: !406, size: 64, align: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !403, file: !401, line: 42, baseType: !189, size: 32, align: 32, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !403, file: !401, line: 43, baseType: !415, size: 64, align: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !232}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !403, file: !401, line: 44, baseType: !419, size: 64, align: 64, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !422, !232}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !424, line: 48, baseType: !425)
!424 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !426, line: 241, size: 1728, align: 64, elements: !427)
!426 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !448, !449, !450, !451, !453, !454, !456, !460, !463, !465, !466, !467, !468, !469, !470, !471}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !425, file: !426, line: 242, baseType: !300, size: 32, align: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !425, file: !426, line: 247, baseType: !230, size: 64, align: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !425, file: !426, line: 248, baseType: !230, size: 64, align: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !425, file: !426, line: 249, baseType: !230, size: 64, align: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !425, file: !426, line: 250, baseType: !230, size: 64, align: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !425, file: !426, line: 251, baseType: !230, size: 64, align: 64, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !425, file: !426, line: 252, baseType: !230, size: 64, align: 64, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !425, file: !426, line: 253, baseType: !230, size: 64, align: 64, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !425, file: !426, line: 254, baseType: !230, size: 64, align: 64, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !425, file: !426, line: 256, baseType: !230, size: 64, align: 64, offset: 576)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !425, file: !426, line: 257, baseType: !230, size: 64, align: 64, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !425, file: !426, line: 258, baseType: !230, size: 64, align: 64, offset: 704)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !425, file: !426, line: 260, baseType: !441, size: 64, align: 64, offset: 768)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !426, line: 156, size: 192, align: 64, elements: !443)
!443 = !{!444, !445, !447}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !442, file: !426, line: 157, baseType: !441, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !442, file: !426, line: 158, baseType: !446, size: 64, align: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !442, file: !426, line: 162, baseType: !300, size: 32, align: 32, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !425, file: !426, line: 262, baseType: !446, size: 64, align: 64, offset: 832)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !425, file: !426, line: 264, baseType: !300, size: 32, align: 32, offset: 896)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !425, file: !426, line: 268, baseType: !300, size: 32, align: 32, offset: 928)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !425, file: !426, line: 270, baseType: !452, size: 64, align: 64, offset: 960)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !357, line: 131, baseType: !383)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !425, file: !426, line: 274, baseType: !197, size: 16, align: 16, offset: 1024)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !425, file: !426, line: 275, baseType: !455, size: 8, align: 8, offset: 1040)
!455 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !425, file: !426, line: 276, baseType: !457, size: 8, align: 8, offset: 1048)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 8, align: 8, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 1)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !425, file: !426, line: 280, baseType: !461, size: 64, align: 64, offset: 1088)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !426, line: 150, baseType: null)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !425, file: !426, line: 289, baseType: !464, size: 64, align: 64, offset: 1152)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !357, line: 132, baseType: !383)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !425, file: !426, line: 297, baseType: !232, size: 64, align: 64, offset: 1216)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !425, file: !426, line: 298, baseType: !232, size: 64, align: 64, offset: 1280)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !425, file: !426, line: 299, baseType: !232, size: 64, align: 64, offset: 1344)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !425, file: !426, line: 300, baseType: !232, size: 64, align: 64, offset: 1408)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !425, file: !426, line: 302, baseType: !292, size: 64, align: 64, offset: 1472)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !425, file: !426, line: 303, baseType: !300, size: 32, align: 32, offset: 1536)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !425, file: !426, line: 305, baseType: !472, size: 160, align: 8, offset: 1568)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 160, align: 8, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 20)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !314, file: !313, line: 53, baseType: !230, size: 64, align: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !314, file: !313, line: 55, baseType: !246, size: 32, align: 32, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "flagmask", scope: !314, file: !313, line: 56, baseType: !246, size: 32, align: 32, offset: 352)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "have_peer", scope: !314, file: !313, line: 61, baseType: !350, size: 8, align: 8, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !314, file: !313, line: 65, baseType: !480, size: 128, align: 32, offset: 416)
!480 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !314, file: !313, line: 62, size: 128, align: 32, elements: !481)
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !480, file: !313, line: 63, baseType: !242, size: 32, align: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !480, file: !313, line: 64, baseType: !253, size: 128, align: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track", scope: !314, file: !313, line: 66, baseType: !350, size: 8, align: 8, offset: 544)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "track_group", scope: !314, file: !313, line: 67, baseType: !486, size: 64, align: 64, offset: 576)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "static_track_group_t", file: !488, line: 39, baseType: !489)
!488 = !DIFile(filename: "./../include/vrrp_static_track.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_track_group", file: !488, line: 35, size: 192, align: 64, elements: !490)
!490 = !{!491, !492, !502}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !489, file: !488, line: 36, baseType: !230, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !489, file: !488, line: 37, baseType: !493, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !495, line: 34, baseType: !496)
!495 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !495, line: 30, size: 128, align: 64, elements: !497)
!497 = !{!498, !499, !500}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !496, file: !495, line: 31, baseType: !189, size: 32, align: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !496, file: !495, line: 32, baseType: !189, size: 32, align: 32, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !496, file: !495, line: 33, baseType: !501, size: 64, align: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !489, file: !488, line: 38, baseType: !400, size: 64, align: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !314, file: !313, line: 69, baseType: !350, size: 8, align: 8, offset: 640)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rule_set", scope: !314, file: !313, line: 70, baseType: !350, size: 8, align: 8, offset: 648)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "garp_gna_pending", scope: !314, file: !313, line: 72, baseType: !350, size: 8, align: 8, offset: 656)
!506 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!509 = !{!510, !511, !513, !514, !515, !516, !517, !518, !519}
!510 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !177, line: 150, type: !400, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!511 = distinct !DIGlobalVariable(name: "block_ipv4", scope: !0, file: !512, line: 85, type: !350, isLocal: false, isDefinition: true, variable: i8* @block_ipv4)
!512 = !DIFile(filename: "vrrp.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!513 = distinct !DIGlobalVariable(name: "block_ipv6", scope: !0, file: !512, line: 86, type: !350, isLocal: false, isDefinition: true, variable: i8* @block_ipv6)
!514 = distinct !DIGlobalVariable(name: "have_ipv4_instance", scope: !0, file: !512, line: 92, type: !350, isLocal: false, isDefinition: true, variable: i8* @have_ipv4_instance)
!515 = distinct !DIGlobalVariable(name: "have_ipv6_instance", scope: !0, file: !512, line: 93, type: !350, isLocal: false, isDefinition: true, variable: i8* @have_ipv6_instance)
!516 = distinct !DIGlobalVariable(name: "monitor_ipv4_routes", scope: !0, file: !512, line: 95, type: !350, isLocal: true, isDefinition: true, variable: i8* @monitor_ipv4_routes)
!517 = distinct !DIGlobalVariable(name: "monitor_ipv6_routes", scope: !0, file: !512, line: 96, type: !350, isLocal: true, isDefinition: true, variable: i8* @monitor_ipv6_routes)
!518 = distinct !DIGlobalVariable(name: "monitor_ipv4_rules", scope: !0, file: !512, line: 97, type: !350, isLocal: true, isDefinition: true, variable: i8* @monitor_ipv4_rules)
!519 = distinct !DIGlobalVariable(name: "monitor_ipv6_rules", scope: !0, file: !512, line: 98, type: !350, isLocal: true, isDefinition: true, variable: i8* @monitor_ipv6_rules)
!520 = !{i32 2, !"Dwarf Version", i32 4}
!521 = !{i32 2, !"Debug Info Version", i32 3}
!522 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!523 = distinct !DISubprogram(name: "clear_summary_flags", scope: !512, file: !512, line: 110, type: !524, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !526)
!524 = !DISubroutineType(types: !525)
!525 = !{null}
!526 = !{}
!527 = !DILocation(line: 112, column: 21, scope: !523)
!528 = !DILocation(line: 113, column: 21, scope: !523)
!529 = !DILocation(line: 115, column: 22, scope: !523)
!530 = !DILocation(line: 116, column: 22, scope: !523)
!531 = !DILocation(line: 117, column: 21, scope: !523)
!532 = !DILocation(line: 118, column: 21, scope: !523)
!533 = !DILocation(line: 120, column: 1, scope: !523)
!534 = distinct !DISubprogram(name: "vrrp_adv_len", scope: !512, file: !512, line: 349, type: !535, isLocal: false, isDefinition: true, scopeLine: 350, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !526)
!535 = !DISubroutineType(types: !536)
!536 = !{!292, !537}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_t", file: !4, line: 310, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_t", file: !4, line: 183, size: 7040, align: 64, elements: !540)
!540 = !{!541, !542, !543, !582, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !623, !624, !625, !626, !627, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !785, !791}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !539, file: !4, line: 184, baseType: !237, size: 16, align: 16)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !539, file: !4, line: 185, baseType: !230, size: 64, align: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !539, file: !4, line: 186, baseType: !544, size: 64, align: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_sgroup_t", file: !4, line: 133, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_sgroup", file: !4, line: 109, size: 1024, align: 64, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !576, !577, !578, !579, !580, !581}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !546, file: !4, line: 110, baseType: !230, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !546, file: !4, line: 111, baseType: !493, size: 64, align: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !546, file: !4, line: 112, baseType: !400, size: 64, align: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_fault", scope: !546, file: !4, line: 113, baseType: !189, size: 32, align: 32, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_init", scope: !546, file: !4, line: 114, baseType: !189, size: 32, align: 32, offset: 224)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !546, file: !4, line: 115, baseType: !300, size: 32, align: 32, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sgroup_tracking_weight", scope: !546, file: !4, line: 116, baseType: !350, size: 8, align: 8, offset: 288)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !546, file: !4, line: 119, baseType: !400, size: 64, align: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !546, file: !4, line: 120, baseType: !400, size: 64, align: 64, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !546, file: !4, line: 121, baseType: !400, size: 64, align: 64, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "track_bfd", scope: !546, file: !4, line: 122, baseType: !400, size: 64, align: 64, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !546, file: !4, line: 125, baseType: !350, size: 8, align: 8, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !546, file: !4, line: 126, baseType: !561, size: 64, align: 64, offset: 640)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !142, line: 65, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !142, line: 59, size: 192, align: 64, elements: !564)
!564 = !{!565, !567, !568, !569, !573}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !563, file: !142, line: 60, baseType: !566, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !563, file: !142, line: 61, baseType: !300, size: 32, align: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !563, file: !142, line: 62, baseType: !300, size: 32, align: 32, offset: 96)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !563, file: !142, line: 63, baseType: !570, size: 32, align: 32, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !571, line: 240, baseType: !572)
!571 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !357, line: 125, baseType: !189)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !563, file: !142, line: 64, baseType: !574, size: 32, align: 32, offset: 160)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !571, line: 235, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !357, line: 126, baseType: !189)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !546, file: !4, line: 127, baseType: !561, size: 64, align: 64, offset: 704)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !546, file: !4, line: 128, baseType: !561, size: 64, align: 64, offset: 768)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !546, file: !4, line: 129, baseType: !561, size: 64, align: 64, offset: 832)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !546, file: !4, line: 130, baseType: !561, size: 64, align: 64, offset: 896)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !546, file: !4, line: 131, baseType: !300, size: 32, align: 32, offset: 960)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !546, file: !4, line: 132, baseType: !300, size: 32, align: 32, offset: 992)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !539, file: !4, line: 187, baseType: !583, size: 64, align: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, align: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_stats", file: !4, line: 169, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_stats", file: !4, line: 136, size: 768, align: 64, elements: !586)
!586 = !{!587, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "advert_rcvd", scope: !585, file: !4, line: 137, baseType: !588, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !212, line: 55, baseType: !294)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "advert_sent", scope: !585, file: !4, line: 138, baseType: !246, size: 32, align: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "become_master", scope: !585, file: !4, line: 140, baseType: !246, size: 32, align: 32, offset: 96)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "release_master", scope: !585, file: !4, line: 141, baseType: !246, size: 32, align: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "packet_len_err", scope: !585, file: !4, line: 143, baseType: !588, size: 64, align: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "advert_interval_err", scope: !585, file: !4, line: 144, baseType: !588, size: 64, align: 64, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl_err", scope: !585, file: !4, line: 145, baseType: !588, size: 64, align: 64, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_type_rcvd", scope: !585, file: !4, line: 146, baseType: !588, size: 64, align: 64, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list_err", scope: !585, file: !4, line: 147, baseType: !588, size: 64, align: 64, offset: 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_authtype", scope: !585, file: !4, line: 149, baseType: !246, size: 32, align: 32, offset: 512)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "authtype_mismatch", scope: !585, file: !4, line: 151, baseType: !246, size: 32, align: 32, offset: 544)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "auth_failure", scope: !585, file: !4, line: 152, baseType: !246, size: 32, align: 32, offset: 576)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_rcvd", scope: !585, file: !4, line: 155, baseType: !588, size: 64, align: 64, offset: 640)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_sent", scope: !585, file: !4, line: 156, baseType: !588, size: 64, align: 64, offset: 704)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !539, file: !4, line: 188, baseType: !338, size: 64, align: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track_primary", scope: !539, file: !4, line: 189, baseType: !350, size: 8, align: 8, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !539, file: !4, line: 190, baseType: !350, size: 8, align: 8, offset: 328)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "skip_check_adv_addr", scope: !539, file: !4, line: 191, baseType: !350, size: 8, align: 8, offset: 336)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "strict_mode", scope: !539, file: !4, line: 193, baseType: !189, size: 32, align: 32, offset: 352)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_flags", scope: !539, file: !4, line: 195, baseType: !294, size: 64, align: 64, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_ifname", scope: !539, file: !4, line: 196, baseType: !343, size: 128, align: 8, offset: 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !539, file: !4, line: 198, baseType: !400, size: 64, align: 64, offset: 576)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !539, file: !4, line: 199, baseType: !400, size: 64, align: 64, offset: 640)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !539, file: !4, line: 200, baseType: !400, size: 64, align: 64, offset: 704)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_if_fault", scope: !539, file: !4, line: 204, baseType: !189, size: 32, align: 32, offset: 768)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_init", scope: !539, file: !4, line: 205, baseType: !189, size: 32, align: 32, offset: 800)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !539, file: !4, line: 206, baseType: !615, size: 1024, align: 64, offset: 832)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !154, line: 166, size: 1024, align: 64, elements: !616)
!616 = !{!617, !618, !622}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !615, file: !154, line: 168, baseType: !237, size: 16, align: 16)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !615, file: !154, line: 169, baseType: !619, size: 944, align: 8, offset: 16)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 944, align: 8, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 118)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !615, file: !154, line: 170, baseType: !294, size: 64, align: 64, offset: 960)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "saddr_from_config", scope: !539, file: !4, line: 207, baseType: !350, size: 8, align: 8, offset: 1856)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "track_saddr", scope: !539, file: !4, line: 208, baseType: !350, size: 8, align: 8, offset: 1864)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_saddr", scope: !539, file: !4, line: 209, baseType: !615, size: 1024, align: 64, offset: 1920)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_peer", scope: !539, file: !4, line: 210, baseType: !400, size: 64, align: 64, offset: 2944)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_chksum_compat", scope: !539, file: !4, line: 212, baseType: !628, size: 32, align: 32, offset: 3008)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "chksum_compatibility_t", file: !4, line: 179, baseType: !3)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "master_saddr", scope: !539, file: !4, line: 214, baseType: !615, size: 1024, align: 64, offset: 3072)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "master_priority", scope: !539, file: !4, line: 215, baseType: !211, size: 8, align: 8, offset: 4096)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "last_transition", scope: !539, file: !4, line: 216, baseType: !376, size: 128, align: 64, offset: 4160)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !539, file: !4, line: 217, baseType: !189, size: 32, align: 32, offset: 4288)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh", scope: !539, file: !4, line: 218, baseType: !376, size: 128, align: 64, offset: 4352)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_timer", scope: !539, file: !4, line: 219, baseType: !376, size: 128, align: 64, offset: 4480)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "garp_rep", scope: !539, file: !4, line: 220, baseType: !189, size: 32, align: 32, offset: 4608)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_rep", scope: !539, file: !4, line: 221, baseType: !189, size: 32, align: 32, offset: 4640)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_delay", scope: !539, file: !4, line: 222, baseType: !189, size: 32, align: 32, offset: 4672)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "garp_pending", scope: !539, file: !4, line: 223, baseType: !350, size: 8, align: 8, offset: 4704)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "gna_pending", scope: !539, file: !4, line: 224, baseType: !350, size: 8, align: 8, offset: 4712)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_rep", scope: !539, file: !4, line: 225, baseType: !189, size: 32, align: 32, offset: 4736)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "lower_prio_no_advert", scope: !539, file: !4, line: 226, baseType: !189, size: 32, align: 32, offset: 4768)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "higher_prio_send_advert", scope: !539, file: !4, line: 227, baseType: !189, size: 32, align: 32, offset: 4800)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "vrid", scope: !539, file: !4, line: 228, baseType: !211, size: 8, align: 8, offset: 4832)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "base_priority", scope: !539, file: !4, line: 229, baseType: !211, size: 8, align: 8, offset: 4840)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "effective_priority", scope: !539, file: !4, line: 230, baseType: !211, size: 8, align: 8, offset: 4848)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "total_priority", scope: !539, file: !4, line: 231, baseType: !300, size: 32, align: 32, offset: 4864)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "vipset", scope: !539, file: !4, line: 233, baseType: !350, size: 8, align: 8, offset: 4896)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !539, file: !4, line: 234, baseType: !400, size: 64, align: 64, offset: 4928)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "evip", scope: !539, file: !4, line: 235, baseType: !400, size: 64, align: 64, offset: 4992)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries", scope: !539, file: !4, line: 239, baseType: !350, size: 8, align: 8, offset: 5056)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "evip_add_ipv6", scope: !539, file: !4, line: 240, baseType: !350, size: 8, align: 8, offset: 5064)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "vroutes", scope: !539, file: !4, line: 241, baseType: !400, size: 64, align: 64, offset: 5120)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "vrules", scope: !539, file: !4, line: 242, baseType: !400, size: 64, align: 64, offset: 5184)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "adver_int", scope: !539, file: !4, line: 243, baseType: !189, size: 32, align: 32, offset: 5248)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "master_adver_int", scope: !539, file: !4, line: 244, baseType: !189, size: 32, align: 32, offset: 5280)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !539, file: !4, line: 249, baseType: !189, size: 32, align: 32, offset: 5312)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_rx_buf_size", scope: !539, file: !4, line: 252, baseType: !292, size: 64, align: 64, offset: 5376)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rules_set", scope: !539, file: !4, line: 254, baseType: !350, size: 8, align: 8, offset: 5440)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "nopreempt", scope: !539, file: !4, line: 255, baseType: !350, size: 8, align: 8, offset: 5448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_delay", scope: !539, file: !4, line: 256, baseType: !294, size: 64, align: 64, offset: 5504)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_time", scope: !539, file: !4, line: 260, baseType: !376, size: 128, align: 64, offset: 5568)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !539, file: !4, line: 261, baseType: !300, size: 32, align: 32, offset: 5696)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "wantstate", scope: !539, file: !4, line: 265, baseType: !300, size: 32, align: 32, offset: 5728)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "reload_master", scope: !539, file: !4, line: 266, baseType: !350, size: 8, align: 8, offset: 5760)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sockets", scope: !539, file: !4, line: 267, baseType: !666, size: 64, align: 64, offset: 5824)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_t", file: !668, line: 50, baseType: !669)
!668 = !DIFile(filename: "./../include/vrrp_sock.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sock", file: !668, line: 40, size: 1344, align: 64, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678, !679}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !669, file: !668, line: 41, baseType: !237, size: 16, align: 16)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !669, file: !668, line: 42, baseType: !615, size: 1024, align: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !669, file: !668, line: 43, baseType: !300, size: 32, align: 32, offset: 1088)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !669, file: !668, line: 44, baseType: !345, size: 32, align: 32, offset: 1120)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "unicast", scope: !669, file: !668, line: 45, baseType: !350, size: 8, align: 8, offset: 1152)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "fd_in", scope: !669, file: !668, line: 46, baseType: !300, size: 32, align: 32, offset: 1184)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "fd_out", scope: !669, file: !668, line: 47, baseType: !300, size: 32, align: 32, offset: 1216)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_size", scope: !669, file: !668, line: 48, baseType: !300, size: 32, align: 32, offset: 1248)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !669, file: !668, line: 49, baseType: !680, size: 64, align: 64, offset: 1280)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !12, line: 99, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !12, line: 78, size: 768, align: 64, elements: !683)
!683 = !{!684, !685, !687, !740, !745, !746, !747, !759, !761}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !682, file: !12, line: 79, baseType: !294, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !682, file: !12, line: 80, baseType: !686, size: 32, align: 32, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !12, line: 63, baseType: !11)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !682, file: !12, line: 81, baseType: !688, size: 64, align: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64, align: 64)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !12, line: 112, size: 1280, align: 64, elements: !690)
!690 = !{!691, !703, !704, !705, !706, !714, !715, !716, !717, !718, !721, !732, !733, !734, !735, !736, !737, !738, !739}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !689, file: !12, line: 113, baseType: !692, size: 64, align: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !693, line: 109, baseType: !694)
!693 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !693, line: 106, size: 64, align: 64, elements: !695)
!695 = !{!696}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !694, file: !693, line: 108, baseType: !697, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, align: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !693, line: 97, size: 192, align: 64, elements: !699)
!699 = !{!700, !701, !702}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !698, file: !693, line: 99, baseType: !294, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !698, file: !693, line: 102, baseType: !697, size: 64, align: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !698, file: !693, line: 103, baseType: !697, size: 64, align: 64, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !689, file: !12, line: 114, baseType: !692, size: 64, align: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !689, file: !12, line: 115, baseType: !692, size: 64, align: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !689, file: !12, line: 116, baseType: !692, size: 64, align: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !689, file: !12, line: 117, baseType: !707, size: 128, align: 64, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !708, line: 62, baseType: !709)
!708 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !708, line: 60, size: 128, align: 64, elements: !710)
!710 = !{!711, !713}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !709, file: !708, line: 61, baseType: !712, size: 64, align: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !709, file: !708, line: 61, baseType: !712, size: 64, align: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !689, file: !12, line: 121, baseType: !707, size: 128, align: 64, offset: 384)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !689, file: !12, line: 122, baseType: !707, size: 128, align: 64, offset: 512)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !689, file: !12, line: 124, baseType: !400, size: 64, align: 64, offset: 640)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !689, file: !12, line: 127, baseType: !692, size: 64, align: 64, offset: 704)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !689, file: !12, line: 128, baseType: !719, size: 64, align: 64, offset: 768)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64, align: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !12, line: 128, flags: DIFlagFwdDecl)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !689, file: !12, line: 129, baseType: !722, size: 64, align: 64, offset: 832)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !12, line: 109, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !12, line: 102, size: 448, align: 64, elements: !725)
!725 = !{!726, !727, !728, !729, !730}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !724, file: !12, line: 103, baseType: !680, size: 64, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !724, file: !12, line: 104, baseType: !680, size: 64, align: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !724, file: !12, line: 105, baseType: !294, size: 64, align: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !724, file: !12, line: 106, baseType: !300, size: 32, align: 32, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !724, file: !12, line: 108, baseType: !731, size: 192, align: 64, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !693, line: 104, baseType: !698)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !689, file: !12, line: 130, baseType: !189, size: 32, align: 32, offset: 896)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !689, file: !12, line: 131, baseType: !189, size: 32, align: 32, offset: 928)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !689, file: !12, line: 132, baseType: !300, size: 32, align: 32, offset: 960)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !689, file: !12, line: 135, baseType: !300, size: 32, align: 32, offset: 992)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !689, file: !12, line: 136, baseType: !680, size: 64, align: 64, offset: 1024)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !689, file: !12, line: 146, baseType: !294, size: 64, align: 64, offset: 1088)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !689, file: !12, line: 147, baseType: !294, size: 64, align: 64, offset: 1152)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !689, file: !12, line: 148, baseType: !350, size: 8, align: 8, offset: 1216)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !682, file: !12, line: 82, baseType: !741, size: 64, align: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64, align: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!300, !744}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !682, file: !12, line: 83, baseType: !232, size: 64, align: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !682, file: !12, line: 84, baseType: !376, size: 128, align: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !682, file: !12, line: 92, baseType: !748, size: 64, align: 32, offset: 448)
!748 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !682, file: !12, line: 85, size: 64, align: 32, elements: !749)
!749 = !{!750, !751, !752}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !748, file: !12, line: 86, baseType: !300, size: 32, align: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !748, file: !12, line: 87, baseType: !300, size: 32, align: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !748, file: !12, line: 91, baseType: !753, size: 64, align: 32)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !748, file: !12, line: 88, size: 64, align: 32, elements: !754)
!754 = !{!755, !758}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !753, file: !12, line: 89, baseType: !756, size: 32, align: 32)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !571, line: 263, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !357, line: 133, baseType: !300)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !753, file: !12, line: 90, baseType: !300, size: 32, align: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !682, file: !12, line: 93, baseType: !760, size: 64, align: 64, offset: 512)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, scope: !682, file: !12, line: 95, baseType: !762, size: 192, align: 64, offset: 576)
!762 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !682, file: !12, line: 95, size: 192, align: 64, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !762, file: !12, line: 96, baseType: !731, size: 192, align: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !762, file: !12, line: 97, baseType: !707, size: 128, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !539, file: !4, line: 269, baseType: !300, size: 32, align: 32, offset: 5888)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !539, file: !4, line: 271, baseType: !300, size: 32, align: 32, offset: 5920)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !539, file: !4, line: 274, baseType: !300, size: 32, align: 32, offset: 5952)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !539, file: !4, line: 275, baseType: !300, size: 32, align: 32, offset: 5984)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !539, file: !4, line: 276, baseType: !350, size: 8, align: 8, offset: 6016)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !539, file: !4, line: 277, baseType: !561, size: 64, align: 64, offset: 6080)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !539, file: !4, line: 278, baseType: !561, size: 64, align: 64, offset: 6144)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !539, file: !4, line: 279, baseType: !561, size: 64, align: 64, offset: 6208)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !539, file: !4, line: 280, baseType: !561, size: 64, align: 64, offset: 6272)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "script_master_rx_lower_pri", scope: !539, file: !4, line: 281, baseType: !561, size: 64, align: 64, offset: 6336)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !539, file: !4, line: 282, baseType: !561, size: 64, align: 64, offset: 6400)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ms_down_timer", scope: !539, file: !4, line: 285, baseType: !246, size: 32, align: 32, offset: 6464)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !539, file: !4, line: 286, baseType: !376, size: 128, align: 64, offset: 6528)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !539, file: !4, line: 289, baseType: !230, size: 64, align: 64, offset: 6656)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer_size", scope: !539, file: !4, line: 290, baseType: !292, size: 64, align: 64, offset: 6720)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_csum", scope: !539, file: !4, line: 291, baseType: !246, size: 32, align: 32, offset: 6784)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "auth_type", scope: !539, file: !4, line: 295, baseType: !211, size: 8, align: 8, offset: 6816)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "auth_data", scope: !539, file: !4, line: 296, baseType: !784, size: 64, align: 8, offset: 6824)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 64, align: 8, elements: !249)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ipsecah_counter", scope: !539, file: !4, line: 299, baseType: !786, size: 64, align: 32, offset: 6912)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_counter_t", file: !278, line: 58, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seq_counter", file: !278, line: 55, size: 64, align: 32, elements: !788)
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !787, file: !278, line: 56, baseType: !350, size: 8, align: 8)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "seq_number", scope: !787, file: !278, line: 57, baseType: !246, size: 32, align: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !539, file: !4, line: 309, baseType: !300, size: 32, align: 32, offset: 6976)
!792 = !DILocalVariable(name: "vrrp", arg: 1, scope: !534, file: !512, line: 349, type: !537)
!793 = !DIExpression()
!794 = !DILocation(line: 349, column: 22, scope: !534)
!795 = !DILocalVariable(name: "len", scope: !534, file: !512, line: 351, type: !292)
!796 = !DILocation(line: 351, column: 9, scope: !534)
!797 = !DILocation(line: 351, column: 28, scope: !534)
!798 = !DILocation(line: 351, column: 15, scope: !534)
!799 = !DILocation(line: 353, column: 6, scope: !800)
!800 = distinct !DILexicalBlock(scope: !534, file: !512, line: 353, column: 6)
!801 = !DILocation(line: 353, column: 12, scope: !800)
!802 = !DILocation(line: 353, column: 19, scope: !800)
!803 = !DILocation(line: 353, column: 6, scope: !534)
!804 = !DILocation(line: 354, column: 10, scope: !805)
!805 = distinct !DILexicalBlock(scope: !800, file: !512, line: 353, column: 30)
!806 = !DILocation(line: 354, column: 7, scope: !805)
!807 = !DILocation(line: 356, column: 7, scope: !808)
!808 = distinct !DILexicalBlock(scope: !805, file: !512, line: 356, column: 7)
!809 = !DILocation(line: 356, column: 13, scope: !808)
!810 = !DILocation(line: 356, column: 23, scope: !808)
!811 = !DILocation(line: 356, column: 7, scope: !805)
!812 = !DILocation(line: 357, column: 11, scope: !808)
!813 = !DILocation(line: 357, column: 8, scope: !808)
!814 = !DILocation(line: 357, column: 4, scope: !808)
!815 = !DILocation(line: 359, column: 2, scope: !805)
!816 = !DILocation(line: 361, column: 9, scope: !534)
!817 = !DILocation(line: 361, column: 2, scope: !534)
!818 = distinct !DISubprogram(name: "vrrp_pkt_len", scope: !512, file: !512, line: 332, type: !535, isLocal: true, isDefinition: true, scopeLine: 333, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !526)
!819 = !DILocalVariable(name: "vrrp", arg: 1, scope: !818, file: !512, line: 332, type: !537)
!820 = !DILocation(line: 332, column: 23, scope: !818)
!821 = !DILocalVariable(name: "len", scope: !818, file: !512, line: 334, type: !292)
!822 = !DILocation(line: 334, column: 9, scope: !818)
!823 = !DILocation(line: 337, column: 6, scope: !824)
!824 = distinct !DILexicalBlock(scope: !818, file: !512, line: 337, column: 6)
!825 = !DILocation(line: 337, column: 12, scope: !824)
!826 = !DILocation(line: 337, column: 19, scope: !824)
!827 = !DILocation(line: 337, column: 6, scope: !818)
!828 = !DILocation(line: 338, column: 7, scope: !829)
!829 = distinct !DILexicalBlock(scope: !830, file: !512, line: 338, column: 7)
!830 = distinct !DILexicalBlock(scope: !824, file: !512, line: 337, column: 30)
!831 = !DILocation(line: 338, column: 13, scope: !829)
!832 = !DILocation(line: 338, column: 21, scope: !829)
!833 = !DILocation(line: 338, column: 7, scope: !830)
!834 = !DILocation(line: 339, column: 8, scope: !829)
!835 = !DILocation(line: 339, column: 4, scope: !829)
!836 = !DILocation(line: 340, column: 15, scope: !830)
!837 = !DILocation(line: 340, column: 21, scope: !830)
!838 = !DILocation(line: 340, column: 26, scope: !830)
!839 = !DILocation(line: 340, column: 12, scope: !830)
!840 = !DILocation(line: 340, column: 17, scope: !841)
!841 = !DILexicalBlockFile(scope: !830, file: !512, discriminator: 1)
!842 = !DILocation(line: 340, column: 23, scope: !841)
!843 = !DILocation(line: 340, column: 29, scope: !841)
!844 = !DILocation(line: 340, column: 34, scope: !841)
!845 = !DILocation(line: 340, column: 12, scope: !841)
!846 = !DILocation(line: 340, column: 16, scope: !847)
!847 = !DILexicalBlockFile(scope: !830, file: !512, discriminator: 2)
!848 = !DILocation(line: 340, column: 22, scope: !847)
!849 = !DILocation(line: 340, column: 28, scope: !847)
!850 = !DILocation(line: 340, column: 33, scope: !847)
!851 = !DILocation(line: 340, column: 11, scope: !847)
!852 = !DILocation(line: 340, column: 20, scope: !853)
!853 = !DILexicalBlockFile(scope: !830, file: !512, discriminator: 3)
!854 = !DILocation(line: 340, column: 26, scope: !853)
!855 = !DILocation(line: 340, column: 32, scope: !853)
!856 = !DILocation(line: 340, column: 18, scope: !853)
!857 = !DILocation(line: 340, column: 39, scope: !853)
!858 = !DILocation(line: 340, column: 11, scope: !853)
!859 = !DILocation(line: 340, column: 11, scope: !860)
!860 = !DILexicalBlockFile(scope: !830, file: !512, discriminator: 4)
!861 = !DILocation(line: 340, column: 11, scope: !862)
!862 = !DILexicalBlockFile(scope: !830, file: !512, discriminator: 5)
!863 = !DILocation(line: 340, column: 7, scope: !862)
!864 = !DILocation(line: 341, column: 2, scope: !830)
!865 = !DILocation(line: 342, column: 11, scope: !866)
!866 = distinct !DILexicalBlock(scope: !824, file: !512, line: 342, column: 11)
!867 = !DILocation(line: 342, column: 17, scope: !866)
!868 = !DILocation(line: 342, column: 24, scope: !866)
!869 = !DILocation(line: 342, column: 11, scope: !824)
!870 = !DILocation(line: 343, column: 15, scope: !866)
!871 = !DILocation(line: 343, column: 21, scope: !866)
!872 = !DILocation(line: 343, column: 26, scope: !866)
!873 = !DILocation(line: 343, column: 12, scope: !866)
!874 = !DILocation(line: 343, column: 17, scope: !875)
!875 = !DILexicalBlockFile(scope: !866, file: !512, discriminator: 1)
!876 = !DILocation(line: 343, column: 23, scope: !875)
!877 = !DILocation(line: 343, column: 29, scope: !875)
!878 = !DILocation(line: 343, column: 34, scope: !875)
!879 = !DILocation(line: 343, column: 12, scope: !875)
!880 = !DILocation(line: 343, column: 16, scope: !881)
!881 = !DILexicalBlockFile(scope: !866, file: !512, discriminator: 2)
!882 = !DILocation(line: 343, column: 22, scope: !881)
!883 = !DILocation(line: 343, column: 28, scope: !881)
!884 = !DILocation(line: 343, column: 33, scope: !881)
!885 = !DILocation(line: 343, column: 11, scope: !881)
!886 = !DILocation(line: 343, column: 20, scope: !887)
!887 = !DILexicalBlockFile(scope: !866, file: !512, discriminator: 3)
!888 = !DILocation(line: 343, column: 26, scope: !887)
!889 = !DILocation(line: 343, column: 32, scope: !887)
!890 = !DILocation(line: 343, column: 18, scope: !887)
!891 = !DILocation(line: 343, column: 39, scope: !887)
!892 = !DILocation(line: 343, column: 11, scope: !887)
!893 = !DILocation(line: 343, column: 11, scope: !894)
!894 = !DILexicalBlockFile(scope: !866, file: !512, discriminator: 4)
!895 = !DILocation(line: 343, column: 11, scope: !896)
!896 = !DILexicalBlockFile(scope: !866, file: !512, discriminator: 5)
!897 = !DILocation(line: 343, column: 7, scope: !896)
!898 = !DILocation(line: 343, column: 3, scope: !896)
!899 = !DILocation(line: 345, column: 9, scope: !818)
!900 = !DILocation(line: 345, column: 2, scope: !818)
!901 = distinct !DISubprogram(name: "vrrp_iphdr_len", scope: !512, file: !512, line: 316, type: !902, isLocal: true, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !526)
!902 = !DISubroutineType(types: !903)
!903 = !{!292}
!904 = !DILocation(line: 318, column: 2, scope: !901)
!905 = distinct !DISubprogram(name: "vrrp_ipsecah_len", scope: !512, file: !512, line: 324, type: !902, isLocal: true, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !526)
!906 = !DILocation(line: 326, column: 2, scope: !905)
!907 = distinct !DISubprogram(name: "vrrp_get_header", scope: !512, file: !512, line: 366, type: !908, isLocal: false, isDefinition: true, scopeLine: 367, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !526)
!908 = !DISubroutineType(types: !909)
!909 = !{!206, !237, !230, !910}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!911 = !DILocalVariable(name: "family", arg: 1, scope: !907, file: !512, line: 366, type: !237)
!912 = !DILocation(line: 366, column: 29, scope: !907)
!913 = !DILocalVariable(name: "buf", arg: 2, scope: !907, file: !512, line: 366, type: !230)
!914 = !DILocation(line: 366, column: 43, scope: !907)
!915 = !DILocalVariable(name: "proto", arg: 3, scope: !907, file: !512, line: 366, type: !910)
!916 = !DILocation(line: 366, column: 58, scope: !907)
!917 = !DILocalVariable(name: "iph", scope: !907, file: !512, line: 368, type: !184)
!918 = !DILocation(line: 368, column: 16, scope: !907)
!919 = !DILocalVariable(name: "hd", scope: !907, file: !512, line: 369, type: !206)
!920 = !DILocation(line: 369, column: 13, scope: !907)
!921 = !DILocation(line: 371, column: 6, scope: !922)
!922 = distinct !DILexicalBlock(scope: !907, file: !512, line: 371, column: 6)
!923 = !DILocation(line: 371, column: 13, scope: !922)
!924 = !DILocation(line: 371, column: 6, scope: !907)
!925 = !DILocation(line: 372, column: 26, scope: !926)
!926 = distinct !DILexicalBlock(scope: !922, file: !512, line: 371, column: 24)
!927 = !DILocation(line: 372, column: 9, scope: !926)
!928 = !DILocation(line: 372, column: 7, scope: !926)
!929 = !DILocation(line: 376, column: 7, scope: !930)
!930 = distinct !DILexicalBlock(scope: !926, file: !512, line: 376, column: 7)
!931 = !DILocation(line: 376, column: 12, scope: !930)
!932 = !DILocation(line: 376, column: 21, scope: !930)
!933 = !DILocation(line: 376, column: 7, scope: !926)
!934 = !DILocation(line: 377, column: 5, scope: !935)
!935 = distinct !DILexicalBlock(scope: !930, file: !512, line: 376, column: 35)
!936 = !DILocation(line: 377, column: 11, scope: !935)
!937 = !DILocation(line: 378, column: 33, scope: !935)
!938 = !DILocation(line: 378, column: 24, scope: !935)
!939 = !DILocation(line: 378, column: 40, scope: !935)
!940 = !DILocation(line: 378, column: 45, scope: !935)
!941 = !DILocation(line: 378, column: 49, scope: !935)
!942 = !DILocation(line: 378, column: 37, scope: !935)
!943 = !DILocation(line: 379, column: 9, scope: !935)
!944 = !DILocation(line: 378, column: 55, scope: !935)
!945 = !DILocation(line: 378, column: 9, scope: !935)
!946 = !DILocation(line: 378, column: 7, scope: !935)
!947 = !DILocation(line: 380, column: 3, scope: !935)
!948 = !DILocation(line: 384, column: 5, scope: !949)
!949 = distinct !DILexicalBlock(scope: !930, file: !512, line: 383, column: 3)
!950 = !DILocation(line: 384, column: 11, scope: !949)
!951 = !DILocation(line: 385, column: 33, scope: !949)
!952 = !DILocation(line: 385, column: 24, scope: !949)
!953 = !DILocation(line: 385, column: 40, scope: !949)
!954 = !DILocation(line: 385, column: 45, scope: !949)
!955 = !DILocation(line: 385, column: 49, scope: !949)
!956 = !DILocation(line: 385, column: 37, scope: !949)
!957 = !DILocation(line: 385, column: 9, scope: !949)
!958 = !DILocation(line: 385, column: 7, scope: !949)
!959 = !DILocation(line: 387, column: 2, scope: !926)
!960 = !DILocation(line: 387, column: 13, scope: !961)
!961 = !DILexicalBlockFile(scope: !962, file: !512, discriminator: 1)
!962 = distinct !DILexicalBlock(scope: !922, file: !512, line: 387, column: 13)
!963 = !DILocation(line: 387, column: 20, scope: !961)
!964 = !DILocation(line: 388, column: 4, scope: !965)
!965 = distinct !DILexicalBlock(scope: !962, file: !512, line: 387, column: 32)
!966 = !DILocation(line: 388, column: 10, scope: !965)
!967 = !DILocation(line: 389, column: 22, scope: !965)
!968 = !DILocation(line: 389, column: 8, scope: !965)
!969 = !DILocation(line: 389, column: 6, scope: !965)
!970 = !DILocation(line: 390, column: 2, scope: !965)
!971 = !DILocation(line: 392, column: 9, scope: !907)
!972 = !DILocation(line: 392, column: 2, scope: !907)
!973 = distinct !DISubprogram(name: "vrrp_send_adv", scope: !512, file: !512, line: 1368, type: !974, isLocal: false, isDefinition: true, scopeLine: 1369, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !526)
!974 = !DISubroutineType(types: !975)
!975 = !{null, !537, !211}
!976 = !DILocalVariable(name: "vrrp", arg: 1, scope: !973, file: !512, line: 1368, type: !537)
!977 = !DILocation(line: 1368, column: 24, scope: !973)
!978 = !DILocalVariable(name: "prio", arg: 2, scope: !973, file: !512, line: 1368, type: !211)
!979 = !DILocation(line: 1368, column: 38, scope: !973)
!980 = !DILocalVariable(name: "addr", scope: !973, file: !512, line: 1370, type: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!982 = !DILocation(line: 1370, column: 27, scope: !973)
!983 = !DILocalVariable(name: "e", scope: !973, file: !512, line: 1371, type: !984)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "element", file: !401, line: 30, baseType: !406)
!985 = !DILocation(line: 1371, column: 10, scope: !973)
!986 = !DILocation(line: 1374, column: 18, scope: !973)
!987 = !DILocation(line: 1374, column: 24, scope: !973)
!988 = !DILocation(line: 1374, column: 2, scope: !973)
!989 = !DILocation(line: 1376, column: 8, scope: !990)
!990 = distinct !DILexicalBlock(scope: !973, file: !512, line: 1376, column: 6)
!991 = !DILocation(line: 1376, column: 14, scope: !990)
!992 = !DILocation(line: 1376, column: 28, scope: !990)
!993 = !DILocation(line: 1376, column: 5, scope: !990)
!994 = !DILocation(line: 1376, column: 10, scope: !995)
!995 = !DILexicalBlockFile(scope: !990, file: !512, discriminator: 1)
!996 = !DILocation(line: 1376, column: 16, scope: !995)
!997 = !DILocation(line: 1376, column: 31, scope: !995)
!998 = !DILocation(line: 1376, column: 36, scope: !995)
!999 = !DILocation(line: 1376, column: 5, scope: !995)
!1000 = !DILocation(line: 1376, column: 9, scope: !1001)
!1001 = !DILexicalBlockFile(scope: !990, file: !512, discriminator: 2)
!1002 = !DILocation(line: 1376, column: 15, scope: !1001)
!1003 = !DILocation(line: 1376, column: 30, scope: !1001)
!1004 = !DILocation(line: 1376, column: 35, scope: !1001)
!1005 = !DILocation(line: 1376, column: 6, scope: !1001)
!1006 = !DILocation(line: 1377, column: 17, scope: !990)
!1007 = !DILocation(line: 1377, column: 3, scope: !990)
!1008 = !DILocation(line: 1379, column: 16, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1010, file: !512, line: 1379, column: 3)
!1010 = distinct !DILexicalBlock(scope: !990, file: !512, line: 1378, column: 7)
!1011 = !DILocation(line: 1379, column: 22, scope: !1009)
!1012 = !DILocation(line: 1379, column: 15, scope: !1009)
!1013 = !DILocation(line: 1379, column: 41, scope: !1014)
!1014 = !DILexicalBlockFile(scope: !1009, file: !512, discriminator: 1)
!1015 = !DILocation(line: 1379, column: 47, scope: !1014)
!1016 = !DILocation(line: 1379, column: 40, scope: !1014)
!1017 = !DILocation(line: 1379, column: 39, scope: !1014)
!1018 = !DILocation(line: 1379, column: 39, scope: !1019)
!1019 = !DILexicalBlockFile(scope: !1009, file: !512, discriminator: 2)
!1020 = !DILocation(line: 1379, column: 5, scope: !1021)
!1021 = !DILexicalBlockFile(scope: !1009, file: !512, discriminator: 3)
!1022 = !DILocation(line: 1379, column: 11, scope: !1021)
!1023 = !DILocation(line: 1379, column: 26, scope: !1021)
!1024 = !DILocation(line: 1379, column: 39, scope: !1021)
!1025 = !DILocation(line: 1379, column: 39, scope: !1026)
!1026 = !DILexicalBlockFile(scope: !1009, file: !512, discriminator: 4)
!1027 = !DILocation(line: 1379, column: 15, scope: !1026)
!1028 = !DILocation(line: 1379, column: 15, scope: !1029)
!1029 = !DILexicalBlockFile(scope: !1009, file: !512, discriminator: 5)
!1030 = !DILocation(line: 1379, column: 15, scope: !1031)
!1031 = !DILexicalBlockFile(scope: !1009, file: !512, discriminator: 6)
!1032 = !DILocation(line: 1379, column: 12, scope: !1031)
!1033 = !DILocation(line: 1379, column: 8, scope: !1031)
!1034 = !DILocation(line: 1379, column: 6, scope: !1035)
!1035 = !DILexicalBlockFile(scope: !1036, file: !512, discriminator: 7)
!1036 = distinct !DILexicalBlock(scope: !1009, file: !512, line: 1379, column: 3)
!1037 = !DILocation(line: 1379, column: 5, scope: !1035)
!1038 = !DILocation(line: 1379, column: 9, scope: !1035)
!1039 = !DILocation(line: 1379, column: 24, scope: !1040)
!1040 = !DILexicalBlockFile(scope: !1036, file: !512, discriminator: 8)
!1041 = !DILocation(line: 1379, column: 28, scope: !1040)
!1042 = !DILocation(line: 1379, column: 22, scope: !1040)
!1043 = !DILocation(line: 1379, column: 20, scope: !1040)
!1044 = !DILocation(line: 1379, column: 3, scope: !1045)
!1045 = !DILexicalBlockFile(scope: !1009, file: !512, discriminator: 9)
!1046 = !DILocation(line: 1380, column: 8, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !512, line: 1380, column: 8)
!1048 = distinct !DILexicalBlock(scope: !1036, file: !512, line: 1379, column: 58)
!1049 = !DILocation(line: 1380, column: 14, scope: !1047)
!1050 = !DILocation(line: 1380, column: 21, scope: !1047)
!1051 = !DILocation(line: 1380, column: 8, scope: !1048)
!1052 = !DILocation(line: 1381, column: 21, scope: !1047)
!1053 = !DILocation(line: 1381, column: 27, scope: !1047)
!1054 = !DILocation(line: 1381, column: 33, scope: !1047)
!1055 = !DILocation(line: 1381, column: 5, scope: !1047)
!1056 = !DILocation(line: 1382, column: 22, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1048, file: !512, line: 1382, column: 8)
!1058 = !DILocation(line: 1382, column: 28, scope: !1057)
!1059 = !DILocation(line: 1382, column: 8, scope: !1057)
!1060 = !DILocation(line: 1382, column: 34, scope: !1057)
!1061 = !DILocation(line: 1382, column: 8, scope: !1048)
!1062 = !DILocation(line: 1384, column: 13, scope: !1057)
!1063 = !DILocation(line: 1384, column: 19, scope: !1057)
!1064 = !DILocation(line: 1384, column: 43, scope: !1057)
!1065 = !DILocation(line: 1384, column: 26, scope: !1057)
!1066 = !DILocation(line: 1383, column: 5, scope: !1057)
!1067 = !DILocation(line: 1385, column: 3, scope: !1048)
!1068 = !DILocation(line: 1379, column: 47, scope: !1069)
!1069 = !DILexicalBlockFile(scope: !1036, file: !512, discriminator: 10)
!1070 = !DILocation(line: 1379, column: 51, scope: !1069)
!1071 = !DILocation(line: 1379, column: 44, scope: !1069)
!1072 = !DILocation(line: 1379, column: 3, scope: !1069)
!1073 = distinct !{!1073, !1074}
!1074 = !DILocation(line: 1379, column: 3, scope: !1010)
!1075 = !DILocation(line: 1388, column: 4, scope: !973)
!1076 = !DILocation(line: 1388, column: 10, scope: !973)
!1077 = !DILocation(line: 1388, column: 17, scope: !973)
!1078 = !DILocation(line: 1388, column: 2, scope: !973)
!1079 = !DILocation(line: 1389, column: 1, scope: !973)
!1080 = distinct !DISubprogram(name: "vrrp_update_pkt", scope: !512, file: !512, line: 396, type: !1081, isLocal: true, isDefinition: true, scopeLine: 397, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !526)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{null, !537, !211, !981}
!1083 = !DILocalVariable(name: "vrrp", arg: 1, scope: !1080, file: !512, line: 396, type: !537)
!1084 = !DILocation(line: 396, column: 25, scope: !1080)
!1085 = !DILocalVariable(name: "prio", arg: 2, scope: !1080, file: !512, line: 396, type: !211)
!1086 = !DILocation(line: 396, column: 39, scope: !1080)
!1087 = !DILocalVariable(name: "addr", arg: 3, scope: !1080, file: !512, line: 396, type: !981)
!1088 = !DILocation(line: 396, column: 70, scope: !1080)
!1089 = !DILocalVariable(name: "bufptr", scope: !1080, file: !512, line: 398, type: !230)
!1090 = !DILocation(line: 398, column: 8, scope: !1080)
!1091 = !DILocation(line: 398, column: 17, scope: !1080)
!1092 = !DILocation(line: 398, column: 23, scope: !1080)
!1093 = !DILocalVariable(name: "hd", scope: !1080, file: !512, line: 399, type: !206)
!1094 = !DILocation(line: 399, column: 13, scope: !1080)
!1095 = !DILocalVariable(name: "final_update", scope: !1080, file: !512, line: 401, type: !350)
!1096 = !DILocation(line: 401, column: 6, scope: !1080)
!1097 = !DILocalVariable(name: "new_saddr", scope: !1080, file: !512, line: 403, type: !246)
!1098 = !DILocation(line: 403, column: 11, scope: !1080)
!1099 = !DILocalVariable(name: "new_daddr", scope: !1080, file: !512, line: 404, type: !246)
!1100 = !DILocation(line: 404, column: 11, scope: !1080)
!1101 = !DILocation(line: 408, column: 20, scope: !1080)
!1102 = !DILocation(line: 408, column: 26, scope: !1080)
!1103 = !DILocation(line: 408, column: 40, scope: !1080)
!1104 = !DILocation(line: 408, column: 17, scope: !1080)
!1105 = !DILocation(line: 408, column: 22, scope: !1106)
!1106 = !DILexicalBlockFile(scope: !1080, file: !512, discriminator: 1)
