; ModuleID = './[inter]keepalived--vrrp--vrrp_if.o.i'
source_filename = "./[inter]keepalived--vrrp--vrrp_if.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._data = type { i8*, i8, i8*, i8, i8*, i8*, %struct.sockaddr_storage, i8*, i64, %struct._list*, i32, i8, i8, i32, i8*, %struct._interface*, i32, i32, i32, i32, %struct.lvs_syncd_config, i8, %struct.sockaddr_in, %struct.sockaddr_in6, i32, %struct.timeval, i32, i32, i32, i32, i32, i32, i8, i8, i32, [29 x i8], [29 x i8], i8, [32 x i8], [32 x i8], [32 x i8], i8, i8, i8, i8, i8, i8, i32, i64, i8, i8, i8, i32, i64, %struct._notify_fifo, %struct._notify_fifo, %struct._notify_fifo, i32, i8, i32, i8, i32, i8, i32, i8, i8, i8, i32, i64, i32 }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }

!52 = !DIEnumerator(name: "IFF_MASTER", value: 1024)
!53 = !DIEnumerator(name: "IFF_SLAVE", value: 2048)
!54 = !DIEnumerator(name: "IFF_MULTICAST", value: 4096)
!55 = !DIEnumerator(name: "IFF_PORTSEL", value: 8192)
!56 = !DIEnumerator(name: "IFF_AUTOMEDIA", value: 16384)
!57 = !DIEnumerator(name: "IFF_DYNAMIC", value: 32768)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !59, line: 40, size: 32, align: 32, elements: !60)
!59 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!61 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!62 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!63 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!64 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!65 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!66 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!67 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!68 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!69 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!70 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!71 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!72 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!73 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!74 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!75 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!76 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!77 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!78 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!79 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!80 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!81 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!82 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!83 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!84 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!85 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!86 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 119, size: 32, align: 32, elements: !89)
!88 = !DIFile(filename: "./../include/vrrp_track.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98}
!90 = !DIEnumerator(name: "TRACK_VRRP", value: 1)
!91 = !DIEnumerator(name: "TRACK_IF", value: 2)
!92 = !DIEnumerator(name: "TRACK_SG", value: 4)
!93 = !DIEnumerator(name: "TRACK_ADDR", value: 4)
!94 = !DIEnumerator(name: "TRACK_ROUTE", value: 8)
!95 = !DIEnumerator(name: "TRACK_RULE", value: 16)
!96 = !DIEnumerator(name: "TRACK_SADDR", value: 32)
!97 = !DIEnumerator(name: "TRACK_SROUTE", value: 64)
!98 = !DIEnumerator(name: "TRACK_SRULE", value: 128)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vrrp_vmac_bits", file: !100, line: 40, size: 32, align: 32, elements: !101)
!100 = !DIFile(filename: "./../include/vrrp_vmac.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!101 = !{!102, !103, !104}
!102 = !DIEnumerator(name: "VRRP_VMAC_BIT", value: 0)
!103 = !DIEnumerator(name: "VRRP_VMAC_UP_BIT", value: 1)
!104 = !DIEnumerator(name: "VRRP_VMAC_XMITBASE_BIT", value: 2)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !106, line: 24, size: 32, align: 32, elements: !107)
!106 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116}
!108 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!109 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!110 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!111 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!112 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!113 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!114 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!115 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!116 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!117 = !{!118, !119, !120, !122, !127, !128, !139}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!119 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !123, line: 277, baseType: !124)
!123 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !125, line: 189, baseType: !126)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!126 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!127 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mii_ioctl_data", file: !130, line: 154, size: 64, align: 16, elements: !131)
!130 = !DIFile(filename: "/usr/include/linux/mii.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!131 = !{!132, !136, !137, !138}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "phy_id", scope: !129, file: !130, line: 155, baseType: !133, size: 16, align: 16)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !134, line: 23, baseType: !135)
!134 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!135 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "reg_num", scope: !129, file: !130, line: 156, baseType: !133, size: 16, align: 16, offset: 16)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "val_in", scope: !129, file: !130, line: 157, baseType: !133, size: 16, align: 16, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "val_out", scope: !129, file: !130, line: 158, baseType: !133, size: 16, align: 16, offset: 48)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !140, line: 116, baseType: !141)
!140 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__caddr_t", file: !125, line: 183, baseType: !120)
!142 = !{!143, !224, !225, !226}
!143 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !144, line: 80, type: !145, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!144 = !DIFile(filename: "vrrp_if.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !146, line: 31, baseType: !147)
!146 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !146, line: 39, size: 320, align: 64, elements: !149)
!149 = !{!150, !157, !158, !159, !163}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !148, file: !146, line: 40, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !146, line: 33, size: 192, align: 64, elements: !153)
!153 = !{!154, !155, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !146, line: 34, baseType: !151, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !152, file: !146, line: 35, baseType: !151, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !152, file: !146, line: 36, baseType: !118, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !148, file: !146, line: 41, baseType: !151, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !148, file: !146, line: 42, baseType: !126, size: 32, align: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !148, file: !146, line: 43, baseType: !160, size: 64, align: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !118}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !148, file: !146, line: 44, baseType: !164, size: 64, align: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !167, !118}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !169, line: 48, baseType: !170)
!169 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !171, line: 241, size: 1728, align: 64, elements: !172)
!171 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !193, !194, !195, !196, !199, !200, !202, !206, !209, !211, !212, !213, !214, !215, !219, !220}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !170, file: !171, line: 242, baseType: !119, size: 32, align: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !170, file: !171, line: 247, baseType: !120, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !170, file: !171, line: 248, baseType: !120, size: 64, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !170, file: !171, line: 249, baseType: !120, size: 64, align: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !170, file: !171, line: 250, baseType: !120, size: 64, align: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !170, file: !171, line: 251, baseType: !120, size: 64, align: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !170, file: !171, line: 252, baseType: !120, size: 64, align: 64, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !170, file: !171, line: 253, baseType: !120, size: 64, align: 64, offset: 448)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !170, file: !171, line: 254, baseType: !120, size: 64, align: 64, offset: 512)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !170, file: !171, line: 256, baseType: !120, size: 64, align: 64, offset: 576)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !170, file: !171, line: 257, baseType: !120, size: 64, align: 64, offset: 640)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !170, file: !171, line: 258, baseType: !120, size: 64, align: 64, offset: 704)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !170, file: !171, line: 260, baseType: !186, size: 64, align: 64, offset: 768)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !171, line: 156, size: 192, align: 64, elements: !188)
!188 = !{!189, !190, !192}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !187, file: !171, line: 157, baseType: !186, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !187, file: !171, line: 158, baseType: !191, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !187, file: !171, line: 162, baseType: !119, size: 32, align: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !170, file: !171, line: 262, baseType: !191, size: 64, align: 64, offset: 832)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !170, file: !171, line: 264, baseType: !119, size: 32, align: 32, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !170, file: !171, line: 268, baseType: !119, size: 32, align: 32, offset: 928)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !170, file: !171, line: 270, baseType: !197, size: 64, align: 64, offset: 960)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !125, line: 131, baseType: !198)
!198 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !170, file: !171, line: 274, baseType: !135, size: 16, align: 16, offset: 1024)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !170, file: !171, line: 275, baseType: !201, size: 8, align: 8, offset: 1040)
!201 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !170, file: !171, line: 276, baseType: !203, size: 8, align: 8, offset: 1048)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 8, align: 8, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 1)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !170, file: !171, line: 280, baseType: !207, size: 64, align: 64, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !171, line: 150, baseType: null)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !170, file: !171, line: 289, baseType: !210, size: 64, align: 64, offset: 1152)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !125, line: 132, baseType: !198)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !170, file: !171, line: 297, baseType: !118, size: 64, align: 64, offset: 1216)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !170, file: !171, line: 298, baseType: !118, size: 64, align: 64, offset: 1280)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !170, file: !171, line: 299, baseType: !118, size: 64, align: 64, offset: 1344)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !170, file: !171, line: 300, baseType: !118, size: 64, align: 64, offset: 1408)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !170, file: !171, line: 302, baseType: !216, size: 64, align: 64, offset: 1472)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !217, line: 216, baseType: !218)
!217 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!218 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !170, file: !171, line: 303, baseType: !119, size: 32, align: 32, offset: 1536)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !170, file: !171, line: 305, baseType: !221, size: 160, align: 8, offset: 1568)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 160, align: 8, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 20)
!224 = distinct !DIGlobalVariable(name: "if_queue", scope: !0, file: !144, line: 74, type: !145, isLocal: true, isDefinition: true, variable: %struct._list** @if_queue)
!225 = distinct !DIGlobalVariable(name: "old_garp_delay", scope: !0, file: !144, line: 77, type: !145, isLocal: true, isDefinition: true, variable: %struct._list** @old_garp_delay)
!226 = distinct !DIGlobalVariable(name: "ifr", scope: !0, file: !144, line: 75, type: !227, isLocal: true, isDefinition: true, variable: %struct.ifreq* @ifr)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !40, line: 126, size: 320, align: 64, elements: !228)
!228 = !{!229, !236}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !227, file: !40, line: 133, baseType: !230, size: 128, align: 8)
!230 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !227, file: !40, line: 130, size: 128, align: 8, elements: !231)
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !230, file: !40, line: 132, baseType: !233, size: 128, align: 8)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 128, align: 8, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !227, file: !40, line: 149, baseType: !237, size: 192, align: 64, offset: 128)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !227, file: !40, line: 135, size: 192, align: 64, elements: !238)
!238 = !{!239, !250, !251, !252, !253, !254, !256, !257, !258, !268, !269, !270}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !237, file: !40, line: 137, baseType: !240, size: 128, align: 16)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !241, line: 153, size: 128, align: 16, elements: !242)
!241 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!242 = !{!243, !246}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !240, file: !241, line: 155, baseType: !244, size: 16, align: 16)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !245, line: 28, baseType: !135)
!245 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!246 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !240, file: !241, line: 156, baseType: !247, size: 112, align: 8, offset: 16)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 112, align: 8, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 14)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !237, file: !40, line: 138, baseType: !240, size: 128, align: 16)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !237, file: !40, line: 139, baseType: !240, size: 128, align: 16)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !237, file: !40, line: 140, baseType: !240, size: 128, align: 16)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !237, file: !40, line: 141, baseType: !240, size: 128, align: 16)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !237, file: !40, line: 142, baseType: !255, size: 16, align: 16)
!255 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !237, file: !40, line: 143, baseType: !119, size: 32, align: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !237, file: !40, line: 144, baseType: !119, size: 32, align: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !237, file: !40, line: 145, baseType: !259, size: 192, align: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !40, line: 111, size: 192, align: 64, elements: !260)
!260 = !{!261, !262, !263, !264, !266, !267}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !259, file: !40, line: 113, baseType: !218, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !259, file: !40, line: 114, baseType: !218, size: 64, align: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !259, file: !40, line: 115, baseType: !135, size: 16, align: 16, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !259, file: !40, line: 116, baseType: !265, size: 8, align: 8, offset: 144)
!265 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !259, file: !40, line: 117, baseType: !265, size: 8, align: 8, offset: 152)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !259, file: !40, line: 118, baseType: !265, size: 8, align: 8, offset: 160)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !237, file: !40, line: 146, baseType: !233, size: 128, align: 8)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !237, file: !40, line: 147, baseType: !233, size: 128, align: 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !237, file: !40, line: 148, baseType: !141, size: 64, align: 64)
!271 = !{i32 2, !"Dwarf Version", i32 4}
!272 = !{i32 2, !"Debug Info Version", i32 3}
!273 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!274 = distinct !DISubprogram(name: "if_get_by_ifindex", scope: !144, file: !144, line: 85, type: !275, isLocal: false, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !359)
!275 = !DISubroutineType(types: !276)
!276 = !{!277, !283}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !4, line: 111, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !4, line: 76, size: 1792, align: 64, elements: !280)
!280 = !{!281, !282, !286, !291, !309, !310, !312, !313, !314, !320, !321, !322, !323, !324, !325, !327, !328, !329, !330, !351, !352, !353, !354, !355, !356, !357, !358}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !279, file: !4, line: 77, baseType: !233, size: 128, align: 8)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !279, file: !4, line: 78, baseType: !283, size: 32, align: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !4, line: 62, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !285, line: 51, baseType: !126)
!285 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!286 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !279, file: !4, line: 79, baseType: !287, size: 32, align: 32, offset: 160)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !59, line: 31, size: 32, align: 32, elements: !288)
!288 = !{!289}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !287, file: !59, line: 33, baseType: !290, size: 32, align: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !59, line: 30, baseType: !284)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !279, file: !4, line: 80, baseType: !292, size: 128, align: 32, offset: 192)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !59, line: 211, size: 128, align: 32, elements: !293)
!293 = !{!294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !292, file: !59, line: 220, baseType: !295, size: 128, align: 32)
!295 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !59, line: 213, size: 128, align: 32, elements: !296)
!296 = !{!297, !300, !305}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !295, file: !59, line: 215, baseType: !298, size: 128, align: 8)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 128, align: 8, elements: !234)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !285, line: 48, baseType: !265)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !295, file: !59, line: 217, baseType: !301, size: 128, align: 16)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 128, align: 16, elements: !303)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !285, line: 49, baseType: !135)
!303 = !{!304}
!304 = !DISubrange(count: 8)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !295, file: !59, line: 218, baseType: !306, size: 128, align: 32)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 128, align: 32, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 4)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !279, file: !4, line: 81, baseType: !126, size: 32, align: 32, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !279, file: !4, line: 82, baseType: !311, size: 8, align: 8, offset: 352)
!311 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !279, file: !4, line: 83, baseType: !284, size: 32, align: 32, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !279, file: !4, line: 84, baseType: !135, size: 16, align: 16, offset: 416)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !279, file: !4, line: 85, baseType: !315, size: 256, align: 8, offset: 432)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 256, align: 8, elements: !318)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !140, line: 33, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !125, line: 30, baseType: !265)
!318 = !{!319}
!319 = !DISubrange(count: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !279, file: !4, line: 86, baseType: !315, size: 256, align: 8, offset: 688)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !279, file: !4, line: 87, baseType: !216, size: 64, align: 64, offset: 960)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !279, file: !4, line: 88, baseType: !119, size: 32, align: 32, offset: 1024)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !279, file: !4, line: 90, baseType: !311, size: 8, align: 8, offset: 1056)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !279, file: !4, line: 91, baseType: !283, size: 32, align: 32, offset: 1088)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !279, file: !4, line: 92, baseType: !326, size: 64, align: 64, offset: 1152)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !279, file: !4, line: 94, baseType: !283, size: 32, align: 32, offset: 1216)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !279, file: !4, line: 96, baseType: !326, size: 64, align: 64, offset: 1280)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !279, file: !4, line: 97, baseType: !311, size: 8, align: 8, offset: 1344)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !279, file: !4, line: 100, baseType: !331, size: 64, align: 64, offset: 1408)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !4, line: 73, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !4, line: 65, size: 704, align: 64, elements: !334)
!334 = !{!335, !345, !346, !347, !348, !349, !350}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !333, file: !4, line: 66, baseType: !336, size: 128, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !337, line: 31, baseType: !338)
!337 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !339, line: 30, size: 128, align: 64, elements: !340)
!339 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!340 = !{!341, !343}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !338, file: !339, line: 32, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !125, line: 139, baseType: !198)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !338, file: !339, line: 33, baseType: !344, size: 64, align: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !125, line: 141, baseType: !198)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !333, file: !4, line: 67, baseType: !311, size: 8, align: 8, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !333, file: !4, line: 68, baseType: !336, size: 128, align: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !333, file: !4, line: 69, baseType: !311, size: 8, align: 8, offset: 320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !333, file: !4, line: 70, baseType: !336, size: 128, align: 64, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !333, file: !4, line: 71, baseType: !336, size: 128, align: 64, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !333, file: !4, line: 72, baseType: !119, size: 32, align: 32, offset: 640)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !279, file: !4, line: 101, baseType: !311, size: 8, align: 8, offset: 1472)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !279, file: !4, line: 102, baseType: !119, size: 32, align: 32, offset: 1504)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !279, file: !4, line: 103, baseType: !284, size: 32, align: 32, offset: 1536)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !279, file: !4, line: 104, baseType: !284, size: 32, align: 32, offset: 1568)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !279, file: !4, line: 105, baseType: !284, size: 32, align: 32, offset: 1600)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !279, file: !4, line: 107, baseType: !126, size: 32, align: 32, offset: 1632)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !279, file: !4, line: 109, baseType: !311, size: 8, align: 8, offset: 1664)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !279, file: !4, line: 110, baseType: !145, size: 64, align: 64, offset: 1728)
!359 = !{}
!360 = !DILocalVariable(name: "ifindex", arg: 1, scope: !274, file: !144, line: 85, type: !283)
!361 = !DIExpression()
!362 = !DILocation(line: 85, column: 29, scope: !274)
!363 = !DILocalVariable(name: "ifp", scope: !274, file: !144, line: 87, type: !277)
!364 = !DILocation(line: 87, column: 15, scope: !274)
!365 = !DILocalVariable(name: "e", scope: !274, file: !144, line: 88, type: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "element", file: !146, line: 30, baseType: !151)
!367 = !DILocation(line: 88, column: 10, scope: !274)
!368 = !DILocation(line: 90, column: 8, scope: !369)
!369 = distinct !DILexicalBlock(scope: !274, file: !144, line: 90, column: 6)
!370 = !DILocation(line: 90, column: 18, scope: !369)
!371 = !DILocation(line: 90, column: 5, scope: !369)
!372 = !DILocation(line: 90, column: 10, scope: !373)
!373 = !DILexicalBlockFile(scope: !369, file: !144, discriminator: 1)
!374 = !DILocation(line: 90, column: 21, scope: !373)
!375 = !DILocation(line: 90, column: 26, scope: !373)
!376 = !DILocation(line: 90, column: 5, scope: !373)
!377 = !DILocation(line: 90, column: 9, scope: !378)
!378 = !DILexicalBlockFile(scope: !369, file: !144, discriminator: 2)
!379 = !DILocation(line: 90, column: 20, scope: !378)
!380 = !DILocation(line: 90, column: 25, scope: !378)
!381 = !DILocation(line: 90, column: 6, scope: !378)
!382 = !DILocation(line: 91, column: 3, scope: !369)
!383 = !DILocation(line: 93, column: 14, scope: !384)
!384 = distinct !DILexicalBlock(scope: !274, file: !144, line: 93, column: 2)
!385 = !DILocation(line: 93, column: 13, scope: !384)
!386 = !DILocation(line: 93, column: 12, scope: !384)
!387 = !DILocation(line: 93, column: 12, scope: !388)
!388 = !DILexicalBlockFile(scope: !384, file: !144, discriminator: 1)
!389 = !DILocation(line: 93, column: 13, scope: !390)
!390 = !DILexicalBlockFile(scope: !384, file: !144, discriminator: 2)
!391 = !DILocation(line: 93, column: 24, scope: !390)
!392 = !DILocation(line: 93, column: 12, scope: !390)
!393 = !DILocation(line: 93, column: 12, scope: !394)
!394 = !DILexicalBlockFile(scope: !384, file: !144, discriminator: 3)
!395 = !DILocation(line: 93, column: 9, scope: !394)
!396 = !DILocation(line: 93, column: 7, scope: !394)
!397 = !DILocation(line: 93, column: 31, scope: !398)
!398 = !DILexicalBlockFile(scope: !399, file: !144, discriminator: 4)
!399 = distinct !DILexicalBlock(scope: !384, file: !144, line: 93, column: 2)
!400 = !DILocation(line: 93, column: 2, scope: !398)
!401 = !DILocation(line: 94, column: 11, scope: !402)
!402 = distinct !DILexicalBlock(scope: !399, file: !144, line: 93, column: 53)
!403 = !DILocation(line: 94, column: 15, scope: !402)
!404 = !DILocation(line: 94, column: 9, scope: !402)
!405 = !DILocation(line: 94, column: 7, scope: !402)
!406 = !DILocation(line: 95, column: 7, scope: !407)
!407 = distinct !DILexicalBlock(scope: !402, file: !144, line: 95, column: 7)
!408 = !DILocation(line: 95, column: 12, scope: !407)
!409 = !DILocation(line: 95, column: 23, scope: !407)
!410 = !DILocation(line: 95, column: 20, scope: !407)
!411 = !DILocation(line: 95, column: 7, scope: !402)
!412 = !DILocation(line: 96, column: 11, scope: !407)
!413 = !DILocation(line: 96, column: 4, scope: !407)
!414 = !DILocation(line: 97, column: 2, scope: !402)
!415 = !DILocation(line: 93, column: 42, scope: !416)
!416 = !DILexicalBlockFile(scope: !399, file: !144, discriminator: 5)
!417 = !DILocation(line: 93, column: 46, scope: !416)
!418 = !DILocation(line: 93, column: 39, scope: !416)
!419 = !DILocation(line: 93, column: 2, scope: !416)
!420 = distinct !{!420, !421}
!421 = !DILocation(line: 93, column: 2, scope: !274)
!422 = !DILocation(line: 98, column: 2, scope: !274)
!423 = !DILocation(line: 99, column: 1, scope: !274)
!424 = distinct !DISubprogram(name: "base_if_get_by_ifp", scope: !144, file: !144, line: 103, type: !425, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !359)
!425 = !DISubroutineType(types: !426)
!426 = !{!277, !277}
!427 = !DILocalVariable(name: "ifp", arg: 1, scope: !424, file: !144, line: 103, type: !277)
!428 = !DILocation(line: 103, column: 33, scope: !424)
!429 = !DILocation(line: 106, column: 10, scope: !424)
!430 = !DILocation(line: 106, column: 14, scope: !424)
!431 = !DILocation(line: 106, column: 17, scope: !432)
!432 = !DILexicalBlockFile(scope: !424, file: !144, discriminator: 1)
!433 = !DILocation(line: 106, column: 22, scope: !432)
!434 = !DILocation(line: 106, column: 9, scope: !432)
!435 = !DILocation(line: 106, column: 30, scope: !436)
!436 = !DILexicalBlockFile(scope: !424, file: !144, discriminator: 2)
!437 = !DILocation(line: 106, column: 35, scope: !436)
!438 = !DILocation(line: 106, column: 9, scope: !436)
!439 = !DILocation(line: 106, column: 46, scope: !440)
!440 = !DILexicalBlockFile(scope: !424, file: !144, discriminator: 3)
!441 = !DILocation(line: 106, column: 9, scope: !440)
!442 = !DILocation(line: 106, column: 9, scope: !443)
!443 = !DILexicalBlockFile(scope: !424, file: !144, discriminator: 4)
!444 = !DILocation(line: 106, column: 2, scope: !443)
!445 = distinct !DISubprogram(name: "if_get_by_ifname", scope: !144, file: !144, line: 113, type: !446, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !359)
!446 = !DISubroutineType(types: !447)
!447 = !{!277, !448, !450}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "if_lookup_t", file: !4, line: 147, baseType: !3)
!451 = !DILocalVariable(name: "ifname", arg: 1, scope: !445, file: !144, line: 113, type: !448)
!452 = !DILocation(line: 113, column: 30, scope: !445)
!453 = !DILocalVariable(name: "create", arg: 2, scope: !445, file: !144, line: 113, type: !450)
!454 = !DILocation(line: 113, column: 50, scope: !445)
!455 = !DILocalVariable(name: "ifp", scope: !445, file: !144, line: 115, type: !277)
!456 = !DILocation(line: 115, column: 15, scope: !445)
!457 = !DILocalVariable(name: "e", scope: !445, file: !144, line: 116, type: !366)
!458 = !DILocation(line: 116, column: 10, scope: !445)
!459 = !DILocation(line: 118, column: 9, scope: !460)
!460 = distinct !DILexicalBlock(scope: !445, file: !144, line: 118, column: 6)
!461 = !DILocation(line: 118, column: 19, scope: !460)
!462 = !DILocation(line: 118, column: 6, scope: !460)
!463 = !DILocation(line: 118, column: 11, scope: !464)
!464 = !DILexicalBlockFile(scope: !460, file: !144, discriminator: 1)
!465 = !DILocation(line: 118, column: 22, scope: !464)
!466 = !DILocation(line: 118, column: 27, scope: !464)
!467 = !DILocation(line: 118, column: 6, scope: !464)
!468 = !DILocation(line: 118, column: 10, scope: !469)
!469 = !DILexicalBlockFile(scope: !460, file: !144, discriminator: 2)
!470 = !DILocation(line: 118, column: 21, scope: !469)
!471 = !DILocation(line: 118, column: 26, scope: !469)
!472 = !DILocation(line: 118, column: 6, scope: !469)
!473 = !DILocation(line: 119, column: 15, scope: !474)
!474 = distinct !DILexicalBlock(scope: !475, file: !144, line: 119, column: 3)
!475 = distinct !DILexicalBlock(scope: !460, file: !144, line: 118, column: 10)
!476 = !DILocation(line: 119, column: 14, scope: !474)
!477 = !DILocation(line: 119, column: 13, scope: !474)
!478 = !DILocation(line: 119, column: 13, scope: !479)
!479 = !DILexicalBlockFile(scope: !474, file: !144, discriminator: 1)
!480 = !DILocation(line: 119, column: 14, scope: !481)
!481 = !DILexicalBlockFile(scope: !474, file: !144, discriminator: 2)
!482 = !DILocation(line: 119, column: 25, scope: !481)
!483 = !DILocation(line: 119, column: 13, scope: !481)
!484 = !DILocation(line: 119, column: 13, scope: !485)
!485 = !DILexicalBlockFile(scope: !474, file: !144, discriminator: 3)
!486 = !DILocation(line: 119, column: 10, scope: !485)
!487 = !DILocation(line: 119, column: 8, scope: !485)
!488 = !DILocation(line: 119, column: 32, scope: !489)
!489 = !DILexicalBlockFile(scope: !490, file: !144, discriminator: 4)
!490 = distinct !DILexicalBlock(scope: !474, file: !144, line: 119, column: 3)
!491 = !DILocation(line: 119, column: 3, scope: !489)
!492 = !DILocation(line: 120, column: 12, scope: !493)
!493 = distinct !DILexicalBlock(scope: !490, file: !144, line: 119, column: 54)
!494 = !DILocation(line: 120, column: 16, scope: !493)
!495 = !DILocation(line: 120, column: 10, scope: !493)
!496 = !DILocation(line: 120, column: 8, scope: !493)
!497 = !DILocation(line: 121, column: 16, scope: !498)
!498 = distinct !DILexicalBlock(scope: !493, file: !144, line: 121, column: 8)
!499 = !DILocation(line: 121, column: 21, scope: !498)
!500 = !DILocation(line: 121, column: 29, scope: !498)
!501 = !DILocation(line: 121, column: 9, scope: !498)
!502 = !DILocation(line: 121, column: 8, scope: !493)
!503 = !DILocation(line: 122, column: 12, scope: !498)
!504 = !DILocation(line: 122, column: 5, scope: !498)
!505 = !DILocation(line: 123, column: 3, scope: !493)
!506 = !DILocation(line: 119, column: 43, scope: !507)
!507 = !DILexicalBlockFile(scope: !490, file: !144, discriminator: 5)
!508 = !DILocation(line: 119, column: 47, scope: !507)
!509 = !DILocation(line: 119, column: 40, scope: !507)
!510 = !DILocation(line: 119, column: 3, scope: !507)
!511 = distinct !{!511, !512}
!512 = !DILocation(line: 119, column: 3, scope: !475)
!513 = !DILocation(line: 124, column: 2, scope: !475)
!514 = !DILocation(line: 126, column: 6, scope: !515)
!515 = distinct !DILexicalBlock(scope: !445, file: !144, line: 126, column: 6)
!516 = !DILocation(line: 126, column: 13, scope: !515)
!517 = !DILocation(line: 126, column: 29, scope: !515)
!518 = !DILocation(line: 127, column: 7, scope: !515)
!519 = !DILocation(line: 127, column: 14, scope: !515)
!520 = !DILocation(line: 127, column: 38, scope: !515)
!521 = !DILocation(line: 127, column: 43, scope: !522)
!522 = !DILexicalBlockFile(scope: !515, file: !144, discriminator: 1)
!523 = !DILocation(line: 127, column: 55, scope: !522)
!524 = !DILocation(line: 127, column: 59, scope: !525)
!525 = !DILexicalBlockFile(scope: !515, file: !144, discriminator: 2)
!526 = !DILocation(line: 127, column: 72, scope: !525)
!527 = !DILocation(line: 126, column: 6, scope: !528)
!528 = !DILexicalBlockFile(scope: !445, file: !144, discriminator: 1)
!529 = !DILocation(line: 128, column: 7, scope: !530)
!530 = distinct !DILexicalBlock(scope: !531, file: !144, line: 128, column: 7)
!531 = distinct !DILexicalBlock(scope: !515, file: !144, line: 127, column: 94)
!532 = !DILocation(line: 128, column: 14, scope: !530)
!533 = !DILocation(line: 128, column: 7, scope: !531)
!534 = !DILocation(line: 129, column: 37, scope: !530)
!535 = !DILocation(line: 129, column: 4, scope: !530)
!536 = !DILocation(line: 130, column: 3, scope: !531)
!537 = !DILocation(line: 133, column: 15, scope: !538)
!538 = distinct !DILexicalBlock(scope: !445, file: !144, line: 133, column: 6)
!539 = !DILocation(line: 133, column: 14, scope: !538)
!540 = !DILocation(line: 133, column: 12, scope: !538)
!541 = !DILocation(line: 133, column: 6, scope: !445)
!542 = !DILocation(line: 134, column: 3, scope: !538)
!543 = !DILocation(line: 136, column: 9, scope: !445)
!544 = !DILocation(line: 136, column: 14, scope: !445)
!545 = !DILocation(line: 136, column: 22, scope: !445)
!546 = !DILocation(line: 136, column: 2, scope: !445)
!547 = !DILocation(line: 138, column: 18, scope: !445)
!548 = !DILocation(line: 138, column: 2, scope: !445)
!549 = !DILocation(line: 138, column: 7, scope: !445)
!550 = !DILocation(line: 138, column: 16, scope: !445)
!551 = !DILocation(line: 140, column: 15, scope: !445)
!552 = !DILocation(line: 140, column: 2, scope: !445)
!553 = !DILocation(line: 142, column: 6, scope: !554)
!554 = distinct !DILexicalBlock(scope: !445, file: !144, line: 142, column: 6)
!555 = !DILocation(line: 142, column: 13, scope: !554)
!556 = !DILocation(line: 142, column: 6, scope: !445)
!557 = !DILocation(line: 143, column: 116, scope: !554)
!558 = !DILocation(line: 143, column: 3, scope: !554)
!559 = !DILocation(line: 145, column: 9, scope: !445)
!560 = !DILocation(line: 145, column: 2, scope: !445)
!561 = !DILocation(line: 146, column: 1, scope: !445)
!562 = distinct !DISubprogram(name: "if_add_queue", scope: !144, file: !144, line: 562, type: !563, isLocal: false, isDefinition: true, scopeLine: 563, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !359)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !277}
!565 = !DILocalVariable(name: "ifp", arg: 1, scope: !562, file: !144, line: 562, type: !277)
!566 = !DILocation(line: 562, column: 28, scope: !562)
!567 = !DILocation(line: 564, column: 11, scope: !562)
!568 = !DILocation(line: 564, column: 21, scope: !562)
!569 = !DILocation(line: 564, column: 2, scope: !562)
!570 = !DILocation(line: 565, column: 1, scope: !562)
!571 = distinct !DISubprogram(name: "set_base_ifp", scope: !144, file: !144, line: 151, type: !572, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !359)
!572 = !DISubroutineType(types: !573)
!573 = !{null}
!574 = !DILocalVariable(name: "ifp", scope: !571, file: !144, line: 153, type: !277)
!575 = !DILocation(line: 153, column: 15, scope: !571)
!576 = !DILocalVariable(name: "master_ifp", scope: !571, file: !144, line: 155, type: !277)
!577 = !DILocation(line: 155, column: 15, scope: !571)
!578 = !DILocalVariable(name: "e", scope: !571, file: !144, line: 157, type: !366)
!579 = !DILocation(line: 157, column: 10, scope: !571)
!580 = !DILocation(line: 159, column: 8, scope: !581)
!581 = distinct !DILexicalBlock(scope: !571, file: !144, line: 159, column: 6)
!582 = !DILocation(line: 159, column: 18, scope: !581)
!583 = !DILocation(line: 159, column: 5, scope: !581)
!584 = !DILocation(line: 159, column: 10, scope: !585)
!585 = !DILexicalBlockFile(scope: !581, file: !144, discriminator: 1)
!586 = !DILocation(line: 159, column: 21, scope: !585)
!587 = !DILocation(line: 159, column: 26, scope: !585)
!588 = !DILocation(line: 159, column: 5, scope: !585)
!589 = !DILocation(line: 159, column: 9, scope: !590)
!590 = !DILexicalBlockFile(scope: !581, file: !144, discriminator: 2)
!591 = !DILocation(line: 159, column: 20, scope: !590)
!592 = !DILocation(line: 159, column: 25, scope: !590)
!593 = !DILocation(line: 159, column: 6, scope: !590)
!594 = !DILocation(line: 160, column: 3, scope: !581)
!595 = !DILocation(line: 162, column: 15, scope: !596)
!596 = distinct !DILexicalBlock(scope: !571, file: !144, line: 162, column: 2)
!597 = !DILocation(line: 162, column: 14, scope: !596)
!598 = !DILocation(line: 162, column: 30, scope: !599)
!599 = !DILexicalBlockFile(scope: !596, file: !144, discriminator: 1)
!600 = !DILocation(line: 162, column: 29, scope: !599)
!601 = !DILocation(line: 162, column: 28, scope: !599)
!602 = !DILocation(line: 162, column: 28, scope: !603)
!603 = !DILexicalBlockFile(scope: !596, file: !144, discriminator: 2)
!604 = !DILocation(line: 162, column: 4, scope: !605)
!605 = !DILexicalBlockFile(scope: !596, file: !144, discriminator: 3)
!606 = !DILocation(line: 162, column: 15, scope: !605)
!607 = !DILocation(line: 162, column: 28, scope: !605)
!608 = !DILocation(line: 162, column: 28, scope: !609)
!609 = !DILexicalBlockFile(scope: !596, file: !144, discriminator: 4)
!610 = !DILocation(line: 162, column: 14, scope: !609)
!611 = !DILocation(line: 162, column: 14, scope: !612)
!612 = !DILexicalBlockFile(scope: !596, file: !144, discriminator: 5)
!613 = !DILocation(line: 162, column: 14, scope: !614)
!614 = !DILexicalBlockFile(scope: !596, file: !144, discriminator: 6)
!615 = !DILocation(line: 162, column: 11, scope: !614)
!616 = !DILocation(line: 162, column: 7, scope: !614)
!617 = !DILocation(line: 162, column: 5, scope: !618)
!618 = !DILexicalBlockFile(scope: !619, file: !144, discriminator: 7)
!619 = distinct !DILexicalBlock(scope: !596, file: !144, line: 162, column: 2)
!620 = !DILocation(line: 162, column: 4, scope: !618)
!621 = !DILocation(line: 162, column: 8, scope: !618)
!622 = !DILocation(line: 162, column: 22, scope: !623)
!623 = !DILexicalBlockFile(scope: !619, file: !144, discriminator: 8)
!624 = !DILocation(line: 162, column: 26, scope: !623)
!625 = !DILocation(line: 162, column: 20, scope: !623)
!626 = !DILocation(line: 162, column: 18, scope: !623)
!627 = !DILocation(line: 162, column: 2, scope: !628)
!628 = !DILexicalBlockFile(scope: !596, file: !144, discriminator: 9)
!629 = !DILocation(line: 163, column: 8, scope: !630)
!630 = distinct !DILexicalBlock(scope: !631, file: !144, line: 163, column: 7)
!631 = distinct !DILexicalBlock(scope: !619, file: !144, line: 162, column: 56)
!632 = !DILocation(line: 163, column: 13, scope: !630)
!633 = !DILocation(line: 163, column: 22, scope: !630)
!634 = !DILocation(line: 164, column: 7, scope: !630)
!635 = !DILocation(line: 164, column: 12, scope: !630)
!636 = !DILocation(line: 163, column: 7, scope: !637)
!637 = !DILexicalBlockFile(scope: !631, file: !144, discriminator: 1)
!638 = !DILocation(line: 165, column: 38, scope: !639)
!639 = distinct !DILexicalBlock(scope: !630, file: !144, line: 164, column: 26)
!640 = !DILocation(line: 165, column: 43, scope: !639)
!641 = !DILocation(line: 165, column: 20, scope: !639)
!642 = !DILocation(line: 165, column: 4, scope: !639)
!643 = !DILocation(line: 165, column: 9, scope: !639)
!644 = !DILocation(line: 165, column: 18, scope: !639)
!645 = !DILocation(line: 166, column: 4, scope: !639)
!646 = !DILocation(line: 166, column: 9, scope: !639)
!647 = !DILocation(line: 166, column: 22, scope: !639)
!648 = !DILocation(line: 167, column: 3, scope: !639)
!649 = !DILocation(line: 171, column: 7, scope: !650)
!650 = distinct !DILexicalBlock(scope: !631, file: !144, line: 171, column: 7)
!651 = !DILocation(line: 171, column: 12, scope: !650)
!652 = !DILocation(line: 171, column: 7, scope: !631)
!653 = !DILocation(line: 172, column: 35, scope: !654)
!654 = distinct !DILexicalBlock(scope: !650, file: !144, line: 171, column: 32)
!655 = !DILocation(line: 172, column: 40, scope: !654)
!656 = !DILocation(line: 172, column: 17, scope: !654)
!657 = !DILocation(line: 172, column: 15, scope: !654)
!658 = !DILocation(line: 173, column: 8, scope: !659)
!659 = distinct !DILexicalBlock(scope: !654, file: !144, line: 173, column: 8)
!660 = !DILocation(line: 173, column: 19, scope: !659)
!661 = !DILocation(line: 173, column: 22, scope: !662)
!662 = !DILexicalBlockFile(scope: !659, file: !144, discriminator: 1)
!663 = !DILocation(line: 173, column: 34, scope: !662)
!664 = !DILocation(line: 173, column: 8, scope: !662)
!665 = !DILocation(line: 174, column: 27, scope: !659)
!666 = !DILocation(line: 174, column: 5, scope: !659)
!667 = !DILocation(line: 174, column: 10, scope: !659)
!668 = !DILocation(line: 174, column: 25, scope: !659)
!669 = !DILocation(line: 175, column: 4, scope: !654)
!670 = !DILocation(line: 175, column: 9, scope: !654)
!671 = !DILocation(line: 175, column: 28, scope: !654)
!672 = !DILocation(line: 176, column: 3, scope: !654)
!673 = !DILocation(line: 178, column: 2, scope: !631)
!674 = !DILocation(line: 162, column: 45, scope: !675)
!675 = !DILexicalBlockFile(scope: !619, file: !144, discriminator: 10)
!676 = !DILocation(line: 162, column: 49, scope: !675)
!677 = !DILocation(line: 162, column: 42, scope: !675)
!678 = !DILocation(line: 162, column: 2, scope: !675)
!679 = distinct !{!679, !680}
!680 = !DILocation(line: 162, column: 2, scope: !571)
!681 = !DILocation(line: 179, column: 1, scope: !571)
!682 = distinct !DISubprogram(name: "get_if_list", scope: !144, file: !144, line: 184, type: !683, isLocal: false, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !359)
!683 = !DISubroutineType(types: !684)
!684 = !{!145}
!685 = !DILocation(line: 186, column: 9, scope: !682)
!686 = !DILocation(line: 186, column: 2, scope: !682)
!687 = distinct !DISubprogram(name: "reset_interface_queue", scope: !144, file: !144, line: 190, type: !572, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !359)
!688 = !DILocation(line: 192, column: 19, scope: !687)
!689 = !DILocation(line: 192, column: 17, scope: !687)
!690 = !DILocalVariable(name: "ifp", scope: !687, file: !144, line: 193, type: !277)
!691 = !DILocation(line: 193, column: 15, scope: !687)
!692 = !DILocalVariable(name: "e", scope: !687, file: !144, line: 194, type: !366)
!693 = !DILocation(line: 194, column: 10, scope: !687)
!694 = !DILocation(line: 196, column: 13, scope: !687)
!695 = !DILocation(line: 198, column: 15, scope: !696)
!696 = distinct !DILexicalBlock(scope: !687, file: !144, line: 198, column: 2)
!697 = !DILocation(line: 198, column: 14, scope: !696)
!698 = !DILocation(line: 198, column: 30, scope: !699)
!699 = !DILexicalBlockFile(scope: !696, file: !144, discriminator: 1)
!700 = !DILocation(line: 198, column: 29, scope: !699)
!701 = !DILocation(line: 198, column: 28, scope: !699)
!702 = !DILocation(line: 198, column: 28, scope: !703)
!703 = !DILexicalBlockFile(scope: !696, file: !144, discriminator: 2)
!704 = !DILocation(line: 198, column: 4, scope: !705)
!705 = !DILexicalBlockFile(scope: !696, file: !144, discriminator: 3)
!706 = !DILocation(line: 198, column: 15, scope: !705)
!707 = !DILocation(line: 198, column: 28, scope: !705)
!708 = !DILocation(line: 198, column: 28, scope: !709)
!709 = !DILexicalBlockFile(scope: !696, file: !144, discriminator: 4)
!710 = !DILocation(line: 198, column: 14, scope: !709)
!711 = !DILocation(line: 198, column: 14, scope: !712)
!712 = !DILexicalBlockFile(scope: !696, file: !144, discriminator: 5)
!713 = !DILocation(line: 198, column: 14, scope: !714)
!714 = !DILexicalBlockFile(scope: !696, file: !144, discriminator: 6)
!715 = !DILocation(line: 198, column: 11, scope: !714)
!716 = !DILocation(line: 198, column: 7, scope: !714)
!717 = !DILocation(line: 198, column: 5, scope: !718)
!718 = !DILexicalBlockFile(scope: !719, file: !144, discriminator: 7)
!719 = distinct !DILexicalBlock(scope: !696, file: !144, line: 198, column: 2)
!720 = !DILocation(line: 198, column: 4, scope: !718)
!721 = !DILocation(line: 198, column: 8, scope: !718)
!722 = !DILocation(line: 198, column: 22, scope: !723)
!723 = !DILexicalBlockFile(scope: !719, file: !144, discriminator: 8)
!724 = !DILocation(line: 198, column: 26, scope: !723)
!725 = !DILocation(line: 198, column: 20, scope: !723)
!726 = !DILocation(line: 198, column: 18, scope: !723)
!727 = !DILocation(line: 198, column: 2, scope: !728)
!728 = !DILexicalBlockFile(scope: !696, file: !144, discriminator: 9)
!729 = !DILocation(line: 199, column: 3, scope: !730)
!730 = distinct !DILexicalBlock(scope: !719, file: !144, line: 198, column: 56)
!731 = !DILocation(line: 199, column: 8, scope: !730)
!732 = !DILocation(line: 199, column: 29, scope: !730)
!733 = !DILocation(line: 200, column: 3, scope: !730)
!734 = !DILocation(line: 200, column: 8, scope: !730)
!735 = !DILocation(line: 200, column: 19, scope: !730)
!736 = !DILocation(line: 201, column: 14, scope: !730)
!737 = !DILocation(line: 201, column: 19, scope: !730)
!738 = !DILocation(line: 201, column: 3, scope: !730)
!739 = !DILocation(line: 202, column: 2, scope: !730)
!740 = !DILocation(line: 198, column: 45, scope: !741)
!741 = !DILexicalBlockFile(scope: !719, file: !144, discriminator: 10)
!742 = !DILocation(line: 198, column: 49, scope: !741)
!743 = !DILocation(line: 198, column: 42, scope: !741)
!744 = !DILocation(line: 198, column: 2, scope: !741)
!745 = distinct !{!745, !746}
!746 = !DILocation(line: 198, column: 2, scope: !687)
!747 = !DILocation(line: 203, column: 1, scope: !687)
!748 = distinct !DISubprogram(name: "alloc_garp_delay", scope: !144, file: !144, line: 416, type: !572, isLocal: false, isDefinition: true, scopeLine: 417, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !359)
!749 = !DILocation(line: 418, column: 9, scope: !750)
!750 = distinct !DILexicalBlock(scope: !748, file: !144, line: 418, column: 6)
!751 = !DILocation(line: 418, column: 21, scope: !750)
!752 = !DILocation(line: 418, column: 6, scope: !748)
!753 = !DILocation(line: 419, column: 16, scope: !750)
!754 = !DILocation(line: 419, column: 14, scope: !750)
!755 = !DILocation(line: 419, column: 3, scope: !750)
!756 = !DILocation(line: 421, column: 11, scope: !748)
!757 = !DILocation(line: 421, column: 24, scope: !748)
!758 = !DILocation(line: 421, column: 2, scope: !759)
!759 = !DILexicalBlockFile(scope: !748, file: !144, discriminator: 1)
!760 = !DILocation(line: 422, column: 1, scope: !748)
!761 = distinct !DISubprogram(name: "free_garp_delay", scope: !144, file: !144, line: 377, type: !161, isLocal: true, isDefinition: true, scopeLine: 378, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !359)
!762 = !DILocalVariable(name: "data", arg: 1, scope: !761, file: !144, line: 377, type: !118)
!763 = !DILocation(line: 377, column: 23, scope: !761)
!764 = !DILocation(line: 379, column: 8, scope: !761)
!765 = !DILocation(line: 379, column: 3, scope: !761)
!766 = !DILocation(line: 379, column: 22, scope: !761)
!767 = !DILocation(line: 380, column: 1, scope: !761)
!768 = distinct !DISubprogram(name: "dump_garp_delay", scope: !144, file: !144, line: 383, type: !165, isLocal: true, isDefinition: true, scopeLine: 384, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !359)
!769 = !DILocalVariable(name: "fp", arg: 1, scope: !768, file: !144, line: 383, type: !167)
!770 = !DILocation(line: 383, column: 23, scope: !768)
!771 = !DILocalVariable(name: "data", arg: 2, scope: !768, file: !144, line: 383, type: !118)
!772 = !DILocation(line: 383, column: 33, scope: !768)
!773 = !DILocalVariable(name: "gd", scope: !768, file: !144, line: 385, type: !331)
!774 = !DILocation(line: 385, column: 16, scope: !768)
!775 = !DILocation(line: 385, column: 21, scope: !768)
!776 = !DILocalVariable(name: "time_str", scope: !768, file: !144, line: 386, type: !777)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 208, align: 8, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 26)
!780 = !DILocation(line: 386, column: 7, scope: !768)
!781 = !DILocalVariable(name: "ifp", scope: !768, file: !144, line: 387, type: !277)
!782 = !DILocation(line: 387, column: 15, scope: !768)
!783 = !DILocalVariable(name: "e", scope: !768, file: !144, line: 388, type: !366)
!784 = !DILocation(line: 388, column: 10, scope: !768)
!785 = !DILocation(line: 390, column: 13, scope: !768)
!786 = !DILocation(line: 390, column: 56, scope: !768)
!787 = !DILocation(line: 390, column: 60, scope: !768)
!788 = !DILocation(line: 390, column: 2, scope: !768)
!789 = !DILocation(line: 392, column: 6, scope: !790)
!790 = distinct !DILexicalBlock(scope: !768, file: !144, line: 392, column: 6)
!791 = !DILocation(line: 392, column: 10, scope: !790)
!792 = !DILocation(line: 392, column: 6, scope: !768)
!793 = !DILocation(line: 393, column: 14, scope: !794)
!794 = distinct !DILexicalBlock(scope: !790, file: !144, line: 392, column: 30)
!795 = !DILocation(line: 393, column: 41, scope: !794)
!796 = !DILocation(line: 393, column: 45, scope: !794)
!797 = !DILocation(line: 393, column: 59, scope: !794)
!798 = !DILocation(line: 393, column: 77, scope: !794)
!799 = !DILocation(line: 393, column: 81, scope: !794)
!800 = !DILocation(line: 393, column: 95, scope: !794)
!801 = !DILocation(line: 393, column: 69, scope: !794)
!802 = !DILocation(line: 393, column: 104, scope: !794)
!803 = !DILocation(line: 393, column: 66, scope: !794)
!804 = !DILocation(line: 393, column: 3, scope: !794)
!805 = !DILocation(line: 394, column: 17, scope: !806)
!806 = distinct !DILexicalBlock(scope: !794, file: !144, line: 394, column: 7)
!807 = !DILocation(line: 394, column: 21, scope: !806)
!808 = !DILocation(line: 394, column: 36, scope: !806)
!809 = !DILocation(line: 394, column: 44, scope: !806)
!810 = !DILocation(line: 394, column: 8, scope: !806)
!811 = !DILocation(line: 394, column: 7, scope: !794)
!812 = !DILocation(line: 395, column: 32, scope: !806)
!813 = !DILocation(line: 395, column: 25, scope: !806)
!814 = !DILocation(line: 396, column: 14, scope: !794)
!815 = !DILocation(line: 396, column: 63, scope: !794)
!816 = !DILocation(line: 396, column: 67, scope: !794)
!817 = !DILocation(line: 396, column: 82, scope: !794)
!818 = !DILocation(line: 396, column: 90, scope: !794)
!819 = !DILocation(line: 396, column: 94, scope: !794)
!820 = !DILocation(line: 396, column: 109, scope: !794)
!821 = !DILocation(line: 396, column: 118, scope: !794)
!822 = !DILocation(line: 396, column: 128, scope: !794)
!823 = !DILocation(line: 396, column: 132, scope: !794)
!824 = !DILocation(line: 396, column: 147, scope: !794)
!825 = !DILocation(line: 396, column: 3, scope: !794)
!826 = !DILocation(line: 397, column: 2, scope: !794)
!827 = !DILocation(line: 399, column: 6, scope: !828)
!828 = distinct !DILexicalBlock(scope: !768, file: !144, line: 399, column: 6)
!829 = !DILocation(line: 399, column: 10, scope: !828)
!830 = !DILocation(line: 399, column: 6, scope: !768)
!831 = !DILocation(line: 400, column: 14, scope: !832)
!832 = distinct !DILexicalBlock(scope: !828, file: !144, line: 399, column: 29)
!833 = !DILocation(line: 400, column: 40, scope: !832)
!834 = !DILocation(line: 400, column: 44, scope: !832)
!835 = !DILocation(line: 400, column: 57, scope: !832)
!836 = !DILocation(line: 400, column: 75, scope: !832)
!837 = !DILocation(line: 400, column: 79, scope: !832)
!838 = !DILocation(line: 400, column: 92, scope: !832)
!839 = !DILocation(line: 400, column: 67, scope: !832)
!840 = !DILocation(line: 400, column: 101, scope: !832)
!841 = !DILocation(line: 400, column: 64, scope: !832)
!842 = !DILocation(line: 400, column: 3, scope: !832)
!843 = !DILocation(line: 401, column: 17, scope: !844)
!844 = distinct !DILexicalBlock(scope: !832, file: !144, line: 401, column: 7)
!845 = !DILocation(line: 401, column: 21, scope: !844)
!846 = !DILocation(line: 401, column: 35, scope: !844)
!847 = !DILocation(line: 401, column: 43, scope: !844)
!848 = !DILocation(line: 401, column: 8, scope: !844)
!849 = !DILocation(line: 401, column: 7, scope: !832)
!850 = !DILocation(line: 402, column: 32, scope: !844)
!851 = !DILocation(line: 402, column: 25, scope: !844)
!852 = !DILocation(line: 403, column: 14, scope: !832)
!853 = !DILocation(line: 403, column: 62, scope: !832)
!854 = !DILocation(line: 403, column: 66, scope: !832)
!855 = !DILocation(line: 403, column: 80, scope: !832)
!856 = !DILocation(line: 403, column: 88, scope: !832)
!857 = !DILocation(line: 403, column: 92, scope: !832)
!858 = !DILocation(line: 403, column: 106, scope: !832)
!859 = !DILocation(line: 403, column: 115, scope: !832)
!860 = !DILocation(line: 403, column: 125, scope: !832)
!861 = !DILocation(line: 403, column: 129, scope: !832)
!862 = !DILocation(line: 403, column: 143, scope: !832)
!863 = !DILocation(line: 403, column: 3, scope: !832)
!864 = !DILocation(line: 404, column: 2, scope: !832)
!865 = !DILocation(line: 405, column: 12, scope: !866)
!866 = distinct !DILexicalBlock(scope: !828, file: !144, line: 405, column: 11)
!867 = !DILocation(line: 405, column: 16, scope: !866)
!868 = !DILocation(line: 405, column: 11, scope: !828)
!869 = !DILocation(line: 406, column: 14, scope: !866)
!870 = !DILocation(line: 406, column: 3, scope: !866)
!871 = !DILocation(line: 408, column: 13, scope: !768)
!872 = !DILocation(line: 408, column: 2, scope: !768)
!873 = !DILocation(line: 409, column: 15, scope: !874)
!874 = distinct !DILexicalBlock(scope: !768, file: !144, line: 409, column: 2)
!875 = !DILocation(line: 409, column: 14, scope: !874)
!876 = !DILocation(line: 409, column: 30, scope: !877)
!877 = !DILexicalBlockFile(scope: !874, file: !144, discriminator: 1)
!878 = !DILocation(line: 409, column: 29, scope: !877)
!879 = !DILocation(line: 409, column: 28, scope: !877)
!880 = !DILocation(line: 409, column: 28, scope: !881)
!881 = !DILexicalBlockFile(scope: !874, file: !144, discriminator: 2)
!882 = !DILocation(line: 409, column: 4, scope: !883)
!883 = !DILexicalBlockFile(scope: !874, file: !144, discriminator: 3)
!884 = !DILocation(line: 409, column: 15, scope: !883)
!885 = !DILocation(line: 409, column: 28, scope: !883)
!886 = !DILocation(line: 409, column: 28, scope: !887)
!887 = !DILexicalBlockFile(scope: !874, file: !144, discriminator: 4)
!888 = !DILocation(line: 409, column: 14, scope: !887)
!889 = !DILocation(line: 409, column: 14, scope: !890)
!890 = !DILexicalBlockFile(scope: !874, file: !144, discriminator: 5)
!891 = !DILocation(line: 409, column: 14, scope: !892)
!892 = !DILexicalBlockFile(scope: !874, file: !144, discriminator: 6)
!893 = !DILocation(line: 409, column: 11, scope: !892)
!894 = !DILocation(line: 409, column: 7, scope: !892)
!895 = !DILocation(line: 409, column: 5, scope: !896)
!896 = !DILexicalBlockFile(scope: !897, file: !144, discriminator: 7)
!897 = distinct !DILexicalBlock(scope: !874, file: !144, line: 409, column: 2)
!898 = !DILocation(line: 409, column: 4, scope: !896)
!899 = !DILocation(line: 409, column: 8, scope: !896)
!900 = !DILocation(line: 409, column: 22, scope: !901)
!901 = !DILexicalBlockFile(scope: !897, file: !144, discriminator: 8)
!902 = !DILocation(line: 409, column: 26, scope: !901)
!903 = !DILocation(line: 409, column: 20, scope: !901)
!904 = !DILocation(line: 409, column: 18, scope: !901)
!905 = !DILocation(line: 409, column: 2, scope: !906)
!906 = !DILexicalBlockFile(scope: !874, file: !144, discriminator: 9)
!907 = !DILocation(line: 410, column: 7, scope: !908)
!908 = distinct !DILexicalBlock(scope: !909, file: !144, line: 410, column: 7)
!909 = distinct !DILexicalBlock(scope: !897, file: !144, line: 409, column: 56)
!910 = !DILocation(line: 410, column: 12, scope: !908)
!911 = !DILocation(line: 410, column: 26, scope: !908)
!912 = !DILocation(line: 410, column: 23, scope: !908)
!913 = !DILocation(line: 410, column: 7, scope: !909)
!914 = !DILocation(line: 411, column: 15, scope: !908)
!915 = !DILocation(line: 411, column: 27, scope: !908)
!916 = !DILocation(line: 411, column: 32, scope: !908)
!917 = !DILocation(line: 411, column: 4, scope: !908)
!918 = !DILocation(line: 412, column: 2, scope: !909)
!919 = !DILocation(line: 409, column: 45, scope: !920)
!920 = !DILexicalBlockFile(scope: !897, file: !144, discriminator: 10)
!921 = !DILocation(line: 409, column: 49, scope: !920)
!922 = !DILocation(line: 409, column: 42, scope: !920)
!923 = !DILocation(line: 409, column: 2, scope: !920)
!924 = distinct !{!924, !925}
!925 = !DILocation(line: 409, column: 2, scope: !768)
!926 = !DILocation(line: 413, column: 1, scope: !768)
!927 = distinct !DISubprogram(name: "set_default_garp_delay", scope: !144, file: !144, line: 425, type: !572, isLocal: false, isDefinition: true, scopeLine: 426, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !359)
!928 = !DILocalVariable(name: "default_delay", scope: !927, file: !144, line: 427, type: !332)
!929 = !DILocation(line: 427, column: 15, scope: !927)
!930 = !DILocalVariable(name: "e", scope: !927, file: !144, line: 428, type: !366)
!931 = !DILocation(line: 428, column: 10, scope: !927)
!932 = !DILocalVariable(name: "ifp", scope: !927, file: !144, line: 429, type: !277)
!933 = !DILocation(line: 429, column: 15, scope: !927)
!934 = !DILocalVariable(name: "delay", scope: !927, file: !144, line: 430, type: !331)
!935 = !DILocation(line: 430, column: 16, scope: !927)
!936 = !DILocalVariable(name: "vrrp", scope: !927, file: !144, line: 431, type: !937)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_t", file: !11, line: 310, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_t", file: !11, line: 183, size: 7040, align: 64, elements: !940)
!940 = !{!941, !942, !943, !991, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1032, !1033, !1034, !1035, !1036, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1194, !1201}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !939, file: !11, line: 184, baseType: !244, size: 16, align: 16)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !939, file: !11, line: 185, baseType: !120, size: 64, align: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !939, file: !11, line: 186, baseType: !944, size: 64, align: 64, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_sgroup_t", file: !11, line: 133, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_sgroup", file: !11, line: 109, size: 1024, align: 64, elements: !947)
!947 = !{!948, !949, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !985, !986, !987, !988, !989, !990}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !946, file: !11, line: 110, baseType: !120, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !946, file: !11, line: 111, baseType: !950, size: 64, align: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !952, line: 34, baseType: !953)
!952 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !952, line: 30, size: 128, align: 64, elements: !954)
!954 = !{!955, !956, !957}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !953, file: !952, line: 31, baseType: !126, size: 32, align: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !953, file: !952, line: 32, baseType: !126, size: 32, align: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !953, file: !952, line: 33, baseType: !958, size: 64, align: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !946, file: !11, line: 112, baseType: !145, size: 64, align: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_fault", scope: !946, file: !11, line: 113, baseType: !126, size: 32, align: 32, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_init", scope: !946, file: !11, line: 114, baseType: !126, size: 32, align: 32, offset: 224)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !946, file: !11, line: 115, baseType: !119, size: 32, align: 32, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "sgroup_tracking_weight", scope: !946, file: !11, line: 116, baseType: !311, size: 8, align: 8, offset: 288)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !946, file: !11, line: 119, baseType: !145, size: 64, align: 64, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !946, file: !11, line: 120, baseType: !145, size: 64, align: 64, offset: 384)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !946, file: !11, line: 121, baseType: !145, size: 64, align: 64, offset: 448)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "track_bfd", scope: !946, file: !11, line: 122, baseType: !145, size: 64, align: 64, offset: 512)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !946, file: !11, line: 125, baseType: !311, size: 8, align: 8, offset: 576)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !946, file: !11, line: 126, baseType: !970, size: 64, align: 64, offset: 640)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !972, line: 65, baseType: !973)
!972 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !972, line: 59, size: 192, align: 64, elements: !974)
!974 = !{!975, !977, !978, !979, !982}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !973, file: !972, line: 60, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !973, file: !972, line: 61, baseType: !119, size: 32, align: 32, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !973, file: !972, line: 62, baseType: !119, size: 32, align: 32, offset: 96)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !973, file: !972, line: 63, baseType: !980, size: 32, align: 32, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !123, line: 240, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !125, line: 125, baseType: !126)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !973, file: !972, line: 64, baseType: !983, size: 32, align: 32, offset: 160)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !123, line: 235, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !125, line: 126, baseType: !126)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !946, file: !11, line: 127, baseType: !970, size: 64, align: 64, offset: 704)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !946, file: !11, line: 128, baseType: !970, size: 64, align: 64, offset: 768)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !946, file: !11, line: 129, baseType: !970, size: 64, align: 64, offset: 832)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !946, file: !11, line: 130, baseType: !970, size: 64, align: 64, offset: 896)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !946, file: !11, line: 131, baseType: !119, size: 32, align: 32, offset: 960)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !946, file: !11, line: 132, baseType: !119, size: 32, align: 32, offset: 992)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !939, file: !11, line: 187, baseType: !992, size: 64, align: 64, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_stats", file: !11, line: 169, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_stats", file: !11, line: 136, size: 768, align: 64, elements: !995)
!995 = !{!996, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "advert_rcvd", scope: !994, file: !11, line: 137, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !285, line: 55, baseType: !218)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "advert_sent", scope: !994, file: !11, line: 138, baseType: !284, size: 32, align: 32, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "become_master", scope: !994, file: !11, line: 140, baseType: !284, size: 32, align: 32, offset: 96)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "release_master", scope: !994, file: !11, line: 141, baseType: !284, size: 32, align: 32, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "packet_len_err", scope: !994, file: !11, line: 143, baseType: !997, size: 64, align: 64, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "advert_interval_err", scope: !994, file: !11, line: 144, baseType: !997, size: 64, align: 64, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl_err", scope: !994, file: !11, line: 145, baseType: !997, size: 64, align: 64, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_type_rcvd", scope: !994, file: !11, line: 146, baseType: !997, size: 64, align: 64, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list_err", scope: !994, file: !11, line: 147, baseType: !997, size: 64, align: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_authtype", scope: !994, file: !11, line: 149, baseType: !284, size: 32, align: 32, offset: 512)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "authtype_mismatch", scope: !994, file: !11, line: 151, baseType: !284, size: 32, align: 32, offset: 544)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "auth_failure", scope: !994, file: !11, line: 152, baseType: !284, size: 32, align: 32, offset: 576)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_rcvd", scope: !994, file: !11, line: 155, baseType: !997, size: 64, align: 64, offset: 640)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_sent", scope: !994, file: !11, line: 156, baseType: !997, size: 64, align: 64, offset: 704)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !939, file: !11, line: 188, baseType: !277, size: 64, align: 64, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track_primary", scope: !939, file: !11, line: 189, baseType: !311, size: 8, align: 8, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !939, file: !11, line: 190, baseType: !311, size: 8, align: 8, offset: 328)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "skip_check_adv_addr", scope: !939, file: !11, line: 191, baseType: !311, size: 8, align: 8, offset: 336)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "strict_mode", scope: !939, file: !11, line: 193, baseType: !126, size: 32, align: 32, offset: 352)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_flags", scope: !939, file: !11, line: 195, baseType: !218, size: 64, align: 64, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_ifname", scope: !939, file: !11, line: 196, baseType: !233, size: 128, align: 8, offset: 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !939, file: !11, line: 198, baseType: !145, size: 64, align: 64, offset: 576)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !939, file: !11, line: 199, baseType: !145, size: 64, align: 64, offset: 640)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !939, file: !11, line: 200, baseType: !145, size: 64, align: 64, offset: 704)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_if_fault", scope: !939, file: !11, line: 204, baseType: !126, size: 32, align: 32, offset: 768)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_init", scope: !939, file: !11, line: 205, baseType: !126, size: 32, align: 32, offset: 800)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !939, file: !11, line: 206, baseType: !1024, size: 1024, align: 64, offset: 832)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !241, line: 166, size: 1024, align: 64, elements: !1025)
!1025 = !{!1026, !1027, !1031}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !1024, file: !241, line: 168, baseType: !244, size: 16, align: 16)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !1024, file: !241, line: 169, baseType: !1028, size: 944, align: 8, offset: 16)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 944, align: 8, elements: !1029)
!1029 = !{!1030}
!1030 = !DISubrange(count: 118)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !1024, file: !241, line: 170, baseType: !218, size: 64, align: 64, offset: 960)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "saddr_from_config", scope: !939, file: !11, line: 207, baseType: !311, size: 8, align: 8, offset: 1856)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "track_saddr", scope: !939, file: !11, line: 208, baseType: !311, size: 8, align: 8, offset: 1864)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_saddr", scope: !939, file: !11, line: 209, baseType: !1024, size: 1024, align: 64, offset: 1920)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_peer", scope: !939, file: !11, line: 210, baseType: !145, size: 64, align: 64, offset: 2944)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_chksum_compat", scope: !939, file: !11, line: 212, baseType: !1037, size: 32, align: 32, offset: 3008)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "chksum_compatibility_t", file: !11, line: 179, baseType: !10)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "master_saddr", scope: !939, file: !11, line: 214, baseType: !1024, size: 1024, align: 64, offset: 3072)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "master_priority", scope: !939, file: !11, line: 215, baseType: !299, size: 8, align: 8, offset: 4096)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "last_transition", scope: !939, file: !11, line: 216, baseType: !336, size: 128, align: 64, offset: 4160)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !939, file: !11, line: 217, baseType: !126, size: 32, align: 32, offset: 4288)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh", scope: !939, file: !11, line: 218, baseType: !336, size: 128, align: 64, offset: 4352)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_timer", scope: !939, file: !11, line: 219, baseType: !336, size: 128, align: 64, offset: 4480)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "garp_rep", scope: !939, file: !11, line: 220, baseType: !126, size: 32, align: 32, offset: 4608)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_rep", scope: !939, file: !11, line: 221, baseType: !126, size: 32, align: 32, offset: 4640)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_delay", scope: !939, file: !11, line: 222, baseType: !126, size: 32, align: 32, offset: 4672)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "garp_pending", scope: !939, file: !11, line: 223, baseType: !311, size: 8, align: 8, offset: 4704)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "gna_pending", scope: !939, file: !11, line: 224, baseType: !311, size: 8, align: 8, offset: 4712)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_rep", scope: !939, file: !11, line: 225, baseType: !126, size: 32, align: 32, offset: 4736)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "lower_prio_no_advert", scope: !939, file: !11, line: 226, baseType: !126, size: 32, align: 32, offset: 4768)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "higher_prio_send_advert", scope: !939, file: !11, line: 227, baseType: !126, size: 32, align: 32, offset: 4800)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "vrid", scope: !939, file: !11, line: 228, baseType: !299, size: 8, align: 8, offset: 4832)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "base_priority", scope: !939, file: !11, line: 229, baseType: !299, size: 8, align: 8, offset: 4840)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "effective_priority", scope: !939, file: !11, line: 230, baseType: !299, size: 8, align: 8, offset: 4848)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "total_priority", scope: !939, file: !11, line: 231, baseType: !119, size: 32, align: 32, offset: 4864)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "vipset", scope: !939, file: !11, line: 233, baseType: !311, size: 8, align: 8, offset: 4896)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !939, file: !11, line: 234, baseType: !145, size: 64, align: 64, offset: 4928)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "evip", scope: !939, file: !11, line: 235, baseType: !145, size: 64, align: 64, offset: 4992)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries", scope: !939, file: !11, line: 239, baseType: !311, size: 8, align: 8, offset: 5056)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "evip_add_ipv6", scope: !939, file: !11, line: 240, baseType: !311, size: 8, align: 8, offset: 5064)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "vroutes", scope: !939, file: !11, line: 241, baseType: !145, size: 64, align: 64, offset: 5120)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "vrules", scope: !939, file: !11, line: 242, baseType: !145, size: 64, align: 64, offset: 5184)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "adver_int", scope: !939, file: !11, line: 243, baseType: !126, size: 32, align: 32, offset: 5248)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "master_adver_int", scope: !939, file: !11, line: 244, baseType: !126, size: 32, align: 32, offset: 5280)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !939, file: !11, line: 249, baseType: !126, size: 32, align: 32, offset: 5312)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_rx_buf_size", scope: !939, file: !11, line: 252, baseType: !216, size: 64, align: 64, offset: 5376)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rules_set", scope: !939, file: !11, line: 254, baseType: !311, size: 8, align: 8, offset: 5440)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "nopreempt", scope: !939, file: !11, line: 255, baseType: !311, size: 8, align: 8, offset: 5448)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_delay", scope: !939, file: !11, line: 256, baseType: !218, size: 64, align: 64, offset: 5504)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_time", scope: !939, file: !11, line: 260, baseType: !336, size: 128, align: 64, offset: 5568)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !939, file: !11, line: 261, baseType: !119, size: 32, align: 32, offset: 5696)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "wantstate", scope: !939, file: !11, line: 265, baseType: !119, size: 32, align: 32, offset: 5728)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "reload_master", scope: !939, file: !11, line: 266, baseType: !311, size: 8, align: 8, offset: 5760)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "sockets", scope: !939, file: !11, line: 267, baseType: !1075, size: 64, align: 64, offset: 5824)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_t", file: !1077, line: 50, baseType: !1078)
!1077 = !DIFile(filename: "./../include/vrrp_sock.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sock", file: !1077, line: 40, size: 1344, align: 64, elements: !1079)
!1079 = !{!1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1078, file: !1077, line: 41, baseType: !244, size: 16, align: 16)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !1078, file: !1077, line: 42, baseType: !1024, size: 1024, align: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !1078, file: !1077, line: 43, baseType: !119, size: 32, align: 32, offset: 1088)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !1078, file: !1077, line: 44, baseType: !283, size: 32, align: 32, offset: 1120)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "unicast", scope: !1078, file: !1077, line: 45, baseType: !311, size: 8, align: 8, offset: 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "fd_in", scope: !1078, file: !1077, line: 46, baseType: !119, size: 32, align: 32, offset: 1184)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "fd_out", scope: !1078, file: !1077, line: 47, baseType: !119, size: 32, align: 32, offset: 1216)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_size", scope: !1078, file: !1077, line: 48, baseType: !119, size: 32, align: 32, offset: 1248)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !1078, file: !1077, line: 49, baseType: !1089, size: 64, align: 64, offset: 1280)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !19, line: 99, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !19, line: 78, size: 768, align: 64, elements: !1092)
!1092 = !{!1093, !1094, !1096, !1149, !1154, !1155, !1156, !1168, !1170}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1091, file: !19, line: 79, baseType: !218, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1091, file: !19, line: 80, baseType: !1095, size: 32, align: 32, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !19, line: 63, baseType: !18)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !1091, file: !19, line: 81, baseType: !1097, size: 64, align: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !19, line: 112, size: 1280, align: 64, elements: !1099)
!1099 = !{!1100, !1112, !1113, !1114, !1115, !1123, !1124, !1125, !1126, !1127, !1130, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !1098, file: !19, line: 113, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !1102, line: 109, baseType: !1103)
!1102 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !1102, line: 106, size: 64, align: 64, elements: !1104)
!1104 = !{!1105}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !1103, file: !1102, line: 108, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !1102, line: 97, size: 192, align: 64, elements: !1108)
!1108 = !{!1109, !1110, !1111}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !1107, file: !1102, line: 99, baseType: !218, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !1107, file: !1102, line: 102, baseType: !1106, size: 64, align: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !1107, file: !1102, line: 103, baseType: !1106, size: 64, align: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !1098, file: !19, line: 114, baseType: !1101, size: 64, align: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !1098, file: !19, line: 115, baseType: !1101, size: 64, align: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !1098, file: !19, line: 116, baseType: !1101, size: 64, align: 64, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !1098, file: !19, line: 117, baseType: !1116, size: 128, align: 64, offset: 256)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !1117, line: 62, baseType: !1118)
!1117 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !1117, line: 60, size: 128, align: 64, elements: !1119)
!1119 = !{!1120, !1122}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1118, file: !1117, line: 61, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1118, file: !1117, line: 61, baseType: !1121, size: 64, align: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !1098, file: !19, line: 121, baseType: !1116, size: 128, align: 64, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !1098, file: !19, line: 122, baseType: !1116, size: 128, align: 64, offset: 512)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !1098, file: !19, line: 124, baseType: !145, size: 64, align: 64, offset: 640)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !1098, file: !19, line: 127, baseType: !1101, size: 64, align: 64, offset: 704)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !1098, file: !19, line: 128, baseType: !1128, size: 64, align: 64, offset: 768)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !19, line: 128, flags: DIFlagFwdDecl)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !1098, file: !19, line: 129, baseType: !1131, size: 64, align: 64, offset: 832)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !19, line: 109, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !19, line: 102, size: 448, align: 64, elements: !1134)
!1134 = !{!1135, !1136, !1137, !1138, !1139}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !1133, file: !19, line: 103, baseType: !1089, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !1133, file: !19, line: 104, baseType: !1089, size: 64, align: 64, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1133, file: !19, line: 105, baseType: !218, size: 64, align: 64, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1133, file: !19, line: 106, baseType: !119, size: 32, align: 32, offset: 192)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1133, file: !19, line: 108, baseType: !1140, size: 192, align: 64, offset: 256)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !1102, line: 104, baseType: !1107)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !1098, file: !19, line: 130, baseType: !126, size: 32, align: 32, offset: 896)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !1098, file: !19, line: 131, baseType: !126, size: 32, align: 32, offset: 928)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !1098, file: !19, line: 132, baseType: !119, size: 32, align: 32, offset: 960)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !1098, file: !19, line: 135, baseType: !119, size: 32, align: 32, offset: 992)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !1098, file: !19, line: 136, baseType: !1089, size: 64, align: 64, offset: 1024)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1098, file: !19, line: 146, baseType: !218, size: 64, align: 64, offset: 1088)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1098, file: !19, line: 147, baseType: !218, size: 64, align: 64, offset: 1152)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !1098, file: !19, line: 148, baseType: !311, size: 8, align: 8, offset: 1216)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1091, file: !19, line: 82, baseType: !1150, size: 64, align: 64, offset: 192)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!119, !1153}
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1091, file: !19, line: 83, baseType: !118, size: 64, align: 64, offset: 256)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !1091, file: !19, line: 84, baseType: !336, size: 128, align: 64, offset: 320)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1091, file: !19, line: 92, baseType: !1157, size: 64, align: 32, offset: 448)
!1157 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1091, file: !19, line: 85, size: 64, align: 32, elements: !1158)
!1158 = !{!1159, !1160, !1161}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1157, file: !19, line: 86, baseType: !119, size: 32, align: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1157, file: !19, line: 87, baseType: !119, size: 32, align: 32)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1157, file: !19, line: 91, baseType: !1162, size: 64, align: 32)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1157, file: !19, line: 88, size: 64, align: 32, elements: !1163)
!1163 = !{!1164, !1167}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !1162, file: !19, line: 89, baseType: !1165, size: 32, align: 32)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !123, line: 263, baseType: !1166)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !125, line: 133, baseType: !119)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !1162, file: !19, line: 90, baseType: !119, size: 32, align: 32, offset: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !1091, file: !19, line: 93, baseType: !1169, size: 64, align: 64, offset: 512)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, scope: !1091, file: !19, line: 95, baseType: !1171, size: 192, align: 64, offset: 576)
!1171 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1091, file: !19, line: 95, size: 192, align: 64, elements: !1172)
!1172 = !{!1173, !1174}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1171, file: !19, line: 96, baseType: !1140, size: 192, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1171, file: !19, line: 97, baseType: !1116, size: 128, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !939, file: !11, line: 269, baseType: !119, size: 32, align: 32, offset: 5888)
