; ModuleID = './[inter]keepalived--vrrp--vrrp_scheduler.o.i'
source_filename = "./[inter]keepalived--vrrp--vrrp_scheduler.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.timeval = type { i64, i64 }
%struct._thread_master = type { %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.list_head, %struct.list_head, %struct.list_head, %struct._list*, %struct.rb_root, %struct.epoll_event*, %struct._thread_event*, i32, i32, i32, i32, %struct._thread*, i64, i64, i8 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.rb_root = type { %struct.rb_node* }
%struct.rb_node = type { i64, %struct.rb_node*, %struct.rb_node* }
%struct.epoll_event = type opaque
%struct._thread_event = type { %struct._thread*, %struct._thread*, i64, i32, %struct.rb_node }
%struct._thread = type { i64, i32, %struct._thread_master*, i32 (%struct._thread*)*, i8*, %struct.timeval, %union.anon.0, %struct._thread_event*, %union.anon.1 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !286, globals: !324)
!1 = !DIFile(filename: "[inter]keepalived--vrrp--vrrp_scheduler.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!2 = !{!3, !11, !32, !47, !239, !245, !274, !281}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chksum_compatibility", file: !4, line: 173, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./../include/vrrp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NONE", value: 0)
!7 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NEVER", value: 1)
!8 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_MIN_COMPAT", value: 2)
!9 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_CONFIG", value: 3)
!10 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_AUTO", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 41, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "../../lib/scheduler.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!14 = !DIEnumerator(name: "THREAD_READ", value: 0)
!15 = !DIEnumerator(name: "THREAD_WRITE", value: 1)
!16 = !DIEnumerator(name: "THREAD_TIMER", value: 2)
!17 = !DIEnumerator(name: "THREAD_TIMER_SHUTDOWN", value: 3)
!18 = !DIEnumerator(name: "THREAD_EVENT", value: 4)
!19 = !DIEnumerator(name: "THREAD_CHILD", value: 5)
!20 = !DIEnumerator(name: "THREAD_READY", value: 6)
!21 = !DIEnumerator(name: "THREAD_UNUSED", value: 7)
!22 = !DIEnumerator(name: "THREAD_WRITE_TIMEOUT", value: 8)
!23 = !DIEnumerator(name: "THREAD_READ_TIMEOUT", value: 9)
!24 = !DIEnumerator(name: "THREAD_CHILD_TIMEOUT", value: 10)
!25 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!26 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!27 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!28 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!29 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!30 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!31 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "global_bits", file: !33, line: 53, size: 32, align: 32, elements: !34)
!33 = !DIFile(filename: "../../lib/bitops.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!35 = !DIEnumerator(name: "LOG_CONSOLE_BIT", value: 0)
!36 = !DIEnumerator(name: "NO_SYSLOG_BIT", value: 1)
!37 = !DIEnumerator(name: "DONT_FORK_BIT", value: 2)
!38 = !DIEnumerator(name: "DUMP_CONF_BIT", value: 3)
!39 = !DIEnumerator(name: "DONT_RELEASE_VRRP_BIT", value: 4)
!40 = !DIEnumerator(name: "RELEASE_VIPS_BIT", value: 5)
!41 = !DIEnumerator(name: "DONT_RELEASE_IPVS_BIT", value: 6)
!42 = !DIEnumerator(name: "LOG_DETAIL_BIT", value: 7)
!43 = !DIEnumerator(name: "LOG_EXTRA_DETAIL_BIT", value: 8)
!44 = !DIEnumerator(name: "DONT_RESPAWN_BIT", value: 9)
!45 = !DIEnumerator(name: "LOG_ADDRESS_CHANGES", value: 10)
!46 = !DIEnumerator(name: "CONFIG_TEST_BIT", value: 11)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !49, file: !48, line: 1146, size: 32, align: 32, elements: !236)
!48 = !DIFile(filename: "vrrp_scheduler.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!49 = distinct !DISubprogram(name: "vrrp_arp_thread", scope: !48, file: !48, line: 1136, type: !50, isLocal: false, isDefinition: true, scopeLine: 1137, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !235)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !53}
!52 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !12, line: 99, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !12, line: 78, size: 768, align: 64, elements: !56)
!56 = !{!57, !59, !61, !199, !204, !205, !215, !228, !230}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !55, file: !12, line: 79, baseType: !58, size: 64, align: 64)
!58 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !55, file: !12, line: 80, baseType: !60, size: 32, align: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !12, line: 63, baseType: !11)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !55, file: !12, line: 81, baseType: !62, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !12, line: 112, size: 1280, align: 64, elements: !64)
!64 = !{!65, !77, !78, !79, !80, !88, !89, !90, !175, !176, !179, !190, !191, !192, !193, !194, !195, !196, !197}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !63, file: !12, line: 113, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !67, line: 109, baseType: !68)
!67 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !67, line: 106, size: 64, align: 64, elements: !69)
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !68, file: !67, line: 108, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !67, line: 97, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !76}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !72, file: !67, line: 99, baseType: !58, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !72, file: !67, line: 102, baseType: !71, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !72, file: !67, line: 103, baseType: !71, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !63, file: !12, line: 114, baseType: !66, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !63, file: !12, line: 115, baseType: !66, size: 64, align: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !63, file: !12, line: 116, baseType: !66, size: 64, align: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !63, file: !12, line: 117, baseType: !81, size: 128, align: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !82, line: 62, baseType: !83)
!82 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !82, line: 60, size: 128, align: 64, elements: !84)
!84 = !{!85, !87}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !83, file: !82, line: 61, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !83, file: !82, line: 61, baseType: !86, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !63, file: !12, line: 121, baseType: !81, size: 128, align: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !63, file: !12, line: 122, baseType: !81, size: 128, align: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !63, file: !12, line: 124, baseType: !91, size: 64, align: 64, offset: 640)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !92, line: 31, baseType: !93)
!92 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !92, line: 39, size: 320, align: 64, elements: !95)
!95 = !{!96, !104, !105, !107, !111}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !94, file: !92, line: 40, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !92, line: 33, size: 192, align: 64, elements: !99)
!99 = !{!100, !101, !102}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !92, line: 34, baseType: !97, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !98, file: !92, line: 35, baseType: !97, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !98, file: !92, line: 36, baseType: !103, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !94, file: !92, line: 41, baseType: !97, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !94, file: !92, line: 42, baseType: !106, size: 32, align: 32, offset: 128)
!106 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !94, file: !92, line: 43, baseType: !108, size: 64, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !103}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !94, file: !92, line: 44, baseType: !112, size: 64, align: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !115, !103}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !117, line: 48, baseType: !118)
!117 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !119, line: 241, size: 1728, align: 64, elements: !120)
!119 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!120 = !{!121, !122, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !143, !144, !145, !146, !150, !152, !154, !158, !161, !163, !164, !165, !166, !167, !170, !171}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !118, file: !119, line: 242, baseType: !52, size: 32, align: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !118, file: !119, line: 247, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !118, file: !119, line: 248, baseType: !123, size: 64, align: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !118, file: !119, line: 249, baseType: !123, size: 64, align: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !118, file: !119, line: 250, baseType: !123, size: 64, align: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !118, file: !119, line: 251, baseType: !123, size: 64, align: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !118, file: !119, line: 252, baseType: !123, size: 64, align: 64, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !118, file: !119, line: 253, baseType: !123, size: 64, align: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !118, file: !119, line: 254, baseType: !123, size: 64, align: 64, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !118, file: !119, line: 256, baseType: !123, size: 64, align: 64, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !118, file: !119, line: 257, baseType: !123, size: 64, align: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !118, file: !119, line: 258, baseType: !123, size: 64, align: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !118, file: !119, line: 260, baseType: !136, size: 64, align: 64, offset: 768)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !119, line: 156, size: 192, align: 64, elements: !138)
!138 = !{!139, !140, !142}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !137, file: !119, line: 157, baseType: !136, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !137, file: !119, line: 158, baseType: !141, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !137, file: !119, line: 162, baseType: !52, size: 32, align: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !118, file: !119, line: 262, baseType: !141, size: 64, align: 64, offset: 832)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !118, file: !119, line: 264, baseType: !52, size: 32, align: 32, offset: 896)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !118, file: !119, line: 268, baseType: !52, size: 32, align: 32, offset: 928)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !118, file: !119, line: 270, baseType: !147, size: 64, align: 64, offset: 960)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !148, line: 131, baseType: !149)
!148 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!149 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !118, file: !119, line: 274, baseType: !151, size: 16, align: 16, offset: 1024)
!151 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !118, file: !119, line: 275, baseType: !153, size: 8, align: 8, offset: 1040)
!153 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !118, file: !119, line: 276, baseType: !155, size: 8, align: 8, offset: 1048)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 8, align: 8, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 1)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !118, file: !119, line: 280, baseType: !159, size: 64, align: 64, offset: 1088)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !119, line: 150, baseType: null)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !118, file: !119, line: 289, baseType: !162, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !148, line: 132, baseType: !149)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !118, file: !119, line: 297, baseType: !103, size: 64, align: 64, offset: 1216)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !118, file: !119, line: 298, baseType: !103, size: 64, align: 64, offset: 1280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !118, file: !119, line: 299, baseType: !103, size: 64, align: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !118, file: !119, line: 300, baseType: !103, size: 64, align: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !118, file: !119, line: 302, baseType: !168, size: 64, align: 64, offset: 1472)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !169, line: 216, baseType: !58)
!169 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !118, file: !119, line: 303, baseType: !52, size: 32, align: 32, offset: 1536)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !118, file: !119, line: 305, baseType: !172, size: 160, align: 8, offset: 1568)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 160, align: 8, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 20)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !63, file: !12, line: 127, baseType: !66, size: 64, align: 64, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !63, file: !12, line: 128, baseType: !177, size: 64, align: 64, offset: 768)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !12, line: 128, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !63, file: !12, line: 129, baseType: !180, size: 64, align: 64, offset: 832)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !12, line: 109, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !12, line: 102, size: 448, align: 64, elements: !183)
!183 = !{!184, !185, !186, !187, !188}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !182, file: !12, line: 103, baseType: !53, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !182, file: !12, line: 104, baseType: !53, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !182, file: !12, line: 105, baseType: !58, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !182, file: !12, line: 106, baseType: !52, size: 32, align: 32, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !182, file: !12, line: 108, baseType: !189, size: 192, align: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !67, line: 104, baseType: !72)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !63, file: !12, line: 130, baseType: !106, size: 32, align: 32, offset: 896)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !63, file: !12, line: 131, baseType: !106, size: 32, align: 32, offset: 928)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !63, file: !12, line: 132, baseType: !52, size: 32, align: 32, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !63, file: !12, line: 135, baseType: !52, size: 32, align: 32, offset: 992)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !63, file: !12, line: 136, baseType: !53, size: 64, align: 64, offset: 1024)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !63, file: !12, line: 146, baseType: !58, size: 64, align: 64, offset: 1088)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !63, file: !12, line: 147, baseType: !58, size: 64, align: 64, offset: 1152)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !63, file: !12, line: 148, baseType: !198, size: 8, align: 8, offset: 1216)
!198 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !55, file: !12, line: 82, baseType: !200, size: 64, align: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!52, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !55, file: !12, line: 83, baseType: !103, size: 64, align: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !55, file: !12, line: 84, baseType: !206, size: 128, align: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !207, line: 31, baseType: !208)
!207 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !209, line: 30, size: 128, align: 64, elements: !210)
!209 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!210 = !{!211, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !208, file: !209, line: 32, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !148, line: 139, baseType: !149)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !208, file: !209, line: 33, baseType: !214, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !148, line: 141, baseType: !149)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !55, file: !12, line: 92, baseType: !216, size: 64, align: 32, offset: 448)
!216 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !55, file: !12, line: 85, size: 64, align: 32, elements: !217)
!217 = !{!218, !219, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !216, file: !12, line: 86, baseType: !52, size: 32, align: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !216, file: !12, line: 87, baseType: !52, size: 32, align: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !216, file: !12, line: 91, baseType: !221, size: 64, align: 32)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !216, file: !12, line: 88, size: 64, align: 32, elements: !222)
!222 = !{!223, !227}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !221, file: !12, line: 89, baseType: !224, size: 32, align: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !225, line: 98, baseType: !226)
!225 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !148, line: 133, baseType: !52)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !221, file: !12, line: 90, baseType: !52, size: 32, align: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !55, file: !12, line: 93, baseType: !229, size: 64, align: 64, offset: 512)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, scope: !55, file: !12, line: 95, baseType: !231, size: 192, align: 64, offset: 576)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !55, file: !12, line: 95, size: 192, align: 64, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !231, file: !12, line: 96, baseType: !189, size: 192, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !231, file: !12, line: 97, baseType: !81, size: 128, align: 64)
!235 = !{}
!236 = !{!237, !238}
!237 = !DIEnumerator(name: "VIP", value: 0)
!238 = !DIEnumerator(name: "EVIP", value: 1)
!239 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vrrp_vmac_bits", file: !240, line: 40, size: 32, align: 32, elements: !241)
!240 = !DIFile(filename: "./../include/vrrp_vmac.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!241 = !{!242, !243, !244}
!242 = !DIEnumerator(name: "VRRP_VMAC_BIT", value: 0)
!243 = !DIEnumerator(name: "VRRP_VMAC_UP_BIT", value: 1)
!244 = !DIEnumerator(name: "VRRP_VMAC_XMITBASE_BIT", value: 2)
!245 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !246, line: 40, size: 32, align: 32, elements: !247)
!246 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273}
!248 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!249 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!250 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!251 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!252 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!253 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!254 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!255 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!256 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!257 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!258 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!259 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!260 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!261 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!262 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!263 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!264 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!265 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!266 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!267 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!268 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!269 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!270 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!271 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!272 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!273 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !275, line: 45, size: 32, align: 32, elements: !276)
!275 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!276 = !{!277, !278, !279, !280}
!277 = !DIEnumerator(name: "SCRIPT_STATE_IDLE", value: 0)
!278 = !DIEnumerator(name: "SCRIPT_STATE_RUNNING", value: 1)
!279 = !DIEnumerator(name: "SCRIPT_STATE_REQUESTING_TERMINATION", value: 2)
!280 = !DIEnumerator(name: "SCRIPT_STATE_FORCING_TERMINATION", value: 3)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !275, line: 52, size: 32, align: 32, elements: !282)
!282 = !{!283, !284, !285}
!283 = !DIEnumerator(name: "SCRIPT_INIT_STATE_DONE", value: 0)
!284 = !DIEnumerator(name: "SCRIPT_INIT_STATE_INIT", value: 1)
!285 = !DIEnumerator(name: "SCRIPT_INIT_STATE_FAILED", value: 2)
!286 = !{!103, !287, !52, !153, !316, !58}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_t", file: !289, line: 50, baseType: !290)
!289 = !DIFile(filename: "./../include/vrrp_sock.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sock", file: !289, line: 40, size: 1344, align: 64, elements: !291)
!291 = !{!292, !295, !305, !306, !311, !312, !313, !314, !315}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !290, file: !289, line: 41, baseType: !293, size: 16, align: 16)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !294, line: 28, baseType: !151)
!294 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!295 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !290, file: !289, line: 42, baseType: !296, size: 1024, align: 64, offset: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !297, line: 166, size: 1024, align: 64, elements: !298)
!297 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!298 = !{!299, !300, !304}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !296, file: !297, line: 168, baseType: !293, size: 16, align: 16)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !296, file: !297, line: 169, baseType: !301, size: 944, align: 8, offset: 16)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 944, align: 8, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 118)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !296, file: !297, line: 170, baseType: !58, size: 64, align: 64, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !290, file: !289, line: 43, baseType: !52, size: 32, align: 32, offset: 1088)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !290, file: !289, line: 44, baseType: !307, size: 32, align: 32, offset: 1120)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !308, line: 62, baseType: !309)
!308 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !310, line: 51, baseType: !106)
!310 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!311 = !DIDerivedType(tag: DW_TAG_member, name: "unicast", scope: !290, file: !289, line: 45, baseType: !198, size: 8, align: 8, offset: 1152)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "fd_in", scope: !290, file: !289, line: 46, baseType: !52, size: 32, align: 32, offset: 1184)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "fd_out", scope: !290, file: !289, line: 47, baseType: !52, size: 32, align: 32, offset: 1216)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_size", scope: !290, file: !289, line: 48, baseType: !52, size: 32, align: 32, offset: 1248)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !290, file: !289, line: 49, baseType: !53, size: 64, align: 64, offset: 1280)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !297, line: 153, size: 128, align: 16, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !317, file: !297, line: 155, baseType: !293, size: 16, align: 16)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !317, file: !297, line: 156, baseType: !321, size: 112, align: 8, offset: 16)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 112, align: 8, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 14)
!324 = !{!325, !326, !327, !328, !329}
!325 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !308, line: 150, type: !91, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!326 = distinct !DIGlobalVariable(name: "garp_next_time", scope: !0, file: !48, line: 67, type: !206, isLocal: false, isDefinition: true, variable: %struct.timeval* @garp_next_time)
!327 = distinct !DIGlobalVariable(name: "garp_thread", scope: !0, file: !48, line: 68, type: !53, isLocal: false, isDefinition: true, variable: %struct._thread** @garp_thread)
!328 = distinct !DIGlobalVariable(name: "vrrp_initialised", scope: !0, file: !48, line: 69, type: !198, isLocal: false, isDefinition: true, variable: i8* @vrrp_initialised)
!329 = distinct !DIGlobalVariable(name: "VRRP_TSM", scope: !0, file: !48, line: 154, type: !330, isLocal: true, isDefinition: true, variable: [4 x [4 x %struct.anon.13]]* @VRRP_TSM)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 1024, align: 64, elements: !566)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !48, line: 152, size: 64, align: 64, elements: !332)
!332 = !{!333}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !331, file: !48, line: 153, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !337}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_t", file: !4, line: 310, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_t", file: !4, line: 183, size: 7040, align: 64, elements: !340)
!340 = !{!341, !342, !343, !390, !410, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !558, !565}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !339, file: !4, line: 184, baseType: !293, size: 16, align: 16)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !339, file: !4, line: 185, baseType: !123, size: 64, align: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !339, file: !4, line: 186, baseType: !344, size: 64, align: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_sgroup_t", file: !4, line: 133, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_sgroup", file: !4, line: 109, size: 1024, align: 64, elements: !347)
!347 = !{!348, !349, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !384, !385, !386, !387, !388, !389}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !346, file: !4, line: 110, baseType: !123, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !346, file: !4, line: 111, baseType: !350, size: 64, align: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !352, line: 34, baseType: !353)
!352 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !352, line: 30, size: 128, align: 64, elements: !354)
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !353, file: !352, line: 31, baseType: !106, size: 32, align: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !353, file: !352, line: 32, baseType: !106, size: 32, align: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !353, file: !352, line: 33, baseType: !358, size: 64, align: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !346, file: !4, line: 112, baseType: !91, size: 64, align: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_fault", scope: !346, file: !4, line: 113, baseType: !106, size: 32, align: 32, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_init", scope: !346, file: !4, line: 114, baseType: !106, size: 32, align: 32, offset: 224)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !346, file: !4, line: 115, baseType: !52, size: 32, align: 32, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sgroup_tracking_weight", scope: !346, file: !4, line: 116, baseType: !198, size: 8, align: 8, offset: 288)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !346, file: !4, line: 119, baseType: !91, size: 64, align: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !346, file: !4, line: 120, baseType: !91, size: 64, align: 64, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !346, file: !4, line: 121, baseType: !91, size: 64, align: 64, offset: 448)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "track_bfd", scope: !346, file: !4, line: 122, baseType: !91, size: 64, align: 64, offset: 512)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !346, file: !4, line: 125, baseType: !198, size: 8, align: 8, offset: 576)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !346, file: !4, line: 126, baseType: !370, size: 64, align: 64, offset: 640)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !275, line: 65, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !275, line: 59, size: 192, align: 64, elements: !373)
!373 = !{!374, !376, !377, !378, !381}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !372, file: !275, line: 60, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !372, file: !275, line: 61, baseType: !52, size: 32, align: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !372, file: !275, line: 62, baseType: !52, size: 32, align: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !372, file: !275, line: 63, baseType: !379, size: 32, align: 32, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !225, line: 80, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !148, line: 125, baseType: !106)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !372, file: !275, line: 64, baseType: !382, size: 32, align: 32, offset: 160)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !225, line: 65, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !148, line: 126, baseType: !106)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !346, file: !4, line: 127, baseType: !370, size: 64, align: 64, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !346, file: !4, line: 128, baseType: !370, size: 64, align: 64, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !346, file: !4, line: 129, baseType: !370, size: 64, align: 64, offset: 832)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !346, file: !4, line: 130, baseType: !370, size: 64, align: 64, offset: 896)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !346, file: !4, line: 131, baseType: !52, size: 32, align: 32, offset: 960)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !346, file: !4, line: 132, baseType: !52, size: 32, align: 32, offset: 992)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !339, file: !4, line: 187, baseType: !391, size: 64, align: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_stats", file: !4, line: 169, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_stats", file: !4, line: 136, size: 768, align: 64, elements: !394)
!394 = !{!395, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "advert_rcvd", scope: !393, file: !4, line: 137, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !310, line: 55, baseType: !58)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "advert_sent", scope: !393, file: !4, line: 138, baseType: !309, size: 32, align: 32, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "become_master", scope: !393, file: !4, line: 140, baseType: !309, size: 32, align: 32, offset: 96)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "release_master", scope: !393, file: !4, line: 141, baseType: !309, size: 32, align: 32, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "packet_len_err", scope: !393, file: !4, line: 143, baseType: !396, size: 64, align: 64, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "advert_interval_err", scope: !393, file: !4, line: 144, baseType: !396, size: 64, align: 64, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl_err", scope: !393, file: !4, line: 145, baseType: !396, size: 64, align: 64, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_type_rcvd", scope: !393, file: !4, line: 146, baseType: !396, size: 64, align: 64, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list_err", scope: !393, file: !4, line: 147, baseType: !396, size: 64, align: 64, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_authtype", scope: !393, file: !4, line: 149, baseType: !309, size: 32, align: 32, offset: 512)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "authtype_mismatch", scope: !393, file: !4, line: 151, baseType: !309, size: 32, align: 32, offset: 544)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "auth_failure", scope: !393, file: !4, line: 152, baseType: !309, size: 32, align: 32, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_rcvd", scope: !393, file: !4, line: 155, baseType: !396, size: 64, align: 64, offset: 640)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_sent", scope: !393, file: !4, line: 156, baseType: !396, size: 64, align: 64, offset: 704)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !339, file: !4, line: 188, baseType: !411, size: 64, align: 64, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !308, line: 111, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !308, line: 76, size: 1792, align: 64, elements: !414)
!414 = !{!415, !419, !420, !425, !444, !445, !446, !447, !448, !454, !455, !456, !457, !458, !459, !461, !462, !463, !464, !476, !477, !478, !479, !480, !481, !482, !483}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !413, file: !308, line: 77, baseType: !416, size: 128, align: 8)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 128, align: 8, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 16)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !413, file: !308, line: 78, baseType: !307, size: 32, align: 32, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !413, file: !308, line: 79, baseType: !421, size: 32, align: 32, offset: 160)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !246, line: 31, size: 32, align: 32, elements: !422)
!422 = !{!423}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !421, file: !246, line: 33, baseType: !424, size: 32, align: 32)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !246, line: 30, baseType: !309)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !413, file: !308, line: 80, baseType: !426, size: 128, align: 32, offset: 192)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !246, line: 211, size: 128, align: 32, elements: !427)
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !426, file: !246, line: 220, baseType: !429, size: 128, align: 32)
!429 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !426, file: !246, line: 213, size: 128, align: 32, elements: !430)
!430 = !{!431, !435, !440}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !429, file: !246, line: 215, baseType: !432, size: 128, align: 8)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 128, align: 8, elements: !417)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !310, line: 48, baseType: !434)
!434 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !429, file: !246, line: 217, baseType: !436, size: 128, align: 16)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 128, align: 16, elements: !438)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !310, line: 49, baseType: !151)
!438 = !{!439}
!439 = !DISubrange(count: 8)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !429, file: !246, line: 218, baseType: !441, size: 128, align: 32)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 128, align: 32, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 4)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !413, file: !308, line: 81, baseType: !106, size: 32, align: 32, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !413, file: !308, line: 82, baseType: !198, size: 8, align: 8, offset: 352)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !413, file: !308, line: 83, baseType: !309, size: 32, align: 32, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !413, file: !308, line: 84, baseType: !151, size: 16, align: 16, offset: 416)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !413, file: !308, line: 85, baseType: !449, size: 256, align: 8, offset: 432)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 256, align: 8, elements: !452)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !225, line: 33, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !148, line: 30, baseType: !434)
!452 = !{!453}
!453 = !DISubrange(count: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !413, file: !308, line: 86, baseType: !449, size: 256, align: 8, offset: 688)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !413, file: !308, line: 87, baseType: !168, size: 64, align: 64, offset: 960)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !413, file: !308, line: 88, baseType: !52, size: 32, align: 32, offset: 1024)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !413, file: !308, line: 90, baseType: !198, size: 8, align: 8, offset: 1056)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !413, file: !308, line: 91, baseType: !307, size: 32, align: 32, offset: 1088)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !413, file: !308, line: 92, baseType: !460, size: 64, align: 64, offset: 1152)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !413, file: !308, line: 94, baseType: !307, size: 32, align: 32, offset: 1216)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !413, file: !308, line: 96, baseType: !460, size: 64, align: 64, offset: 1280)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !413, file: !308, line: 97, baseType: !198, size: 8, align: 8, offset: 1344)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !413, file: !308, line: 100, baseType: !465, size: 64, align: 64, offset: 1408)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !308, line: 73, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !308, line: 65, size: 704, align: 64, elements: !468)
!468 = !{!469, !470, !471, !472, !473, !474, !475}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !467, file: !308, line: 66, baseType: !206, size: 128, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !467, file: !308, line: 67, baseType: !198, size: 8, align: 8, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !467, file: !308, line: 68, baseType: !206, size: 128, align: 64, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !467, file: !308, line: 69, baseType: !198, size: 8, align: 8, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !467, file: !308, line: 70, baseType: !206, size: 128, align: 64, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !467, file: !308, line: 71, baseType: !206, size: 128, align: 64, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !467, file: !308, line: 72, baseType: !52, size: 32, align: 32, offset: 640)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !413, file: !308, line: 101, baseType: !198, size: 8, align: 8, offset: 1472)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !413, file: !308, line: 102, baseType: !52, size: 32, align: 32, offset: 1504)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !413, file: !308, line: 103, baseType: !309, size: 32, align: 32, offset: 1536)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !413, file: !308, line: 104, baseType: !309, size: 32, align: 32, offset: 1568)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !413, file: !308, line: 105, baseType: !309, size: 32, align: 32, offset: 1600)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !413, file: !308, line: 107, baseType: !106, size: 32, align: 32, offset: 1632)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !413, file: !308, line: 109, baseType: !198, size: 8, align: 8, offset: 1664)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !413, file: !308, line: 110, baseType: !91, size: 64, align: 64, offset: 1728)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track_primary", scope: !339, file: !4, line: 189, baseType: !198, size: 8, align: 8, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !339, file: !4, line: 190, baseType: !198, size: 8, align: 8, offset: 328)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "skip_check_adv_addr", scope: !339, file: !4, line: 191, baseType: !198, size: 8, align: 8, offset: 336)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "strict_mode", scope: !339, file: !4, line: 193, baseType: !106, size: 32, align: 32, offset: 352)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_flags", scope: !339, file: !4, line: 195, baseType: !58, size: 64, align: 64, offset: 384)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_ifname", scope: !339, file: !4, line: 196, baseType: !416, size: 128, align: 8, offset: 448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !339, file: !4, line: 198, baseType: !91, size: 64, align: 64, offset: 576)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !339, file: !4, line: 199, baseType: !91, size: 64, align: 64, offset: 640)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !339, file: !4, line: 200, baseType: !91, size: 64, align: 64, offset: 704)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_if_fault", scope: !339, file: !4, line: 204, baseType: !106, size: 32, align: 32, offset: 768)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_init", scope: !339, file: !4, line: 205, baseType: !106, size: 32, align: 32, offset: 800)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !339, file: !4, line: 206, baseType: !296, size: 1024, align: 64, offset: 832)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "saddr_from_config", scope: !339, file: !4, line: 207, baseType: !198, size: 8, align: 8, offset: 1856)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "track_saddr", scope: !339, file: !4, line: 208, baseType: !198, size: 8, align: 8, offset: 1864)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_saddr", scope: !339, file: !4, line: 209, baseType: !296, size: 1024, align: 64, offset: 1920)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_peer", scope: !339, file: !4, line: 210, baseType: !91, size: 64, align: 64, offset: 2944)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_chksum_compat", scope: !339, file: !4, line: 212, baseType: !501, size: 32, align: 32, offset: 3008)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "chksum_compatibility_t", file: !4, line: 179, baseType: !3)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "master_saddr", scope: !339, file: !4, line: 214, baseType: !296, size: 1024, align: 64, offset: 3072)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "master_priority", scope: !339, file: !4, line: 215, baseType: !433, size: 8, align: 8, offset: 4096)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "last_transition", scope: !339, file: !4, line: 216, baseType: !206, size: 128, align: 64, offset: 4160)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !339, file: !4, line: 217, baseType: !106, size: 32, align: 32, offset: 4288)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh", scope: !339, file: !4, line: 218, baseType: !206, size: 128, align: 64, offset: 4352)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_timer", scope: !339, file: !4, line: 219, baseType: !206, size: 128, align: 64, offset: 4480)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "garp_rep", scope: !339, file: !4, line: 220, baseType: !106, size: 32, align: 32, offset: 4608)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_rep", scope: !339, file: !4, line: 221, baseType: !106, size: 32, align: 32, offset: 4640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_delay", scope: !339, file: !4, line: 222, baseType: !106, size: 32, align: 32, offset: 4672)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "garp_pending", scope: !339, file: !4, line: 223, baseType: !198, size: 8, align: 8, offset: 4704)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "gna_pending", scope: !339, file: !4, line: 224, baseType: !198, size: 8, align: 8, offset: 4712)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_rep", scope: !339, file: !4, line: 225, baseType: !106, size: 32, align: 32, offset: 4736)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lower_prio_no_advert", scope: !339, file: !4, line: 226, baseType: !106, size: 32, align: 32, offset: 4768)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "higher_prio_send_advert", scope: !339, file: !4, line: 227, baseType: !106, size: 32, align: 32, offset: 4800)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "vrid", scope: !339, file: !4, line: 228, baseType: !433, size: 8, align: 8, offset: 4832)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "base_priority", scope: !339, file: !4, line: 229, baseType: !433, size: 8, align: 8, offset: 4840)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "effective_priority", scope: !339, file: !4, line: 230, baseType: !433, size: 8, align: 8, offset: 4848)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "total_priority", scope: !339, file: !4, line: 231, baseType: !52, size: 32, align: 32, offset: 4864)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "vipset", scope: !339, file: !4, line: 233, baseType: !198, size: 8, align: 8, offset: 4896)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !339, file: !4, line: 234, baseType: !91, size: 64, align: 64, offset: 4928)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "evip", scope: !339, file: !4, line: 235, baseType: !91, size: 64, align: 64, offset: 4992)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries", scope: !339, file: !4, line: 239, baseType: !198, size: 8, align: 8, offset: 5056)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "evip_add_ipv6", scope: !339, file: !4, line: 240, baseType: !198, size: 8, align: 8, offset: 5064)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "vroutes", scope: !339, file: !4, line: 241, baseType: !91, size: 64, align: 64, offset: 5120)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "vrules", scope: !339, file: !4, line: 242, baseType: !91, size: 64, align: 64, offset: 5184)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "adver_int", scope: !339, file: !4, line: 243, baseType: !106, size: 32, align: 32, offset: 5248)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "master_adver_int", scope: !339, file: !4, line: 244, baseType: !106, size: 32, align: 32, offset: 5280)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !339, file: !4, line: 249, baseType: !106, size: 32, align: 32, offset: 5312)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_rx_buf_size", scope: !339, file: !4, line: 252, baseType: !168, size: 64, align: 64, offset: 5376)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rules_set", scope: !339, file: !4, line: 254, baseType: !198, size: 8, align: 8, offset: 5440)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "nopreempt", scope: !339, file: !4, line: 255, baseType: !198, size: 8, align: 8, offset: 5448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_delay", scope: !339, file: !4, line: 256, baseType: !58, size: 64, align: 64, offset: 5504)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_time", scope: !339, file: !4, line: 260, baseType: !206, size: 128, align: 64, offset: 5568)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !339, file: !4, line: 261, baseType: !52, size: 32, align: 32, offset: 5696)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "wantstate", scope: !339, file: !4, line: 265, baseType: !52, size: 32, align: 32, offset: 5728)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "reload_master", scope: !339, file: !4, line: 266, baseType: !198, size: 8, align: 8, offset: 5760)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sockets", scope: !339, file: !4, line: 267, baseType: !287, size: 64, align: 64, offset: 5824)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !339, file: !4, line: 269, baseType: !52, size: 32, align: 32, offset: 5888)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !339, file: !4, line: 271, baseType: !52, size: 32, align: 32, offset: 5920)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !339, file: !4, line: 274, baseType: !52, size: 32, align: 32, offset: 5952)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !339, file: !4, line: 275, baseType: !52, size: 32, align: 32, offset: 5984)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !339, file: !4, line: 276, baseType: !198, size: 8, align: 8, offset: 6016)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !339, file: !4, line: 277, baseType: !370, size: 64, align: 64, offset: 6080)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !339, file: !4, line: 278, baseType: !370, size: 64, align: 64, offset: 6144)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !339, file: !4, line: 279, baseType: !370, size: 64, align: 64, offset: 6208)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !339, file: !4, line: 280, baseType: !370, size: 64, align: 64, offset: 6272)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "script_master_rx_lower_pri", scope: !339, file: !4, line: 281, baseType: !370, size: 64, align: 64, offset: 6336)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !339, file: !4, line: 282, baseType: !370, size: 64, align: 64, offset: 6400)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ms_down_timer", scope: !339, file: !4, line: 285, baseType: !309, size: 32, align: 32, offset: 6464)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !339, file: !4, line: 286, baseType: !206, size: 128, align: 64, offset: 6528)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !339, file: !4, line: 289, baseType: !123, size: 64, align: 64, offset: 6656)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer_size", scope: !339, file: !4, line: 290, baseType: !168, size: 64, align: 64, offset: 6720)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_csum", scope: !339, file: !4, line: 291, baseType: !309, size: 32, align: 32, offset: 6784)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "auth_type", scope: !339, file: !4, line: 295, baseType: !433, size: 8, align: 8, offset: 6816)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "auth_data", scope: !339, file: !4, line: 296, baseType: !557, size: 64, align: 8, offset: 6824)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 64, align: 8, elements: !438)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ipsecah_counter", scope: !339, file: !4, line: 299, baseType: !559, size: 64, align: 32, offset: 6912)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_counter_t", file: !560, line: 58, baseType: !561)
!560 = !DIFile(filename: "./../include/vrrp_ipsecah.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seq_counter", file: !560, line: 55, size: 64, align: 32, elements: !562)
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !561, file: !560, line: 56, baseType: !198, size: 8, align: 8)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "seq_number", scope: !561, file: !560, line: 57, baseType: !309, size: 32, align: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !339, file: !4, line: 309, baseType: !52, size: 32, align: 32, offset: 6976)
!566 = !{!443, !443}
!567 = !{i32 2, !"Dwarf Version", i32 4}
!568 = !{i32 2, !"Debug Info Version", i32 3}
!569 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!570 = distinct !DISubprogram(name: "vrrp_init_instance_sands", scope: !48, file: !48, line: 272, type: !335, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !235)
!571 = !DILocalVariable(name: "vrrp", arg: 1, scope: !570, file: !48, line: 272, type: !337)
!572 = !DIExpression()
!573 = !DILocation(line: 272, column: 35, scope: !570)
!574 = !DILocation(line: 274, column: 2, scope: !570)
!575 = !DILocation(line: 276, column: 6, scope: !576)
!576 = distinct !DILexicalBlock(scope: !570, file: !48, line: 276, column: 6)
!577 = !DILocation(line: 276, column: 12, scope: !576)
!578 = !DILocation(line: 276, column: 18, scope: !576)
!579 = !DILocation(line: 276, column: 6, scope: !570)
!580 = !DILocation(line: 277, column: 7, scope: !581)
!581 = distinct !DILexicalBlock(scope: !582, file: !48, line: 277, column: 7)
!582 = distinct !DILexicalBlock(scope: !576, file: !48, line: 276, column: 24)
!583 = !DILocation(line: 277, column: 13, scope: !581)
!584 = !DILocation(line: 277, column: 7, scope: !582)
!585 = !DILocation(line: 278, column: 4, scope: !581)
!586 = !DILocation(line: 278, column: 10, scope: !581)
!587 = !DILocation(line: 278, column: 18, scope: !581)
!588 = !DILocation(line: 280, column: 4, scope: !581)
!589 = !DILocation(line: 280, column: 10, scope: !581)
!590 = !DILocation(line: 280, column: 43, scope: !581)
!591 = !DILocation(line: 280, column: 49, scope: !581)
!592 = !DILocation(line: 280, column: 18, scope: !581)
!593 = !DILocation(line: 280, column: 18, scope: !594)
!594 = !DILexicalBlockFile(scope: !581, file: !48, discriminator: 1)
!595 = !DILocation(line: 281, column: 2, scope: !582)
!596 = !DILocation(line: 282, column: 11, scope: !597)
!597 = distinct !DILexicalBlock(scope: !576, file: !48, line: 282, column: 11)
!598 = !DILocation(line: 282, column: 17, scope: !597)
!599 = !DILocation(line: 282, column: 23, scope: !597)
!600 = !DILocation(line: 282, column: 11, scope: !576)
!601 = !DILocation(line: 288, column: 3, scope: !602)
!602 = distinct !DILexicalBlock(scope: !597, file: !48, line: 282, column: 29)
!603 = !DILocation(line: 288, column: 9, scope: !602)
!604 = !DILocation(line: 288, column: 42, scope: !602)
!605 = !DILocation(line: 288, column: 48, scope: !602)
!606 = !DILocation(line: 288, column: 17, scope: !602)
!607 = !DILocation(line: 288, column: 17, scope: !608)
!608 = !DILexicalBlockFile(scope: !602, file: !48, discriminator: 1)
!609 = !DILocation(line: 289, column: 2, scope: !602)
!610 = !DILocation(line: 290, column: 11, scope: !611)
!611 = distinct !DILexicalBlock(scope: !597, file: !48, line: 290, column: 11)
!612 = !DILocation(line: 290, column: 17, scope: !611)
!613 = !DILocation(line: 290, column: 23, scope: !611)
!614 = !DILocation(line: 290, column: 28, scope: !611)
!615 = !DILocation(line: 290, column: 31, scope: !616)
!616 = !DILexicalBlockFile(scope: !611, file: !48, discriminator: 1)
!617 = !DILocation(line: 290, column: 37, scope: !616)
!618 = !DILocation(line: 290, column: 43, scope: !616)
!619 = !DILocation(line: 290, column: 11, scope: !616)
!620 = !DILocation(line: 291, column: 3, scope: !611)
!621 = !DILocation(line: 291, column: 9, scope: !611)
!622 = !DILocation(line: 291, column: 15, scope: !611)
!623 = !DILocation(line: 291, column: 22, scope: !611)
!624 = !DILocation(line: 292, column: 1, scope: !570)
!625 = distinct !DISubprogram(name: "vrrp_thread_requeue_read", scope: !48, file: !48, line: 380, type: !335, isLocal: false, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !235)
!626 = !DILocalVariable(name: "vrrp", arg: 1, scope: !625, file: !48, line: 380, type: !337)
!627 = !DILocation(line: 380, column: 34, scope: !625)
!628 = !DILocation(line: 382, column: 22, scope: !625)
!629 = !DILocation(line: 382, column: 30, scope: !625)
!630 = !DILocation(line: 382, column: 36, scope: !625)
!631 = !DILocation(line: 382, column: 45, scope: !625)
!632 = !DILocation(line: 382, column: 66, scope: !625)
!633 = !DILocation(line: 382, column: 72, scope: !625)
!634 = !DILocation(line: 382, column: 81, scope: !625)
!635 = !DILocation(line: 382, column: 52, scope: !625)
!636 = !DILocation(line: 382, column: 2, scope: !637)
!637 = !DILexicalBlockFile(scope: !625, file: !48, discriminator: 1)
!638 = !DILocation(line: 383, column: 1, scope: !625)
!639 = distinct !DISubprogram(name: "vrrp_timer_fd", scope: !48, file: !48, line: 362, type: !640, isLocal: true, isDefinition: true, scopeLine: 363, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !235)
!640 = !DISubroutineType(types: !641)
!641 = !{!58, !642}
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!643 = !DILocalVariable(name: "fd", arg: 1, scope: !639, file: !48, line: 362, type: !642)
!644 = !DILocation(line: 362, column: 25, scope: !639)
!645 = !DILocalVariable(name: "timer", scope: !639, file: !48, line: 364, type: !206)
!646 = !DILocation(line: 364, column: 12, scope: !639)
!647 = !DILocation(line: 366, column: 29, scope: !639)
!648 = !DILocation(line: 366, column: 10, scope: !639)
!649 = !DILocation(line: 366, column: 10, scope: !650)
!650 = !DILexicalBlockFile(scope: !639, file: !48, discriminator: 1)
!651 = !DILocation(line: 370, column: 12, scope: !652)
!652 = distinct !DILexicalBlock(scope: !639, file: !48, line: 370, column: 6)
!653 = !DILocation(line: 370, column: 19, scope: !652)
!654 = !DILocation(line: 370, column: 6, scope: !639)
!655 = !DILocation(line: 371, column: 3, scope: !652)
!656 = !DILocation(line: 372, column: 8, scope: !657)
!657 = distinct !DILexicalBlock(scope: !639, file: !48, line: 372, column: 5)
!658 = !DILocation(line: 372, column: 15, scope: !657)
!659 = !DILocation(line: 372, column: 5, scope: !639)
!660 = !DILocation(line: 372, column: 8, scope: !661)
!661 = !DILexicalBlockFile(scope: !657, file: !48, discriminator: 1)
!662 = !DILocation(line: 372, column: 5, scope: !661)
!663 = !DILocation(line: 372, column: 6, scope: !661)
!664 = !DILocation(line: 372, column: 8, scope: !665)
!665 = !DILexicalBlockFile(scope: !657, file: !48, discriminator: 2)
!666 = !DILocation(line: 372, column: 5, scope: !665)
!667 = !DILocation(line: 373, column: 3, scope: !657)
!668 = !DILocation(line: 375, column: 1, scope: !639)
!669 = distinct !{!669, !668}
!670 = !DILocation(line: 375, column: 4, scope: !671)
!671 = !DILexicalBlockFile(scope: !672, file: !48, discriminator: 1)
!672 = distinct !DILexicalBlock(scope: !639, file: !48, line: 375, column: 4)
!673 = !DILocation(line: 375, column: 11, scope: !671)
!674 = !DILocation(line: 375, column: 12, scope: !671)
!675 = !DILocation(line: 375, column: 17, scope: !671)
!676 = !DILocation(line: 375, column: 4, scope: !677)
!677 = !DILexicalBlockFile(scope: !678, file: !48, discriminator: 2)
!678 = distinct !DILexicalBlock(scope: !679, file: !48, line: 375, column: 17)
!679 = distinct !DILexicalBlock(scope: !672, file: !48, line: 375, column: 17)
!680 = !DILocation(line: 375, column: 19, scope: !677)
!681 = !DILocation(line: 375, column: 12, scope: !677)
!682 = !DILocation(line: 375, column: 24, scope: !677)
!683 = !DILocation(line: 375, column: 26, scope: !684)
!684 = !DILexicalBlockFile(scope: !672, file: !48, discriminator: 3)
!685 = !DILocation(line: 376, column: 9, scope: !639)
!686 = !DILocation(line: 376, column: 2, scope: !639)
!687 = !DILocation(line: 377, column: 1, scope: !639)
!688 = distinct !DISubprogram(name: "vrrp_thread_requeue_read_relative", scope: !48, file: !48, line: 386, type: !689, isLocal: false, isDefinition: true, scopeLine: 387, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !235)
!689 = !DISubroutineType(types: !690)
!690 = !{null, !337, !309}
!691 = !DILocalVariable(name: "vrrp", arg: 1, scope: !688, file: !48, line: 386, type: !337)
!692 = !DILocation(line: 386, column: 43, scope: !688)
!693 = !DILocalVariable(name: "timer", arg: 2, scope: !688, file: !48, line: 386, type: !309)
!694 = !DILocation(line: 386, column: 58, scope: !688)
!695 = !DILocation(line: 388, column: 2, scope: !688)
!696 = !DILocation(line: 388, column: 8, scope: !688)
!697 = !DILocation(line: 388, column: 31, scope: !688)
!698 = !DILocation(line: 388, column: 37, scope: !688)
!699 = !DILocation(line: 388, column: 44, scope: !688)
!700 = !DILocation(line: 388, column: 16, scope: !688)
!701 = !DILocation(line: 388, column: 16, scope: !702)
!702 = !DILexicalBlockFile(scope: !688, file: !48, discriminator: 1)
!703 = !DILocation(line: 389, column: 6, scope: !704)
!704 = distinct !DILexicalBlock(scope: !688, file: !48, line: 389, column: 5)
!705 = !DILocation(line: 389, column: 12, scope: !704)
!706 = !DILocation(line: 389, column: 8, scope: !704)
!707 = !DILocation(line: 389, column: 15, scope: !704)
!708 = !DILocation(line: 389, column: 5, scope: !688)
!709 = !DILocation(line: 389, column: 6, scope: !710)
!710 = !DILexicalBlockFile(scope: !704, file: !48, discriminator: 1)
!711 = !DILocation(line: 389, column: 12, scope: !710)
!712 = !DILocation(line: 389, column: 8, scope: !710)
!713 = !DILocation(line: 389, column: 5, scope: !710)
!714 = !DILocation(line: 389, column: 6, scope: !715)
!715 = !DILexicalBlockFile(scope: !704, file: !48, discriminator: 2)
!716 = !DILocation(line: 389, column: 12, scope: !715)
!717 = !DILocation(line: 389, column: 8, scope: !715)
!718 = !DILocation(line: 389, column: 5, scope: !715)
!719 = !DILocation(line: 390, column: 3, scope: !704)
!720 = !DILocation(line: 390, column: 9, scope: !704)
!721 = !DILocation(line: 390, column: 17, scope: !704)
!722 = !DILocation(line: 392, column: 27, scope: !688)
!723 = !DILocation(line: 392, column: 2, scope: !688)
!724 = !DILocation(line: 393, column: 1, scope: !688)
!725 = distinct !DISubprogram(name: "vrrp_thread_add_read", scope: !48, file: !48, line: 468, type: !335, isLocal: false, isDefinition: true, scopeLine: 469, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !235)
!726 = !DILocalVariable(name: "vrrp", arg: 1, scope: !725, file: !48, line: 468, type: !337)
!727 = !DILocation(line: 468, column: 30, scope: !725)
!728 = !DILocation(line: 470, column: 42, scope: !725)
!729 = !DILocation(line: 471, column: 7, scope: !725)
!730 = !DILocation(line: 471, column: 13, scope: !725)
!731 = !DILocation(line: 471, column: 22, scope: !725)
!732 = !DILocation(line: 471, column: 28, scope: !725)
!733 = !DILocation(line: 471, column: 37, scope: !725)
!734 = !DILocation(line: 471, column: 58, scope: !725)
!735 = !DILocation(line: 471, column: 64, scope: !725)
!736 = !DILocation(line: 471, column: 73, scope: !725)
!737 = !DILocation(line: 471, column: 44, scope: !725)
!738 = !DILocation(line: 470, column: 26, scope: !725)
!739 = !DILocation(line: 470, column: 2, scope: !725)
!740 = !DILocation(line: 470, column: 8, scope: !725)
!741 = !DILocation(line: 470, column: 17, scope: !725)
!742 = !DILocation(line: 470, column: 24, scope: !725)
!743 = !DILocation(line: 472, column: 1, scope: !725)
!744 = distinct !DISubprogram(name: "vrrp_read_dispatcher_thread", scope: !48, file: !48, line: 955, type: !50, isLocal: true, isDefinition: true, scopeLine: 956, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !235)
!745 = !DILocalVariable(name: "thread", arg: 1, scope: !744, file: !48, line: 955, type: !53)
!746 = !DILocation(line: 955, column: 40, scope: !744)
!747 = !DILocalVariable(name: "vrrp_timer", scope: !744, file: !48, line: 957, type: !58)
!748 = !DILocation(line: 957, column: 16, scope: !744)
!749 = !DILocalVariable(name: "sock", scope: !744, file: !48, line: 958, type: !287)
!750 = !DILocation(line: 958, column: 10, scope: !744)
!751 = !DILocalVariable(name: "fd", scope: !744, file: !48, line: 959, type: !52)
!752 = !DILocation(line: 959, column: 6, scope: !744)
!753 = !DILocation(line: 962, column: 11, scope: !744)
!754 = !DILocation(line: 962, column: 20, scope: !744)
!755 = !DILocation(line: 962, column: 9, scope: !744)
!756 = !DILocation(line: 962, column: 7, scope: !744)
!757 = !DILocation(line: 965, column: 6, scope: !758)
!758 = distinct !DILexicalBlock(scope: !744, file: !48, line: 965, column: 6)
!759 = !DILocation(line: 965, column: 14, scope: !758)
!760 = !DILocation(line: 965, column: 19, scope: !758)
!761 = !DILocation(line: 965, column: 42, scope: !758)
!762 = !DILocation(line: 965, column: 45, scope: !763)
!763 = !DILexicalBlockFile(scope: !758, file: !48, discriminator: 1)
!764 = !DILocation(line: 965, column: 51, scope: !763)
!765 = !DILocation(line: 965, column: 57, scope: !763)
!766 = !DILocation(line: 965, column: 6, scope: !763)
!767 = !DILocation(line: 966, column: 37, scope: !758)
!768 = !DILocation(line: 966, column: 43, scope: !758)
!769 = !DILocation(line: 966, column: 8, scope: !758)
!770 = !DILocation(line: 966, column: 6, scope: !758)
!771 = !DILocation(line: 966, column: 3, scope: !758)
!772 = !DILocation(line: 968, column: 29, scope: !758)
!773 = !DILocation(line: 968, column: 8, scope: !758)
!774 = !DILocation(line: 968, column: 6, scope: !758)
!775 = !DILocation(line: 971, column: 29, scope: !744)
!776 = !DILocation(line: 971, column: 15, scope: !744)
!777 = !DILocation(line: 971, column: 13, scope: !744)
!778 = !DILocation(line: 972, column: 6, scope: !779)
!779 = distinct !DILexicalBlock(scope: !744, file: !48, line: 972, column: 6)
!780 = !DILocation(line: 972, column: 9, scope: !779)
!781 = !DILocation(line: 972, column: 6, scope: !744)
!782 = !DILocation(line: 973, column: 34, scope: !779)
!783 = !DILocation(line: 973, column: 42, scope: !779)
!784 = !DILocation(line: 974, column: 13, scope: !779)
!785 = !DILocation(line: 974, column: 19, scope: !779)
!786 = !DILocation(line: 974, column: 23, scope: !779)
!787 = !DILocation(line: 973, column: 18, scope: !779)
!788 = !DILocation(line: 973, column: 3, scope: !779)
!789 = !DILocation(line: 973, column: 9, scope: !779)
!790 = !DILocation(line: 973, column: 16, scope: !779)
!791 = !DILocation(line: 976, column: 2, scope: !744)
!792 = distinct !DISubprogram(name: "vrrp_dispatcher_init", scope: !48, file: !48, line: 629, type: !50, isLocal: false, isDefinition: true, scopeLine: 630, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !235)
!793 = !DILocalVariable(name: "thread", arg: 1, scope: !792, file: !48, line: 629, type: !53)
!794 = !DILocation(line: 629, column: 57, scope: !792)
!795 = !DILocation(line: 631, column: 23, scope: !792)
!796 = !DILocation(line: 631, column: 34, scope: !792)
!797 = !DILocation(line: 631, column: 2, scope: !792)
!798 = !DILocation(line: 634, column: 21, scope: !792)
!799 = !DILocation(line: 634, column: 32, scope: !792)
!800 = !DILocation(line: 634, column: 2, scope: !792)
!801 = !DILocation(line: 637, column: 15, scope: !792)
!802 = !DILocation(line: 637, column: 26, scope: !792)
!803 = !DILocation(line: 637, column: 2, scope: !792)
!804 = !DILocation(line: 641, column: 24, scope: !792)
!805 = !DILocation(line: 641, column: 35, scope: !792)
!806 = !DILocation(line: 641, column: 2, scope: !792)
!807 = !DILocation(line: 644, column: 6, scope: !808)
!808 = distinct !DILexicalBlock(scope: !792, file: !48, line: 644, column: 6)
!809 = !DILocation(line: 644, column: 6, scope: !792)
!810 = !DILocation(line: 645, column: 18, scope: !808)
!811 = !DILocation(line: 645, column: 29, scope: !808)
!812 = !DILocation(line: 645, column: 3, scope: !808)
!813 = !DILocation(line: 647, column: 19, scope: !792)
!814 = !DILocation(line: 649, column: 2, scope: !792)
!815 = distinct !DISubprogram(name: "vrrp_create_sockpool", scope: !48, file: !48, line: 509, type: !816, isLocal: true, isDefinition: true, scopeLine: 510, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !235)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !91}
!818 = !DILocalVariable(name: "l", arg: 1, scope: !815, file: !48, line: 509, type: !91)
!819 = !DILocation(line: 509, column: 27, scope: !815)
!820 = !DILocalVariable(name: "vrrp", scope: !815, file: !48, line: 511, type: !337)
!821 = !DILocation(line: 511, column: 10, scope: !815)
!822 = !DILocalVariable(name: "e", scope: !815, file: !48, line: 512, type: !823)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "element", file: !92, line: 30, baseType: !97)
!824 = !DILocation(line: 512, column: 10, scope: !815)
!825 = !DILocalVariable(name: "ifindex", scope: !815, file: !48, line: 513, type: !307)
!826 = !DILocation(line: 513, column: 12, scope: !815)
!827 = !DILocalVariable(name: "proto", scope: !815, file: !48, line: 514, type: !52)
!828 = !DILocation(line: 514, column: 6, scope: !815)
!829 = !DILocalVariable(name: "unicast", scope: !815, file: !48, line: 515, type: !198)
!830 = !DILocation(line: 515, column: 6, scope: !815)
!831 = !DILocalVariable(name: "sock", scope: !815, file: !48, line: 516, type: !287)
!832 = !DILocation(line: 516, column: 10, scope: !815)
!833 = !DILocation(line: 518, column: 15, scope: !834)
!834 = distinct !DILexicalBlock(scope: !815, file: !48, line: 518, column: 2)
!835 = !DILocation(line: 518, column: 26, scope: !834)
!836 = !DILocation(line: 518, column: 14, scope: !834)
!837 = !DILocation(line: 518, column: 37, scope: !838)
!838 = !DILexicalBlockFile(scope: !834, file: !48, discriminator: 1)
!839 = !DILocation(line: 518, column: 48, scope: !838)
!840 = !DILocation(line: 518, column: 36, scope: !838)
!841 = !DILocation(line: 518, column: 35, scope: !838)
!842 = !DILocation(line: 518, column: 35, scope: !843)
!843 = !DILexicalBlockFile(scope: !834, file: !48, discriminator: 2)
!844 = !DILocation(line: 518, column: 4, scope: !845)
!845 = !DILexicalBlockFile(scope: !834, file: !48, discriminator: 3)
!846 = !DILocation(line: 518, column: 15, scope: !845)
!847 = !DILocation(line: 518, column: 22, scope: !845)
!848 = !DILocation(line: 518, column: 35, scope: !845)
!849 = !DILocation(line: 518, column: 35, scope: !850)
!850 = !DILexicalBlockFile(scope: !834, file: !48, discriminator: 4)
!851 = !DILocation(line: 518, column: 14, scope: !850)
!852 = !DILocation(line: 518, column: 14, scope: !853)
!853 = !DILexicalBlockFile(scope: !834, file: !48, discriminator: 5)
!854 = !DILocation(line: 518, column: 14, scope: !855)
!855 = !DILexicalBlockFile(scope: !834, file: !48, discriminator: 6)
!856 = !DILocation(line: 518, column: 11, scope: !855)
!857 = !DILocation(line: 518, column: 7, scope: !855)
!858 = !DILocation(line: 518, column: 5, scope: !859)
!859 = !DILexicalBlockFile(scope: !860, file: !48, discriminator: 7)
!860 = distinct !DILexicalBlock(scope: !834, file: !48, line: 518, column: 2)
!861 = !DILocation(line: 518, column: 4, scope: !859)
!862 = !DILocation(line: 518, column: 8, scope: !859)
!863 = !DILocation(line: 518, column: 23, scope: !864)
!864 = !DILexicalBlockFile(scope: !860, file: !48, discriminator: 8)
!865 = !DILocation(line: 518, column: 27, scope: !864)
!866 = !DILocation(line: 518, column: 21, scope: !864)
!867 = !DILocation(line: 518, column: 19, scope: !864)
!868 = !DILocation(line: 518, column: 2, scope: !869)
!869 = !DILexicalBlockFile(scope: !834, file: !48, discriminator: 9)
!870 = !DILocation(line: 521, column: 43, scope: !871)
!871 = distinct !DILexicalBlock(scope: !860, file: !48, line: 518, column: 57)
!872 = !DILocation(line: 521, column: 49, scope: !871)
!873 = !DILocation(line: 521, column: 7, scope: !871)
!874 = !DILocation(line: 521, column: 6, scope: !871)
!875 = !DILocation(line: 521, column: 66, scope: !876)
!876 = !DILexicalBlockFile(scope: !871, file: !48, discriminator: 1)
!877 = !DILocation(line: 521, column: 72, scope: !876)
!878 = !DILocation(line: 521, column: 78, scope: !876)
!879 = !DILocation(line: 521, column: 88, scope: !876)
!880 = !DILocation(line: 521, column: 6, scope: !876)
!881 = !DILocation(line: 523, column: 17, scope: !871)
!882 = !DILocation(line: 523, column: 23, scope: !871)
!883 = !DILocation(line: 523, column: 29, scope: !871)
!884 = !DILocation(line: 521, column: 6, scope: !885)
!885 = !DILexicalBlockFile(scope: !871, file: !48, discriminator: 2)
!886 = !DILocation(line: 521, column: 6, scope: !887)
!887 = !DILexicalBlockFile(scope: !871, file: !48, discriminator: 3)
!888 = !DILocation(line: 519, column: 11, scope: !871)
!889 = !DILocation(line: 524, column: 16, scope: !871)
!890 = !DILocation(line: 524, column: 22, scope: !871)
!891 = !DILocation(line: 524, column: 36, scope: !871)
!892 = !DILocation(line: 524, column: 13, scope: !871)
!893 = !DILocation(line: 524, column: 18, scope: !876)
!894 = !DILocation(line: 524, column: 24, scope: !876)
!895 = !DILocation(line: 524, column: 39, scope: !876)
!896 = !DILocation(line: 524, column: 44, scope: !876)
!897 = !DILocation(line: 524, column: 13, scope: !876)
!898 = !DILocation(line: 524, column: 17, scope: !885)
!899 = !DILocation(line: 524, column: 23, scope: !885)
!900 = !DILocation(line: 524, column: 38, scope: !885)
!901 = !DILocation(line: 524, column: 43, scope: !885)
!902 = !DILocation(line: 524, column: 13, scope: !887)
!903 = !DILocation(line: 524, column: 13, scope: !904)
!904 = !DILexicalBlockFile(scope: !871, file: !48, discriminator: 4)
!905 = !DILocation(line: 524, column: 11, scope: !904)
!906 = !DILocation(line: 526, column: 7, scope: !907)
!907 = distinct !DILexicalBlock(scope: !871, file: !48, line: 526, column: 7)
!908 = !DILocation(line: 526, column: 13, scope: !907)
!909 = !DILocation(line: 526, column: 23, scope: !907)
!910 = !DILocation(line: 526, column: 7, scope: !871)
!911 = !DILocation(line: 527, column: 10, scope: !907)
!912 = !DILocation(line: 527, column: 4, scope: !907)
!913 = !DILocation(line: 530, column: 10, scope: !907)
!914 = !DILocation(line: 533, column: 35, scope: !915)
!915 = distinct !DILexicalBlock(scope: !871, file: !48, line: 533, column: 7)
!916 = !DILocation(line: 533, column: 38, scope: !915)
!917 = !DILocation(line: 533, column: 44, scope: !915)
!918 = !DILocation(line: 533, column: 52, scope: !915)
!919 = !DILocation(line: 533, column: 59, scope: !915)
!920 = !DILocation(line: 533, column: 68, scope: !915)
!921 = !DILocation(line: 533, column: 16, scope: !915)
!922 = !DILocation(line: 533, column: 14, scope: !915)
!923 = !DILocation(line: 533, column: 7, scope: !871)
!924 = !DILocation(line: 534, column: 22, scope: !915)
!925 = !DILocation(line: 534, column: 28, scope: !915)
!926 = !DILocation(line: 534, column: 36, scope: !915)
!927 = !DILocation(line: 534, column: 39, scope: !915)
!928 = !DILocation(line: 534, column: 46, scope: !915)
!929 = !DILocation(line: 534, column: 55, scope: !915)
!930 = !DILocation(line: 534, column: 11, scope: !915)
!931 = !DILocation(line: 534, column: 9, scope: !915)
!932 = !DILocation(line: 534, column: 4, scope: !915)
!933 = !DILocation(line: 536, column: 7, scope: !934)
!934 = distinct !DILexicalBlock(scope: !871, file: !48, line: 536, column: 7)
!935 = !DILocation(line: 536, column: 13, scope: !934)
!936 = !DILocation(line: 536, column: 7, scope: !871)
!937 = !DILocation(line: 537, column: 25, scope: !934)
!938 = !DILocation(line: 537, column: 31, scope: !934)
!939 = !DILocation(line: 537, column: 4, scope: !934)
!940 = !DILocation(line: 537, column: 10, scope: !934)
!941 = !DILocation(line: 537, column: 22, scope: !934)
!942 = !DILocation(line: 538, column: 12, scope: !943)
!943 = distinct !DILexicalBlock(scope: !934, file: !48, line: 538, column: 12)
!944 = !DILocation(line: 538, column: 25, scope: !943)
!945 = !DILocation(line: 538, column: 45, scope: !943)
!946 = !DILocation(line: 538, column: 12, scope: !934)
!947 = !DILocation(line: 539, column: 25, scope: !943)
!948 = !DILocation(line: 539, column: 38, scope: !943)
!949 = !DILocation(line: 539, column: 4, scope: !943)
!950 = !DILocation(line: 539, column: 10, scope: !943)
!951 = !DILocation(line: 539, column: 22, scope: !943)
!952 = !DILocation(line: 540, column: 12, scope: !953)
!953 = distinct !DILexicalBlock(scope: !943, file: !48, line: 540, column: 12)
!954 = !DILocation(line: 540, column: 25, scope: !953)
!955 = !DILocation(line: 540, column: 45, scope: !953)
!956 = !DILocation(line: 540, column: 12, scope: !943)
!957 = !DILocation(line: 541, column: 25, scope: !953)
!958 = !DILocation(line: 541, column: 38, scope: !953)
!959 = !DILocation(line: 541, column: 76, scope: !953)
!960 = !DILocation(line: 541, column: 63, scope: !953)
!961 = !DILocation(line: 541, column: 61, scope: !953)
!962 = !DILocation(line: 541, column: 4, scope: !953)
!963 = !DILocation(line: 541, column: 10, scope: !953)
!964 = !DILocation(line: 541, column: 22, scope: !953)
!965 = !DILocation(line: 542, column: 12, scope: !966)
!966 = distinct !DILexicalBlock(scope: !953, file: !48, line: 542, column: 12)
!967 = !DILocation(line: 542, column: 25, scope: !966)
!968 = !DILocation(line: 542, column: 45, scope: !966)
!969 = !DILocation(line: 542, column: 12, scope: !953)
!970 = !DILocation(line: 543, column: 25, scope: !966)
!971 = !DILocation(line: 543, column: 38, scope: !966)
!972 = !DILocation(line: 543, column: 63, scope: !966)
!973 = !DILocation(line: 543, column: 69, scope: !966)
!974 = !DILocation(line: 543, column: 74, scope: !966)
!975 = !DILocation(line: 543, column: 61, scope: !966)
!976 = !DILocation(line: 543, column: 4, scope: !966)
!977 = !DILocation(line: 543, column: 10, scope: !966)
!978 = !DILocation(line: 543, column: 22, scope: !966)
!979 = !DILocation(line: 544, column: 2, scope: !871)
!980 = !DILocation(line: 518, column: 46, scope: !981)
!981 = !DILexicalBlockFile(scope: !860, file: !48, discriminator: 10)
!982 = !DILocation(line: 518, column: 50, scope: !981)
!983 = !DILocation(line: 518, column: 43, scope: !981)
!984 = !DILocation(line: 518, column: 2, scope: !981)
!985 = distinct !{!985, !986}
!986 = !DILocation(line: 518, column: 2, scope: !815)
!987 = !DILocation(line: 545, column: 1, scope: !815)
!988 = distinct !DISubprogram(name: "vrrp_open_sockpool", scope: !48, file: !48, line: 548, type: !816, isLocal: true, isDefinition: true, scopeLine: 549, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !235)
!989 = !DILocalVariable(name: "l", arg: 1, scope: !988, file: !48, line: 548, type: !91)
!990 = !DILocation(line: 548, column: 25, scope: !988)
!991 = !DILocalVariable(name: "sock", scope: !988, file: !48, line: 550, type: !287)
!992 = !DILocation(line: 550, column: 10, scope: !988)
!993 = !DILocalVariable(name: "e", scope: !988, file: !48, line: 551, type: !823)
!994 = !DILocation(line: 551, column: 10, scope: !988)
!995 = !DILocalVariable(name: "ifp", scope: !988, file: !48, line: 552, type: !411)
!996 = !DILocation(line: 552, column: 15, scope: !988)
!997 = !DILocation(line: 554, column: 15, scope: !998)
!998 = distinct !DILexicalBlock(scope: !988, file: !48, line: 554, column: 2)
!999 = !DILocation(line: 554, column: 14, scope: !998)
!1000 = !DILocation(line: 554, column: 23, scope: !1001)
!1001 = !DILexicalBlockFile(scope: !998, file: !48, discriminator: 1)
!1002 = !DILocation(line: 554, column: 22, scope: !1001)
!1003 = !DILocation(line: 554, column: 21, scope: !1001)
!1004 = !DILocation(line: 554, column: 21, scope: !1005)
!1005 = !DILexicalBlockFile(scope: !998, file: !48, discriminator: 2)
!1006 = !DILocation(line: 554, column: 4, scope: !1007)
!1007 = !DILexicalBlockFile(scope: !998, file: !48, discriminator: 3)
!1008 = !DILocation(line: 554, column: 8, scope: !1007)
!1009 = !DILocation(line: 554, column: 21, scope: !1007)
!1010 = !DILocation(line: 554, column: 21, scope: !1011)
!1011 = !DILexicalBlockFile(scope: !998, file: !48, discriminator: 4)
!1012 = !DILocation(line: 554, column: 14, scope: !1011)
!1013 = !DILocation(line: 554, column: 14, scope: !1014)
!1014 = !DILexicalBlockFile(scope: !998, file: !48, discriminator: 5)
!1015 = !DILocation(line: 554, column: 14, scope: !1016)
!1016 = !DILexicalBlockFile(scope: !998, file: !48, discriminator: 6)
!1017 = !DILocation(line: 554, column: 11, scope: !1016)
!1018 = !DILocation(line: 554, column: 7, scope: !1016)
!1019 = !DILocation(line: 554, column: 5, scope: !1020)
!1020 = !DILexicalBlockFile(scope: !1021, file: !48, discriminator: 7)
!1021 = distinct !DILexicalBlock(scope: !998, file: !48, line: 554, column: 2)
!1022 = !DILocation(line: 554, column: 4, scope: !1020)
!1023 = !DILocation(line: 554, column: 8, scope: !1020)
!1024 = !DILocation(line: 554, column: 23, scope: !1025)
!1025 = !DILexicalBlockFile(scope: !1021, file: !48, discriminator: 8)
!1026 = !DILocation(line: 554, column: 27, scope: !1025)
!1027 = !DILocation(line: 554, column: 21, scope: !1025)
!1028 = !DILocation(line: 554, column: 19, scope: !1025)
!1029 = !DILocation(line: 554, column: 2, scope: !1030)
!1030 = !DILexicalBlockFile(scope: !998, file: !48, discriminator: 9)
!1031 = !DILocation(line: 555, column: 8, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !48, line: 555, column: 7)
!1033 = distinct !DILexicalBlock(scope: !1021, file: !48, line: 554, column: 57)
!1034 = !DILocation(line: 555, column: 14, scope: !1032)
!1035 = !DILocation(line: 555, column: 7, scope: !1033)
!1036 = !DILocation(line: 556, column: 18, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1032, file: !48, line: 555, column: 23)
!1038 = !DILocation(line: 556, column: 24, scope: !1037)
!1039 = !DILocation(line: 556, column: 31, scope: !1037)
!1040 = !DILocation(line: 556, column: 4, scope: !1037)
!1041 = !DILocation(line: 556, column: 10, scope: !1037)
!1042 = !DILocation(line: 556, column: 16, scope: !1037)
!1043 = !DILocation(line: 557, column: 4, scope: !1037)
!1044 = !DILocation(line: 559, column: 27, scope: !1033)
!1045 = !DILocation(line: 559, column: 33, scope: !1033)
!1046 = !DILocation(line: 559, column: 9, scope: !1033)
!1047 = !DILocation(line: 559, column: 7, scope: !1033)
!1048 = !DILocation(line: 560, column: 39, scope: !1033)
!1049 = !DILocation(line: 560, column: 45, scope: !1033)
!1050 = !DILocation(line: 560, column: 53, scope: !1033)
!1051 = !DILocation(line: 560, column: 59, scope: !1033)
!1052 = !DILocation(line: 561, column: 13, scope: !1033)
!1053 = !DILocation(line: 561, column: 18, scope: !1033)
!1054 = !DILocation(line: 561, column: 24, scope: !1033)
!1055 = !DILocation(line: 561, column: 33, scope: !1033)
!1056 = !DILocation(line: 561, column: 39, scope: !1033)
!1057 = !DILocation(line: 560, column: 17, scope: !1033)
!1058 = !DILocation(line: 560, column: 3, scope: !1033)
!1059 = !DILocation(line: 560, column: 9, scope: !1033)
!1060 = !DILocation(line: 560, column: 15, scope: !1033)
!1061 = !DILocation(line: 562, column: 7, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1033, file: !48, line: 562, column: 7)
!1063 = !DILocation(line: 562, column: 13, scope: !1062)
!1064 = !DILocation(line: 562, column: 19, scope: !1062)
!1065 = !DILocation(line: 562, column: 7, scope: !1033)
!1066 = !DILocation(line: 563, column: 4, scope: !1062)
!1067 = !DILocation(line: 563, column: 10, scope: !1062)
!1068 = !DILocation(line: 563, column: 17, scope: !1062)
!1069 = !DILocation(line: 565, column: 41, scope: !1062)
!1070 = !DILocation(line: 565, column: 47, scope: !1062)
!1071 = !DILocation(line: 565, column: 55, scope: !1062)
!1072 = !DILocation(line: 565, column: 61, scope: !1062)
!1073 = !DILocation(line: 566, column: 13, scope: !1062)
!1074 = !DILocation(line: 566, column: 18, scope: !1062)
!1075 = !DILocation(line: 566, column: 24, scope: !1062)
!1076 = !DILocation(line: 565, column: 19, scope: !1062)
!1077 = !DILocation(line: 565, column: 4, scope: !1062)
!1078 = !DILocation(line: 565, column: 10, scope: !1062)
!1079 = !DILocation(line: 565, column: 17, scope: !1062)
!1080 = !DILocation(line: 567, column: 2, scope: !1033)
!1081 = !DILocation(line: 554, column: 46, scope: !1082)
!1082 = !DILexicalBlockFile(scope: !1021, file: !48, discriminator: 10)
!1083 = !DILocation(line: 554, column: 50, scope: !1082)
!1084 = !DILocation(line: 554, column: 43, scope: !1082)
!1085 = !DILocation(line: 554, column: 2, scope: !1082)
!1086 = distinct !{!1086, !1087}
!1087 = !DILocation(line: 554, column: 2, scope: !988)
!1088 = !DILocation(line: 568, column: 1, scope: !988)
!1089 = distinct !DISubprogram(name: "vrrp_set_fds", scope: !48, file: !48, line: 571, type: !816, isLocal: true, isDefinition: true, scopeLine: 572, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !235)
!1090 = !DILocalVariable(name: "l", arg: 1, scope: !1089, file: !48, line: 571, type: !91)
!1091 = !DILocation(line: 571, column: 19, scope: !1089)
!1092 = !DILocalVariable(name: "sock", scope: !1089, file: !48, line: 573, type: !287)
!1093 = !DILocation(line: 573, column: 10, scope: !1089)
!1094 = !DILocalVariable(name: "vrrp", scope: !1089, file: !48, line: 574, type: !337)
!1095 = !DILocation(line: 574, column: 10, scope: !1089)
!1096 = !DILocalVariable(name: "p", scope: !1089, file: !48, line: 575, type: !91)
!1097 = !DILocation(line: 575, column: 7, scope: !1089)
!1098 = !DILocation(line: 575, column: 11, scope: !1089)
!1099 = !DILocation(line: 575, column: 22, scope: !1089)
!1100 = !DILocalVariable(name: "e_sock", scope: !1089, file: !48, line: 576, type: !823)
!1101 = !DILocation(line: 576, column: 10, scope: !1089)
!1102 = !DILocalVariable(name: "e_vrrp", scope: !1089, file: !48, line: 577, type: !823)
!1103 = !DILocation(line: 577, column: 10, scope: !1089)
!1104 = !DILocalVariable(name: "proto", scope: !1089, file: !48, line: 578, type: !52)
!1105 = !DILocation(line: 578, column: 6, scope: !1089)
!1106 = !DILocalVariable(name: "ifindex", scope: !1089, file: !48, line: 579, type: !307)
!1107 = !DILocation(line: 579, column: 12, scope: !1089)
!1108 = !DILocalVariable(name: "unicast", scope: !1089, file: !48, line: 580, type: !198)
!1109 = !DILocation(line: 580, column: 6, scope: !1089)
!1110 = !DILocation(line: 582, column: 19, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1089, file: !48, line: 582, column: 2)
!1112 = !DILocation(line: 582, column: 18, scope: !1111)
!1113 = !DILocation(line: 582, column: 17, scope: !1111)
!1114 = !DILocation(line: 582, column: 17, scope: !1115)
!1115 = !DILexicalBlockFile(scope: !1111, file: !48, discriminator: 1)
!1116 = !DILocation(line: 582, column: 18, scope: !1117)
!1117 = !DILexicalBlockFile(scope: !1111, file: !48, discriminator: 2)
!1118 = !DILocation(line: 582, column: 22, scope: !1117)
!1119 = !DILocation(line: 582, column: 17, scope: !1117)
!1120 = !DILocation(line: 582, column: 17, scope: !1121)
!1121 = !DILexicalBlockFile(scope: !1111, file: !48, discriminator: 3)
!1122 = !DILocation(line: 582, column: 14, scope: !1121)
!1123 = !DILocation(line: 582, column: 7, scope: !1121)
!1124 = !DILocation(line: 582, column: 29, scope: !1125)
!1125 = !DILexicalBlockFile(scope: !1126, file: !48, discriminator: 4)
