; ModuleID = './[inter]keepalived--vrrp--vrrp_print.o.i'
source_filename = "./[inter]keepalived--vrrp--vrrp_print.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._vrrp_data = type { %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list*, %struct._list* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !32)
!1 = !DIFile(filename: "[inter]keepalived--vrrp--vrrp_print.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chksum_compatibility", file: !4, line: 173, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./../include/vrrp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NONE", value: 0)
!7 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NEVER", value: 1)
!8 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_MIN_COMPAT", value: 2)
!9 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_CONFIG", value: 3)
!10 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_AUTO", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 41, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "../../lib/scheduler.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!14 = !DIEnumerator(name: "THREAD_READ", value: 0)
!15 = !DIEnumerator(name: "THREAD_WRITE", value: 1)
!16 = !DIEnumerator(name: "THREAD_TIMER", value: 2)
!17 = !DIEnumerator(name: "THREAD_TIMER_SHUTDOWN", value: 3)
!18 = !DIEnumerator(name: "THREAD_EVENT", value: 4)
!19 = !DIEnumerator(name: "THREAD_CHILD", value: 5)
!20 = !DIEnumerator(name: "THREAD_READY", value: 6)
!21 = !DIEnumerator(name: "THREAD_UNUSED", value: 7)
!22 = !DIEnumerator(name: "THREAD_WRITE_TIMEOUT", value: 8)
!23 = !DIEnumerator(name: "THREAD_READ_TIMEOUT", value: 9)
!24 = !DIEnumerator(name: "THREAD_CHILD_TIMEOUT", value: 10)
!25 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!26 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!27 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!28 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!29 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!30 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!31 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!32 = !{!33, !121, !125}
!33 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !34, line: 150, type: !35, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!34 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !36, line: 31, baseType: !37)
!36 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !36, line: 39, size: 320, align: 64, elements: !39)
!39 = !{!40, !48, !49, !51, !55}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !38, file: !36, line: 40, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !36, line: 33, size: 192, align: 64, elements: !43)
!43 = !{!44, !45, !46}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !42, file: !36, line: 34, baseType: !41, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !42, file: !36, line: 35, baseType: !41, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !42, file: !36, line: 36, baseType: !47, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !38, file: !36, line: 41, baseType: !41, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !38, file: !36, line: 42, baseType: !50, size: 32, align: 32, offset: 128)
!50 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !38, file: !36, line: 43, baseType: !52, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !47}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !38, file: !36, line: 44, baseType: !56, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !59, !47}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !61, line: 48, baseType: !62)
!61 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !63, line: 241, size: 1728, align: 64, elements: !64)
!63 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!64 = !{!65, !67, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !88, !89, !90, !91, !95, !97, !99, !103, !106, !108, !109, !110, !111, !112, !116, !117}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !62, file: !63, line: 242, baseType: !66, size: 32, align: 32)
!66 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !62, file: !63, line: 247, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !62, file: !63, line: 248, baseType: !68, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !62, file: !63, line: 249, baseType: !68, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !62, file: !63, line: 250, baseType: !68, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !62, file: !63, line: 251, baseType: !68, size: 64, align: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !62, file: !63, line: 252, baseType: !68, size: 64, align: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !62, file: !63, line: 253, baseType: !68, size: 64, align: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !62, file: !63, line: 254, baseType: !68, size: 64, align: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !62, file: !63, line: 256, baseType: !68, size: 64, align: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !62, file: !63, line: 257, baseType: !68, size: 64, align: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !62, file: !63, line: 258, baseType: !68, size: 64, align: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !62, file: !63, line: 260, baseType: !81, size: 64, align: 64, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !63, line: 156, size: 192, align: 64, elements: !83)
!83 = !{!84, !85, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !82, file: !63, line: 157, baseType: !81, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !82, file: !63, line: 158, baseType: !86, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !82, file: !63, line: 162, baseType: !66, size: 32, align: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !62, file: !63, line: 262, baseType: !86, size: 64, align: 64, offset: 832)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !62, file: !63, line: 264, baseType: !66, size: 32, align: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !62, file: !63, line: 268, baseType: !66, size: 32, align: 32, offset: 928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !62, file: !63, line: 270, baseType: !92, size: 64, align: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !93, line: 131, baseType: !94)
!93 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!94 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !62, file: !63, line: 274, baseType: !96, size: 16, align: 16, offset: 1024)
!96 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !62, file: !63, line: 275, baseType: !98, size: 8, align: 8, offset: 1040)
!98 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !62, file: !63, line: 276, baseType: !100, size: 8, align: 8, offset: 1048)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 8, align: 8, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 1)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !62, file: !63, line: 280, baseType: !104, size: 64, align: 64, offset: 1088)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !63, line: 150, baseType: null)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !62, file: !63, line: 289, baseType: !107, size: 64, align: 64, offset: 1152)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !93, line: 132, baseType: !94)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !62, file: !63, line: 297, baseType: !47, size: 64, align: 64, offset: 1216)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !62, file: !63, line: 298, baseType: !47, size: 64, align: 64, offset: 1280)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !62, file: !63, line: 299, baseType: !47, size: 64, align: 64, offset: 1344)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !62, file: !63, line: 300, baseType: !47, size: 64, align: 64, offset: 1408)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !62, file: !63, line: 302, baseType: !113, size: 64, align: 64, offset: 1472)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !114, line: 216, baseType: !115)
!114 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!115 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !62, file: !63, line: 303, baseType: !66, size: 32, align: 32, offset: 1536)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !62, file: !63, line: 305, baseType: !118, size: 160, align: 8, offset: 1568)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 160, align: 8, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 20)
!121 = distinct !DIGlobalVariable(name: "dump_file", scope: !0, file: !122, line: 36, type: !123, isLocal: true, isDefinition: true, variable: i8** @dump_file)
!122 = !DIFile(filename: "vrrp_print.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!125 = distinct !DIGlobalVariable(name: "stats_file", scope: !0, file: !122, line: 37, type: !123, isLocal: true, isDefinition: true, variable: i8** @stats_file)
!126 = !{i32 2, !"Dwarf Version", i32 4}
!127 = !{i32 2, !"Debug Info Version", i32 3}
!128 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!129 = distinct !DISubprogram(name: "vrrp_print_data", scope: !122, file: !122, line: 40, type: !130, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !132)
!130 = !DISubroutineType(types: !131)
!131 = !{null}
!132 = !{}
!133 = !DILocalVariable(name: "file", scope: !129, file: !122, line: 42, type: !59)
!134 = !DIExpression()
!135 = !DILocation(line: 42, column: 8, scope: !129)
!136 = !DILocation(line: 42, column: 22, scope: !129)
!137 = !DILocation(line: 42, column: 15, scope: !129)
!138 = !DILocation(line: 44, column: 7, scope: !139)
!139 = distinct !DILexicalBlock(scope: !129, file: !122, line: 44, column: 6)
!140 = !DILocation(line: 44, column: 6, scope: !129)
!141 = !DILocation(line: 46, column: 4, scope: !142)
!142 = distinct !DILexicalBlock(scope: !139, file: !122, line: 44, column: 13)
!143 = !DILocation(line: 46, column: 16, scope: !142)
!144 = !DILocation(line: 46, column: 15, scope: !142)
!145 = !DILocation(line: 46, column: 32, scope: !146)
!146 = !DILexicalBlockFile(scope: !142, file: !122, discriminator: 1)
!147 = !DILocation(line: 46, column: 31, scope: !142)
!148 = !DILocation(line: 46, column: 21, scope: !149)
!149 = !DILexicalBlockFile(scope: !142, file: !122, discriminator: 2)
!150 = !DILocation(line: 45, column: 3, scope: !142)
!151 = !DILocation(line: 47, column: 3, scope: !142)
!152 = !DILocation(line: 50, column: 17, scope: !129)
!153 = !DILocation(line: 50, column: 2, scope: !129)
!154 = !DILocation(line: 52, column: 9, scope: !129)
!155 = !DILocation(line: 52, column: 2, scope: !129)
!156 = !DILocation(line: 53, column: 1, scope: !129)
!157 = !DILocation(line: 53, column: 1, scope: !158)
!158 = !DILexicalBlockFile(scope: !129, file: !122, discriminator: 1)
!159 = distinct !DISubprogram(name: "vrrp_print_stats", scope: !122, file: !122, line: 56, type: !130, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !132)
!160 = !DILocalVariable(name: "file", scope: !159, file: !122, line: 58, type: !59)
!161 = !DILocation(line: 58, column: 8, scope: !159)
!162 = !DILocation(line: 59, column: 16, scope: !159)
!163 = !DILocation(line: 59, column: 9, scope: !159)
!164 = !DILocation(line: 59, column: 7, scope: !159)
!165 = !DILocation(line: 61, column: 7, scope: !166)
!166 = distinct !DILexicalBlock(scope: !159, file: !122, line: 61, column: 6)
!167 = !DILocation(line: 61, column: 6, scope: !159)
!168 = !DILocation(line: 63, column: 4, scope: !169)
!169 = distinct !DILexicalBlock(scope: !166, file: !122, line: 61, column: 13)
!170 = !DILocation(line: 63, column: 17, scope: !169)
!171 = !DILocation(line: 63, column: 16, scope: !169)
!172 = !DILocation(line: 63, column: 33, scope: !173)
!173 = !DILexicalBlockFile(scope: !169, file: !122, discriminator: 1)
!174 = !DILocation(line: 63, column: 32, scope: !169)
!175 = !DILocation(line: 63, column: 22, scope: !176)
!176 = !DILexicalBlockFile(scope: !169, file: !122, discriminator: 2)
!177 = !DILocation(line: 62, column: 3, scope: !169)
!178 = !DILocation(line: 64, column: 3, scope: !169)
!179 = !DILocalVariable(name: "l", scope: !159, file: !122, line: 67, type: !35)
!180 = !DILocation(line: 67, column: 7, scope: !159)
!181 = !DILocation(line: 67, column: 11, scope: !159)
!182 = !DILocation(line: 67, column: 22, scope: !159)
!183 = !DILocalVariable(name: "e", scope: !159, file: !122, line: 68, type: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "element", file: !36, line: 30, baseType: !41)
!185 = !DILocation(line: 68, column: 10, scope: !159)
!186 = !DILocalVariable(name: "vrrp", scope: !159, file: !122, line: 69, type: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_t", file: !4, line: 310, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_t", file: !4, line: 183, size: 7040, align: 64, elements: !190)
!190 = !{!191, !194, !195, !245, !267, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !373, !374, !375, !376, !377, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !535, !542}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !189, file: !4, line: 184, baseType: !192, size: 16, align: 16)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !193, line: 28, baseType: !96)
!193 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!194 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !189, file: !4, line: 185, baseType: !68, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !189, file: !4, line: 186, baseType: !196, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_sgroup_t", file: !4, line: 133, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_sgroup", file: !4, line: 109, size: 1024, align: 64, elements: !199)
!199 = !{!200, !201, !211, !212, !213, !214, !215, !217, !218, !219, !220, !221, !222, !239, !240, !241, !242, !243, !244}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !198, file: !4, line: 110, baseType: !68, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !198, file: !4, line: 111, baseType: !202, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !204, line: 34, baseType: !205)
!204 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !204, line: 30, size: 128, align: 64, elements: !206)
!206 = !{!207, !208, !209}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !205, file: !204, line: 31, baseType: !50, size: 32, align: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !205, file: !204, line: 32, baseType: !50, size: 32, align: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !205, file: !204, line: 33, baseType: !210, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !198, file: !4, line: 112, baseType: !35, size: 64, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_fault", scope: !198, file: !4, line: 113, baseType: !50, size: 32, align: 32, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_init", scope: !198, file: !4, line: 114, baseType: !50, size: 32, align: 32, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !198, file: !4, line: 115, baseType: !66, size: 32, align: 32, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sgroup_tracking_weight", scope: !198, file: !4, line: 116, baseType: !216, size: 8, align: 8, offset: 288)
!216 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !198, file: !4, line: 119, baseType: !35, size: 64, align: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !198, file: !4, line: 120, baseType: !35, size: 64, align: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !198, file: !4, line: 121, baseType: !35, size: 64, align: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "track_bfd", scope: !198, file: !4, line: 122, baseType: !35, size: 64, align: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !198, file: !4, line: 125, baseType: !216, size: 8, align: 8, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !198, file: !4, line: 126, baseType: !223, size: 64, align: 64, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !225, line: 65, baseType: !226)
!225 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !225, line: 59, size: 192, align: 64, elements: !227)
!227 = !{!228, !230, !231, !232, !236}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !226, file: !225, line: 60, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !226, file: !225, line: 61, baseType: !66, size: 32, align: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !226, file: !225, line: 62, baseType: !66, size: 32, align: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !226, file: !225, line: 63, baseType: !233, size: 32, align: 32, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !234, line: 80, baseType: !235)
!234 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !93, line: 125, baseType: !50)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !226, file: !225, line: 64, baseType: !237, size: 32, align: 32, offset: 160)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !234, line: 65, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !93, line: 126, baseType: !50)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !198, file: !4, line: 127, baseType: !223, size: 64, align: 64, offset: 704)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !198, file: !4, line: 128, baseType: !223, size: 64, align: 64, offset: 768)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !198, file: !4, line: 129, baseType: !223, size: 64, align: 64, offset: 832)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !198, file: !4, line: 130, baseType: !223, size: 64, align: 64, offset: 896)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !198, file: !4, line: 131, baseType: !66, size: 32, align: 32, offset: 960)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !198, file: !4, line: 132, baseType: !66, size: 32, align: 32, offset: 992)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !189, file: !4, line: 187, baseType: !246, size: 64, align: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_stats", file: !4, line: 169, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_stats", file: !4, line: 136, size: 768, align: 64, elements: !249)
!249 = !{!250, !253, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "advert_rcvd", scope: !248, file: !4, line: 137, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !252, line: 55, baseType: !115)
!252 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!253 = !DIDerivedType(tag: DW_TAG_member, name: "advert_sent", scope: !248, file: !4, line: 138, baseType: !254, size: 32, align: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !252, line: 51, baseType: !50)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "become_master", scope: !248, file: !4, line: 140, baseType: !254, size: 32, align: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "release_master", scope: !248, file: !4, line: 141, baseType: !254, size: 32, align: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "packet_len_err", scope: !248, file: !4, line: 143, baseType: !251, size: 64, align: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "advert_interval_err", scope: !248, file: !4, line: 144, baseType: !251, size: 64, align: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl_err", scope: !248, file: !4, line: 145, baseType: !251, size: 64, align: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_type_rcvd", scope: !248, file: !4, line: 146, baseType: !251, size: 64, align: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list_err", scope: !248, file: !4, line: 147, baseType: !251, size: 64, align: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_authtype", scope: !248, file: !4, line: 149, baseType: !254, size: 32, align: 32, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "authtype_mismatch", scope: !248, file: !4, line: 151, baseType: !254, size: 32, align: 32, offset: 544)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "auth_failure", scope: !248, file: !4, line: 152, baseType: !254, size: 32, align: 32, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_rcvd", scope: !248, file: !4, line: 155, baseType: !251, size: 64, align: 64, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_sent", scope: !248, file: !4, line: 156, baseType: !251, size: 64, align: 64, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !189, file: !4, line: 188, baseType: !268, size: 64, align: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !34, line: 111, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !34, line: 76, size: 1792, align: 64, elements: !271)
!271 = !{!272, !276, !278, !284, !303, !304, !305, !306, !307, !313, !314, !315, !316, !317, !318, !320, !321, !322, !323, !344, !345, !346, !347, !348, !349, !350, !351}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !270, file: !34, line: 77, baseType: !273, size: 128, align: 8)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 128, align: 8, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 16)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !270, file: !34, line: 78, baseType: !277, size: 32, align: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !34, line: 62, baseType: !254)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !270, file: !34, line: 79, baseType: !279, size: 32, align: 32, offset: 160)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !280, line: 31, size: 32, align: 32, elements: !281)
!280 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!281 = !{!282}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !279, file: !280, line: 33, baseType: !283, size: 32, align: 32)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !280, line: 30, baseType: !254)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !270, file: !34, line: 80, baseType: !285, size: 128, align: 32, offset: 192)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !280, line: 211, size: 128, align: 32, elements: !286)
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !285, file: !280, line: 220, baseType: !288, size: 128, align: 32)
!288 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !285, file: !280, line: 213, size: 128, align: 32, elements: !289)
!289 = !{!290, !294, !299}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !288, file: !280, line: 215, baseType: !291, size: 128, align: 8)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 128, align: 8, elements: !274)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !252, line: 48, baseType: !293)
!293 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !288, file: !280, line: 217, baseType: !295, size: 128, align: 16)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 128, align: 16, elements: !297)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !252, line: 49, baseType: !96)
!297 = !{!298}
!298 = !DISubrange(count: 8)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !288, file: !280, line: 218, baseType: !300, size: 128, align: 32)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 128, align: 32, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 4)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !270, file: !34, line: 81, baseType: !50, size: 32, align: 32, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !270, file: !34, line: 82, baseType: !216, size: 8, align: 8, offset: 352)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !270, file: !34, line: 83, baseType: !254, size: 32, align: 32, offset: 384)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !270, file: !34, line: 84, baseType: !96, size: 16, align: 16, offset: 416)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !270, file: !34, line: 85, baseType: !308, size: 256, align: 8, offset: 432)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 256, align: 8, elements: !311)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !234, line: 33, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !93, line: 30, baseType: !293)
!311 = !{!312}
!312 = !DISubrange(count: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !270, file: !34, line: 86, baseType: !308, size: 256, align: 8, offset: 688)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !270, file: !34, line: 87, baseType: !113, size: 64, align: 64, offset: 960)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !270, file: !34, line: 88, baseType: !66, size: 32, align: 32, offset: 1024)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !270, file: !34, line: 90, baseType: !216, size: 8, align: 8, offset: 1056)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !270, file: !34, line: 91, baseType: !277, size: 32, align: 32, offset: 1088)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !270, file: !34, line: 92, baseType: !319, size: 64, align: 64, offset: 1152)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !270, file: !34, line: 94, baseType: !277, size: 32, align: 32, offset: 1216)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !270, file: !34, line: 96, baseType: !319, size: 64, align: 64, offset: 1280)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !270, file: !34, line: 97, baseType: !216, size: 8, align: 8, offset: 1344)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !270, file: !34, line: 100, baseType: !324, size: 64, align: 64, offset: 1408)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !34, line: 73, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !34, line: 65, size: 704, align: 64, elements: !327)
!327 = !{!328, !338, !339, !340, !341, !342, !343}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !326, file: !34, line: 66, baseType: !329, size: 128, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !330, line: 31, baseType: !331)
!330 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !332, line: 30, size: 128, align: 64, elements: !333)
!332 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!333 = !{!334, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !331, file: !332, line: 32, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !93, line: 139, baseType: !94)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !331, file: !332, line: 33, baseType: !337, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !93, line: 141, baseType: !94)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !326, file: !34, line: 67, baseType: !216, size: 8, align: 8, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !326, file: !34, line: 68, baseType: !329, size: 128, align: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !326, file: !34, line: 69, baseType: !216, size: 8, align: 8, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !326, file: !34, line: 70, baseType: !329, size: 128, align: 64, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !326, file: !34, line: 71, baseType: !329, size: 128, align: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !326, file: !34, line: 72, baseType: !66, size: 32, align: 32, offset: 640)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !270, file: !34, line: 101, baseType: !216, size: 8, align: 8, offset: 1472)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !270, file: !34, line: 102, baseType: !66, size: 32, align: 32, offset: 1504)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !270, file: !34, line: 103, baseType: !254, size: 32, align: 32, offset: 1536)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !270, file: !34, line: 104, baseType: !254, size: 32, align: 32, offset: 1568)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !270, file: !34, line: 105, baseType: !254, size: 32, align: 32, offset: 1600)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !270, file: !34, line: 107, baseType: !50, size: 32, align: 32, offset: 1632)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !270, file: !34, line: 109, baseType: !216, size: 8, align: 8, offset: 1664)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !270, file: !34, line: 110, baseType: !35, size: 64, align: 64, offset: 1728)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track_primary", scope: !189, file: !4, line: 189, baseType: !216, size: 8, align: 8, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !189, file: !4, line: 190, baseType: !216, size: 8, align: 8, offset: 328)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "skip_check_adv_addr", scope: !189, file: !4, line: 191, baseType: !216, size: 8, align: 8, offset: 336)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "strict_mode", scope: !189, file: !4, line: 193, baseType: !50, size: 32, align: 32, offset: 352)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_flags", scope: !189, file: !4, line: 195, baseType: !115, size: 64, align: 64, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_ifname", scope: !189, file: !4, line: 196, baseType: !273, size: 128, align: 8, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !189, file: !4, line: 198, baseType: !35, size: 64, align: 64, offset: 576)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !189, file: !4, line: 199, baseType: !35, size: 64, align: 64, offset: 640)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !189, file: !4, line: 200, baseType: !35, size: 64, align: 64, offset: 704)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_if_fault", scope: !189, file: !4, line: 204, baseType: !50, size: 32, align: 32, offset: 768)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_init", scope: !189, file: !4, line: 205, baseType: !50, size: 32, align: 32, offset: 800)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !189, file: !4, line: 206, baseType: !364, size: 1024, align: 64, offset: 832)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !365, line: 166, size: 1024, align: 64, elements: !366)
!365 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!366 = !{!367, !368, !372}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !364, file: !365, line: 168, baseType: !192, size: 16, align: 16)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !364, file: !365, line: 169, baseType: !369, size: 944, align: 8, offset: 16)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 944, align: 8, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 118)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !364, file: !365, line: 170, baseType: !115, size: 64, align: 64, offset: 960)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "saddr_from_config", scope: !189, file: !4, line: 207, baseType: !216, size: 8, align: 8, offset: 1856)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "track_saddr", scope: !189, file: !4, line: 208, baseType: !216, size: 8, align: 8, offset: 1864)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_saddr", scope: !189, file: !4, line: 209, baseType: !364, size: 1024, align: 64, offset: 1920)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_peer", scope: !189, file: !4, line: 210, baseType: !35, size: 64, align: 64, offset: 2944)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_chksum_compat", scope: !189, file: !4, line: 212, baseType: !378, size: 32, align: 32, offset: 3008)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "chksum_compatibility_t", file: !4, line: 179, baseType: !3)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "master_saddr", scope: !189, file: !4, line: 214, baseType: !364, size: 1024, align: 64, offset: 3072)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "master_priority", scope: !189, file: !4, line: 215, baseType: !292, size: 8, align: 8, offset: 4096)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "last_transition", scope: !189, file: !4, line: 216, baseType: !329, size: 128, align: 64, offset: 4160)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !189, file: !4, line: 217, baseType: !50, size: 32, align: 32, offset: 4288)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh", scope: !189, file: !4, line: 218, baseType: !329, size: 128, align: 64, offset: 4352)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_timer", scope: !189, file: !4, line: 219, baseType: !329, size: 128, align: 64, offset: 4480)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "garp_rep", scope: !189, file: !4, line: 220, baseType: !50, size: 32, align: 32, offset: 4608)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_rep", scope: !189, file: !4, line: 221, baseType: !50, size: 32, align: 32, offset: 4640)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_delay", scope: !189, file: !4, line: 222, baseType: !50, size: 32, align: 32, offset: 4672)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "garp_pending", scope: !189, file: !4, line: 223, baseType: !216, size: 8, align: 8, offset: 4704)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "gna_pending", scope: !189, file: !4, line: 224, baseType: !216, size: 8, align: 8, offset: 4712)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_rep", scope: !189, file: !4, line: 225, baseType: !50, size: 32, align: 32, offset: 4736)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "lower_prio_no_advert", scope: !189, file: !4, line: 226, baseType: !50, size: 32, align: 32, offset: 4768)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "higher_prio_send_advert", scope: !189, file: !4, line: 227, baseType: !50, size: 32, align: 32, offset: 4800)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "vrid", scope: !189, file: !4, line: 228, baseType: !292, size: 8, align: 8, offset: 4832)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "base_priority", scope: !189, file: !4, line: 229, baseType: !292, size: 8, align: 8, offset: 4840)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "effective_priority", scope: !189, file: !4, line: 230, baseType: !292, size: 8, align: 8, offset: 4848)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "total_priority", scope: !189, file: !4, line: 231, baseType: !66, size: 32, align: 32, offset: 4864)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "vipset", scope: !189, file: !4, line: 233, baseType: !216, size: 8, align: 8, offset: 4896)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !189, file: !4, line: 234, baseType: !35, size: 64, align: 64, offset: 4928)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "evip", scope: !189, file: !4, line: 235, baseType: !35, size: 64, align: 64, offset: 4992)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries", scope: !189, file: !4, line: 239, baseType: !216, size: 8, align: 8, offset: 5056)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "evip_add_ipv6", scope: !189, file: !4, line: 240, baseType: !216, size: 8, align: 8, offset: 5064)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "vroutes", scope: !189, file: !4, line: 241, baseType: !35, size: 64, align: 64, offset: 5120)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "vrules", scope: !189, file: !4, line: 242, baseType: !35, size: 64, align: 64, offset: 5184)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "adver_int", scope: !189, file: !4, line: 243, baseType: !50, size: 32, align: 32, offset: 5248)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "master_adver_int", scope: !189, file: !4, line: 244, baseType: !50, size: 32, align: 32, offset: 5280)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !189, file: !4, line: 249, baseType: !50, size: 32, align: 32, offset: 5312)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_rx_buf_size", scope: !189, file: !4, line: 252, baseType: !113, size: 64, align: 64, offset: 5376)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rules_set", scope: !189, file: !4, line: 254, baseType: !216, size: 8, align: 8, offset: 5440)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "nopreempt", scope: !189, file: !4, line: 255, baseType: !216, size: 8, align: 8, offset: 5448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_delay", scope: !189, file: !4, line: 256, baseType: !115, size: 64, align: 64, offset: 5504)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_time", scope: !189, file: !4, line: 260, baseType: !329, size: 128, align: 64, offset: 5568)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !189, file: !4, line: 261, baseType: !66, size: 32, align: 32, offset: 5696)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "wantstate", scope: !189, file: !4, line: 265, baseType: !66, size: 32, align: 32, offset: 5728)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "reload_master", scope: !189, file: !4, line: 266, baseType: !216, size: 8, align: 8, offset: 5760)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sockets", scope: !189, file: !4, line: 267, baseType: !416, size: 64, align: 64, offset: 5824)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_t", file: !418, line: 50, baseType: !419)
!418 = !DIFile(filename: "./../include/vrrp_sock.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sock", file: !418, line: 40, size: 1344, align: 64, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428, !429}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !419, file: !418, line: 41, baseType: !192, size: 16, align: 16)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !419, file: !418, line: 42, baseType: !364, size: 1024, align: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !419, file: !418, line: 43, baseType: !66, size: 32, align: 32, offset: 1088)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !419, file: !418, line: 44, baseType: !277, size: 32, align: 32, offset: 1120)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "unicast", scope: !419, file: !418, line: 45, baseType: !216, size: 8, align: 8, offset: 1152)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "fd_in", scope: !419, file: !418, line: 46, baseType: !66, size: 32, align: 32, offset: 1184)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "fd_out", scope: !419, file: !418, line: 47, baseType: !66, size: 32, align: 32, offset: 1216)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_size", scope: !419, file: !418, line: 48, baseType: !66, size: 32, align: 32, offset: 1248)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !419, file: !418, line: 49, baseType: !430, size: 64, align: 64, offset: 1280)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !12, line: 99, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !12, line: 78, size: 768, align: 64, elements: !433)
!433 = !{!434, !435, !437, !490, !495, !496, !497, !509, !511}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !432, file: !12, line: 79, baseType: !115, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !432, file: !12, line: 80, baseType: !436, size: 32, align: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !12, line: 63, baseType: !11)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !432, file: !12, line: 81, baseType: !438, size: 64, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !12, line: 112, size: 1280, align: 64, elements: !440)
!440 = !{!441, !453, !454, !455, !456, !464, !465, !466, !467, !468, !471, !482, !483, !484, !485, !486, !487, !488, !489}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !439, file: !12, line: 113, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !443, line: 109, baseType: !444)
!443 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !443, line: 106, size: 64, align: 64, elements: !445)
!445 = !{!446}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !444, file: !443, line: 108, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !443, line: 97, size: 192, align: 64, elements: !449)
!449 = !{!450, !451, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !448, file: !443, line: 99, baseType: !115, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !448, file: !443, line: 102, baseType: !447, size: 64, align: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !448, file: !443, line: 103, baseType: !447, size: 64, align: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !439, file: !12, line: 114, baseType: !442, size: 64, align: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !439, file: !12, line: 115, baseType: !442, size: 64, align: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !439, file: !12, line: 116, baseType: !442, size: 64, align: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !439, file: !12, line: 117, baseType: !457, size: 128, align: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !458, line: 62, baseType: !459)
!458 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !458, line: 60, size: 128, align: 64, elements: !460)
!460 = !{!461, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !459, file: !458, line: 61, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !459, file: !458, line: 61, baseType: !462, size: 64, align: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !439, file: !12, line: 121, baseType: !457, size: 128, align: 64, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !439, file: !12, line: 122, baseType: !457, size: 128, align: 64, offset: 512)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !439, file: !12, line: 124, baseType: !35, size: 64, align: 64, offset: 640)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !439, file: !12, line: 127, baseType: !442, size: 64, align: 64, offset: 704)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !439, file: !12, line: 128, baseType: !469, size: 64, align: 64, offset: 768)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !12, line: 128, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !439, file: !12, line: 129, baseType: !472, size: 64, align: 64, offset: 832)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !12, line: 109, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !12, line: 102, size: 448, align: 64, elements: !475)
!475 = !{!476, !477, !478, !479, !480}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !474, file: !12, line: 103, baseType: !430, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !474, file: !12, line: 104, baseType: !430, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !474, file: !12, line: 105, baseType: !115, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !474, file: !12, line: 106, baseType: !66, size: 32, align: 32, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !474, file: !12, line: 108, baseType: !481, size: 192, align: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !443, line: 104, baseType: !448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !439, file: !12, line: 130, baseType: !50, size: 32, align: 32, offset: 896)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !439, file: !12, line: 131, baseType: !50, size: 32, align: 32, offset: 928)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !439, file: !12, line: 132, baseType: !66, size: 32, align: 32, offset: 960)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !439, file: !12, line: 135, baseType: !66, size: 32, align: 32, offset: 992)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !439, file: !12, line: 136, baseType: !430, size: 64, align: 64, offset: 1024)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !439, file: !12, line: 146, baseType: !115, size: 64, align: 64, offset: 1088)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !439, file: !12, line: 147, baseType: !115, size: 64, align: 64, offset: 1152)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !439, file: !12, line: 148, baseType: !216, size: 8, align: 8, offset: 1216)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !432, file: !12, line: 82, baseType: !491, size: 64, align: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!66, !494}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !432, file: !12, line: 83, baseType: !47, size: 64, align: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !432, file: !12, line: 84, baseType: !329, size: 128, align: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !432, file: !12, line: 92, baseType: !498, size: 64, align: 32, offset: 448)
!498 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !432, file: !12, line: 85, size: 64, align: 32, elements: !499)
!499 = !{!500, !501, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !498, file: !12, line: 86, baseType: !66, size: 32, align: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !498, file: !12, line: 87, baseType: !66, size: 32, align: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !498, file: !12, line: 91, baseType: !503, size: 64, align: 32)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !498, file: !12, line: 88, size: 64, align: 32, elements: !504)
!504 = !{!505, !508}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !503, file: !12, line: 89, baseType: !506, size: 32, align: 32)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !234, line: 98, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !93, line: 133, baseType: !66)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !503, file: !12, line: 90, baseType: !66, size: 32, align: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !432, file: !12, line: 93, baseType: !510, size: 64, align: 64, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, scope: !432, file: !12, line: 95, baseType: !512, size: 192, align: 64, offset: 576)
!512 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !432, file: !12, line: 95, size: 192, align: 64, elements: !513)
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !512, file: !12, line: 96, baseType: !481, size: 192, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !512, file: !12, line: 97, baseType: !457, size: 128, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !189, file: !4, line: 269, baseType: !66, size: 32, align: 32, offset: 5888)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !189, file: !4, line: 271, baseType: !66, size: 32, align: 32, offset: 5920)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !189, file: !4, line: 274, baseType: !66, size: 32, align: 32, offset: 5952)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !189, file: !4, line: 275, baseType: !66, size: 32, align: 32, offset: 5984)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !189, file: !4, line: 276, baseType: !216, size: 8, align: 8, offset: 6016)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !189, file: !4, line: 277, baseType: !223, size: 64, align: 64, offset: 6080)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !189, file: !4, line: 278, baseType: !223, size: 64, align: 64, offset: 6144)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !189, file: !4, line: 279, baseType: !223, size: 64, align: 64, offset: 6208)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !189, file: !4, line: 280, baseType: !223, size: 64, align: 64, offset: 6272)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "script_master_rx_lower_pri", scope: !189, file: !4, line: 281, baseType: !223, size: 64, align: 64, offset: 6336)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !189, file: !4, line: 282, baseType: !223, size: 64, align: 64, offset: 6400)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ms_down_timer", scope: !189, file: !4, line: 285, baseType: !254, size: 32, align: 32, offset: 6464)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !189, file: !4, line: 286, baseType: !329, size: 128, align: 64, offset: 6528)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !189, file: !4, line: 289, baseType: !68, size: 64, align: 64, offset: 6656)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer_size", scope: !189, file: !4, line: 290, baseType: !113, size: 64, align: 64, offset: 6720)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_csum", scope: !189, file: !4, line: 291, baseType: !254, size: 32, align: 32, offset: 6784)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "auth_type", scope: !189, file: !4, line: 295, baseType: !292, size: 8, align: 8, offset: 6816)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "auth_data", scope: !189, file: !4, line: 296, baseType: !534, size: 64, align: 8, offset: 6824)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 64, align: 8, elements: !297)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ipsecah_counter", scope: !189, file: !4, line: 299, baseType: !536, size: 64, align: 32, offset: 6912)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_counter_t", file: !537, line: 58, baseType: !538)
!537 = !DIFile(filename: "./../include/vrrp_ipsecah.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--vrrp--libvrrp.a")
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seq_counter", file: !537, line: 55, size: 64, align: 32, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !538, file: !537, line: 56, baseType: !216, size: 8, align: 8)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "seq_number", scope: !538, file: !537, line: 57, baseType: !254, size: 32, align: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !189, file: !4, line: 309, baseType: !66, size: 32, align: 32, offset: 6976)
!543 = !DILocation(line: 69, column: 10, scope: !159)
!544 = !DILocation(line: 71, column: 14, scope: !545)
!545 = distinct !DILexicalBlock(scope: !159, file: !122, line: 71, column: 2)
!546 = !DILocation(line: 71, column: 13, scope: !545)
!547 = !DILocation(line: 71, column: 12, scope: !545)
!548 = !DILocation(line: 71, column: 12, scope: !549)
!549 = !DILexicalBlockFile(scope: !545, file: !122, discriminator: 1)
!550 = !DILocation(line: 71, column: 13, scope: !551)
!551 = !DILexicalBlockFile(scope: !545, file: !122, discriminator: 2)
!552 = !DILocation(line: 71, column: 17, scope: !551)
!553 = !DILocation(line: 71, column: 12, scope: !551)
!554 = !DILocation(line: 71, column: 12, scope: !555)
!555 = !DILexicalBlockFile(scope: !545, file: !122, discriminator: 3)
!556 = !DILocation(line: 71, column: 9, scope: !555)
!557 = !DILocation(line: 71, column: 7, scope: !555)
!558 = !DILocation(line: 71, column: 24, scope: !559)
!559 = !DILexicalBlockFile(scope: !560, file: !122, discriminator: 4)
!560 = distinct !DILexicalBlock(scope: !545, file: !122, line: 71, column: 2)
!561 = !DILocation(line: 71, column: 2, scope: !559)
!562 = !DILocation(line: 72, column: 12, scope: !563)
!563 = distinct !DILexicalBlock(scope: !560, file: !122, line: 71, column: 46)
!564 = !DILocation(line: 72, column: 16, scope: !563)
!565 = !DILocation(line: 72, column: 10, scope: !563)
!566 = !DILocation(line: 72, column: 8, scope: !563)
!567 = !DILocation(line: 73, column: 11, scope: !563)
!568 = !DILocation(line: 73, column: 40, scope: !563)
!569 = !DILocation(line: 73, column: 46, scope: !563)
!570 = !DILocation(line: 73, column: 3, scope: !563)
!571 = !DILocation(line: 74, column: 11, scope: !563)
!572 = !DILocation(line: 74, column: 3, scope: !563)
!573 = !DILocation(line: 75, column: 11, scope: !563)
!574 = !DILocation(line: 75, column: 47, scope: !563)
!575 = !DILocation(line: 75, column: 53, scope: !563)
!576 = !DILocation(line: 75, column: 60, scope: !563)
!577 = !DILocation(line: 75, column: 3, scope: !563)
!578 = !DILocation(line: 76, column: 11, scope: !563)
!579 = !DILocation(line: 76, column: 35, scope: !563)
!580 = !DILocation(line: 76, column: 41, scope: !563)
!581 = !DILocation(line: 76, column: 48, scope: !563)
!582 = !DILocation(line: 76, column: 3, scope: !563)
!583 = !DILocation(line: 77, column: 11, scope: !563)
!584 = !DILocation(line: 77, column: 42, scope: !563)
!585 = !DILocation(line: 77, column: 48, scope: !563)
!586 = !DILocation(line: 77, column: 55, scope: !563)
!587 = !DILocation(line: 77, column: 3, scope: !563)
!588 = !DILocation(line: 78, column: 11, scope: !563)
!589 = !DILocation(line: 79, column: 4, scope: !563)
!590 = !DILocation(line: 79, column: 10, scope: !563)
!591 = !DILocation(line: 79, column: 17, scope: !563)
!592 = !DILocation(line: 78, column: 3, scope: !563)
!593 = !DILocation(line: 80, column: 11, scope: !563)
!594 = !DILocation(line: 80, column: 3, scope: !563)
!595 = !DILocation(line: 81, column: 11, scope: !563)
!596 = !DILocation(line: 81, column: 45, scope: !563)
!597 = !DILocation(line: 81, column: 51, scope: !563)
!598 = !DILocation(line: 81, column: 58, scope: !563)
!599 = !DILocation(line: 81, column: 3, scope: !563)
!600 = !DILocation(line: 82, column: 11, scope: !563)
!601 = !DILocation(line: 82, column: 42, scope: !563)
!602 = !DILocation(line: 82, column: 48, scope: !563)
!603 = !DILocation(line: 82, column: 55, scope: !563)
!604 = !DILocation(line: 82, column: 3, scope: !563)
!605 = !DILocation(line: 83, column: 11, scope: !563)
!606 = !DILocation(line: 84, column: 4, scope: !563)
!607 = !DILocation(line: 84, column: 10, scope: !563)
!608 = !DILocation(line: 84, column: 17, scope: !563)
!609 = !DILocation(line: 83, column: 3, scope: !563)
!610 = !DILocation(line: 85, column: 11, scope: !563)
!611 = !DILocation(line: 86, column: 4, scope: !563)
