; ModuleID = './libDynxdr_la-dynxdr.o.i'
source_filename = "./libDynxdr_la-dynxdr.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.xdr_ops = type { i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i64*)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*, i8*, i32)*, i32 (%struct.XDR*)*, i32 (%struct.XDR*, i32)*, i32* (%struct.XDR*, i32)*, void (%struct.XDR*)*, i32 (%struct.XDR*, i32*)*, i32 (%struct.XDR*, i32*)* }
%struct.XDR = type { i32, %struct.xdr_ops*, i8*, i8*, i8*, i32 }
%struct.DynXdrData = type { %struct.DynBuf, i8 }
%struct.DynBuf = type { i8*, i64, i64 }

@DynXdr_Create.dynXdrOps = internal global %struct.xdr_ops { i32 (%struct.XDR*, i64*)* null, i32 (%struct.XDR*, i64*)* @DynXdrPutLong, i32 (%struct.XDR*, i8*, i32)* null, i32 (%struct.XDR*, i8*, i32)* @DynXdrPutBytes, i32 (%struct.XDR*)* @DynXdrGetPos, i32 (%struct.XDR*, i32)* @DynXdrSetPos, i32* (%struct.XDR*, i32)* @DynXdrInline, void (%struct.XDR*)* null, i32 (%struct.XDR*, i32*)* null, i32 (%struct.XDR*, i32*)* @DynXdrPutInt32 }, align 8

; Function Attrs: nounwind uwtable
define %struct.XDR* @DynXdr_Create(%struct.XDR*) #0 !dbg !43 {
  %2 = alloca %struct.XDR*, align 8
  %3 = alloca %struct.XDR*, align 8
  %4 = alloca %struct.XDR*, align 8
  %5 = alloca %struct.DynXdrData*, align 8
  store %struct.XDR* %0, %struct.XDR** %3, align 8
  call void @llvm.dbg.declare(metadata %struct.XDR** %3, metadata !117, metadata !118), !dbg !119

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, globals: !41)
!1 = !DIFile(filename: "libDynxdr_la-dynxdr.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line147")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdr_op", file: !4, line: 81, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/rpc/xdr.h", directory: "/home/lichi/Desktop/open-vm-tools/line147")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "XDR_ENCODE", value: 0)
!7 = !DIEnumerator(name: "XDR_DECODE", value: 1)
!8 = !DIEnumerator(name: "XDR_FREE", value: 2)
!9 = !{!10, !11, !13, !32, !36, !25, !40}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "DynXdrData", file: !15, line: 43, baseType: !16)
!15 = !DIFile(filename: "dynxdr.c", directory: "/home/lichi/Desktop/open-vm-tools/line147")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynXdrData", file: !15, line: 40, size: 256, align: 64, elements: !17)
!17 = !{!18, !29}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !16, file: !15, line: 41, baseType: !19, size: 192, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "DynBuf", file: !20, line: 40, baseType: !21)
!20 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dynbuf.h", directory: "/home/lichi/Desktop/open-vm-tools/line147")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynBuf", file: !20, line: 36, size: 192, align: 64, elements: !22)
!22 = !{!23, !24, !28}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !21, file: !20, line: 37, baseType: !11, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !21, file: !20, line: 38, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !26, line: 216, baseType: !27)
!26 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line147")
!27 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !21, file: !20, line: 39, baseType: !25, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "freeMe", scope: !16, file: !15, line: 42, baseType: !30, size: 8, align: 8, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !31, line: 230, baseType: !12)
!31 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line147")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32", file: !31, line: 174, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !34, line: 196, baseType: !35)
!34 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line147")
!35 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !34, line: 35, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !38, line: 32, baseType: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line147")
!39 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!41 = !{!42}
!42 = distinct !DIGlobalVariable(name: "dynXdrOps", scope: !43, file: !15, line: 314, type: !53, isLocal: true, isDefinition: true, variable: %struct.xdr_ops* @DynXdr_Create.dynXdrOps)
!43 = distinct !DISubprogram(name: "DynXdr_Create", scope: !15, file: !15, line: 312, type: !44, isLocal: false, isDefinition: true, scopeLine: 313, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !113)
!44 = !DISubroutineType(types: !45)
!45 = !{!46, !46}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDR", file: !4, line: 109, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "XDR", file: !4, line: 110, size: 384, align: 64, elements: !49)
!49 = !{!50, !51, !109, !110, !111, !112}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "x_op", scope: !48, file: !4, line: 112, baseType: !3, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x_ops", scope: !48, file: !4, line: 136, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdr_ops", file: !4, line: 113, size: 640, align: 64, elements: !54)
!54 = !{!55, !63, !69, !75, !81, !87, !91, !95, !99, !103}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "x_getlong", scope: !53, file: !4, line: 115, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !46, !61}
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool_t", file: !60, line: 37, baseType: !35)
!60 = !DIFile(filename: "/usr/include/rpc/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line147")
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "x_putlong", scope: !53, file: !4, line: 117, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!59, !46, !67}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "x_getbytes", scope: !53, file: !4, line: 119, baseType: !70, size: 64, align: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!59, !46, !73, !36}
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !34, line: 116, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__caddr_t", file: !38, line: 183, baseType: !11)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "x_putbytes", scope: !53, file: !4, line: 121, baseType: !76, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!59, !46, !79, !36}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "x_getpostn", scope: !53, file: !4, line: 123, baseType: !82, size: 64, align: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!36, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "x_setpostn", scope: !53, file: !4, line: 125, baseType: !88, size: 64, align: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!59, !46, !36}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "x_inline", scope: !53, file: !4, line: 127, baseType: !92, size: 64, align: 64, offset: 384)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!40, !46, !36}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "x_destroy", scope: !53, file: !4, line: 129, baseType: !96, size: 64, align: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !46}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "x_getint32", scope: !53, file: !4, line: 131, baseType: !100, size: 64, align: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!59, !46, !40}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "x_putint32", scope: !53, file: !4, line: 133, baseType: !104, size: 64, align: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!59, !46, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "x_public", scope: !48, file: !4, line: 137, baseType: !73, size: 64, align: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "x_private", scope: !48, file: !4, line: 138, baseType: !73, size: 64, align: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "x_base", scope: !48, file: !4, line: 139, baseType: !73, size: 64, align: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "x_handy", scope: !48, file: !4, line: 140, baseType: !36, size: 32, align: 32, offset: 320)
!113 = !{}
!114 = !{i32 2, !"Dwarf Version", i32 4}
!115 = !{i32 2, !"Debug Info Version", i32 3}
!116 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!117 = !DILocalVariable(name: "in", arg: 1, scope: !43, file: !15, line: 312, type: !46)
!118 = !DIExpression()
!119 = !DILocation(line: 312, column: 20, scope: !43)
!120 = !DILocalVariable(name: "ret", scope: !43, file: !15, line: 341, type: !46)
!121 = !DILocation(line: 341, column: 9, scope: !43)
!122 = !DILocalVariable(name: "priv", scope: !43, file: !15, line: 342, type: !13)
!123 = !DILocation(line: 342, column: 16, scope: !43)
!124 = !DILocation(line: 344, column: 8, scope: !125)
!125 = distinct !DILexicalBlock(scope: !43, file: !15, line: 344, column: 8)
!126 = !DILocation(line: 344, column: 11, scope: !125)
!127 = !DILocation(line: 344, column: 8, scope: !43)
!128 = !DILocation(line: 345, column: 13, scope: !129)
!129 = distinct !DILexicalBlock(scope: !125, file: !15, line: 344, column: 19)
!130 = !DILocation(line: 345, column: 11, scope: !129)
!131 = !DILocation(line: 346, column: 11, scope: !132)
!132 = distinct !DILexicalBlock(scope: !129, file: !15, line: 346, column: 11)
!133 = !DILocation(line: 346, column: 15, scope: !132)
!134 = !DILocation(line: 346, column: 11, scope: !129)
!135 = !DILocation(line: 347, column: 1, scope: !136)
!136 = distinct !DILexicalBlock(scope: !132, file: !15, line: 346, column: 23)
!137 = !DILocation(line: 348, column: 10, scope: !136)
!138 = !DILocation(line: 350, column: 4, scope: !129)
!139 = !DILocation(line: 351, column: 13, scope: !140)
!140 = distinct !DILexicalBlock(scope: !125, file: !15, line: 350, column: 11)
!141 = !DILocation(line: 351, column: 11, scope: !140)
!142 = !DILocation(line: 354, column: 11, scope: !43)
!143 = !DILocation(line: 354, column: 9, scope: !43)
!144 = !DILocation(line: 355, column: 8, scope: !145)
!145 = distinct !DILexicalBlock(scope: !43, file: !15, line: 355, column: 8)
!146 = !DILocation(line: 355, column: 13, scope: !145)
!147 = !DILocation(line: 355, column: 8, scope: !43)
!148 = !DILocation(line: 355, column: 1, scope: !149)
!149 = !DILexicalBlockFile(scope: !150, file: !15, discriminator: 1)
!150 = distinct !DILexicalBlock(scope: !145, file: !15, line: 354, column: 21)
!151 = !DILocation(line: 356, column: 7, scope: !150)
!152 = !DILocation(line: 359, column: 20, scope: !43)
!153 = !DILocation(line: 359, column: 23, scope: !43)
!154 = !DILocation(line: 359, column: 19, scope: !43)
!155 = !DILocation(line: 359, column: 4, scope: !43)
!156 = !DILocation(line: 359, column: 10, scope: !43)
!157 = !DILocation(line: 359, column: 17, scope: !43)
!158 = !DILocation(line: 361, column: 4, scope: !43)
!159 = !DILocation(line: 361, column: 9, scope: !43)
!160 = !DILocation(line: 361, column: 14, scope: !43)
!161 = !DILocation(line: 362, column: 4, scope: !43)
!162 = !DILocation(line: 362, column: 9, scope: !43)
!163 = !DILocation(line: 362, column: 18, scope: !43)
!164 = !DILocation(line: 363, column: 30, scope: !43)
!165 = !DILocation(line: 363, column: 21, scope: !43)
!166 = !DILocation(line: 363, column: 4, scope: !43)
!167 = !DILocation(line: 363, column: 9, scope: !43)
!168 = !DILocation(line: 363, column: 19, scope: !43)
!169 = !DILocation(line: 364, column: 4, scope: !43)
!170 = !DILocation(line: 364, column: 9, scope: !43)
!171 = !DILocation(line: 364, column: 16, scope: !43)
!172 = !DILocation(line: 365, column: 4, scope: !43)
!173 = !DILocation(line: 365, column: 9, scope: !43)
!174 = !DILocation(line: 365, column: 15, scope: !43)
!175 = !DILocation(line: 367, column: 11, scope: !43)
!176 = !DILocation(line: 367, column: 4, scope: !43)
!177 = !DILocation(line: 370, column: 8, scope: !178)
!178 = distinct !DILexicalBlock(scope: !43, file: !15, line: 370, column: 8)
!179 = !DILocation(line: 370, column: 11, scope: !178)
