; ModuleID = '/home/lichi/Desktop/genwqe/[task]misc--zpipe_append/[inter]misc--zpipe_append.o.i'
source_filename = "/home/lichi/Desktop/genwqe/[task]misc--zpipe_append/[inter]misc--zpipe_append.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.internal_state = type opaque

@.str = private unnamed_addr constant [17 x i8] c"This is the END!\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"ZLIB\00", align 1
@_pattern = internal global i32 0, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !7)
!1 = !DIFile(filename: "/home/lichi/Desktop/genwqe/[task]misc--zpipe_append/[inter]misc--zpipe_append.o.i", directory: "/home/lichi/Desktop")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !{!8, !29, !30, !31, !33}
!8 = distinct !DIGlobalVariable(name: "long_options", scope: !9, file: !10, line: 418, type: !16, isLocal: true, isDefinition: true, variable: [12 x %struct.option]* @main.long_options)
!9 = distinct !DISubprogram(name: "main", scope: !10, file: !10, line: 393, type: !11, isLocal: false, isDefinition: true, scopeLine: 394, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!10 = !DIFile(filename: "zpipe_append.c", directory: "/home/lichi/Desktop")
!11 = !DISubroutineType(types: !12)
!12 = !{!6, !6, !13}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 3072, align: 64, elements: !27)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !18, line: 104, size: 256, align: 64, elements: !19)
!18 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/lichi/Desktop")
!19 = !{!20, !23, !24, !26}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !17, file: !18, line: 106, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !17, file: !18, line: 109, baseType: !6, size: 32, align: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !17, file: !18, line: 110, baseType: !25, size: 64, align: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !17, file: !18, line: 111, baseType: !6, size: 32, align: 32, offset: 192)
!27 = !{!28}
!28 = !DISubrange(count: 12)
!29 = distinct !DIGlobalVariable(name: "_pattern", scope: !0, file: !10, line: 62, type: !6, isLocal: true, isDefinition: true, variable: i32* @_pattern)
!30 = distinct !DIGlobalVariable(name: "verbose", scope: !0, file: !10, line: 59, type: !6, isLocal: true, isDefinition: true, variable: i32* @verbose)
!31 = distinct !DIGlobalVariable(name: "CHUNK_i", scope: !0, file: !10, line: 60, type: !32, isLocal: true, isDefinition: true, variable: i32* @CHUNK_i)
!32 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!33 = distinct !DIGlobalVariable(name: "CHUNK_o", scope: !0, file: !10, line: 61, type: !32, isLocal: true, isDefinition: true, variable: i32* @CHUNK_o)
!34 = !{i32 2, !"Dwarf Version", i32 4}
!35 = !{i32 2, !"Debug Info Version", i32 3}
!36 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!37 = !DILocalVariable(name: "argc", arg: 1, scope: !9, file: !10, line: 393, type: !6)
!38 = !DIExpression()
!39 = !DILocation(line: 393, column: 14, scope: !9)
!40 = !DILocalVariable(name: "argv", arg: 2, scope: !9, file: !10, line: 393, type: !13)
!41 = !DILocation(line: 393, column: 27, scope: !9)
!42 = !DILocalVariable(name: "j", scope: !9, file: !10, line: 395, type: !6)
!43 = !DILocation(line: 395, column: 6, scope: !9)
!44 = !DILocalVariable(name: "rc", scope: !9, file: !10, line: 395, type: !6)
!45 = !DILocation(line: 395, column: 9, scope: !9)
!46 = !DILocalVariable(name: "expected_bytes", scope: !9, file: !10, line: 396, type: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 216, baseType: !49)
!48 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop")
!49 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!50 = !DILocation(line: 396, column: 9, scope: !9)
!51 = !DILocalVariable(name: "decompressed_bytes", scope: !9, file: !10, line: 396, type: !47)
!52 = !DILocation(line: 396, column: 29, scope: !9)
!53 = !DILocalVariable(name: "input_size", scope: !9, file: !10, line: 396, type: !47)
!54 = !DILocation(line: 396, column: 53, scope: !9)
!55 = !DILocalVariable(name: "i_fp", scope: !9, file: !10, line: 397, type: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !58, line: 48, baseType: !59)
!58 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 241, size: 1728, align: 64, elements: !61)
!60 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop")
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !82, !83, !84, !85, !89, !91, !93, !97, !100, !102, !103, !104, !105, !106, !107, !108}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !59, file: !60, line: 242, baseType: !6, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !59, file: !60, line: 247, baseType: !14, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !59, file: !60, line: 248, baseType: !14, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !59, file: !60, line: 249, baseType: !14, size: 64, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !59, file: !60, line: 250, baseType: !14, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !59, file: !60, line: 251, baseType: !14, size: 64, align: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !59, file: !60, line: 252, baseType: !14, size: 64, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !59, file: !60, line: 253, baseType: !14, size: 64, align: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !59, file: !60, line: 254, baseType: !14, size: 64, align: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !59, file: !60, line: 256, baseType: !14, size: 64, align: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !59, file: !60, line: 257, baseType: !14, size: 64, align: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !59, file: !60, line: 258, baseType: !14, size: 64, align: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !59, file: !60, line: 260, baseType: !75, size: 64, align: 64, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !60, line: 156, size: 192, align: 64, elements: !77)
!77 = !{!78, !79, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !76, file: !60, line: 157, baseType: !75, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !76, file: !60, line: 158, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !76, file: !60, line: 162, baseType: !6, size: 32, align: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !59, file: !60, line: 262, baseType: !80, size: 64, align: 64, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !59, file: !60, line: 264, baseType: !6, size: 32, align: 32, offset: 896)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !59, file: !60, line: 268, baseType: !6, size: 32, align: 32, offset: 928)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !59, file: !60, line: 270, baseType: !86, size: 64, align: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !87, line: 131, baseType: !88)
!87 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop")
!88 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !59, file: !60, line: 274, baseType: !90, size: 16, align: 16, offset: 1024)
!90 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !59, file: !60, line: 275, baseType: !92, size: 8, align: 8, offset: 1040)
!92 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !59, file: !60, line: 276, baseType: !94, size: 8, align: 8, offset: 1048)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, align: 8, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 1)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !59, file: !60, line: 280, baseType: !98, size: 64, align: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !60, line: 150, baseType: null)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !59, file: !60, line: 289, baseType: !101, size: 64, align: 64, offset: 1152)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !87, line: 132, baseType: !88)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !59, file: !60, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !59, file: !60, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !59, file: !60, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !59, file: !60, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !59, file: !60, line: 302, baseType: !47, size: 64, align: 64, offset: 1472)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !59, file: !60, line: 303, baseType: !6, size: 32, align: 32, offset: 1536)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !59, file: !60, line: 305, baseType: !109, size: 160, align: 8, offset: 1568)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, align: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 20)
!112 = !DILocation(line: 397, column: 8, scope: !9)
!113 = !DILocalVariable(name: "o_fp", scope: !9, file: !10, line: 397, type: !56)
!114 = !DILocation(line: 397, column: 15, scope: !9)
!115 = !DILocalVariable(name: "n_fp", scope: !9, file: !10, line: 397, type: !56)
!116 = !DILocation(line: 397, column: 22, scope: !9)
!117 = !DILocalVariable(name: "i_fname", scope: !9, file: !10, line: 398, type: !118)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 512, align: 8, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 64)
!121 = !DILocation(line: 398, column: 7, scope: !9)
!122 = !DILocalVariable(name: "o_fname", scope: !9, file: !10, line: 398, type: !118)
!123 = !DILocation(line: 398, column: 20, scope: !9)
!124 = !DILocalVariable(name: "n_fname", scope: !9, file: !10, line: 398, type: !118)
!125 = !DILocation(line: 398, column: 33, scope: !9)
!126 = !DILocalVariable(name: "diff_cmd", scope: !9, file: !10, line: 399, type: !127)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 1024, align: 8, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 128)
!130 = !DILocation(line: 399, column: 7, scope: !9)
!131 = !DILocalVariable(name: "pattern", scope: !9, file: !10, line: 400, type: !21)
!132 = !DILocation(line: 400, column: 14, scope: !9)
!133 = !DILocalVariable(name: "window_bits", scope: !9, file: !10, line: 401, type: !6)
!134 = !DILocation(line: 401, column: 6, scope: !9)
!135 = !DILocalVariable(name: "format", scope: !9, file: !10, line: 402, type: !21)
!136 = !DILocation(line: 402, column: 14, scope: !9)
!137 = !DILocalVariable(name: "flush", scope: !9, file: !10, line: 403, type: !6)
!138 = !DILocation(line: 403, column: 6, scope: !9)
!139 = !DILocalVariable(name: "exact_input", scope: !9, file: !10, line: 404, type: !6)
!140 = !DILocation(line: 404, column: 6, scope: !9)
!141 = !DILocalVariable(name: "exact_output", scope: !9, file: !10, line: 404, type: !6)
!142 = !DILocation(line: 404, column: 23, scope: !9)
!143 = !DILocalVariable(name: "size", scope: !9, file: !10, line: 405, type: !47)
!144 = !DILocation(line: 405, column: 9, scope: !9)
!145 = !DILocalVariable(name: "expect_z_stream_end", scope: !9, file: !10, line: 406, type: !6)
!146 = !DILocation(line: 406, column: 6, scope: !9)
!147 = !DILocalVariable(name: "keep", scope: !9, file: !10, line: 407, type: !6)
!148 = !DILocation(line: 407, column: 6, scope: !9)
!149 = !DILocation(line: 409, column: 13, scope: !9)
!150 = !DILocation(line: 409, column: 11, scope: !9)
!151 = !DILocation(line: 415, column: 2, scope: !9)
!152 = !DILocalVariable(name: "ch", scope: !153, file: !10, line: 416, type: !6)
!153 = distinct !DILexicalBlock(scope: !9, file: !10, line: 415, column: 12)
!154 = !DILocation(line: 416, column: 7, scope: !153)
!155 = !DILocalVariable(name: "option_index", scope: !153, file: !10, line: 417, type: !6)
!156 = !DILocation(line: 417, column: 7, scope: !153)
!157 = !DILocation(line: 433, column: 20, scope: !153)
!158 = !DILocation(line: 433, column: 26, scope: !153)
!159 = !DILocation(line: 433, column: 8, scope: !153)
!160 = !DILocation(line: 433, column: 6, scope: !153)
!161 = !DILocation(line: 435, column: 7, scope: !162)
!162 = distinct !DILexicalBlock(scope: !153, file: !10, line: 435, column: 7)
!163 = !DILocation(line: 435, column: 10, scope: !162)
!164 = !DILocation(line: 435, column: 7, scope: !153)
!165 = !DILocation(line: 436, column: 4, scope: !162)
!166 = !DILocation(line: 438, column: 11, scope: !153)
!167 = !DILocation(line: 438, column: 3, scope: !153)
!168 = !DILocation(line: 441, column: 13, scope: !169)
!169 = distinct !DILexicalBlock(scope: !153, file: !10, line: 438, column: 15)
!170 = !DILocation(line: 441, column: 11, scope: !169)
!171 = !DILocation(line: 442, column: 4, scope: !169)
!172 = !DILocation(line: 444, column: 15, scope: !173)
!173 = distinct !DILexicalBlock(scope: !169, file: !10, line: 444, column: 8)
!174 = !DILocation(line: 444, column: 8, scope: !173)
!175 = !DILocation(line: 444, column: 37, scope: !173)
!176 = !DILocation(line: 444, column: 8, scope: !169)
!177 = !DILocation(line: 445, column: 11, scope: !173)
!178 = !DILocation(line: 445, column: 5, scope: !173)
!179 = !DILocation(line: 446, column: 20, scope: !180)
!180 = distinct !DILexicalBlock(scope: !173, file: !10, line: 446, column: 13)
!181 = !DILocation(line: 446, column: 13, scope: !180)
!182 = !DILocation(line: 446, column: 47, scope: !180)
!183 = !DILocation(line: 446, column: 13, scope: !173)
!184 = !DILocation(line: 447, column: 11, scope: !180)
!185 = !DILocation(line: 447, column: 5, scope: !180)
!186 = !DILocation(line: 448, column: 20, scope: !187)
!187 = distinct !DILexicalBlock(scope: !180, file: !10, line: 448, column: 13)
!188 = !DILocation(line: 448, column: 13, scope: !187)
!189 = !DILocation(line: 448, column: 44, scope: !187)
!190 = !DILocation(line: 448, column: 13, scope: !180)
!191 = !DILocation(line: 449, column: 11, scope: !187)
!192 = !DILocation(line: 449, column: 5, scope: !187)
!193 = !DILocation(line: 450, column: 20, scope: !194)
!194 = distinct !DILexicalBlock(scope: !187, file: !10, line: 450, column: 13)
!195 = !DILocation(line: 450, column: 13, scope: !194)
!196 = !DILocation(line: 450, column: 44, scope: !194)
!197 = !DILocation(line: 450, column: 13, scope: !187)
!198 = !DILocation(line: 451, column: 11, scope: !194)
!199 = !DILocation(line: 451, column: 5, scope: !194)
!200 = !DILocation(line: 452, column: 4, scope: !169)
!201 = !DILocation(line: 454, column: 16, scope: !169)
!202 = !DILocation(line: 455, column: 4, scope: !169)
!203 = !DILocation(line: 457, column: 17, scope: !169)
!204 = !DILocation(line: 458, column: 4, scope: !169)
!205 = !DILocation(line: 460, column: 9, scope: !169)
!206 = !DILocation(line: 461, column: 4, scope: !169)
!207 = !DILocation(line: 463, column: 11, scope: !169)
!208 = !DILocation(line: 464, column: 4, scope: !169)
!209 = !DILocation(line: 466, column: 25, scope: !169)
!210 = !DILocation(line: 466, column: 14, scope: !169)
!211 = !DILocation(line: 466, column: 12, scope: !169)
!212 = !DILocation(line: 467, column: 4, scope: !169)
!213 = !DILocation(line: 469, column: 25, scope: !169)
!214 = !DILocation(line: 469, column: 14, scope: !169)
!215 = !DILocation(line: 469, column: 12, scope: !169)
!216 = !DILocation(line: 470, column: 4, scope: !169)
!217 = !DILocation(line: 472, column: 22, scope: !169)
!218 = !DILocation(line: 472, column: 11, scope: !169)
!219 = !DILocation(line: 472, column: 9, scope: !169)
!220 = !DILocation(line: 473, column: 4, scope: !169)
!221 = !DILocation(line: 475, column: 26, scope: !169)
!222 = !DILocation(line: 475, column: 15, scope: !169)
!223 = !DILocation(line: 475, column: 13, scope: !169)
!224 = !DILocation(line: 476, column: 4, scope: !169)
!225 = !DILocation(line: 479, column: 10, scope: !169)
!226 = !DILocation(line: 479, column: 4, scope: !169)
!227 = !DILocation(line: 480, column: 4, scope: !169)
!228 = !DILocation(line: 415, column: 2, scope: !229)
!229 = !DILexicalBlockFile(scope: !9, file: !10, discriminator: 1)
!230 = distinct !{!230, !151}
!231 = !DILocation(line: 485, column: 39, scope: !9)
!232 = !DILocation(line: 485, column: 16, scope: !9)
!233 = !DILocation(line: 485, column: 14, scope: !9)
!234 = !DILocation(line: 488, column: 10, scope: !9)
!235 = !DILocation(line: 488, column: 34, scope: !9)
!236 = !DILocation(line: 488, column: 44, scope: !9)
!237 = !DILocation(line: 488, column: 2, scope: !9)
!238 = !DILocation(line: 489, column: 10, scope: !9)
!239 = !DILocation(line: 489, column: 34, scope: !9)
!240 = !DILocation(line: 489, column: 44, scope: !9)
!241 = !DILocation(line: 489, column: 2, scope: !9)
!242 = !DILocation(line: 490, column: 10, scope: !9)
!243 = !DILocation(line: 490, column: 34, scope: !9)
!244 = !DILocation(line: 490, column: 44, scope: !9)
!245 = !DILocation(line: 490, column: 2, scope: !9)
!246 = !DILocation(line: 493, column: 15, scope: !9)
!247 = !DILocation(line: 493, column: 9, scope: !9)
!248 = !DILocation(line: 493, column: 7, scope: !9)
!249 = !DILocation(line: 494, column: 4, scope: !9)
!250 = !DILocation(line: 495, column: 13, scope: !9)
!251 = !DILocation(line: 496, column: 2, scope: !9)
!252 = !DILocation(line: 496, column: 9, scope: !229)
!253 = !DILocation(line: 496, column: 22, scope: !229)
!254 = !DILocation(line: 496, column: 20, scope: !229)
!255 = !DILocation(line: 496, column: 2, scope: !229)
!256 = !DILocation(line: 497, column: 16, scope: !257)
!257 = distinct !DILexicalBlock(scope: !9, file: !10, line: 496, column: 28)
!258 = !DILocation(line: 497, column: 40, scope: !257)
!259 = !DILocation(line: 497, column: 43, scope: !257)
!260 = !DILocation(line: 497, column: 52, scope: !257)
!261 = !DILocation(line: 497, column: 8, scope: !257)
!262 = !DILocation(line: 497, column: 6, scope: !257)
!263 = !DILocation(line: 498, column: 7, scope: !264)
!264 = distinct !DILexicalBlock(scope: !257, file: !10, line: 498, column: 7)
!265 = !DILocation(line: 498, column: 10, scope: !264)
!266 = !DILocation(line: 498, column: 7, scope: !257)
!267 = !DILocation(line: 499, column: 4, scope: !264)
!268 = !DILocation(line: 501, column: 17, scope: !257)
!269 = !DILocation(line: 501, column: 14, scope: !257)
!270 = !DILocation(line: 502, column: 4, scope: !257)
!271 = !DILocation(line: 496, column: 2, scope: !272)
!272 = !DILexicalBlockFile(scope: !9, file: !10, discriminator: 2)
!273 = distinct !{!273, !251}
!274 = !DILocation(line: 504, column: 9, scope: !9)
!275 = !DILocation(line: 504, column: 2, scope: !9)
!276 = !DILocation(line: 506, column: 15, scope: !9)
!277 = !DILocation(line: 506, column: 9, scope: !9)
!278 = !DILocation(line: 506, column: 7, scope: !9)
!279 = !DILocation(line: 507, column: 6, scope: !280)
!280 = distinct !DILexicalBlock(scope: !9, file: !10, line: 507, column: 6)
!281 = !DILocation(line: 507, column: 11, scope: !280)
!282 = !DILocation(line: 507, column: 6, scope: !9)
!283 = !DILocation(line: 508, column: 3, scope: !280)
!284 = !DILocation(line: 510, column: 15, scope: !9)
!285 = !DILocation(line: 510, column: 9, scope: !9)
!286 = !DILocation(line: 510, column: 7, scope: !9)
!287 = !DILocation(line: 511, column: 6, scope: !288)
!288 = distinct !DILexicalBlock(scope: !9, file: !10, line: 511, column: 6)
!289 = !DILocation(line: 511, column: 11, scope: !288)
!290 = !DILocation(line: 511, column: 6, scope: !9)
!291 = !DILocation(line: 512, column: 3, scope: !288)
!292 = !DILocation(line: 515, column: 11, scope: !9)
!293 = !DILocation(line: 515, column: 17, scope: !9)
!294 = !DILocation(line: 515, column: 23, scope: !9)
!295 = !DILocation(line: 515, column: 36, scope: !9)
!296 = !DILocation(line: 515, column: 7, scope: !9)
!297 = !DILocation(line: 515, column: 5, scope: !9)
!298 = !DILocation(line: 517, column: 6, scope: !299)
!299 = distinct !DILexicalBlock(scope: !9, file: !10, line: 517, column: 6)
!300 = !DILocation(line: 517, column: 9, scope: !299)
!301 = !DILocation(line: 517, column: 6, scope: !9)
!302 = !DILocation(line: 518, column: 10, scope: !303)
!303 = distinct !DILexicalBlock(scope: !299, file: !10, line: 517, column: 17)
!304 = !DILocation(line: 518, column: 3, scope: !303)
!305 = !DILocation(line: 519, column: 10, scope: !303)
!306 = !DILocation(line: 519, column: 3, scope: !303)
!307 = !DILocation(line: 520, column: 10, scope: !303)
!308 = !DILocation(line: 520, column: 3, scope: !303)
!309 = !DILocation(line: 521, column: 8, scope: !303)
!310 = !DILocation(line: 521, column: 3, scope: !303)
!311 = !DILocation(line: 522, column: 10, scope: !303)
!312 = !DILocation(line: 522, column: 3, scope: !303)
!313 = !DILocation(line: 524, column: 9, scope: !9)
!314 = !DILocation(line: 524, column: 2, scope: !9)
!315 = !DILocation(line: 527, column: 15, scope: !9)
!316 = !DILocation(line: 527, column: 27, scope: !9)
!317 = !DILocation(line: 527, column: 7, scope: !9)
!318 = !DILocation(line: 527, column: 5, scope: !9)
!319 = !DILocation(line: 530, column: 9, scope: !9)
!320 = !DILocation(line: 530, column: 2, scope: !9)
!321 = !DILocation(line: 532, column: 15, scope: !9)
!322 = !DILocation(line: 532, column: 9, scope: !9)
!323 = !DILocation(line: 532, column: 7, scope: !9)
!324 = !DILocation(line: 533, column: 6, scope: !325)
!325 = distinct !DILexicalBlock(scope: !9, file: !10, line: 533, column: 6)
!326 = !DILocation(line: 533, column: 11, scope: !325)
!327 = !DILocation(line: 533, column: 6, scope: !9)
!328 = !DILocation(line: 534, column: 3, scope: !325)
!329 = !DILocation(line: 536, column: 15, scope: !9)
!330 = !DILocation(line: 536, column: 9, scope: !9)
!331 = !DILocation(line: 536, column: 7, scope: !9)
!332 = !DILocation(line: 537, column: 6, scope: !333)
!333 = distinct !DILexicalBlock(scope: !9, file: !10, line: 537, column: 6)
!334 = !DILocation(line: 537, column: 11, scope: !333)
!335 = !DILocation(line: 537, column: 6, scope: !9)
!336 = !DILocation(line: 538, column: 3, scope: !333)
!337 = !DILocation(line: 551, column: 6, scope: !338)
!338 = distinct !DILexicalBlock(scope: !9, file: !10, line: 551, column: 6)
!339 = !DILocation(line: 551, column: 6, scope: !9)
!340 = !DILocation(line: 552, column: 13, scope: !338)
!341 = !DILocation(line: 552, column: 37, scope: !338)
!342 = !DILocation(line: 552, column: 30, scope: !338)
!343 = !DILocation(line: 552, column: 28, scope: !338)
!344 = !DILocation(line: 552, column: 11, scope: !338)
!345 = !DILocation(line: 552, column: 3, scope: !338)
!346 = !DILocation(line: 554, column: 6, scope: !347)
!347 = distinct !DILexicalBlock(scope: !9, file: !10, line: 554, column: 6)
!348 = !DILocation(line: 554, column: 6, scope: !9)
!349 = !DILocation(line: 555, column: 13, scope: !350)
!350 = distinct !DILexicalBlock(scope: !347, file: !10, line: 554, column: 20)
!351 = !DILocation(line: 555, column: 11, scope: !350)
!352 = !DILocation(line: 556, column: 23, scope: !350)
!353 = !DILocation(line: 557, column: 2, scope: !350)
!354 = !DILocation(line: 570, column: 11, scope: !9)
!355 = !DILocation(line: 570, column: 17, scope: !9)
!356 = !DILocation(line: 570, column: 23, scope: !9)
!357 = !DILocation(line: 570, column: 36, scope: !9)
!358 = !DILocation(line: 571, column: 4, scope: !9)
!359 = !DILocation(line: 570, column: 7, scope: !9)
!360 = !DILocation(line: 570, column: 5, scope: !9)
!361 = !DILocation(line: 572, column: 6, scope: !362)
!362 = distinct !DILexicalBlock(scope: !9, file: !10, line: 572, column: 6)
!363 = !DILocation(line: 572, column: 24, scope: !362)
!364 = !DILocation(line: 572, column: 21, scope: !362)
!365 = !DILocation(line: 572, column: 6, scope: !9)
!366 = !DILocation(line: 573, column: 10, scope: !367)
!367 = distinct !DILexicalBlock(scope: !362, file: !10, line: 572, column: 44)
!368 = !DILocation(line: 576, column: 15, scope: !367)
!369 = !DILocation(line: 577, column: 15, scope: !367)
!370 = !DILocation(line: 578, column: 16, scope: !367)
!371 = !DILocation(line: 578, column: 9, scope: !367)
!372 = !DILocation(line: 578, column: 4, scope: !367)
!373 = !DILocation(line: 573, column: 3, scope: !367)
!374 = !DILocation(line: 579, column: 3, scope: !367)
!375 = !DILocation(line: 582, column: 6, scope: !376)
!376 = distinct !DILexicalBlock(scope: !9, file: !10, line: 582, column: 6)
!377 = !DILocation(line: 582, column: 9, scope: !376)
!378 = !DILocation(line: 582, column: 6, scope: !9)
!379 = !DILocation(line: 583, column: 10, scope: !380)
!380 = distinct !DILexicalBlock(scope: !376, file: !10, line: 582, column: 17)
!381 = !DILocation(line: 583, column: 3, scope: !380)
!382 = !DILocation(line: 584, column: 10, scope: !380)
!383 = !DILocation(line: 584, column: 3, scope: !380)
!384 = !DILocation(line: 585, column: 10, scope: !380)
!385 = !DILocation(line: 585, column: 3, scope: !380)
!386 = !DILocation(line: 586, column: 8, scope: !380)
!387 = !DILocation(line: 586, column: 3, scope: !380)
!388 = !DILocation(line: 587, column: 10, scope: !380)
!389 = !DILocation(line: 587, column: 3, scope: !380)
!390 = !DILocation(line: 590, column: 9, scope: !9)
!391 = !DILocation(line: 590, column: 2, scope: !9)
!392 = !DILocation(line: 591, column: 9, scope: !9)
!393 = !DILocation(line: 591, column: 2, scope: !9)
!394 = !DILocation(line: 593, column: 10, scope: !9)
!395 = !DILocation(line: 593, column: 37, scope: !9)
!396 = !DILocation(line: 593, column: 46, scope: !9)
!397 = !DILocation(line: 593, column: 2, scope: !9)
!398 = !DILocation(line: 594, column: 14, scope: !9)
!399 = !DILocation(line: 594, column: 7, scope: !9)
!400 = !DILocation(line: 594, column: 5, scope: !9)
!401 = !DILocation(line: 595, column: 6, scope: !402)
!402 = distinct !DILexicalBlock(scope: !9, file: !10, line: 595, column: 6)
!403 = !DILocation(line: 595, column: 9, scope: !402)
!404 = !DILocation(line: 595, column: 6, scope: !9)
!405 = !DILocation(line: 596, column: 10, scope: !406)
!406 = distinct !DILexicalBlock(scope: !402, file: !10, line: 595, column: 15)
!407 = !DILocation(line: 597, column: 4, scope: !406)
!408 = !DILocation(line: 597, column: 13, scope: !406)
!409 = !DILocation(line: 596, column: 3, scope: !406)
!410 = !DILocation(line: 598, column: 3, scope: !406)
!411 = !DILocation(line: 601, column: 7, scope: !412)
!412 = distinct !DILexicalBlock(scope: !9, file: !10, line: 601, column: 6)
!413 = !DILocation(line: 601, column: 6, scope: !9)
!414 = !DILocation(line: 602, column: 10, scope: !415)
!415 = distinct !DILexicalBlock(scope: !412, file: !10, line: 601, column: 13)
!416 = !DILocation(line: 602, column: 3, scope: !415)
!417 = !DILocation(line: 603, column: 10, scope: !415)
!418 = !DILocation(line: 603, column: 3, scope: !415)
!419 = !DILocation(line: 604, column: 10, scope: !415)
!420 = !DILocation(line: 604, column: 3, scope: !415)
!421 = !DILocation(line: 605, column: 2, scope: !415)
!422 = !DILocation(line: 607, column: 2, scope: !9)
!423 = !DILocation(line: 608, column: 1, scope: !9)
!424 = distinct !DISubprogram(name: "str_to_num", scope: !10, file: !10, line: 357, type: !425, isLocal: true, isDefinition: true, scopeLine: 358, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!425 = !DISubroutineType(types: !426)
!426 = !{!427, !14}
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !428, line: 55, baseType: !49)
!428 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop")
!429 = !DILocalVariable(name: "str", arg: 1, scope: !424, file: !10, line: 357, type: !14)
!430 = !DILocation(line: 357, column: 41, scope: !424)
!431 = !DILocalVariable(name: "s", scope: !424, file: !10, line: 359, type: !14)
!432 = !DILocation(line: 359, column: 8, scope: !424)
!433 = !DILocation(line: 359, column: 12, scope: !424)
!434 = !DILocalVariable(name: "num", scope: !424, file: !10, line: 360, type: !427)
!435 = !DILocation(line: 360, column: 11, scope: !424)
!436 = !DILocation(line: 360, column: 26, scope: !424)
!437 = !DILocation(line: 360, column: 17, scope: !424)
!438 = !DILocation(line: 362, column: 7, scope: !439)
!439 = distinct !DILexicalBlock(scope: !424, file: !10, line: 362, column: 6)
!440 = !DILocation(line: 362, column: 6, scope: !439)
!441 = !DILocation(line: 362, column: 9, scope: !439)
!442 = !DILocation(line: 362, column: 6, scope: !424)
!443 = !DILocation(line: 363, column: 10, scope: !439)
!444 = !DILocation(line: 363, column: 3, scope: !439)
!445 = !DILocation(line: 365, column: 13, scope: !446)
!446 = distinct !DILexicalBlock(scope: !424, file: !10, line: 365, column: 6)
!447 = !DILocation(line: 365, column: 6, scope: !446)
!448 = !DILocation(line: 365, column: 23, scope: !446)
!449 = !DILocation(line: 365, column: 6, scope: !424)
!450 = !DILocation(line: 366, column: 7, scope: !446)
!451 = !DILocation(line: 366, column: 3, scope: !446)
!452 = !DILocation(line: 367, column: 18, scope: !453)
!453 = distinct !DILexicalBlock(scope: !446, file: !10, line: 367, column: 11)
!454 = !DILocation(line: 367, column: 11, scope: !453)
!455 = !DILocation(line: 367, column: 28, scope: !453)
!456 = !DILocation(line: 367, column: 11, scope: !446)
!457 = !DILocation(line: 368, column: 7, scope: !453)
!458 = !DILocation(line: 368, column: 3, scope: !453)
!459 = !DILocation(line: 369, column: 18, scope: !460)
!460 = distinct !DILexicalBlock(scope: !453, file: !10, line: 369, column: 11)
!461 = !DILocation(line: 369, column: 11, scope: !460)
!462 = !DILocation(line: 369, column: 28, scope: !460)
!463 = !DILocation(line: 369, column: 11, scope: !453)
!464 = !DILocation(line: 370, column: 7, scope: !460)
!465 = !DILocation(line: 370, column: 3, scope: !460)
!466 = !DILocation(line: 372, column: 9, scope: !424)
!467 = !DILocation(line: 372, column: 2, scope: !424)
!468 = !DILocation(line: 373, column: 1, scope: !424)
!469 = distinct !DISubprogram(name: "usage", scope: !10, file: !10, line: 375, type: !470, isLocal: true, isDefinition: true, scopeLine: 376, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !14}
!472 = !DILocalVariable(name: "prog", arg: 1, scope: !469, file: !10, line: 375, type: !14)
!473 = !DILocation(line: 375, column: 25, scope: !469)
!474 = !DILocalVariable(name: "b", scope: !469, file: !10, line: 377, type: !14)
!475 = !DILocation(line: 377, column: 8, scope: !469)
!476 = !DILocation(line: 377, column: 20, scope: !469)
!477 = !DILocation(line: 377, column: 11, scope: !469)
!478 = !DILocation(line: 379, column: 9, scope: !469)
!479 = !DILocation(line: 389, column: 3, scope: !469)
!480 = !DILocation(line: 389, column: 6, scope: !469)
!481 = !DILocation(line: 379, column: 2, scope: !469)
!482 = !DILocation(line: 390, column: 1, scope: !469)
!483 = distinct !DISubprogram(name: "figure_out_window_bits", scope: !10, file: !10, line: 69, type: !484, isLocal: true, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!484 = !DISubroutineType(types: !485)
!485 = !{!6, !21}
!486 = !DILocalVariable(name: "format", arg: 1, scope: !483, file: !10, line: 69, type: !21)
!487 = !DILocation(line: 69, column: 47, scope: !483)
!488 = !DILocation(line: 71, column: 13, scope: !489)
!489 = distinct !DILexicalBlock(scope: !483, file: !10, line: 71, column: 6)
!490 = !DILocation(line: 71, column: 6, scope: !489)
!491 = !DILocation(line: 71, column: 29, scope: !489)
!492 = !DILocation(line: 71, column: 6, scope: !483)
!493 = !DILocation(line: 72, column: 3, scope: !489)
!494 = !DILocation(line: 73, column: 18, scope: !495)
!495 = distinct !DILexicalBlock(scope: !489, file: !10, line: 73, column: 11)
!496 = !DILocation(line: 73, column: 11, scope: !495)
!497 = !DILocation(line: 73, column: 37, scope: !495)
!498 = !DILocation(line: 73, column: 11, scope: !489)
!499 = !DILocation(line: 74, column: 3, scope: !495)
!500 = !DILocation(line: 75, column: 18, scope: !501)
!501 = distinct !DILexicalBlock(scope: !495, file: !10, line: 75, column: 11)
!502 = !DILocation(line: 75, column: 11, scope: !501)
!503 = !DILocation(line: 75, column: 34, scope: !501)
!504 = !DILocation(line: 75, column: 11, scope: !495)
!505 = !DILocation(line: 76, column: 3, scope: !501)
!506 = !DILocation(line: 78, column: 2, scope: !483)
!507 = !DILocation(line: 79, column: 1, scope: !483)
!508 = distinct !DISubprogram(name: "def", scope: !10, file: !10, line: 87, type: !509, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!509 = !DISubroutineType(types: !510)
!510 = !{!6, !56, !56, !6, !6, !6, !511, !511}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!512 = !DILocalVariable(name: "source", arg: 1, scope: !508, file: !10, line: 87, type: !56)
!513 = !DILocation(line: 87, column: 22, scope: !508)
!514 = !DILocalVariable(name: "dest", arg: 2, scope: !508, file: !10, line: 87, type: !56)
!515 = !DILocation(line: 87, column: 36, scope: !508)
!516 = !DILocalVariable(name: "window_bits", arg: 3, scope: !508, file: !10, line: 87, type: !6)
!517 = !DILocation(line: 87, column: 46, scope: !508)
!518 = !DILocalVariable(name: "_flush", arg: 4, scope: !508, file: !10, line: 87, type: !6)
!519 = !DILocation(line: 87, column: 63, scope: !508)
!520 = !DILocalVariable(name: "level", arg: 5, scope: !508, file: !10, line: 88, type: !6)
!521 = !DILocation(line: 88, column: 13, scope: !508)
!522 = !DILocalVariable(name: "compressed_size", arg: 6, scope: !508, file: !10, line: 88, type: !511)
!523 = !DILocation(line: 88, column: 28, scope: !508)
!524 = !DILocalVariable(name: "uncompressed_size", arg: 7, scope: !508, file: !10, line: 88, type: !511)
!525 = !DILocation(line: 88, column: 53, scope: !508)
!526 = !DILocalVariable(name: "ret", scope: !508, file: !10, line: 90, type: !6)
!527 = !DILocation(line: 90, column: 6, scope: !508)
!528 = !DILocalVariable(name: "flush", scope: !508, file: !10, line: 90, type: !6)
!529 = !DILocation(line: 90, column: 11, scope: !508)
!530 = !DILocalVariable(name: "have", scope: !508, file: !10, line: 91, type: !32)
!531 = !DILocation(line: 91, column: 11, scope: !508)
!532 = !DILocalVariable(name: "strm", scope: !508, file: !10, line: 92, type: !533)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !534, line: 106, baseType: !535)
!534 = !DIFile(filename: "/usr/local/include/zlib.h", directory: "/home/lichi/Desktop")
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !534, line: 86, size: 896, align: 64, elements: !536)
!536 = !{!537, !543, !545, !547, !548, !549, !550, !551, !554, !560, !565, !566, !567, !568}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !535, file: !534, line: 87, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !540, line: 400, baseType: !541)
!540 = !DIFile(filename: "/usr/local/include/zconf.h", directory: "/home/lichi/Desktop")
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !540, line: 391, baseType: !542)
!542 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !535, file: !534, line: 88, baseType: !544, size: 32, align: 32, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !540, line: 393, baseType: !32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !535, file: !534, line: 89, baseType: !546, size: 64, align: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !540, line: 394, baseType: !49)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !535, file: !534, line: 91, baseType: !538, size: 64, align: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !535, file: !534, line: 92, baseType: !544, size: 32, align: 32, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !535, file: !534, line: 93, baseType: !546, size: 64, align: 64, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !535, file: !534, line: 95, baseType: !14, size: 64, align: 64, offset: 384)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !535, file: !534, line: 96, baseType: !552, size: 64, align: 64, offset: 448)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !534, line: 84, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !535, file: !534, line: 98, baseType: !555, size: 64, align: 64, offset: 512)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !534, line: 81, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64, align: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!559, !559, !544, !544}
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !540, line: 409, baseType: !4)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !535, file: !534, line: 99, baseType: !561, size: 64, align: 64, offset: 576)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !534, line: 82, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !559, !559}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !535, file: !534, line: 100, baseType: !559, size: 64, align: 64, offset: 640)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !535, file: !534, line: 102, baseType: !6, size: 32, align: 32, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !535, file: !534, line: 104, baseType: !546, size: 64, align: 64, offset: 768)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !535, file: !534, line: 105, baseType: !546, size: 64, align: 64, offset: 832)
!569 = !DILocation(line: 92, column: 11, scope: !508)
!570 = !DILocalVariable(name: "in", scope: !508, file: !10, line: 93, type: !571)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!572 = !DILocation(line: 93, column: 17, scope: !508)
!573 = !DILocalVariable(name: "out", scope: !508, file: !10, line: 94, type: !571)
!574 = !DILocation(line: 94, column: 17, scope: !508)
!575 = !DILocalVariable(name: "chunk_i", scope: !508, file: !10, line: 95, type: !32)
!576 = !DILocation(line: 95, column: 15, scope: !508)
!577 = !DILocation(line: 95, column: 25, scope: !508)
!578 = !DILocalVariable(name: "chunk_o", scope: !508, file: !10, line: 96, type: !32)
!579 = !DILocation(line: 96, column: 15, scope: !508)
!580 = !DILocation(line: 96, column: 25, scope: !508)
!581 = !DILocation(line: 98, column: 14, scope: !508)
!582 = !DILocation(line: 98, column: 7, scope: !508)
!583 = !DILocation(line: 98, column: 5, scope: !508)
!584 = !DILocation(line: 99, column: 6, scope: !585)
!585 = distinct !DILexicalBlock(scope: !508, file: !10, line: 99, column: 6)
!586 = !DILocation(line: 99, column: 9, scope: !585)
!587 = !DILocation(line: 99, column: 6, scope: !508)
!588 = !DILocation(line: 100, column: 3, scope: !585)
!589 = !DILocation(line: 102, column: 15, scope: !508)
!590 = !DILocation(line: 102, column: 8, scope: !508)
!591 = !DILocation(line: 102, column: 6, scope: !508)
!592 = !DILocation(line: 103, column: 6, scope: !593)
!593 = distinct !DILexicalBlock(scope: !508, file: !10, line: 103, column: 6)
!594 = !DILocation(line: 103, column: 10, scope: !593)
!595 = !DILocation(line: 103, column: 6, scope: !508)
!596 = !DILocation(line: 104, column: 8, scope: !597)
!597 = distinct !DILexicalBlock(scope: !593, file: !10, line: 103, column: 18)
!598 = !DILocation(line: 104, column: 3, scope: !597)
!599 = !DILocation(line: 105, column: 3, scope: !597)
!600 = !DILocation(line: 109, column: 7, scope: !508)
!601 = !DILocation(line: 109, column: 14, scope: !508)
!602 = !DILocation(line: 110, column: 7, scope: !508)
!603 = !DILocation(line: 110, column: 13, scope: !508)
!604 = !DILocation(line: 111, column: 7, scope: !508)
!605 = !DILocation(line: 111, column: 14, scope: !508)
!606 = !DILocation(line: 112, column: 7, scope: !508)
!607 = !DILocation(line: 112, column: 17, scope: !508)
!608 = !DILocation(line: 114, column: 7, scope: !508)
!609 = !DILocation(line: 114, column: 6, scope: !508)
!610 = !DILocation(line: 116, column: 6, scope: !611)
!611 = distinct !DILexicalBlock(scope: !508, file: !10, line: 116, column: 6)
!612 = !DILocation(line: 116, column: 10, scope: !611)
!613 = !DILocation(line: 116, column: 6, scope: !508)
!614 = !DILocation(line: 117, column: 8, scope: !615)
!615 = distinct !DILexicalBlock(scope: !611, file: !10, line: 116, column: 18)
!616 = !DILocation(line: 117, column: 3, scope: !615)
!617 = !DILocation(line: 118, column: 8, scope: !615)
!618 = !DILocation(line: 118, column: 3, scope: !615)
!619 = !DILocation(line: 119, column: 10, scope: !615)
!620 = !DILocation(line: 119, column: 3, scope: !615)
!621 = !DILocation(line: 123, column: 2, scope: !508)
!622 = distinct !{!622, !621}
!623 = !DILocation(line: 124, column: 13, scope: !624)
!624 = distinct !DILexicalBlock(scope: !508, file: !10, line: 123, column: 5)
!625 = !DILocation(line: 124, column: 11, scope: !624)
!626 = !DILocation(line: 125, column: 25, scope: !624)
!627 = !DILocation(line: 125, column: 32, scope: !624)
!628 = !DILocation(line: 125, column: 41, scope: !624)
!629 = !DILocation(line: 125, column: 19, scope: !624)
!630 = !DILocation(line: 125, column: 8, scope: !624)
!631 = !DILocation(line: 125, column: 17, scope: !624)
!632 = !DILocation(line: 126, column: 14, scope: !633)
!633 = distinct !DILexicalBlock(scope: !624, file: !10, line: 126, column: 7)
!634 = !DILocation(line: 126, column: 7, scope: !633)
