; ModuleID = './hgfsServerParameters.o.i'
source_filename = "./hgfsServerParameters.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.HgfsOpCapability = type { i32, i32 }
%struct.HgfsRequest = type { i32, i32 }
%struct.HgfsHeader = type <{ i8, [3 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i64, i64 }>
%struct.HgfsFileOpenInfo = type { i32, i32, i64, i32, i32, i8, i8, i8, i8, i64, i64, i32, i32, i32, i32, i32, i8*, i8*, i32, %struct.HgfsShareInfo }
%struct.HgfsShareInfo = type { i8*, i64, i8, i8, i32 }
%struct.HgfsRequestOpenV3 = type <{ i64, i32, i32, i8, i8, i8, i8, i64, i64, i32, i32, i32, i64, i64, %struct.HgfsFileNameV3 }>
%struct.HgfsFileNameV3 = type <{ i32, i32, i32, i32, [1 x i8] }>
%struct.HgfsRequestOpenV2 = type <{ %struct.HgfsRequest, i64, i32, i32, i8, i8, i8, i8, i64, i64, i32, i32, i32, i64, i64, %struct.HgfsFileName }>
%struct.HgfsFileName = type <{ i32, [1 x i8] }>
%struct.HgfsRequestOpen = type <{ %struct.HgfsRequest, i32, i32, i8, %struct.HgfsFileName }>
%struct.HgfsReply = type { i32, i32 }
%struct.HgfsPacket = type { i64, i64, i8*, i64, i32, i64, i8, i32, i8*, i64, i32, i64, i32, i8, i32, i8*, i64, i64, i8, [2 x %struct.HgfsVmxIov], i32, [1 x %struct.HgfsVmxIov] }
%struct.HgfsVmxIov = type { i8*, i64, i32, i8* }

!95 = !DIEnumerator(name: "HGFS_OPEN_EMPTY", value: 1)
!96 = !DIEnumerator(name: "HGFS_OPEN_CREATE", value: 2)
!97 = !DIEnumerator(name: "HGFS_OPEN_CREATE_SAFE", value: 3)
!98 = !DIEnumerator(name: "HGFS_OPEN_CREATE_EMPTY", value: 4)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 294, size: 32, align: 32, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106}
!101 = !DIEnumerator(name: "HGFS_LOCK_NONE", value: 0)
!102 = !DIEnumerator(name: "HGFS_LOCK_OPPORTUNISTIC", value: 1)
!103 = !DIEnumerator(name: "HGFS_LOCK_EXCLUSIVE", value: 2)
!104 = !DIEnumerator(name: "HGFS_LOCK_SHARED", value: 3)
!105 = !DIEnumerator(name: "HGFS_LOCK_BATCH", value: 4)
!106 = !DIEnumerator(name: "HGFS_LOCK_LEASE", value: 5)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 627, size: 32, align: 32, elements: !108)
!108 = !{!109, !110, !111}
!109 = !DIEnumerator(name: "HGFS_FILE_NAME_DEFAULT_CASE", value: 0)
!110 = !DIEnumerator(name: "HGFS_FILE_NAME_CASE_SENSITIVE", value: 1)
!111 = !DIEnumerator(name: "HGFS_FILE_NAME_CASE_INSENSITIVE", value: 2)
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !86, line: 177, size: 32, align: 32, elements: !113)
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133}
!114 = !DIEnumerator(name: "HGFS_STATUS_SUCCESS", value: 0)
!115 = !DIEnumerator(name: "HGFS_STATUS_NO_SUCH_FILE_OR_DIR", value: 1)
!116 = !DIEnumerator(name: "HGFS_STATUS_INVALID_HANDLE", value: 2)
!117 = !DIEnumerator(name: "HGFS_STATUS_OPERATION_NOT_PERMITTED", value: 3)
!118 = !DIEnumerator(name: "HGFS_STATUS_FILE_EXISTS", value: 4)
!119 = !DIEnumerator(name: "HGFS_STATUS_NOT_DIRECTORY", value: 5)
!120 = !DIEnumerator(name: "HGFS_STATUS_DIR_NOT_EMPTY", value: 6)
!121 = !DIEnumerator(name: "HGFS_STATUS_PROTOCOL_ERROR", value: 7)
!122 = !DIEnumerator(name: "HGFS_STATUS_ACCESS_DENIED", value: 8)
!123 = !DIEnumerator(name: "HGFS_STATUS_INVALID_NAME", value: 9)
!124 = !DIEnumerator(name: "HGFS_STATUS_GENERIC_ERROR", value: 10)
!125 = !DIEnumerator(name: "HGFS_STATUS_SHARING_VIOLATION", value: 11)
!126 = !DIEnumerator(name: "HGFS_STATUS_NO_SPACE", value: 12)
!127 = !DIEnumerator(name: "HGFS_STATUS_OPERATION_NOT_SUPPORTED", value: 13)
!128 = !DIEnumerator(name: "HGFS_STATUS_NAME_TOO_LONG", value: 14)
!129 = !DIEnumerator(name: "HGFS_STATUS_INVALID_PARAMETER", value: 15)
!130 = !DIEnumerator(name: "HGFS_STATUS_NOT_SAME_DEVICE", value: 16)
!131 = !DIEnumerator(name: "HGFS_STATUS_STALE_SESSION", value: 17)
!132 = !DIEnumerator(name: "HGFS_STATUS_TOO_MANY_SESSIONS", value: 18)
!133 = !DIEnumerator(name: "HGFS_STATUS_TRANSPORT_ERROR", value: 19)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !135, line: 36, size: 32, align: 32, elements: !136)
!135 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hgfsServer.h", directory: "/home/lichi/Desktop/open-vm-tools/line400")
!136 = !{!137, !138, !139}
!137 = !DIEnumerator(name: "BUF_READABLE", value: 0)
!138 = !DIEnumerator(name: "BUF_WRITEABLE", value: 1)
!139 = !DIEnumerator(name: "BUF_READWRITEABLE", value: 2)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !141, line: 297, size: 32, align: 32, elements: !142)
!141 = !DIFile(filename: "hgfsServerInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line400")
!142 = !{!143, !144}
!143 = !DIEnumerator(name: "HGFS_SESSION_STATE_OPEN", value: 0)
!144 = !DIEnumerator(name: "HGFS_SESSION_STATE_CLOSED", value: 1)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !141, line: 111, size: 32, align: 32, elements: !146)
!146 = !{!147, !148, !149}
!147 = !DIEnumerator(name: "FILENODE_STATE_UNUSED", value: 0)
!148 = !DIEnumerator(name: "FILENODE_STATE_IN_USE_CACHED", value: 1)
!149 = !DIEnumerator(name: "FILENODE_STATE_IN_USE_NOT_CACHED", value: 2)
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !141, line: 118, size: 32, align: 32, elements: !151)
!151 = !{!152, !153, !154}
!152 = !DIEnumerator(name: "DIRECTORY_SEARCH_TYPE_DIR", value: 0)
!153 = !DIEnumerator(name: "DIRECTORY_SEARCH_TYPE_BASE", value: 1)
!154 = !DIEnumerator(name: "DIRECTORY_SEARCH_TYPE_OTHER", value: 2)
!155 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !86, line: 95, size: 32, align: 32, elements: !156)
!156 = !{!157, !158, !159}
!157 = !DIEnumerator(name: "HGFS_FILE_TYPE_REGULAR", value: 0)
!158 = !DIEnumerator(name: "HGFS_FILE_TYPE_DIRECTORY", value: 1)
!159 = !DIEnumerator(name: "HGFS_FILE_TYPE_SYMLINK", value: 2)
!160 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 914, size: 32, align: 32, elements: !161)
!161 = !{!162}
!162 = !DIEnumerator(name: "HGFS_WIN32_STREAM_IGNORE_SECURITY", value: 1)
!163 = !{!164, !177, !202, !169, !203, !211, !213, !239, !250, !170}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsRequest", file: !4, line: 671, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsRequest", file: !4, line: 666, size: 64, align: 8, elements: !167)
!167 = !{!168, !175}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !166, file: !4, line: 667, baseType: !169, size: 32, align: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsHandle", file: !4, line: 58, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !171, line: 173, baseType: !172)
!171 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line400")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !173, line: 51, baseType: !174)
!173 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line400")
!174 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !166, file: !4, line: 668, baseType: !176, size: 32, align: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsOp", file: !4, line: 152, baseType: !3)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsHeader", file: !4, line: 1700, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsHeader", file: !4, line: 1685, size: 416, align: 8, elements: !180)
!180 = !{!181, !185, !189, !190, !191, !192, !193, !194, !195, !196, !197, !201}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !179, file: !4, line: 1686, baseType: !182, size: 8, align: 8)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !171, line: 177, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !173, line: 48, baseType: !184)
!184 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !179, file: !4, line: 1687, baseType: !186, size: 24, align: 8, offset: 8)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 24, align: 8, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 3)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !179, file: !4, line: 1688, baseType: !176, size: 32, align: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "packetSize", scope: !179, file: !4, line: 1689, baseType: !170, size: 32, align: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "headerSize", scope: !179, file: !4, line: 1690, baseType: !170, size: 32, align: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "requestId", scope: !179, file: !4, line: 1691, baseType: !170, size: 32, align: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !179, file: !4, line: 1692, baseType: !176, size: 32, align: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !179, file: !4, line: 1693, baseType: !170, size: 32, align: 32, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !179, file: !4, line: 1694, baseType: !170, size: 32, align: 32, offset: 224)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "information", scope: !179, file: !4, line: 1695, baseType: !170, size: 32, align: 32, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sessionId", scope: !179, file: !4, line: 1696, baseType: !198, size: 64, align: 64, offset: 288)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !171, line: 171, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !173, line: 55, baseType: !200)
!200 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !179, file: !4, line: 1697, baseType: !198, size: 64, align: 64, offset: 352)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsRequestOplockBreakV4", file: !4, line: 2204, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsRequestOplockBreakV4", file: !4, line: 2198, size: 128, align: 8, elements: !206)
!206 = !{!207, !208, !210}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !205, file: !4, line: 2199, baseType: !169, size: 32, align: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "serverLock", scope: !205, file: !4, line: 2200, baseType: !209, size: 32, align: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsLockType", file: !4, line: 301, baseType: !99)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !205, file: !4, line: 2201, baseType: !198, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsRequestNotifyV4", file: !4, line: 2009, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsRequestNotifyV4", file: !4, line: 2001, size: 392, align: 8, elements: !216)
!216 = !{!217, !219, !220, !221, !222}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "watchId", scope: !215, file: !4, line: 2002, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSubscriberHandle", file: !4, line: 1953, baseType: !198)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !215, file: !4, line: 2003, baseType: !170, size: 32, align: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !215, file: !4, line: 2004, baseType: !170, size: 32, align: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !215, file: !4, line: 2005, baseType: !198, size: 64, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !215, file: !4, line: 2006, baseType: !223, size: 200, align: 8, offset: 192)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 200, align: 8, elements: !237)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsNotifyEventV4", file: !4, line: 1990, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsNotifyEventV4", file: !4, line: 1983, size: 200, align: 8, elements: !226)
!226 = !{!227, !228, !229, !230}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "nextOffset", scope: !225, file: !4, line: 1984, baseType: !170, size: 32, align: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !225, file: !4, line: 1985, baseType: !198, size: 64, align: 64, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !225, file: !4, line: 1986, baseType: !198, size: 64, align: 64, offset: 96)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "fileName", scope: !225, file: !4, line: 1987, baseType: !231, size: 40, align: 8, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsFileName", file: !4, line: 606, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsFileName", file: !4, line: 601, size: 40, align: 8, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !232, file: !4, line: 602, baseType: !170, size: 32, align: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !232, file: !4, line: 603, baseType: !236, size: 8, align: 8, offset: 32)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 8, align: 8, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 1)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsFileNameV3", file: !4, line: 649, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsFileNameV3", file: !4, line: 641, size: 136, align: 8, elements: !243)
!243 = !{!244, !245, !246, !248, !249}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !242, file: !4, line: 642, baseType: !170, size: 32, align: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !242, file: !4, line: 643, baseType: !170, size: 32, align: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "caseType", scope: !242, file: !4, line: 644, baseType: !247, size: 32, align: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsCaseType", file: !4, line: 631, baseType: !107)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !242, file: !4, line: 645, baseType: !169, size: 32, align: 32, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !242, file: !4, line: 646, baseType: !236, size: 8, align: 8, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !231)
!252 = !{!253}
!253 = distinct !DIGlobalVariable(name: "hgfsDefaultCapabilityTable", scope: !0, file: !254, line: 56, type: !255, isLocal: true, isDefinition: true, variable: [65 x %struct.HgfsOpCapability]* @hgfsDefaultCapabilityTable)
!254 = !DIFile(filename: "hgfsServerParameters.c", directory: "/home/lichi/Desktop/open-vm-tools/line400")
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 4160, align: 8, elements: !262)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsOpCapability", file: !4, line: 1808, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsOpCapability", file: !4, line: 1803, size: 64, align: 8, elements: !258)
!258 = !{!259, !260}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !257, file: !4, line: 1804, baseType: !176, size: 32, align: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !257, file: !4, line: 1805, baseType: !261, size: 32, align: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsOpCapFlags", file: !4, line: 1702, baseType: !170)
!262 = !{!263}
!263 = !DISubrange(count: 65)
!264 = !{i32 2, !"Dwarf Version", i32 4}
!265 = !{i32 2, !"Debug Info Version", i32 3}
!266 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!267 = distinct !DISubprogram(name: "HgfsValidateReplySize", scope: !254, file: !254, line: 143, type: !268, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !275)
!268 = !DISubroutineType(types: !269)
!269 = !{!270, !271, !176, !273}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !171, line: 230, baseType: !212)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !212)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !274, line: 216, baseType: !200)
!274 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line400")
!275 = !{}
!276 = !DILocalVariable(name: "packetIn", arg: 1, scope: !267, file: !254, line: 143, type: !271)
!277 = !DIExpression()
!278 = !DILocation(line: 143, column: 35, scope: !267)
!279 = !DILocalVariable(name: "op", arg: 2, scope: !267, file: !254, line: 144, type: !176)
!280 = !DILocation(line: 144, column: 30, scope: !267)
!281 = !DILocalVariable(name: "packetSize", arg: 3, scope: !267, file: !254, line: 145, type: !273)
!282 = !DILocation(line: 145, column: 30, scope: !267)
!283 = !DILocalVariable(name: "result", scope: !267, file: !254, line: 147, type: !270)
!284 = !DILocation(line: 147, column: 9, scope: !267)
!285 = !DILocalVariable(name: "request", scope: !267, file: !254, line: 148, type: !164)
!286 = !DILocation(line: 148, column: 17, scope: !267)
!287 = !DILocation(line: 148, column: 42, scope: !267)
!288 = !DILocation(line: 148, column: 27, scope: !267)
!289 = !DILocation(line: 150, column: 30, scope: !290)
!290 = distinct !DILexicalBlock(scope: !267, file: !254, line: 150, column: 8)
!291 = !DILocation(line: 150, column: 39, scope: !290)
!292 = !DILocation(line: 150, column: 27, scope: !290)
!293 = !DILocation(line: 150, column: 8, scope: !267)
!294 = !DILocation(line: 151, column: 30, scope: !295)
!295 = distinct !DILexicalBlock(scope: !296, file: !254, line: 151, column: 11)
!296 = distinct !DILexicalBlock(scope: !290, file: !254, line: 150, column: 43)
!297 = !DILocation(line: 151, column: 27, scope: !295)
!298 = !DILocation(line: 151, column: 11, scope: !296)
!299 = !DILocation(line: 152, column: 19, scope: !300)
!300 = distinct !DILexicalBlock(scope: !295, file: !254, line: 151, column: 34)
!301 = !DILocation(line: 152, column: 30, scope: !300)
!302 = !DILocation(line: 152, column: 17, scope: !300)
!303 = !DILocation(line: 153, column: 7, scope: !300)
!304 = !DILocation(line: 154, column: 19, scope: !305)
!305 = distinct !DILexicalBlock(scope: !295, file: !254, line: 153, column: 14)
!306 = !DILocation(line: 154, column: 30, scope: !305)
!307 = !DILocation(line: 154, column: 17, scope: !305)
!308 = !DILocation(line: 156, column: 4, scope: !296)
!309 = !DILocation(line: 157, column: 14, scope: !310)
!310 = distinct !DILexicalBlock(scope: !290, file: !254, line: 156, column: 11)
!311 = !DILocation(line: 159, column: 9, scope: !312)
!312 = distinct !DILexicalBlock(scope: !267, file: !254, line: 159, column: 8)
!313 = !DILocation(line: 159, column: 8, scope: !267)
!314 = !DILocation(line: 160, column: 7, scope: !315)
!315 = distinct !DILexicalBlock(scope: !312, file: !254, line: 159, column: 17)
!316 = distinct !{!316, !314}
!317 = !DILocation(line: 160, column: 33, scope: !318)
!318 = !DILexicalBlockFile(scope: !319, file: !254, discriminator: 1)
!319 = distinct !DILexicalBlock(scope: !320, file: !254, line: 160, column: 31)
!320 = distinct !DILexicalBlock(scope: !321, file: !254, line: 160, column: 16)
!321 = distinct !DILexicalBlock(scope: !315, file: !254, line: 160, column: 10)
!322 = !DILocation(line: 160, column: 112, scope: !323)
!323 = !DILexicalBlockFile(scope: !318, file: !254, discriminator: 2)
!324 = !DILocation(line: 160, column: 215, scope: !318)
!325 = !DILocation(line: 161, column: 4, scope: !315)
!326 = !DILocation(line: 162, column: 11, scope: !267)
!327 = !DILocation(line: 162, column: 4, scope: !267)
!328 = distinct !DISubprogram(name: "HgfsGetPayloadSize", scope: !254, file: !254, line: 184, type: !329, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !275)
!329 = !DISubroutineType(types: !330)
!330 = !{!273, !271, !273}
!331 = !DILocalVariable(name: "packetIn", arg: 1, scope: !328, file: !254, line: 184, type: !271)
!332 = !DILocation(line: 184, column: 32, scope: !328)
!333 = !DILocalVariable(name: "packetSize", arg: 2, scope: !328, file: !254, line: 185, type: !273)
!334 = !DILocation(line: 185, column: 27, scope: !328)
!335 = !DILocalVariable(name: "request", scope: !328, file: !254, line: 187, type: !164)
!336 = !DILocation(line: 187, column: 17, scope: !328)
!337 = !DILocation(line: 187, column: 42, scope: !328)
!338 = !DILocation(line: 187, column: 27, scope: !328)
!339 = !DILocalVariable(name: "result", scope: !328, file: !254, line: 188, type: !273)
!340 = !DILocation(line: 188, column: 11, scope: !328)
!341 = !DILocation(line: 190, column: 8, scope: !342)
!342 = distinct !DILexicalBlock(scope: !328, file: !254, line: 190, column: 8)
!343 = !DILocation(line: 190, column: 17, scope: !342)
!344 = !DILocation(line: 190, column: 20, scope: !342)
!345 = !DILocation(line: 190, column: 8, scope: !328)
!346 = !DILocation(line: 191, column: 16, scope: !347)
!347 = distinct !DILexicalBlock(scope: !342, file: !254, line: 190, column: 49)
!348 = !DILocation(line: 191, column: 27, scope: !347)
!349 = !DILocation(line: 191, column: 14, scope: !347)
!350 = !DILocation(line: 192, column: 4, scope: !347)
!351 = !DILocalVariable(name: "header", scope: !352, file: !254, line: 193, type: !177)
!352 = distinct !DILexicalBlock(scope: !342, file: !254, line: 192, column: 11)
!353 = !DILocation(line: 193, column: 19, scope: !352)
!354 = !DILocation(line: 193, column: 42, scope: !352)
!355 = !DILocation(line: 193, column: 28, scope: !352)
!356 = !DILocation(line: 196, column: 16, scope: !352)
!357 = !DILocation(line: 196, column: 24, scope: !352)
!358 = !DILocation(line: 196, column: 37, scope: !352)
!359 = !DILocation(line: 196, column: 45, scope: !352)
!360 = !DILocation(line: 196, column: 35, scope: !352)
!361 = !DILocation(line: 196, column: 14, scope: !352)
!362 = !DILocation(line: 198, column: 11, scope: !328)
!363 = !DILocation(line: 198, column: 4, scope: !328)
!364 = distinct !DISubprogram(name: "HgfsUnpackPacketParams", scope: !254, file: !254, line: 387, type: !365, isLocal: false, isDefinition: true, scopeLine: 395, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !275)
!365 = !DISubroutineType(types: !366)
!366 = !{!367, !370, !273, !372, !373, !374, !375, !376, !377}
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsInternalStatus", file: !368, line: 82, baseType: !369)
!368 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hgfsUtil.h", directory: "/home/lichi/Desktop/open-vm-tools/line400")
!369 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!378 = !DILocalVariable(name: "packet", arg: 1, scope: !364, file: !254, line: 387, type: !370)
!379 = !DILocation(line: 387, column: 36, scope: !364)
!380 = !DILocalVariable(name: "packetSize", arg: 2, scope: !364, file: !254, line: 388, type: !273)
!381 = !DILocation(line: 388, column: 31, scope: !364)
!382 = !DILocalVariable(name: "sessionEnabled", arg: 3, scope: !364, file: !254, line: 389, type: !372)
!383 = !DILocation(line: 389, column: 30, scope: !364)
!384 = !DILocalVariable(name: "sessionId", arg: 4, scope: !364, file: !254, line: 390, type: !373)
!385 = !DILocation(line: 390, column: 32, scope: !364)
!386 = !DILocalVariable(name: "requestId", arg: 5, scope: !364, file: !254, line: 391, type: !374)
!387 = !DILocation(line: 391, column: 32, scope: !364)
!388 = !DILocalVariable(name: "opcode", arg: 6, scope: !364, file: !254, line: 392, type: !375)
!389 = !DILocation(line: 392, column: 32, scope: !364)
!390 = !DILocalVariable(name: "payloadSize", arg: 7, scope: !364, file: !254, line: 393, type: !376)
!391 = !DILocation(line: 393, column: 32, scope: !364)
!392 = !DILocalVariable(name: "payload", arg: 8, scope: !364, file: !254, line: 394, type: !377)
!393 = !DILocation(line: 394, column: 37, scope: !364)
!394 = !DILocalVariable(name: "request", scope: !364, file: !254, line: 396, type: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!397 = !DILocation(line: 396, column: 23, scope: !364)
!398 = !DILocalVariable(name: "unpackStatus", scope: !364, file: !254, line: 397, type: !367)
!399 = !DILocation(line: 397, column: 23, scope: !364)
!400 = !DILocation(line: 401, column: 14, scope: !364)
!401 = !DILocation(line: 401, column: 12, scope: !364)
!402 = !DILocation(line: 402, column: 4, scope: !364)
!403 = distinct !{!403, !402}
!404 = !DILocation(line: 402, column: 30, scope: !405)
!405 = !DILexicalBlockFile(scope: !406, file: !254, discriminator: 1)
!406 = distinct !DILexicalBlock(scope: !407, file: !254, line: 402, column: 28)
!407 = distinct !DILexicalBlock(scope: !408, file: !254, line: 402, column: 13)
!408 = distinct !DILexicalBlock(scope: !364, file: !254, line: 402, column: 7)
!409 = !DILocation(line: 402, column: 207, scope: !405)
!410 = !DILocation(line: 402, column: 216, scope: !405)
!411 = !DILocation(line: 402, column: 109, scope: !412)
!412 = !DILexicalBlockFile(scope: !405, file: !254, discriminator: 2)
!413 = !DILocation(line: 402, column: 223, scope: !405)
!414 = !DILocation(line: 408, column: 8, scope: !415)
!415 = distinct !DILexicalBlock(scope: !364, file: !254, line: 408, column: 8)
!416 = !DILocation(line: 408, column: 19, scope: !415)
!417 = !DILocation(line: 408, column: 8, scope: !364)
!418 = !DILocation(line: 409, column: 7, scope: !419)
!419 = distinct !DILexicalBlock(scope: !415, file: !254, line: 408, column: 38)
!420 = distinct !{!420, !418}
!421 = !DILocation(line: 409, column: 33, scope: !422)
!422 = !DILexicalBlockFile(scope: !423, file: !254, discriminator: 1)
!423 = distinct !DILexicalBlock(scope: !424, file: !254, line: 409, column: 31)
!424 = distinct !DILexicalBlock(scope: !425, file: !254, line: 409, column: 16)
!425 = distinct !DILexicalBlock(scope: !419, file: !254, line: 409, column: 10)
!426 = !DILocation(line: 409, column: 215, scope: !422)
!427 = !DILocation(line: 409, column: 112, scope: !428)
!428 = !DILexicalBlockFile(scope: !422, file: !254, discriminator: 2)
!429 = !DILocation(line: 409, column: 230, scope: !422)
!430 = !DILocation(line: 411, column: 20, scope: !419)
!431 = !DILocation(line: 412, column: 7, scope: !419)
!432 = !DILocation(line: 415, column: 5, scope: !364)
!433 = !DILocation(line: 415, column: 20, scope: !364)
!434 = !DILocation(line: 417, column: 8, scope: !435)
!435 = distinct !DILexicalBlock(scope: !364, file: !254, line: 417, column: 8)
!436 = !DILocation(line: 417, column: 17, scope: !435)
!437 = !DILocation(line: 417, column: 20, scope: !435)
!438 = !DILocation(line: 417, column: 8, scope: !364)
!439 = !DILocation(line: 418, column: 43, scope: !440)
!440 = distinct !DILexicalBlock(scope: !435, file: !254, line: 417, column: 39)
!441 = !DILocation(line: 419, column: 43, scope: !440)
!442 = !DILocation(line: 420, column: 43, scope: !440)
!443 = !DILocation(line: 421, column: 43, scope: !440)
!444 = !DILocation(line: 422, column: 43, scope: !440)
!445 = !DILocation(line: 423, column: 43, scope: !440)
!446 = !DILocation(line: 418, column: 22, scope: !440)
!447 = !DILocation(line: 418, column: 20, scope: !440)
!448 = !DILocation(line: 424, column: 4, scope: !440)
!449 = !DILocation(line: 424, column: 15, scope: !450)
!450 = !DILexicalBlockFile(scope: !451, file: !254, discriminator: 1)
!451 = distinct !DILexicalBlock(scope: !435, file: !254, line: 424, column: 15)
!452 = !DILocation(line: 424, column: 24, scope: !450)
!453 = !DILocation(line: 424, column: 27, scope: !450)
!454 = !DILocation(line: 425, column: 41, scope: !455)
!455 = distinct !DILexicalBlock(scope: !451, file: !254, line: 424, column: 56)
!456 = !DILocation(line: 426, column: 41, scope: !455)
!457 = !DILocation(line: 427, column: 41, scope: !455)
!458 = !DILocation(line: 428, column: 41, scope: !455)
!459 = !DILocation(line: 429, column: 41, scope: !455)
!460 = !DILocation(line: 430, column: 41, scope: !455)
!461 = !DILocation(line: 425, column: 22, scope: !455)
!462 = !DILocation(line: 425, column: 20, scope: !455)
!463 = !DILocation(line: 431, column: 4, scope: !455)
!464 = !DILocation(line: 431, column: 37, scope: !465)
!465 = !DILexicalBlockFile(scope: !466, file: !254, discriminator: 1)
!466 = distinct !DILexicalBlock(scope: !451, file: !254, line: 431, column: 15)
!467 = !DILocation(line: 431, column: 46, scope: !465)
!468 = !DILocation(line: 431, column: 34, scope: !465)
!469 = !DILocation(line: 431, column: 15, scope: !465)
!470 = !DILocalVariable(name: "requestHdr", scope: !471, file: !254, line: 433, type: !472)
!471 = distinct !DILexicalBlock(scope: !466, file: !254, line: 431, column: 50)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!474 = !DILocation(line: 433, column: 25, scope: !471)
!475 = !DILocation(line: 433, column: 38, scope: !471)
!476 = !DILocalVariable(name: "hdrFlags", scope: !471, file: !254, line: 434, type: !170)
!477 = !DILocation(line: 434, column: 14, scope: !471)
!478 = !DILocalVariable(name: "information", scope: !471, file: !254, line: 435, type: !170)
!479 = !DILocation(line: 435, column: 14, scope: !471)
!480 = !DILocation(line: 437, column: 8, scope: !471)
!481 = !DILocation(line: 437, column: 23, scope: !471)
!482 = !DILocation(line: 439, column: 41, scope: !471)
!483 = !DILocation(line: 440, column: 41, scope: !471)
!484 = !DILocation(line: 441, column: 41, scope: !471)
!485 = !DILocation(line: 442, column: 41, scope: !471)
!486 = !DILocation(line: 445, column: 41, scope: !471)
!487 = !DILocation(line: 446, column: 41, scope: !471)
!488 = !DILocation(line: 447, column: 41, scope: !471)
!489 = !DILocation(line: 439, column: 22, scope: !471)
!490 = !DILocation(line: 439, column: 20, scope: !471)
!491 = !DILocation(line: 454, column: 16, scope: !492)
!492 = distinct !DILexicalBlock(scope: !471, file: !254, line: 454, column: 11)
!493 = !DILocation(line: 454, column: 13, scope: !492)
!494 = !DILocation(line: 454, column: 25, scope: !492)
!495 = !DILocation(line: 455, column: 17, scope: !492)
!496 = !DILocation(line: 455, column: 26, scope: !492)
!497 = !DILocation(line: 455, column: 13, scope: !492)
!498 = !DILocation(line: 454, column: 11, scope: !499)
!499 = !DILexicalBlockFile(scope: !471, file: !254, discriminator: 1)
!500 = !DILocation(line: 456, column: 23, scope: !501)
!501 = distinct !DILexicalBlock(scope: !492, file: !254, line: 455, column: 52)
!502 = !DILocation(line: 457, column: 7, scope: !501)
!503 = !DILocation(line: 459, column: 4, scope: !471)
!504 = !DILocation(line: 460, column: 7, scope: !505)
!505 = distinct !DILexicalBlock(scope: !466, file: !254, line: 459, column: 11)
!506 = distinct !{!506, !504}
!507 = !DILocation(line: 460, column: 33, scope: !508)
!508 = !DILexicalBlockFile(scope: !509, file: !254, discriminator: 1)
!509 = distinct !DILexicalBlock(scope: !510, file: !254, line: 460, column: 31)
!510 = distinct !DILexicalBlock(scope: !511, file: !254, line: 460, column: 16)
!511 = distinct !DILexicalBlock(scope: !505, file: !254, line: 460, column: 10)
!512 = !DILocation(line: 460, column: 112, scope: !513)
!513 = !DILexicalBlockFile(scope: !508, file: !254, discriminator: 2)
!514 = !DILocation(line: 460, column: 237, scope: !508)
!515 = !DILocation(line: 462, column: 20, scope: !505)
!516 = !DILocation(line: 417, column: 22, scope: !517)
!517 = !DILexicalBlockFile(scope: !435, file: !254, discriminator: 1)
!518 = !DILocation(line: 466, column: 4, scope: !364)
!519 = distinct !{!519, !518}
!520 = !DILocation(line: 466, column: 30, scope: !521)
!521 = !DILexicalBlockFile(scope: !522, file: !254, discriminator: 1)
!522 = distinct !DILexicalBlock(scope: !523, file: !254, line: 466, column: 28)
!523 = distinct !DILexicalBlock(scope: !524, file: !254, line: 466, column: 13)
!524 = distinct !DILexicalBlock(scope: !364, file: !254, line: 466, column: 7)
!525 = !DILocation(line: 466, column: 210, scope: !521)
!526 = !DILocation(line: 466, column: 219, scope: !521)
!527 = !DILocation(line: 466, column: 224, scope: !521)
!528 = !DILocation(line: 466, column: 223, scope: !521)
!529 = !DILocation(line: 466, column: 235, scope: !521)
!530 = !DILocation(line: 466, column: 109, scope: !531)
!531 = !DILexicalBlockFile(scope: !521, file: !254, discriminator: 2)
!532 = !DILocation(line: 466, column: 252, scope: !521)
!533 = !DILocation(line: 468, column: 11, scope: !364)
!534 = !DILocation(line: 468, column: 4, scope: !364)
!535 = distinct !DISubprogram(name: "HgfsUnpackHeaderV1V2", scope: !254, file: !254, line: 221, type: !536, isLocal: true, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !275)
!536 = !DISubroutineType(types: !537)
!537 = !{!367, !395, !273, !374, !375, !376, !377}
!538 = !DILocalVariable(name: "request", arg: 1, scope: !535, file: !254, line: 221, type: !395)
!539 = !DILocation(line: 221, column: 41, scope: !535)
!540 = !DILocalVariable(name: "requestSize", arg: 2, scope: !535, file: !254, line: 222, type: !273)
!541 = !DILocation(line: 222, column: 29, scope: !535)
!542 = !DILocalVariable(name: "requestId", arg: 3, scope: !535, file: !254, line: 223, type: !374)
!543 = !DILocation(line: 223, column: 30, scope: !535)
!544 = !DILocalVariable(name: "opcode", arg: 4, scope: !535, file: !254, line: 224, type: !375)
!545 = !DILocation(line: 224, column: 30, scope: !535)
!546 = !DILocalVariable(name: "payloadSize", arg: 5, scope: !535, file: !254, line: 225, type: !376)
!547 = !DILocation(line: 225, column: 30, scope: !535)
!548 = !DILocalVariable(name: "payload", arg: 6, scope: !535, file: !254, line: 226, type: !377)
!549 = !DILocation(line: 226, column: 35, scope: !535)
!550 = !DILocation(line: 229, column: 17, scope: !535)
!551 = !DILocation(line: 229, column: 26, scope: !535)
!552 = !DILocation(line: 229, column: 5, scope: !535)
!553 = !DILocation(line: 229, column: 15, scope: !535)
!554 = !DILocation(line: 230, column: 14, scope: !535)
!555 = !DILocation(line: 230, column: 23, scope: !535)
!556 = !DILocation(line: 230, column: 5, scope: !535)
!557 = !DILocation(line: 230, column: 12, scope: !535)
!558 = !DILocation(line: 231, column: 19, scope: !535)
!559 = !DILocation(line: 231, column: 5, scope: !535)
!560 = !DILocation(line: 231, column: 17, scope: !535)
!561 = !DILocation(line: 232, column: 15, scope: !535)
!562 = !DILocation(line: 232, column: 5, scope: !535)
!563 = !DILocation(line: 232, column: 13, scope: !535)
!564 = !DILocation(line: 233, column: 4, scope: !535)
!565 = distinct !DISubprogram(name: "HgfsUnpackHeaderV3", scope: !254, file: !254, line: 256, type: !536, isLocal: true, isDefinition: true, scopeLine: 262, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !275)
!566 = !DILocalVariable(name: "request", arg: 1, scope: !565, file: !254, line: 256, type: !395)
!567 = !DILocation(line: 256, column: 39, scope: !565)
!568 = !DILocalVariable(name: "requestSize", arg: 2, scope: !565, file: !254, line: 257, type: !273)
!569 = !DILocation(line: 257, column: 27, scope: !565)
!570 = !DILocalVariable(name: "requestId", arg: 3, scope: !565, file: !254, line: 258, type: !374)
!571 = !DILocation(line: 258, column: 28, scope: !565)
!572 = !DILocalVariable(name: "opcode", arg: 4, scope: !565, file: !254, line: 259, type: !375)
!573 = !DILocation(line: 259, column: 28, scope: !565)
!574 = !DILocalVariable(name: "payloadSize", arg: 5, scope: !565, file: !254, line: 260, type: !376)
!575 = !DILocation(line: 260, column: 28, scope: !565)
!576 = !DILocalVariable(name: "payload", arg: 6, scope: !565, file: !254, line: 261, type: !377)
!577 = !DILocation(line: 261, column: 33, scope: !565)
!578 = !DILocation(line: 264, column: 17, scope: !565)
!579 = !DILocation(line: 264, column: 26, scope: !565)
!580 = !DILocation(line: 264, column: 5, scope: !565)
!581 = !DILocation(line: 264, column: 15, scope: !565)
!582 = !DILocation(line: 265, column: 14, scope: !565)
!583 = !DILocation(line: 265, column: 23, scope: !565)
!584 = !DILocation(line: 265, column: 5, scope: !565)
!585 = !DILocation(line: 265, column: 12, scope: !565)
!586 = !DILocation(line: 266, column: 8, scope: !587)
!587 = distinct !DILexicalBlock(scope: !565, file: !254, line: 266, column: 8)
!588 = !DILocation(line: 266, column: 20, scope: !587)
!589 = !DILocation(line: 266, column: 8, scope: !565)
!590 = !DILocation(line: 267, column: 28, scope: !591)
!591 = distinct !DILexicalBlock(scope: !587, file: !254, line: 266, column: 39)
!592 = !DILocation(line: 267, column: 19, scope: !591)
!593 = !DILocation(line: 267, column: 37, scope: !591)
!594 = !DILocation(line: 267, column: 8, scope: !591)
!595 = !DILocation(line: 267, column: 16, scope: !591)
!596 = !DILocation(line: 268, column: 22, scope: !591)
!597 = !DILocation(line: 268, column: 46, scope: !591)
!598 = !DILocation(line: 268, column: 45, scope: !591)
!599 = !DILocation(line: 268, column: 64, scope: !591)
!600 = !DILocation(line: 268, column: 56, scope: !591)
!601 = !DILocation(line: 268, column: 54, scope: !591)
!602 = !DILocation(line: 268, column: 34, scope: !591)
!603 = !DILocation(line: 268, column: 8, scope: !591)
!604 = !DILocation(line: 268, column: 20, scope: !591)
!605 = !DILocation(line: 269, column: 4, scope: !591)
!606 = !DILocation(line: 270, column: 8, scope: !607)
!607 = distinct !DILexicalBlock(scope: !587, file: !254, line: 269, column: 11)
!608 = !DILocation(line: 270, column: 16, scope: !607)
!609 = !DILocation(line: 271, column: 8, scope: !607)
!610 = !DILocation(line: 271, column: 20, scope: !607)
!611 = !DILocation(line: 273, column: 4, scope: !565)
!612 = distinct !DISubprogram(name: "HgfsUnpackHeaderV4", scope: !254, file: !254, line: 297, type: !613, isLocal: true, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !275)
!613 = !DISubroutineType(types: !614)
!614 = !{!367, !472, !273, !373, !374, !374, !374, !375, !376, !377}
!615 = !DILocalVariable(name: "requestHeader", arg: 1, scope: !612, file: !254, line: 297, type: !472)
!616 = !DILocation(line: 297, column: 38, scope: !612)
!617 = !DILocalVariable(name: "requestSize", arg: 2, scope: !612, file: !254, line: 298, type: !273)
!618 = !DILocation(line: 298, column: 27, scope: !612)
!619 = !DILocalVariable(name: "sessionId", arg: 3, scope: !612, file: !254, line: 299, type: !373)
!620 = !DILocation(line: 299, column: 28, scope: !612)
!621 = !DILocalVariable(name: "requestId", arg: 4, scope: !612, file: !254, line: 300, type: !374)
!622 = !DILocation(line: 300, column: 28, scope: !612)
!623 = !DILocalVariable(name: "hdrFlags", arg: 5, scope: !612, file: !254, line: 301, type: !374)
!624 = !DILocation(line: 301, column: 28, scope: !612)
!625 = !DILocalVariable(name: "information", arg: 6, scope: !612, file: !254, line: 302, type: !374)
!626 = !DILocation(line: 302, column: 28, scope: !612)
!627 = !DILocalVariable(name: "opcode", arg: 7, scope: !612, file: !254, line: 303, type: !375)
!628 = !DILocation(line: 303, column: 28, scope: !612)
!629 = !DILocalVariable(name: "payloadSize", arg: 8, scope: !612, file: !254, line: 304, type: !376)
!630 = !DILocation(line: 304, column: 28, scope: !612)
!631 = !DILocalVariable(name: "payload", arg: 9, scope: !612, file: !254, line: 305, type: !377)
!632 = !DILocation(line: 305, column: 33, scope: !612)
!633 = !DILocalVariable(name: "status", scope: !612, file: !254, line: 307, type: !367)
!634 = !DILocation(line: 307, column: 23, scope: !612)
!635 = !DILocation(line: 309, column: 8, scope: !636)
!636 = distinct !DILexicalBlock(scope: !612, file: !254, line: 309, column: 8)
!637 = !DILocation(line: 309, column: 20, scope: !636)
!638 = !DILocation(line: 309, column: 8, scope: !612)
!639 = !DILocation(line: 310, column: 7, scope: !640)
!640 = distinct !DILexicalBlock(scope: !636, file: !254, line: 309, column: 45)
!641 = distinct !{!641, !639}
!642 = !DILocation(line: 310, column: 33, scope: !643)
!643 = !DILexicalBlockFile(scope: !644, file: !254, discriminator: 1)
!644 = distinct !DILexicalBlock(scope: !645, file: !254, line: 310, column: 31)
!645 = distinct !DILexicalBlock(scope: !646, file: !254, line: 310, column: 16)
!646 = distinct !DILexicalBlock(scope: !640, file: !254, line: 310, column: 10)
!647 = !DILocation(line: 310, column: 112, scope: !648)
!648 = !DILexicalBlockFile(scope: !643, file: !254, discriminator: 2)
!649 = !DILocation(line: 310, column: 232, scope: !643)
!650 = !DILocation(line: 312, column: 14, scope: !640)
!651 = !DILocation(line: 313, column: 7, scope: !640)
!652 = !DILocation(line: 316, column: 8, scope: !653)
!653 = distinct !DILexicalBlock(scope: !612, file: !254, line: 316, column: 8)
!654 = !DILocation(line: 316, column: 22, scope: !653)
!655 = !DILocation(line: 316, column: 37, scope: !653)
!656 = !DILocation(line: 316, column: 20, scope: !653)
!657 = !DILocation(line: 316, column: 48, scope: !653)
!658 = !DILocation(line: 317, column: 8, scope: !653)
!659 = !DILocation(line: 317, column: 23, scope: !653)
!660 = !DILocation(line: 317, column: 36, scope: !653)
!661 = !DILocation(line: 317, column: 51, scope: !653)
!662 = !DILocation(line: 317, column: 34, scope: !653)
!663 = !DILocation(line: 316, column: 8, scope: !664)
!664 = !DILexicalBlockFile(scope: !612, file: !254, discriminator: 1)
!665 = !DILocation(line: 318, column: 7, scope: !666)
!666 = distinct !DILexicalBlock(scope: !653, file: !254, line: 317, column: 63)
!667 = distinct !{!667, !665}
!668 = !DILocation(line: 318, column: 33, scope: !669)
!669 = !DILexicalBlockFile(scope: !670, file: !254, discriminator: 1)
!670 = distinct !DILexicalBlock(scope: !671, file: !254, line: 318, column: 31)
!671 = distinct !DILexicalBlock(scope: !672, file: !254, line: 318, column: 16)
!672 = distinct !DILexicalBlock(scope: !666, file: !254, line: 318, column: 10)
!673 = !DILocation(line: 318, column: 112, scope: !674)
!674 = !DILexicalBlockFile(scope: !669, file: !254, discriminator: 2)
!675 = !DILocation(line: 318, column: 252, scope: !669)
!676 = !DILocation(line: 320, column: 14, scope: !666)
!677 = !DILocation(line: 321, column: 7, scope: !666)
!678 = !DILocation(line: 324, column: 12, scope: !679)
!679 = distinct !DILexicalBlock(scope: !612, file: !254, line: 324, column: 8)
!680 = !DILocation(line: 324, column: 27, scope: !679)
!681 = !DILocation(line: 324, column: 10, scope: !679)
!682 = !DILocation(line: 324, column: 8, scope: !612)
!683 = !DILocation(line: 325, column: 7, scope: !684)
!684 = distinct !DILexicalBlock(scope: !679, file: !254, line: 324, column: 36)
!685 = distinct !{!685, !683}
!686 = !DILocation(line: 325, column: 33, scope: !687)
!687 = !DILexicalBlockFile(scope: !688, file: !254, discriminator: 1)
!688 = distinct !DILexicalBlock(scope: !689, file: !254, line: 325, column: 31)
!689 = distinct !DILexicalBlock(scope: !690, file: !254, line: 325, column: 16)
!690 = distinct !DILexicalBlock(scope: !684, file: !254, line: 325, column: 10)
!691 = !DILocation(line: 325, column: 112, scope: !692)
!692 = !DILexicalBlockFile(scope: !687, file: !254, discriminator: 2)
!693 = !DILocation(line: 325, column: 235, scope: !687)
!694 = !DILocation(line: 327, column: 14, scope: !684)
!695 = !DILocation(line: 328, column: 7, scope: !684)
!696 = !DILocation(line: 334, column: 17, scope: !612)
!697 = !DILocation(line: 334, column: 32, scope: !612)
!698 = !DILocation(line: 334, column: 5, scope: !612)
!699 = !DILocation(line: 334, column: 15, scope: !612)
!700 = !DILocation(line: 335, column: 17, scope: !612)
!701 = !DILocation(line: 335, column: 32, scope: !612)
!702 = !DILocation(line: 335, column: 5, scope: !612)
!703 = !DILocation(line: 335, column: 15, scope: !612)
!704 = !DILocation(line: 336, column: 14, scope: !612)
!705 = !DILocation(line: 336, column: 29, scope: !612)
!706 = !DILocation(line: 336, column: 5, scope: !612)
!707 = !DILocation(line: 336, column: 12, scope: !612)
!708 = !DILocation(line: 344, column: 13, scope: !709)
!709 = distinct !DILexicalBlock(scope: !612, file: !254, line: 344, column: 8)
!710 = !DILocation(line: 344, column: 28, scope: !709)
!711 = !DILocation(line: 344, column: 10, scope: !709)
!712 = !DILocation(line: 344, column: 8, scope: !612)
!713 = !DILocation(line: 345, column: 8, scope: !714)
!714 = distinct !DILexicalBlock(scope: !709, file: !254, line: 344, column: 37)
!715 = !DILocation(line: 345, column: 17, scope: !714)
!716 = !DILocation(line: 346, column: 8, scope: !714)
!717 = !DILocation(line: 346, column: 20, scope: !714)
!718 = !DILocation(line: 347, column: 4, scope: !714)
!719 = !DILocation(line: 348, column: 19, scope: !720)
!720 = distinct !DILexicalBlock(scope: !709, file: !254, line: 347, column: 11)
!721 = !DILocation(line: 348, column: 34, scope: !720)
!722 = !DILocation(line: 348, column: 8, scope: !720)
!723 = !DILocation(line: 348, column: 17, scope: !720)
!724 = !DILocation(line: 349, column: 22, scope: !720)
!725 = !DILocation(line: 349, column: 37, scope: !720)
!726 = !DILocation(line: 349, column: 8, scope: !720)
!727 = !DILocation(line: 349, column: 20, scope: !720)
!728 = !DILocation(line: 352, column: 19, scope: !612)
!729 = !DILocation(line: 352, column: 34, scope: !612)
!730 = !DILocation(line: 352, column: 47, scope: !612)
!731 = !DILocation(line: 352, column: 62, scope: !612)
!732 = !DILocation(line: 352, column: 45, scope: !612)
!733 = !DILocation(line: 352, column: 5, scope: !612)
!734 = !DILocation(line: 352, column: 17, scope: !612)
!735 = !DILocation(line: 353, column: 13, scope: !736)
!736 = distinct !DILexicalBlock(scope: !612, file: !254, line: 353, column: 8)
!737 = !DILocation(line: 353, column: 12, scope: !736)
!738 = !DILocation(line: 353, column: 10, scope: !736)
!739 = !DILocation(line: 353, column: 8, scope: !612)
!740 = !DILocation(line: 354, column: 26, scope: !741)
!741 = distinct !DILexicalBlock(scope: !736, file: !254, line: 353, column: 26)
!742 = !DILocation(line: 354, column: 18, scope: !741)
!743 = !DILocation(line: 354, column: 42, scope: !741)
!744 = !DILocation(line: 354, column: 57, scope: !741)
!745 = !DILocation(line: 354, column: 40, scope: !741)
!746 = !DILocation(line: 354, column: 8, scope: !741)
!747 = !DILocation(line: 354, column: 16, scope: !741)
!748 = !DILocation(line: 355, column: 4, scope: !741)
!749 = !DILocation(line: 356, column: 8, scope: !750)
!750 = distinct !DILexicalBlock(scope: !736, file: !254, line: 355, column: 11)
!751 = !DILocation(line: 356, column: 16, scope: !750)
!752 = !DILocation(line: 357, column: 7, scope: !750)
!753 = !DILocation(line: 353, column: 13, scope: !754)
!754 = !DILexicalBlockFile(scope: !736, file: !254, discriminator: 1)
!755 = !DILocation(line: 361, column: 11, scope: !612)
!756 = !DILocation(line: 361, column: 4, scope: !612)
!757 = distinct !DISubprogram(name: "HgfsUnpackOpenRequest", scope: !254, file: !254, line: 694, type: !758, isLocal: false, isDefinition: true, scopeLine: 698, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !275)
!758 = !DISubroutineType(types: !759)
!759 = !{!270, !370, !273, !176, !760}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsFileOpenInfo", file: !141, line: 438, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsFileOpenInfo", file: !141, line: 417, size: 960, align: 64, elements: !763)
!763 = !{!764, !765, !766, !768, !770, !772, !774, !775, !776, !777, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "requestType", scope: !762, file: !141, line: 418, baseType: !176, size: 32, align: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !762, file: !141, line: 419, baseType: !169, size: 32, align: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !762, file: !141, line: 420, baseType: !767, size: 64, align: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsOpenValid", file: !4, line: 408, baseType: !198)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !762, file: !141, line: 421, baseType: !769, size: 32, align: 32, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsOpenMode", file: !86, line: 125, baseType: !85)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !762, file: !141, line: 422, baseType: !771, size: 32, align: 32, offset: 160)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsOpenFlags", file: !4, line: 200, baseType: !92)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "specialPerms", scope: !762, file: !141, line: 423, baseType: !773, size: 8, align: 8, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsPermissions", file: !4, line: 220, baseType: !182)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ownerPerms", scope: !762, file: !141, line: 424, baseType: !773, size: 8, align: 8, offset: 200)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "groupPerms", scope: !762, file: !141, line: 425, baseType: !773, size: 8, align: 8, offset: 208)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "otherPerms", scope: !762, file: !141, line: 426, baseType: !773, size: 8, align: 8, offset: 216)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !762, file: !141, line: 427, baseType: !778, size: 64, align: 64, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsAttrFlags", file: !4, line: 385, baseType: !198)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "allocationSize", scope: !762, file: !141, line: 428, baseType: !198, size: 64, align: 64, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "desiredAccess", scope: !762, file: !141, line: 429, baseType: !170, size: 32, align: 32, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "shareAccess", scope: !762, file: !141, line: 430, baseType: !170, size: 32, align: 32, offset: 416)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "desiredLock", scope: !762, file: !141, line: 431, baseType: !209, size: 32, align: 32, offset: 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "acquiredLock", scope: !762, file: !141, line: 432, baseType: !209, size: 32, align: 32, offset: 480)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "cpNameSize", scope: !762, file: !141, line: 433, baseType: !170, size: 32, align: 32, offset: 512)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "cpName", scope: !762, file: !141, line: 434, baseType: !271, size: 64, align: 64, offset: 576)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "utf8Name", scope: !762, file: !141, line: 435, baseType: !211, size: 64, align: 64, offset: 640)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "caseFlags", scope: !762, file: !141, line: 436, baseType: !170, size: 32, align: 32, offset: 704)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "shareInfo", scope: !762, file: !141, line: 437, baseType: !789, size: 192, align: 64, offset: 768)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsShareInfo", file: !141, line: 163, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsShareInfo", file: !141, line: 145, size: 192, align: 64, elements: !791)
!791 = !{!792, !793, !794, !795, !796}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rootDir", scope: !790, file: !141, line: 147, baseType: !271, size: 64, align: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rootDirLen", scope: !790, file: !141, line: 150, baseType: !273, size: 64, align: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "readPermissions", scope: !790, file: !141, line: 153, baseType: !270, size: 8, align: 8, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "writePermissions", scope: !790, file: !141, line: 156, baseType: !270, size: 8, align: 8, offset: 136)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !790, file: !141, line: 162, baseType: !797, size: 32, align: 32, offset: 160)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSharedFolderHandle", file: !135, line: 134, baseType: !170)
!798 = !DILocalVariable(name: "packet", arg: 1, scope: !757, file: !254, line: 694, type: !370)
!799 = !DILocation(line: 694, column: 35, scope: !757)
!800 = !DILocalVariable(name: "packetSize", arg: 2, scope: !757, file: !254, line: 695, type: !273)
!801 = !DILocation(line: 695, column: 30, scope: !757)
!802 = !DILocalVariable(name: "op", arg: 3, scope: !757, file: !254, line: 696, type: !176)
!803 = !DILocation(line: 696, column: 30, scope: !757)
!804 = !DILocalVariable(name: "openInfo", arg: 4, scope: !757, file: !254, line: 697, type: !760)
!805 = !DILocation(line: 697, column: 41, scope: !757)
!806 = !DILocalVariable(name: "result", scope: !757, file: !254, line: 699, type: !270)
!807 = !DILocation(line: 699, column: 9, scope: !757)
!808 = !DILocation(line: 704, column: 28, scope: !757)
!809 = !DILocation(line: 704, column: 4, scope: !757)
!810 = !DILocation(line: 704, column: 14, scope: !757)
!811 = !DILocation(line: 704, column: 26, scope: !757)
!812 = !DILocation(line: 705, column: 4, scope: !757)
!813 = !DILocation(line: 705, column: 14, scope: !757)
!814 = !DILocation(line: 705, column: 24, scope: !757)
!815 = !DILocation(line: 707, column: 12, scope: !757)
!816 = !DILocation(line: 707, column: 4, scope: !757)
!817 = !DILocalVariable(name: "requestV3", scope: !818, file: !254, line: 709, type: !820)
!818 = distinct !DILexicalBlock(scope: !819, file: !254, line: 708, column: 26)
!819 = distinct !DILexicalBlock(scope: !757, file: !254, line: 707, column: 16)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsRequestOpenV3", file: !4, line: 751, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsRequestOpenV3", file: !4, line: 733, size: 648, align: 8, elements: !824)
!824 = !{!825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !823, file: !4, line: 734, baseType: !767, size: 64, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !823, file: !4, line: 735, baseType: !769, size: 32, align: 32, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !823, file: !4, line: 736, baseType: !771, size: 32, align: 32, offset: 96)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "specialPerms", scope: !823, file: !4, line: 737, baseType: !773, size: 8, align: 8, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ownerPerms", scope: !823, file: !4, line: 738, baseType: !773, size: 8, align: 8, offset: 136)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "groupPerms", scope: !823, file: !4, line: 739, baseType: !773, size: 8, align: 8, offset: 144)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "otherPerms", scope: !823, file: !4, line: 740, baseType: !773, size: 8, align: 8, offset: 152)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !823, file: !4, line: 741, baseType: !778, size: 64, align: 64, offset: 160)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "allocationSize", scope: !823, file: !4, line: 742, baseType: !198, size: 64, align: 64, offset: 224)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "desiredAccess", scope: !823, file: !4, line: 743, baseType: !170, size: 32, align: 32, offset: 288)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "shareAccess", scope: !823, file: !4, line: 744, baseType: !170, size: 32, align: 32, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "desiredLock", scope: !823, file: !4, line: 745, baseType: !209, size: 32, align: 32, offset: 352)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !823, file: !4, line: 746, baseType: !198, size: 64, align: 64, offset: 384)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !823, file: !4, line: 747, baseType: !198, size: 64, align: 64, offset: 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "fileName", scope: !823, file: !4, line: 748, baseType: !241, size: 136, align: 8, offset: 512)
!840 = !DILocation(line: 709, column: 35, scope: !818)
!841 = !DILocation(line: 709, column: 47, scope: !818)
!842 = !DILocation(line: 710, column: 10, scope: !818)
!843 = distinct !{!843, !842}
!844 = !DILocation(line: 710, column: 36, scope: !845)
!845 = !DILexicalBlockFile(scope: !846, file: !254, discriminator: 1)
!846 = distinct !DILexicalBlock(scope: !847, file: !254, line: 710, column: 34)
!847 = distinct !DILexicalBlock(scope: !848, file: !254, line: 710, column: 19)
!848 = distinct !DILexicalBlock(scope: !818, file: !254, line: 710, column: 13)
!849 = !DILocation(line: 710, column: 115, scope: !850)
!850 = !DILexicalBlockFile(scope: !845, file: !254, discriminator: 2)
!851 = !DILocation(line: 710, column: 197, scope: !845)
!852 = !DILocation(line: 712, column: 43, scope: !818)
!853 = !DILocation(line: 712, column: 54, scope: !818)
!854 = !DILocation(line: 712, column: 66, scope: !818)
!855 = !DILocation(line: 712, column: 19, scope: !818)
!856 = !DILocation(line: 712, column: 17, scope: !818)
!857 = !DILocation(line: 713, column: 10, scope: !818)
!858 = !DILocalVariable(name: "requestV2", scope: !859, file: !254, line: 716, type: !860)
!859 = distinct !DILexicalBlock(scope: !819, file: !254, line: 715, column: 26)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64, align: 64)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !862)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsRequestOpenV2", file: !4, line: 726, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsRequestOpenV2", file: !4, line: 707, size: 616, align: 8, elements: !864)
!864 = !{!865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !863, file: !4, line: 708, baseType: !165, size: 64, align: 8)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !863, file: !4, line: 709, baseType: !767, size: 64, align: 64, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !863, file: !4, line: 710, baseType: !769, size: 32, align: 32, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !863, file: !4, line: 711, baseType: !771, size: 32, align: 32, offset: 160)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "specialPerms", scope: !863, file: !4, line: 712, baseType: !773, size: 8, align: 8, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ownerPerms", scope: !863, file: !4, line: 713, baseType: !773, size: 8, align: 8, offset: 200)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "groupPerms", scope: !863, file: !4, line: 714, baseType: !773, size: 8, align: 8, offset: 208)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "otherPerms", scope: !863, file: !4, line: 715, baseType: !773, size: 8, align: 8, offset: 216)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !863, file: !4, line: 716, baseType: !778, size: 64, align: 64, offset: 224)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "allocationSize", scope: !863, file: !4, line: 717, baseType: !198, size: 64, align: 64, offset: 288)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "desiredAccess", scope: !863, file: !4, line: 718, baseType: !170, size: 32, align: 32, offset: 352)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "shareAccess", scope: !863, file: !4, line: 719, baseType: !170, size: 32, align: 32, offset: 384)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "desiredLock", scope: !863, file: !4, line: 720, baseType: !209, size: 32, align: 32, offset: 416)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !863, file: !4, line: 721, baseType: !198, size: 64, align: 64, offset: 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !863, file: !4, line: 722, baseType: !198, size: 64, align: 64, offset: 512)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "fileName", scope: !863, file: !4, line: 723, baseType: !231, size: 40, align: 8, offset: 576)
!881 = !DILocation(line: 716, column: 35, scope: !859)
!882 = !DILocation(line: 716, column: 47, scope: !859)
!883 = !DILocation(line: 717, column: 10, scope: !859)
!884 = distinct !{!884, !883}
!885 = !DILocation(line: 717, column: 36, scope: !886)
!886 = !DILexicalBlockFile(scope: !887, file: !254, discriminator: 1)
!887 = distinct !DILexicalBlock(scope: !888, file: !254, line: 717, column: 34)
!888 = distinct !DILexicalBlock(scope: !889, file: !254, line: 717, column: 19)
!889 = distinct !DILexicalBlock(scope: !859, file: !254, line: 717, column: 13)
!890 = !DILocation(line: 717, column: 115, scope: !891)
!891 = !DILexicalBlockFile(scope: !886, file: !254, discriminator: 2)
!892 = !DILocation(line: 717, column: 197, scope: !886)
!893 = !DILocation(line: 719, column: 43, scope: !859)
!894 = !DILocation(line: 719, column: 54, scope: !859)
!895 = !DILocation(line: 719, column: 66, scope: !859)
!896 = !DILocation(line: 719, column: 19, scope: !859)
!897 = !DILocation(line: 719, column: 17, scope: !859)
!898 = !DILocation(line: 720, column: 10, scope: !859)
!899 = !DILocalVariable(name: "requestV1", scope: !900, file: !254, line: 723, type: !901)
!900 = distinct !DILexicalBlock(scope: !819, file: !254, line: 722, column: 23)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsRequestOpen", file: !4, line: 700, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsRequestOpen", file: !4, line: 692, size: 176, align: 8, elements: !905)
!905 = !{!906, !907, !908, !909, !910}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !904, file: !4, line: 693, baseType: !165, size: 64, align: 8)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !904, file: !4, line: 694, baseType: !769, size: 32, align: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !904, file: !4, line: 695, baseType: !771, size: 32, align: 32, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "permissions", scope: !904, file: !4, line: 696, baseType: !773, size: 8, align: 8, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "fileName", scope: !904, file: !4, line: 697, baseType: !231, size: 40, align: 8, offset: 136)
!911 = !DILocation(line: 723, column: 33, scope: !900)
!912 = !DILocation(line: 723, column: 45, scope: !900)
!913 = !DILocation(line: 724, column: 10, scope: !900)
!914 = distinct !{!914, !913}
!915 = !DILocation(line: 724, column: 36, scope: !916)
!916 = !DILexicalBlockFile(scope: !917, file: !254, discriminator: 1)
!917 = distinct !DILexicalBlock(scope: !918, file: !254, line: 724, column: 34)
!918 = distinct !DILexicalBlock(scope: !919, file: !254, line: 724, column: 19)
!919 = distinct !DILexicalBlock(scope: !900, file: !254, line: 724, column: 13)
!920 = !DILocation(line: 724, column: 115, scope: !921)
!921 = !DILexicalBlockFile(scope: !916, file: !254, discriminator: 2)
!922 = !DILocation(line: 724, column: 194, scope: !916)
!923 = !DILocation(line: 726, column: 43, scope: !900)
!924 = !DILocation(line: 726, column: 54, scope: !900)
!925 = !DILocation(line: 726, column: 66, scope: !900)
!926 = !DILocation(line: 726, column: 19, scope: !900)
!927 = !DILocation(line: 726, column: 17, scope: !900)
!928 = !DILocation(line: 727, column: 10, scope: !900)
!929 = !DILocation(line: 730, column: 7, scope: !819)
!930 = !DILocation(line: 734, column: 9, scope: !931)
!931 = distinct !DILexicalBlock(scope: !757, file: !254, line: 734, column: 8)
!932 = !DILocation(line: 734, column: 8, scope: !757)
!933 = !DILocation(line: 735, column: 7, scope: !934)
!934 = distinct !DILexicalBlock(scope: !931, file: !254, line: 734, column: 17)
!935 = distinct !{!935, !933}
!936 = !DILocation(line: 735, column: 33, scope: !937)
!937 = !DILexicalBlockFile(scope: !938, file: !254, discriminator: 1)
!938 = distinct !DILexicalBlock(scope: !939, file: !254, line: 735, column: 31)
!939 = distinct !DILexicalBlock(scope: !940, file: !254, line: 735, column: 16)
!940 = distinct !DILexicalBlock(scope: !934, file: !254, line: 735, column: 10)
!941 = !DILocation(line: 735, column: 112, scope: !942)
!942 = !DILexicalBlockFile(scope: !937, file: !254, discriminator: 2)
!943 = !DILocation(line: 735, column: 205, scope: !937)
!944 = !DILocation(line: 736, column: 4, scope: !934)
!945 = !DILocation(line: 737, column: 11, scope: !757)
!946 = !DILocation(line: 737, column: 4, scope: !757)
!947 = distinct !DISubprogram(name: "HgfsUnpackOpenPayloadV3", scope: !254, file: !254, line: 621, type: !948, isLocal: true, isDefinition: true, scopeLine: 624, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !275)
!948 = !DISubroutineType(types: !949)
!949 = !{!270, !820, !273, !760}
!950 = !DILocalVariable(name: "requestV3", arg: 1, scope: !947, file: !254, line: 621, type: !820)
!951 = !DILocation(line: 621, column: 50, scope: !947)
!952 = !DILocalVariable(name: "payloadSize", arg: 2, scope: !947, file: !254, line: 622, type: !273)
!953 = !DILocation(line: 622, column: 32, scope: !947)
!954 = !DILocalVariable(name: "openInfo", arg: 3, scope: !947, file: !254, line: 623, type: !760)
!955 = !DILocation(line: 623, column: 43, scope: !947)
!956 = !DILocalVariable(name: "extra", scope: !947, file: !254, line: 625, type: !273)
!957 = !DILocation(line: 625, column: 11, scope: !947)
!958 = !DILocation(line: 628, column: 8, scope: !959)
!959 = distinct !DILexicalBlock(scope: !947, file: !254, line: 628, column: 8)
!960 = !DILocation(line: 628, column: 20, scope: !959)
!961 = !DILocation(line: 628, column: 8, scope: !947)
!962 = !DILocation(line: 629, column: 7, scope: !963)
!963 = distinct !DILexicalBlock(scope: !959, file: !254, line: 628, column: 41)
!964 = distinct !{!964, !962}
!965 = !DILocation(line: 629, column: 33, scope: !966)
!966 = !DILexicalBlockFile(scope: !967, file: !254, discriminator: 1)
!967 = distinct !DILexicalBlock(scope: !968, file: !254, line: 629, column: 31)
!968 = distinct !DILexicalBlock(scope: !969, file: !254, line: 629, column: 16)
!969 = distinct !DILexicalBlock(scope: !963, file: !254, line: 629, column: 10)
!970 = !DILocation(line: 629, column: 112, scope: !971)
!971 = !DILexicalBlockFile(scope: !966, file: !254, discriminator: 2)
!972 = !DILocation(line: 629, column: 229, scope: !966)
!973 = !DILocation(line: 630, column: 7, scope: !963)
!974 = !DILocation(line: 633, column: 12, scope: !947)
!975 = !DILocation(line: 633, column: 24, scope: !947)
!976 = !DILocation(line: 633, column: 10, scope: !947)
!977 = !DILocation(line: 635, column: 10, scope: !978)
!978 = distinct !DILexicalBlock(scope: !947, file: !254, line: 635, column: 8)
!979 = !DILocation(line: 635, column: 21, scope: !978)
!980 = !DILocation(line: 635, column: 26, scope: !978)
!981 = !DILocation(line: 635, column: 8, scope: !947)
!982 = !DILocation(line: 637, column: 7, scope: !983)
!983 = distinct !DILexicalBlock(scope: !978, file: !254, line: 635, column: 40)
!984 = distinct !{!984, !982}
!985 = !DILocation(line: 637, column: 33, scope: !986)
!986 = !DILexicalBlockFile(scope: !987, file: !254, discriminator: 1)
!987 = distinct !DILexicalBlock(scope: !988, file: !254, line: 637, column: 31)
!988 = distinct !DILexicalBlock(scope: !989, file: !254, line: 637, column: 16)
!989 = distinct !DILexicalBlock(scope: !983, file: !254, line: 637, column: 10)
!990 = !DILocation(line: 637, column: 112, scope: !991)
!991 = !DILexicalBlockFile(scope: !986, file: !254, discriminator: 2)
!992 = !DILocation(line: 637, column: 226, scope: !986)
!993 = !DILocation(line: 638, column: 7, scope: !983)
!994 = !DILocation(line: 645, column: 8, scope: !995)
!995 = distinct !DILexicalBlock(scope: !947, file: !254, line: 645, column: 8)
!996 = !DILocation(line: 645, column: 19, scope: !995)
!997 = !DILocation(line: 645, column: 28, scope: !995)
!998 = !DILocation(line: 645, column: 37, scope: !995)
!999 = !DILocation(line: 645, column: 35, scope: !995)
!1000 = !DILocation(line: 645, column: 8, scope: !947)
!1001 = !DILocation(line: 647, column: 7, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !995, file: !254, line: 645, column: 44)
!1003 = distinct !{!1003, !1001}
!1004 = !DILocation(line: 647, column: 33, scope: !1005)
!1005 = !DILexicalBlockFile(scope: !1006, file: !254, discriminator: 1)
!1006 = distinct !DILexicalBlock(scope: !1007, file: !254, line: 647, column: 31)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !254, line: 647, column: 16)
!1008 = distinct !DILexicalBlock(scope: !1002, file: !254, line: 647, column: 10)
!1009 = !DILocation(line: 647, column: 112, scope: !1010)
!1010 = !DILexicalBlockFile(scope: !1005, file: !254, discriminator: 2)
!1011 = !DILocation(line: 647, column: 247, scope: !1005)
!1012 = !DILocation(line: 648, column: 7, scope: !1002)
!1013 = !DILocation(line: 656, column: 21, scope: !947)
!1014 = !DILocation(line: 656, column: 32, scope: !947)
!1015 = !DILocation(line: 656, column: 4, scope: !947)
!1016 = !DILocation(line: 656, column: 14, scope: !947)
!1017 = !DILocation(line: 656, column: 19, scope: !947)
!1018 = !DILocation(line: 657, column: 21, scope: !947)
!1019 = !DILocation(line: 657, column: 32, scope: !947)
!1020 = !DILocation(line: 657, column: 4, scope: !947)
!1021 = !DILocation(line: 657, column: 14, scope: !947)
!1022 = !DILocation(line: 657, column: 19, scope: !947)
!1023 = !DILocation(line: 658, column: 23, scope: !947)
!1024 = !DILocation(line: 658, column: 34, scope: !947)
!1025 = !DILocation(line: 658, column: 43, scope: !947)
!1026 = !DILocation(line: 658, column: 4, scope: !947)
!1027 = !DILocation(line: 658, column: 14, scope: !947)
!1028 = !DILocation(line: 658, column: 21, scope: !947)
!1029 = !DILocation(line: 659, column: 27, scope: !947)
!1030 = !DILocation(line: 659, column: 38, scope: !947)
!1031 = !DILocation(line: 659, column: 47, scope: !947)
!1032 = !DILocation(line: 659, column: 4, scope: !947)
!1033 = !DILocation(line: 659, column: 14, scope: !947)
!1034 = !DILocation(line: 659, column: 25, scope: !947)
!1035 = !DILocation(line: 660, column: 26, scope: !947)
!1036 = !DILocation(line: 660, column: 37, scope: !947)
!1037 = !DILocation(line: 660, column: 46, scope: !947)
!1038 = !DILocation(line: 660, column: 4, scope: !947)
!1039 = !DILocation(line: 660, column: 14, scope: !947)
!1040 = !DILocation(line: 660, column: 24, scope: !947)
!1041 = !DILocation(line: 661, column: 22, scope: !947)
!1042 = !DILocation(line: 661, column: 33, scope: !947)
!1043 = !DILocation(line: 661, column: 4, scope: !947)
!1044 = !DILocation(line: 661, column: 14, scope: !947)
!1045 = !DILocation(line: 661, column: 20, scope: !947)
!1046 = !DILocation(line: 662, column: 29, scope: !947)
!1047 = !DILocation(line: 662, column: 40, scope: !947)
!1048 = !DILocation(line: 662, column: 4, scope: !947)
!1049 = !DILocation(line: 662, column: 14, scope: !947)
!1050 = !DILocation(line: 662, column: 27, scope: !947)
!1051 = !DILocation(line: 663, column: 27, scope: !947)
!1052 = !DILocation(line: 663, column: 38, scope: !947)
!1053 = !DILocation(line: 663, column: 4, scope: !947)
!1054 = !DILocation(line: 663, column: 14, scope: !947)
!1055 = !DILocation(line: 663, column: 25, scope: !947)
!1056 = !DILocation(line: 664, column: 27, scope: !947)
!1057 = !DILocation(line: 664, column: 38, scope: !947)
!1058 = !DILocation(line: 664, column: 4, scope: !947)
!1059 = !DILocation(line: 664, column: 14, scope: !947)
!1060 = !DILocation(line: 664, column: 25, scope: !947)
!1061 = !DILocation(line: 665, column: 27, scope: !947)
!1062 = !DILocation(line: 665, column: 38, scope: !947)
!1063 = !DILocation(line: 665, column: 4, scope: !947)
!1064 = !DILocation(line: 665, column: 14, scope: !947)
!1065 = !DILocation(line: 665, column: 25, scope: !947)
!1066 = !DILocation(line: 666, column: 21, scope: !947)
!1067 = !DILocation(line: 666, column: 32, scope: !947)
!1068 = !DILocation(line: 666, column: 4, scope: !947)
!1069 = !DILocation(line: 666, column: 14, scope: !947)
!1070 = !DILocation(line: 666, column: 19, scope: !947)
!1071 = !DILocation(line: 667, column: 31, scope: !947)
!1072 = !DILocation(line: 667, column: 42, scope: !947)
!1073 = !DILocation(line: 667, column: 4, scope: !947)
!1074 = !DILocation(line: 667, column: 14, scope: !947)
!1075 = !DILocation(line: 667, column: 29, scope: !947)
!1076 = !DILocation(line: 668, column: 30, scope: !947)
!1077 = !DILocation(line: 668, column: 41, scope: !947)
!1078 = !DILocation(line: 668, column: 4, scope: !947)
!1079 = !DILocation(line: 668, column: 14, scope: !947)
!1080 = !DILocation(line: 668, column: 28, scope: !947)
!1081 = !DILocation(line: 669, column: 28, scope: !947)
!1082 = !DILocation(line: 669, column: 39, scope: !947)
!1083 = !DILocation(line: 669, column: 4, scope: !947)
!1084 = !DILocation(line: 669, column: 14, scope: !947)
!1085 = !DILocation(line: 669, column: 26, scope: !947)
!1086 = !DILocation(line: 670, column: 28, scope: !947)
!1087 = !DILocation(line: 670, column: 39, scope: !947)
!1088 = !DILocation(line: 670, column: 4, scope: !947)
!1089 = !DILocation(line: 670, column: 14, scope: !947)
!1090 = !DILocation(line: 670, column: 26, scope: !947)
!1091 = !DILocation(line: 671, column: 4, scope: !947)
!1092 = !DILocation(line: 672, column: 1, scope: !947)
!1093 = distinct !DISubprogram(name: "HgfsUnpackOpenPayloadV2", scope: !254, file: !254, line: 548, type: !1094, isLocal: true, isDefinition: true, scopeLine: 551, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !275)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!270, !860, !273, !760}
!1096 = !DILocalVariable(name: "requestV2", arg: 1, scope: !1093, file: !254, line: 548, type: !860)
!1097 = !DILocation(line: 548, column: 50, scope: !1093)
!1098 = !DILocalVariable(name: "payloadSize", arg: 2, scope: !1093, file: !254, line: 549, type: !273)
!1099 = !DILocation(line: 549, column: 32, scope: !1093)
!1100 = !DILocalVariable(name: "openInfo", arg: 3, scope: !1093, file: !254, line: 550, type: !760)
!1101 = !DILocation(line: 550, column: 43, scope: !1093)
!1102 = !DILocalVariable(name: "extra", scope: !1093, file: !254, line: 552, type: !273)
!1103 = !DILocation(line: 552, column: 11, scope: !1093)
!1104 = !DILocation(line: 555, column: 8, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1093, file: !254, line: 555, column: 8)
!1106 = !DILocation(line: 555, column: 20, scope: !1105)
!1107 = !DILocation(line: 555, column: 8, scope: !1093)
!1108 = !DILocation(line: 556, column: 7, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1105, file: !254, line: 555, column: 41)
!1110 = distinct !{!1110, !1108}
!1111 = !DILocation(line: 556, column: 33, scope: !1112)
!1112 = !DILexicalBlockFile(scope: !1113, file: !254, discriminator: 1)
!1113 = distinct !DILexicalBlock(scope: !1114, file: !254, line: 556, column: 31)
!1114 = distinct !DILexicalBlock(scope: !1115, file: !254, line: 556, column: 16)
!1115 = distinct !DILexicalBlock(scope: !1109, file: !254, line: 556, column: 10)
!1116 = !DILocation(line: 556, column: 112, scope: !1117)
!1117 = !DILexicalBlockFile(scope: !1112, file: !254, discriminator: 2)
!1118 = !DILocation(line: 556, column: 229, scope: !1112)
!1119 = !DILocation(line: 557, column: 7, scope: !1109)
!1120 = !DILocation(line: 560, column: 12, scope: !1093)
!1121 = !DILocation(line: 560, column: 24, scope: !1093)
!1122 = !DILocation(line: 560, column: 10, scope: !1093)
!1123 = !DILocation(line: 562, column: 10, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1093, file: !254, line: 562, column: 8)
!1125 = !DILocation(line: 562, column: 21, scope: !1124)
!1126 = !DILocation(line: 562, column: 26, scope: !1124)
!1127 = !DILocation(line: 562, column: 8, scope: !1093)
!1128 = !DILocation(line: 564, column: 7, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1124, file: !254, line: 562, column: 40)
!1130 = distinct !{!1130, !1128}
!1131 = !DILocation(line: 564, column: 33, scope: !1132)
!1132 = !DILexicalBlockFile(scope: !1133, file: !254, discriminator: 1)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !254, line: 564, column: 31)
!1134 = distinct !DILexicalBlock(scope: !1135, file: !254, line: 564, column: 16)
!1135 = distinct !DILexicalBlock(scope: !1129, file: !254, line: 564, column: 10)
!1136 = !DILocation(line: 564, column: 112, scope: !1137)
!1137 = !DILexicalBlockFile(scope: !1132, file: !254, discriminator: 2)
!1138 = !DILocation(line: 564, column: 224, scope: !1132)
!1139 = !DILocation(line: 565, column: 7, scope: !1129)
!1140 = !DILocation(line: 572, column: 8, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1093, file: !254, line: 572, column: 8)
!1142 = !DILocation(line: 572, column: 19, scope: !1141)
!1143 = !DILocation(line: 572, column: 28, scope: !1141)
!1144 = !DILocation(line: 572, column: 37, scope: !1141)
!1145 = !DILocation(line: 572, column: 35, scope: !1141)
!1146 = !DILocation(line: 572, column: 8, scope: !1093)
!1147 = !DILocation(line: 574, column: 7, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1141, file: !254, line: 572, column: 44)
!1149 = distinct !{!1149, !1147}
!1150 = !DILocation(line: 574, column: 33, scope: !1151)
!1151 = !DILexicalBlockFile(scope: !1152, file: !254, discriminator: 1)
!1152 = distinct !DILexicalBlock(scope: !1153, file: !254, line: 574, column: 31)
!1153 = distinct !DILexicalBlock(scope: !1154, file: !254, line: 574, column: 16)
!1154 = distinct !DILexicalBlock(scope: !1148, file: !254, line: 574, column: 10)
!1155 = !DILocation(line: 574, column: 112, scope: !1156)
!1156 = !DILexicalBlockFile(scope: !1151, file: !254, discriminator: 2)
!1157 = !DILocation(line: 574, column: 247, scope: !1151)
!1158 = !DILocation(line: 575, column: 7, scope: !1148)
!1159 = !DILocation(line: 584, column: 21, scope: !1093)
!1160 = !DILocation(line: 584, column: 32, scope: !1093)
!1161 = !DILocation(line: 584, column: 4, scope: !1093)
!1162 = !DILocation(line: 584, column: 14, scope: !1093)
!1163 = !DILocation(line: 584, column: 19, scope: !1093)
!1164 = !DILocation(line: 585, column: 21, scope: !1093)
!1165 = !DILocation(line: 585, column: 32, scope: !1093)
!1166 = !DILocation(line: 585, column: 4, scope: !1093)
!1167 = !DILocation(line: 585, column: 14, scope: !1093)
!1168 = !DILocation(line: 585, column: 19, scope: !1093)
!1169 = !DILocation(line: 586, column: 23, scope: !1093)
!1170 = !DILocation(line: 586, column: 34, scope: !1093)
!1171 = !DILocation(line: 586, column: 43, scope: !1093)
!1172 = !DILocation(line: 586, column: 4, scope: !1093)
!1173 = !DILocation(line: 586, column: 14, scope: !1093)
!1174 = !DILocation(line: 586, column: 21, scope: !1093)
!1175 = !DILocation(line: 587, column: 27, scope: !1093)
!1176 = !DILocation(line: 587, column: 38, scope: !1093)
!1177 = !DILocation(line: 587, column: 47, scope: !1093)
!1178 = !DILocation(line: 587, column: 4, scope: !1093)
!1179 = !DILocation(line: 587, column: 14, scope: !1093)
!1180 = !DILocation(line: 587, column: 25, scope: !1093)
!1181 = !DILocation(line: 588, column: 22, scope: !1093)
!1182 = !DILocation(line: 588, column: 33, scope: !1093)
!1183 = !DILocation(line: 588, column: 4, scope: !1093)
!1184 = !DILocation(line: 588, column: 14, scope: !1093)
!1185 = !DILocation(line: 588, column: 20, scope: !1093)
!1186 = !DILocation(line: 589, column: 29, scope: !1093)
!1187 = !DILocation(line: 589, column: 40, scope: !1093)
!1188 = !DILocation(line: 589, column: 4, scope: !1093)
!1189 = !DILocation(line: 589, column: 14, scope: !1093)
!1190 = !DILocation(line: 589, column: 27, scope: !1093)
!1191 = !DILocation(line: 590, column: 27, scope: !1093)
!1192 = !DILocation(line: 590, column: 38, scope: !1093)
!1193 = !DILocation(line: 590, column: 4, scope: !1093)
!1194 = !DILocation(line: 590, column: 14, scope: !1093)
!1195 = !DILocation(line: 590, column: 25, scope: !1093)
!1196 = !DILocation(line: 591, column: 27, scope: !1093)
!1197 = !DILocation(line: 591, column: 38, scope: !1093)
!1198 = !DILocation(line: 591, column: 4, scope: !1093)
!1199 = !DILocation(line: 591, column: 14, scope: !1093)
!1200 = !DILocation(line: 591, column: 25, scope: !1093)
!1201 = !DILocation(line: 592, column: 27, scope: !1093)
!1202 = !DILocation(line: 592, column: 38, scope: !1093)
!1203 = !DILocation(line: 592, column: 4, scope: !1093)
!1204 = !DILocation(line: 592, column: 14, scope: !1093)
!1205 = !DILocation(line: 592, column: 25, scope: !1093)
!1206 = !DILocation(line: 593, column: 21, scope: !1093)
!1207 = !DILocation(line: 593, column: 32, scope: !1093)
!1208 = !DILocation(line: 593, column: 4, scope: !1093)
!1209 = !DILocation(line: 593, column: 14, scope: !1093)
!1210 = !DILocation(line: 593, column: 19, scope: !1093)
!1211 = !DILocation(line: 594, column: 31, scope: !1093)
!1212 = !DILocation(line: 594, column: 42, scope: !1093)
!1213 = !DILocation(line: 594, column: 4, scope: !1093)
!1214 = !DILocation(line: 594, column: 14, scope: !1093)
!1215 = !DILocation(line: 594, column: 29, scope: !1093)
!1216 = !DILocation(line: 595, column: 30, scope: !1093)
!1217 = !DILocation(line: 595, column: 41, scope: !1093)
!1218 = !DILocation(line: 595, column: 4, scope: !1093)
!1219 = !DILocation(line: 595, column: 14, scope: !1093)
!1220 = !DILocation(line: 595, column: 28, scope: !1093)
!1221 = !DILocation(line: 596, column: 28, scope: !1093)
!1222 = !DILocation(line: 596, column: 39, scope: !1093)
!1223 = !DILocation(line: 596, column: 4, scope: !1093)
!1224 = !DILocation(line: 596, column: 14, scope: !1093)
!1225 = !DILocation(line: 596, column: 26, scope: !1093)
!1226 = !DILocation(line: 597, column: 28, scope: !1093)
!1227 = !DILocation(line: 597, column: 39, scope: !1093)
!1228 = !DILocation(line: 597, column: 4, scope: !1093)
!1229 = !DILocation(line: 597, column: 14, scope: !1093)
!1230 = !DILocation(line: 597, column: 26, scope: !1093)
!1231 = !DILocation(line: 598, column: 4, scope: !1093)
!1232 = !DILocation(line: 599, column: 1, scope: !1093)
!1233 = distinct !DISubprogram(name: "HgfsUnpackOpenPayloadV1", scope: !254, file: !254, line: 491, type: !1234, isLocal: true, isDefinition: true, scopeLine: 494, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !275)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!270, !901, !273, !760}
!1236 = !DILocalVariable(name: "requestV1", arg: 1, scope: !1233, file: !254, line: 491, type: !901)
!1237 = !DILocation(line: 491, column: 48, scope: !1233)
!1238 = !DILocalVariable(name: "payloadSize", arg: 2, scope: !1233, file: !254, line: 492, type: !273)
!1239 = !DILocation(line: 492, column: 32, scope: !1233)
!1240 = !DILocalVariable(name: "openInfo", arg: 3, scope: !1233, file: !254, line: 493, type: !760)
!1241 = !DILocation(line: 493, column: 43, scope: !1233)
!1242 = !DILocalVariable(name: "extra", scope: !1233, file: !254, line: 495, type: !273)
!1243 = !DILocation(line: 495, column: 11, scope: !1233)
!1244 = !DILocation(line: 498, column: 8, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1233, file: !254, line: 498, column: 8)
!1246 = !DILocation(line: 498, column: 20, scope: !1245)
!1247 = !DILocation(line: 498, column: 8, scope: !1233)
!1248 = !DILocation(line: 499, column: 7, scope: !1249)
!1249 = distinct !DILexicalBlock(scope: !1245, file: !254, line: 498, column: 41)
!1250 = distinct !{!1250, !1248}
!1251 = !DILocation(line: 499, column: 33, scope: !1252)
!1252 = !DILexicalBlockFile(scope: !1253, file: !254, discriminator: 1)
!1253 = distinct !DILexicalBlock(scope: !1254, file: !254, line: 499, column: 31)
!1254 = distinct !DILexicalBlock(scope: !1255, file: !254, line: 499, column: 16)
!1255 = distinct !DILexicalBlock(scope: !1249, file: !254, line: 499, column: 10)
!1256 = !DILocation(line: 499, column: 112, scope: !1257)
!1257 = !DILexicalBlockFile(scope: !1252, file: !254, discriminator: 2)
!1258 = !DILocation(line: 499, column: 229, scope: !1252)
!1259 = !DILocation(line: 500, column: 7, scope: !1249)
!1260 = !DILocation(line: 503, column: 12, scope: !1233)
!1261 = !DILocation(line: 503, column: 24, scope: !1233)
!1262 = !DILocation(line: 503, column: 10, scope: !1233)
!1263 = !DILocation(line: 509, column: 8, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1233, file: !254, line: 509, column: 8)
!1265 = !DILocation(line: 509, column: 19, scope: !1264)
!1266 = !DILocation(line: 509, column: 28, scope: !1264)
!1267 = !DILocation(line: 509, column: 37, scope: !1264)
!1268 = !DILocation(line: 509, column: 35, scope: !1264)
!1269 = !DILocation(line: 509, column: 8, scope: !1233)
!1270 = !DILocation(line: 511, column: 7, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1264, file: !254, line: 509, column: 44)
!1272 = distinct !{!1272, !1270}
!1273 = !DILocation(line: 511, column: 33, scope: !1274)
!1274 = !DILexicalBlockFile(scope: !1275, file: !254, discriminator: 1)
!1275 = distinct !DILexicalBlock(scope: !1276, file: !254, line: 511, column: 31)
!1276 = distinct !DILexicalBlock(scope: !1277, file: !254, line: 511, column: 16)
!1277 = distinct !DILexicalBlock(scope: !1271, file: !254, line: 511, column: 10)
!1278 = !DILocation(line: 511, column: 112, scope: !1279)
!1279 = !DILexicalBlockFile(scope: !1274, file: !254, discriminator: 2)
!1280 = !DILocation(line: 511, column: 247, scope: !1274)
!1281 = !DILocation(line: 512, column: 7, scope: !1271)
!1282 = !DILocation(line: 516, column: 4, scope: !1233)
!1283 = !DILocation(line: 516, column: 14, scope: !1233)
!1284 = !DILocation(line: 516, column: 19, scope: !1233)
!1285 = !DILocation(line: 520, column: 21, scope: !1233)
!1286 = !DILocation(line: 520, column: 32, scope: !1233)
!1287 = !DILocation(line: 520, column: 4, scope: !1233)
!1288 = !DILocation(line: 520, column: 14, scope: !1233)
!1289 = !DILocation(line: 520, column: 19, scope: !1233)
!1290 = !DILocation(line: 521, column: 23, scope: !1233)
!1291 = !DILocation(line: 521, column: 34, scope: !1233)
!1292 = !DILocation(line: 521, column: 43, scope: !1233)
!1293 = !DILocation(line: 521, column: 4, scope: !1233)
!1294 = !DILocation(line: 521, column: 14, scope: !1233)
!1295 = !DILocation(line: 521, column: 21, scope: !1233)
!1296 = !DILocation(line: 522, column: 27, scope: !1233)
!1297 = !DILocation(line: 522, column: 38, scope: !1233)
!1298 = !DILocation(line: 522, column: 47, scope: !1233)
!1299 = !DILocation(line: 522, column: 4, scope: !1233)
!1300 = !DILocation(line: 522, column: 14, scope: !1233)
!1301 = !DILocation(line: 522, column: 25, scope: !1233)
!1302 = !DILocation(line: 523, column: 22, scope: !1233)
!1303 = !DILocation(line: 523, column: 33, scope: !1233)
!1304 = !DILocation(line: 523, column: 4, scope: !1233)
!1305 = !DILocation(line: 523, column: 14, scope: !1233)
!1306 = !DILocation(line: 523, column: 20, scope: !1233)
!1307 = !DILocation(line: 524, column: 27, scope: !1233)
!1308 = !DILocation(line: 524, column: 38, scope: !1233)
!1309 = !DILocation(line: 524, column: 4, scope: !1233)
!1310 = !DILocation(line: 524, column: 14, scope: !1233)
!1311 = !DILocation(line: 524, column: 25, scope: !1233)
!1312 = !DILocation(line: 525, column: 4, scope: !1233)
!1313 = !DILocation(line: 526, column: 1, scope: !1233)
!1314 = distinct !DISubprogram(name: "HgfsPackReplyHeader", scope: !254, file: !254, line: 840, type: !1315, isLocal: false, isDefinition: true, scopeLine: 849, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !275)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{!270, !367, !170, !270, !198, !170, !176, !170, !273, !202}
!1317 = !DILocalVariable(name: "status", arg: 1, scope: !1314, file: !254, line: 840, type: !367)
!1318 = !DILocation(line: 840, column: 40, scope: !1314)
!1319 = !DILocalVariable(name: "payloadSize", arg: 2, scope: !1314, file: !254, line: 841, type: !170)
!1320 = !DILocation(line: 841, column: 28, scope: !1314)
!1321 = !DILocalVariable(name: "sessionEnabledHeader", arg: 3, scope: !1314, file: !254, line: 842, type: !270)
!1322 = !DILocation(line: 842, column: 26, scope: !1314)
!1323 = !DILocalVariable(name: "sessionId", arg: 4, scope: !1314, file: !254, line: 843, type: !198)
!1324 = !DILocation(line: 843, column: 28, scope: !1314)
!1325 = !DILocalVariable(name: "requestId", arg: 5, scope: !1314, file: !254, line: 844, type: !170)
!1326 = !DILocation(line: 844, column: 28, scope: !1314)
!1327 = !DILocalVariable(name: "opcode", arg: 6, scope: !1314, file: !254, line: 845, type: !176)
!1328 = !DILocation(line: 845, column: 28, scope: !1314)
!1329 = !DILocalVariable(name: "hdrFlags", arg: 7, scope: !1314, file: !254, line: 846, type: !170)
!1330 = !DILocation(line: 846, column: 28, scope: !1314)
!1331 = !DILocalVariable(name: "hdrPacketSize", arg: 8, scope: !1314, file: !254, line: 847, type: !273)
!1332 = !DILocation(line: 847, column: 28, scope: !1314)
!1333 = !DILocalVariable(name: "hdrPacket", arg: 9, scope: !1314, file: !254, line: 848, type: !202)
!1334 = !DILocation(line: 848, column: 27, scope: !1314)
!1335 = !DILocalVariable(name: "replyStatus", scope: !1314, file: !254, line: 850, type: !1336)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsStatus", file: !86, line: 203, baseType: !112)
!1337 = !DILocation(line: 850, column: 15, scope: !1314)
!1338 = !DILocalVariable(name: "result", scope: !1314, file: !254, line: 851, type: !270)
!1339 = !DILocation(line: 851, column: 9, scope: !1314)
!1340 = !DILocation(line: 853, column: 15, scope: !1341)
!1341 = distinct !DILexicalBlock(scope: !1314, file: !254, line: 853, column: 7)
!1342 = !DILocation(line: 853, column: 12, scope: !1341)
!1343 = !DILocation(line: 853, column: 7, scope: !1314)
!1344 = !DILocation(line: 854, column: 14, scope: !1345)
!1345 = distinct !DILexicalBlock(scope: !1341, file: !254, line: 853, column: 26)
!1346 = !DILocation(line: 855, column: 7, scope: !1345)
!1347 = !DILocation(line: 858, column: 48, scope: !1314)
!1348 = !DILocation(line: 858, column: 18, scope: !1314)
!1349 = !DILocation(line: 858, column: 16, scope: !1314)
!1350 = !DILocation(line: 859, column: 8, scope: !1351)
!1351 = distinct !DILexicalBlock(scope: !1314, file: !254, line: 859, column: 8)
!1352 = !DILocation(line: 859, column: 8, scope: !1314)
!1353 = !DILocation(line: 860, column: 38, scope: !1354)
!1354 = distinct !DILexicalBlock(scope: !1351, file: !254, line: 859, column: 30)
!1355 = !DILocation(line: 860, column: 51, scope: !1354)
!1356 = !DILocation(line: 860, column: 64, scope: !1354)
!1357 = !DILocation(line: 861, column: 38, scope: !1354)
!1358 = !DILocation(line: 861, column: 49, scope: !1354)
!1359 = !DILocation(line: 862, column: 38, scope: !1354)
!1360 = !DILocation(line: 862, column: 53, scope: !1354)
!1361 = !DILocation(line: 860, column: 16, scope: !1354)
!1362 = !DILocation(line: 860, column: 14, scope: !1354)
!1363 = !DILocation(line: 863, column: 4, scope: !1354)
!1364 = !DILocation(line: 864, column: 42, scope: !1365)
!1365 = distinct !DILexicalBlock(scope: !1351, file: !254, line: 863, column: 11)
!1366 = !DILocation(line: 864, column: 55, scope: !1365)
!1367 = !DILocation(line: 864, column: 66, scope: !1365)
!1368 = !DILocation(line: 865, column: 42, scope: !1365)
!1369 = !DILocation(line: 864, column: 16, scope: !1365)
!1370 = !DILocation(line: 864, column: 14, scope: !1365)
!1371 = !DILocation(line: 859, column: 8, scope: !1372)
!1372 = !DILexicalBlockFile(scope: !1351, file: !254, discriminator: 1)
!1373 = !DILocation(line: 869, column: 11, scope: !1314)
!1374 = !DILocation(line: 869, column: 4, scope: !1314)
!1375 = distinct !DISubprogram(name: "HgfsPackReplyHeaderV4", scope: !254, file: !254, line: 758, type: !1376, isLocal: true, isDefinition: true, scopeLine: 766, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !275)
!1376 = !DISubroutineType(types: !1377)
!1377 = !{!270, !1336, !170, !176, !198, !170, !170, !273, !177}
!1378 = !DILocalVariable(name: "status", arg: 1, scope: !1375, file: !254, line: 758, type: !1336)
!1379 = !DILocation(line: 758, column: 34, scope: !1375)
!1380 = !DILocalVariable(name: "payloadSize", arg: 2, scope: !1375, file: !254, line: 759, type: !170)
!1381 = !DILocation(line: 759, column: 30, scope: !1375)
!1382 = !DILocalVariable(name: "opcode", arg: 3, scope: !1375, file: !254, line: 760, type: !176)
!1383 = !DILocation(line: 760, column: 30, scope: !1375)
!1384 = !DILocalVariable(name: "sessionId", arg: 4, scope: !1375, file: !254, line: 761, type: !198)
!1385 = !DILocation(line: 761, column: 30, scope: !1375)
!1386 = !DILocalVariable(name: "requestId", arg: 5, scope: !1375, file: !254, line: 762, type: !170)
!1387 = !DILocation(line: 762, column: 30, scope: !1375)
!1388 = !DILocalVariable(name: "hdrFlags", arg: 6, scope: !1375, file: !254, line: 763, type: !170)
!1389 = !DILocation(line: 763, column: 30, scope: !1375)
!1390 = !DILocalVariable(name: "hdrPacketSize", arg: 7, scope: !1375, file: !254, line: 764, type: !273)
!1391 = !DILocation(line: 764, column: 30, scope: !1375)
!1392 = !DILocalVariable(name: "hdrPacket", arg: 8, scope: !1375, file: !254, line: 765, type: !177)
!1393 = !DILocation(line: 765, column: 35, scope: !1375)
!1394 = !DILocalVariable(name: "result", scope: !1375, file: !254, line: 767, type: !270)
!1395 = !DILocation(line: 767, column: 9, scope: !1375)
!1396 = !DILocation(line: 769, column: 8, scope: !1397)
!1397 = distinct !DILexicalBlock(scope: !1375, file: !254, line: 769, column: 8)
!1398 = !DILocation(line: 769, column: 22, scope: !1397)
!1399 = !DILocation(line: 769, column: 8, scope: !1375)
!1400 = !DILocation(line: 770, column: 14, scope: !1401)
!1401 = distinct !DILexicalBlock(scope: !1397, file: !254, line: 769, column: 44)
!1402 = !DILocation(line: 770, column: 7, scope: !1401)
!1403 = !DILocation(line: 772, column: 7, scope: !1401)
!1404 = !DILocation(line: 772, column: 18, scope: !1401)
!1405 = !DILocation(line: 772, column: 26, scope: !1401)
!1406 = !DILocation(line: 773, column: 7, scope: !1401)
!1407 = !DILocation(line: 773, column: 18, scope: !1401)
!1408 = !DILocation(line: 773, column: 24, scope: !1401)
!1409 = !DILocation(line: 774, column: 31, scope: !1401)
!1410 = !DILocation(line: 774, column: 43, scope: !1401)
!1411 = !DILocation(line: 774, column: 7, scope: !1401)
!1412 = !DILocation(line: 774, column: 18, scope: !1401)
!1413 = !DILocation(line: 774, column: 29, scope: !1401)
!1414 = !DILocation(line: 775, column: 7, scope: !1401)
!1415 = !DILocation(line: 775, column: 18, scope: !1401)
!1416 = !DILocation(line: 775, column: 29, scope: !1401)
!1417 = !DILocation(line: 776, column: 30, scope: !1401)
!1418 = !DILocation(line: 776, column: 7, scope: !1401)
!1419 = !DILocation(line: 776, column: 18, scope: !1401)
!1420 = !DILocation(line: 776, column: 28, scope: !1401)
!1421 = !DILocation(line: 777, column: 23, scope: !1401)
!1422 = !DILocation(line: 777, column: 7, scope: !1401)
!1423 = !DILocation(line: 777, column: 18, scope: !1401)
!1424 = !DILocation(line: 777, column: 21, scope: !1401)
!1425 = !DILocation(line: 778, column: 27, scope: !1401)
!1426 = !DILocation(line: 778, column: 7, scope: !1401)
!1427 = !DILocation(line: 778, column: 18, scope: !1401)
!1428 = !DILocation(line: 778, column: 25, scope: !1401)
!1429 = !DILocation(line: 779, column: 26, scope: !1401)
!1430 = !DILocation(line: 779, column: 7, scope: !1401)
!1431 = !DILocation(line: 779, column: 18, scope: !1401)
!1432 = !DILocation(line: 779, column: 24, scope: !1401)
!1433 = !DILocation(line: 780, column: 32, scope: !1401)
!1434 = !DILocation(line: 780, column: 7, scope: !1401)
!1435 = !DILocation(line: 780, column: 18, scope: !1401)
!1436 = !DILocation(line: 780, column: 30, scope: !1401)
!1437 = !DILocation(line: 781, column: 30, scope: !1401)
!1438 = !DILocation(line: 781, column: 7, scope: !1401)
!1439 = !DILocation(line: 781, column: 18, scope: !1401)
!1440 = !DILocation(line: 781, column: 28, scope: !1401)
!1441 = !DILocation(line: 782, column: 14, scope: !1401)
!1442 = !DILocation(line: 783, column: 4, scope: !1401)
!1443 = !DILocation(line: 784, column: 11, scope: !1375)
!1444 = !DILocation(line: 784, column: 4, scope: !1375)
!1445 = distinct !DISubprogram(name: "HgfsPackLegacyReplyHeader", scope: !254, file: !254, line: 805, type: !1446, isLocal: true, isDefinition: true, scopeLine: 809, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !275)
!1446 = !DISubroutineType(types: !1447)
!1447 = !{!270, !1336, !169, !273, !1448}
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsReply", file: !4, line: 681, baseType: !1450)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsReply", file: !4, line: 676, size: 64, align: 8, elements: !1451)
!1451 = !{!1452, !1453}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1450, file: !4, line: 677, baseType: !169, size: 32, align: 32)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !1450, file: !4, line: 678, baseType: !1336, size: 32, align: 32, offset: 32)
!1454 = !DILocalVariable(name: "status", arg: 1, scope: !1445, file: !254, line: 805, type: !1336)
!1455 = !DILocation(line: 805, column: 38, scope: !1445)
!1456 = !DILocalVariable(name: "id", arg: 2, scope: !1445, file: !254, line: 806, type: !169)
!1457 = !DILocation(line: 806, column: 38, scope: !1445)
!1458 = !DILocalVariable(name: "hdrPacketSize", arg: 3, scope: !1445, file: !254, line: 807, type: !273)
!1459 = !DILocation(line: 807, column: 34, scope: !1445)
