; ModuleID = './impersonatePosix.o.i'
source_filename = "./impersonatePosix.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ImpersonationState = type { i8*, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@impLinux = internal global %struct.ImpersonationState* null, align 8
@.str = private unnamed_addr constant [14 x i8] c"VERIFY %s:%d\0A\00", align 1
@.str.1 = private unnamed_addr constant [19 x i8] c"impersonatePosix.c\00", align 1
@.str.2 = private unnamed_addr constant [30 x i8] c"Impersonate: setspecific: %d\0A\00", align 1
@.str.3 = private unnamed_addr constant [44 x i8] c"Failed to lookup owner for: %s. Reason: %s\0A\00", align 1
@.str.4 = private unnamed_addr constant [48 x i8] c"Failed to lookup user with uid: %u. Reason: %s\0A\00", align 1
@.str.5 = private unnamed_addr constant [44 x i8] c"Failed to get password entry for uid 0: %s\0A\00", align 1
@.str.6 = private unnamed_addr constant [5 x i8] c"USER\00", align 1
@.str.7 = private unnamed_addr constant [5 x i8] c"HOME\00", align 1
@.str.8 = private unnamed_addr constant [6 x i8] c"SHELL\00", align 1
@.str.9 = private unnamed_addr constant [51 x i8] c"Failed to get password entry for : %s. Reason: %s\0A\00", align 1

; Function Attrs: nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !12)
!1 = !DIFile(filename: "impersonatePosix.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line466")
!2 = !{}
!3 = !{!4, !5, !7}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !8, line: 43, baseType: !9)
!8 = !DIFile(filename: "/usr/include/pwd.h", directory: "/home/lichi/Desktop/open-vm-tools/line466")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !10, line: 125, baseType: !11)
!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line466")
!11 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!12 = !{!13}
!13 = distinct !DIGlobalVariable(name: "impLinux", scope: !0, file: !14, line: 48, type: !15, isLocal: true, isDefinition: true, variable: %struct.ImpersonationState** @impLinux)
!14 = !DIFile(filename: "impersonatePosix.c", directory: "/home/lichi/Desktop/open-vm-tools/line466")
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImpersonationState", file: !17, line: 49, baseType: !18)
!17 = !DIFile(filename: "impersonateInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line466")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImpersonationState", file: !17, line: 41, size: 128, align: 64, elements: !19)
!19 = !{!20, !23}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "impersonatedUser", scope: !18, file: !17, line: 42, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", scope: !18, file: !17, line: 43, baseType: !24, size: 32, align: 32, offset: 64)
!24 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!25 = !{i32 2, !"Dwarf Version", i32 4}
!26 = !{i32 2, !"Debug Info Version", i32 3}
!27 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!28 = distinct !DISubprogram(name: "ImpersonateInit", scope: !14, file: !14, line: 70, type: !29, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!29 = !DISubroutineType(types: !30)
!30 = !{null}
!31 = !DILocation(line: 83, column: 1, scope: !28)
!32 = distinct !DISubprogram(name: "ImpersonateGetTLS", scope: !14, file: !14, line: 131, type: !33, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!33 = !DISubroutineType(types: !34)
!34 = !{!15}
!35 = !DILocalVariable(name: "ptr", scope: !32, file: !14, line: 133, type: !15)
!36 = !DIExpression()
!37 = !DILocation(line: 133, column: 24, scope: !32)
!38 = !DILocalVariable(name: "status", scope: !32, file: !14, line: 134, type: !24)
!39 = !DILocation(line: 134, column: 8, scope: !32)
!40 = !DILocation(line: 141, column: 8, scope: !32)
!41 = !DILocation(line: 141, column: 6, scope: !32)
!42 = !DILocation(line: 143, column: 8, scope: !43)
!43 = distinct !DILexicalBlock(scope: !32, file: !14, line: 143, column: 8)
!44 = !DILocation(line: 143, column: 12, scope: !43)
!45 = !DILocation(line: 143, column: 8, scope: !32)
!46 = !DILocation(line: 144, column: 14, scope: !47)
!47 = distinct !DILexicalBlock(scope: !43, file: !14, line: 143, column: 20)
!48 = !DILocation(line: 144, column: 7, scope: !47)
!49 = !DILocation(line: 148, column: 10, scope: !32)
!50 = !DILocation(line: 148, column: 8, scope: !32)
!51 = !DILocation(line: 149, column: 30, scope: !52)
!52 = distinct !DILexicalBlock(scope: !53, file: !14, line: 149, column: 10)
!53 = distinct !DILexicalBlock(scope: !32, file: !14, line: 149, column: 5)
!54 = !DILocation(line: 149, column: 28, scope: !52)
!55 = !DILocation(line: 149, column: 27, scope: !52)
!56 = !DILocation(line: 149, column: 10, scope: !52)
!57 = !DILocation(line: 149, column: 10, scope: !53)
!58 = !DILocation(line: 149, column: 43, scope: !59)
!59 = !DILexicalBlockFile(scope: !60, file: !14, discriminator: 1)
!60 = distinct !DILexicalBlock(scope: !52, file: !14, line: 149, column: 41)
!61 = !DILocation(line: 153, column: 13, scope: !32)
!62 = !DILocation(line: 153, column: 11, scope: !32)
!63 = !DILocation(line: 154, column: 9, scope: !32)
!64 = !DILocation(line: 156, column: 8, scope: !65)
!65 = distinct !DILexicalBlock(scope: !32, file: !14, line: 156, column: 8)
!66 = !DILocation(line: 156, column: 15, scope: !65)
!67 = !DILocation(line: 156, column: 8, scope: !32)
!68 = !DILocation(line: 157, column: 49, scope: !69)
!69 = distinct !DILexicalBlock(scope: !65, file: !14, line: 156, column: 21)
!70 = !DILocation(line: 157, column: 7, scope: !69)
!71 = !DILocation(line: 158, column: 33, scope: !72)
!72 = distinct !DILexicalBlock(scope: !73, file: !14, line: 158, column: 13)
!73 = distinct !DILexicalBlock(scope: !69, file: !14, line: 158, column: 8)
!74 = !DILocation(line: 158, column: 40, scope: !72)
!75 = !DILocation(line: 158, column: 31, scope: !72)
!76 = !DILocation(line: 158, column: 30, scope: !72)
!77 = !DILocation(line: 158, column: 13, scope: !72)
!78 = !DILocation(line: 158, column: 13, scope: !73)
!79 = !DILocation(line: 158, column: 54, scope: !80)
!80 = !DILexicalBlockFile(scope: !81, file: !14, discriminator: 1)
!81 = distinct !DILexicalBlock(scope: !72, file: !14, line: 158, column: 52)
!82 = !DILocation(line: 159, column: 4, scope: !69)
!83 = !DILocation(line: 161, column: 11, scope: !32)
!84 = !DILocation(line: 161, column: 4, scope: !32)
!85 = !DILocation(line: 162, column: 1, scope: !32)
!86 = distinct !DISubprogram(name: "ImpersonateRunas", scope: !14, file: !14, line: 182, type: !87, isLocal: false, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!87 = !DISubroutineType(types: !88)
!88 = !{!89, !21, !21, !91}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !90, line: 230, baseType: !6)
!90 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line466")
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "AuthToken", file: !92, line: 42, baseType: !93)
!92 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/auth.h", directory: "/home/lichi/Desktop/open-vm-tools/line466")
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !8, line: 49, size: 384, align: 64, elements: !96)
!96 = !{!97, !98, !99, !100, !102, !103, !104}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !95, file: !8, line: 51, baseType: !5, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !95, file: !8, line: 52, baseType: !5, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !95, file: !8, line: 53, baseType: !9, size: 32, align: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !95, file: !8, line: 54, baseType: !101, size: 32, align: 32, offset: 160)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !10, line: 126, baseType: !11)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !95, file: !8, line: 55, baseType: !5, size: 64, align: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !95, file: !8, line: 56, baseType: !5, size: 64, align: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !95, file: !8, line: 57, baseType: !5, size: 64, align: 64, offset: 320)
!105 = !DILocalVariable(name: "cfg", arg: 1, scope: !86, file: !14, line: 182, type: !21)
!106 = !DILocation(line: 182, column: 30, scope: !86)
!107 = !DILocalVariable(name: "caller", arg: 2, scope: !86, file: !14, line: 183, type: !21)
!108 = !DILocation(line: 183, column: 30, scope: !86)
!109 = !DILocalVariable(name: "callerToken", arg: 3, scope: !86, file: !14, line: 184, type: !91)
!110 = !DILocation(line: 184, column: 28, scope: !86)
!111 = !DILocation(line: 191, column: 28, scope: !86)
!112 = !DILocation(line: 191, column: 11, scope: !86)
!113 = !DILocation(line: 191, column: 4, scope: !86)
!114 = distinct !DISubprogram(name: "ImpersonateOwner", scope: !14, file: !14, line: 212, type: !115, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!115 = !DISubroutineType(types: !116)
!116 = !{!89, !21}
!117 = !DILocalVariable(name: "file", arg: 1, scope: !114, file: !14, line: 212, type: !21)
!118 = !DILocation(line: 212, column: 30, scope: !114)
!119 = !DILocalVariable(name: "buf", scope: !114, file: !14, line: 214, type: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !121, line: 46, size: 1152, align: 64, elements: !122)
!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/open-vm-tools/line466")
!122 = !{!123, !126, !128, !130, !132, !133, !134, !135, !136, !139, !141, !143, !151, !152, !153}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !120, file: !121, line: 48, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !10, line: 124, baseType: !125)
!125 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !120, file: !121, line: 53, baseType: !127, size: 64, align: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !10, line: 127, baseType: !125)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !120, file: !121, line: 61, baseType: !129, size: 64, align: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !10, line: 130, baseType: !125)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !120, file: !121, line: 62, baseType: !131, size: 32, align: 32, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !10, line: 129, baseType: !11)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !120, file: !121, line: 64, baseType: !9, size: 32, align: 32, offset: 224)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !120, file: !121, line: 65, baseType: !101, size: 32, align: 32, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !120, file: !121, line: 67, baseType: !24, size: 32, align: 32, offset: 288)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !120, file: !121, line: 69, baseType: !124, size: 64, align: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !120, file: !121, line: 74, baseType: !137, size: 64, align: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !10, line: 131, baseType: !138)
!138 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !120, file: !121, line: 78, baseType: !140, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !10, line: 153, baseType: !138)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !120, file: !121, line: 80, baseType: !142, size: 64, align: 64, offset: 512)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !10, line: 158, baseType: !138)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !120, file: !121, line: 91, baseType: !144, size: 128, align: 64, offset: 576)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !145, line: 120, size: 128, align: 64, elements: !146)
!145 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line466")
!146 = !{!147, !149}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !144, file: !145, line: 122, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !10, line: 139, baseType: !138)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !144, file: !145, line: 123, baseType: !150, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !10, line: 175, baseType: !138)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !120, file: !121, line: 92, baseType: !144, size: 128, align: 64, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !120, file: !121, line: 93, baseType: !144, size: 128, align: 64, offset: 832)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !120, file: !121, line: 106, baseType: !154, size: 192, align: 64, offset: 960)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 192, align: 64, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 3)
!157 = !DILocation(line: 214, column: 16, scope: !114)
!158 = !DILocalVariable(name: "buffer", scope: !114, file: !14, line: 215, type: !159)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 65536, align: 8, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 8192)
!162 = !DILocation(line: 215, column: 9, scope: !114)
!163 = !DILocalVariable(name: "pw", scope: !114, file: !14, line: 216, type: !95)
!164 = !DILocation(line: 216, column: 18, scope: !114)
!165 = !DILocalVariable(name: "ppw", scope: !114, file: !14, line: 217, type: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!167 = !DILocation(line: 217, column: 19, scope: !114)
!168 = !DILocalVariable(name: "error", scope: !114, file: !14, line: 218, type: !24)
!169 = !DILocation(line: 218, column: 8, scope: !114)
!170 = !DILocation(line: 220, column: 19, scope: !171)
!171 = distinct !DILexicalBlock(scope: !114, file: !14, line: 220, column: 8)
!172 = !DILocation(line: 220, column: 8, scope: !171)
!173 = !DILocation(line: 220, column: 31, scope: !171)
!174 = !DILocation(line: 220, column: 8, scope: !114)
!175 = !DILocation(line: 221, column: 63, scope: !176)
!176 = distinct !DILexicalBlock(scope: !171, file: !14, line: 220, column: 38)
!177 = !DILocation(line: 222, column: 33, scope: !176)
!178 = !DILocation(line: 222, column: 32, scope: !176)
!179 = !DILocation(line: 222, column: 15, scope: !180)
!180 = !DILexicalBlockFile(scope: !176, file: !14, discriminator: 1)
!181 = !DILocation(line: 221, column: 7, scope: !176)
!182 = !DILocation(line: 223, column: 7, scope: !176)
!183 = !DILocation(line: 226, column: 38, scope: !184)
!184 = distinct !DILexicalBlock(scope: !114, file: !14, line: 226, column: 8)
!185 = !DILocation(line: 226, column: 51, scope: !184)
!186 = !DILocation(line: 226, column: 17, scope: !184)
!187 = !DILocation(line: 226, column: 15, scope: !184)
!188 = !DILocation(line: 226, column: 73, scope: !184)
!189 = !DILocation(line: 226, column: 78, scope: !184)
!190 = !DILocation(line: 226, column: 82, scope: !191)
!191 = !DILexicalBlockFile(scope: !184, file: !14, discriminator: 1)
!192 = !DILocation(line: 226, column: 8, scope: !191)
!193 = !DILocation(line: 227, column: 11, scope: !194)
!194 = distinct !DILexicalBlock(scope: !195, file: !14, line: 227, column: 11)
!195 = distinct !DILexicalBlock(scope: !184, file: !14, line: 226, column: 87)
!196 = !DILocation(line: 227, column: 17, scope: !194)
!197 = !DILocation(line: 227, column: 11, scope: !195)
!198 = !DILocation(line: 228, column: 16, scope: !199)
!199 = distinct !DILexicalBlock(scope: !194, file: !14, line: 227, column: 23)
!200 = !DILocation(line: 229, column: 7, scope: !199)
!201 = !DILocation(line: 230, column: 77, scope: !195)
!202 = !DILocation(line: 231, column: 32, scope: !195)
!203 = !DILocation(line: 231, column: 15, scope: !195)
!204 = !DILocation(line: 230, column: 7, scope: !195)
!205 = !DILocation(line: 232, column: 7, scope: !195)
!206 = !DILocation(line: 235, column: 30, scope: !114)
!207 = !DILocation(line: 235, column: 11, scope: !114)
!208 = !DILocation(line: 235, column: 4, scope: !114)
!209 = !DILocation(line: 236, column: 1, scope: !114)
!210 = distinct !DISubprogram(name: "ImpersonateDoPosix", scope: !14, file: !14, line: 343, type: !211, isLocal: true, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!211 = !DISubroutineType(types: !212)
!212 = !{!89, !166}
!213 = !DILocalVariable(name: "pwd", arg: 1, scope: !210, file: !14, line: 343, type: !166)
!214 = !DILocation(line: 343, column: 35, scope: !210)
!215 = !DILocalVariable(name: "ret", scope: !210, file: !14, line: 345, type: !24)
