; ModuleID = './libSlashProc_la-net.o.i'
source_filename = "./libSlashProc_la-net.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GRegex = type opaque
%struct._GHashTable = type opaque
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }
%struct._GSource = type { i8*, %struct._GSourceCallbackFuncs*, %struct._GSourceFuncs*, i32, %struct._GMainContext*, i32, i32, i32, %struct._GSList*, %struct._GSource*, %struct._GSource*, i8*, %struct._GSourcePrivate* }
%struct._GSourceCallbackFuncs = type { void (i8*)*, void (i8*)*, void (i8*, %struct._GSource*, i32 (i8*)**, i8**)* }
%struct._GSourceFuncs = type { i32 (%struct._GSource*, i32*)*, i32 (%struct._GSource*)*, i32 (%struct._GSource*, i32 (i8*)*, i8*)*, void (%struct._GSource*)*, i32 (i8*)*, void ()* }
%struct._GMainContext = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !56, globals: !153)
!1 = !DIFile(filename: "libSlashProc_la-net.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!2 = !{!3, !10, !15, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 297, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/glib-2.0/glib/gregex.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!38 = !DIEnumerator(name: "G_REGEX_CASELESS", value: 1)
!39 = !DIEnumerator(name: "G_REGEX_MULTILINE", value: 2)
!40 = !DIEnumerator(name: "G_REGEX_DOTALL", value: 4)
!41 = !DIEnumerator(name: "G_REGEX_EXTENDED", value: 8)
!42 = !DIEnumerator(name: "G_REGEX_ANCHORED", value: 16)
!43 = !DIEnumerator(name: "G_REGEX_DOLLAR_ENDONLY", value: 32)
!44 = !DIEnumerator(name: "G_REGEX_UNGREEDY", value: 512)
!45 = !DIEnumerator(name: "G_REGEX_RAW", value: 2048)
!46 = !DIEnumerator(name: "G_REGEX_NO_AUTO_CAPTURE", value: 4096)
!47 = !DIEnumerator(name: "G_REGEX_OPTIMIZE", value: 8192)
!48 = !DIEnumerator(name: "G_REGEX_FIRSTLINE", value: 262144)
!49 = !DIEnumerator(name: "G_REGEX_DUPNAMES", value: 524288)
!50 = !DIEnumerator(name: "G_REGEX_NEWLINE_CR", value: 1048576)
!51 = !DIEnumerator(name: "G_REGEX_NEWLINE_LF", value: 2097152)
!52 = !DIEnumerator(name: "G_REGEX_NEWLINE_CRLF", value: 3145728)
!53 = !DIEnumerator(name: "G_REGEX_NEWLINE_ANYCRLF", value: 5242880)
!54 = !DIEnumerator(name: "G_REGEX_BSR_ANYCRLF", value: 8388608)
!55 = !DIEnumerator(name: "G_REGEX_JAVASCRIPT_COMPAT", value: 33554432)
!56 = !{!57, !58, !62, !99, !74, !119, !152}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint64", file: !60, line: 52, baseType: !61)
!60 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!61 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtentry", file: !64, line: 31, size: 960, align: 64, elements: !65)
!64 = !DIFile(filename: "/usr/include/net/route.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!65 = !{!66, !67, !80, !81, !82, !83, !85, !86, !88, !89, !93, !94, !96, !97, !98}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "rt_pad1", scope: !63, file: !64, line: 33, baseType: !61, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "rt_dst", scope: !63, file: !64, line: 34, baseType: !68, size: 128, align: 16, offset: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !69, line: 153, size: 128, align: 16, elements: !70)
!69 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!70 = !{!71, !75}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !68, file: !69, line: 155, baseType: !72, size: 16, align: 16)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !73, line: 28, baseType: !74)
!73 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!74 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !68, file: !69, line: 156, baseType: !76, size: 112, align: 8, offset: 16)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 112, align: 8, elements: !78)
!77 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!78 = !{!79}
!79 = !DISubrange(count: 14)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "rt_gateway", scope: !63, file: !64, line: 35, baseType: !68, size: 128, align: 16, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "rt_genmask", scope: !63, file: !64, line: 36, baseType: !68, size: 128, align: 16, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "rt_flags", scope: !63, file: !64, line: 37, baseType: !74, size: 16, align: 16, offset: 448)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "rt_pad2", scope: !63, file: !64, line: 38, baseType: !84, size: 16, align: 16, offset: 464)
!84 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "rt_pad3", scope: !63, file: !64, line: 39, baseType: !61, size: 64, align: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tos", scope: !63, file: !64, line: 40, baseType: !87, size: 8, align: 8, offset: 576)
!87 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "rt_class", scope: !63, file: !64, line: 41, baseType: !87, size: 8, align: 8, offset: 584)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "rt_pad4", scope: !63, file: !64, line: 43, baseType: !90, size: 48, align: 16, offset: 592)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 48, align: 16, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 3)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "rt_metric", scope: !63, file: !64, line: 47, baseType: !84, size: 16, align: 16, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "rt_dev", scope: !63, file: !64, line: 48, baseType: !95, size: 64, align: 64, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mtu", scope: !63, file: !64, line: 49, baseType: !61, size: 64, align: 64, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "rt_window", scope: !63, file: !64, line: 50, baseType: !61, size: 64, align: 64, offset: 832)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "rt_irtt", scope: !63, file: !64, line: 51, baseType: !74, size: 16, align: 16, offset: 896)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !101, line: 239, size: 128, align: 32, elements: !102)
!101 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!102 = !{!103, !104, !108, !115}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !100, file: !101, line: 241, baseType: !72, size: 16, align: 16)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !100, file: !101, line: 242, baseType: !105, size: 16, align: 16, offset: 16)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !101, line: 119, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !107, line: 49, baseType: !74)
!107 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!108 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !100, file: !101, line: 243, baseType: !109, size: 32, align: 32, offset: 32)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !101, line: 31, size: 32, align: 32, elements: !110)
!110 = !{!111}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !109, file: !101, line: 33, baseType: !112, size: 32, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !101, line: 30, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !107, line: 51, baseType: !114)
!114 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !100, file: !101, line: 246, baseType: !116, size: 64, align: 8, offset: 64)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 64, align: 8, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 8)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_rtmsg", file: !64, line: 57, size: 640, align: 64, elements: !121)
!121 = !{!122, !139, !140, !141, !144, !146, !147, !148, !149, !150}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_dst", scope: !120, file: !64, line: 59, baseType: !123, size: 128, align: 32)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !101, line: 211, size: 128, align: 32, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !123, file: !101, line: 220, baseType: !126, size: 128, align: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !123, file: !101, line: 213, size: 128, align: 32, elements: !127)
!127 = !{!128, !133, !135}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !126, file: !101, line: 215, baseType: !129, size: 128, align: 8)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 128, align: 8, elements: !131)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !107, line: 48, baseType: !87)
!131 = !{!132}
!132 = !DISubrange(count: 16)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !126, file: !101, line: 217, baseType: !134, size: 128, align: 16)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 128, align: 16, elements: !117)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !126, file: !101, line: 218, baseType: !136, size: 128, align: 32)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 128, align: 32, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 4)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_src", scope: !120, file: !64, line: 60, baseType: !123, size: 128, align: 32, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_gateway", scope: !120, file: !64, line: 61, baseType: !123, size: 128, align: 32, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_type", scope: !120, file: !64, line: 62, baseType: !142, size: 32, align: 32, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !143, line: 202, baseType: !114)
!143 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!144 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_dst_len", scope: !120, file: !64, line: 63, baseType: !145, size: 16, align: 16, offset: 416)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int16_t", file: !143, line: 201, baseType: !74)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_src_len", scope: !120, file: !64, line: 64, baseType: !145, size: 16, align: 16, offset: 432)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_metric", scope: !120, file: !64, line: 65, baseType: !142, size: 32, align: 32, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_info", scope: !120, file: !64, line: 66, baseType: !61, size: 64, align: 64, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_flags", scope: !120, file: !64, line: 67, baseType: !142, size: 32, align: 32, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_ifindex", scope: !120, file: !64, line: 68, baseType: !151, size: 32, align: 32, offset: 608)
!151 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !143, line: 152, baseType: !114)
!153 = !{!154, !167, !168, !170, !185, !186, !190, !193, !194, !195}
!154 = distinct !DIGlobalVariable(name: "myKeyRegex", scope: !155, file: !156, line: 227, type: !164, isLocal: true, isDefinition: true, variable: %struct._GRegex** @SlashProcNet_GetSnmp.myKeyRegex)
!155 = distinct !DISubprogram(name: "SlashProcNet_GetSnmp", scope: !156, file: !156, line: 216, type: !157, isLocal: false, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !163)
!156 = !DIFile(filename: "net.c", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!157 = !DISubroutineType(types: !158)
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !161, line: 37, baseType: !162)
!161 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !161, line: 37, flags: DIFlagFwdDecl)
!163 = !{}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "GRegex", file: !36, line: 414, baseType: !166)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GRegex", file: !36, line: 414, flags: DIFlagFwdDecl)
!167 = distinct !DIGlobalVariable(name: "myValRegex", scope: !155, file: !156, line: 228, type: !164, isLocal: true, isDefinition: true, variable: %struct._GRegex** @SlashProcNet_GetSnmp.myValRegex)
!168 = distinct !DIGlobalVariable(name: "myRegex", scope: !169, file: !156, line: 416, type: !164, isLocal: true, isDefinition: true, variable: %struct._GRegex** @SlashProcNet_GetSnmp6.myRegex)
!169 = distinct !DISubprogram(name: "SlashProcNet_GetSnmp6", scope: !156, file: !156, line: 407, type: !157, isLocal: false, isDefinition: true, scopeLine: 408, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !163)
!170 = distinct !DIGlobalVariable(name: "myFieldsRE", scope: !171, file: !156, line: 538, type: !164, isLocal: true, isDefinition: true, variable: %struct._GRegex** @SlashProcNet_GetRoute.myFieldsRE)
!171 = distinct !DISubprogram(name: "SlashProcNet_GetRoute", scope: !156, file: !156, line: 528, type: !172, isLocal: false, isDefinition: true, scopeLine: 530, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !163)
!172 = !DISubroutineType(types: !173)
!173 = !{!174, !114, !74}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPtrArray", file: !176, line: 39, baseType: !177)
!176 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GPtrArray", file: !176, line: 53, size: 128, align: 64, elements: !178)
!178 = !{!179, !183}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !177, file: !176, line: 55, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !182, line: 77, baseType: !57)
!182 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!183 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !177, file: !176, line: 56, baseType: !184, size: 32, align: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !182, line: 55, baseType: !114)
!185 = distinct !DIGlobalVariable(name: "myValuesRE", scope: !171, file: !156, line: 539, type: !164, isLocal: true, isDefinition: true, variable: %struct._GRegex** @SlashProcNet_GetRoute.myValuesRE)
!186 = distinct !DIGlobalVariable(name: "myValuesRE", scope: !187, file: !156, line: 746, type: !164, isLocal: true, isDefinition: true, variable: %struct._GRegex** @SlashProcNet_GetRoute6.myValuesRE)
!187 = distinct !DISubprogram(name: "SlashProcNet_GetRoute6", scope: !156, file: !156, line: 735, type: !188, isLocal: false, isDefinition: true, scopeLine: 737, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !163)
!188 = !DISubroutineType(types: !189)
!189 = !{!174, !114, !114}
!190 = distinct !DIGlobalVariable(name: "pathToNetSnmp", scope: !0, file: !156, line: 73, type: !191, isLocal: true, isDefinition: true, variable: i8** @pathToNetSnmp)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!193 = distinct !DIGlobalVariable(name: "pathToNetSnmp6", scope: !0, file: !156, line: 79, type: !191, isLocal: true, isDefinition: true, variable: i8** @pathToNetSnmp6)
!194 = distinct !DIGlobalVariable(name: "pathToNetRoute", scope: !0, file: !156, line: 85, type: !191, isLocal: true, isDefinition: true, variable: i8** @pathToNetRoute)
!195 = distinct !DIGlobalVariable(name: "pathToNetRoute6", scope: !0, file: !156, line: 91, type: !191, isLocal: true, isDefinition: true, variable: i8** @pathToNetRoute6)
!196 = !{i32 2, !"Dwarf Version", i32 4}
!197 = !{i32 2, !"Debug Info Version", i32 3}
!198 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!199 = !DILocalVariable(name: "myHashTable", scope: !155, file: !156, line: 218, type: !159)
!200 = !DIExpression()
!201 = !DILocation(line: 218, column: 16, scope: !155)
!202 = !DILocalVariable(name: "myChannel", scope: !155, file: !156, line: 219, type: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !206)
!206 = !{!207, !209, !347, !348, !353, !354, !355, !356, !357, !366, !367, !368, !372, !373, !374, !375, !376, !377, !378, !379}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !205, file: !4, line: 100, baseType: !208, size: 32, align: 32)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !182, line: 49, baseType: !151)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !205, file: !4, line: 101, baseType: !210, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !213)
!213 = !{!214, !235, !241, !248, !252, !334, !338, !343}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !212, file: !4, line: 133, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !203, !219, !221, !222, !223}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !182, line: 46, baseType: !77)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !60, line: 66, baseType: !61)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !226, line: 42, baseType: !227)
!226 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !226, line: 44, size: 128, align: 64, elements: !228)
!228 = !{!229, !233, !234}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !227, file: !226, line: 46, baseType: !230, size: 32, align: 32)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !231, line: 36, baseType: !232)
!231 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !60, line: 45, baseType: !114)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !227, file: !226, line: 47, baseType: !208, size: 32, align: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !227, file: !226, line: 48, baseType: !219, size: 64, align: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !212, file: !4, line: 138, baseType: !236, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!218, !203, !239, !221, !222, !223}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !212, file: !4, line: 143, baseType: !242, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!218, !203, !245, !247, !223}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !60, line: 51, baseType: !246)
!246 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !212, file: !4, line: 147, baseType: !249, size: 64, align: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!218, !203, !223}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !212, file: !4, line: 149, baseType: !253, size: 64, align: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!256, !203, !333}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !259)
!259 = !{!260, !261, !281, !310, !311, !315, !316, !317, !318, !326, !327, !328, !329}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !258, file: !16, line: 174, baseType: !181, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !258, file: !16, line: 175, baseType: !262, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !265)
!265 = !{!266, !270, !271}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !264, file: !16, line: 198, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !181}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !264, file: !16, line: 199, baseType: !267, size: 64, align: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !264, file: !16, line: 200, baseType: !272, size: 64, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !181, !256, !275, !180}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!280, !181}
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !182, line: 50, baseType: !208)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !258, file: !16, line: 177, baseType: !282, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !286)
!286 = !{!287, !292, !296, !300, !304, !305}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !285, file: !16, line: 216, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!280, !256, !291}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !285, file: !16, line: 218, baseType: !293, size: 64, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!280, !256}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !285, file: !16, line: 219, baseType: !297, size: 64, align: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!280, !256, !276, !181}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !285, file: !16, line: 222, baseType: !301, size: 64, align: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !256}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !285, file: !16, line: 226, baseType: !276, size: 64, align: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !285, file: !16, line: 227, baseType: !306, size: 64, align: 64, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{null}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !258, file: !16, line: 178, baseType: !184, size: 32, align: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !258, file: !16, line: 180, baseType: !312, size: 64, align: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !314)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !258, file: !16, line: 182, baseType: !208, size: 32, align: 32, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !258, file: !16, line: 183, baseType: !184, size: 32, align: 32, offset: 352)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !258, file: !16, line: 184, baseType: !184, size: 32, align: 32, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !258, file: !16, line: 186, baseType: !319, size: 64, align: 64, offset: 448)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !321, line: 37, baseType: !322)
!321 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !321, line: 39, size: 128, align: 64, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !322, file: !321, line: 41, baseType: !181, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !322, file: !321, line: 42, baseType: !319, size: 64, align: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !258, file: !16, line: 188, baseType: !256, size: 64, align: 64, offset: 512)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !258, file: !16, line: 189, baseType: !256, size: 64, align: 64, offset: 576)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !258, file: !16, line: 191, baseType: !95, size: 64, align: 64, offset: 640)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !258, file: !16, line: 193, baseType: !330, size: 64, align: 64, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !332)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !212, file: !4, line: 151, baseType: !335, size: 64, align: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !203}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !212, file: !4, line: 152, baseType: !339, size: 64, align: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!218, !203, !342, !223}
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !212, file: !4, line: 155, baseType: !344, size: 64, align: 64, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!342, !203}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !205, file: !4, line: 103, baseType: !219, size: 64, align: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !205, file: !4, line: 104, baseType: !349, size: 64, align: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !350, line: 77, baseType: !351)
!350 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !350, line: 77, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !205, file: !4, line: 105, baseType: !349, size: 64, align: 64, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !205, file: !4, line: 106, baseType: !219, size: 64, align: 64, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !205, file: !4, line: 107, baseType: !184, size: 32, align: 32, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !205, file: !4, line: 109, baseType: !221, size: 64, align: 64, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !205, file: !4, line: 110, baseType: !358, size: 64, align: 64, offset: 512)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !360, line: 39, baseType: !361)
!360 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !360, line: 41, size: 192, align: 64, elements: !362)
!362 = !{!363, !364, !365}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !361, file: !360, line: 43, baseType: !219, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !361, file: !360, line: 44, baseType: !221, size: 64, align: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !361, file: !360, line: 45, baseType: !221, size: 64, align: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !205, file: !4, line: 111, baseType: !358, size: 64, align: 64, offset: 576)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !205, file: !4, line: 112, baseType: !358, size: 64, align: 64, offset: 640)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !205, file: !4, line: 113, baseType: !369, size: 48, align: 8, offset: 704)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 48, align: 8, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 6)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !205, file: !4, line: 117, baseType: !184, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !205, file: !4, line: 118, baseType: !184, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !205, file: !4, line: 119, baseType: !184, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !205, file: !4, line: 120, baseType: !184, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !205, file: !4, line: 121, baseType: !184, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !205, file: !4, line: 122, baseType: !184, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !205, file: !4, line: 124, baseType: !181, size: 64, align: 64, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !205, file: !4, line: 125, baseType: !181, size: 64, align: 64, offset: 832)
!380 = !DILocation(line: 219, column: 16, scope: !155)
!381 = !DILocalVariable(name: "keyIoStatus", scope: !155, file: !156, line: 220, type: !218)
!382 = !DILocation(line: 220, column: 14, scope: !155)
!383 = !DILocalVariable(name: "valIoStatus", scope: !155, file: !156, line: 221, type: !218)
!384 = !DILocation(line: 221, column: 14, scope: !155)
!385 = !DILocalVariable(name: "myKeyLine", scope: !155, file: !156, line: 222, type: !219)
!386 = !DILocation(line: 222, column: 11, scope: !155)
!387 = !DILocalVariable(name: "myValLine", scope: !155, file: !156, line: 223, type: !219)
!388 = !DILocation(line: 223, column: 11, scope: !155)
!389 = !DILocalVariable(name: "parseError", scope: !155, file: !156, line: 224, type: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !391, line: 230, baseType: !77)
!391 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line879")
!392 = !DILocation(line: 224, column: 9, scope: !155)
!393 = !DILocalVariable(name: "fd", scope: !155, file: !156, line: 225, type: !151)
!394 = !DILocation(line: 225, column: 8, scope: !155)
!395 = !DILocation(line: 230, column: 8, scope: !396)
!396 = distinct !DILexicalBlock(scope: !155, file: !156, line: 230, column: 8)
!397 = !DILocation(line: 230, column: 19, scope: !396)
!398 = !DILocation(line: 230, column: 8, scope: !155)
!399 = !DILocation(line: 231, column: 20, scope: !400)
!400 = distinct !DILexicalBlock(scope: !396, file: !156, line: 230, column: 27)
!401 = !DILocation(line: 231, column: 18, scope: !400)
!402 = !DILocation(line: 233, column: 20, scope: !400)
!403 = !DILocation(line: 233, column: 18, scope: !400)
!404 = !DILocation(line: 237, column: 4, scope: !400)
!405 = !DILocation(line: 239, column: 19, scope: !406)
!406 = distinct !DILexicalBlock(scope: !155, file: !156, line: 239, column: 8)
!407 = !DILocation(line: 239, column: 14, scope: !406)
!408 = !DILocation(line: 239, column: 12, scope: !406)
!409 = !DILocation(line: 239, column: 46, scope: !406)
!410 = !DILocation(line: 239, column: 8, scope: !155)
!411 = !DILocation(line: 240, column: 7, scope: !412)
!412 = distinct !DILexicalBlock(scope: !406, file: !156, line: 239, column: 53)
!413 = !DILocation(line: 243, column: 38, scope: !155)
!414 = !DILocation(line: 243, column: 16, scope: !155)
!415 = !DILocation(line: 243, column: 14, scope: !155)
!416 = !DILocation(line: 245, column: 18, scope: !155)
!417 = !DILocation(line: 245, column: 16, scope: !155)
!418 = !DILocation(line: 256, column: 4, scope: !155)
!419 = !DILocation(line: 256, column: 49, scope: !420)
!420 = !DILexicalBlockFile(scope: !155, file: !156, discriminator: 1)
!421 = !DILocation(line: 256, column: 26, scope: !420)
!422 = !DILocation(line: 256, column: 24, scope: !420)
!423 = !DILocation(line: 257, column: 55, scope: !155)
!424 = !DILocation(line: 257, column: 77, scope: !155)
!425 = !DILocation(line: 258, column: 49, scope: !155)
!426 = !DILocation(line: 258, column: 26, scope: !155)
!427 = !DILocation(line: 258, column: 24, scope: !155)
!428 = !DILocation(line: 259, column: 55, scope: !155)
!429 = !DILocation(line: 256, column: 4, scope: !430)
!430 = !DILexicalBlockFile(scope: !155, file: !156, discriminator: 2)
!431 = !DILocalVariable(name: "keyMatchInfo", scope: !432, file: !156, line: 261, type: !433)
!432 = distinct !DILexicalBlock(scope: !155, file: !156, line: 259, column: 78)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMatchInfo", file: !36, line: 423, baseType: !435)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMatchInfo", file: !36, line: 423, flags: DIFlagFwdDecl)
!436 = !DILocation(line: 261, column: 19, scope: !432)
