; ModuleID = './backdoorGcc64.o.i'
source_filename = "./backdoorGcc64.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%union.Backdoor_proto = type { %struct.anon }
%struct.anon = type { %union.anon, i64, %union.anon.2, %union.anon.5, %union.anon.8, %union.anon.11 }
%union.anon = type { i64 }
%union.anon.2 = type { i64 }
%union.anon.5 = type { i64 }
%union.anon.8 = type { i64 }
%union.anon.11 = type { i64 }
%union.Backdoor_proto_hb = type { %struct.anon.33 }
%struct.anon.33 = type { %union.anon.34, %union.anon.37, i64, %union.anon.40, i64, i64, %union.anon.43 }
%union.anon.34 = type { i64 }
%union.anon.37 = type { i64 }
%union.anon.40 = type { i64 }
%union.anon.43 = type { i64 }

; Function Attrs: nounwind uwtable
define void @Backdoor_InOut(%union.Backdoor_proto*) #0 !dbg !6 {
  %2 = alloca %union.Backdoor_proto*, align 8
  %3 = alloca i64, align 8
  store %union.Backdoor_proto* %0, %union.Backdoor_proto** %2, align 8
  call void @llvm.dbg.declare(metadata %union.Backdoor_proto** %2, metadata !200, metadata !201), !dbg !202
  call void @llvm.dbg.declare(metadata i64* %3, metadata !203, metadata !201), !dbg !204
  %4 = load %union.Backdoor_proto*, %union.Backdoor_proto** %2, align 8, !dbg !205

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "backdoorGcc64.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line39")
!2 = !{}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!6 = distinct !DISubprogram(name: "Backdoor_InOut", scope: !7, file: !7, line: 74, type: !8, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!7 = !DIFile(filename: "backdoorGcc64.c", directory: "/home/lichi/Desktop/open-vm-tools/line39")
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Backdoor_proto", file: !12, line: 102, baseType: !13)
!12 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/backdoor_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line39")
!13 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !12, line: 85, size: 384, align: 64, elements: !14)
!14 = !{!15, !107}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !13, file: !12, line: 93, baseType: !16, size: 384, align: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !13, file: !12, line: 86, size: 384, align: 64, elements: !17)
!17 = !{!18, !44, !47, !62, !77, !92}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !16, file: !12, line: 87, baseType: !19, size: 64, align: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !16, file: !12, line: 87, size: 64, align: 64, elements: !20)
!20 = !{!21, !31, !35, !40}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !19, file: !12, line: 87, baseType: !22, size: 32, align: 16)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !19, file: !12, line: 87, size: 32, align: 16, elements: !23)
!23 = !{!24, !30}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !22, file: !12, line: 87, baseType: !25, size: 16, align: 16)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !26, line: 175, baseType: !27)
!26 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line39")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !28, line: 49, baseType: !29)
!28 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line39")
!29 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !22, file: !12, line: 87, baseType: !25, size: 16, align: 16, offset: 16)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !19, file: !12, line: 87, baseType: !32, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !26, line: 173, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !28, line: 51, baseType: !34)
!34 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !19, file: !12, line: 87, baseType: !36, size: 64, align: 32)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !19, file: !12, line: 87, size: 64, align: 32, elements: !37)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !36, file: !12, line: 87, baseType: !32, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !36, file: !12, line: 87, baseType: !32, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !19, file: !12, line: 87, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !26, line: 171, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !28, line: 55, baseType: !43)
!43 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !16, file: !12, line: 88, baseType: !45, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !46, line: 216, baseType: !43)
!46 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line39")
!47 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !16, file: !12, line: 89, baseType: !48, size: 64, align: 64, offset: 128)
!48 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !16, file: !12, line: 89, size: 64, align: 64, elements: !49)
!49 = !{!50, !55, !56, !61}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !48, file: !12, line: 89, baseType: !51, size: 32, align: 16)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !48, file: !12, line: 89, size: 32, align: 16, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !51, file: !12, line: 89, baseType: !25, size: 16, align: 16)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !51, file: !12, line: 89, baseType: !25, size: 16, align: 16, offset: 16)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !48, file: !12, line: 89, baseType: !32, size: 32, align: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !48, file: !12, line: 89, baseType: !57, size: 64, align: 32)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !48, file: !12, line: 89, size: 64, align: 32, elements: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !57, file: !12, line: 89, baseType: !32, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !57, file: !12, line: 89, baseType: !32, size: 32, align: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !48, file: !12, line: 89, baseType: !41, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !16, file: !12, line: 90, baseType: !63, size: 64, align: 64, offset: 192)
!63 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !16, file: !12, line: 90, size: 64, align: 64, elements: !64)
!64 = !{!65, !70, !71, !76}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !63, file: !12, line: 90, baseType: !66, size: 32, align: 16)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !63, file: !12, line: 90, size: 32, align: 16, elements: !67)
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !66, file: !12, line: 90, baseType: !25, size: 16, align: 16)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !66, file: !12, line: 90, baseType: !25, size: 16, align: 16, offset: 16)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !63, file: !12, line: 90, baseType: !32, size: 32, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !63, file: !12, line: 90, baseType: !72, size: 64, align: 32)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !63, file: !12, line: 90, size: 64, align: 32, elements: !73)
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !72, file: !12, line: 90, baseType: !32, size: 32, align: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !72, file: !12, line: 90, baseType: !32, size: 32, align: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !63, file: !12, line: 90, baseType: !41, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "si", scope: !16, file: !12, line: 91, baseType: !78, size: 64, align: 64, offset: 256)
!78 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !16, file: !12, line: 91, size: 64, align: 64, elements: !79)
!79 = !{!80, !85, !86, !91}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !78, file: !12, line: 91, baseType: !81, size: 32, align: 16)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !12, line: 91, size: 32, align: 16, elements: !82)
!82 = !{!83, !84}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !81, file: !12, line: 91, baseType: !25, size: 16, align: 16)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !81, file: !12, line: 91, baseType: !25, size: 16, align: 16, offset: 16)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !78, file: !12, line: 91, baseType: !32, size: 32, align: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !78, file: !12, line: 91, baseType: !87, size: 64, align: 32)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !12, line: 91, size: 64, align: 32, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !87, file: !12, line: 91, baseType: !32, size: 32, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !87, file: !12, line: 91, baseType: !32, size: 32, align: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !78, file: !12, line: 91, baseType: !41, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !16, file: !12, line: 92, baseType: !93, size: 64, align: 64, offset: 320)
!93 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !16, file: !12, line: 92, size: 64, align: 64, elements: !94)
!94 = !{!95, !100, !101, !106}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !93, file: !12, line: 92, baseType: !96, size: 32, align: 16)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !93, file: !12, line: 92, size: 32, align: 16, elements: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !96, file: !12, line: 92, baseType: !25, size: 16, align: 16)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !96, file: !12, line: 92, baseType: !25, size: 16, align: 16, offset: 16)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !93, file: !12, line: 92, baseType: !32, size: 32, align: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !93, file: !12, line: 92, baseType: !102, size: 64, align: 32)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !93, file: !12, line: 92, size: 64, align: 32, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !102, file: !12, line: 92, baseType: !32, size: 32, align: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !102, file: !12, line: 92, baseType: !32, size: 32, align: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !93, file: !12, line: 92, baseType: !41, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !13, file: !12, line: 101, baseType: !108, size: 384, align: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !13, file: !12, line: 94, size: 384, align: 64, elements: !109)
!109 = !{!110, !125, !140, !155, !170, !185}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !108, file: !12, line: 95, baseType: !111, size: 64, align: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !108, file: !12, line: 95, size: 64, align: 64, elements: !112)
!112 = !{!113, !118, !119, !124}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !111, file: !12, line: 95, baseType: !114, size: 32, align: 16)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !111, file: !12, line: 95, size: 32, align: 16, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !114, file: !12, line: 95, baseType: !25, size: 16, align: 16)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !114, file: !12, line: 95, baseType: !25, size: 16, align: 16, offset: 16)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !111, file: !12, line: 95, baseType: !32, size: 32, align: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !111, file: !12, line: 95, baseType: !120, size: 64, align: 32)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !111, file: !12, line: 95, size: 64, align: 32, elements: !121)
!121 = !{!122, !123}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !120, file: !12, line: 95, baseType: !32, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !120, file: !12, line: 95, baseType: !32, size: 32, align: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !111, file: !12, line: 95, baseType: !41, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "bx", scope: !108, file: !12, line: 96, baseType: !126, size: 64, align: 64, offset: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !108, file: !12, line: 96, size: 64, align: 64, elements: !127)
!127 = !{!128, !133, !134, !139}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !126, file: !12, line: 96, baseType: !129, size: 32, align: 16)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !126, file: !12, line: 96, size: 32, align: 16, elements: !130)
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !129, file: !12, line: 96, baseType: !25, size: 16, align: 16)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !129, file: !12, line: 96, baseType: !25, size: 16, align: 16, offset: 16)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !126, file: !12, line: 96, baseType: !32, size: 32, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !126, file: !12, line: 96, baseType: !135, size: 64, align: 32)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !126, file: !12, line: 96, size: 64, align: 32, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !135, file: !12, line: 96, baseType: !32, size: 32, align: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !135, file: !12, line: 96, baseType: !32, size: 32, align: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !126, file: !12, line: 96, baseType: !41, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !108, file: !12, line: 97, baseType: !141, size: 64, align: 64, offset: 128)
!141 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !108, file: !12, line: 97, size: 64, align: 64, elements: !142)
!142 = !{!143, !148, !149, !154}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !141, file: !12, line: 97, baseType: !144, size: 32, align: 16)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !12, line: 97, size: 32, align: 16, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !144, file: !12, line: 97, baseType: !25, size: 16, align: 16)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !144, file: !12, line: 97, baseType: !25, size: 16, align: 16, offset: 16)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !141, file: !12, line: 97, baseType: !32, size: 32, align: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !141, file: !12, line: 97, baseType: !150, size: 64, align: 32)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !141, file: !12, line: 97, size: 64, align: 32, elements: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !150, file: !12, line: 97, baseType: !32, size: 32, align: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !150, file: !12, line: 97, baseType: !32, size: 32, align: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !141, file: !12, line: 97, baseType: !41, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !108, file: !12, line: 98, baseType: !156, size: 64, align: 64, offset: 192)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !108, file: !12, line: 98, size: 64, align: 64, elements: !157)
!157 = !{!158, !163, !164, !169}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !156, file: !12, line: 98, baseType: !159, size: 32, align: 16)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !156, file: !12, line: 98, size: 32, align: 16, elements: !160)
!160 = !{!161, !162}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !159, file: !12, line: 98, baseType: !25, size: 16, align: 16)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !159, file: !12, line: 98, baseType: !25, size: 16, align: 16, offset: 16)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !156, file: !12, line: 98, baseType: !32, size: 32, align: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !156, file: !12, line: 98, baseType: !165, size: 64, align: 32)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !156, file: !12, line: 98, size: 64, align: 32, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !165, file: !12, line: 98, baseType: !32, size: 32, align: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !165, file: !12, line: 98, baseType: !32, size: 32, align: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !156, file: !12, line: 98, baseType: !41, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "si", scope: !108, file: !12, line: 99, baseType: !171, size: 64, align: 64, offset: 256)
!171 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !108, file: !12, line: 99, size: 64, align: 64, elements: !172)
!172 = !{!173, !178, !179, !184}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !171, file: !12, line: 99, baseType: !174, size: 32, align: 16)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !171, file: !12, line: 99, size: 32, align: 16, elements: !175)
!175 = !{!176, !177}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !174, file: !12, line: 99, baseType: !25, size: 16, align: 16)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !174, file: !12, line: 99, baseType: !25, size: 16, align: 16, offset: 16)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !171, file: !12, line: 99, baseType: !32, size: 32, align: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !171, file: !12, line: 99, baseType: !180, size: 64, align: 32)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !171, file: !12, line: 99, size: 64, align: 32, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !180, file: !12, line: 99, baseType: !32, size: 32, align: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !180, file: !12, line: 99, baseType: !32, size: 32, align: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !171, file: !12, line: 99, baseType: !41, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !108, file: !12, line: 100, baseType: !186, size: 64, align: 64, offset: 320)
!186 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !108, file: !12, line: 100, size: 64, align: 64, elements: !187)
!187 = !{!188, !193, !194, !199}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !186, file: !12, line: 100, baseType: !189, size: 32, align: 16)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !12, line: 100, size: 32, align: 16, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !189, file: !12, line: 100, baseType: !25, size: 16, align: 16)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !189, file: !12, line: 100, baseType: !25, size: 16, align: 16, offset: 16)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !186, file: !12, line: 100, baseType: !32, size: 32, align: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !186, file: !12, line: 100, baseType: !195, size: 64, align: 32)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !12, line: 100, size: 64, align: 32, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !195, file: !12, line: 100, baseType: !32, size: 32, align: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !195, file: !12, line: 100, baseType: !32, size: 32, align: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !186, file: !12, line: 100, baseType: !41, size: 64, align: 64)
!200 = !DILocalVariable(name: "myBp", arg: 1, scope: !6, file: !7, line: 74, type: !10)
!201 = !DIExpression()
!202 = !DILocation(line: 74, column: 32, scope: !6)
!203 = !DILocalVariable(name: "dummy", scope: !6, file: !7, line: 76, type: !41)
!204 = !DILocation(line: 76, column: 11, scope: !6)
!205 = !DILocation(line: 106, column: 14, scope: !6)
!206 = !DILocation(line: 78, column: 4, scope: !6)
!207 = !{i32 42437, i32 42454, i32 42493, i32 42532, i32 42571, i32 42610, i32 42649, i32 42688, i32 42721, i32 42759, i32 42798, i32 42837, i32 42876, i32 42915, i32 42954, i32 42993}
!208 = !DILocation(line: 118, column: 1, scope: !6)
!209 = distinct !DISubprogram(name: "BackdoorHbIn", scope: !7, file: !7, line: 140, type: !210, isLocal: false, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "Backdoor_proto_hb", file: !12, line: 123, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !12, line: 104, size: 448, align: 64, elements: !215)
!215 = !{!216, !283}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !214, file: !12, line: 113, baseType: !217, size: 448, align: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !214, file: !12, line: 105, size: 448, align: 64, elements: !218)
!218 = !{!219, !234, !249, !250, !265, !267, !268}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !217, file: !12, line: 106, baseType: !220, size: 64, align: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !217, file: !12, line: 106, size: 64, align: 64, elements: !221)
!221 = !{!222, !227, !228, !233}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !220, file: !12, line: 106, baseType: !223, size: 32, align: 16)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !220, file: !12, line: 106, size: 32, align: 16, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !223, file: !12, line: 106, baseType: !25, size: 16, align: 16)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !223, file: !12, line: 106, baseType: !25, size: 16, align: 16, offset: 16)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !220, file: !12, line: 106, baseType: !32, size: 32, align: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !220, file: !12, line: 106, baseType: !229, size: 64, align: 32)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !220, file: !12, line: 106, size: 64, align: 32, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !229, file: !12, line: 106, baseType: !32, size: 32, align: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !229, file: !12, line: 106, baseType: !32, size: 32, align: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !220, file: !12, line: 106, baseType: !41, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "bx", scope: !217, file: !12, line: 107, baseType: !235, size: 64, align: 64, offset: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !217, file: !12, line: 107, size: 64, align: 64, elements: !236)
!236 = !{!237, !242, !243, !248}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !235, file: !12, line: 107, baseType: !238, size: 32, align: 16)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !235, file: !12, line: 107, size: 32, align: 16, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !238, file: !12, line: 107, baseType: !25, size: 16, align: 16)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !238, file: !12, line: 107, baseType: !25, size: 16, align: 16, offset: 16)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !235, file: !12, line: 107, baseType: !32, size: 32, align: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !235, file: !12, line: 107, baseType: !244, size: 64, align: 32)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !235, file: !12, line: 107, size: 64, align: 32, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !244, file: !12, line: 107, baseType: !32, size: 32, align: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !244, file: !12, line: 107, baseType: !32, size: 32, align: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !235, file: !12, line: 107, baseType: !41, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !217, file: !12, line: 108, baseType: !45, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !217, file: !12, line: 109, baseType: !251, size: 64, align: 64, offset: 192)
!251 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !217, file: !12, line: 109, size: 64, align: 64, elements: !252)
!252 = !{!253, !258, !259, !264}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !251, file: !12, line: 109, baseType: !254, size: 32, align: 16)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !251, file: !12, line: 109, size: 32, align: 16, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !254, file: !12, line: 109, baseType: !25, size: 16, align: 16)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !254, file: !12, line: 109, baseType: !25, size: 16, align: 16, offset: 16)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !251, file: !12, line: 109, baseType: !32, size: 32, align: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !251, file: !12, line: 109, baseType: !260, size: 64, align: 32)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !251, file: !12, line: 109, size: 64, align: 32, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !260, file: !12, line: 109, baseType: !32, size: 32, align: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !260, file: !12, line: 109, baseType: !32, size: 32, align: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !251, file: !12, line: 109, baseType: !41, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "srcAddr", scope: !217, file: !12, line: 110, baseType: !266, size: 64, align: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !28, line: 122, baseType: !43)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "dstAddr", scope: !217, file: !12, line: 111, baseType: !266, size: 64, align: 64, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "bp", scope: !217, file: !12, line: 112, baseType: !269, size: 64, align: 64, offset: 384)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !217, file: !12, line: 112, size: 64, align: 64, elements: !270)
!270 = !{!271, !276, !277, !282}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !269, file: !12, line: 112, baseType: !272, size: 32, align: 16)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !12, line: 112, size: 32, align: 16, elements: !273)
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !272, file: !12, line: 112, baseType: !25, size: 16, align: 16)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !272, file: !12, line: 112, baseType: !25, size: 16, align: 16, offset: 16)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !269, file: !12, line: 112, baseType: !32, size: 32, align: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !269, file: !12, line: 112, baseType: !278, size: 64, align: 32)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !12, line: 112, size: 64, align: 32, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !278, file: !12, line: 112, baseType: !32, size: 32, align: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !278, file: !12, line: 112, baseType: !32, size: 32, align: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !269, file: !12, line: 112, baseType: !41, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !214, file: !12, line: 122, baseType: !284, size: 448, align: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !214, file: !12, line: 114, size: 448, align: 64, elements: !285)
!285 = !{!286, !301, !316, !331, !346, !361, !376}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !284, file: !12, line: 115, baseType: !287, size: 64, align: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !284, file: !12, line: 115, size: 64, align: 64, elements: !288)
!288 = !{!289, !294, !295, !300}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !287, file: !12, line: 115, baseType: !290, size: 32, align: 16)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !287, file: !12, line: 115, size: 32, align: 16, elements: !291)
!291 = !{!292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !290, file: !12, line: 115, baseType: !25, size: 16, align: 16)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !290, file: !12, line: 115, baseType: !25, size: 16, align: 16, offset: 16)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !287, file: !12, line: 115, baseType: !32, size: 32, align: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !287, file: !12, line: 115, baseType: !296, size: 64, align: 32)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !287, file: !12, line: 115, size: 64, align: 32, elements: !297)
!297 = !{!298, !299}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !296, file: !12, line: 115, baseType: !32, size: 32, align: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !296, file: !12, line: 115, baseType: !32, size: 32, align: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !287, file: !12, line: 115, baseType: !41, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "bx", scope: !284, file: !12, line: 116, baseType: !302, size: 64, align: 64, offset: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !284, file: !12, line: 116, size: 64, align: 64, elements: !303)
!303 = !{!304, !309, !310, !315}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !302, file: !12, line: 116, baseType: !305, size: 32, align: 16)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !12, line: 116, size: 32, align: 16, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !305, file: !12, line: 116, baseType: !25, size: 16, align: 16)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !305, file: !12, line: 116, baseType: !25, size: 16, align: 16, offset: 16)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !302, file: !12, line: 116, baseType: !32, size: 32, align: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !302, file: !12, line: 116, baseType: !311, size: 64, align: 32)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !12, line: 116, size: 64, align: 32, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !311, file: !12, line: 116, baseType: !32, size: 32, align: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !311, file: !12, line: 116, baseType: !32, size: 32, align: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !302, file: !12, line: 116, baseType: !41, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !284, file: !12, line: 117, baseType: !317, size: 64, align: 64, offset: 128)
!317 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !284, file: !12, line: 117, size: 64, align: 64, elements: !318)
!318 = !{!319, !324, !325, !330}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !317, file: !12, line: 117, baseType: !320, size: 32, align: 16)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !317, file: !12, line: 117, size: 32, align: 16, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !320, file: !12, line: 117, baseType: !25, size: 16, align: 16)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !320, file: !12, line: 117, baseType: !25, size: 16, align: 16, offset: 16)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !317, file: !12, line: 117, baseType: !32, size: 32, align: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !317, file: !12, line: 117, baseType: !326, size: 64, align: 32)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !317, file: !12, line: 117, size: 64, align: 32, elements: !327)
!327 = !{!328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !326, file: !12, line: 117, baseType: !32, size: 32, align: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !326, file: !12, line: 117, baseType: !32, size: 32, align: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !317, file: !12, line: 117, baseType: !41, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !284, file: !12, line: 118, baseType: !332, size: 64, align: 64, offset: 192)
!332 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !284, file: !12, line: 118, size: 64, align: 64, elements: !333)
!333 = !{!334, !339, !340, !345}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !332, file: !12, line: 118, baseType: !335, size: 32, align: 16)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !332, file: !12, line: 118, size: 32, align: 16, elements: !336)
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !335, file: !12, line: 118, baseType: !25, size: 16, align: 16)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !335, file: !12, line: 118, baseType: !25, size: 16, align: 16, offset: 16)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !332, file: !12, line: 118, baseType: !32, size: 32, align: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !332, file: !12, line: 118, baseType: !341, size: 64, align: 32)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !332, file: !12, line: 118, size: 64, align: 32, elements: !342)
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !341, file: !12, line: 118, baseType: !32, size: 32, align: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !341, file: !12, line: 118, baseType: !32, size: 32, align: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !332, file: !12, line: 118, baseType: !41, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "si", scope: !284, file: !12, line: 119, baseType: !347, size: 64, align: 64, offset: 256)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !284, file: !12, line: 119, size: 64, align: 64, elements: !348)
!348 = !{!349, !354, !355, !360}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !347, file: !12, line: 119, baseType: !350, size: 32, align: 16)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !347, file: !12, line: 119, size: 32, align: 16, elements: !351)
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !350, file: !12, line: 119, baseType: !25, size: 16, align: 16)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !350, file: !12, line: 119, baseType: !25, size: 16, align: 16, offset: 16)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !347, file: !12, line: 119, baseType: !32, size: 32, align: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !347, file: !12, line: 119, baseType: !356, size: 64, align: 32)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !347, file: !12, line: 119, size: 64, align: 32, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !356, file: !12, line: 119, baseType: !32, size: 32, align: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !356, file: !12, line: 119, baseType: !32, size: 32, align: 32, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !347, file: !12, line: 119, baseType: !41, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !284, file: !12, line: 120, baseType: !362, size: 64, align: 64, offset: 320)
!362 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !284, file: !12, line: 120, size: 64, align: 64, elements: !363)
!363 = !{!364, !369, !370, !375}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !362, file: !12, line: 120, baseType: !365, size: 32, align: 16)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !362, file: !12, line: 120, size: 32, align: 16, elements: !366)
!366 = !{!367, !368}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !365, file: !12, line: 120, baseType: !25, size: 16, align: 16)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !365, file: !12, line: 120, baseType: !25, size: 16, align: 16, offset: 16)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !362, file: !12, line: 120, baseType: !32, size: 32, align: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !362, file: !12, line: 120, baseType: !371, size: 64, align: 32)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !362, file: !12, line: 120, size: 64, align: 32, elements: !372)
!372 = !{!373, !374}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !371, file: !12, line: 120, baseType: !32, size: 32, align: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !371, file: !12, line: 120, baseType: !32, size: 32, align: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !362, file: !12, line: 120, baseType: !41, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "bp", scope: !284, file: !12, line: 121, baseType: !377, size: 64, align: 64, offset: 384)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !284, file: !12, line: 121, size: 64, align: 64, elements: !378)
!378 = !{!379, !384, !385, !390}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !377, file: !12, line: 121, baseType: !380, size: 32, align: 16)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !12, line: 121, size: 32, align: 16, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !380, file: !12, line: 121, baseType: !25, size: 16, align: 16)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !380, file: !12, line: 121, baseType: !25, size: 16, align: 16, offset: 16)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !377, file: !12, line: 121, baseType: !32, size: 32, align: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !377, file: !12, line: 121, baseType: !386, size: 64, align: 32)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !12, line: 121, size: 64, align: 32, elements: !387)
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !386, file: !12, line: 121, baseType: !32, size: 32, align: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !386, file: !12, line: 121, baseType: !32, size: 32, align: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !377, file: !12, line: 121, baseType: !41, size: 64, align: 64)
!391 = !DILocalVariable(name: "myBp", arg: 1, scope: !209, file: !7, line: 140, type: !212)
!392 = !DILocation(line: 140, column: 33, scope: !209)
!393 = !DILocalVariable(name: "dummy", scope: !209, file: !7, line: 142, type: !41)
!394 = !DILocation(line: 142, column: 11, scope: !209)
!395 = !DILocation(line: 177, column: 14, scope: !209)
!396 = !DILocation(line: 144, column: 4, scope: !209)
!397 = !{i32 43239, i32 43256, i32 43309, i32 43348, i32 43387, i32 43426, i32 43465, i32 43504, i32 43543, i32 43582, i32 43603, i32 43630, i32 43668, i32 43707, i32 43746, i32 43785, i32 43824, i32 43863, i32 43902, i32 43941}
!398 = !DILocation(line: 189, column: 1, scope: !209)
!399 = distinct !DISubprogram(name: "BackdoorHbOut", scope: !7, file: !7, line: 193, type: !210, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!400 = !DILocalVariable(name: "myBp", arg: 1, scope: !399, file: !7, line: 193, type: !212)
!401 = !DILocation(line: 193, column: 34, scope: !399)
!402 = !DILocalVariable(name: "dummy", scope: !399, file: !7, line: 195, type: !41)
!403 = !DILocation(line: 195, column: 11, scope: !399)
!404 = !DILocation(line: 230, column: 14, scope: !399)
!405 = !DILocation(line: 197, column: 4, scope: !399)
!406 = !{i32 44193, i32 44210, i32 44263, i32 44302, i32 44341, i32 44380, i32 44419, i32 44458, i32 44497, i32 44536, i32 44557, i32 44585, i32 44623, i32 44662, i32 44701, i32 44740, i32 44779, i32 44818, i32 44857, i32 44896}
!407 = !DILocation(line: 238, column: 1, scope: !399)
