; ModuleID = './[inter]src--findif_getifaddrs.o.i'
source_filename = "./[inter]src--findif_getifaddrs.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ifaddrs = type { %struct.ifaddrs*, i8*, i32, %struct.sockaddr*, %struct.sockaddr*, %union.anon, i8* }
%struct.sockaddr = type { i16, [14 x i8] }
%union.anon = type { %struct.sockaddr* }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }

@arping_lookupdev.ifname = internal global [16 x i8] zeroinitializer, align 16
@verbose = external global i32, align 4
@.str = private unnamed_addr constant [26 x i8] c"arping: getifaddrs(): %s\0A\00", align 1
@.str.1 = private unnamed_addr constant [17 x i8] c"getifaddrs(): %s\00", align 1
@.str.2 = private unnamed_addr constant [35 x i8] c"arping: Autodetected interface %s\0A\00", align 1
@.str.3 = private unnamed_addr constant [50 x i8] c"arping: Failed to find iface using getifaddrs().\0A\00", align 1
@.str.4 = private unnamed_addr constant [48 x i8] c"No matching interface found using getifaddrs().\00", align 1

; Function Attrs: nounwind uwtable
define i8* @arping_lookupdev(i32, i32, i8*) #0 !dbg !49 {
  %4 = alloca i32, align 4
  %5 = alloca i32, align 4
  %6 = alloca i8*, align 8
  %7 = alloca %struct.ifaddrs*, align 8
  %8 = alloca %struct.ifaddrs*, align 8
  %9 = alloca i8*, align 8
  %10 = alloca i32, align 4
  %11 = alloca i32, align 4
  %12 = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22, globals: !47)
!1 = !DIFile(filename: "[inter]src--findif_getifaddrs.o.i", directory: "/home/lichi/Desktop/arping/[task]src--arping")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/net/if.h", directory: "/home/lichi/Desktop/arping/[task]src--arping")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!6 = !DIEnumerator(name: "IFF_UP", value: 1)
!7 = !DIEnumerator(name: "IFF_BROADCAST", value: 2)
!8 = !DIEnumerator(name: "IFF_DEBUG", value: 4)
!9 = !DIEnumerator(name: "IFF_LOOPBACK", value: 8)
!10 = !DIEnumerator(name: "IFF_POINTOPOINT", value: 16)
!11 = !DIEnumerator(name: "IFF_NOTRAILERS", value: 32)
!12 = !DIEnumerator(name: "IFF_RUNNING", value: 64)
!13 = !DIEnumerator(name: "IFF_NOARP", value: 128)
!14 = !DIEnumerator(name: "IFF_PROMISC", value: 256)
!15 = !DIEnumerator(name: "IFF_ALLMULTI", value: 512)
!16 = !DIEnumerator(name: "IFF_MASTER", value: 1024)
!17 = !DIEnumerator(name: "IFF_SLAVE", value: 2048)
!18 = !DIEnumerator(name: "IFF_MULTICAST", value: 4096)
!19 = !DIEnumerator(name: "IFF_PORTSEL", value: 8192)
!20 = !DIEnumerator(name: "IFF_AUTOMEDIA", value: 16384)
!21 = !DIEnumerator(name: "IFF_DYNAMIC", value: 32768)
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !25, line: 239, size: 128, align: 32, elements: !26)
!25 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/arping/[task]src--arping")
!26 = !{!27, !31, !35, !42}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !24, file: !25, line: 241, baseType: !28, size: 16, align: 16)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !29, line: 28, baseType: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/arping/[task]src--arping")
!30 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !24, file: !25, line: 242, baseType: !32, size: 16, align: 16, offset: 16)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !25, line: 119, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !34, line: 49, baseType: !30)
!34 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/arping/[task]src--arping")
!35 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !24, file: !25, line: 243, baseType: !36, size: 32, align: 32, offset: 32)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !25, line: 31, size: 32, align: 32, elements: !37)
!37 = !{!38}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !36, file: !25, line: 33, baseType: !39, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !25, line: 30, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !34, line: 51, baseType: !41)
!41 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !24, file: !25, line: 246, baseType: !43, size: 64, align: 8, offset: 64)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, align: 8, elements: !45)
!44 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!45 = !{!46}
!46 = !DISubrange(count: 8)
!47 = !{!48}
!48 = distinct !DIGlobalVariable(name: "ifname", scope: !49, file: !50, line: 59, type: !58, isLocal: true, isDefinition: true, variable: [16 x i8]* @arping_lookupdev.ifname)
!49 = distinct !DISubprogram(name: "arping_lookupdev", scope: !50, file: !50, line: 45, type: !51, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !57)
!50 = !DIFile(filename: "findif_getifaddrs.c", directory: "/home/lichi/Desktop/arping/[task]src--arping")
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !40, !40, !56}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!57 = !{}
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 128, align: 8, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 16)
!61 = !{i32 2, !"Dwarf Version", i32 4}
!62 = !{i32 2, !"Debug Info Version", i32 3}
!63 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!64 = !DILocalVariable(name: "srcip", arg: 1, scope: !49, file: !50, line: 45, type: !40)
!65 = !DIExpression()
!66 = !DILocation(line: 45, column: 27, scope: !49)
!67 = !DILocalVariable(name: "dstip", arg: 2, scope: !49, file: !50, line: 46, type: !40)
!68 = !DILocation(line: 46, column: 27, scope: !49)
!69 = !DILocalVariable(name: "ebuf", arg: 3, scope: !49, file: !50, line: 47, type: !56)
!70 = !DILocation(line: 47, column: 24, scope: !49)
!71 = !DILocalVariable(name: "ifa", scope: !49, file: !50, line: 49, type: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifaddrs", file: !74, line: 29, size: 448, align: 64, elements: !75)
!74 = !DIFile(filename: "/usr/include/ifaddrs.h", directory: "/home/lichi/Desktop/arping/[task]src--arping")
!75 = !{!76, !77, !78, !79, !89, !90, !95}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_next", scope: !73, file: !74, line: 31, baseType: !72, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_name", scope: !73, file: !74, line: 33, baseType: !56, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_flags", scope: !73, file: !74, line: 34, baseType: !41, size: 32, align: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_addr", scope: !73, file: !74, line: 36, baseType: !80, size: 64, align: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !82, line: 153, size: 128, align: 16, elements: !83)
!82 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/arping/[task]src--arping")
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !81, file: !82, line: 155, baseType: !28, size: 16, align: 16)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !81, file: !82, line: 156, baseType: !86, size: 112, align: 8, offset: 16)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 112, align: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 14)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_netmask", scope: !73, file: !74, line: 37, baseType: !80, size: 64, align: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_ifu", scope: !73, file: !74, line: 46, baseType: !91, size: 64, align: 64, offset: 320)
!91 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !73, file: !74, line: 38, size: 64, align: 64, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ifu_broadaddr", scope: !91, file: !74, line: 44, baseType: !80, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ifu_dstaddr", scope: !91, file: !74, line: 45, baseType: !80, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_data", scope: !73, file: !74, line: 56, baseType: !96, size: 64, align: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!97 = !DILocation(line: 49, column: 25, scope: !49)
!98 = !DILocalVariable(name: "cur", scope: !49, file: !50, line: 50, type: !72)
!99 = !DILocation(line: 50, column: 25, scope: !49)
!100 = !DILocalVariable(name: "ret", scope: !49, file: !50, line: 51, type: !53)
!101 = !DILocation(line: 51, column: 21, scope: !49)
!102 = !DILocalVariable(name: "match_count", scope: !49, file: !50, line: 52, type: !103)
!103 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!104 = !DILocation(line: 52, column: 13, scope: !49)
!105 = !DILocation(line: 53, column: 16, scope: !49)
!106 = !DILocalVariable(name: "best_mask", scope: !49, file: !50, line: 56, type: !39)
!107 = !DILocation(line: 56, column: 19, scope: !49)
!108 = !DILocation(line: 61, column: 10, scope: !49)
!109 = !DILocation(line: 61, column: 15, scope: !49)
!110 = !DILocation(line: 63, column: 13, scope: !111)
!111 = distinct !DILexicalBlock(scope: !49, file: !50, line: 63, column: 13)
!112 = !DILocation(line: 63, column: 13, scope: !49)
!113 = !DILocation(line: 64, column: 21, scope: !114)
!114 = distinct !DILexicalBlock(scope: !115, file: !50, line: 64, column: 21)
!115 = distinct !DILexicalBlock(scope: !111, file: !50, line: 63, column: 31)
!116 = !DILocation(line: 64, column: 21, scope: !115)
!117 = !DILocation(line: 65, column: 72, scope: !118)
!118 = distinct !DILexicalBlock(scope: !114, file: !50, line: 64, column: 30)
!119 = !DILocation(line: 65, column: 71, scope: !118)
!120 = !DILocation(line: 65, column: 62, scope: !121)
!121 = !DILexicalBlockFile(scope: !118, file: !50, discriminator: 1)
!122 = !DILocation(line: 65, column: 25, scope: !123)
!123 = !DILexicalBlockFile(scope: !118, file: !50, discriminator: 2)
!124 = !DILocation(line: 66, column: 17, scope: !118)
!125 = !DILocation(line: 67, column: 26, scope: !115)
!126 = !DILocation(line: 68, column: 56, scope: !115)
!127 = !DILocation(line: 68, column: 55, scope: !115)
!128 = !DILocation(line: 68, column: 46, scope: !129)
!129 = !DILexicalBlockFile(scope: !115, file: !50, discriminator: 1)
!130 = !DILocation(line: 67, column: 17, scope: !115)
!131 = !DILocation(line: 69, column: 17, scope: !115)
!132 = !DILocation(line: 71, column: 20, scope: !133)
!133 = distinct !DILexicalBlock(scope: !49, file: !50, line: 71, column: 9)
!134 = !DILocation(line: 71, column: 18, scope: !133)
!135 = !DILocation(line: 71, column: 14, scope: !133)
!136 = !DILocation(line: 71, column: 25, scope: !137)
!137 = !DILexicalBlockFile(scope: !138, file: !50, discriminator: 1)
!138 = distinct !DILexicalBlock(scope: !133, file: !50, line: 71, column: 9)
!139 = !DILocation(line: 71, column: 9, scope: !137)
!140 = !DILocalVariable(name: "addr", scope: !141, file: !50, line: 72, type: !39)
!141 = distinct !DILexicalBlock(scope: !138, file: !50, line: 71, column: 51)
!142 = !DILocation(line: 72, column: 27, scope: !141)
!143 = !DILocalVariable(name: "mask", scope: !141, file: !50, line: 72, type: !39)
!144 = !DILocation(line: 72, column: 33, scope: !141)
!145 = !DILocation(line: 74, column: 23, scope: !146)
!146 = distinct !DILexicalBlock(scope: !141, file: !50, line: 74, column: 21)
!147 = !DILocation(line: 74, column: 28, scope: !146)
!148 = !DILocation(line: 74, column: 38, scope: !146)
!149 = !DILocation(line: 74, column: 21, scope: !141)
!150 = !DILocation(line: 75, column: 25, scope: !151)
!151 = distinct !DILexicalBlock(scope: !146, file: !50, line: 74, column: 48)
!152 = !DILocation(line: 77, column: 22, scope: !153)
!153 = distinct !DILexicalBlock(scope: !141, file: !50, line: 77, column: 21)
!154 = !DILocation(line: 77, column: 27, scope: !153)
!155 = !DILocation(line: 78, column: 21, scope: !153)
!156 = !DILocation(line: 78, column: 25, scope: !157)
!157 = !DILexicalBlockFile(scope: !153, file: !50, discriminator: 1)
