; ModuleID = './vmware_toolbox_cmd-toolboxcmd-stat.o.i'
source_filename = "./vmware_toolbox_cmd-toolboxcmd-stat.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%union.Backdoor_proto = type { %struct.anon }
%struct.anon = type { %union.anon, i64, %union.anon.2, %union.anon.5, %union.anon.8, %union.anon.11 }
%union.anon = type { i64 }
%union.anon.2 = type { i64 }
%union.anon.5 = type { i64 }
%union.anon.8 = type { i64 }
%union.anon.11 = type { i64 }
%struct.anon.3 = type { i16, i16 }
%struct.anon.14 = type { %union.anon.15, %union.anon.18, %union.anon.21, %union.anon.24, %union.anon.27, %union.anon.30 }
%union.anon.15 = type { i64 }
%union.anon.18 = type { i64 }
%union.anon.21 = type { i64 }
%union.anon.24 = type { i64 }
%union.anon.27 = type { i64 }
%union.anon.30 = type { i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct._GError = type { i32, i32, i8* }
%struct._VMGuestLibHandle = type opaque

@optind = external global i32, align 4
@.str = private unnamed_addr constant [9 x i8] c"hosttime\00", align 1
@.str.1 = private unnamed_addr constant [10 x i8] c"sessionid\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"balloon\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"swap\00", align 1
@.str.4 = private unnamed_addr constant [9 x i8] c"memlimit\00", align 1
@.str.5 = private unnamed_addr constant [7 x i8] c"memres\00", align 1

!145 = !DILexicalBlockFile(scope: !134, file: !29, discriminator: 2)
!146 = !DILocation(line: 568, column: 25, scope: !147)
!147 = !DILexicalBlockFile(scope: !134, file: !29, discriminator: 3)
!148 = !DILocation(line: 569, column: 26, scope: !134)
!149 = !DILocation(line: 569, column: 33, scope: !134)
!150 = !DILocation(line: 569, column: 39, scope: !134)
!151 = !DILocation(line: 569, column: 37, scope: !134)
!152 = !DILocation(line: 569, column: 25, scope: !134)
!153 = !DILocation(line: 569, column: 52, scope: !140)
!154 = !DILocation(line: 569, column: 59, scope: !140)
!155 = !DILocation(line: 569, column: 47, scope: !140)
!156 = !DILocation(line: 569, column: 25, scope: !140)
!157 = !DILocation(line: 569, column: 25, scope: !145)
!158 = !DILocation(line: 569, column: 25, scope: !147)
!159 = !DILocation(line: 570, column: 26, scope: !134)
!160 = !DILocation(line: 570, column: 33, scope: !134)
!161 = !DILocation(line: 570, column: 39, scope: !134)
!162 = !DILocation(line: 570, column: 37, scope: !134)
!163 = !DILocation(line: 570, column: 25, scope: !134)
!164 = !DILocation(line: 570, column: 52, scope: !140)
!165 = !DILocation(line: 570, column: 59, scope: !140)
!166 = !DILocation(line: 570, column: 47, scope: !140)
!167 = !DILocation(line: 570, column: 25, scope: !140)
!168 = !DILocation(line: 570, column: 25, scope: !145)
!169 = !DILocation(line: 570, column: 25, scope: !147)
!170 = !DILocation(line: 568, column: 14, scope: !171)
!171 = !DILexicalBlockFile(scope: !134, file: !29, discriminator: 4)
!172 = !DILocation(line: 568, column: 7, scope: !171)
!173 = !DILocation(line: 572, column: 35, scope: !174)
!174 = distinct !DILexicalBlock(scope: !128, file: !29, line: 571, column: 11)
!175 = !DILocation(line: 573, column: 35, scope: !174)
!176 = !DILocation(line: 574, column: 40, scope: !174)
!177 = !DILocation(line: 574, column: 35, scope: !174)
!178 = !DILocation(line: 572, column: 7, scope: !174)
!179 = !DILocation(line: 575, column: 7, scope: !174)
!180 = !DILocation(line: 577, column: 1, scope: !28)
!181 = distinct !DISubprogram(name: "StatHostTime", scope: !29, file: !29, line: 127, type: !182, isLocal: true, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !38)
!182 = !DISubroutineType(types: !183)
!183 = !{!24}
!184 = !DILocalVariable(name: "hostSecs", scope: !181, file: !29, line: 129, type: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !19, line: 172, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !187, line: 197, baseType: !188)
!187 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1643")
!188 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!189 = !DILocation(line: 129, column: 10, scope: !181)
!190 = !DILocalVariable(name: "hostUsecs", scope: !181, file: !29, line: 130, type: !185)
!191 = !DILocation(line: 130, column: 10, scope: !181)
!192 = !DILocalVariable(name: "sec", scope: !181, file: !29, line: 131, type: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !194, line: 75, baseType: !195)
!194 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line1643")
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !196, line: 139, baseType: !188)
!196 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1643")
!197 = !DILocation(line: 131, column: 11, scope: !181)
!198 = !DILocalVariable(name: "buf", scope: !181, file: !29, line: 132, type: !199)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 2048, align: 8, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 256)
!202 = !DILocation(line: 132, column: 9, scope: !181)
!203 = !DILocalVariable(name: "timeUtf8", scope: !181, file: !29, line: 133, type: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !36, line: 46, baseType: !34)
!206 = !DILocation(line: 133, column: 11, scope: !181)
!207 = !DILocalVariable(name: "bp", scope: !181, file: !29, line: 134, type: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "Backdoor_proto", file: !209, line: 102, baseType: !210)
!209 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/backdoor_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1643")
!210 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !209, line: 85, size: 384, align: 64, elements: !211)
!211 = !{!212, !299}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !210, file: !209, line: 93, baseType: !213, size: 384, align: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !209, line: 86, size: 384, align: 64, elements: !214)
!214 = !{!215, !236, !239, !254, !269, !284}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !213, file: !209, line: 87, baseType: !216, size: 64, align: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !213, file: !209, line: 87, size: 64, align: 64, elements: !217)
!217 = !{!218, !226, !230, !235}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !216, file: !209, line: 87, baseType: !219, size: 32, align: 16)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !216, file: !209, line: 87, size: 32, align: 16, elements: !220)
!220 = !{!221, !225}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !219, file: !209, line: 87, baseType: !222, size: 16, align: 16)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !19, line: 175, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !21, line: 49, baseType: !224)
!224 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !219, file: !209, line: 87, baseType: !222, size: 16, align: 16, offset: 16)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !216, file: !209, line: 87, baseType: !227, size: 32, align: 32)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !19, line: 173, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !21, line: 51, baseType: !229)
!229 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !216, file: !209, line: 87, baseType: !231, size: 64, align: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !216, file: !209, line: 87, size: 64, align: 32, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !231, file: !209, line: 87, baseType: !227, size: 32, align: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !231, file: !209, line: 87, baseType: !227, size: 32, align: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !216, file: !209, line: 87, baseType: !18, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !213, file: !209, line: 88, baseType: !237, size: 64, align: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !238, line: 216, baseType: !22)
!238 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1643")
!239 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !213, file: !209, line: 89, baseType: !240, size: 64, align: 64, offset: 128)
!240 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !213, file: !209, line: 89, size: 64, align: 64, elements: !241)
!241 = !{!242, !247, !248, !253}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !240, file: !209, line: 89, baseType: !243, size: 32, align: 16)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !240, file: !209, line: 89, size: 32, align: 16, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !243, file: !209, line: 89, baseType: !222, size: 16, align: 16)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !243, file: !209, line: 89, baseType: !222, size: 16, align: 16, offset: 16)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !240, file: !209, line: 89, baseType: !227, size: 32, align: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !240, file: !209, line: 89, baseType: !249, size: 64, align: 32)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !240, file: !209, line: 89, size: 64, align: 32, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !249, file: !209, line: 89, baseType: !227, size: 32, align: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !249, file: !209, line: 89, baseType: !227, size: 32, align: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !240, file: !209, line: 89, baseType: !18, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !213, file: !209, line: 90, baseType: !255, size: 64, align: 64, offset: 192)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !213, file: !209, line: 90, size: 64, align: 64, elements: !256)
!256 = !{!257, !262, !263, !268}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !255, file: !209, line: 90, baseType: !258, size: 32, align: 16)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !255, file: !209, line: 90, size: 32, align: 16, elements: !259)
!259 = !{!260, !261}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !258, file: !209, line: 90, baseType: !222, size: 16, align: 16)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !258, file: !209, line: 90, baseType: !222, size: 16, align: 16, offset: 16)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !255, file: !209, line: 90, baseType: !227, size: 32, align: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !255, file: !209, line: 90, baseType: !264, size: 64, align: 32)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !255, file: !209, line: 90, size: 64, align: 32, elements: !265)
!265 = !{!266, !267}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !264, file: !209, line: 90, baseType: !227, size: 32, align: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !264, file: !209, line: 90, baseType: !227, size: 32, align: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !255, file: !209, line: 90, baseType: !18, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "si", scope: !213, file: !209, line: 91, baseType: !270, size: 64, align: 64, offset: 256)
!270 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !213, file: !209, line: 91, size: 64, align: 64, elements: !271)
!271 = !{!272, !277, !278, !283}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !270, file: !209, line: 91, baseType: !273, size: 32, align: 16)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !270, file: !209, line: 91, size: 32, align: 16, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !273, file: !209, line: 91, baseType: !222, size: 16, align: 16)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !273, file: !209, line: 91, baseType: !222, size: 16, align: 16, offset: 16)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !270, file: !209, line: 91, baseType: !227, size: 32, align: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !270, file: !209, line: 91, baseType: !279, size: 64, align: 32)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !270, file: !209, line: 91, size: 64, align: 32, elements: !280)
!280 = !{!281, !282}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !279, file: !209, line: 91, baseType: !227, size: 32, align: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !279, file: !209, line: 91, baseType: !227, size: 32, align: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !270, file: !209, line: 91, baseType: !18, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !213, file: !209, line: 92, baseType: !285, size: 64, align: 64, offset: 320)
!285 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !213, file: !209, line: 92, size: 64, align: 64, elements: !286)
!286 = !{!287, !292, !293, !298}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !285, file: !209, line: 92, baseType: !288, size: 32, align: 16)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !285, file: !209, line: 92, size: 32, align: 16, elements: !289)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !288, file: !209, line: 92, baseType: !222, size: 16, align: 16)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !288, file: !209, line: 92, baseType: !222, size: 16, align: 16, offset: 16)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !285, file: !209, line: 92, baseType: !227, size: 32, align: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !285, file: !209, line: 92, baseType: !294, size: 64, align: 32)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !285, file: !209, line: 92, size: 64, align: 32, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !294, file: !209, line: 92, baseType: !227, size: 32, align: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !294, file: !209, line: 92, baseType: !227, size: 32, align: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !285, file: !209, line: 92, baseType: !18, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !210, file: !209, line: 101, baseType: !300, size: 384, align: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !209, line: 94, size: 384, align: 64, elements: !301)
!301 = !{!302, !317, !332, !347, !362, !377}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !300, file: !209, line: 95, baseType: !303, size: 64, align: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !300, file: !209, line: 95, size: 64, align: 64, elements: !304)
!304 = !{!305, !310, !311, !316}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !303, file: !209, line: 95, baseType: !306, size: 32, align: 16)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !303, file: !209, line: 95, size: 32, align: 16, elements: !307)
!307 = !{!308, !309}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !306, file: !209, line: 95, baseType: !222, size: 16, align: 16)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !306, file: !209, line: 95, baseType: !222, size: 16, align: 16, offset: 16)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !303, file: !209, line: 95, baseType: !227, size: 32, align: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !303, file: !209, line: 95, baseType: !312, size: 64, align: 32)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !303, file: !209, line: 95, size: 64, align: 32, elements: !313)
!313 = !{!314, !315}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !312, file: !209, line: 95, baseType: !227, size: 32, align: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !312, file: !209, line: 95, baseType: !227, size: 32, align: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !303, file: !209, line: 95, baseType: !18, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "bx", scope: !300, file: !209, line: 96, baseType: !318, size: 64, align: 64, offset: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !300, file: !209, line: 96, size: 64, align: 64, elements: !319)
!319 = !{!320, !325, !326, !331}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !318, file: !209, line: 96, baseType: !321, size: 32, align: 16)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !318, file: !209, line: 96, size: 32, align: 16, elements: !322)
!322 = !{!323, !324}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !321, file: !209, line: 96, baseType: !222, size: 16, align: 16)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !321, file: !209, line: 96, baseType: !222, size: 16, align: 16, offset: 16)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !318, file: !209, line: 96, baseType: !227, size: 32, align: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !318, file: !209, line: 96, baseType: !327, size: 64, align: 32)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !318, file: !209, line: 96, size: 64, align: 32, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !327, file: !209, line: 96, baseType: !227, size: 32, align: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !327, file: !209, line: 96, baseType: !227, size: 32, align: 32, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !318, file: !209, line: 96, baseType: !18, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !300, file: !209, line: 97, baseType: !333, size: 64, align: 64, offset: 128)
!333 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !300, file: !209, line: 97, size: 64, align: 64, elements: !334)
!334 = !{!335, !340, !341, !346}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !333, file: !209, line: 97, baseType: !336, size: 32, align: 16)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !333, file: !209, line: 97, size: 32, align: 16, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !336, file: !209, line: 97, baseType: !222, size: 16, align: 16)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !336, file: !209, line: 97, baseType: !222, size: 16, align: 16, offset: 16)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !333, file: !209, line: 97, baseType: !227, size: 32, align: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !333, file: !209, line: 97, baseType: !342, size: 64, align: 32)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !333, file: !209, line: 97, size: 64, align: 32, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !342, file: !209, line: 97, baseType: !227, size: 32, align: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !342, file: !209, line: 97, baseType: !227, size: 32, align: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !333, file: !209, line: 97, baseType: !18, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !300, file: !209, line: 98, baseType: !348, size: 64, align: 64, offset: 192)
!348 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !300, file: !209, line: 98, size: 64, align: 64, elements: !349)
!349 = !{!350, !355, !356, !361}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !348, file: !209, line: 98, baseType: !351, size: 32, align: 16)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !209, line: 98, size: 32, align: 16, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !351, file: !209, line: 98, baseType: !222, size: 16, align: 16)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !351, file: !209, line: 98, baseType: !222, size: 16, align: 16, offset: 16)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !348, file: !209, line: 98, baseType: !227, size: 32, align: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !348, file: !209, line: 98, baseType: !357, size: 64, align: 32)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !348, file: !209, line: 98, size: 64, align: 32, elements: !358)
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !357, file: !209, line: 98, baseType: !227, size: 32, align: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !357, file: !209, line: 98, baseType: !227, size: 32, align: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !348, file: !209, line: 98, baseType: !18, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "si", scope: !300, file: !209, line: 99, baseType: !363, size: 64, align: 64, offset: 256)
!363 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !300, file: !209, line: 99, size: 64, align: 64, elements: !364)
!364 = !{!365, !370, !371, !376}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !363, file: !209, line: 99, baseType: !366, size: 32, align: 16)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !363, file: !209, line: 99, size: 32, align: 16, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !366, file: !209, line: 99, baseType: !222, size: 16, align: 16)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !366, file: !209, line: 99, baseType: !222, size: 16, align: 16, offset: 16)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !363, file: !209, line: 99, baseType: !227, size: 32, align: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !363, file: !209, line: 99, baseType: !372, size: 64, align: 32)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !363, file: !209, line: 99, size: 64, align: 32, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !372, file: !209, line: 99, baseType: !227, size: 32, align: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !372, file: !209, line: 99, baseType: !227, size: 32, align: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !363, file: !209, line: 99, baseType: !18, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !300, file: !209, line: 100, baseType: !378, size: 64, align: 64, offset: 320)
!378 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !300, file: !209, line: 100, size: 64, align: 64, elements: !379)
!379 = !{!380, !385, !386, !391}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !378, file: !209, line: 100, baseType: !381, size: 32, align: 16)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !378, file: !209, line: 100, size: 32, align: 16, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !381, file: !209, line: 100, baseType: !222, size: 16, align: 16)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !381, file: !209, line: 100, baseType: !222, size: 16, align: 16, offset: 16)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !378, file: !209, line: 100, baseType: !227, size: 32, align: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !378, file: !209, line: 100, baseType: !387, size: 64, align: 32)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !378, file: !209, line: 100, size: 64, align: 32, elements: !388)
!388 = !{!389, !390}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !387, file: !209, line: 100, baseType: !227, size: 32, align: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !387, file: !209, line: 100, baseType: !227, size: 32, align: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !378, file: !209, line: 100, baseType: !18, size: 64, align: 64)
!392 = !DILocation(line: 134, column: 19, scope: !181)
!393 = !DILocation(line: 136, column: 7, scope: !181)
!394 = !DILocation(line: 136, column: 10, scope: !181)
!395 = !DILocation(line: 136, column: 13, scope: !181)
!396 = !DILocation(line: 136, column: 19, scope: !181)
!397 = !DILocation(line: 136, column: 23, scope: !181)
!398 = !DILocation(line: 137, column: 4, scope: !181)
!399 = !DILocation(line: 138, column: 11, scope: !400)
!400 = distinct !DILexicalBlock(scope: !181, file: !29, line: 138, column: 8)
!401 = !DILocation(line: 138, column: 15, scope: !400)
!402 = !DILocation(line: 138, column: 18, scope: !400)
!403 = !DILocation(line: 138, column: 23, scope: !400)
!404 = !DILocation(line: 138, column: 8, scope: !181)
!405 = !DILocation(line: 139, column: 30, scope: !406)
!406 = distinct !DILexicalBlock(scope: !400, file: !29, line: 138, column: 38)
!407 = !DILocation(line: 139, column: 34, scope: !406)
!408 = !DILocation(line: 139, column: 37, scope: !406)
!409 = !DILocation(line: 139, column: 19, scope: !406)
!410 = !DILocation(line: 139, column: 42, scope: !406)
!411 = !DILocation(line: 139, column: 54, scope: !406)
!412 = !DILocation(line: 139, column: 58, scope: !406)
!413 = !DILocation(line: 139, column: 61, scope: !406)
!414 = !DILocation(line: 139, column: 51, scope: !406)
!415 = !DILocation(line: 139, column: 49, scope: !406)
!416 = !DILocation(line: 139, column: 16, scope: !406)
!417 = !DILocation(line: 140, column: 4, scope: !406)
!418 = !DILocation(line: 142, column: 10, scope: !419)
!419 = distinct !DILexicalBlock(scope: !400, file: !29, line: 140, column: 11)
!420 = !DILocation(line: 142, column: 13, scope: !419)
!421 = !DILocation(line: 142, column: 16, scope: !419)
!422 = !DILocation(line: 142, column: 22, scope: !419)
!423 = !DILocation(line: 142, column: 26, scope: !419)
!424 = !DILocation(line: 143, column: 7, scope: !419)
!425 = !DILocation(line: 144, column: 21, scope: !419)
!426 = !DILocation(line: 144, column: 25, scope: !419)
!427 = !DILocation(line: 144, column: 28, scope: !419)
!428 = !DILocation(line: 144, column: 18, scope: !419)
!429 = !DILocation(line: 144, column: 16, scope: !419)
!430 = !DILocation(line: 146, column: 19, scope: !181)
!431 = !DILocation(line: 146, column: 23, scope: !181)
!432 = !DILocation(line: 146, column: 26, scope: !181)
!433 = !DILocation(line: 146, column: 16, scope: !181)
!434 = !DILocation(line: 146, column: 14, scope: !181)
!435 = !DILocation(line: 148, column: 8, scope: !436)
!436 = distinct !DILexicalBlock(scope: !181, file: !29, line: 148, column: 8)
!437 = !DILocation(line: 148, column: 17, scope: !436)
!438 = !DILocation(line: 148, column: 8, scope: !181)
!439 = !DILocation(line: 150, column: 25, scope: !440)
!440 = distinct !DILexicalBlock(scope: !436, file: !29, line: 148, column: 23)
!441 = !DILocation(line: 149, column: 7, scope: !440)
!442 = !DILocation(line: 151, column: 7, scope: !440)
!443 = !DILocation(line: 154, column: 10, scope: !181)
!444 = !DILocation(line: 154, column: 22, scope: !181)
!445 = !DILocation(line: 154, column: 32, scope: !181)
!446 = !DILocation(line: 154, column: 19, scope: !181)
!447 = !DILocation(line: 154, column: 8, scope: !181)
!448 = !DILocation(line: 155, column: 17, scope: !449)
!449 = distinct !DILexicalBlock(scope: !181, file: !29, line: 155, column: 8)
!450 = !DILocation(line: 155, column: 55, scope: !449)
!451 = !DILocation(line: 155, column: 8, scope: !452)
!452 = !DILexicalBlockFile(scope: !449, file: !29, discriminator: 1)
!453 = !DILocation(line: 155, column: 72, scope: !449)
!454 = !DILocation(line: 155, column: 8, scope: !181)
!455 = !DILocation(line: 157, column: 25, scope: !456)
!456 = distinct !DILexicalBlock(scope: !449, file: !29, line: 155, column: 78)
