; ModuleID = './[inter]keepalived--core--pidfile.o.i'
source_filename = "./[inter]keepalived--core--pidfile.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [20 x i8] c"/var/run/keepalived\00", align 1
@pid_directory = global i8* getelementptr inbounds ([20 x i8], [20 x i8]* @.str, i32 0, i32 0), align 8
@.str.1 = private unnamed_addr constant [30 x i8] c"Unable to create directory %s\00", align 1
@.str.2 = private unnamed_addr constant [38 x i8] c"unlink of %s failed - error (%d) '%s'\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.4 = private unnamed_addr constant [39 x i8] c"pidfile_write : Cannot open %s pidfile\00", align 1
@.str.5 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1
@main_pidfile = external global i8*, align 8
@vrrp_pidfile = external global i8*, align 8
@checkers_pidfile = external global i8*, align 8
@.str.6 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.7 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.8 = private unnamed_addr constant [26 x i8] c"Error reading pid file %s\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !9)
!1 = !DIFile(filename: "[inter]keepalived--core--pidfile.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "daemon_bits", file: !4, line: 33, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./../include/main.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "DAEMON_VRRP", value: 0)
!7 = !DIEnumerator(name: "DAEMON_CHECKERS", value: 1)
!8 = !DIEnumerator(name: "RUN_ALL_CHILDREN", value: 2)
!9 = !{!10}
!10 = distinct !DIGlobalVariable(name: "pid_directory", scope: !0, file: !11, line: 39, type: !12, isLocal: false, isDefinition: true, variable: i8** @pid_directory)
!11 = !DIFile(filename: "pidfile.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!15 = !{i32 2, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!18 = distinct !DISubprogram(name: "create_pid_dir", scope: !11, file: !11, line: 43, type: !19, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !21)
!19 = !DISubroutineType(types: !20)
!20 = !{null}
!21 = !{}
!22 = !DILocation(line: 45, column: 12, scope: !23)
!23 = distinct !DILexicalBlock(scope: !18, file: !11, line: 45, column: 6)
!24 = !DILocation(line: 45, column: 6, scope: !23)
!25 = !DILocation(line: 45, column: 75, scope: !23)
!26 = !DILocation(line: 45, column: 80, scope: !27)
!27 = !DILexicalBlockFile(scope: !23, file: !11, discriminator: 1)
!28 = !DILocation(line: 45, column: 79, scope: !27)
!29 = !DILocation(line: 45, column: 84, scope: !27)
!30 = !DILocation(line: 45, column: 6, scope: !27)
!31 = !DILocation(line: 46, column: 57, scope: !32)
!32 = distinct !DILexicalBlock(scope: !23, file: !11, line: 45, column: 95)
!33 = !DILocation(line: 46, column: 3, scope: !32)
!34 = !DILocation(line: 47, column: 3, scope: !32)
!35 = !DILocation(line: 49, column: 1, scope: !18)
!36 = distinct !DISubprogram(name: "remove_pid_dir", scope: !11, file: !11, line: 52, type: !19, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !21)
!37 = !DILocation(line: 54, column: 12, scope: !38)
!38 = distinct !DILexicalBlock(scope: !36, file: !11, line: 54, column: 6)
!39 = !DILocation(line: 54, column: 6, scope: !38)
!40 = !DILocation(line: 54, column: 27, scope: !38)
!41 = !DILocation(line: 54, column: 31, scope: !42)
!42 = !DILexicalBlockFile(scope: !38, file: !11, discriminator: 1)
!43 = !DILocation(line: 54, column: 30, scope: !42)
!44 = !DILocation(line: 54, column: 35, scope: !42)
!45 = !DILocation(line: 54, column: 48, scope: !42)
!46 = !DILocation(line: 54, column: 53, scope: !47)
!47 = !DILexicalBlockFile(scope: !38, file: !11, discriminator: 2)
!48 = !DILocation(line: 54, column: 52, scope: !47)
!49 = !DILocation(line: 54, column: 57, scope: !47)
!50 = !DILocation(line: 54, column: 6, scope: !47)
!51 = !DILocation(line: 55, column: 65, scope: !38)
!52 = !DILocation(line: 55, column: 82, scope: !38)
!53 = !DILocation(line: 55, column: 81, scope: !38)
!54 = !DILocation(line: 55, column: 98, scope: !42)
!55 = !DILocation(line: 55, column: 97, scope: !38)
!56 = !DILocation(line: 55, column: 87, scope: !47)
!57 = !DILocation(line: 55, column: 3, scope: !58)
!58 = !DILexicalBlockFile(scope: !38, file: !11, discriminator: 3)
!59 = !DILocation(line: 55, column: 3, scope: !38)
!60 = !DILocation(line: 56, column: 1, scope: !36)
!61 = distinct !DISubprogram(name: "pidfile_write", scope: !11, file: !11, line: 60, type: !62, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !21)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !12, !64}
!64 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!65 = !DILocalVariable(name: "pid_file", arg: 1, scope: !61, file: !11, line: 60, type: !12)
!66 = !DIExpression()
!67 = !DILocation(line: 60, column: 27, scope: !61)
!68 = !DILocalVariable(name: "pid", arg: 2, scope: !61, file: !11, line: 60, type: !64)
!69 = !DILocation(line: 60, column: 41, scope: !61)
!70 = !DILocalVariable(name: "pidfile", scope: !61, file: !11, line: 62, type: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !73, line: 48, baseType: !74)
!73 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 241, size: 1728, align: 64, elements: !76)
!75 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!76 = !{!77, !78, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !98, !99, !100, !101, !105, !107, !109, !113, !116, !118, !120, !121, !122, !123, !127, !128}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !74, file: !75, line: 242, baseType: !64, size: 32, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !74, file: !75, line: 247, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !74, file: !75, line: 248, baseType: !79, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !74, file: !75, line: 249, baseType: !79, size: 64, align: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !74, file: !75, line: 250, baseType: !79, size: 64, align: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !74, file: !75, line: 251, baseType: !79, size: 64, align: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !74, file: !75, line: 252, baseType: !79, size: 64, align: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !74, file: !75, line: 253, baseType: !79, size: 64, align: 64, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !74, file: !75, line: 254, baseType: !79, size: 64, align: 64, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !74, file: !75, line: 256, baseType: !79, size: 64, align: 64, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !74, file: !75, line: 257, baseType: !79, size: 64, align: 64, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !74, file: !75, line: 258, baseType: !79, size: 64, align: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !74, file: !75, line: 260, baseType: !91, size: 64, align: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !75, line: 156, size: 192, align: 64, elements: !93)
!93 = !{!94, !95, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !92, file: !75, line: 157, baseType: !91, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !92, file: !75, line: 158, baseType: !96, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !92, file: !75, line: 162, baseType: !64, size: 32, align: 32, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !74, file: !75, line: 262, baseType: !96, size: 64, align: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !74, file: !75, line: 264, baseType: !64, size: 32, align: 32, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !74, file: !75, line: 268, baseType: !64, size: 32, align: 32, offset: 928)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !74, file: !75, line: 270, baseType: !102, size: 64, align: 64, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !103, line: 131, baseType: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!104 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !74, file: !75, line: 274, baseType: !106, size: 16, align: 16, offset: 1024)
!106 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !74, file: !75, line: 275, baseType: !108, size: 8, align: 8, offset: 1040)
!108 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !74, file: !75, line: 276, baseType: !110, size: 8, align: 8, offset: 1048)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, align: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 1)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !74, file: !75, line: 280, baseType: !114, size: 64, align: 64, offset: 1088)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !75, line: 150, baseType: null)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !74, file: !75, line: 289, baseType: !117, size: 64, align: 64, offset: 1152)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !103, line: 132, baseType: !104)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !74, file: !75, line: 297, baseType: !119, size: 64, align: 64, offset: 1216)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !74, file: !75, line: 298, baseType: !119, size: 64, align: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !74, file: !75, line: 299, baseType: !119, size: 64, align: 64, offset: 1344)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !74, file: !75, line: 300, baseType: !119, size: 64, align: 64, offset: 1408)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !74, file: !75, line: 302, baseType: !124, size: 64, align: 64, offset: 1472)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !125, line: 216, baseType: !126)
!125 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!126 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !74, file: !75, line: 303, baseType: !64, size: 32, align: 32, offset: 1536)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !74, file: !75, line: 305, baseType: !129, size: 160, align: 8, offset: 1568)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, align: 8, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 20)
!132 = !DILocation(line: 62, column: 8, scope: !61)
!133 = !DILocalVariable(name: "pidfd", scope: !61, file: !11, line: 63, type: !64)
!134 = !DILocation(line: 63, column: 6, scope: !61)
!135 = !DILocation(line: 63, column: 20, scope: !61)
!136 = !DILocation(line: 63, column: 14, scope: !61)
!137 = !DILocation(line: 65, column: 6, scope: !138)
!138 = distinct !DILexicalBlock(scope: !61, file: !11, line: 65, column: 6)
!139 = !DILocation(line: 65, column: 12, scope: !138)
!140 = !DILocation(line: 65, column: 6, scope: !61)
!141 = !DILocation(line: 65, column: 36, scope: !142)
!142 = !DILexicalBlockFile(scope: !138, file: !11, discriminator: 1)
!143 = !DILocation(line: 65, column: 29, scope: !142)
!144 = !DILocation(line: 65, column: 27, scope: !142)
!145 = !DILocation(line: 65, column: 19, scope: !142)
!146 = !DILocation(line: 67, column: 7, scope: !147)
!147 = distinct !DILexicalBlock(scope: !61, file: !11, line: 67, column: 6)
!148 = !DILocation(line: 67, column: 6, scope: !61)
!149 = !DILocation(line: 69, column: 10, scope: !150)
!150 = distinct !DILexicalBlock(scope: !147, file: !11, line: 67, column: 16)
!151 = !DILocation(line: 68, column: 3, scope: !150)
!152 = !DILocation(line: 70, column: 3, scope: !150)
!153 = !DILocation(line: 72, column: 10, scope: !61)
!154 = !DILocation(line: 72, column: 27, scope: !61)
!155 = !DILocation(line: 72, column: 2, scope: !61)
!156 = !DILocation(line: 73, column: 9, scope: !61)
!157 = !DILocation(line: 73, column: 2, scope: !61)
!158 = !DILocation(line: 74, column: 2, scope: !61)
!159 = !DILocation(line: 75, column: 1, scope: !61)
!160 = distinct !DISubprogram(name: "pidfile_rm", scope: !11, file: !11, line: 79, type: !161, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !21)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !12}
!163 = !DILocalVariable(name: "pid_file", arg: 1, scope: !160, file: !11, line: 79, type: !12)
!164 = !DILocation(line: 79, column: 24, scope: !160)
!165 = !DILocation(line: 81, column: 9, scope: !160)
!166 = !DILocation(line: 81, column: 2, scope: !160)
!167 = !DILocation(line: 82, column: 1, scope: !160)
!168 = distinct !DISubprogram(name: "keepalived_running", scope: !11, file: !11, line: 120, type: !169, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !21)
!169 = !DISubroutineType(types: !170)
!170 = !{!171, !126}
!171 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!172 = !DILocalVariable(name: "mode", arg: 1, scope: !168, file: !11, line: 120, type: !126)
!173 = !DILocation(line: 120, column: 34, scope: !168)
!174 = !DILocation(line: 122, column: 22, scope: !175)
!175 = distinct !DILexicalBlock(scope: !168, file: !11, line: 122, column: 6)
!176 = !DILocation(line: 122, column: 6, scope: !175)
!177 = !DILocation(line: 122, column: 6, scope: !168)
!178 = !DILocation(line: 123, column: 3, scope: !175)
!179 = !DILocation(line: 125, column: 6, scope: !180)
!180 = distinct !DILexicalBlock(scope: !168, file: !11, line: 125, column: 6)
!181 = !DILocation(line: 125, column: 37, scope: !180)
!182 = !DILocation(line: 125, column: 56, scope: !183)
!183 = !DILexicalBlockFile(scope: !180, file: !11, discriminator: 1)
!184 = !DILocation(line: 125, column: 40, scope: !183)
!185 = !DILocation(line: 125, column: 6, scope: !183)
!186 = !DILocation(line: 126, column: 3, scope: !180)
!187 = !DILocation(line: 129, column: 6, scope: !188)
!188 = distinct !DILexicalBlock(scope: !168, file: !11, line: 129, column: 6)
!189 = !DILocation(line: 129, column: 41, scope: !188)
!190 = !DILocation(line: 129, column: 60, scope: !191)
