; ModuleID = './[inter]keepalived--core--keepalived_netlink.o.i'
source_filename = "./[inter]keepalived--core--keepalived_netlink.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._nl_handle = type { %struct.nl_sock*, i32, i32, i32, %struct._thread* }
%struct.nl_sock = type opaque
%struct._thread = type { i64, i32, %struct._thread_master*, i32 (%struct._thread*)*, i8*, %struct.timeval, %union.anon, %struct._thread_event*, %union.anon.0 }
%struct._thread_master = type { %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.list_head, %struct.list_head, %struct.list_head, %struct._list*, %struct.rb_root, %struct.epoll_event*, %struct._thread_event*, i32, i32, i32, i32, %struct._thread*, i64, i64, i8 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.rb_root = type { %struct.rb_node* }
%struct.rb_node = type { i64, %struct.rb_node*, %struct.rb_node* }
%struct.epoll_event = type opaque

!293 = !DIEnumerator(name: "IFA_ANYCAST", value: 5)
!294 = !DIEnumerator(name: "IFA_CACHEINFO", value: 6)
!295 = !DIEnumerator(name: "IFA_MULTICAST", value: 7)
!296 = !DIEnumerator(name: "IFA_FLAGS", value: 8)
!297 = !DIEnumerator(name: "__IFA_MAX", value: 9)
!298 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rt_scope_t", file: !25, line: 258, size: 32, align: 32, elements: !299)
!299 = !{!300, !301, !302, !303, !304}
!300 = !DIEnumerator(name: "RT_SCOPE_UNIVERSE", value: 0)
!301 = !DIEnumerator(name: "RT_SCOPE_SITE", value: 200)
!302 = !DIEnumerator(name: "RT_SCOPE_LINK", value: 253)
!303 = !DIEnumerator(name: "RT_SCOPE_HOST", value: 254)
!304 = !DIEnumerator(name: "RT_SCOPE_NOWHERE", value: 255)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vrrp_vmac_bits", file: !306, line: 40, size: 32, align: 32, elements: !307)
!306 = !DIFile(filename: "./../include/vrrp_vmac.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!307 = !{!308, !309, !310}
!308 = !DIEnumerator(name: "VRRP_VMAC_BIT", value: 0)
!309 = !DIEnumerator(name: "VRRP_VMAC_UP_BIT", value: 1)
!310 = !DIEnumerator(name: "VRRP_VMAC_XMITBASE_BIT", value: 2)
!311 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rtattr_type_t", file: !25, line: 290, size: 32, align: 32, elements: !312)
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336}
!313 = !DIEnumerator(name: "RTA_UNSPEC", value: 0)
!314 = !DIEnumerator(name: "RTA_DST", value: 1)
!315 = !DIEnumerator(name: "RTA_SRC", value: 2)
!316 = !DIEnumerator(name: "RTA_IIF", value: 3)
!317 = !DIEnumerator(name: "RTA_OIF", value: 4)
!318 = !DIEnumerator(name: "RTA_GATEWAY", value: 5)
!319 = !DIEnumerator(name: "RTA_PRIORITY", value: 6)
!320 = !DIEnumerator(name: "RTA_PREFSRC", value: 7)
!321 = !DIEnumerator(name: "RTA_METRICS", value: 8)
!322 = !DIEnumerator(name: "RTA_MULTIPATH", value: 9)
!323 = !DIEnumerator(name: "RTA_PROTOINFO", value: 10)
!324 = !DIEnumerator(name: "RTA_FLOW", value: 11)
!325 = !DIEnumerator(name: "RTA_CACHEINFO", value: 12)
!326 = !DIEnumerator(name: "RTA_SESSION", value: 13)
!327 = !DIEnumerator(name: "RTA_MP_ALGO", value: 14)
!328 = !DIEnumerator(name: "RTA_TABLE", value: 15)
!329 = !DIEnumerator(name: "RTA_MARK", value: 16)
!330 = !DIEnumerator(name: "RTA_MFC_STATS", value: 17)
!331 = !DIEnumerator(name: "RTA_VIA", value: 18)
!332 = !DIEnumerator(name: "RTA_NEWDST", value: 19)
!333 = !DIEnumerator(name: "RTA_PREF", value: 20)
!334 = !DIEnumerator(name: "RTA_ENCAP_TYPE", value: 21)
!335 = !DIEnumerator(name: "RTA_ENCAP", value: 22)
!336 = !DIEnumerator(name: "__RTA_MAX", value: 23)
!337 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !338, line: 32, size: 32, align: 32, elements: !339)
!338 = !DIFile(filename: "/usr/include/linux/fib_rules.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!339 = !{!340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358}
!340 = !DIEnumerator(name: "FRA_UNSPEC", value: 0)
!341 = !DIEnumerator(name: "FRA_DST", value: 1)
!342 = !DIEnumerator(name: "FRA_SRC", value: 2)
!343 = !DIEnumerator(name: "FRA_IIFNAME", value: 3)
!344 = !DIEnumerator(name: "FRA_GOTO", value: 4)
!345 = !DIEnumerator(name: "FRA_UNUSED2", value: 5)
!346 = !DIEnumerator(name: "FRA_PRIORITY", value: 6)
!347 = !DIEnumerator(name: "FRA_UNUSED3", value: 7)
!348 = !DIEnumerator(name: "FRA_UNUSED4", value: 8)
!349 = !DIEnumerator(name: "FRA_UNUSED5", value: 9)
!350 = !DIEnumerator(name: "FRA_FWMARK", value: 10)
!351 = !DIEnumerator(name: "FRA_FLOW", value: 11)
!352 = !DIEnumerator(name: "FRA_TUN_ID", value: 12)
!353 = !DIEnumerator(name: "FRA_SUPPRESS_IFGROUP", value: 13)
!354 = !DIEnumerator(name: "FRA_SUPPRESS_PREFIXLEN", value: 14)
!355 = !DIEnumerator(name: "FRA_TABLE", value: 15)
!356 = !DIEnumerator(name: "FRA_FWMASK", value: 16)
!357 = !DIEnumerator(name: "FRA_OIFNAME", value: 17)
!358 = !DIEnumerator(name: "__FRA_MAX", value: 18)
!359 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !338, line: 57, size: 32, align: 32, elements: !360)
!360 = !{!361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!361 = !DIEnumerator(name: "FR_ACT_UNSPEC", value: 0)
!362 = !DIEnumerator(name: "FR_ACT_TO_TBL", value: 1)
!363 = !DIEnumerator(name: "FR_ACT_GOTO", value: 2)
!364 = !DIEnumerator(name: "FR_ACT_NOP", value: 3)
!365 = !DIEnumerator(name: "FR_ACT_RES3", value: 4)
!366 = !DIEnumerator(name: "FR_ACT_RES4", value: 5)
!367 = !DIEnumerator(name: "FR_ACT_BLACKHOLE", value: 6)
!368 = !DIEnumerator(name: "FR_ACT_UNREACHABLE", value: 7)
!369 = !DIEnumerator(name: "FR_ACT_PROHIBIT", value: 8)
!370 = !DIEnumerator(name: "__FR_ACT_MAX", value: 9)
!371 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "iprule_param_mask", file: !372, line: 44, size: 32, align: 32, elements: !373)
!372 = !DIFile(filename: "./../include/vrrp_iprule.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!373 = !{!374, !375, !376, !377, !378}
!374 = !DIEnumerator(name: "IPRULE_BIT_PRIORITY", value: 1)
!375 = !DIEnumerator(name: "IPRULE_BIT_FWMARK", value: 2)
!376 = !DIEnumerator(name: "IPRULE_BIT_FWMASK", value: 4)
!377 = !DIEnumerator(name: "IPRULE_BIT_SUP_GROUP", value: 8)
!378 = !DIEnumerator(name: "IPRULE_BIT_UID_RANGE", value: 16)
!379 = !{!380, !386, !384, !388, !389, !392, !404, !407, !408, !413, !423, !424, !425, !447, !452, !455}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtattr", file: !25, line: 156, size: 32, align: 16, elements: !382)
!382 = !{!383, !385}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rta_len", scope: !381, file: !25, line: 157, baseType: !384, size: 16, align: 16)
!384 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "rta_type", scope: !381, file: !25, line: 158, baseType: !384, size: 16, align: 16, offset: 16)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !390, line: 51, baseType: !391)
!390 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!391 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !394, line: 42, size: 128, align: 32, elements: !395)
!394 = !DIFile(filename: "/usr/include/linux/netlink.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!395 = !{!396, !399, !401, !402, !403}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !393, file: !394, line: 43, baseType: !397, size: 32, align: 32)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !398, line: 26, baseType: !391)
!398 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!399 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !393, file: !394, line: 44, baseType: !400, size: 16, align: 16, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !398, line: 23, baseType: !384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !393, file: !394, line: 45, baseType: !400, size: 16, align: 16, offset: 48)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !393, file: !394, line: 46, baseType: !397, size: 32, align: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !393, file: !394, line: 47, baseType: !397, size: 32, align: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !405, line: 216, baseType: !406)
!405 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!406 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!407 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsgerr", file: !394, line: 100, size: 160, align: 32, elements: !410)
!410 = !{!411, !412}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !409, file: !394, line: 101, baseType: !407, size: 32, align: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !409, file: !394, line: 102, baseType: !393, size: 128, align: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !166, line: 153, size: 128, align: 16, elements: !415)
!415 = !{!416, !419}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !414, file: !166, line: 155, baseType: !417, size: 16, align: 16)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !418, line: 28, baseType: !384)
!418 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!419 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !414, file: !166, line: 156, baseType: !420, size: 112, align: 8, offset: 16)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 112, align: 8, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 14)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !233, line: 62, baseType: !389)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !427, line: 211, size: 128, align: 32, elements: !428)
!427 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!428 = !{!429}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !426, file: !427, line: 220, baseType: !430, size: 128, align: 32)
!430 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !426, file: !427, line: 213, size: 128, align: 32, elements: !431)
!431 = !{!432, !438, !443}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !430, file: !427, line: 215, baseType: !433, size: 128, align: 8)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 128, align: 8, elements: !436)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !390, line: 48, baseType: !435)
!435 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!436 = !{!437}
!437 = !DISubrange(count: 16)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !430, file: !427, line: 217, baseType: !439, size: 128, align: 16)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 128, align: 16, elements: !441)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !390, line: 49, baseType: !384)
!441 = !{!442}
!442 = !DISubrange(count: 8)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !430, file: !427, line: 218, baseType: !444, size: 128, align: 32)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 128, align: 32, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 4)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !427, line: 31, size: 32, align: 32, elements: !449)
!449 = !{!450}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !448, file: !427, line: 33, baseType: !451, size: 32, align: 32)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !427, line: 30, baseType: !389)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !454, line: 196, baseType: !407)
!454 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !390, line: 55, baseType: !406)
!457 = !{!458, !645, !646, !647, !648}
!458 = distinct !DIGlobalVariable(name: "nl_cmd", scope: !0, file: !459, line: 94, type: !460, isLocal: false, isDefinition: true, variable: %struct._nl_handle* @nl_cmd)
!459 = !DIFile(filename: "keepalived_netlink.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "nl_handle_t", file: !461, line: 50, baseType: !462)
!461 = !DIFile(filename: "./../include/keepalived_netlink.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nl_handle", file: !461, line: 42, size: 256, align: 64, elements: !463)
!463 = !{!464, !468, !469, !470, !471}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !462, file: !461, line: 44, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "nl_sock", file: !467, line: 26, flags: DIFlagFwdDecl)
!467 = !DIFile(filename: "/usr/include/libnl3/netlink/handlers.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!468 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !462, file: !461, line: 46, baseType: !407, size: 32, align: 32, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "nl_pid", scope: !462, file: !461, line: 47, baseType: !389, size: 32, align: 32, offset: 96)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !462, file: !461, line: 48, baseType: !397, size: 32, align: 32, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !462, file: !461, line: 49, baseType: !472, size: 64, align: 64, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !4, line: 99, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !4, line: 78, size: 768, align: 64, elements: !475)
!475 = !{!476, !477, !479, !610, !615, !616, !626, !638, !640}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !474, file: !4, line: 79, baseType: !406, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !474, file: !4, line: 80, baseType: !478, size: 32, align: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !4, line: 63, baseType: !3)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !474, file: !4, line: 81, baseType: !480, size: 64, align: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !4, line: 112, size: 1280, align: 64, elements: !482)
!482 = !{!483, !495, !496, !497, !498, !506, !507, !508, !586, !587, !590, !601, !602, !603, !604, !605, !606, !607, !608}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !481, file: !4, line: 113, baseType: !484, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !485, line: 109, baseType: !486)
!485 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !485, line: 106, size: 64, align: 64, elements: !487)
!487 = !{!488}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !486, file: !485, line: 108, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !485, line: 97, size: 192, align: 64, elements: !491)
!491 = !{!492, !493, !494}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !490, file: !485, line: 99, baseType: !406, size: 64, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !490, file: !485, line: 102, baseType: !489, size: 64, align: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !490, file: !485, line: 103, baseType: !489, size: 64, align: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !481, file: !4, line: 114, baseType: !484, size: 64, align: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !481, file: !4, line: 115, baseType: !484, size: 64, align: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !481, file: !4, line: 116, baseType: !484, size: 64, align: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !481, file: !4, line: 117, baseType: !499, size: 128, align: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !500, line: 62, baseType: !501)
!500 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !500, line: 60, size: 128, align: 64, elements: !502)
!502 = !{!503, !505}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !501, file: !500, line: 61, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !501, file: !500, line: 61, baseType: !504, size: 64, align: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !481, file: !4, line: 121, baseType: !499, size: 128, align: 64, offset: 384)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !481, file: !4, line: 122, baseType: !499, size: 128, align: 64, offset: 512)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !481, file: !4, line: 124, baseType: !509, size: 64, align: 64, offset: 640)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !510, line: 31, baseType: !511)
!510 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !510, line: 39, size: 320, align: 64, elements: !513)
!513 = !{!514, !521, !522, !523, !527}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !512, file: !510, line: 40, baseType: !515, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !510, line: 33, size: 192, align: 64, elements: !517)
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !516, file: !510, line: 34, baseType: !515, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !516, file: !510, line: 35, baseType: !515, size: 64, align: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !516, file: !510, line: 36, baseType: !388, size: 64, align: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !512, file: !510, line: 41, baseType: !515, size: 64, align: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !512, file: !510, line: 42, baseType: !391, size: 32, align: 32, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !512, file: !510, line: 43, baseType: !524, size: 64, align: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !388}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !512, file: !510, line: 44, baseType: !528, size: 64, align: 64, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !531, !388}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !533, line: 48, baseType: !534)
!533 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !535, line: 241, size: 1728, align: 64, elements: !536)
!535 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !557, !558, !559, !560, !564, !565, !567, !571, !574, !576, !577, !578, !579, !580, !581, !582}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !534, file: !535, line: 242, baseType: !407, size: 32, align: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !534, file: !535, line: 247, baseType: !386, size: 64, align: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !534, file: !535, line: 248, baseType: !386, size: 64, align: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !534, file: !535, line: 249, baseType: !386, size: 64, align: 64, offset: 192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !534, file: !535, line: 250, baseType: !386, size: 64, align: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !534, file: !535, line: 251, baseType: !386, size: 64, align: 64, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !534, file: !535, line: 252, baseType: !386, size: 64, align: 64, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !534, file: !535, line: 253, baseType: !386, size: 64, align: 64, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !534, file: !535, line: 254, baseType: !386, size: 64, align: 64, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !534, file: !535, line: 256, baseType: !386, size: 64, align: 64, offset: 576)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !534, file: !535, line: 257, baseType: !386, size: 64, align: 64, offset: 640)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !534, file: !535, line: 258, baseType: !386, size: 64, align: 64, offset: 704)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !534, file: !535, line: 260, baseType: !550, size: 64, align: 64, offset: 768)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !535, line: 156, size: 192, align: 64, elements: !552)
!552 = !{!553, !554, !556}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !551, file: !535, line: 157, baseType: !550, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !551, file: !535, line: 158, baseType: !555, size: 64, align: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !551, file: !535, line: 162, baseType: !407, size: 32, align: 32, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !534, file: !535, line: 262, baseType: !555, size: 64, align: 64, offset: 832)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !534, file: !535, line: 264, baseType: !407, size: 32, align: 32, offset: 896)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !534, file: !535, line: 268, baseType: !407, size: 32, align: 32, offset: 928)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !534, file: !535, line: 270, baseType: !561, size: 64, align: 64, offset: 960)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !562, line: 131, baseType: !563)
!562 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!563 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !534, file: !535, line: 274, baseType: !384, size: 16, align: 16, offset: 1024)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !534, file: !535, line: 275, baseType: !566, size: 8, align: 8, offset: 1040)
!566 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !534, file: !535, line: 276, baseType: !568, size: 8, align: 8, offset: 1048)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 8, align: 8, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 1)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !534, file: !535, line: 280, baseType: !572, size: 64, align: 64, offset: 1088)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !535, line: 150, baseType: null)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !534, file: !535, line: 289, baseType: !575, size: 64, align: 64, offset: 1152)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !562, line: 132, baseType: !563)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !534, file: !535, line: 297, baseType: !388, size: 64, align: 64, offset: 1216)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !534, file: !535, line: 298, baseType: !388, size: 64, align: 64, offset: 1280)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !534, file: !535, line: 299, baseType: !388, size: 64, align: 64, offset: 1344)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !534, file: !535, line: 300, baseType: !388, size: 64, align: 64, offset: 1408)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !534, file: !535, line: 302, baseType: !404, size: 64, align: 64, offset: 1472)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !534, file: !535, line: 303, baseType: !407, size: 32, align: 32, offset: 1536)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !534, file: !535, line: 305, baseType: !583, size: 160, align: 8, offset: 1568)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 160, align: 8, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 20)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !481, file: !4, line: 127, baseType: !484, size: 64, align: 64, offset: 704)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !481, file: !4, line: 128, baseType: !588, size: 64, align: 64, offset: 768)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64, align: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !4, line: 128, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !481, file: !4, line: 129, baseType: !591, size: 64, align: 64, offset: 832)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !4, line: 109, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !4, line: 102, size: 448, align: 64, elements: !594)
!594 = !{!595, !596, !597, !598, !599}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !593, file: !4, line: 103, baseType: !472, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !593, file: !4, line: 104, baseType: !472, size: 64, align: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !593, file: !4, line: 105, baseType: !406, size: 64, align: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !593, file: !4, line: 106, baseType: !407, size: 32, align: 32, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !593, file: !4, line: 108, baseType: !600, size: 192, align: 64, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !485, line: 104, baseType: !490)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !481, file: !4, line: 130, baseType: !391, size: 32, align: 32, offset: 896)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !481, file: !4, line: 131, baseType: !391, size: 32, align: 32, offset: 928)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !481, file: !4, line: 132, baseType: !407, size: 32, align: 32, offset: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !481, file: !4, line: 135, baseType: !407, size: 32, align: 32, offset: 992)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !481, file: !4, line: 136, baseType: !472, size: 64, align: 64, offset: 1024)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !481, file: !4, line: 146, baseType: !406, size: 64, align: 64, offset: 1088)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !481, file: !4, line: 147, baseType: !406, size: 64, align: 64, offset: 1152)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !481, file: !4, line: 148, baseType: !609, size: 8, align: 8, offset: 1216)
!609 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !474, file: !4, line: 82, baseType: !611, size: 64, align: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!407, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !474, file: !4, line: 83, baseType: !388, size: 64, align: 64, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !474, file: !4, line: 84, baseType: !617, size: 128, align: 64, offset: 320)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !618, line: 31, baseType: !619)
!618 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !620, line: 30, size: 128, align: 64, elements: !621)
!620 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!621 = !{!622, !624}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !619, file: !620, line: 32, baseType: !623, size: 64, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !562, line: 139, baseType: !563)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !619, file: !620, line: 33, baseType: !625, size: 64, align: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !562, line: 141, baseType: !563)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !474, file: !4, line: 92, baseType: !627, size: 64, align: 32, offset: 448)
!627 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !474, file: !4, line: 85, size: 64, align: 32, elements: !628)
!628 = !{!629, !630, !631}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !627, file: !4, line: 86, baseType: !407, size: 32, align: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !627, file: !4, line: 87, baseType: !407, size: 32, align: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !627, file: !4, line: 91, baseType: !632, size: 64, align: 32)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !627, file: !4, line: 88, size: 64, align: 32, elements: !633)
!633 = !{!634, !637}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !632, file: !4, line: 89, baseType: !635, size: 32, align: 32)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !454, line: 98, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !562, line: 133, baseType: !407)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !632, file: !4, line: 90, baseType: !407, size: 32, align: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !474, file: !4, line: 93, baseType: !639, size: 64, align: 64, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, scope: !474, file: !4, line: 95, baseType: !641, size: 192, align: 64, offset: 576)
!641 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !474, file: !4, line: 95, size: 192, align: 64, elements: !642)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !641, file: !4, line: 96, baseType: !600, size: 192, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !641, file: !4, line: 97, baseType: !499, size: 128, align: 64)
!645 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !233, line: 150, type: !509, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!646 = distinct !DIGlobalVariable(name: "netlink_error_ignore", scope: !0, file: !459, line: 96, type: !407, isLocal: false, isDefinition: true, variable: i32* @netlink_error_ignore)
!647 = distinct !DIGlobalVariable(name: "nlmsg_buf_size", scope: !0, file: !459, line: 101, type: !407, isLocal: true, isDefinition: true, variable: i32* @nlmsg_buf_size)
!648 = distinct !DIGlobalVariable(name: "nl_kernel", scope: !0, file: !459, line: 100, type: !460, isLocal: true, isDefinition: true, variable: %struct._nl_handle* @nl_kernel)
!649 = !{i32 2, !"Dwarf Version", i32 4}
!650 = !{i32 2, !"Debug Info Version", i32 3}
!651 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!652 = distinct !DISubprogram(name: "netlink_set_recv_buf_size", scope: !459, file: !459, line: 451, type: !653, isLocal: false, isDefinition: true, scopeLine: 452, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!653 = !DISubroutineType(types: !654)
!654 = !{null}
!655 = !{}
!656 = !DILocation(line: 461, column: 19, scope: !652)
!657 = !DILocation(line: 461, column: 17, scope: !652)
!658 = !DILocation(line: 462, column: 6, scope: !659)
!659 = distinct !DILexicalBlock(scope: !652, file: !459, line: 462, column: 6)
!660 = !DILocation(line: 462, column: 21, scope: !659)
!661 = !DILocation(line: 462, column: 6, scope: !652)
!662 = !DILocation(line: 463, column: 18, scope: !659)
!663 = !DILocation(line: 463, column: 3, scope: !659)
!664 = !DILocation(line: 464, column: 1, scope: !652)
!665 = distinct !DISubprogram(name: "set_extra_netlink_monitoring", scope: !459, file: !459, line: 539, type: !666, isLocal: false, isDefinition: true, scopeLine: 540, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !609, !609, !609, !609}
!668 = !DILocalVariable(name: "ipv4_routes", arg: 1, scope: !665, file: !459, line: 539, type: !609)
!669 = !DIExpression()
!670 = !DILocation(line: 539, column: 34, scope: !665)
!671 = !DILocalVariable(name: "ipv6_routes", arg: 2, scope: !665, file: !459, line: 539, type: !609)
!672 = !DILocation(line: 539, column: 52, scope: !665)
!673 = !DILocalVariable(name: "ipv4_rules", arg: 3, scope: !665, file: !459, line: 539, type: !609)
!674 = !DILocation(line: 539, column: 70, scope: !665)
!675 = !DILocalVariable(name: "ipv6_rules", arg: 4, scope: !665, file: !459, line: 539, type: !609)
!676 = !DILocation(line: 539, column: 87, scope: !665)
!677 = !DILocation(line: 541, column: 51, scope: !665)
!678 = !DILocation(line: 541, column: 2, scope: !665)
!679 = !DILocation(line: 542, column: 51, scope: !665)
!680 = !DILocation(line: 542, column: 2, scope: !665)
!681 = !DILocation(line: 543, column: 50, scope: !665)
!682 = !DILocation(line: 543, column: 2, scope: !665)
!683 = !DILocation(line: 544, column: 50, scope: !665)
!684 = !DILocation(line: 544, column: 2, scope: !665)
!685 = !DILocation(line: 545, column: 1, scope: !665)
!686 = distinct !DISubprogram(name: "kernel_netlink_set_membership", scope: !459, file: !459, line: 505, type: !687, isLocal: true, isDefinition: true, scopeLine: 506, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !407, !609}
!689 = !DILocalVariable(name: "group", arg: 1, scope: !686, file: !459, line: 505, type: !407)
!690 = !DILocation(line: 505, column: 35, scope: !686)
!691 = !DILocalVariable(name: "add", arg: 2, scope: !686, file: !459, line: 505, type: !609)
!692 = !DILocation(line: 505, column: 46, scope: !686)
!693 = !DILocalVariable(name: "ret", scope: !694, file: !459, line: 512, type: !407)
!694 = distinct !DILexicalBlock(scope: !686, file: !459, line: 511, column: 2)
!695 = !DILocation(line: 512, column: 7, scope: !694)
!696 = !DILocation(line: 514, column: 7, scope: !697)
!697 = distinct !DILexicalBlock(scope: !694, file: !459, line: 514, column: 7)
!698 = !DILocation(line: 514, column: 7, scope: !694)
!699 = !DILocation(line: 515, column: 45, scope: !697)
!700 = !DILocation(line: 515, column: 49, scope: !697)
!701 = !DILocation(line: 515, column: 10, scope: !697)
!702 = !DILocation(line: 515, column: 8, scope: !697)
!703 = !DILocation(line: 515, column: 4, scope: !697)
!704 = !DILocation(line: 517, column: 46, scope: !697)
!705 = !DILocation(line: 517, column: 50, scope: !697)
!706 = !DILocation(line: 517, column: 10, scope: !697)
!707 = !DILocation(line: 517, column: 8, scope: !697)
!708 = !DILocation(line: 518, column: 7, scope: !709)
!709 = distinct !DILexicalBlock(scope: !694, file: !459, line: 518, column: 7)
!710 = !DILocation(line: 518, column: 7, scope: !694)
!711 = !DILocation(line: 519, column: 78, scope: !712)
!712 = distinct !DILexicalBlock(scope: !709, file: !459, line: 518, column: 12)
!713 = !DILocation(line: 519, column: 85, scope: !712)
!714 = !DILocation(line: 519, column: 4, scope: !712)
!715 = !DILocation(line: 520, column: 4, scope: !712)
!716 = !DILocation(line: 536, column: 1, scope: !686)
!717 = distinct !DISubprogram(name: "addattr_l", scope: !459, file: !459, line: 770, type: !718, isLocal: false, isDefinition: true, scopeLine: 771, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!718 = !DISubroutineType(types: !719)
!719 = !{!407, !392, !404, !384, !388, !404}
!720 = !DILocalVariable(name: "n", arg: 1, scope: !717, file: !459, line: 770, type: !392)
!721 = !DILocation(line: 770, column: 28, scope: !717)
!722 = !DILocalVariable(name: "maxlen", arg: 2, scope: !717, file: !459, line: 770, type: !404)
!723 = !DILocation(line: 770, column: 38, scope: !717)
!724 = !DILocalVariable(name: "type", arg: 3, scope: !717, file: !459, line: 770, type: !384)
!725 = !DILocation(line: 770, column: 61, scope: !717)
!726 = !DILocalVariable(name: "data", arg: 4, scope: !717, file: !459, line: 770, type: !388)
!727 = !DILocation(line: 770, column: 73, scope: !717)
!728 = !DILocalVariable(name: "alen", arg: 5, scope: !717, file: !459, line: 770, type: !404)
!729 = !DILocation(line: 770, column: 86, scope: !717)
!730 = !DILocalVariable(name: "len", scope: !717, file: !459, line: 772, type: !404)
!731 = !DILocation(line: 772, column: 9, scope: !717)
!732 = !DILocation(line: 772, column: 14, scope: !717)
!733 = !DILocation(line: 772, column: 62, scope: !717)
!734 = !DILocalVariable(name: "align_len", scope: !717, file: !459, line: 773, type: !404)
!735 = !DILocation(line: 773, column: 9, scope: !717)
!736 = !DILocation(line: 773, column: 20, scope: !717)
!737 = !DILocation(line: 773, column: 21, scope: !717)
!738 = !DILocation(line: 773, column: 25, scope: !717)
!739 = !DILocation(line: 773, column: 29, scope: !717)
!740 = !DILocalVariable(name: "rta", scope: !717, file: !459, line: 774, type: !380)
!741 = !DILocation(line: 774, column: 17, scope: !717)
!742 = !DILocation(line: 776, column: 6, scope: !743)
!743 = distinct !DILexicalBlock(scope: !717, file: !459, line: 776, column: 6)
!744 = !DILocation(line: 776, column: 9, scope: !743)
!745 = !DILocation(line: 776, column: 21, scope: !743)
!746 = !DILocation(line: 776, column: 19, scope: !743)
!747 = !DILocation(line: 776, column: 33, scope: !743)
!748 = !DILocation(line: 776, column: 31, scope: !743)
!749 = !DILocation(line: 776, column: 6, scope: !717)
!750 = !DILocation(line: 777, column: 3, scope: !743)
!751 = !DILocation(line: 779, column: 37, scope: !717)
!752 = !DILocation(line: 779, column: 28, scope: !717)
!753 = !DILocation(line: 779, column: 42, scope: !717)
!754 = !DILocation(line: 779, column: 45, scope: !717)
!755 = !DILocation(line: 779, column: 40, scope: !717)
!756 = !DILocation(line: 779, column: 8, scope: !717)
!757 = !DILocation(line: 779, column: 6, scope: !717)
!758 = !DILocation(line: 780, column: 18, scope: !717)
!759 = !DILocation(line: 780, column: 2, scope: !717)
!760 = !DILocation(line: 780, column: 7, scope: !717)
!761 = !DILocation(line: 780, column: 16, scope: !717)
!762 = !DILocation(line: 781, column: 33, scope: !717)
!763 = !DILocation(line: 781, column: 17, scope: !717)
!764 = !DILocation(line: 781, column: 2, scope: !717)
!765 = !DILocation(line: 781, column: 7, scope: !717)
!766 = !DILocation(line: 781, column: 15, scope: !717)
!767 = !DILocation(line: 782, column: 8, scope: !717)
!768 = !DILocation(line: 782, column: 18, scope: !717)
!769 = !DILocation(line: 782, column: 11, scope: !717)
!770 = !DILocation(line: 782, column: 23, scope: !717)
!771 = !DILocation(line: 782, column: 29, scope: !717)
!772 = !DILocation(line: 782, column: 2, scope: !717)
!773 = !DILocation(line: 783, column: 28, scope: !717)
!774 = !DILocation(line: 783, column: 18, scope: !717)
!775 = !DILocation(line: 783, column: 2, scope: !717)
!776 = !DILocation(line: 783, column: 5, scope: !717)
!777 = !DILocation(line: 783, column: 15, scope: !717)
!778 = !DILocation(line: 785, column: 2, scope: !717)
!779 = !DILocation(line: 786, column: 1, scope: !717)
!780 = distinct !DISubprogram(name: "addattr8", scope: !459, file: !459, line: 790, type: !781, isLocal: false, isDefinition: true, scopeLine: 791, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!781 = !DISubroutineType(types: !782)
!782 = !{!407, !392, !404, !384, !434}
!783 = !DILocalVariable(name: "n", arg: 1, scope: !780, file: !459, line: 790, type: !392)
!784 = !DILocation(line: 790, column: 27, scope: !780)
!785 = !DILocalVariable(name: "maxlen", arg: 2, scope: !780, file: !459, line: 790, type: !404)
!786 = !DILocation(line: 790, column: 37, scope: !780)
!787 = !DILocalVariable(name: "type", arg: 3, scope: !780, file: !459, line: 790, type: !384)
!788 = !DILocation(line: 790, column: 60, scope: !780)
!789 = !DILocalVariable(name: "data", arg: 4, scope: !780, file: !459, line: 790, type: !434)
!790 = !DILocation(line: 790, column: 74, scope: !780)
!791 = !DILocation(line: 792, column: 19, scope: !780)
!792 = !DILocation(line: 792, column: 22, scope: !780)
!793 = !DILocation(line: 792, column: 30, scope: !780)
!794 = !DILocation(line: 792, column: 9, scope: !780)
!795 = !DILocation(line: 792, column: 2, scope: !780)
!796 = distinct !DISubprogram(name: "addattr32", scope: !459, file: !459, line: 797, type: !797, isLocal: false, isDefinition: true, scopeLine: 798, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!797 = !DISubroutineType(types: !798)
!798 = !{!407, !392, !404, !384, !389}
!799 = !DILocalVariable(name: "n", arg: 1, scope: !796, file: !459, line: 797, type: !392)
!800 = !DILocation(line: 797, column: 28, scope: !796)
!801 = !DILocalVariable(name: "maxlen", arg: 2, scope: !796, file: !459, line: 797, type: !404)
!802 = !DILocation(line: 797, column: 38, scope: !796)
!803 = !DILocalVariable(name: "type", arg: 3, scope: !796, file: !459, line: 797, type: !384)
!804 = !DILocation(line: 797, column: 61, scope: !796)
!805 = !DILocalVariable(name: "data", arg: 4, scope: !796, file: !459, line: 797, type: !389)
!806 = !DILocation(line: 797, column: 76, scope: !796)
!807 = !DILocation(line: 799, column: 19, scope: !796)
!808 = !DILocation(line: 799, column: 22, scope: !796)
!809 = !DILocation(line: 799, column: 30, scope: !796)
!810 = !DILocation(line: 799, column: 36, scope: !796)
!811 = !DILocation(line: 799, column: 9, scope: !796)
!812 = !DILocation(line: 799, column: 2, scope: !796)
!813 = distinct !DISubprogram(name: "addattr64", scope: !459, file: !459, line: 804, type: !814, isLocal: false, isDefinition: true, scopeLine: 805, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!814 = !DISubroutineType(types: !815)
!815 = !{!407, !392, !404, !384, !456}
!816 = !DILocalVariable(name: "n", arg: 1, scope: !813, file: !459, line: 804, type: !392)
!817 = !DILocation(line: 804, column: 28, scope: !813)
!818 = !DILocalVariable(name: "maxlen", arg: 2, scope: !813, file: !459, line: 804, type: !404)
!819 = !DILocation(line: 804, column: 38, scope: !813)
!820 = !DILocalVariable(name: "type", arg: 3, scope: !813, file: !459, line: 804, type: !384)
!821 = !DILocation(line: 804, column: 61, scope: !813)
!822 = !DILocalVariable(name: "data", arg: 4, scope: !813, file: !459, line: 804, type: !456)
!823 = !DILocation(line: 804, column: 76, scope: !813)
!824 = !DILocation(line: 806, column: 19, scope: !813)
!825 = !DILocation(line: 806, column: 22, scope: !813)
!826 = !DILocation(line: 806, column: 30, scope: !813)
!827 = !DILocation(line: 806, column: 36, scope: !813)
!828 = !DILocation(line: 806, column: 9, scope: !813)
!829 = !DILocation(line: 806, column: 2, scope: !813)
!830 = distinct !DISubprogram(name: "addattr_l2", scope: !459, file: !459, line: 810, type: !831, isLocal: false, isDefinition: true, scopeLine: 811, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!831 = !DISubroutineType(types: !832)
!832 = !{!407, !392, !404, !384, !388, !404, !388, !404}
!833 = !DILocalVariable(name: "n", arg: 1, scope: !830, file: !459, line: 810, type: !392)
!834 = !DILocation(line: 810, column: 29, scope: !830)
!835 = !DILocalVariable(name: "maxlen", arg: 2, scope: !830, file: !459, line: 810, type: !404)
!836 = !DILocation(line: 810, column: 39, scope: !830)
!837 = !DILocalVariable(name: "type", arg: 3, scope: !830, file: !459, line: 810, type: !384)
!838 = !DILocation(line: 810, column: 62, scope: !830)
!839 = !DILocalVariable(name: "data", arg: 4, scope: !830, file: !459, line: 810, type: !388)
!840 = !DILocation(line: 810, column: 74, scope: !830)
!841 = !DILocalVariable(name: "alen", arg: 5, scope: !830, file: !459, line: 810, type: !404)
!842 = !DILocation(line: 810, column: 87, scope: !830)
!843 = !DILocalVariable(name: "data2", arg: 6, scope: !830, file: !459, line: 810, type: !388)
!844 = !DILocation(line: 810, column: 99, scope: !830)
!845 = !DILocalVariable(name: "alen2", arg: 7, scope: !830, file: !459, line: 810, type: !404)
!846 = !DILocation(line: 810, column: 113, scope: !830)
!847 = !DILocalVariable(name: "len", scope: !830, file: !459, line: 812, type: !404)
!848 = !DILocation(line: 812, column: 9, scope: !830)
!849 = !DILocation(line: 812, column: 14, scope: !830)
!850 = !DILocation(line: 812, column: 21, scope: !830)
!851 = !DILocation(line: 812, column: 19, scope: !830)
!852 = !DILocation(line: 812, column: 62, scope: !830)
!853 = !DILocalVariable(name: "align_len", scope: !830, file: !459, line: 813, type: !404)
!854 = !DILocation(line: 813, column: 9, scope: !830)
!855 = !DILocation(line: 813, column: 20, scope: !830)
!856 = !DILocation(line: 813, column: 21, scope: !830)
!857 = !DILocation(line: 813, column: 25, scope: !830)
!858 = !DILocation(line: 813, column: 29, scope: !830)
!859 = !DILocalVariable(name: "rta", scope: !830, file: !459, line: 814, type: !380)
!860 = !DILocation(line: 814, column: 17, scope: !830)
!861 = !DILocation(line: 816, column: 6, scope: !862)
!862 = distinct !DILexicalBlock(scope: !830, file: !459, line: 816, column: 6)
!863 = !DILocation(line: 816, column: 9, scope: !862)
!864 = !DILocation(line: 816, column: 21, scope: !862)
!865 = !DILocation(line: 816, column: 19, scope: !862)
!866 = !DILocation(line: 816, column: 33, scope: !862)
!867 = !DILocation(line: 816, column: 31, scope: !862)
!868 = !DILocation(line: 816, column: 6, scope: !830)
!869 = !DILocation(line: 817, column: 3, scope: !862)
!870 = !DILocation(line: 819, column: 37, scope: !830)
!871 = !DILocation(line: 819, column: 28, scope: !830)
!872 = !DILocation(line: 819, column: 42, scope: !830)
!873 = !DILocation(line: 819, column: 45, scope: !830)
!874 = !DILocation(line: 819, column: 40, scope: !830)
!875 = !DILocation(line: 819, column: 8, scope: !830)
!876 = !DILocation(line: 819, column: 6, scope: !830)
!877 = !DILocation(line: 820, column: 18, scope: !830)
!878 = !DILocation(line: 820, column: 2, scope: !830)
!879 = !DILocation(line: 820, column: 7, scope: !830)
!880 = !DILocation(line: 820, column: 16, scope: !830)
!881 = !DILocation(line: 821, column: 33, scope: !830)
!882 = !DILocation(line: 821, column: 17, scope: !830)
!883 = !DILocation(line: 821, column: 2, scope: !830)
!884 = !DILocation(line: 821, column: 7, scope: !830)
!885 = !DILocation(line: 821, column: 15, scope: !830)
!886 = !DILocation(line: 822, column: 8, scope: !830)
!887 = !DILocation(line: 822, column: 18, scope: !830)
!888 = !DILocation(line: 822, column: 11, scope: !830)
!889 = !DILocation(line: 822, column: 23, scope: !830)
!890 = !DILocation(line: 822, column: 29, scope: !830)
!891 = !DILocation(line: 822, column: 2, scope: !830)
!892 = !DILocation(line: 823, column: 8, scope: !830)
!893 = !DILocation(line: 823, column: 18, scope: !830)
!894 = !DILocation(line: 823, column: 11, scope: !830)
!895 = !DILocation(line: 823, column: 24, scope: !830)
!896 = !DILocation(line: 823, column: 22, scope: !830)
!897 = !DILocation(line: 823, column: 30, scope: !830)
!898 = !DILocation(line: 823, column: 37, scope: !830)
!899 = !DILocation(line: 823, column: 2, scope: !830)
!900 = !DILocation(line: 824, column: 28, scope: !830)
!901 = !DILocation(line: 824, column: 18, scope: !830)
!902 = !DILocation(line: 824, column: 2, scope: !830)
!903 = !DILocation(line: 824, column: 5, scope: !830)
!904 = !DILocation(line: 824, column: 15, scope: !830)
!905 = !DILocation(line: 826, column: 2, scope: !830)
!906 = !DILocation(line: 827, column: 1, scope: !830)
!907 = distinct !DISubprogram(name: "addraw_l", scope: !459, file: !459, line: 830, type: !908, isLocal: false, isDefinition: true, scopeLine: 831, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!908 = !DISubroutineType(types: !909)
!909 = !{!407, !392, !404, !910, !404}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!912 = !DILocalVariable(name: "n", arg: 1, scope: !907, file: !459, line: 830, type: !392)
!913 = !DILocation(line: 830, column: 27, scope: !907)
!914 = !DILocalVariable(name: "maxlen", arg: 2, scope: !907, file: !459, line: 830, type: !404)
!915 = !DILocation(line: 830, column: 37, scope: !907)
!916 = !DILocalVariable(name: "data", arg: 3, scope: !907, file: !459, line: 830, type: !910)
!917 = !DILocation(line: 830, column: 57, scope: !907)
!918 = !DILocalVariable(name: "len", arg: 4, scope: !907, file: !459, line: 830, type: !404)
!919 = !DILocation(line: 830, column: 70, scope: !907)
!920 = !DILocalVariable(name: "align_len", scope: !907, file: !459, line: 832, type: !404)
!921 = !DILocation(line: 832, column: 9, scope: !907)
!922 = !DILocation(line: 832, column: 20, scope: !907)
!923 = !DILocation(line: 832, column: 21, scope: !907)
!924 = !DILocation(line: 832, column: 25, scope: !907)
!925 = !DILocation(line: 832, column: 29, scope: !907)
!926 = !DILocation(line: 834, column: 6, scope: !927)
!927 = distinct !DILexicalBlock(scope: !907, file: !459, line: 834, column: 6)
!928 = !DILocation(line: 834, column: 9, scope: !927)
!929 = !DILocation(line: 834, column: 21, scope: !927)
!930 = !DILocation(line: 834, column: 19, scope: !927)
!931 = !DILocation(line: 834, column: 33, scope: !927)
!932 = !DILocation(line: 834, column: 31, scope: !927)
!933 = !DILocation(line: 834, column: 6, scope: !907)
!934 = !DILocation(line: 835, column: 3, scope: !927)
!935 = !DILocation(line: 837, column: 8, scope: !907)
!936 = !DILocation(line: 837, column: 10, scope: !907)
!937 = !DILocation(line: 837, column: 11, scope: !907)
!938 = !DILocation(line: 837, column: 21, scope: !907)
!939 = !DILocation(line: 837, column: 25, scope: !907)
!940 = !DILocation(line: 837, column: 29, scope: !907)
!941 = !DILocation(line: 837, column: 23, scope: !907)
!942 = !DILocation(line: 837, column: 2, scope: !907)
!943 = !DILocation(line: 838, column: 17, scope: !907)
!944 = !DILocation(line: 838, column: 19, scope: !907)
!945 = !DILocation(line: 838, column: 20, scope: !907)
!946 = !DILocation(line: 838, column: 30, scope: !907)
!947 = !DILocation(line: 838, column: 34, scope: !907)
!948 = !DILocation(line: 838, column: 38, scope: !907)
!949 = !DILocation(line: 838, column: 33, scope: !907)
!950 = !DILocation(line: 838, column: 31, scope: !907)
!951 = !DILocation(line: 838, column: 41, scope: !907)
!952 = !DILocation(line: 838, column: 53, scope: !907)
!953 = !DILocation(line: 838, column: 51, scope: !907)
!954 = !DILocation(line: 838, column: 2, scope: !907)
!955 = !DILocation(line: 839, column: 28, scope: !907)
!956 = !DILocation(line: 839, column: 18, scope: !907)
!957 = !DILocation(line: 839, column: 2, scope: !907)
!958 = !DILocation(line: 839, column: 5, scope: !907)
!959 = !DILocation(line: 839, column: 15, scope: !907)
!960 = !DILocation(line: 840, column: 2, scope: !907)
!961 = !DILocation(line: 841, column: 1, scope: !907)
!962 = distinct !DISubprogram(name: "rta_addattr_l", scope: !459, file: !459, line: 844, type: !963, isLocal: false, isDefinition: true, scopeLine: 846, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!963 = !DISubroutineType(types: !964)
!964 = !{!404, !380, !404, !384, !910, !404}
!965 = !DILocalVariable(name: "rta", arg: 1, scope: !962, file: !459, line: 844, type: !380)
!966 = !DILocation(line: 844, column: 30, scope: !962)
!967 = !DILocalVariable(name: "maxlen", arg: 2, scope: !962, file: !459, line: 844, type: !404)
!968 = !DILocation(line: 844, column: 42, scope: !962)
!969 = !DILocalVariable(name: "type", arg: 3, scope: !962, file: !459, line: 844, type: !384)
!970 = !DILocation(line: 844, column: 65, scope: !962)
!971 = !DILocalVariable(name: "data", arg: 4, scope: !962, file: !459, line: 845, type: !910)
!972 = !DILocation(line: 845, column: 17, scope: !962)
!973 = !DILocalVariable(name: "alen", arg: 5, scope: !962, file: !459, line: 845, type: !404)
!974 = !DILocation(line: 845, column: 30, scope: !962)
!975 = !DILocalVariable(name: "subrta", scope: !962, file: !459, line: 847, type: !380)
!976 = !DILocation(line: 847, column: 17, scope: !962)
!977 = !DILocalVariable(name: "len", scope: !962, file: !459, line: 848, type: !404)
!978 = !DILocation(line: 848, column: 9, scope: !962)
!979 = !DILocation(line: 848, column: 14, scope: !962)
!980 = !DILocation(line: 848, column: 62, scope: !962)
!981 = !DILocalVariable(name: "align_len", scope: !962, file: !459, line: 849, type: !404)
!982 = !DILocation(line: 849, column: 9, scope: !962)
!983 = !DILocation(line: 849, column: 20, scope: !962)
!984 = !DILocation(line: 849, column: 21, scope: !962)
!985 = !DILocation(line: 849, column: 25, scope: !962)
!986 = !DILocation(line: 849, column: 29, scope: !962)
!987 = !DILocation(line: 851, column: 6, scope: !988)
!988 = distinct !DILexicalBlock(scope: !962, file: !459, line: 851, column: 6)
!989 = !DILocation(line: 851, column: 11, scope: !988)
!990 = !DILocation(line: 851, column: 21, scope: !988)
!991 = !DILocation(line: 851, column: 19, scope: !988)
!992 = !DILocation(line: 851, column: 33, scope: !988)
!993 = !DILocation(line: 851, column: 31, scope: !988)
!994 = !DILocation(line: 851, column: 6, scope: !962)
!995 = !DILocation(line: 852, column: 3, scope: !988)
!996 = !DILocation(line: 854, column: 36, scope: !962)
!997 = !DILocation(line: 854, column: 29, scope: !962)
!998 = !DILocation(line: 854, column: 43, scope: !962)
!999 = !DILocation(line: 854, column: 48, scope: !962)
!1000 = !DILocation(line: 854, column: 41, scope: !962)
!1001 = !DILocation(line: 854, column: 11, scope: !962)
!1002 = !DILocation(line: 854, column: 9, scope: !962)
!1003 = !DILocation(line: 855, column: 21, scope: !962)
!1004 = !DILocation(line: 855, column: 2, scope: !962)
!1005 = !DILocation(line: 855, column: 10, scope: !962)
!1006 = !DILocation(line: 855, column: 19, scope: !962)
!1007 = !DILocation(line: 856, column: 36, scope: !962)
!1008 = !DILocation(line: 856, column: 20, scope: !962)
!1009 = !DILocation(line: 856, column: 2, scope: !962)
!1010 = !DILocation(line: 856, column: 10, scope: !962)
!1011 = !DILocation(line: 856, column: 18, scope: !962)
!1012 = !DILocation(line: 857, column: 8, scope: !962)
!1013 = !DILocation(line: 857, column: 18, scope: !962)
!1014 = !DILocation(line: 857, column: 11, scope: !962)
!1015 = !DILocation(line: 857, column: 26, scope: !962)
!1016 = !DILocation(line: 857, column: 32, scope: !962)
!1017 = !DILocation(line: 857, column: 2, scope: !962)
!1018 = !DILocation(line: 858, column: 34, scope: !962)
!1019 = !DILocation(line: 858, column: 39, scope: !962)
!1020 = !DILocation(line: 858, column: 49, scope: !962)
!1021 = !DILocation(line: 858, column: 47, scope: !962)
!1022 = !DILocation(line: 858, column: 17, scope: !962)
!1023 = !DILocation(line: 858, column: 2, scope: !962)
!1024 = !DILocation(line: 858, column: 7, scope: !962)
!1025 = !DILocation(line: 858, column: 15, scope: !962)
!1026 = !DILocation(line: 859, column: 9, scope: !962)
!1027 = !DILocation(line: 859, column: 2, scope: !962)
!1028 = !DILocation(line: 860, column: 1, scope: !962)
!1029 = distinct !DISubprogram(name: "rta_addattr_l2", scope: !459, file: !459, line: 863, type: !1030, isLocal: false, isDefinition: true, scopeLine: 866, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!404, !380, !404, !384, !910, !404, !910, !404}
!1032 = !DILocalVariable(name: "rta", arg: 1, scope: !1029, file: !459, line: 863, type: !380)
!1033 = !DILocation(line: 863, column: 31, scope: !1029)
!1034 = !DILocalVariable(name: "maxlen", arg: 2, scope: !1029, file: !459, line: 863, type: !404)
!1035 = !DILocation(line: 863, column: 43, scope: !1029)
!1036 = !DILocalVariable(name: "type", arg: 3, scope: !1029, file: !459, line: 863, type: !384)
!1037 = !DILocation(line: 863, column: 66, scope: !1029)
!1038 = !DILocalVariable(name: "data", arg: 4, scope: !1029, file: !459, line: 864, type: !910)
!1039 = !DILocation(line: 864, column: 17, scope: !1029)
!1040 = !DILocalVariable(name: "alen", arg: 5, scope: !1029, file: !459, line: 864, type: !404)
!1041 = !DILocation(line: 864, column: 30, scope: !1029)
!1042 = !DILocalVariable(name: "data2", arg: 6, scope: !1029, file: !459, line: 865, type: !910)
!1043 = !DILocation(line: 865, column: 17, scope: !1029)
!1044 = !DILocalVariable(name: "alen2", arg: 7, scope: !1029, file: !459, line: 865, type: !404)
!1045 = !DILocation(line: 865, column: 31, scope: !1029)
!1046 = !DILocalVariable(name: "subrta", scope: !1029, file: !459, line: 867, type: !380)
!1047 = !DILocation(line: 867, column: 17, scope: !1029)
!1048 = !DILocalVariable(name: "len", scope: !1029, file: !459, line: 868, type: !404)
!1049 = !DILocation(line: 868, column: 9, scope: !1029)
!1050 = !DILocation(line: 868, column: 14, scope: !1029)
!1051 = !DILocation(line: 868, column: 21, scope: !1029)
!1052 = !DILocation(line: 868, column: 19, scope: !1029)
!1053 = !DILocation(line: 868, column: 62, scope: !1029)
!1054 = !DILocalVariable(name: "align_len", scope: !1029, file: !459, line: 869, type: !404)
!1055 = !DILocation(line: 869, column: 9, scope: !1029)
!1056 = !DILocation(line: 869, column: 20, scope: !1029)
!1057 = !DILocation(line: 869, column: 21, scope: !1029)
!1058 = !DILocation(line: 869, column: 25, scope: !1029)
!1059 = !DILocation(line: 869, column: 29, scope: !1029)
!1060 = !DILocation(line: 871, column: 6, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1029, file: !459, line: 871, column: 6)
!1062 = !DILocation(line: 871, column: 11, scope: !1061)
!1063 = !DILocation(line: 871, column: 21, scope: !1061)
!1064 = !DILocation(line: 871, column: 19, scope: !1061)
!1065 = !DILocation(line: 871, column: 33, scope: !1061)
!1066 = !DILocation(line: 871, column: 31, scope: !1061)
!1067 = !DILocation(line: 871, column: 6, scope: !1029)
!1068 = !DILocation(line: 872, column: 3, scope: !1061)
!1069 = !DILocation(line: 874, column: 36, scope: !1029)
!1070 = !DILocation(line: 874, column: 29, scope: !1029)
!1071 = !DILocation(line: 874, column: 43, scope: !1029)
!1072 = !DILocation(line: 874, column: 48, scope: !1029)
!1073 = !DILocation(line: 874, column: 41, scope: !1029)
!1074 = !DILocation(line: 874, column: 11, scope: !1029)
!1075 = !DILocation(line: 874, column: 9, scope: !1029)
!1076 = !DILocation(line: 875, column: 21, scope: !1029)
!1077 = !DILocation(line: 875, column: 2, scope: !1029)
!1078 = !DILocation(line: 875, column: 10, scope: !1029)
!1079 = !DILocation(line: 875, column: 19, scope: !1029)
!1080 = !DILocation(line: 876, column: 36, scope: !1029)
!1081 = !DILocation(line: 876, column: 20, scope: !1029)
!1082 = !DILocation(line: 876, column: 2, scope: !1029)
!1083 = !DILocation(line: 876, column: 10, scope: !1029)
!1084 = !DILocation(line: 876, column: 18, scope: !1029)
!1085 = !DILocation(line: 877, column: 8, scope: !1029)
!1086 = !DILocation(line: 877, column: 18, scope: !1029)
!1087 = !DILocation(line: 877, column: 11, scope: !1029)
!1088 = !DILocation(line: 877, column: 26, scope: !1029)
!1089 = !DILocation(line: 877, column: 32, scope: !1029)
!1090 = !DILocation(line: 877, column: 2, scope: !1029)
!1091 = !DILocation(line: 878, column: 8, scope: !1029)
!1092 = !DILocation(line: 878, column: 18, scope: !1029)
!1093 = !DILocation(line: 878, column: 11, scope: !1029)
!1094 = !DILocation(line: 878, column: 27, scope: !1029)
!1095 = !DILocation(line: 878, column: 25, scope: !1029)
!1096 = !DILocation(line: 878, column: 33, scope: !1029)
!1097 = !DILocation(line: 878, column: 40, scope: !1029)
!1098 = !DILocation(line: 878, column: 2, scope: !1029)
!1099 = !DILocation(line: 879, column: 34, scope: !1029)
!1100 = !DILocation(line: 879, column: 39, scope: !1029)
!1101 = !DILocation(line: 879, column: 49, scope: !1029)
!1102 = !DILocation(line: 879, column: 47, scope: !1029)
!1103 = !DILocation(line: 879, column: 17, scope: !1029)
!1104 = !DILocation(line: 879, column: 2, scope: !1029)
!1105 = !DILocation(line: 879, column: 7, scope: !1029)
!1106 = !DILocation(line: 879, column: 15, scope: !1029)
!1107 = !DILocation(line: 880, column: 9, scope: !1029)
!1108 = !DILocation(line: 880, column: 2, scope: !1029)
!1109 = !DILocation(line: 881, column: 1, scope: !1029)
!1110 = distinct !DISubprogram(name: "rta_addattr64", scope: !459, file: !459, line: 884, type: !1111, isLocal: false, isDefinition: true, scopeLine: 885, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!404, !380, !404, !384, !456}
!1113 = !DILocalVariable(name: "rta", arg: 1, scope: !1110, file: !459, line: 884, type: !380)
!1114 = !DILocation(line: 884, column: 30, scope: !1110)
!1115 = !DILocalVariable(name: "maxlen", arg: 2, scope: !1110, file: !459, line: 884, type: !404)
!1116 = !DILocation(line: 884, column: 42, scope: !1110)
!1117 = !DILocalVariable(name: "type", arg: 3, scope: !1110, file: !459, line: 884, type: !384)
!1118 = !DILocation(line: 884, column: 65, scope: !1110)
!1119 = !DILocalVariable(name: "data", arg: 4, scope: !1110, file: !459, line: 884, type: !456)
!1120 = !DILocation(line: 884, column: 80, scope: !1110)
!1121 = !DILocation(line: 886, column: 23, scope: !1110)
!1122 = !DILocation(line: 886, column: 28, scope: !1110)
!1123 = !DILocation(line: 886, column: 36, scope: !1110)
!1124 = !DILocation(line: 886, column: 42, scope: !1110)
!1125 = !DILocation(line: 886, column: 9, scope: !1110)
!1126 = !DILocation(line: 886, column: 2, scope: !1110)
!1127 = distinct !DISubprogram(name: "rta_addattr32", scope: !459, file: !459, line: 890, type: !1128, isLocal: false, isDefinition: true, scopeLine: 891, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!404, !380, !404, !384, !389}
!1130 = !DILocalVariable(name: "rta", arg: 1, scope: !1127, file: !459, line: 890, type: !380)
!1131 = !DILocation(line: 890, column: 30, scope: !1127)
!1132 = !DILocalVariable(name: "maxlen", arg: 2, scope: !1127, file: !459, line: 890, type: !404)
!1133 = !DILocation(line: 890, column: 42, scope: !1127)
!1134 = !DILocalVariable(name: "type", arg: 3, scope: !1127, file: !459, line: 890, type: !384)
!1135 = !DILocation(line: 890, column: 65, scope: !1127)
!1136 = !DILocalVariable(name: "data", arg: 4, scope: !1127, file: !459, line: 890, type: !389)
!1137 = !DILocation(line: 890, column: 80, scope: !1127)
!1138 = !DILocalVariable(name: "subrta", scope: !1127, file: !459, line: 892, type: !380)
!1139 = !DILocation(line: 892, column: 17, scope: !1127)
!1140 = !DILocalVariable(name: "len", scope: !1127, file: !459, line: 893, type: !404)
!1141 = !DILocation(line: 893, column: 9, scope: !1127)
!1142 = !DILocalVariable(name: "align_len", scope: !1127, file: !459, line: 894, type: !404)
!1143 = !DILocation(line: 894, column: 9, scope: !1127)
!1144 = !DILocation(line: 894, column: 20, scope: !1127)
!1145 = !DILocation(line: 894, column: 21, scope: !1127)
!1146 = !DILocation(line: 894, column: 25, scope: !1127)
!1147 = !DILocation(line: 894, column: 29, scope: !1127)
!1148 = !DILocation(line: 896, column: 6, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1127, file: !459, line: 896, column: 6)
!1150 = !DILocation(line: 896, column: 11, scope: !1149)
!1151 = !DILocation(line: 896, column: 21, scope: !1149)
!1152 = !DILocation(line: 896, column: 19, scope: !1149)
!1153 = !DILocation(line: 896, column: 33, scope: !1149)
!1154 = !DILocation(line: 896, column: 31, scope: !1149)
!1155 = !DILocation(line: 896, column: 6, scope: !1127)
!1156 = !DILocation(line: 897, column: 3, scope: !1149)
!1157 = !DILocation(line: 899, column: 36, scope: !1127)
!1158 = !DILocation(line: 899, column: 29, scope: !1127)
!1159 = !DILocation(line: 899, column: 43, scope: !1127)
!1160 = !DILocation(line: 899, column: 48, scope: !1127)
!1161 = !DILocation(line: 899, column: 41, scope: !1127)
!1162 = !DILocation(line: 899, column: 11, scope: !1127)
!1163 = !DILocation(line: 899, column: 9, scope: !1127)
!1164 = !DILocation(line: 900, column: 21, scope: !1127)
!1165 = !DILocation(line: 900, column: 2, scope: !1127)
!1166 = !DILocation(line: 900, column: 10, scope: !1127)
!1167 = !DILocation(line: 900, column: 19, scope: !1127)
!1168 = !DILocation(line: 901, column: 36, scope: !1127)
!1169 = !DILocation(line: 901, column: 20, scope: !1127)
!1170 = !DILocation(line: 901, column: 2, scope: !1127)
!1171 = !DILocation(line: 901, column: 10, scope: !1127)
!1172 = !DILocation(line: 901, column: 18, scope: !1127)
!1173 = !DILocation(line: 902, column: 8, scope: !1127)
!1174 = !DILocation(line: 902, column: 18, scope: !1127)
!1175 = !DILocation(line: 902, column: 11, scope: !1127)
!1176 = !DILocation(line: 902, column: 2, scope: !1127)
!1177 = !DILocation(line: 903, column: 34, scope: !1127)
!1178 = !DILocation(line: 903, column: 39, scope: !1127)
!1179 = !DILocation(line: 903, column: 49, scope: !1127)
!1180 = !DILocation(line: 903, column: 47, scope: !1127)
!1181 = !DILocation(line: 903, column: 17, scope: !1127)
!1182 = !DILocation(line: 903, column: 2, scope: !1127)
!1183 = !DILocation(line: 903, column: 7, scope: !1127)
!1184 = !DILocation(line: 903, column: 15, scope: !1127)
!1185 = !DILocation(line: 904, column: 9, scope: !1127)
!1186 = !DILocation(line: 904, column: 2, scope: !1127)
!1187 = !DILocation(line: 905, column: 1, scope: !1127)
!1188 = distinct !DISubprogram(name: "rta_addattr16", scope: !459, file: !459, line: 908, type: !1189, isLocal: false, isDefinition: true, scopeLine: 909, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{!404, !380, !404, !384, !440}
!1191 = !DILocalVariable(name: "rta", arg: 1, scope: !1188, file: !459, line: 908, type: !380)
!1192 = !DILocation(line: 908, column: 30, scope: !1188)
!1193 = !DILocalVariable(name: "maxlen", arg: 2, scope: !1188, file: !459, line: 908, type: !404)
!1194 = !DILocation(line: 908, column: 42, scope: !1188)
!1195 = !DILocalVariable(name: "type", arg: 3, scope: !1188, file: !459, line: 908, type: !384)
!1196 = !DILocation(line: 908, column: 65, scope: !1188)
!1197 = !DILocalVariable(name: "data", arg: 4, scope: !1188, file: !459, line: 908, type: !440)
!1198 = !DILocation(line: 908, column: 80, scope: !1188)
!1199 = !DILocation(line: 910, column: 23, scope: !1188)
!1200 = !DILocation(line: 910, column: 28, scope: !1188)
!1201 = !DILocation(line: 910, column: 36, scope: !1188)
!1202 = !DILocation(line: 910, column: 42, scope: !1188)
!1203 = !DILocation(line: 910, column: 9, scope: !1188)
!1204 = !DILocation(line: 910, column: 2, scope: !1188)
!1205 = distinct !DISubprogram(name: "rta_addattr8", scope: !459, file: !459, line: 914, type: !1206, isLocal: false, isDefinition: true, scopeLine: 915, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!404, !380, !404, !384, !434}
!1208 = !DILocalVariable(name: "rta", arg: 1, scope: !1205, file: !459, line: 914, type: !380)
!1209 = !DILocation(line: 914, column: 29, scope: !1205)
!1210 = !DILocalVariable(name: "maxlen", arg: 2, scope: !1205, file: !459, line: 914, type: !404)
!1211 = !DILocation(line: 914, column: 41, scope: !1205)
!1212 = !DILocalVariable(name: "type", arg: 3, scope: !1205, file: !459, line: 914, type: !384)
!1213 = !DILocation(line: 914, column: 64, scope: !1205)
!1214 = !DILocalVariable(name: "data", arg: 4, scope: !1205, file: !459, line: 914, type: !434)
!1215 = !DILocation(line: 914, column: 78, scope: !1205)
!1216 = !DILocation(line: 916, column: 23, scope: !1205)
!1217 = !DILocation(line: 916, column: 28, scope: !1205)
!1218 = !DILocation(line: 916, column: 36, scope: !1205)
!1219 = !DILocation(line: 916, column: 9, scope: !1205)
!1220 = !DILocation(line: 916, column: 2, scope: !1205)
!1221 = distinct !DISubprogram(name: "rta_nest", scope: !459, file: !459, line: 920, type: !1222, isLocal: false, isDefinition: true, scopeLine: 921, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!380, !380, !404, !384}
!1224 = !DILocalVariable(name: "rta", arg: 1, scope: !1221, file: !459, line: 920, type: !380)
!1225 = !DILocation(line: 920, column: 25, scope: !1221)
!1226 = !DILocalVariable(name: "maxlen", arg: 2, scope: !1221, file: !459, line: 920, type: !404)
!1227 = !DILocation(line: 920, column: 37, scope: !1221)
!1228 = !DILocalVariable(name: "type", arg: 3, scope: !1221, file: !459, line: 920, type: !384)
!1229 = !DILocation(line: 920, column: 60, scope: !1221)
!1230 = !DILocalVariable(name: "nest", scope: !1221, file: !459, line: 922, type: !380)
!1231 = !DILocation(line: 922, column: 17, scope: !1221)
!1232 = !DILocation(line: 922, column: 55, scope: !1221)
!1233 = !DILocation(line: 922, column: 45, scope: !1221)
!1234 = !DILocation(line: 922, column: 24, scope: !1221)
!1235 = !DILocation(line: 922, column: 30, scope: !1221)
!1236 = !DILocation(line: 922, column: 26, scope: !1221)
!1237 = !DILocation(line: 922, column: 28, scope: !1221)
!1238 = !DILocation(line: 922, column: 32, scope: !1221)
!1239 = !DILocation(line: 922, column: 61, scope: !1221)
!1240 = !DILocation(line: 922, column: 25, scope: !1221)
!1241 = !DILocation(line: 924, column: 16, scope: !1221)
!1242 = !DILocation(line: 924, column: 21, scope: !1221)
!1243 = !DILocation(line: 924, column: 29, scope: !1221)
!1244 = !DILocation(line: 924, column: 2, scope: !1221)
!1245 = !DILocation(line: 926, column: 9, scope: !1221)
!1246 = !DILocation(line: 926, column: 2, scope: !1221)
!1247 = distinct !DISubprogram(name: "rta_nest_end", scope: !459, file: !459, line: 930, type: !1248, isLocal: false, isDefinition: true, scopeLine: 931, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!404, !380, !380}
!1250 = !DILocalVariable(name: "rta", arg: 1, scope: !1247, file: !459, line: 930, type: !380)
!1251 = !DILocation(line: 930, column: 29, scope: !1247)
!1252 = !DILocalVariable(name: "nest", arg: 2, scope: !1247, file: !459, line: 930, type: !380)
!1253 = !DILocation(line: 930, column: 49, scope: !1247)
!1254 = !DILocation(line: 932, column: 74, scope: !1247)
!1255 = !DILocation(line: 932, column: 64, scope: !1247)
!1256 = !DILocation(line: 932, column: 43, scope: !1247)
!1257 = !DILocation(line: 932, column: 49, scope: !1247)
!1258 = !DILocation(line: 932, column: 45, scope: !1247)
!1259 = !DILocation(line: 932, column: 47, scope: !1247)
!1260 = !DILocation(line: 932, column: 51, scope: !1247)
!1261 = !DILocation(line: 932, column: 80, scope: !1247)
!1262 = !DILocation(line: 932, column: 44, scope: !1247)
!1263 = !DILocation(line: 932, column: 35, scope: !1247)
!1264 = !DILocation(line: 932, column: 55, scope: !1247)
!1265 = !DILocation(line: 932, column: 18, scope: !1247)
!1266 = !DILocation(line: 932, column: 2, scope: !1247)
!1267 = !DILocation(line: 932, column: 8, scope: !1247)
!1268 = !DILocation(line: 932, column: 16, scope: !1247)
!1269 = !DILocation(line: 934, column: 9, scope: !1247)
!1270 = !DILocation(line: 934, column: 14, scope: !1247)
!1271 = !DILocation(line: 934, column: 2, scope: !1247)
!1272 = distinct !DISubprogram(name: "netlink_talk", scope: !459, file: !459, line: 1427, type: !1273, isLocal: false, isDefinition: true, scopeLine: 1428, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!1275, !1277, !392}
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !454, line: 109, baseType: !1276)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !562, line: 172, baseType: !563)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!1278 = !DILocalVariable(name: "nl", arg: 1, scope: !1272, file: !459, line: 1427, type: !1277)
!1279 = !DILocation(line: 1427, column: 27, scope: !1272)
!1280 = !DILocalVariable(name: "n", arg: 2, scope: !1272, file: !459, line: 1427, type: !392)
!1281 = !DILocation(line: 1427, column: 48, scope: !1272)
!1282 = !DILocalVariable(name: "status", scope: !1272, file: !459, line: 1429, type: !1275)
!1283 = !DILocation(line: 1429, column: 10, scope: !1272)
!1284 = !DILocalVariable(name: "snl", scope: !1272, file: !459, line: 1430, type: !1285)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_nl", file: !394, line: 35, size: 96, align: 32, elements: !1286)
!1286 = !{!1287, !1290, !1291, !1292}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "nl_family", scope: !1285, file: !394, line: 36, baseType: !1288, size: 16, align: 16)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !1289, line: 11, baseType: !384)
!1289 = !DIFile(filename: "/usr/include/linux/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "nl_pad", scope: !1285, file: !394, line: 37, baseType: !384, size: 16, align: 16, offset: 16)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "nl_pid", scope: !1285, file: !394, line: 38, baseType: !397, size: 32, align: 32, offset: 32)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "nl_groups", scope: !1285, file: !394, line: 39, baseType: !397, size: 32, align: 32, offset: 64)
!1293 = !DILocation(line: 1430, column: 21, scope: !1272)
!1294 = !DILocalVariable(name: "iov", scope: !1272, file: !459, line: 1431, type: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !1296, line: 43, size: 128, align: 64, elements: !1297)
!1296 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/uio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!1297 = !{!1298, !1299}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !1295, file: !1296, line: 45, baseType: !388, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !1295, file: !1296, line: 46, baseType: !404, size: 64, align: 64, offset: 64)
!1300 = !DILocation(line: 1431, column: 15, scope: !1272)
!1301 = !DILocation(line: 1431, column: 21, scope: !1272)
!1302 = !DILocation(line: 1432, column: 15, scope: !1272)
!1303 = !DILocation(line: 1433, column: 14, scope: !1272)
!1304 = !DILocation(line: 1433, column: 17, scope: !1272)
!1305 = !DILocalVariable(name: "msg", scope: !1272, file: !459, line: 1435, type: !1306)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", file: !166, line: 228, size: 448, align: 64, elements: !1307)
!1307 = !{!1308, !1309, !1312, !1314, !1315, !1316, !1317}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !1306, file: !166, line: 230, baseType: !388, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !1306, file: !166, line: 231, baseType: !1310, size: 32, align: 32, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !166, line: 33, baseType: !1311)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !562, line: 189, baseType: !391)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !1306, file: !166, line: 233, baseType: !1313, size: 64, align: 64, offset: 128)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !1306, file: !166, line: 234, baseType: !404, size: 64, align: 64, offset: 192)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !1306, file: !166, line: 236, baseType: !388, size: 64, align: 64, offset: 256)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !1306, file: !166, line: 237, baseType: !404, size: 64, align: 64, offset: 320)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !1306, file: !166, line: 242, baseType: !407, size: 32, align: 32, offset: 384)
!1318 = !DILocation(line: 1435, column: 16, scope: !1272)
!1319 = !DILocation(line: 1435, column: 22, scope: !1272)
!1320 = !DILocation(line: 1436, column: 15, scope: !1272)
!1321 = !DILocation(line: 1445, column: 2, scope: !1272)
!1322 = !DILocation(line: 1446, column: 6, scope: !1272)
!1323 = !DILocation(line: 1446, column: 16, scope: !1272)
!1324 = !DILocation(line: 1448, column: 19, scope: !1272)
!1325 = !DILocation(line: 1448, column: 23, scope: !1272)
!1326 = !DILocation(line: 1448, column: 17, scope: !1272)
!1327 = !DILocation(line: 1448, column: 2, scope: !1272)
!1328 = !DILocation(line: 1448, column: 5, scope: !1272)
!1329 = !DILocation(line: 1448, column: 15, scope: !1272)
!1330 = !DILocation(line: 1451, column: 2, scope: !1272)
!1331 = !DILocation(line: 1451, column: 5, scope: !1272)
!1332 = !DILocation(line: 1451, column: 17, scope: !1272)
!1333 = !DILocation(line: 1458, column: 19, scope: !1272)
!1334 = !DILocation(line: 1458, column: 23, scope: !1272)
!1335 = !DILocation(line: 1458, column: 11, scope: !1272)
!1336 = !DILocation(line: 1458, column: 9, scope: !1272)
!1337 = !DILocation(line: 1459, column: 6, scope: !1338)
!1338 = distinct !DILexicalBlock(scope: !1272, file: !459, line: 1459, column: 6)
!1339 = !DILocation(line: 1459, column: 13, scope: !1338)
!1340 = !DILocation(line: 1459, column: 6, scope: !1272)
!1341 = !DILocation(line: 1460, column: 65, scope: !1342)
!1342 = distinct !DILexicalBlock(scope: !1338, file: !459, line: 1459, column: 18)
!1343 = !DILocation(line: 1460, column: 69, scope: !1342)
!1344 = !DILocation(line: 1460, column: 73, scope: !1342)
!1345 = !DILocation(line: 1460, column: 76, scope: !1342)
!1346 = !DILocation(line: 1461, column: 20, scope: !1342)
!1347 = !DILocation(line: 1461, column: 19, scope: !1342)
!1348 = !DILocation(line: 1461, column: 10, scope: !1349)
!1349 = !DILexicalBlockFile(scope: !1342, file: !459, discriminator: 1)
!1350 = !DILocation(line: 1460, column: 3, scope: !1342)
!1351 = !DILocation(line: 1462, column: 3, scope: !1342)
!1352 = !DILocation(line: 1465, column: 51, scope: !1272)
!1353 = !DILocation(line: 1465, column: 55, scope: !1272)
!1354 = !DILocation(line: 1465, column: 11, scope: !1272)
!1355 = !DILocation(line: 1465, column: 9, scope: !1272)
!1356 = !DILocation(line: 1482, column: 9, scope: !1272)
!1357 = !DILocation(line: 1482, column: 2, scope: !1272)
!1358 = !DILocation(line: 1483, column: 1, scope: !1272)
!1359 = distinct !DISubprogram(name: "netlink_parse_info", scope: !459, file: !459, line: 1273, type: !1360, isLocal: true, isDefinition: true, scopeLine: 1275, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !655)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{!407, !1362, !1277, !392, !609}
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{!407, !1365, !392}
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1366 = !DILocalVariable(name: "filter", arg: 1, scope: !1359, file: !459, line: 1273, type: !1362)
!1367 = !DILocation(line: 1273, column: 26, scope: !1359)
!1368 = !DILocalVariable(name: "nl", arg: 2, scope: !1359, file: !459, line: 1274, type: !1277)
!1369 = !DILocation(line: 1274, column: 19, scope: !1359)
!1370 = !DILocalVariable(name: "n", arg: 3, scope: !1359, file: !459, line: 1274, type: !392)
!1371 = !DILocation(line: 1274, column: 40, scope: !1359)
!1372 = !DILocalVariable(name: "read_all", arg: 4, scope: !1359, file: !459, line: 1274, type: !609)
!1373 = !DILocation(line: 1274, column: 47, scope: !1359)
!1374 = !DILocalVariable(name: "status", scope: !1359, file: !459, line: 1276, type: !1275)
!1375 = !DILocation(line: 1276, column: 10, scope: !1359)
!1376 = !DILocalVariable(name: "ret", scope: !1359, file: !459, line: 1277, type: !407)
!1377 = !DILocation(line: 1277, column: 6, scope: !1359)
!1378 = !DILocalVariable(name: "error", scope: !1359, file: !459, line: 1278, type: !407)
!1379 = !DILocation(line: 1278, column: 6, scope: !1359)
!1380 = !DILocation(line: 1280, column: 2, scope: !1359)
!1381 = !DILocation(line: 1281, column: 12, scope: !1382)
!1382 = distinct !DILexicalBlock(scope: !1359, file: !459, line: 1280, column: 14)
!1383 = !DILocation(line: 1281, column: 3, scope: !1382)
!1384 = !DILocalVariable(name: "buf", scope: !1382, file: !459, line: 1281, type: !1385)
!1385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, align: 8, elements: !1386)
!1386 = !{!1387}
!1387 = !DISubrange(count: -1)
!1388 = !DIExpression(DW_OP_deref)
!1389 = !DILocation(line: 1281, column: 8, scope: !1382)
!1390 = !DILocalVariable(name: "iov", scope: !1382, file: !459, line: 1282, type: !1295)
!1391 = !DILocation(line: 1282, column: 16, scope: !1382)
!1392 = !DILocation(line: 1282, column: 22, scope: !1382)
!1393 = !DILocalVariable(name: "snl", scope: !1382, file: !459, line: 1286, type: !1285)
!1394 = !DILocation(line: 1286, column: 22, scope: !1382)
!1395 = !DILocalVariable(name: "msg", scope: !1382, file: !459, line: 1287, type: !1306)
!1396 = !DILocation(line: 1287, column: 17, scope: !1382)
!1397 = !DILocation(line: 1287, column: 23, scope: !1382)
!1398 = !DILocation(line: 1288, column: 16, scope: !1382)
!1399 = !DILocalVariable(name: "h", scope: !1382, file: !459, line: 1296, type: !392)
!1400 = !DILocation(line: 1296, column: 20, scope: !1382)
!1401 = !DILocation(line: 1298, column: 20, scope: !1382)
!1402 = !DILocation(line: 1298, column: 24, scope: !1382)
!1403 = !DILocation(line: 1298, column: 12, scope: !1382)
!1404 = !DILocation(line: 1298, column: 10, scope: !1382)
!1405 = !DILocation(line: 1300, column: 7, scope: !1406)
!1406 = distinct !DILexicalBlock(scope: !1382, file: !459, line: 1300, column: 7)
!1407 = !DILocation(line: 1300, column: 14, scope: !1406)
!1408 = !DILocation(line: 1300, column: 7, scope: !1382)
!1409 = !DILocation(line: 1301, column: 9, scope: !1410)
!1410 = distinct !DILexicalBlock(scope: !1411, file: !459, line: 1301, column: 7)
!1411 = distinct !DILexicalBlock(scope: !1406, file: !459, line: 1300, column: 19)
!1412 = !DILocation(line: 1301, column: 8, scope: !1410)
!1413 = !DILocation(line: 1301, column: 13, scope: !1410)
!1414 = !DILocation(line: 1301, column: 7, scope: !1411)
!1415 = !DILocation(line: 1302, column: 5, scope: !1410)
!1416 = distinct !{!1416, !1380}
!1417 = !DILocation(line: 1303, column: 9, scope: !1418)
!1418 = distinct !DILexicalBlock(scope: !1411, file: !459, line: 1303, column: 7)
!1419 = !DILocation(line: 1303, column: 8, scope: !1418)
!1420 = !DILocation(line: 1303, column: 13, scope: !1418)
!1421 = !DILocation(line: 1303, column: 28, scope: !1418)
!1422 = !DILocation(line: 1303, column: 33, scope: !1423)
!1423 = !DILexicalBlockFile(scope: !1418, file: !459, discriminator: 1)
!1424 = !DILocation(line: 1303, column: 32, scope: !1423)
!1425 = !DILocation(line: 1303, column: 37, scope: !1423)
!1426 = !DILocation(line: 1303, column: 7, scope: !1423)
!1427 = !DILocation(line: 1304, column: 5, scope: !1418)
!1428 = !DILocation(line: 1305, column: 9, scope: !1429)
!1429 = distinct !DILexicalBlock(scope: !1411, file: !459, line: 1305, column: 7)
!1430 = !DILocation(line: 1305, column: 8, scope: !1429)
!1431 = !DILocation(line: 1305, column: 13, scope: !1429)
!1432 = !DILocation(line: 1305, column: 7, scope: !1411)
!1433 = !DILocation(line: 1306, column: 81, scope: !1434)
!1434 = distinct !DILexicalBlock(scope: !1429, file: !459, line: 1305, column: 25)
!1435 = !DILocation(line: 1306, column: 84, scope: !1434)
!1436 = !DILocation(line: 1306, column: 5, scope: !1434)
!1437 = !DILocation(line: 1307, column: 5, scope: !1434)
!1438 = !DILocation(line: 1308, column: 4, scope: !1434)
!1439 = !DILocation(line: 1310, column: 76, scope: !1429)
!1440 = !DILocation(line: 1310, column: 79, scope: !1429)
!1441 = !DILocation(line: 1310, column: 116, scope: !1429)
!1442 = !DILocation(line: 1310, column: 115, scope: !1429)
!1443 = !DILocation(line: 1310, column: 5, scope: !1444)
!1444 = !DILexicalBlockFile(scope: !1429, file: !459, discriminator: 1)
!1445 = !DILocation(line: 1311, column: 4, scope: !1411)
!1446 = !DILocation(line: 1314, column: 7, scope: !1447)
!1447 = distinct !DILexicalBlock(scope: !1382, file: !459, line: 1314, column: 7)
!1448 = !DILocation(line: 1314, column: 14, scope: !1447)
!1449 = !DILocation(line: 1314, column: 7, scope: !1382)
!1450 = !DILocation(line: 1315, column: 4, scope: !1451)
!1451 = distinct !DILexicalBlock(scope: !1447, file: !459, line: 1314, column: 20)
!1452 = !DILocation(line: 1316, column: 4, scope: !1451)
!1453 = !DILocation(line: 1319, column: 11, scope: !1454)
!1454 = distinct !DILexicalBlock(scope: !1382, file: !459, line: 1319, column: 7)
!1455 = !DILocation(line: 1319, column: 7, scope: !1454)
!1456 = !DILocation(line: 1319, column: 23, scope: !1454)
!1457 = !DILocation(line: 1319, column: 7, scope: !1382)
!1458 = !DILocation(line: 1322, column: 15, scope: !1459)
!1459 = distinct !DILexicalBlock(scope: !1454, file: !459, line: 1319, column: 38)
!1460 = !DILocation(line: 1320, column: 4, scope: !1459)
!1461 = !DILocation(line: 1323, column: 4, scope: !1459)
!1462 = !DILocation(line: 1326, column: 12, scope: !1463)
!1463 = distinct !DILexicalBlock(scope: !1382, file: !459, line: 1326, column: 3)
!1464 = !DILocation(line: 1326, column: 10, scope: !1463)
!1465 = !DILocation(line: 1326, column: 8, scope: !1463)
!1466 = !DILocation(line: 1326, column: 44, scope: !1467)
!1467 = !DILexicalBlockFile(scope: !1468, file: !459, discriminator: 1)
!1468 = distinct !DILexicalBlock(scope: !1463, file: !459, line: 1326, column: 3)
!1469 = !DILocation(line: 1326, column: 38, scope: !1467)
!1470 = !DILocation(line: 1326, column: 70, scope: !1467)
!1471 = !DILocation(line: 1326, column: 36, scope: !1472)
!1472 = !DILexicalBlockFile(scope: !1468, file: !459, discriminator: 2)
!1473 = !DILocation(line: 1326, column: 39, scope: !1472)
!1474 = !DILocation(line: 1326, column: 73, scope: !1472)
!1475 = !DILocation(line: 1326, column: 49, scope: !1472)
!1476 = !DILocation(line: 1326, column: 76, scope: !1472)
!1477 = !DILocation(line: 1326, column: 36, scope: !1478)
!1478 = !DILexicalBlockFile(scope: !1468, file: !459, discriminator: 3)
!1479 = !DILocation(line: 1326, column: 39, scope: !1478)
!1480 = !DILocation(line: 1326, column: 79, scope: !1478)
!1481 = !DILocation(line: 1326, column: 44, scope: !1478)
!1482 = !DILocation(line: 1326, column: 49, scope: !1478)
!1483 = !DILocation(line: 1326, column: 3, scope: !1484)
!1484 = !DILexicalBlockFile(scope: !1463, file: !459, discriminator: 4)
!1485 = !DILocation(line: 1328, column: 8, scope: !1486)
!1486 = distinct !DILexicalBlock(scope: !1487, file: !459, line: 1328, column: 8)
!1487 = distinct !DILexicalBlock(scope: !1468, file: !459, line: 1326, column: 92)
!1488 = !DILocation(line: 1328, column: 11, scope: !1486)
!1489 = !DILocation(line: 1328, column: 22, scope: !1486)
!1490 = !DILocation(line: 1328, column: 8, scope: !1487)
!1491 = !DILocation(line: 1329, column: 12, scope: !1486)
!1492 = !DILocation(line: 1329, column: 5, scope: !1486)
!1493 = !DILocation(line: 1332, column: 8, scope: !1494)
!1494 = distinct !DILexicalBlock(scope: !1487, file: !459, line: 1332, column: 8)
!1495 = !DILocation(line: 1332, column: 11, scope: !1494)
!1496 = !DILocation(line: 1332, column: 22, scope: !1494)
!1497 = !DILocation(line: 1332, column: 8, scope: !1487)
!1498 = !DILocalVariable(name: "err", scope: !1499, file: !459, line: 1333, type: !408)
!1499 = distinct !DILexicalBlock(scope: !1494, file: !459, line: 1332, column: 37)
!1500 = !DILocation(line: 1333, column: 22, scope: !1499)
!1501 = !DILocation(line: 1333, column: 47, scope: !1499)
!1502 = !DILocation(line: 1333, column: 57, scope: !1499)
!1503 = !DILocation(line: 1333, column: 49, scope: !1499)
!1504 = !DILocation(line: 1333, column: 28, scope: !1499)
!1505 = !DILocation(line: 1339, column: 9, scope: !1506)
!1506 = distinct !DILexicalBlock(scope: !1499, file: !459, line: 1339, column: 9)
!1507 = !DILocation(line: 1339, column: 14, scope: !1506)
!1508 = !DILocation(line: 1339, column: 20, scope: !1506)
!1509 = !DILocation(line: 1339, column: 9, scope: !1499)
!1510 = !DILocation(line: 1340, column: 12, scope: !1511)
!1511 = distinct !DILexicalBlock(scope: !1512, file: !459, line: 1340, column: 10)
!1512 = distinct !DILexicalBlock(scope: !1506, file: !459, line: 1339, column: 26)
!1513 = !DILocation(line: 1340, column: 15, scope: !1511)
!1514 = !DILocation(line: 1340, column: 27, scope: !1511)
!1515 = !DILocation(line: 1340, column: 41, scope: !1511)
!1516 = !DILocation(line: 1340, column: 45, scope: !1517)
!1517 = !DILexicalBlockFile(scope: !1511, file: !459, discriminator: 1)
!1518 = !DILocation(line: 1340, column: 10, scope: !1517)
!1519 = !DILocation(line: 1341, column: 7, scope: !1511)
!1520 = !DILocation(line: 1342, column: 6, scope: !1512)
!1521 = !DILocation(line: 1345, column: 9, scope: !1522)
!1522 = distinct !DILexicalBlock(scope: !1499, file: !459, line: 1345, column: 9)
!1523 = !DILocation(line: 1345, column: 12, scope: !1522)
!1524 = !DILocation(line: 1345, column: 22, scope: !1522)
!1525 = !DILocation(line: 1345, column: 9, scope: !1499)
!1526 = !DILocation(line: 1346, column: 6, scope: !1527)
!1527 = distinct !DILexicalBlock(scope: !1522, file: !459, line: 1345, column: 63)
!1528 = !DILocation(line: 1348, column: 6, scope: !1527)
!1529 = !DILocation(line: 1351, column: 9, scope: !1530)
!1530 = distinct !DILexicalBlock(scope: !1499, file: !459, line: 1351, column: 9)
!1531 = !DILocation(line: 1351, column: 11, scope: !1530)
!1532 = !DILocation(line: 1351, column: 15, scope: !1533)
!1533 = !DILexicalBlockFile(scope: !1530, file: !459, discriminator: 1)
!1534 = !DILocation(line: 1351, column: 20, scope: !1533)
!1535 = !DILocation(line: 1351, column: 26, scope: !1533)
!1536 = !DILocation(line: 1351, column: 37, scope: !1533)
!1537 = !DILocation(line: 1352, column: 11, scope: !1530)
!1538 = !DILocation(line: 1352, column: 14, scope: !1530)
!1539 = !DILocation(line: 1352, column: 25, scope: !1530)
!1540 = !DILocation(line: 1352, column: 41, scope: !1530)
!1541 = !DILocation(line: 1353, column: 11, scope: !1530)
!1542 = !DILocation(line: 1353, column: 14, scope: !1530)
!1543 = !DILocation(line: 1353, column: 25, scope: !1530)
!1544 = !DILocation(line: 1351, column: 9, scope: !1545)
!1545 = !DILexicalBlockFile(scope: !1499, file: !459, discriminator: 2)
!1546 = !DILocation(line: 1354, column: 6, scope: !1530)
!1547 = !DILocation(line: 1360, column: 9, scope: !1548)
!1548 = distinct !DILexicalBlock(scope: !1499, file: !459, line: 1360, column: 9)
!1549 = !DILocation(line: 1360, column: 11, scope: !1548)
!1550 = !DILocation(line: 1360, column: 14, scope: !1551)
!1551 = !DILexicalBlockFile(scope: !1548, file: !459, discriminator: 1)
!1552 = !DILocation(line: 1360, column: 19, scope: !1551)
!1553 = !DILocation(line: 1360, column: 25, scope: !1551)
!1554 = !DILocation(line: 1360, column: 42, scope: !1551)
!1555 = !DILocation(line: 1361, column: 9, scope: !1548)
!1556 = !DILocation(line: 1361, column: 12, scope: !1548)
!1557 = !DILocation(line: 1361, column: 23, scope: !1548)
!1558 = !DILocation(line: 1360, column: 9, scope: !1545)
!1559 = !DILocation(line: 1362, column: 12, scope: !1560)
!1560 = distinct !DILexicalBlock(scope: !1561, file: !459, line: 1362, column: 10)
!1561 = distinct !DILexicalBlock(scope: !1548, file: !459, line: 1361, column: 38)
!1562 = !DILocation(line: 1362, column: 15, scope: !1560)
!1563 = !DILocation(line: 1362, column: 27, scope: !1560)
!1564 = !DILocation(line: 1362, column: 10, scope: !1561)
!1565 = !DILocation(line: 1363, column: 7, scope: !1560)
!1566 = !DILocation(line: 1364, column: 6, scope: !1561)
!1567 = !DILocation(line: 1367, column: 9, scope: !1568)
!1568 = distinct !DILexicalBlock(scope: !1499, file: !459, line: 1367, column: 9)
!1569 = !DILocation(line: 1367, column: 34, scope: !1568)
!1570 = !DILocation(line: 1367, column: 39, scope: !1568)
!1571 = !DILocation(line: 1367, column: 33, scope: !1568)
!1572 = !DILocation(line: 1367, column: 30, scope: !1568)
!1573 = !DILocation(line: 1367, column: 9, scope: !1499)
!1574 = !DILocation(line: 1371, column: 23, scope: !1568)
!1575 = !DILocation(line: 1371, column: 28, scope: !1568)
!1576 = !DILocation(line: 1371, column: 22, scope: !1568)
!1577 = !DILocation(line: 1371, column: 13, scope: !1568)
!1578 = !DILocation(line: 1372, column: 13, scope: !1568)
!1579 = !DILocation(line: 1372, column: 18, scope: !1568)
!1580 = !DILocation(line: 1372, column: 22, scope: !1568)
!1581 = !DILocation(line: 1373, column: 13, scope: !1568)
!1582 = !DILocation(line: 1373, column: 18, scope: !1568)
!1583 = !DILocation(line: 1373, column: 22, scope: !1568)
!1584 = !DILocation(line: 1373, column: 33, scope: !1568)
!1585 = !DILocation(line: 1373, column: 38, scope: !1568)
!1586 = !DILocation(line: 1373, column: 42, scope: !1568)
!1587 = !DILocation(line: 1369, column: 6, scope: !1568)
!1588 = !DILocation(line: 1375, column: 5, scope: !1499)
!1589 = !DILocation(line: 1382, column: 8, scope: !1590)
!1590 = distinct !DILexicalBlock(scope: !1487, file: !459, line: 1382, column: 8)
!1591 = !DILocation(line: 1382, column: 18, scope: !1590)
!1592 = !DILocation(line: 1382, column: 36, scope: !1590)
!1593 = !DILocation(line: 1384, column: 8, scope: !1590)
!1594 = !DILocation(line: 1384, column: 11, scope: !1590)
!1595 = !DILocation(line: 1384, column: 22, scope: !1590)
!1596 = !DILocation(line: 1384, column: 37, scope: !1590)
!1597 = !DILocation(line: 1385, column: 8, scope: !1590)
!1598 = !DILocation(line: 1385, column: 11, scope: !1590)
!1599 = !DILocation(line: 1385, column: 22, scope: !1590)
!1600 = !DILocation(line: 1385, column: 25, scope: !1601)
!1601 = !DILexicalBlockFile(scope: !1590, file: !459, discriminator: 1)
!1602 = !DILocation(line: 1385, column: 28, scope: !1601)
