; ModuleID = './[inter]keepalived--core--smtp.o.i'
source_filename = "./[inter]keepalived--core--smtp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.anon = type { i32 (%struct._thread*)*, i32 (%struct._thread*, i32)* }
%struct._thread = type { i64, i32, %struct._thread_master*, {}*, i8*, %struct.timeval, %union.anon, %struct._thread_event*, %union.anon.1 }
%struct._thread_master = type { %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.list_head, %struct.list_head, %struct.list_head, %struct._list*, %struct.rb_root, %struct.epoll_event*, %struct._thread_event*, i32, i32, i32, i32, %struct._thread*, i64, i64, i8 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.rb_root = type { %struct.rb_node* }
%struct.rb_node = type { i64, %struct.rb_node*, %struct.rb_node* }
%struct.epoll_event = type opaque
%struct.timeval = type { i64, i64 }
%union.anon = type { %struct.anon.0 }

!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!6 = !DIEnumerator(name: "THREAD_READ", value: 0)
!7 = !DIEnumerator(name: "THREAD_WRITE", value: 1)
!8 = !DIEnumerator(name: "THREAD_TIMER", value: 2)
!9 = !DIEnumerator(name: "THREAD_TIMER_SHUTDOWN", value: 3)
!10 = !DIEnumerator(name: "THREAD_EVENT", value: 4)
!11 = !DIEnumerator(name: "THREAD_CHILD", value: 5)
!12 = !DIEnumerator(name: "THREAD_READY", value: 6)
!13 = !DIEnumerator(name: "THREAD_UNUSED", value: 7)
!14 = !DIEnumerator(name: "THREAD_WRITE_TIMEOUT", value: 8)
!15 = !DIEnumerator(name: "THREAD_READ_TIMEOUT", value: 9)
!16 = !DIEnumerator(name: "THREAD_CHILD_TIMEOUT", value: 10)
!17 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!18 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!19 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!20 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!21 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!22 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!23 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 57, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "./../include/smtp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!26 = !{!27, !28, !29, !30, !31}
!27 = !DIEnumerator(name: "SMTP_MSG_RS", value: 0)
!28 = !DIEnumerator(name: "SMTP_MSG_VS", value: 1)
!29 = !DIEnumerator(name: "SMTP_MSG_RS_SHUT", value: 2)
!30 = !DIEnumerator(name: "SMTP_MSG_VGROUP", value: 3)
!31 = !DIEnumerator(name: "SMTP_MSG_VRRP", value: 4)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chksum_compatibility", file: !33, line: 173, size: 32, align: 32, elements: !34)
!33 = !DIFile(filename: "./../include/vrrp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!34 = !{!35, !36, !37, !38, !39}
!35 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NONE", value: 0)
!36 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NEVER", value: 1)
!37 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_MIN_COMPAT", value: 2)
!38 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_CONFIG", value: 3)
!39 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_AUTO", value: 4)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "connect_result", file: !41, line: 34, size: 32, align: 32, elements: !42)
!41 = !DIFile(filename: "./../include/layer4.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!42 = !{!43, !44, !45, !46}
!43 = !DIEnumerator(name: "connect_error", value: 0)
!44 = !DIEnumerator(name: "connect_in_progress", value: 1)
!45 = !DIEnumerator(name: "connect_timeout", value: 2)
!46 = !DIEnumerator(name: "connect_success", value: 3)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !48, line: 24, size: 32, align: 32, elements: !49)
!48 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58}
!50 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!51 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!52 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!53 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!54 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!55 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!56 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!57 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!58 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 40, size: 32, align: 32, elements: !61)
!60 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!62 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!63 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!64 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!65 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!66 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!67 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!68 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!69 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!70 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!71 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!72 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!73 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!74 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!75 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!76 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!77 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!78 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!79 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!80 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!81 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!82 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!83 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!84 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!85 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!86 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!87 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!88 = !{!89, !90, !100, !109, !297, !422, !428, !435, !106, !95}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "smtp_t", file: !25, line: 96, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_smtp", file: !25, line: 87, size: 448, align: 64, elements: !93)
!93 = !{!94, !96, !97, !99, !102, !103, !104, !105}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !92, file: !25, line: 88, baseType: !95, size: 32, align: 32)
!95 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "stage", scope: !92, file: !25, line: 89, baseType: !95, size: 32, align: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "email_it", scope: !92, file: !25, line: 90, baseType: !98, size: 32, align: 32, offset: 64)
!98 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "subject", scope: !92, file: !25, line: 91, baseType: !100, size: 64, align: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !92, file: !25, line: 92, baseType: !100, size: 64, align: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !92, file: !25, line: 93, baseType: !100, size: 64, align: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "email_to", scope: !92, file: !25, line: 94, baseType: !100, size: 64, align: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !92, file: !25, line: 95, baseType: !106, size: 64, align: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !107, line: 216, baseType: !108)
!107 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!108 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "checker_t", file: !111, line: 60, baseType: !112)
!111 = !DIFile(filename: "./../include/check_api.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_checker", file: !111, line: 40, size: 1024, align: 64, elements: !113)
!113 = !{!114, !118, !178, !292, !296, !399, !400, !401, !402, !403, !404, !414, !415, !416, !417, !418, !419, !420, !421}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "free_func", scope: !112, file: !111, line: 41, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !89}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "dump_func", scope: !112, file: !111, line: 42, baseType: !119, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !122, !89}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !124, line: 48, baseType: !125)
!124 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !126, line: 241, size: 1728, align: 64, elements: !127)
!126 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !148, !149, !150, !151, !155, !157, !159, !163, !166, !168, !169, !170, !171, !172, !173, !174}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !125, file: !126, line: 242, baseType: !95, size: 32, align: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !125, file: !126, line: 247, baseType: !100, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !125, file: !126, line: 248, baseType: !100, size: 64, align: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !125, file: !126, line: 249, baseType: !100, size: 64, align: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !125, file: !126, line: 250, baseType: !100, size: 64, align: 64, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !125, file: !126, line: 251, baseType: !100, size: 64, align: 64, offset: 320)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !125, file: !126, line: 252, baseType: !100, size: 64, align: 64, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !125, file: !126, line: 253, baseType: !100, size: 64, align: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !125, file: !126, line: 254, baseType: !100, size: 64, align: 64, offset: 512)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !125, file: !126, line: 256, baseType: !100, size: 64, align: 64, offset: 576)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !125, file: !126, line: 257, baseType: !100, size: 64, align: 64, offset: 640)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !125, file: !126, line: 258, baseType: !100, size: 64, align: 64, offset: 704)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !125, file: !126, line: 260, baseType: !141, size: 64, align: 64, offset: 768)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !126, line: 156, size: 192, align: 64, elements: !143)
!143 = !{!144, !145, !147}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !142, file: !126, line: 157, baseType: !141, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !142, file: !126, line: 158, baseType: !146, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !142, file: !126, line: 162, baseType: !95, size: 32, align: 32, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !125, file: !126, line: 262, baseType: !146, size: 64, align: 64, offset: 832)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !125, file: !126, line: 264, baseType: !95, size: 32, align: 32, offset: 896)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !125, file: !126, line: 268, baseType: !95, size: 32, align: 32, offset: 928)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !125, file: !126, line: 270, baseType: !152, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !153, line: 131, baseType: !154)
!153 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!154 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !125, file: !126, line: 274, baseType: !156, size: 16, align: 16, offset: 1024)
!156 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !125, file: !126, line: 275, baseType: !158, size: 8, align: 8, offset: 1040)
!158 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !125, file: !126, line: 276, baseType: !160, size: 8, align: 8, offset: 1048)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 8, align: 8, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 1)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !125, file: !126, line: 280, baseType: !164, size: 64, align: 64, offset: 1088)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !126, line: 150, baseType: null)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !125, file: !126, line: 289, baseType: !167, size: 64, align: 64, offset: 1152)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !153, line: 132, baseType: !154)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !125, file: !126, line: 297, baseType: !89, size: 64, align: 64, offset: 1216)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !125, file: !126, line: 298, baseType: !89, size: 64, align: 64, offset: 1280)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !125, file: !126, line: 299, baseType: !89, size: 64, align: 64, offset: 1344)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !125, file: !126, line: 300, baseType: !89, size: 64, align: 64, offset: 1408)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !125, file: !126, line: 302, baseType: !106, size: 64, align: 64, offset: 1472)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !125, file: !126, line: 303, baseType: !95, size: 32, align: 32, offset: 1536)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !125, file: !126, line: 305, baseType: !175, size: 160, align: 8, offset: 1568)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 160, align: 8, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 20)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "launch", scope: !112, file: !111, line: 43, baseType: !179, size: 64, align: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!95, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !4, line: 78, size: 768, align: 64, elements: !184)
!184 = !{!185, !186, !188, !260, !261, !262, !272, !285, !287}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !183, file: !4, line: 79, baseType: !108, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !183, file: !4, line: 80, baseType: !187, size: 32, align: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !4, line: 63, baseType: !3)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !183, file: !4, line: 81, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !4, line: 112, size: 1280, align: 64, elements: !191)
!191 = !{!192, !204, !205, !206, !207, !215, !216, !217, !234, !235, !238, !251, !252, !253, !254, !255, !256, !257, !258}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !190, file: !4, line: 113, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !194, line: 109, baseType: !195)
!194 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !194, line: 106, size: 64, align: 64, elements: !196)
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !195, file: !194, line: 108, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !194, line: 97, size: 192, align: 64, elements: !200)
!200 = !{!201, !202, !203}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !199, file: !194, line: 99, baseType: !108, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !199, file: !194, line: 102, baseType: !198, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !199, file: !194, line: 103, baseType: !198, size: 64, align: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !190, file: !4, line: 114, baseType: !193, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !190, file: !4, line: 115, baseType: !193, size: 64, align: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !190, file: !4, line: 116, baseType: !193, size: 64, align: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !190, file: !4, line: 117, baseType: !208, size: 128, align: 64, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !209, line: 62, baseType: !210)
!209 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !209, line: 60, size: 128, align: 64, elements: !211)
!211 = !{!212, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !209, line: 61, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !210, file: !209, line: 61, baseType: !213, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !190, file: !4, line: 121, baseType: !208, size: 128, align: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !190, file: !4, line: 122, baseType: !208, size: 128, align: 64, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !190, file: !4, line: 124, baseType: !218, size: 64, align: 64, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !219, line: 31, baseType: !220)
!219 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !219, line: 39, size: 320, align: 64, elements: !222)
!222 = !{!223, !230, !231, !232, !233}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !221, file: !219, line: 40, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !219, line: 33, size: 192, align: 64, elements: !226)
!226 = !{!227, !228, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !219, line: 34, baseType: !224, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !225, file: !219, line: 35, baseType: !224, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !225, file: !219, line: 36, baseType: !89, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !221, file: !219, line: 41, baseType: !224, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !221, file: !219, line: 42, baseType: !98, size: 32, align: 32, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !221, file: !219, line: 43, baseType: !115, size: 64, align: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !221, file: !219, line: 44, baseType: !119, size: 64, align: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !190, file: !4, line: 127, baseType: !193, size: 64, align: 64, offset: 704)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !190, file: !4, line: 128, baseType: !236, size: 64, align: 64, offset: 768)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !4, line: 128, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !190, file: !4, line: 129, baseType: !239, size: 64, align: 64, offset: 832)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !4, line: 109, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !4, line: 102, size: 448, align: 64, elements: !242)
!242 = !{!243, !246, !247, !248, !249}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !241, file: !4, line: 103, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !4, line: 99, baseType: !183)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !241, file: !4, line: 104, baseType: !244, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !241, file: !4, line: 105, baseType: !108, size: 64, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !241, file: !4, line: 106, baseType: !95, size: 32, align: 32, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !241, file: !4, line: 108, baseType: !250, size: 192, align: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !194, line: 104, baseType: !199)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !190, file: !4, line: 130, baseType: !98, size: 32, align: 32, offset: 896)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !190, file: !4, line: 131, baseType: !98, size: 32, align: 32, offset: 928)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !190, file: !4, line: 132, baseType: !95, size: 32, align: 32, offset: 960)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !190, file: !4, line: 135, baseType: !95, size: 32, align: 32, offset: 992)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !190, file: !4, line: 136, baseType: !244, size: 64, align: 64, offset: 1024)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !190, file: !4, line: 146, baseType: !108, size: 64, align: 64, offset: 1088)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !190, file: !4, line: 147, baseType: !108, size: 64, align: 64, offset: 1152)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !190, file: !4, line: 148, baseType: !259, size: 8, align: 8, offset: 1216)
!259 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !183, file: !4, line: 82, baseType: !179, size: 64, align: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !183, file: !4, line: 83, baseType: !89, size: 64, align: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !183, file: !4, line: 84, baseType: !263, size: 128, align: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !264, line: 31, baseType: !265)
!264 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !266, line: 30, size: 128, align: 64, elements: !267)
!266 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!267 = !{!268, !270}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !265, file: !266, line: 32, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !153, line: 139, baseType: !154)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !265, file: !266, line: 33, baseType: !271, size: 64, align: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !153, line: 141, baseType: !154)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !183, file: !4, line: 92, baseType: !273, size: 64, align: 32, offset: 448)
!273 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !183, file: !4, line: 85, size: 64, align: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !273, file: !4, line: 86, baseType: !95, size: 32, align: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !273, file: !4, line: 87, baseType: !95, size: 32, align: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !273, file: !4, line: 91, baseType: !278, size: 64, align: 32)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !273, file: !4, line: 88, size: 64, align: 32, elements: !279)
!279 = !{!280, !284}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !278, file: !4, line: 89, baseType: !281, size: 32, align: 32)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !282, line: 263, baseType: !283)
!282 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !153, line: 133, baseType: !95)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !278, file: !4, line: 90, baseType: !95, size: 32, align: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !183, file: !4, line: 93, baseType: !286, size: 64, align: 64, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, scope: !183, file: !4, line: 95, baseType: !288, size: 192, align: 64, offset: 576)
!288 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !183, file: !4, line: 95, size: 192, align: 64, elements: !289)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !288, file: !4, line: 96, baseType: !250, size: 192, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !288, file: !4, line: 97, baseType: !208, size: 128, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !112, file: !111, line: 44, baseType: !293, size: 64, align: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!259, !89, !89}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "vs", scope: !112, file: !111, line: 45, baseType: !297, size: 64, align: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "virtual_server_t", file: !299, line: 180, baseType: !300)
!299 = !DIFile(filename: "./../include/check_data.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_virtual_server", file: !299, line: 131, size: 2560, align: 64, elements: !301)
!301 = !{!302, !303, !311, !323, !326, !367, !369, !370, !371, !372, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "vsgname", scope: !300, file: !299, line: 132, baseType: !100, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "vsg", scope: !300, file: !299, line: 133, baseType: !304, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "virtual_server_group_t", file: !299, line: 128, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_virtual_server_group", file: !299, line: 124, size: 192, align: 64, elements: !307)
!307 = !{!308, !309, !310}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !306, file: !299, line: 125, baseType: !100, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "addr_range", scope: !306, file: !299, line: 126, baseType: !218, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "vfwmark", scope: !306, file: !299, line: 127, baseType: !218, size: 64, align: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !300, file: !299, line: 134, baseType: !312, size: 1024, align: 64, offset: 128)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !313, line: 166, size: 1024, align: 64, elements: !314)
!313 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!314 = !{!315, !318, !322}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !312, file: !313, line: 168, baseType: !316, size: 16, align: 16)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !317, line: 28, baseType: !156)
!317 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !312, file: !313, line: 169, baseType: !319, size: 944, align: 8, offset: 16)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 944, align: 8, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 118)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !312, file: !313, line: 170, baseType: !108, size: 64, align: 64, offset: 960)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "vfwmark", scope: !300, file: !299, line: 135, baseType: !324, size: 32, align: 32, offset: 1152)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !325, line: 51, baseType: !98)
!325 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!326 = !DIDerivedType(tag: DW_TAG_member, name: "s_svr", scope: !300, file: !299, line: 136, baseType: !327, size: 64, align: 64, offset: 1216)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "real_server_t", file: !299, line: 102, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_real_server", file: !299, line: 62, size: 1920, align: 64, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !329, file: !299, line: 63, baseType: !312, size: 1024, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !329, file: !299, line: 64, baseType: !95, size: 32, align: 32, offset: 1024)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "iweight", scope: !329, file: !299, line: 65, baseType: !95, size: 32, align: 32, offset: 1056)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pweight", scope: !329, file: !299, line: 66, baseType: !95, size: 32, align: 32, offset: 1088)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "forwarding_method", scope: !329, file: !299, line: 68, baseType: !98, size: 32, align: 32, offset: 1120)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "u_threshold", scope: !329, file: !299, line: 69, baseType: !324, size: 32, align: 32, offset: 1152)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "l_threshold", scope: !329, file: !299, line: 70, baseType: !324, size: 32, align: 32, offset: 1184)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "inhibit", scope: !329, file: !299, line: 71, baseType: !95, size: 32, align: 32, offset: 1216)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "notify_up", scope: !329, file: !299, line: 74, baseType: !340, size: 64, align: 64, offset: 1280)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !342, line: 65, baseType: !343)
!342 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !342, line: 59, size: 192, align: 64, elements: !344)
!344 = !{!345, !347, !348, !349, !352}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !343, file: !342, line: 60, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !343, file: !342, line: 61, baseType: !95, size: 32, align: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !343, file: !342, line: 62, baseType: !95, size: 32, align: 32, offset: 96)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !343, file: !342, line: 63, baseType: !350, size: 32, align: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !282, line: 240, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !153, line: 125, baseType: !98)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !343, file: !342, line: 64, baseType: !353, size: 32, align: 32, offset: 160)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !282, line: 235, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !153, line: 126, baseType: !98)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "notify_down", scope: !329, file: !299, line: 75, baseType: !340, size: 64, align: 64, offset: 1344)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !329, file: !299, line: 76, baseType: !95, size: 32, align: 32, offset: 1408)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !329, file: !299, line: 77, baseType: !108, size: 64, align: 64, offset: 1472)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !329, file: !299, line: 78, baseType: !108, size: 64, align: 64, offset: 1536)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !329, file: !299, line: 79, baseType: !98, size: 32, align: 32, offset: 1600)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !329, file: !299, line: 80, baseType: !108, size: 64, align: 64, offset: 1664)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !329, file: !299, line: 81, baseType: !95, size: 32, align: 32, offset: 1728)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !329, file: !299, line: 83, baseType: !259, size: 8, align: 8, offset: 1760)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "num_failed_checkers", scope: !329, file: !299, line: 84, baseType: !98, size: 32, align: 32, offset: 1792)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !329, file: !299, line: 85, baseType: !259, size: 8, align: 8, offset: 1824)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "reloaded", scope: !329, file: !299, line: 86, baseType: !259, size: 8, align: 8, offset: 1832)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "virtualhost", scope: !329, file: !299, line: 87, baseType: !100, size: 64, align: 64, offset: 1856)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "af", scope: !300, file: !299, line: 137, baseType: !368, size: 16, align: 16, offset: 1280)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !325, line: 49, baseType: !156)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "service_type", scope: !300, file: !299, line: 138, baseType: !368, size: 16, align: 16, offset: 1296)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ha_suspend", scope: !300, file: !299, line: 139, baseType: !259, size: 8, align: 8, offset: 1312)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ha_suspend_addr_count", scope: !300, file: !299, line: 140, baseType: !95, size: 32, align: 32, offset: 1344)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !300, file: !299, line: 142, baseType: !373, size: 128, align: 8, offset: 1376)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 128, align: 8, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 16)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !300, file: !299, line: 143, baseType: !324, size: 32, align: 32, offset: 1504)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_timeout", scope: !300, file: !299, line: 144, baseType: !324, size: 32, align: 32, offset: 1536)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pe_name", scope: !300, file: !299, line: 146, baseType: !373, size: 128, align: 8, offset: 1568)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "forwarding_method", scope: !300, file: !299, line: 148, baseType: !98, size: 32, align: 32, offset: 1696)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_granularity", scope: !300, file: !299, line: 149, baseType: !324, size: 32, align: 32, offset: 1728)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "virtualhost", scope: !300, file: !299, line: 151, baseType: !100, size: 64, align: 64, offset: 1792)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !300, file: !299, line: 153, baseType: !95, size: 32, align: 32, offset: 1856)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !300, file: !299, line: 154, baseType: !218, size: 64, align: 64, offset: 1920)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !300, file: !299, line: 155, baseType: !95, size: 32, align: 32, offset: 1984)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !300, file: !299, line: 156, baseType: !259, size: 8, align: 8, offset: 2016)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "omega", scope: !300, file: !299, line: 157, baseType: !259, size: 8, align: 8, offset: 2024)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "inhibit", scope: !300, file: !299, line: 158, baseType: !259, size: 8, align: 8, offset: 2032)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !300, file: !299, line: 160, baseType: !108, size: 64, align: 64, offset: 2048)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !300, file: !299, line: 161, baseType: !108, size: 64, align: 64, offset: 2112)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !300, file: !299, line: 162, baseType: !98, size: 32, align: 32, offset: 2176)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !300, file: !299, line: 163, baseType: !108, size: 64, align: 64, offset: 2240)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "notify_quorum_up", scope: !300, file: !299, line: 164, baseType: !340, size: 64, align: 64, offset: 2304)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "notify_quorum_down", scope: !300, file: !299, line: 165, baseType: !340, size: 64, align: 64, offset: 2368)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "quorum", scope: !300, file: !299, line: 166, baseType: !98, size: 32, align: 32, offset: 2432)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "hysteresis", scope: !300, file: !299, line: 167, baseType: !98, size: 32, align: 32, offset: 2464)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !300, file: !299, line: 168, baseType: !95, size: 32, align: 32, offset: 2496)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "quorum_state_up", scope: !300, file: !299, line: 169, baseType: !259, size: 8, align: 8, offset: 2528)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "reloaded", scope: !300, file: !299, line: 170, baseType: !259, size: 8, align: 8, offset: 2536)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !112, file: !111, line: 46, baseType: !327, size: 64, align: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !112, file: !111, line: 47, baseType: !89, size: 64, align: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !112, file: !111, line: 48, baseType: !259, size: 8, align: 8, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "is_up", scope: !112, file: !111, line: 49, baseType: !259, size: 8, align: 8, offset: 456)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "has_run", scope: !112, file: !111, line: 50, baseType: !259, size: 8, align: 8, offset: 464)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !112, file: !111, line: 51, baseType: !405, size: 64, align: 64, offset: 512)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_opts_t", file: !41, line: 50, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_conn_opts", file: !41, line: 42, size: 2240, align: 64, elements: !408)
!408 = !{!409, !410, !411, !412, !413}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !407, file: !41, line: 43, baseType: !312, size: 1024, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "bindto", scope: !407, file: !41, line: 44, baseType: !312, size: 1024, align: 64, offset: 1024)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "bind_if", scope: !407, file: !41, line: 45, baseType: !373, size: 128, align: 8, offset: 2048)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "connection_to", scope: !407, file: !41, line: 46, baseType: !98, size: 32, align: 32, offset: 2176)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "fwmark", scope: !407, file: !41, line: 48, baseType: !98, size: 32, align: 32, offset: 2208)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !112, file: !111, line: 52, baseType: !95, size: 32, align: 32, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !112, file: !111, line: 53, baseType: !108, size: 64, align: 64, offset: 640)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !112, file: !111, line: 54, baseType: !108, size: 64, align: 64, offset: 704)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !112, file: !111, line: 55, baseType: !98, size: 32, align: 32, offset: 768)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !112, file: !111, line: 56, baseType: !108, size: 64, align: 64, offset: 832)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "retry_it", scope: !112, file: !111, line: 57, baseType: !98, size: 32, align: 32, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "default_retry", scope: !112, file: !111, line: 58, baseType: !98, size: 32, align: 32, offset: 928)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "default_delay_before_retry", scope: !112, file: !111, line: 59, baseType: !108, size: 64, align: 64, offset: 960)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "smtp_rs", file: !25, line: 115, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_smtp_rs", file: !25, line: 112, size: 128, align: 64, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !424, file: !25, line: 113, baseType: !327, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "vs", scope: !424, file: !25, line: 114, baseType: !297, size: 64, align: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_t", file: !33, line: 310, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_t", file: !33, line: 183, size: 7040, align: 64, elements: !431)
!431 = !{!432, !433, !434, !467, !487, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !648, !655}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !430, file: !33, line: 184, baseType: !316, size: 16, align: 16)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !430, file: !33, line: 185, baseType: !100, size: 64, align: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !430, file: !33, line: 186, baseType: !435, size: 64, align: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_sgroup_t", file: !33, line: 133, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_sgroup", file: !33, line: 109, size: 1024, align: 64, elements: !438)
!438 = !{!439, !440, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !437, file: !33, line: 110, baseType: !100, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !437, file: !33, line: 111, baseType: !441, size: 64, align: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !443, line: 34, baseType: !444)
!443 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !443, line: 30, size: 128, align: 64, elements: !445)
!445 = !{!446, !447, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !444, file: !443, line: 31, baseType: !98, size: 32, align: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !444, file: !443, line: 32, baseType: !98, size: 32, align: 32, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !444, file: !443, line: 33, baseType: !449, size: 64, align: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !437, file: !33, line: 112, baseType: !218, size: 64, align: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_fault", scope: !437, file: !33, line: 113, baseType: !98, size: 32, align: 32, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_init", scope: !437, file: !33, line: 114, baseType: !98, size: 32, align: 32, offset: 224)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !437, file: !33, line: 115, baseType: !95, size: 32, align: 32, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sgroup_tracking_weight", scope: !437, file: !33, line: 116, baseType: !259, size: 8, align: 8, offset: 288)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !437, file: !33, line: 119, baseType: !218, size: 64, align: 64, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !437, file: !33, line: 120, baseType: !218, size: 64, align: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !437, file: !33, line: 121, baseType: !218, size: 64, align: 64, offset: 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "track_bfd", scope: !437, file: !33, line: 122, baseType: !218, size: 64, align: 64, offset: 512)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !437, file: !33, line: 125, baseType: !259, size: 8, align: 8, offset: 576)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !437, file: !33, line: 126, baseType: !340, size: 64, align: 64, offset: 640)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !437, file: !33, line: 127, baseType: !340, size: 64, align: 64, offset: 704)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !437, file: !33, line: 128, baseType: !340, size: 64, align: 64, offset: 768)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !437, file: !33, line: 129, baseType: !340, size: 64, align: 64, offset: 832)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !437, file: !33, line: 130, baseType: !340, size: 64, align: 64, offset: 896)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !437, file: !33, line: 131, baseType: !95, size: 32, align: 32, offset: 960)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !437, file: !33, line: 132, baseType: !95, size: 32, align: 32, offset: 992)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !430, file: !33, line: 187, baseType: !468, size: 64, align: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_stats", file: !33, line: 169, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_stats", file: !33, line: 136, size: 768, align: 64, elements: !471)
!471 = !{!472, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "advert_rcvd", scope: !470, file: !33, line: 137, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !325, line: 55, baseType: !108)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "advert_sent", scope: !470, file: !33, line: 138, baseType: !324, size: 32, align: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "become_master", scope: !470, file: !33, line: 140, baseType: !324, size: 32, align: 32, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "release_master", scope: !470, file: !33, line: 141, baseType: !324, size: 32, align: 32, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "packet_len_err", scope: !470, file: !33, line: 143, baseType: !473, size: 64, align: 64, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "advert_interval_err", scope: !470, file: !33, line: 144, baseType: !473, size: 64, align: 64, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl_err", scope: !470, file: !33, line: 145, baseType: !473, size: 64, align: 64, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_type_rcvd", scope: !470, file: !33, line: 146, baseType: !473, size: 64, align: 64, offset: 384)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list_err", scope: !470, file: !33, line: 147, baseType: !473, size: 64, align: 64, offset: 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_authtype", scope: !470, file: !33, line: 149, baseType: !324, size: 32, align: 32, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "authtype_mismatch", scope: !470, file: !33, line: 151, baseType: !324, size: 32, align: 32, offset: 544)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "auth_failure", scope: !470, file: !33, line: 152, baseType: !324, size: 32, align: 32, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_rcvd", scope: !470, file: !33, line: 155, baseType: !473, size: 64, align: 64, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_sent", scope: !470, file: !33, line: 156, baseType: !473, size: 64, align: 64, offset: 704)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !430, file: !33, line: 188, baseType: !488, size: 64, align: 64, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !490, line: 111, baseType: !491)
!490 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !490, line: 76, size: 1792, align: 64, elements: !492)
!492 = !{!493, !494, !496, !501, !519, !520, !521, !522, !523, !530, !531, !532, !533, !534, !535, !537, !538, !539, !540, !552, !553, !554, !555, !556, !557, !558, !559}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !491, file: !490, line: 77, baseType: !373, size: 128, align: 8)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !491, file: !490, line: 78, baseType: !495, size: 32, align: 32, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !490, line: 62, baseType: !324)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !491, file: !490, line: 79, baseType: !497, size: 32, align: 32, offset: 160)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !60, line: 31, size: 32, align: 32, elements: !498)
!498 = !{!499}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !497, file: !60, line: 33, baseType: !500, size: 32, align: 32)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !60, line: 30, baseType: !324)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !491, file: !490, line: 80, baseType: !502, size: 128, align: 32, offset: 192)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !60, line: 211, size: 128, align: 32, elements: !503)
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !502, file: !60, line: 220, baseType: !505, size: 128, align: 32)
!505 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !502, file: !60, line: 213, size: 128, align: 32, elements: !506)
!506 = !{!507, !511, !515}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !505, file: !60, line: 215, baseType: !508, size: 128, align: 8)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 128, align: 8, elements: !374)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !325, line: 48, baseType: !510)
!510 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !505, file: !60, line: 217, baseType: !512, size: 128, align: 16)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 128, align: 16, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 8)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !505, file: !60, line: 218, baseType: !516, size: 128, align: 32)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 128, align: 32, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 4)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !491, file: !490, line: 81, baseType: !98, size: 32, align: 32, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !491, file: !490, line: 82, baseType: !259, size: 8, align: 8, offset: 352)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !491, file: !490, line: 83, baseType: !324, size: 32, align: 32, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !491, file: !490, line: 84, baseType: !156, size: 16, align: 16, offset: 416)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !491, file: !490, line: 85, baseType: !524, size: 256, align: 8, offset: 432)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 256, align: 8, elements: !528)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !526, line: 33, baseType: !527)
!526 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !153, line: 30, baseType: !510)
!528 = !{!529}
!529 = !DISubrange(count: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !491, file: !490, line: 86, baseType: !524, size: 256, align: 8, offset: 688)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !491, file: !490, line: 87, baseType: !106, size: 64, align: 64, offset: 960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !491, file: !490, line: 88, baseType: !95, size: 32, align: 32, offset: 1024)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !491, file: !490, line: 90, baseType: !259, size: 8, align: 8, offset: 1056)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !491, file: !490, line: 91, baseType: !495, size: 32, align: 32, offset: 1088)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !491, file: !490, line: 92, baseType: !536, size: 64, align: 64, offset: 1152)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !491, file: !490, line: 94, baseType: !495, size: 32, align: 32, offset: 1216)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !491, file: !490, line: 96, baseType: !536, size: 64, align: 64, offset: 1280)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !491, file: !490, line: 97, baseType: !259, size: 8, align: 8, offset: 1344)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !491, file: !490, line: 100, baseType: !541, size: 64, align: 64, offset: 1408)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !490, line: 73, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !490, line: 65, size: 704, align: 64, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !550, !551}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !543, file: !490, line: 66, baseType: !263, size: 128, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !543, file: !490, line: 67, baseType: !259, size: 8, align: 8, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !543, file: !490, line: 68, baseType: !263, size: 128, align: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !543, file: !490, line: 69, baseType: !259, size: 8, align: 8, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !543, file: !490, line: 70, baseType: !263, size: 128, align: 64, offset: 384)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !543, file: !490, line: 71, baseType: !263, size: 128, align: 64, offset: 512)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !543, file: !490, line: 72, baseType: !95, size: 32, align: 32, offset: 640)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !491, file: !490, line: 101, baseType: !259, size: 8, align: 8, offset: 1472)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !491, file: !490, line: 102, baseType: !95, size: 32, align: 32, offset: 1504)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !491, file: !490, line: 103, baseType: !324, size: 32, align: 32, offset: 1536)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !491, file: !490, line: 104, baseType: !324, size: 32, align: 32, offset: 1568)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !491, file: !490, line: 105, baseType: !324, size: 32, align: 32, offset: 1600)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !491, file: !490, line: 107, baseType: !98, size: 32, align: 32, offset: 1632)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !491, file: !490, line: 109, baseType: !259, size: 8, align: 8, offset: 1664)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !491, file: !490, line: 110, baseType: !218, size: 64, align: 64, offset: 1728)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track_primary", scope: !430, file: !33, line: 189, baseType: !259, size: 8, align: 8, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !430, file: !33, line: 190, baseType: !259, size: 8, align: 8, offset: 328)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "skip_check_adv_addr", scope: !430, file: !33, line: 191, baseType: !259, size: 8, align: 8, offset: 336)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "strict_mode", scope: !430, file: !33, line: 193, baseType: !98, size: 32, align: 32, offset: 352)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_flags", scope: !430, file: !33, line: 195, baseType: !108, size: 64, align: 64, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_ifname", scope: !430, file: !33, line: 196, baseType: !373, size: 128, align: 8, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !430, file: !33, line: 198, baseType: !218, size: 64, align: 64, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !430, file: !33, line: 199, baseType: !218, size: 64, align: 64, offset: 640)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !430, file: !33, line: 200, baseType: !218, size: 64, align: 64, offset: 704)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_if_fault", scope: !430, file: !33, line: 204, baseType: !98, size: 32, align: 32, offset: 768)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_init", scope: !430, file: !33, line: 205, baseType: !98, size: 32, align: 32, offset: 800)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !430, file: !33, line: 206, baseType: !312, size: 1024, align: 64, offset: 832)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "saddr_from_config", scope: !430, file: !33, line: 207, baseType: !259, size: 8, align: 8, offset: 1856)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "track_saddr", scope: !430, file: !33, line: 208, baseType: !259, size: 8, align: 8, offset: 1864)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_saddr", scope: !430, file: !33, line: 209, baseType: !312, size: 1024, align: 64, offset: 1920)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_peer", scope: !430, file: !33, line: 210, baseType: !218, size: 64, align: 64, offset: 2944)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_chksum_compat", scope: !430, file: !33, line: 212, baseType: !577, size: 32, align: 32, offset: 3008)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "chksum_compatibility_t", file: !33, line: 179, baseType: !32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "master_saddr", scope: !430, file: !33, line: 214, baseType: !312, size: 1024, align: 64, offset: 3072)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "master_priority", scope: !430, file: !33, line: 215, baseType: !509, size: 8, align: 8, offset: 4096)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "last_transition", scope: !430, file: !33, line: 216, baseType: !263, size: 128, align: 64, offset: 4160)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !430, file: !33, line: 217, baseType: !98, size: 32, align: 32, offset: 4288)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh", scope: !430, file: !33, line: 218, baseType: !263, size: 128, align: 64, offset: 4352)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_timer", scope: !430, file: !33, line: 219, baseType: !263, size: 128, align: 64, offset: 4480)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "garp_rep", scope: !430, file: !33, line: 220, baseType: !98, size: 32, align: 32, offset: 4608)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_rep", scope: !430, file: !33, line: 221, baseType: !98, size: 32, align: 32, offset: 4640)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_delay", scope: !430, file: !33, line: 222, baseType: !98, size: 32, align: 32, offset: 4672)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "garp_pending", scope: !430, file: !33, line: 223, baseType: !259, size: 8, align: 8, offset: 4704)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "gna_pending", scope: !430, file: !33, line: 224, baseType: !259, size: 8, align: 8, offset: 4712)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_rep", scope: !430, file: !33, line: 225, baseType: !98, size: 32, align: 32, offset: 4736)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "lower_prio_no_advert", scope: !430, file: !33, line: 226, baseType: !98, size: 32, align: 32, offset: 4768)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "higher_prio_send_advert", scope: !430, file: !33, line: 227, baseType: !98, size: 32, align: 32, offset: 4800)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "vrid", scope: !430, file: !33, line: 228, baseType: !509, size: 8, align: 8, offset: 4832)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "base_priority", scope: !430, file: !33, line: 229, baseType: !509, size: 8, align: 8, offset: 4840)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "effective_priority", scope: !430, file: !33, line: 230, baseType: !509, size: 8, align: 8, offset: 4848)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "total_priority", scope: !430, file: !33, line: 231, baseType: !95, size: 32, align: 32, offset: 4864)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "vipset", scope: !430, file: !33, line: 233, baseType: !259, size: 8, align: 8, offset: 4896)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !430, file: !33, line: 234, baseType: !218, size: 64, align: 64, offset: 4928)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "evip", scope: !430, file: !33, line: 235, baseType: !218, size: 64, align: 64, offset: 4992)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries", scope: !430, file: !33, line: 239, baseType: !259, size: 8, align: 8, offset: 5056)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "evip_add_ipv6", scope: !430, file: !33, line: 240, baseType: !259, size: 8, align: 8, offset: 5064)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "vroutes", scope: !430, file: !33, line: 241, baseType: !218, size: 64, align: 64, offset: 5120)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "vrules", scope: !430, file: !33, line: 242, baseType: !218, size: 64, align: 64, offset: 5184)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "adver_int", scope: !430, file: !33, line: 243, baseType: !98, size: 32, align: 32, offset: 5248)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "master_adver_int", scope: !430, file: !33, line: 244, baseType: !98, size: 32, align: 32, offset: 5280)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !430, file: !33, line: 249, baseType: !98, size: 32, align: 32, offset: 5312)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_rx_buf_size", scope: !430, file: !33, line: 252, baseType: !106, size: 64, align: 64, offset: 5376)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rules_set", scope: !430, file: !33, line: 254, baseType: !259, size: 8, align: 8, offset: 5440)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "nopreempt", scope: !430, file: !33, line: 255, baseType: !259, size: 8, align: 8, offset: 5448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_delay", scope: !430, file: !33, line: 256, baseType: !108, size: 64, align: 64, offset: 5504)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_time", scope: !430, file: !33, line: 260, baseType: !263, size: 128, align: 64, offset: 5568)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !430, file: !33, line: 261, baseType: !95, size: 32, align: 32, offset: 5696)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "wantstate", scope: !430, file: !33, line: 265, baseType: !95, size: 32, align: 32, offset: 5728)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "reload_master", scope: !430, file: !33, line: 266, baseType: !259, size: 8, align: 8, offset: 5760)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sockets", scope: !430, file: !33, line: 267, baseType: !615, size: 64, align: 64, offset: 5824)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_t", file: !617, line: 50, baseType: !618)
!617 = !DIFile(filename: "./../include/vrrp_sock.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sock", file: !617, line: 40, size: 1344, align: 64, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625, !626, !627, !628}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !618, file: !617, line: 41, baseType: !316, size: 16, align: 16)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !618, file: !617, line: 42, baseType: !312, size: 1024, align: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !618, file: !617, line: 43, baseType: !95, size: 32, align: 32, offset: 1088)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !618, file: !617, line: 44, baseType: !495, size: 32, align: 32, offset: 1120)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "unicast", scope: !618, file: !617, line: 45, baseType: !259, size: 8, align: 8, offset: 1152)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fd_in", scope: !618, file: !617, line: 46, baseType: !95, size: 32, align: 32, offset: 1184)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "fd_out", scope: !618, file: !617, line: 47, baseType: !95, size: 32, align: 32, offset: 1216)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_size", scope: !618, file: !617, line: 48, baseType: !95, size: 32, align: 32, offset: 1248)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !618, file: !617, line: 49, baseType: !244, size: 64, align: 64, offset: 1280)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !430, file: !33, line: 269, baseType: !95, size: 32, align: 32, offset: 5888)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !430, file: !33, line: 271, baseType: !95, size: 32, align: 32, offset: 5920)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !430, file: !33, line: 274, baseType: !95, size: 32, align: 32, offset: 5952)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !430, file: !33, line: 275, baseType: !95, size: 32, align: 32, offset: 5984)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !430, file: !33, line: 276, baseType: !259, size: 8, align: 8, offset: 6016)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !430, file: !33, line: 277, baseType: !340, size: 64, align: 64, offset: 6080)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !430, file: !33, line: 278, baseType: !340, size: 64, align: 64, offset: 6144)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !430, file: !33, line: 279, baseType: !340, size: 64, align: 64, offset: 6208)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !430, file: !33, line: 280, baseType: !340, size: 64, align: 64, offset: 6272)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "script_master_rx_lower_pri", scope: !430, file: !33, line: 281, baseType: !340, size: 64, align: 64, offset: 6336)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !430, file: !33, line: 282, baseType: !340, size: 64, align: 64, offset: 6400)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ms_down_timer", scope: !430, file: !33, line: 285, baseType: !324, size: 32, align: 32, offset: 6464)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !430, file: !33, line: 286, baseType: !263, size: 128, align: 64, offset: 6528)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !430, file: !33, line: 289, baseType: !100, size: 64, align: 64, offset: 6656)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer_size", scope: !430, file: !33, line: 290, baseType: !106, size: 64, align: 64, offset: 6720)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_csum", scope: !430, file: !33, line: 291, baseType: !324, size: 32, align: 32, offset: 6784)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "auth_type", scope: !430, file: !33, line: 295, baseType: !509, size: 8, align: 8, offset: 6816)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "auth_data", scope: !430, file: !33, line: 296, baseType: !647, size: 64, align: 8, offset: 6824)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 64, align: 8, elements: !513)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ipsecah_counter", scope: !430, file: !33, line: 299, baseType: !649, size: 64, align: 32, offset: 6912)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_counter_t", file: !650, line: 58, baseType: !651)
!650 = !DIFile(filename: "./../include/vrrp_ipsecah.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seq_counter", file: !650, line: 55, size: 64, align: 32, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !651, file: !650, line: 56, baseType: !259, size: 8, align: 8)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "seq_number", scope: !651, file: !650, line: 57, baseType: !324, size: 32, align: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !430, file: !33, line: 309, baseType: !95, size: 32, align: 32, offset: 6976)
!656 = !{!657, !672}
!657 = distinct !DIGlobalVariable(name: "SMTP_FSM", scope: !0, file: !658, line: 75, type: !659, isLocal: false, isDefinition: true, variable: [10 x %struct.anon]* @SMTP_FSM)
!658 = !DIFile(filename: "smtp.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 1280, align: 64, elements: !670)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !658, line: 72, size: 128, align: 64, elements: !661)
!661 = !{!662, !666}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !660, file: !658, line: 73, baseType: !663, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64, align: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!95, !244}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !660, file: !658, line: 74, baseType: !667, size: 64, align: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64, align: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!95, !244, !95}
!670 = !{!671}
!671 = !DISubrange(count: 10)
!672 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !490, line: 150, type: !218, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!673 = !{i32 2, !"Dwarf Version", i32 4}
!674 = !{i32 2, !"Debug Info Version", i32 3}
!675 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!676 = distinct !DISubprogram(name: "connection_error", scope: !658, file: !658, line: 108, type: !664, isLocal: true, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !677)
!677 = !{}
!678 = !DILocalVariable(name: "thread", arg: 1, scope: !676, file: !658, line: 108, type: !244)
!679 = !DIExpression()
!680 = !DILocation(line: 108, column: 29, scope: !676)
!681 = !DILocalVariable(name: "smtp", scope: !676, file: !658, line: 110, type: !90)
!682 = !DILocation(line: 110, column: 10, scope: !676)
!683 = !DILocation(line: 110, column: 19, scope: !676)
!684 = !DILocation(line: 110, column: 28, scope: !676)
!685 = !DILocation(line: 110, column: 17, scope: !676)
!686 = !DILocation(line: 113, column: 31, scope: !676)
!687 = !DILocation(line: 113, column: 44, scope: !676)
!688 = !DILocation(line: 113, column: 10, scope: !676)
!689 = !DILocation(line: 112, column: 2, scope: !676)
!690 = !DILocation(line: 114, column: 16, scope: !676)
!691 = !DILocation(line: 114, column: 2, scope: !676)
!692 = !DILocation(line: 115, column: 2, scope: !676)
!693 = distinct !DISubprogram(name: "connection_in_progress", scope: !658, file: !658, line: 128, type: !664, isLocal: true, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !677)
!694 = !DILocalVariable(name: "thread", arg: 1, scope: !693, file: !658, line: 128, type: !244)
!695 = !DILocation(line: 128, column: 35, scope: !693)
!696 = !DILocalVariable(name: "status", scope: !693, file: !658, line: 130, type: !95)
!697 = !DILocation(line: 130, column: 6, scope: !693)
!698 = !DILocation(line: 139, column: 28, scope: !693)
!699 = !DILocation(line: 139, column: 11, scope: !693)
!700 = !DILocation(line: 139, column: 9, scope: !693)
!701 = !DILocation(line: 141, column: 6, scope: !702)
!702 = distinct !DILexicalBlock(scope: !693, file: !658, line: 141, column: 6)
!703 = !DILocation(line: 141, column: 13, scope: !702)
!704 = !DILocation(line: 141, column: 6, scope: !693)
!705 = !DILocation(line: 142, column: 3, scope: !702)
!706 = distinct !{!706, !705}
!707 = !DILocation(line: 142, column: 24, scope: !708)
!708 = !DILexicalBlockFile(scope: !709, file: !658, discriminator: 1)
!709 = distinct !DILexicalBlock(scope: !710, file: !658, line: 142, column: 12)
!710 = distinct !DILexicalBlock(scope: !702, file: !658, line: 142, column: 6)
!711 = !DILocation(line: 142, column: 15, scope: !708)
!712 = !DILocation(line: 142, column: 32, scope: !708)
!713 = !DILocation(line: 142, column: 12, scope: !708)
!714 = !DILocation(line: 142, column: 52, scope: !715)
!715 = !DILexicalBlockFile(scope: !709, file: !658, discriminator: 2)
!716 = !DILocation(line: 142, column: 43, scope: !715)
!717 = !DILocation(line: 142, column: 60, scope: !715)
!718 = !DILocation(line: 142, column: 68, scope: !715)
!719 = !DILocation(line: 142, column: 40, scope: !715)
!720 = !DILocation(line: 142, column: 77, scope: !721)
!721 = !DILexicalBlockFile(scope: !710, file: !658, discriminator: 3)
!722 = !DILocation(line: 142, column: 77, scope: !723)
!723 = !DILexicalBlockFile(scope: !710, file: !658, discriminator: 4)
!724 = !DILocation(line: 144, column: 2, scope: !693)
!725 = distinct !DISubprogram(name: "connection_timeout", scope: !658, file: !658, line: 118, type: !664, isLocal: true, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !677)
!726 = !DILocalVariable(name: "thread", arg: 1, scope: !725, file: !658, line: 118, type: !244)
!727 = !DILocation(line: 118, column: 31, scope: !725)
!728 = !DILocalVariable(name: "smtp", scope: !725, file: !658, line: 120, type: !90)
!729 = !DILocation(line: 120, column: 10, scope: !725)
!730 = !DILocation(line: 120, column: 19, scope: !725)
!731 = !DILocation(line: 120, column: 28, scope: !725)
!732 = !DILocation(line: 120, column: 17, scope: !725)
!733 = !DILocation(line: 123, column: 31, scope: !725)
!734 = !DILocation(line: 123, column: 44, scope: !725)
!735 = !DILocation(line: 123, column: 10, scope: !725)
!736 = !DILocation(line: 122, column: 2, scope: !725)
!737 = !DILocation(line: 124, column: 16, scope: !725)
!738 = !DILocation(line: 124, column: 2, scope: !725)
!739 = !DILocation(line: 125, column: 2, scope: !725)
!740 = distinct !DISubprogram(name: "connection_success", scope: !658, file: !658, line: 147, type: !664, isLocal: true, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !677)
!741 = !DILocalVariable(name: "thread", arg: 1, scope: !740, file: !658, line: 147, type: !244)
!742 = !DILocation(line: 147, column: 31, scope: !740)
!743 = !DILocalVariable(name: "smtp", scope: !740, file: !658, line: 149, type: !90)
!744 = !DILocation(line: 149, column: 10, scope: !740)
!745 = !DILocation(line: 149, column: 19, scope: !740)
!746 = !DILocation(line: 149, column: 28, scope: !740)
!747 = !DILocation(line: 149, column: 17, scope: !740)
!748 = !DILocation(line: 152, column: 31, scope: !740)
!749 = !DILocation(line: 152, column: 44, scope: !740)
!750 = !DILocation(line: 152, column: 10, scope: !740)
!751 = !DILocation(line: 151, column: 2, scope: !740)
!752 = !DILocation(line: 154, column: 2, scope: !740)
!753 = !DILocation(line: 154, column: 8, scope: !740)
!754 = !DILocation(line: 154, column: 14, scope: !740)
!755 = !DILocation(line: 155, column: 18, scope: !740)
!756 = !DILocation(line: 155, column: 26, scope: !740)
!757 = !DILocation(line: 155, column: 52, scope: !740)
!758 = !DILocation(line: 156, column: 4, scope: !740)
!759 = !DILocation(line: 156, column: 10, scope: !740)
!760 = !DILocation(line: 156, column: 14, scope: !740)
!761 = !DILocation(line: 156, column: 27, scope: !740)
!762 = !DILocation(line: 155, column: 2, scope: !740)
!763 = !DILocation(line: 157, column: 2, scope: !740)
!764 = distinct !DISubprogram(name: "connection_code", scope: !658, file: !658, line: 302, type: !668, isLocal: true, isDefinition: true, scopeLine: 303, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !677)
!765 = !DILocalVariable(name: "thread", arg: 1, scope: !764, file: !658, line: 302, type: !244)
!766 = !DILocation(line: 302, column: 28, scope: !764)
!767 = !DILocalVariable(name: "status", arg: 2, scope: !764, file: !658, line: 302, type: !95)
!768 = !DILocation(line: 302, column: 40, scope: !764)
!769 = !DILocalVariable(name: "smtp", scope: !764, file: !658, line: 304, type: !90)
!770 = !DILocation(line: 304, column: 10, scope: !764)
!771 = !DILocation(line: 304, column: 19, scope: !764)
!772 = !DILocation(line: 304, column: 28, scope: !764)
!773 = !DILocation(line: 304, column: 17, scope: !764)
!774 = !DILocation(line: 306, column: 6, scope: !775)
!775 = distinct !DILexicalBlock(scope: !764, file: !658, line: 306, column: 6)
!776 = !DILocation(line: 306, column: 13, scope: !775)
!777 = !DILocation(line: 306, column: 6, scope: !764)
!778 = !DILocation(line: 307, column: 3, scope: !779)
!779 = distinct !DILexicalBlock(scope: !775, file: !658, line: 306, column: 21)
!780 = !DILocation(line: 307, column: 9, scope: !779)
!781 = !DILocation(line: 307, column: 14, scope: !779)
!782 = !DILocation(line: 308, column: 2, scope: !779)
!783 = !DILocation(line: 311, column: 32, scope: !784)
!784 = distinct !DILexicalBlock(scope: !775, file: !658, line: 308, column: 9)
!785 = !DILocation(line: 311, column: 45, scope: !784)
!786 = !DILocation(line: 311, column: 11, scope: !784)
!787 = !DILocation(line: 312, column: 11, scope: !784)
!788 = !DILocation(line: 309, column: 3, scope: !784)
!789 = !DILocation(line: 313, column: 3, scope: !784)
!790 = !DILocation(line: 313, column: 9, scope: !784)
!791 = !DILocation(line: 313, column: 15, scope: !784)
!792 = !DILocation(line: 316, column: 2, scope: !764)
!793 = distinct !DISubprogram(name: "helo_cmd", scope: !658, file: !658, line: 321, type: !664, isLocal: true, isDefinition: true, scopeLine: 322, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !677)
!794 = !DILocalVariable(name: "thread", arg: 1, scope: !793, file: !658, line: 321, type: !244)
!795 = !DILocation(line: 321, column: 21, scope: !793)
!796 = !DILocalVariable(name: "smtp", scope: !793, file: !658, line: 323, type: !90)
!797 = !DILocation(line: 323, column: 10, scope: !793)
!798 = !DILocation(line: 323, column: 19, scope: !793)
!799 = !DILocation(line: 323, column: 28, scope: !793)
!800 = !DILocation(line: 323, column: 17, scope: !793)
!801 = !DILocalVariable(name: "buffer", scope: !793, file: !658, line: 324, type: !100)
!802 = !DILocation(line: 324, column: 8, scope: !793)
!803 = !DILocation(line: 326, column: 21, scope: !793)
!804 = !DILocation(line: 326, column: 9, scope: !793)
!805 = !DILocation(line: 327, column: 11, scope: !793)
!806 = !DILocation(line: 327, column: 42, scope: !793)
!807 = !DILocation(line: 327, column: 55, scope: !793)
!808 = !DILocation(line: 327, column: 41, scope: !793)
!809 = !DILocation(line: 327, column: 73, scope: !810)
!810 = !DILexicalBlockFile(scope: !793, file: !658, discriminator: 1)
!811 = !DILocation(line: 327, column: 86, scope: !810)
!812 = !DILocation(line: 327, column: 41, scope: !810)
!813 = !DILocation(line: 327, column: 41, scope: !814)
!814 = !DILexicalBlockFile(scope: !793, file: !658, discriminator: 2)
!815 = !DILocation(line: 327, column: 41, scope: !816)
!816 = !DILexicalBlockFile(scope: !793, file: !658, discriminator: 3)
!817 = !DILocation(line: 327, column: 2, scope: !816)
!818 = !DILocation(line: 328, column: 11, scope: !819)
!819 = distinct !DILexicalBlock(scope: !793, file: !658, line: 328, column: 6)
!820 = !DILocation(line: 328, column: 19, scope: !819)
!821 = !DILocation(line: 328, column: 21, scope: !819)
!822 = !DILocation(line: 328, column: 25, scope: !819)
!823 = !DILocation(line: 328, column: 40, scope: !819)
!824 = !DILocation(line: 328, column: 33, scope: !819)
!825 = !DILocation(line: 328, column: 6, scope: !826)
!826 = !DILexicalBlockFile(scope: !819, file: !658, discriminator: 1)
!827 = !DILocation(line: 328, column: 52, scope: !819)
!828 = !DILocation(line: 328, column: 6, scope: !793)
!829 = !DILocation(line: 329, column: 3, scope: !819)
!830 = !DILocation(line: 329, column: 9, scope: !819)
!831 = !DILocation(line: 329, column: 15, scope: !819)
!832 = !DILocation(line: 330, column: 8, scope: !793)
!833 = !DILocation(line: 330, column: 3, scope: !793)
!834 = !DILocation(line: 330, column: 26, scope: !793)
!835 = !DILocation(line: 332, column: 2, scope: !793)
!836 = distinct !DISubprogram(name: "helo_code", scope: !658, file: !658, line: 335, type: !668, isLocal: true, isDefinition: true, scopeLine: 336, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !677)
!837 = !DILocalVariable(name: "thread", arg: 1, scope: !836, file: !658, line: 335, type: !244)
!838 = !DILocation(line: 335, column: 22, scope: !836)
!839 = !DILocalVariable(name: "status", arg: 2, scope: !836, file: !658, line: 335, type: !95)
!840 = !DILocation(line: 335, column: 34, scope: !836)
!841 = !DILocalVariable(name: "smtp", scope: !836, file: !658, line: 337, type: !90)
!842 = !DILocation(line: 337, column: 10, scope: !836)
!843 = !DILocation(line: 337, column: 19, scope: !836)
!844 = !DILocation(line: 337, column: 28, scope: !836)
!845 = !DILocation(line: 337, column: 17, scope: !836)
!846 = !DILocation(line: 339, column: 6, scope: !847)
!847 = distinct !DILexicalBlock(scope: !836, file: !658, line: 339, column: 6)
!848 = !DILocation(line: 339, column: 13, scope: !847)
!849 = !DILocation(line: 339, column: 6, scope: !836)
!850 = !DILocation(line: 340, column: 3, scope: !851)
!851 = distinct !DILexicalBlock(scope: !847, file: !658, line: 339, column: 21)
!852 = !DILocation(line: 340, column: 9, scope: !851)
!853 = !DILocation(line: 340, column: 14, scope: !851)
!854 = !DILocation(line: 341, column: 2, scope: !851)
!855 = !DILocation(line: 344, column: 32, scope: !856)
!856 = distinct !DILexicalBlock(scope: !847, file: !658, line: 341, column: 9)
!857 = !DILocation(line: 344, column: 45, scope: !856)
!858 = !DILocation(line: 344, column: 11, scope: !856)
!859 = !DILocation(line: 345, column: 11, scope: !856)
!860 = !DILocation(line: 342, column: 3, scope: !856)
!861 = !DILocation(line: 346, column: 3, scope: !856)
!862 = !DILocation(line: 346, column: 9, scope: !856)
!863 = !DILocation(line: 346, column: 15, scope: !856)
!864 = !DILocation(line: 349, column: 2, scope: !836)
!865 = distinct !DISubprogram(name: "mail_cmd", scope: !658, file: !658, line: 354, type: !664, isLocal: true, isDefinition: true, scopeLine: 355, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !677)
!866 = !DILocalVariable(name: "thread", arg: 1, scope: !865, file: !658, line: 354, type: !244)
!867 = !DILocation(line: 354, column: 21, scope: !865)
!868 = !DILocalVariable(name: "smtp", scope: !865, file: !658, line: 356, type: !90)
!869 = !DILocation(line: 356, column: 10, scope: !865)
!870 = !DILocation(line: 356, column: 19, scope: !865)
!871 = !DILocation(line: 356, column: 28, scope: !865)
!872 = !DILocation(line: 356, column: 17, scope: !865)
!873 = !DILocalVariable(name: "buffer", scope: !865, file: !658, line: 357, type: !100)
!874 = !DILocation(line: 357, column: 8, scope: !865)
!875 = !DILocation(line: 359, column: 21, scope: !865)
!876 = !DILocation(line: 359, column: 9, scope: !865)
!877 = !DILocation(line: 360, column: 11, scope: !865)
!878 = !DILocation(line: 360, column: 48, scope: !865)
!879 = !DILocation(line: 360, column: 61, scope: !865)
!880 = !DILocation(line: 360, column: 2, scope: !865)
!881 = !DILocation(line: 361, column: 11, scope: !882)
!882 = distinct !DILexicalBlock(scope: !865, file: !658, line: 361, column: 6)
!883 = !DILocation(line: 361, column: 19, scope: !882)
!884 = !DILocation(line: 361, column: 21, scope: !882)
!885 = !DILocation(line: 361, column: 25, scope: !882)
!886 = !DILocation(line: 361, column: 40, scope: !882)
!887 = !DILocation(line: 361, column: 33, scope: !882)
!888 = !DILocation(line: 361, column: 6, scope: !889)
!889 = !DILexicalBlockFile(scope: !882, file: !658, discriminator: 1)
!890 = !DILocation(line: 361, column: 52, scope: !882)
!891 = !DILocation(line: 361, column: 6, scope: !865)
!892 = !DILocation(line: 362, column: 3, scope: !882)
!893 = !DILocation(line: 362, column: 9, scope: !882)
!894 = !DILocation(line: 362, column: 15, scope: !882)
!895 = !DILocation(line: 363, column: 8, scope: !865)
!896 = !DILocation(line: 363, column: 3, scope: !865)
!897 = !DILocation(line: 363, column: 26, scope: !865)
!898 = !DILocation(line: 365, column: 2, scope: !865)
!899 = distinct !DISubprogram(name: "mail_code", scope: !658, file: !658, line: 368, type: !668, isLocal: true, isDefinition: true, scopeLine: 369, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !677)
!900 = !DILocalVariable(name: "thread", arg: 1, scope: !899, file: !658, line: 368, type: !244)
!901 = !DILocation(line: 368, column: 22, scope: !899)
!902 = !DILocalVariable(name: "status", arg: 2, scope: !899, file: !658, line: 368, type: !95)
!903 = !DILocation(line: 368, column: 34, scope: !899)
!904 = !DILocalVariable(name: "smtp", scope: !899, file: !658, line: 370, type: !90)
!905 = !DILocation(line: 370, column: 10, scope: !899)
!906 = !DILocation(line: 370, column: 19, scope: !899)
!907 = !DILocation(line: 370, column: 28, scope: !899)
!908 = !DILocation(line: 370, column: 17, scope: !899)
!909 = !DILocation(line: 372, column: 6, scope: !910)
!910 = distinct !DILexicalBlock(scope: !899, file: !658, line: 372, column: 6)
!911 = !DILocation(line: 372, column: 13, scope: !910)
!912 = !DILocation(line: 372, column: 6, scope: !899)
!913 = !DILocation(line: 373, column: 3, scope: !914)
!914 = distinct !DILexicalBlock(scope: !910, file: !658, line: 372, column: 21)
!915 = !DILocation(line: 373, column: 9, scope: !914)
!916 = !DILocation(line: 373, column: 14, scope: !914)
!917 = !DILocation(line: 374, column: 2, scope: !914)
!918 = !DILocation(line: 377, column: 32, scope: !919)
!919 = distinct !DILexicalBlock(scope: !910, file: !658, line: 374, column: 9)
!920 = !DILocation(line: 377, column: 45, scope: !919)
!921 = !DILocation(line: 377, column: 11, scope: !919)
!922 = !DILocation(line: 378, column: 11, scope: !919)
!923 = !DILocation(line: 375, column: 3, scope: !919)
!924 = !DILocation(line: 379, column: 3, scope: !919)
!925 = !DILocation(line: 379, column: 9, scope: !919)
!926 = !DILocation(line: 379, column: 15, scope: !919)
!927 = !DILocation(line: 382, column: 2, scope: !899)
!928 = distinct !DISubprogram(name: "rcpt_cmd", scope: !658, file: !658, line: 387, type: !664, isLocal: true, isDefinition: true, scopeLine: 388, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !677)
!929 = !DILocalVariable(name: "thread", arg: 1, scope: !928, file: !658, line: 387, type: !244)
!930 = !DILocation(line: 387, column: 21, scope: !928)
!931 = !DILocalVariable(name: "smtp", scope: !928, file: !658, line: 389, type: !90)
!932 = !DILocation(line: 389, column: 10, scope: !928)
!933 = !DILocation(line: 389, column: 19, scope: !928)
!934 = !DILocation(line: 389, column: 28, scope: !928)
!935 = !DILocation(line: 389, column: 17, scope: !928)
!936 = !DILocalVariable(name: "buffer", scope: !928, file: !658, line: 390, type: !100)
!937 = !DILocation(line: 390, column: 8, scope: !928)
!938 = !DILocalVariable(name: "fetched_email", scope: !928, file: !658, line: 391, type: !100)
!939 = !DILocation(line: 391, column: 8, scope: !928)
!940 = !DILocation(line: 393, column: 21, scope: !928)
!941 = !DILocation(line: 393, column: 9, scope: !928)
!942 = !DILocation(line: 397, column: 35, scope: !928)
!943 = !DILocation(line: 397, column: 18, scope: !928)
!944 = !DILocation(line: 397, column: 16, scope: !928)
!945 = !DILocation(line: 399, column: 11, scope: !928)
!946 = !DILocation(line: 399, column: 46, scope: !928)
!947 = !DILocation(line: 399, column: 2, scope: !928)
!948 = !DILocation(line: 400, column: 11, scope: !949)
!949 = distinct !DILexicalBlock(scope: !928, file: !658, line: 400, column: 6)
!950 = !DILocation(line: 400, column: 19, scope: !949)
!951 = !DILocation(line: 400, column: 21, scope: !949)
!952 = !DILocation(line: 400, column: 25, scope: !949)
!953 = !DILocation(line: 400, column: 40, scope: !949)
!954 = !DILocation(line: 400, column: 33, scope: !949)
!955 = !DILocation(line: 400, column: 6, scope: !956)
!956 = !DILexicalBlockFile(scope: !949, file: !658, discriminator: 1)
!957 = !DILocation(line: 400, column: 52, scope: !949)
!958 = !DILocation(line: 400, column: 6, scope: !928)
!959 = !DILocation(line: 401, column: 3, scope: !949)
!960 = !DILocation(line: 401, column: 9, scope: !949)
!961 = !DILocation(line: 401, column: 15, scope: !949)
!962 = !DILocation(line: 402, column: 8, scope: !928)
!963 = !DILocation(line: 402, column: 3, scope: !928)
!964 = !DILocation(line: 402, column: 26, scope: !928)
!965 = !DILocation(line: 404, column: 2, scope: !928)
!966 = distinct !DISubprogram(name: "rcpt_code", scope: !658, file: !658, line: 407, type: !668, isLocal: true, isDefinition: true, scopeLine: 408, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !677)
!967 = !DILocalVariable(name: "thread", arg: 1, scope: !966, file: !658, line: 407, type: !244)
!968 = !DILocation(line: 407, column: 22, scope: !966)
!969 = !DILocalVariable(name: "status", arg: 2, scope: !966, file: !658, line: 407, type: !95)
!970 = !DILocation(line: 407, column: 34, scope: !966)
!971 = !DILocalVariable(name: "smtp", scope: !966, file: !658, line: 409, type: !90)
!972 = !DILocation(line: 409, column: 10, scope: !966)
!973 = !DILocation(line: 409, column: 19, scope: !966)
!974 = !DILocation(line: 409, column: 28, scope: !966)
!975 = !DILocation(line: 409, column: 17, scope: !966)
!976 = !DILocalVariable(name: "fetched_email", scope: !966, file: !658, line: 410, type: !100)
!977 = !DILocation(line: 410, column: 8, scope: !966)
!978 = !DILocation(line: 412, column: 6, scope: !979)
!979 = distinct !DILexicalBlock(scope: !966, file: !658, line: 412, column: 6)
!980 = !DILocation(line: 412, column: 13, scope: !979)
!981 = !DILocation(line: 412, column: 6, scope: !966)
!982 = !DILocation(line: 413, column: 3, scope: !983)
!983 = distinct !DILexicalBlock(scope: !979, file: !658, line: 412, column: 21)
