; ModuleID = './[inter]keepalived--core--global_data.o.i'
source_filename = "./[inter]keepalived--core--global_data.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._data = type { i8*, i8, i8*, i8, i8*, i8*, %struct.sockaddr_storage, i8*, i64, %struct._list*, i32, i8, i8, i32, i8*, %struct._interface*, i32, i32, i32, i32, %struct.lvs_syncd_config, i8, %struct.sockaddr_in, %struct.sockaddr_in6, i32, %struct.timeval, i32, i32, i32, i32, i32, i32, i8, i8, i32, [29 x i8], [29 x i8], i8, [32 x i8], [32 x i8], [32 x i8], i8, i8, i8, i8, i8, i8, i32, i64, i8, i8, i8, i32, i64, %struct._notify_fifo, %struct._notify_fifo, %struct._notify_fifo, i32, i8, i32, i8, i32, i8, i32, i8, i8, i8, i32, i64, i32 }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !37, globals: !598)
!1 = !DIFile(filename: "[inter]keepalived--core--global_data.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!2 = !{!3, !11, !32}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chksum_compatibility", file: !4, line: 173, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./../include/vrrp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NONE", value: 0)
!7 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NEVER", value: 1)
!8 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_MIN_COMPAT", value: 2)
!9 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_CONFIG", value: 3)
!10 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_AUTO", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 41, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "../../lib/scheduler.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!14 = !DIEnumerator(name: "THREAD_READ", value: 0)
!15 = !DIEnumerator(name: "THREAD_WRITE", value: 1)
!16 = !DIEnumerator(name: "THREAD_TIMER", value: 2)
!17 = !DIEnumerator(name: "THREAD_TIMER_SHUTDOWN", value: 3)
!18 = !DIEnumerator(name: "THREAD_EVENT", value: 4)
!19 = !DIEnumerator(name: "THREAD_CHILD", value: 5)
!20 = !DIEnumerator(name: "THREAD_READY", value: 6)
!21 = !DIEnumerator(name: "THREAD_UNUSED", value: 7)
!22 = !DIEnumerator(name: "THREAD_WRITE_TIMEOUT", value: 8)
!23 = !DIEnumerator(name: "THREAD_READ_TIMEOUT", value: 9)
!24 = !DIEnumerator(name: "THREAD_CHILD_TIMEOUT", value: 10)
!25 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!26 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!27 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!28 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!29 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!30 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!31 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 152, size: 32, align: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "PROG_TYPE_PARENT", value: 0)
!35 = !DIEnumerator(name: "PROG_TYPE_VRRP", value: 1)
!36 = !DIEnumerator(name: "PROG_TYPE_CHECKER", value: 2)
!37 = !{!38, !40, !597, !81}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "data_t", file: !42, line: 214, baseType: !43)
!42 = !DIFile(filename: "./../include/global_data.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_data", file: !42, line: 76, size: 6720, align: 64, elements: !44)
!44 = !{!45, !46, !48, !49, !50, !51, !52, !66, !67, !68, !151, !152, !153, !154, !155, !156, !245, !246, !247, !248, !249, !519, !520, !529, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !552, !553, !554, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !569, !570, !571, !572, !573, !574, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "network_namespace", scope: !43, file: !42, line: 78, baseType: !38, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_with_ipsets", scope: !43, file: !42, line: 79, baseType: !47, size: 8, align: 8, offset: 64)
!47 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "instance_name", scope: !43, file: !42, line: 81, baseType: !38, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !43, file: !42, line: 82, baseType: !47, size: 8, align: 8, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "router_id", scope: !43, file: !42, line: 83, baseType: !38, size: 64, align: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "email_from", scope: !43, file: !42, line: 84, baseType: !38, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_server", scope: !43, file: !42, line: 85, baseType: !53, size: 1024, align: 64, offset: 384)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !54, line: 166, size: 1024, align: 64, elements: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!55 = !{!56, !60, !64}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !53, file: !54, line: 168, baseType: !57, size: 16, align: 16)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !58, line: 28, baseType: !59)
!58 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!59 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !53, file: !54, line: 169, baseType: !61, size: 944, align: 8, offset: 16)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 944, align: 8, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 118)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !53, file: !54, line: 170, baseType: !65, size: 64, align: 64, offset: 960)
!65 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_helo_name", scope: !43, file: !42, line: 86, baseType: !38, size: 64, align: 64, offset: 1408)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_connection_to", scope: !43, file: !42, line: 87, baseType: !65, size: 64, align: 64, offset: 1472)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "email", scope: !43, file: !42, line: 88, baseType: !69, size: 64, align: 64, offset: 1536)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !70, line: 31, baseType: !71)
!70 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !70, line: 39, size: 320, align: 64, elements: !73)
!73 = !{!74, !82, !83, !85, !89}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !72, file: !70, line: 40, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !70, line: 33, size: 192, align: 64, elements: !77)
!77 = !{!78, !79, !80}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !76, file: !70, line: 34, baseType: !75, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !76, file: !70, line: 35, baseType: !75, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !76, file: !70, line: 36, baseType: !81, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !72, file: !70, line: 41, baseType: !75, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !72, file: !70, line: 42, baseType: !84, size: 32, align: 32, offset: 128)
!84 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !72, file: !70, line: 43, baseType: !86, size: 64, align: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !81}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !72, file: !70, line: 44, baseType: !90, size: 64, align: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !93, !81}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !95, line: 48, baseType: !96)
!95 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !97, line: 241, size: 1728, align: 64, elements: !98)
!97 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!98 = !{!99, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !120, !121, !122, !123, !127, !128, !130, !134, !137, !139, !140, !141, !142, !143, !146, !147}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !96, file: !97, line: 242, baseType: !100, size: 32, align: 32)
!100 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !96, file: !97, line: 247, baseType: !38, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !96, file: !97, line: 248, baseType: !38, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !96, file: !97, line: 249, baseType: !38, size: 64, align: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !96, file: !97, line: 250, baseType: !38, size: 64, align: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !96, file: !97, line: 251, baseType: !38, size: 64, align: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !96, file: !97, line: 252, baseType: !38, size: 64, align: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !96, file: !97, line: 253, baseType: !38, size: 64, align: 64, offset: 448)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !96, file: !97, line: 254, baseType: !38, size: 64, align: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !96, file: !97, line: 256, baseType: !38, size: 64, align: 64, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !96, file: !97, line: 257, baseType: !38, size: 64, align: 64, offset: 640)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !96, file: !97, line: 258, baseType: !38, size: 64, align: 64, offset: 704)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !96, file: !97, line: 260, baseType: !113, size: 64, align: 64, offset: 768)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !97, line: 156, size: 192, align: 64, elements: !115)
!115 = !{!116, !117, !119}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !114, file: !97, line: 157, baseType: !113, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !114, file: !97, line: 158, baseType: !118, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !114, file: !97, line: 162, baseType: !100, size: 32, align: 32, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !96, file: !97, line: 262, baseType: !118, size: 64, align: 64, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !96, file: !97, line: 264, baseType: !100, size: 32, align: 32, offset: 896)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !96, file: !97, line: 268, baseType: !100, size: 32, align: 32, offset: 928)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !96, file: !97, line: 270, baseType: !124, size: 64, align: 64, offset: 960)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !125, line: 131, baseType: !126)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!126 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !96, file: !97, line: 274, baseType: !59, size: 16, align: 16, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !96, file: !97, line: 275, baseType: !129, size: 8, align: 8, offset: 1040)
!129 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !96, file: !97, line: 276, baseType: !131, size: 8, align: 8, offset: 1048)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8, align: 8, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 1)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !96, file: !97, line: 280, baseType: !135, size: 64, align: 64, offset: 1088)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !97, line: 150, baseType: null)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !96, file: !97, line: 289, baseType: !138, size: 64, align: 64, offset: 1152)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !125, line: 132, baseType: !126)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !96, file: !97, line: 297, baseType: !81, size: 64, align: 64, offset: 1216)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !96, file: !97, line: 298, baseType: !81, size: 64, align: 64, offset: 1280)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !96, file: !97, line: 299, baseType: !81, size: 64, align: 64, offset: 1344)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !96, file: !97, line: 300, baseType: !81, size: 64, align: 64, offset: 1408)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !96, file: !97, line: 302, baseType: !144, size: 64, align: 64, offset: 1472)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !145, line: 216, baseType: !65)
!145 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !96, file: !97, line: 303, baseType: !100, size: 32, align: 32, offset: 1536)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !96, file: !97, line: 305, baseType: !148, size: 160, align: 8, offset: 1568)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 160, align: 8, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 20)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !43, file: !42, line: 89, baseType: !100, size: 32, align: 32, offset: 1600)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic_interfaces", scope: !43, file: !42, line: 91, baseType: !47, size: 8, align: 8, offset: 1632)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "no_email_faults", scope: !43, file: !42, line: 92, baseType: !47, size: 8, align: 8, offset: 1640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert_vrrp", scope: !43, file: !42, line: 93, baseType: !100, size: 32, align: 32, offset: 1664)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "default_ifname", scope: !43, file: !42, line: 94, baseType: !38, size: 64, align: 64, offset: 1728)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "default_ifp", scope: !43, file: !42, line: 95, baseType: !157, size: 64, align: 64, offset: 1792)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !159, line: 111, baseType: !160)
!159 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !159, line: 76, size: 1792, align: 64, elements: !161)
!161 = !{!162, !166, !170, !176, !195, !196, !197, !198, !199, !206, !207, !208, !209, !210, !211, !213, !214, !215, !216, !237, !238, !239, !240, !241, !242, !243, !244}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !160, file: !159, line: 77, baseType: !163, size: 128, align: 8)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 128, align: 8, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 16)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !160, file: !159, line: 78, baseType: !167, size: 32, align: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !159, line: 62, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !169, line: 51, baseType: !84)
!169 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!170 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !160, file: !159, line: 79, baseType: !171, size: 32, align: 32, offset: 160)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !172, line: 31, size: 32, align: 32, elements: !173)
!172 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!173 = !{!174}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !171, file: !172, line: 33, baseType: !175, size: 32, align: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !172, line: 30, baseType: !168)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !160, file: !159, line: 80, baseType: !177, size: 128, align: 32, offset: 192)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !172, line: 211, size: 128, align: 32, elements: !178)
!178 = !{!179}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !177, file: !172, line: 220, baseType: !180, size: 128, align: 32)
!180 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !177, file: !172, line: 213, size: 128, align: 32, elements: !181)
!181 = !{!182, !186, !191}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !180, file: !172, line: 215, baseType: !183, size: 128, align: 8)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 128, align: 8, elements: !164)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !169, line: 48, baseType: !185)
!185 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !180, file: !172, line: 217, baseType: !187, size: 128, align: 16)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 128, align: 16, elements: !189)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !169, line: 49, baseType: !59)
!189 = !{!190}
!190 = !DISubrange(count: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !180, file: !172, line: 218, baseType: !192, size: 128, align: 32)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 128, align: 32, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 4)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !160, file: !159, line: 81, baseType: !84, size: 32, align: 32, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !160, file: !159, line: 82, baseType: !47, size: 8, align: 8, offset: 352)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !160, file: !159, line: 83, baseType: !168, size: 32, align: 32, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !160, file: !159, line: 84, baseType: !59, size: 16, align: 16, offset: 416)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !160, file: !159, line: 85, baseType: !200, size: 256, align: 8, offset: 432)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 256, align: 8, elements: !204)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !202, line: 33, baseType: !203)
!202 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !125, line: 30, baseType: !185)
!204 = !{!205}
!205 = !DISubrange(count: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !160, file: !159, line: 86, baseType: !200, size: 256, align: 8, offset: 688)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !160, file: !159, line: 87, baseType: !144, size: 64, align: 64, offset: 960)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !160, file: !159, line: 88, baseType: !100, size: 32, align: 32, offset: 1024)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !160, file: !159, line: 90, baseType: !47, size: 8, align: 8, offset: 1056)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !160, file: !159, line: 91, baseType: !167, size: 32, align: 32, offset: 1088)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !160, file: !159, line: 92, baseType: !212, size: 64, align: 64, offset: 1152)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !160, file: !159, line: 94, baseType: !167, size: 32, align: 32, offset: 1216)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !160, file: !159, line: 96, baseType: !212, size: 64, align: 64, offset: 1280)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !160, file: !159, line: 97, baseType: !47, size: 8, align: 8, offset: 1344)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !160, file: !159, line: 100, baseType: !217, size: 64, align: 64, offset: 1408)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !159, line: 73, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !159, line: 65, size: 704, align: 64, elements: !220)
!220 = !{!221, !231, !232, !233, !234, !235, !236}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !219, file: !159, line: 66, baseType: !222, size: 128, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !223, line: 31, baseType: !224)
!223 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !225, line: 30, size: 128, align: 64, elements: !226)
!225 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!226 = !{!227, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !224, file: !225, line: 32, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !125, line: 139, baseType: !126)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !224, file: !225, line: 33, baseType: !230, size: 64, align: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !125, line: 141, baseType: !126)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !219, file: !159, line: 67, baseType: !47, size: 8, align: 8, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !219, file: !159, line: 68, baseType: !222, size: 128, align: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !219, file: !159, line: 69, baseType: !47, size: 8, align: 8, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !219, file: !159, line: 70, baseType: !222, size: 128, align: 64, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !219, file: !159, line: 71, baseType: !222, size: 128, align: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !219, file: !159, line: 72, baseType: !100, size: 32, align: 32, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !160, file: !159, line: 101, baseType: !47, size: 8, align: 8, offset: 1472)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !160, file: !159, line: 102, baseType: !100, size: 32, align: 32, offset: 1504)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !160, file: !159, line: 103, baseType: !168, size: 32, align: 32, offset: 1536)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !160, file: !159, line: 104, baseType: !168, size: 32, align: 32, offset: 1568)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !160, file: !159, line: 105, baseType: !168, size: 32, align: 32, offset: 1600)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !160, file: !159, line: 107, baseType: !84, size: 32, align: 32, offset: 1632)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !160, file: !159, line: 109, baseType: !47, size: 8, align: 8, offset: 1664)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !160, file: !159, line: 110, baseType: !69, size: 64, align: 64, offset: 1728)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "lvs_tcp_timeout", scope: !43, file: !42, line: 98, baseType: !100, size: 32, align: 32, offset: 1856)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "lvs_tcpfin_timeout", scope: !43, file: !42, line: 99, baseType: !100, size: 32, align: 32, offset: 1888)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lvs_udp_timeout", scope: !43, file: !42, line: 100, baseType: !100, size: 32, align: 32, offset: 1920)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert_checker", scope: !43, file: !42, line: 101, baseType: !100, size: 32, align: 32, offset: 1952)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "lvs_syncd", scope: !43, file: !42, line: 103, baseType: !250, size: 1344, align: 64, offset: 1984)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lvs_syncd_config", file: !251, line: 56, size: 1344, align: 64, elements: !252)
!251 = !DIFile(filename: "./../include/ipvswrapper.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!252 = !{!253, !254, !513, !514, !515, !516, !517, !518}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !250, file: !251, line: 57, baseType: !38, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp", scope: !250, file: !251, line: 58, baseType: !255, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_t", file: !4, line: 310, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_t", file: !4, line: 183, size: 7040, align: 64, elements: !258)
!258 = !{!259, !260, !261, !310, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !505, !512}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !257, file: !4, line: 184, baseType: !57, size: 16, align: 16)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !257, file: !4, line: 185, baseType: !38, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !257, file: !4, line: 186, baseType: !262, size: 64, align: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_sgroup_t", file: !4, line: 133, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_sgroup", file: !4, line: 109, size: 1024, align: 64, elements: !265)
!265 = !{!266, !267, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !304, !305, !306, !307, !308, !309}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !264, file: !4, line: 110, baseType: !38, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !264, file: !4, line: 111, baseType: !268, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !270, line: 34, baseType: !271)
!270 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !270, line: 30, size: 128, align: 64, elements: !272)
!272 = !{!273, !274, !275}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !271, file: !270, line: 31, baseType: !84, size: 32, align: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !271, file: !270, line: 32, baseType: !84, size: 32, align: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !271, file: !270, line: 33, baseType: !276, size: 64, align: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !264, file: !4, line: 112, baseType: !69, size: 64, align: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_fault", scope: !264, file: !4, line: 113, baseType: !84, size: 32, align: 32, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_init", scope: !264, file: !4, line: 114, baseType: !84, size: 32, align: 32, offset: 224)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !264, file: !4, line: 115, baseType: !100, size: 32, align: 32, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "sgroup_tracking_weight", scope: !264, file: !4, line: 116, baseType: !47, size: 8, align: 8, offset: 288)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !264, file: !4, line: 119, baseType: !69, size: 64, align: 64, offset: 320)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !264, file: !4, line: 120, baseType: !69, size: 64, align: 64, offset: 384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !264, file: !4, line: 121, baseType: !69, size: 64, align: 64, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "track_bfd", scope: !264, file: !4, line: 122, baseType: !69, size: 64, align: 64, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !264, file: !4, line: 125, baseType: !47, size: 8, align: 8, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !264, file: !4, line: 126, baseType: !288, size: 64, align: 64, offset: 640)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !290, line: 65, baseType: !291)
!290 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !290, line: 59, size: 192, align: 64, elements: !292)
!292 = !{!293, !295, !296, !297, !301}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !291, file: !290, line: 60, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !291, file: !290, line: 61, baseType: !100, size: 32, align: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !291, file: !290, line: 62, baseType: !100, size: 32, align: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !291, file: !290, line: 63, baseType: !298, size: 32, align: 32, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !299, line: 240, baseType: !300)
!299 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !125, line: 125, baseType: !84)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !291, file: !290, line: 64, baseType: !302, size: 32, align: 32, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !299, line: 235, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !125, line: 126, baseType: !84)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !264, file: !4, line: 127, baseType: !288, size: 64, align: 64, offset: 704)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !264, file: !4, line: 128, baseType: !288, size: 64, align: 64, offset: 768)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !264, file: !4, line: 129, baseType: !288, size: 64, align: 64, offset: 832)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !264, file: !4, line: 130, baseType: !288, size: 64, align: 64, offset: 896)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !264, file: !4, line: 131, baseType: !100, size: 32, align: 32, offset: 960)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !264, file: !4, line: 132, baseType: !100, size: 32, align: 32, offset: 992)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !257, file: !4, line: 187, baseType: !311, size: 64, align: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_stats", file: !4, line: 169, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_stats", file: !4, line: 136, size: 768, align: 64, elements: !314)
!314 = !{!315, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "advert_rcvd", scope: !313, file: !4, line: 137, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !169, line: 55, baseType: !65)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "advert_sent", scope: !313, file: !4, line: 138, baseType: !168, size: 32, align: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "become_master", scope: !313, file: !4, line: 140, baseType: !168, size: 32, align: 32, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "release_master", scope: !313, file: !4, line: 141, baseType: !168, size: 32, align: 32, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "packet_len_err", scope: !313, file: !4, line: 143, baseType: !316, size: 64, align: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "advert_interval_err", scope: !313, file: !4, line: 144, baseType: !316, size: 64, align: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl_err", scope: !313, file: !4, line: 145, baseType: !316, size: 64, align: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_type_rcvd", scope: !313, file: !4, line: 146, baseType: !316, size: 64, align: 64, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list_err", scope: !313, file: !4, line: 147, baseType: !316, size: 64, align: 64, offset: 448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_authtype", scope: !313, file: !4, line: 149, baseType: !168, size: 32, align: 32, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "authtype_mismatch", scope: !313, file: !4, line: 151, baseType: !168, size: 32, align: 32, offset: 544)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "auth_failure", scope: !313, file: !4, line: 152, baseType: !168, size: 32, align: 32, offset: 576)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_rcvd", scope: !313, file: !4, line: 155, baseType: !316, size: 64, align: 64, offset: 640)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_sent", scope: !313, file: !4, line: 156, baseType: !316, size: 64, align: 64, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !257, file: !4, line: 188, baseType: !157, size: 64, align: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track_primary", scope: !257, file: !4, line: 189, baseType: !47, size: 8, align: 8, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !257, file: !4, line: 190, baseType: !47, size: 8, align: 8, offset: 328)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "skip_check_adv_addr", scope: !257, file: !4, line: 191, baseType: !47, size: 8, align: 8, offset: 336)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "strict_mode", scope: !257, file: !4, line: 193, baseType: !84, size: 32, align: 32, offset: 352)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_flags", scope: !257, file: !4, line: 195, baseType: !65, size: 64, align: 64, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_ifname", scope: !257, file: !4, line: 196, baseType: !163, size: 128, align: 8, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !257, file: !4, line: 198, baseType: !69, size: 64, align: 64, offset: 576)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !257, file: !4, line: 199, baseType: !69, size: 64, align: 64, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !257, file: !4, line: 200, baseType: !69, size: 64, align: 64, offset: 704)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_if_fault", scope: !257, file: !4, line: 204, baseType: !84, size: 32, align: 32, offset: 768)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_init", scope: !257, file: !4, line: 205, baseType: !84, size: 32, align: 32, offset: 800)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !257, file: !4, line: 206, baseType: !53, size: 1024, align: 64, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "saddr_from_config", scope: !257, file: !4, line: 207, baseType: !47, size: 8, align: 8, offset: 1856)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "track_saddr", scope: !257, file: !4, line: 208, baseType: !47, size: 8, align: 8, offset: 1864)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_saddr", scope: !257, file: !4, line: 209, baseType: !53, size: 1024, align: 64, offset: 1920)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_peer", scope: !257, file: !4, line: 210, baseType: !69, size: 64, align: 64, offset: 2944)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_chksum_compat", scope: !257, file: !4, line: 212, baseType: !348, size: 32, align: 32, offset: 3008)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "chksum_compatibility_t", file: !4, line: 179, baseType: !3)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "master_saddr", scope: !257, file: !4, line: 214, baseType: !53, size: 1024, align: 64, offset: 3072)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "master_priority", scope: !257, file: !4, line: 215, baseType: !184, size: 8, align: 8, offset: 4096)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "last_transition", scope: !257, file: !4, line: 216, baseType: !222, size: 128, align: 64, offset: 4160)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !257, file: !4, line: 217, baseType: !84, size: 32, align: 32, offset: 4288)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh", scope: !257, file: !4, line: 218, baseType: !222, size: 128, align: 64, offset: 4352)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_timer", scope: !257, file: !4, line: 219, baseType: !222, size: 128, align: 64, offset: 4480)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "garp_rep", scope: !257, file: !4, line: 220, baseType: !84, size: 32, align: 32, offset: 4608)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_rep", scope: !257, file: !4, line: 221, baseType: !84, size: 32, align: 32, offset: 4640)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_delay", scope: !257, file: !4, line: 222, baseType: !84, size: 32, align: 32, offset: 4672)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "garp_pending", scope: !257, file: !4, line: 223, baseType: !47, size: 8, align: 8, offset: 4704)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "gna_pending", scope: !257, file: !4, line: 224, baseType: !47, size: 8, align: 8, offset: 4712)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_rep", scope: !257, file: !4, line: 225, baseType: !84, size: 32, align: 32, offset: 4736)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "lower_prio_no_advert", scope: !257, file: !4, line: 226, baseType: !84, size: 32, align: 32, offset: 4768)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "higher_prio_send_advert", scope: !257, file: !4, line: 227, baseType: !84, size: 32, align: 32, offset: 4800)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "vrid", scope: !257, file: !4, line: 228, baseType: !184, size: 8, align: 8, offset: 4832)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "base_priority", scope: !257, file: !4, line: 229, baseType: !184, size: 8, align: 8, offset: 4840)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "effective_priority", scope: !257, file: !4, line: 230, baseType: !184, size: 8, align: 8, offset: 4848)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "total_priority", scope: !257, file: !4, line: 231, baseType: !100, size: 32, align: 32, offset: 4864)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "vipset", scope: !257, file: !4, line: 233, baseType: !47, size: 8, align: 8, offset: 4896)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !257, file: !4, line: 234, baseType: !69, size: 64, align: 64, offset: 4928)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "evip", scope: !257, file: !4, line: 235, baseType: !69, size: 64, align: 64, offset: 4992)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries", scope: !257, file: !4, line: 239, baseType: !47, size: 8, align: 8, offset: 5056)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "evip_add_ipv6", scope: !257, file: !4, line: 240, baseType: !47, size: 8, align: 8, offset: 5064)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "vroutes", scope: !257, file: !4, line: 241, baseType: !69, size: 64, align: 64, offset: 5120)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vrules", scope: !257, file: !4, line: 242, baseType: !69, size: 64, align: 64, offset: 5184)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "adver_int", scope: !257, file: !4, line: 243, baseType: !84, size: 32, align: 32, offset: 5248)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "master_adver_int", scope: !257, file: !4, line: 244, baseType: !84, size: 32, align: 32, offset: 5280)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !257, file: !4, line: 249, baseType: !84, size: 32, align: 32, offset: 5312)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_rx_buf_size", scope: !257, file: !4, line: 252, baseType: !144, size: 64, align: 64, offset: 5376)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rules_set", scope: !257, file: !4, line: 254, baseType: !47, size: 8, align: 8, offset: 5440)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "nopreempt", scope: !257, file: !4, line: 255, baseType: !47, size: 8, align: 8, offset: 5448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_delay", scope: !257, file: !4, line: 256, baseType: !65, size: 64, align: 64, offset: 5504)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_time", scope: !257, file: !4, line: 260, baseType: !222, size: 128, align: 64, offset: 5568)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !257, file: !4, line: 261, baseType: !100, size: 32, align: 32, offset: 5696)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "wantstate", scope: !257, file: !4, line: 265, baseType: !100, size: 32, align: 32, offset: 5728)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "reload_master", scope: !257, file: !4, line: 266, baseType: !47, size: 8, align: 8, offset: 5760)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sockets", scope: !257, file: !4, line: 267, baseType: !386, size: 64, align: 64, offset: 5824)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_t", file: !388, line: 50, baseType: !389)
!388 = !DIFile(filename: "./../include/vrrp_sock.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sock", file: !388, line: 40, size: 1344, align: 64, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396, !397, !398, !399}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !389, file: !388, line: 41, baseType: !57, size: 16, align: 16)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !389, file: !388, line: 42, baseType: !53, size: 1024, align: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !389, file: !388, line: 43, baseType: !100, size: 32, align: 32, offset: 1088)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !389, file: !388, line: 44, baseType: !167, size: 32, align: 32, offset: 1120)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "unicast", scope: !389, file: !388, line: 45, baseType: !47, size: 8, align: 8, offset: 1152)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "fd_in", scope: !389, file: !388, line: 46, baseType: !100, size: 32, align: 32, offset: 1184)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "fd_out", scope: !389, file: !388, line: 47, baseType: !100, size: 32, align: 32, offset: 1216)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_size", scope: !389, file: !388, line: 48, baseType: !100, size: 32, align: 32, offset: 1248)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !389, file: !388, line: 49, baseType: !400, size: 64, align: 64, offset: 1280)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !12, line: 99, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !12, line: 78, size: 768, align: 64, elements: !403)
!403 = !{!404, !405, !407, !460, !465, !466, !467, !479, !481}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !402, file: !12, line: 79, baseType: !65, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !402, file: !12, line: 80, baseType: !406, size: 32, align: 32, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !12, line: 63, baseType: !11)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !402, file: !12, line: 81, baseType: !408, size: 64, align: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !12, line: 112, size: 1280, align: 64, elements: !410)
!410 = !{!411, !423, !424, !425, !426, !434, !435, !436, !437, !438, !441, !452, !453, !454, !455, !456, !457, !458, !459}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !409, file: !12, line: 113, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !413, line: 109, baseType: !414)
!413 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !413, line: 106, size: 64, align: 64, elements: !415)
!415 = !{!416}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !414, file: !413, line: 108, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !413, line: 97, size: 192, align: 64, elements: !419)
!419 = !{!420, !421, !422}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !418, file: !413, line: 99, baseType: !65, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !418, file: !413, line: 102, baseType: !417, size: 64, align: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !418, file: !413, line: 103, baseType: !417, size: 64, align: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !409, file: !12, line: 114, baseType: !412, size: 64, align: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !409, file: !12, line: 115, baseType: !412, size: 64, align: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !409, file: !12, line: 116, baseType: !412, size: 64, align: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !409, file: !12, line: 117, baseType: !427, size: 128, align: 64, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !428, line: 62, baseType: !429)
!428 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !428, line: 60, size: 128, align: 64, elements: !430)
!430 = !{!431, !433}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !429, file: !428, line: 61, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !429, file: !428, line: 61, baseType: !432, size: 64, align: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !409, file: !12, line: 121, baseType: !427, size: 128, align: 64, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !409, file: !12, line: 122, baseType: !427, size: 128, align: 64, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !409, file: !12, line: 124, baseType: !69, size: 64, align: 64, offset: 640)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !409, file: !12, line: 127, baseType: !412, size: 64, align: 64, offset: 704)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !409, file: !12, line: 128, baseType: !439, size: 64, align: 64, offset: 768)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !12, line: 128, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !409, file: !12, line: 129, baseType: !442, size: 64, align: 64, offset: 832)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !12, line: 109, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !12, line: 102, size: 448, align: 64, elements: !445)
!445 = !{!446, !447, !448, !449, !450}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !444, file: !12, line: 103, baseType: !400, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !444, file: !12, line: 104, baseType: !400, size: 64, align: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !444, file: !12, line: 105, baseType: !65, size: 64, align: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !444, file: !12, line: 106, baseType: !100, size: 32, align: 32, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !444, file: !12, line: 108, baseType: !451, size: 192, align: 64, offset: 256)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !413, line: 104, baseType: !418)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !409, file: !12, line: 130, baseType: !84, size: 32, align: 32, offset: 896)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !409, file: !12, line: 131, baseType: !84, size: 32, align: 32, offset: 928)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !409, file: !12, line: 132, baseType: !100, size: 32, align: 32, offset: 960)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !409, file: !12, line: 135, baseType: !100, size: 32, align: 32, offset: 992)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !409, file: !12, line: 136, baseType: !400, size: 64, align: 64, offset: 1024)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !409, file: !12, line: 146, baseType: !65, size: 64, align: 64, offset: 1088)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !409, file: !12, line: 147, baseType: !65, size: 64, align: 64, offset: 1152)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !409, file: !12, line: 148, baseType: !47, size: 8, align: 8, offset: 1216)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !402, file: !12, line: 82, baseType: !461, size: 64, align: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!100, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !402, file: !12, line: 83, baseType: !81, size: 64, align: 64, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !402, file: !12, line: 84, baseType: !222, size: 128, align: 64, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !402, file: !12, line: 92, baseType: !468, size: 64, align: 32, offset: 448)
!468 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !402, file: !12, line: 85, size: 64, align: 32, elements: !469)
!469 = !{!470, !471, !472}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !468, file: !12, line: 86, baseType: !100, size: 32, align: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !468, file: !12, line: 87, baseType: !100, size: 32, align: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !468, file: !12, line: 91, baseType: !473, size: 64, align: 32)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !468, file: !12, line: 88, size: 64, align: 32, elements: !474)
!474 = !{!475, !478}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !473, file: !12, line: 89, baseType: !476, size: 32, align: 32)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !299, line: 263, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !125, line: 133, baseType: !100)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !473, file: !12, line: 90, baseType: !100, size: 32, align: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !402, file: !12, line: 93, baseType: !480, size: 64, align: 64, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, scope: !402, file: !12, line: 95, baseType: !482, size: 192, align: 64, offset: 576)
!482 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !402, file: !12, line: 95, size: 192, align: 64, elements: !483)
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !482, file: !12, line: 96, baseType: !451, size: 192, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !482, file: !12, line: 97, baseType: !427, size: 128, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !257, file: !4, line: 269, baseType: !100, size: 32, align: 32, offset: 5888)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !257, file: !4, line: 271, baseType: !100, size: 32, align: 32, offset: 5920)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !257, file: !4, line: 274, baseType: !100, size: 32, align: 32, offset: 5952)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !257, file: !4, line: 275, baseType: !100, size: 32, align: 32, offset: 5984)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !257, file: !4, line: 276, baseType: !47, size: 8, align: 8, offset: 6016)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !257, file: !4, line: 277, baseType: !288, size: 64, align: 64, offset: 6080)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !257, file: !4, line: 278, baseType: !288, size: 64, align: 64, offset: 6144)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !257, file: !4, line: 279, baseType: !288, size: 64, align: 64, offset: 6208)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !257, file: !4, line: 280, baseType: !288, size: 64, align: 64, offset: 6272)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "script_master_rx_lower_pri", scope: !257, file: !4, line: 281, baseType: !288, size: 64, align: 64, offset: 6336)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !257, file: !4, line: 282, baseType: !288, size: 64, align: 64, offset: 6400)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ms_down_timer", scope: !257, file: !4, line: 285, baseType: !168, size: 32, align: 32, offset: 6464)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !257, file: !4, line: 286, baseType: !222, size: 128, align: 64, offset: 6528)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !257, file: !4, line: 289, baseType: !38, size: 64, align: 64, offset: 6656)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer_size", scope: !257, file: !4, line: 290, baseType: !144, size: 64, align: 64, offset: 6720)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_csum", scope: !257, file: !4, line: 291, baseType: !168, size: 32, align: 32, offset: 6784)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "auth_type", scope: !257, file: !4, line: 295, baseType: !184, size: 8, align: 8, offset: 6816)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "auth_data", scope: !257, file: !4, line: 296, baseType: !504, size: 64, align: 8, offset: 6824)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, align: 8, elements: !189)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ipsecah_counter", scope: !257, file: !4, line: 299, baseType: !506, size: 64, align: 32, offset: 6912)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_counter_t", file: !507, line: 58, baseType: !508)
!507 = !DIFile(filename: "./../include/vrrp_ipsecah.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seq_counter", file: !507, line: 55, size: 64, align: 32, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !508, file: !507, line: 56, baseType: !47, size: 8, align: 8)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "seq_number", scope: !508, file: !507, line: 57, baseType: !168, size: 32, align: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !257, file: !4, line: 309, baseType: !100, size: 32, align: 32, offset: 6976)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "syncid", scope: !250, file: !251, line: 59, baseType: !84, size: 32, align: 32, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "sync_maxlen", scope: !250, file: !251, line: 61, baseType: !188, size: 16, align: 16, offset: 160)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_group", scope: !250, file: !251, line: 62, baseType: !53, size: 1024, align: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_port", scope: !250, file: !251, line: 63, baseType: !188, size: 16, align: 16, offset: 1216)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ttl", scope: !250, file: !251, line: 64, baseType: !184, size: 8, align: 8, offset: 1232)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_name", scope: !250, file: !251, line: 66, baseType: !38, size: 64, align: 64, offset: 1280)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lvs_flush", scope: !43, file: !42, line: 105, baseType: !47, size: 8, align: 8, offset: 3328)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_mcast_group4", scope: !43, file: !42, line: 108, baseType: !521, size: 128, align: 32, offset: 3360)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !172, line: 239, size: 128, align: 32, elements: !522)
!522 = !{!523, !524, !526, !527}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !521, file: !172, line: 241, baseType: !57, size: 16, align: 16)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !521, file: !172, line: 242, baseType: !525, size: 16, align: 16, offset: 16)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !172, line: 119, baseType: !188)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !521, file: !172, line: 243, baseType: !171, size: 32, align: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !521, file: !172, line: 246, baseType: !528, size: 64, align: 8, offset: 64)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 64, align: 8, elements: !189)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_mcast_group6", scope: !43, file: !42, line: 109, baseType: !530, size: 224, align: 32, offset: 3488)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !172, line: 254, size: 224, align: 32, elements: !531)
!531 = !{!532, !533, !534, !535, !536}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !530, file: !172, line: 256, baseType: !57, size: 16, align: 16)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !530, file: !172, line: 257, baseType: !525, size: 16, align: 16, offset: 16)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !530, file: !172, line: 258, baseType: !168, size: 32, align: 32, offset: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !530, file: !172, line: 259, baseType: !177, size: 128, align: 32, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !530, file: !172, line: 260, baseType: !168, size: 32, align: 32, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_garp_delay", scope: !43, file: !42, line: 110, baseType: !84, size: 32, align: 32, offset: 3712)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_garp_refresh", scope: !43, file: !42, line: 111, baseType: !222, size: 128, align: 64, offset: 3776)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_garp_rep", scope: !43, file: !42, line: 112, baseType: !84, size: 32, align: 32, offset: 3904)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_garp_refresh_rep", scope: !43, file: !42, line: 113, baseType: !84, size: 32, align: 32, offset: 3936)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_garp_lower_prio_delay", scope: !43, file: !42, line: 114, baseType: !84, size: 32, align: 32, offset: 3968)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_garp_lower_prio_rep", scope: !43, file: !42, line: 115, baseType: !84, size: 32, align: 32, offset: 4000)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_garp_interval", scope: !43, file: !42, line: 116, baseType: !84, size: 32, align: 32, offset: 4032)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_gna_interval", scope: !43, file: !42, line: 117, baseType: !84, size: 32, align: 32, offset: 4064)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_lower_prio_no_advert", scope: !43, file: !42, line: 118, baseType: !47, size: 8, align: 8, offset: 4096)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_higher_prio_send_advert", scope: !43, file: !42, line: 119, baseType: !47, size: 8, align: 8, offset: 4104)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_version", scope: !43, file: !42, line: 120, baseType: !100, size: 32, align: 32, offset: 4128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_iptables_inchain", scope: !43, file: !42, line: 121, baseType: !549, size: 232, align: 8, offset: 4160)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 232, align: 8, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 29)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_iptables_outchain", scope: !43, file: !42, line: 122, baseType: !549, size: 232, align: 8, offset: 4392)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "using_ipsets", scope: !43, file: !42, line: 124, baseType: !47, size: 8, align: 8, offset: 4624)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_ipset_address", scope: !43, file: !42, line: 125, baseType: !555, size: 256, align: 8, offset: 4632)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 256, align: 8, elements: !204)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_ipset_address6", scope: !43, file: !42, line: 126, baseType: !555, size: 256, align: 8, offset: 4888)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_ipset_address_iface6", scope: !43, file: !42, line: 127, baseType: !555, size: 256, align: 8, offset: 5144)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_check_unicast_src", scope: !43, file: !42, line: 129, baseType: !47, size: 8, align: 8, offset: 5400)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_skip_check_adv_addr", scope: !43, file: !42, line: 130, baseType: !47, size: 8, align: 8, offset: 5408)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_strict", scope: !43, file: !42, line: 131, baseType: !47, size: 8, align: 8, offset: 5416)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "have_vrrp_config", scope: !43, file: !42, line: 132, baseType: !47, size: 8, align: 8, offset: 5424)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_process_priority", scope: !43, file: !42, line: 133, baseType: !39, size: 8, align: 8, offset: 5432)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_no_swap", scope: !43, file: !42, line: 134, baseType: !47, size: 8, align: 8, offset: 5440)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_realtime_priority", scope: !43, file: !42, line: 136, baseType: !84, size: 32, align: 32, offset: 5472)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_rlimit_rt", scope: !43, file: !42, line: 138, baseType: !566, size: 64, align: 64, offset: 5504)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !567, line: 131, baseType: !568)
!567 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/resource.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__rlim_t", file: !125, line: 136, baseType: !65)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "have_checker_config", scope: !43, file: !42, line: 143, baseType: !47, size: 8, align: 8, offset: 5568)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "checker_process_priority", scope: !43, file: !42, line: 144, baseType: !39, size: 8, align: 8, offset: 5576)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "checker_no_swap", scope: !43, file: !42, line: 145, baseType: !47, size: 8, align: 8, offset: 5584)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "checker_realtime_priority", scope: !43, file: !42, line: 147, baseType: !84, size: 32, align: 32, offset: 5600)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "checker_rlimit_rt", scope: !43, file: !42, line: 149, baseType: !566, size: 64, align: 64, offset: 5632)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "notify_fifo", scope: !43, file: !42, line: 164, baseType: !575, size: 192, align: 64, offset: 5696)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_fifo_t", file: !290, line: 73, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_fifo", file: !290, line: 68, size: 192, align: 64, elements: !577)
!577 = !{!578, !579, !580, !581}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !576, file: !290, line: 69, baseType: !38, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !576, file: !290, line: 70, baseType: !100, size: 32, align: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "created_fifo", scope: !576, file: !290, line: 71, baseType: !47, size: 8, align: 8, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !576, file: !290, line: 72, baseType: !288, size: 64, align: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_notify_fifo", scope: !43, file: !42, line: 166, baseType: !575, size: 192, align: 64, offset: 5888)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "lvs_notify_fifo", scope: !43, file: !42, line: 169, baseType: !575, size: 192, align: 64, offset: 6080)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_netlink_cmd_rcv_bufs", scope: !43, file: !42, line: 194, baseType: !84, size: 32, align: 32, offset: 6272)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_netlink_cmd_rcv_bufs_force", scope: !43, file: !42, line: 195, baseType: !47, size: 8, align: 8, offset: 6304)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_netlink_monitor_rcv_bufs", scope: !43, file: !42, line: 196, baseType: !84, size: 32, align: 32, offset: 6336)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_netlink_monitor_rcv_bufs_force", scope: !43, file: !42, line: 197, baseType: !47, size: 8, align: 8, offset: 6368)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "lvs_netlink_cmd_rcv_bufs", scope: !43, file: !42, line: 200, baseType: !84, size: 32, align: 32, offset: 6400)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "lvs_netlink_cmd_rcv_bufs_force", scope: !43, file: !42, line: 201, baseType: !47, size: 8, align: 8, offset: 6432)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "lvs_netlink_monitor_rcv_bufs", scope: !43, file: !42, line: 202, baseType: !84, size: 32, align: 32, offset: 6464)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "lvs_netlink_monitor_rcv_bufs_force", scope: !43, file: !42, line: 203, baseType: !47, size: 8, align: 8, offset: 6496)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rs_init_notifies", scope: !43, file: !42, line: 206, baseType: !47, size: 8, align: 8, offset: 6504)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "no_checker_emails", scope: !43, file: !42, line: 207, baseType: !47, size: 8, align: 8, offset: 6512)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_rx_bufs_policy", scope: !43, file: !42, line: 210, baseType: !100, size: 32, align: 32, offset: 6528)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_rx_bufs_size", scope: !43, file: !42, line: 211, baseType: !144, size: 64, align: 64, offset: 6592)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_rx_bufs_multiples", scope: !43, file: !42, line: 212, baseType: !100, size: 32, align: 32, offset: 6656)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!598 = !{!599, !601, !602}
!599 = distinct !DIGlobalVariable(name: "global_data", scope: !0, file: !600, line: 44, type: !40, isLocal: false, isDefinition: true, variable: %struct._data** @global_data)
!600 = !DIFile(filename: "global_data.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--core--libcore.a")
!601 = distinct !DIGlobalVariable(name: "old_global_data", scope: !0, file: !600, line: 45, type: !40, isLocal: false, isDefinition: true, variable: %struct._data** @old_global_data)
!602 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !159, line: 150, type: !69, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!603 = !{i32 2, !"Dwarf Version", i32 4}
!604 = !{i32 2, !"Debug Info Version", i32 3}
!605 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!606 = distinct !DISubprogram(name: "alloc_email", scope: !600, file: !600, line: 132, type: !607, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !609)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !38}
!609 = !{}
!610 = !DILocalVariable(name: "addr", arg: 1, scope: !606, file: !600, line: 132, type: !38)
!611 = !DIExpression()
!612 = !DILocation(line: 132, column: 19, scope: !606)
!613 = !DILocalVariable(name: "size", scope: !606, file: !600, line: 134, type: !144)
!614 = !DILocation(line: 134, column: 9, scope: !606)
!615 = !DILocation(line: 134, column: 23, scope: !606)
!616 = !DILocation(line: 134, column: 16, scope: !606)
!617 = !DILocalVariable(name: "new", scope: !606, file: !600, line: 135, type: !38)
!618 = !DILocation(line: 135, column: 8, scope: !606)
!619 = !DILocation(line: 137, column: 25, scope: !606)
!620 = !DILocation(line: 137, column: 30, scope: !606)
!621 = !DILocation(line: 137, column: 18, scope: !606)
!622 = !DILocation(line: 137, column: 6, scope: !606)
!623 = !DILocation(line: 138, column: 9, scope: !606)
!624 = !DILocation(line: 138, column: 14, scope: !606)
!625 = !DILocation(line: 138, column: 20, scope: !606)
!626 = !DILocation(line: 138, column: 25, scope: !606)
!627 = !DILocation(line: 138, column: 2, scope: !606)
!628 = !DILocation(line: 140, column: 11, scope: !606)
!629 = !DILocation(line: 140, column: 24, scope: !606)
!630 = !DILocation(line: 140, column: 31, scope: !606)
!631 = !DILocation(line: 140, column: 2, scope: !606)
!632 = !DILocation(line: 141, column: 1, scope: !606)
!633 = distinct !DISubprogram(name: "alloc_global_data", scope: !600, file: !600, line: 145, type: !634, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !609)
!634 = !DISubroutineType(types: !635)
!635 = !{!40}
!636 = !DILocalVariable(name: "new", scope: !633, file: !600, line: 147, type: !40)
!637 = !DILocation(line: 147, column: 10, scope: !633)
!638 = !DILocation(line: 149, column: 6, scope: !639)
!639 = distinct !DILexicalBlock(scope: !633, file: !600, line: 149, column: 6)
!640 = !DILocation(line: 149, column: 6, scope: !633)
!641 = !DILocation(line: 150, column: 10, scope: !639)
!642 = !DILocation(line: 150, column: 3, scope: !639)
!643 = !DILocation(line: 152, column: 20, scope: !633)
!644 = !DILocation(line: 152, column: 8, scope: !633)
!645 = !DILocation(line: 152, column: 6, scope: !633)
!646 = !DILocation(line: 153, column: 15, scope: !633)
!647 = !DILocation(line: 153, column: 2, scope: !633)
!648 = !DILocation(line: 153, column: 7, scope: !633)
!649 = !DILocation(line: 153, column: 13, scope: !633)
!650 = !DILocation(line: 154, column: 2, scope: !633)
!651 = !DILocation(line: 154, column: 7, scope: !633)
!652 = !DILocation(line: 154, column: 18, scope: !633)
!653 = !DILocation(line: 156, column: 2, scope: !633)
!654 = !DILocation(line: 156, column: 7, scope: !633)
!655 = !DILocation(line: 156, column: 23, scope: !633)
!656 = !DILocation(line: 159, column: 2, scope: !633)
!657 = !DILocation(line: 159, column: 7, scope: !633)
!658 = !DILocation(line: 159, column: 26, scope: !633)
!659 = !DILocation(line: 163, column: 26, scope: !633)
!660 = !DILocation(line: 163, column: 2, scope: !633)
!661 = !DILocation(line: 164, column: 20, scope: !633)
!662 = !DILocation(line: 164, column: 2, scope: !633)
!663 = !DILocation(line: 166, column: 2, scope: !633)
!664 = !DILocation(line: 166, column: 7, scope: !633)
!665 = !DILocation(line: 166, column: 19, scope: !633)
!666 = !DILocation(line: 166, column: 22, scope: !633)
!667 = !DILocation(line: 168, column: 2, scope: !633)
!668 = !DILocation(line: 168, column: 7, scope: !633)
!669 = !DILocation(line: 168, column: 24, scope: !633)
!670 = !DILocation(line: 168, column: 27, scope: !633)
!671 = !DILocation(line: 170, column: 2, scope: !633)
!672 = !DILocation(line: 170, column: 7, scope: !633)
!673 = !DILocation(line: 170, column: 22, scope: !633)
!674 = !DILocation(line: 172, column: 2, scope: !633)
!675 = !DILocation(line: 172, column: 7, scope: !633)
!676 = !DILocation(line: 172, column: 30, scope: !633)
!677 = !DILocation(line: 175, column: 2, scope: !633)
!678 = !DILocation(line: 175, column: 7, scope: !633)
!679 = !DILocation(line: 175, column: 23, scope: !633)
!680 = !DILocation(line: 175, column: 26, scope: !633)
!681 = !DILocation(line: 177, column: 2, scope: !633)
!682 = !DILocation(line: 177, column: 7, scope: !633)
!683 = !DILocation(line: 177, column: 25, scope: !633)
!684 = !DILocation(line: 210, column: 2, scope: !633)
!685 = !DILocation(line: 210, column: 7, scope: !633)
!686 = !DILocation(line: 210, column: 17, scope: !633)
!687 = !DILocation(line: 210, column: 24, scope: !633)
!688 = !DILocation(line: 212, column: 2, scope: !633)
!689 = !DILocation(line: 212, column: 7, scope: !633)
!690 = !DILocation(line: 212, column: 17, scope: !633)
!691 = !DILocation(line: 212, column: 29, scope: !633)
!692 = !DILocation(line: 212, column: 39, scope: !633)
!693 = !DILocation(line: 217, column: 9, scope: !633)
!694 = !DILocation(line: 217, column: 2, scope: !633)
!695 = !DILocation(line: 218, column: 1, scope: !633)
!696 = distinct !DISubprogram(name: "free_email", scope: !600, file: !600, line: 120, type: !87, isLocal: true, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !609)
!697 = !DILocalVariable(name: "data", arg: 1, scope: !696, file: !600, line: 120, type: !81)
!698 = !DILocation(line: 120, column: 18, scope: !696)
!699 = !DILocation(line: 122, column: 8, scope: !696)
!700 = !DILocation(line: 122, column: 3, scope: !696)
!701 = !DILocation(line: 122, column: 22, scope: !696)
!702 = !DILocation(line: 123, column: 1, scope: !696)
!703 = distinct !DISubprogram(name: "dump_email", scope: !600, file: !600, line: 125, type: !91, isLocal: true, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !609)
!704 = !DILocalVariable(name: "fp", arg: 1, scope: !703, file: !600, line: 125, type: !93)
!705 = !DILocation(line: 125, column: 18, scope: !703)
!706 = !DILocalVariable(name: "data", arg: 2, scope: !703, file: !600, line: 125, type: !81)
!707 = !DILocation(line: 125, column: 28, scope: !703)
!708 = !DILocalVariable(name: "addr", scope: !703, file: !600, line: 127, type: !38)
!709 = !DILocation(line: 127, column: 8, scope: !703)
!710 = !DILocation(line: 127, column: 15, scope: !703)
!711 = !DILocation(line: 128, column: 13, scope: !703)
!712 = !DILocation(line: 128, column: 45, scope: !703)
!713 = !DILocation(line: 128, column: 2, scope: !703)
!714 = !DILocation(line: 129, column: 1, scope: !703)
!715 = distinct !DISubprogram(name: "set_default_mcast_group", scope: !600, file: !600, line: 87, type: !716, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !609)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !40}
!718 = !DILocalVariable(name: "data", arg: 1, scope: !715, file: !600, line: 87, type: !40)
!719 = !DILocation(line: 87, column: 34, scope: !715)
!720 = !DILocation(line: 89, column: 64, scope: !715)
!721 = !DILocation(line: 89, column: 70, scope: !715)
!722 = !DILocation(line: 89, column: 36, scope: !715)
!723 = !DILocation(line: 89, column: 2, scope: !715)
!724 = !DILocation(line: 90, column: 62, scope: !715)
!725 = !DILocation(line: 90, column: 68, scope: !715)
!726 = !DILocation(line: 90, column: 34, scope: !715)
!727 = !DILocation(line: 90, column: 2, scope: !715)
!728 = !DILocation(line: 91, column: 1, scope: !715)
!729 = distinct !DISubprogram(name: "set_vrrp_defaults", scope: !600, file: !600, line: 94, type: !716, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !609)
!730 = !DILocalVariable(name: "data", arg: 1, scope: !729, file: !600, line: 94, type: !40)
!731 = !DILocation(line: 94, column: 28, scope: !729)
!732 = !DILocation(line: 96, column: 2, scope: !729)
!733 = !DILocation(line: 96, column: 8, scope: !729)
!734 = !DILocation(line: 96, column: 22, scope: !729)
!735 = !DILocation(line: 97, column: 2, scope: !729)
!736 = !DILocation(line: 97, column: 8, scope: !729)
!737 = !DILocation(line: 97, column: 26, scope: !729)
!738 = !DILocation(line: 97, column: 33, scope: !729)
!739 = !DILocation(line: 98, column: 2, scope: !729)
!740 = !DILocation(line: 98, column: 8, scope: !729)
!741 = !DILocation(line: 98, column: 30, scope: !729)
!742 = !DILocation(line: 99, column: 2, scope: !729)
!743 = !DILocation(line: 99, column: 8, scope: !729)
!744 = !DILocation(line: 99, column: 24, scope: !729)
!745 = !DILocation(line: 100, column: 2, scope: !729)
!746 = !DILocation(line: 100, column: 8, scope: !729)
!747 = !DILocation(line: 100, column: 35, scope: !729)
!748 = !DILocation(line: 101, column: 2, scope: !729)
!749 = !DILocation(line: 101, column: 8, scope: !729)
!750 = !DILocation(line: 101, column: 33, scope: !729)
!751 = !DILocation(line: 102, column: 2, scope: !729)
!752 = !DILocation(line: 102, column: 8, scope: !729)
!753 = !DILocation(line: 102, column: 34, scope: !729)
!754 = !DILocation(line: 103, column: 2, scope: !729)
!755 = !DILocation(line: 103, column: 8, scope: !729)
!756 = !DILocation(line: 103, column: 37, scope: !729)
!757 = !DILocation(line: 104, column: 2, scope: !729)
!758 = !DILocation(line: 104, column: 8, scope: !729)
!759 = !DILocation(line: 104, column: 21, scope: !729)
!760 = !DILocation(line: 105, column: 9, scope: !729)
!761 = !DILocation(line: 105, column: 15, scope: !729)
!762 = !DILocation(line: 105, column: 2, scope: !729)
!763 = !DILocation(line: 107, column: 2, scope: !729)
!764 = !DILocation(line: 107, column: 8, scope: !729)
!765 = !DILocation(line: 107, column: 21, scope: !729)
!766 = !DILocation(line: 108, column: 9, scope: !729)
!767 = !DILocation(line: 108, column: 15, scope: !729)
!768 = !DILocation(line: 108, column: 2, scope: !729)
!769 = !DILocation(line: 109, column: 9, scope: !729)
!770 = !DILocation(line: 109, column: 15, scope: !729)
!771 = !DILocation(line: 109, column: 2, scope: !729)
!772 = !DILocation(line: 110, column: 9, scope: !729)
!773 = !DILocation(line: 110, column: 15, scope: !729)
!774 = !DILocation(line: 110, column: 2, scope: !729)
!775 = !DILocation(line: 112, column: 2, scope: !729)
!776 = !DILocation(line: 112, column: 8, scope: !729)
!777 = !DILocation(line: 112, column: 31, scope: !729)
!778 = !DILocation(line: 113, column: 2, scope: !729)
!779 = !DILocation(line: 113, column: 8, scope: !729)
!780 = !DILocation(line: 113, column: 33, scope: !729)
!781 = !DILocation(line: 114, column: 2, scope: !729)
!782 = !DILocation(line: 114, column: 8, scope: !729)
!783 = !DILocation(line: 114, column: 20, scope: !729)
!784 = !DILocation(line: 115, column: 1, scope: !729)
!785 = distinct !DISubprogram(name: "init_global_data", scope: !600, file: !600, line: 221, type: !716, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !609)
!786 = !DILocalVariable(name: "data", arg: 1, scope: !785, file: !600, line: 221, type: !40)
!787 = !DILocation(line: 221, column: 27, scope: !785)
!788 = !DILocalVariable(name: "local_name", scope: !785, file: !600, line: 223, type: !38)
!789 = !DILocation(line: 223, column: 8, scope: !785)
!790 = !DILocalVariable(name: "unknown_name", scope: !785, file: !600, line: 224, type: !791)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 80, align: 8, elements: !792)
!792 = !{!793}
!793 = !DISubrange(count: 10)
!794 = !DILocation(line: 224, column: 7, scope: !785)
!795 = !DILocalVariable(name: "using_unknown_name", scope: !785, file: !600, line: 225, type: !47)
!796 = !DILocation(line: 225, column: 6, scope: !785)
!797 = !DILocation(line: 227, column: 7, scope: !798)
!798 = distinct !DILexicalBlock(scope: !785, file: !600, line: 227, column: 6)
!799 = !DILocation(line: 227, column: 13, scope: !798)
!800 = !DILocation(line: 227, column: 23, scope: !798)
!801 = !DILocation(line: 228, column: 7, scope: !798)
!802 = !DILocation(line: 228, column: 13, scope: !798)
!803 = !DILocation(line: 228, column: 25, scope: !798)
!804 = !DILocation(line: 228, column: 35, scope: !798)
!805 = !DILocation(line: 229, column: 9, scope: !798)
!806 = !DILocation(line: 229, column: 15, scope: !798)
!807 = !DILocation(line: 229, column: 30, scope: !798)
!808 = !DILocation(line: 230, column: 9, scope: !798)
!809 = !DILocation(line: 230, column: 15, scope: !798)
!810 = !DILocation(line: 227, column: 6, scope: !811)
!811 = !DILexicalBlockFile(scope: !785, file: !600, discriminator: 1)
!812 = !DILocation(line: 231, column: 16, scope: !813)
!813 = distinct !DILexicalBlock(scope: !798, file: !600, line: 230, column: 29)
!814 = !DILocation(line: 231, column: 14, scope: !813)
!815 = !DILocation(line: 235, column: 8, scope: !816)
!816 = distinct !DILexicalBlock(scope: !813, file: !600, line: 235, column: 7)
!817 = !DILocation(line: 235, column: 7, scope: !813)
!818 = !DILocation(line: 236, column: 18, scope: !819)
!819 = distinct !DILexicalBlock(scope: !816, file: !600, line: 235, column: 20)
!820 = !DILocation(line: 236, column: 15, scope: !819)
!821 = !DILocation(line: 237, column: 11, scope: !819)
!822 = !DILocation(line: 237, column: 23, scope: !819)
!823 = !DILocation(line: 237, column: 4, scope: !819)
!824 = !DILocation(line: 238, column: 23, scope: !819)
!825 = !DILocation(line: 239, column: 3, scope: !819)
!826 = !DILocation(line: 240, column: 2, scope: !813)
!827 = !DILocation(line: 242, column: 7, scope: !828)
!828 = distinct !DILexicalBlock(scope: !785, file: !600, line: 242, column: 6)
!829 = !DILocation(line: 242, column: 13, scope: !828)
!830 = !DILocation(line: 242, column: 6, scope: !785)
!831 = !DILocation(line: 243, column: 25, scope: !828)
!832 = !DILocation(line: 243, column: 31, scope: !828)
!833 = !DILocation(line: 243, column: 3, scope: !828)
!834 = !DILocation(line: 245, column: 6, scope: !835)
!835 = distinct !DILexicalBlock(scope: !785, file: !600, line: 245, column: 6)
!836 = !DILocation(line: 245, column: 12, scope: !835)
!837 = !DILocation(line: 245, column: 24, scope: !835)
!838 = !DILocation(line: 245, column: 6, scope: !785)
!839 = !DILocation(line: 246, column: 8, scope: !840)
!840 = distinct !DILexicalBlock(scope: !841, file: !600, line: 246, column: 7)
!841 = distinct !DILexicalBlock(scope: !835, file: !600, line: 245, column: 35)
!842 = !DILocation(line: 246, column: 14, scope: !840)
!843 = !DILocation(line: 246, column: 7, scope: !841)
!844 = !DILocation(line: 247, column: 40, scope: !840)
!845 = !DILocation(line: 247, column: 4, scope: !840)
!846 = !DILocation(line: 249, column: 8, scope: !847)
!847 = distinct !DILexicalBlock(scope: !841, file: !600, line: 249, column: 7)
!848 = !DILocation(line: 249, column: 7, scope: !841)
!849 = !DILocation(line: 250, column: 9, scope: !850)
!850 = distinct !DILexicalBlock(scope: !851, file: !600, line: 250, column: 8)
!851 = distinct !DILexicalBlock(scope: !847, file: !600, line: 249, column: 28)
!852 = !DILocation(line: 250, column: 15, scope: !850)
!853 = !DILocation(line: 250, column: 8, scope: !851)
!854 = !DILocation(line: 251, column: 28, scope: !850)
!855 = !DILocation(line: 251, column: 34, scope: !850)
!856 = !DILocation(line: 251, column: 5, scope: !850)
!857 = !DILocation(line: 253, column: 9, scope: !858)
!858 = distinct !DILexicalBlock(scope: !851, file: !600, line: 253, column: 8)
!859 = !DILocation(line: 253, column: 15, scope: !858)
!860 = !DILocation(line: 253, column: 8, scope: !851)
!861 = !DILocation(line: 254, column: 28, scope: !862)
!862 = distinct !DILexicalBlock(scope: !858, file: !600, line: 253, column: 31)
!863 = !DILocation(line: 254, column: 5, scope: !862)
!864 = !DILocation(line: 254, column: 11, scope: !862)
!865 = !DILocation(line: 254, column: 26, scope: !862)
!866 = !DILocation(line: 255, column: 16, scope: !862)
!867 = !DILocation(line: 256, column: 4, scope: !862)
!868 = !DILocation(line: 257, column: 3, scope: !851)
!869 = !DILocation(line: 258, column: 2, scope: !841)
!870 = !DILocation(line: 266, column: 6, scope: !871)
!871 = distinct !DILexicalBlock(scope: !785, file: !600, line: 266, column: 6)
!872 = !DILocation(line: 266, column: 16, scope: !871)
!873 = !DILocation(line: 266, column: 34, scope: !871)
!874 = !DILocation(line: 268, column: 6, scope: !871)
!875 = !DILocation(line: 268, column: 12, scope: !871)
!876 = !DILocation(line: 268, column: 24, scope: !871)
!877 = !DILocation(line: 268, column: 29, scope: !871)
!878 = !DILocation(line: 268, column: 32, scope: !879)
!879 = !DILexicalBlockFile(scope: !871, file: !600, discriminator: 1)
!880 = !DILocation(line: 268, column: 38, scope: !879)
!881 = !DILocation(line: 268, column: 55, scope: !879)
!882 = !DILocation(line: 268, column: 60, scope: !879)
!883 = !DILocation(line: 269, column: 14, scope: !871)
!884 = !DILocation(line: 269, column: 20, scope: !871)
!885 = !DILocation(line: 269, column: 32, scope: !871)
!886 = !DILocation(line: 269, column: 38, scope: !871)
!887 = !DILocation(line: 269, column: 44, scope: !871)
!888 = !DILocation(line: 269, column: 61, scope: !871)
!889 = !DILocation(line: 269, column: 7, scope: !871)
!890 = !DILocation(line: 266, column: 6, scope: !811)
!891 = !DILocation(line: 270, column: 107, scope: !892)
!892 = distinct !DILexicalBlock(scope: !871, file: !600, line: 269, column: 68)
!893 = !DILocation(line: 270, column: 113, scope: !892)
!894 = !DILocation(line: 270, column: 130, scope: !892)
!895 = !DILocation(line: 270, column: 3, scope: !892)
!896 = !DILocation(line: 271, column: 9, scope: !897)
!897 = distinct !DILexicalBlock(scope: !898, file: !600, line: 271, column: 9)
!898 = distinct !DILexicalBlock(scope: !892, file: !600, line: 271, column: 3)
!899 = !DILocation(line: 271, column: 15, scope: !897)
!900 = !DILocation(line: 271, column: 32, scope: !897)
!901 = !DILocation(line: 271, column: 9, scope: !898)
!902 = !DILocation(line: 271, column: 46, scope: !903)
!903 = !DILexicalBlockFile(scope: !904, file: !600, discriminator: 1)
!904 = distinct !DILexicalBlock(scope: !897, file: !600, line: 271, column: 38)
!905 = !DILocation(line: 271, column: 52, scope: !903)
!906 = !DILocation(line: 271, column: 69, scope: !903)
!907 = !DILocation(line: 271, column: 41, scope: !903)
!908 = !DILocation(line: 271, column: 77, scope: !903)
!909 = !DILocation(line: 271, column: 83, scope: !903)
!910 = !DILocation(line: 271, column: 100, scope: !903)
!911 = !DILocation(line: 271, column: 106, scope: !903)
!912 = !DILocation(line: 271, column: 4, scope: !903)
!913 = !DILocation(line: 272, column: 3, scope: !892)
!914 = !DILocation(line: 272, column: 9, scope: !892)
!915 = !DILocation(line: 272, column: 26, scope: !892)
!916 = !DILocation(line: 272, column: 31, scope: !892)
!917 = !DILocation(line: 273, column: 23, scope: !892)
!918 = !DILocation(line: 273, column: 29, scope: !892)
!919 = !DILocation(line: 273, column: 46, scope: !892)
!920 = !DILocation(line: 273, column: 3, scope: !892)
!921 = !DILocation(line: 274, column: 2, scope: !892)
!922 = !DILocation(line: 280, column: 6, scope: !923)
!923 = distinct !DILexicalBlock(scope: !785, file: !600, line: 280, column: 6)
!924 = !DILocation(line: 280, column: 16, scope: !923)
!925 = !DILocation(line: 280, column: 6, scope: !785)
!926 = !DILocation(line: 283, column: 7, scope: !927)
!927 = distinct !DILexicalBlock(scope: !928, file: !600, line: 283, column: 7)
!928 = distinct !DILexicalBlock(scope: !923, file: !600, line: 282, column: 2)
!929 = !DILocation(line: 283, column: 13, scope: !927)
!930 = !DILocation(line: 283, column: 25, scope: !927)
!931 = !DILocation(line: 283, column: 30, scope: !927)
!932 = !DILocation(line: 283, column: 33, scope: !933)
!933 = !DILexicalBlockFile(scope: !927, file: !600, discriminator: 1)
!934 = !DILocation(line: 283, column: 39, scope: !933)
!935 = !DILocation(line: 283, column: 55, scope: !933)
!936 = !DILocation(line: 283, column: 60, scope: !933)
!937 = !DILocation(line: 284, column: 15, scope: !927)
!938 = !DILocation(line: 284, column: 21, scope: !927)
!939 = !DILocation(line: 284, column: 33, scope: !927)
!940 = !DILocation(line: 284, column: 39, scope: !927)
!941 = !DILocation(line: 284, column: 45, scope: !927)
!942 = !DILocation(line: 284, column: 61, scope: !927)
!943 = !DILocation(line: 284, column: 8, scope: !927)
!944 = !DILocation(line: 283, column: 7, scope: !945)
!945 = !DILexicalBlockFile(scope: !928, file: !600, discriminator: 2)
!946 = !DILocation(line: 285, column: 106, scope: !947)
!947 = distinct !DILexicalBlock(scope: !927, file: !600, line: 284, column: 68)
!948 = !DILocation(line: 285, column: 112, scope: !947)
!949 = !DILocation(line: 285, column: 128, scope: !947)
!950 = !DILocation(line: 285, column: 4, scope: !947)
!951 = !DILocation(line: 286, column: 10, scope: !952)
!952 = distinct !DILexicalBlock(scope: !953, file: !600, line: 286, column: 10)
!953 = distinct !DILexicalBlock(scope: !947, file: !600, line: 286, column: 4)
!954 = !DILocation(line: 286, column: 16, scope: !952)
!955 = !DILocation(line: 286, column: 32, scope: !952)
!956 = !DILocation(line: 286, column: 10, scope: !953)
!957 = !DILocation(line: 286, column: 46, scope: !958)
!958 = !DILexicalBlockFile(scope: !959, file: !600, discriminator: 1)
!959 = distinct !DILexicalBlock(scope: !952, file: !600, line: 286, column: 38)
!960 = !DILocation(line: 286, column: 52, scope: !958)
!961 = !DILocation(line: 286, column: 68, scope: !958)
!962 = !DILocation(line: 286, column: 41, scope: !958)
!963 = !DILocation(line: 286, column: 76, scope: !958)
!964 = !DILocation(line: 286, column: 82, scope: !958)
!965 = !DILocation(line: 286, column: 98, scope: !958)
!966 = !DILocation(line: 286, column: 104, scope: !958)
!967 = !DILocation(line: 286, column: 5, scope: !958)
!968 = !DILocation(line: 287, column: 4, scope: !947)
!969 = !DILocation(line: 287, column: 10, scope: !947)
!970 = !DILocation(line: 287, column: 26, scope: !947)
!971 = !DILocation(line: 287, column: 31, scope: !947)
!972 = !DILocation(line: 288, column: 24, scope: !947)
!973 = !DILocation(line: 288, column: 30, scope: !947)
!974 = !DILocation(line: 288, column: 46, scope: !947)
!975 = !DILocation(line: 288, column: 4, scope: !947)
!976 = !DILocation(line: 289, column: 3, scope: !947)
!977 = !DILocation(line: 294, column: 7, scope: !978)
!978 = distinct !DILexicalBlock(scope: !928, file: !600, line: 294, column: 7)
!979 = !DILocation(line: 294, column: 13, scope: !978)
!980 = !DILocation(line: 294, column: 29, scope: !978)
!981 = !DILocation(line: 294, column: 34, scope: !978)
!982 = !DILocation(line: 294, column: 37, scope: !983)
!983 = !DILexicalBlockFile(scope: !978, file: !600, discriminator: 1)
!984 = !DILocation(line: 294, column: 43, scope: !983)
!985 = !DILocation(line: 294, column: 60, scope: !983)
!986 = !DILocation(line: 294, column: 65, scope: !983)
!987 = !DILocation(line: 295, column: 15, scope: !978)
!988 = !DILocation(line: 295, column: 21, scope: !978)
!989 = !DILocation(line: 295, column: 37, scope: !978)
!990 = !DILocation(line: 295, column: 43, scope: !978)
!991 = !DILocation(line: 295, column: 49, scope: !978)
!992 = !DILocation(line: 295, column: 66, scope: !978)
!993 = !DILocation(line: 295, column: 8, scope: !978)
!994 = !DILocation(line: 295, column: 72, scope: !978)
!995 = !DILocation(line: 296, column: 7, scope: !978)
!996 = !DILocation(line: 296, column: 13, scope: !978)
!997 = !DILocation(line: 296, column: 29, scope: !978)
!998 = !DILocation(line: 296, column: 36, scope: !978)
!999 = !DILocation(line: 297, column: 7, scope: !978)
!1000 = !DILocation(line: 297, column: 13, scope: !978)
!1001 = !DILocation(line: 297, column: 30, scope: !978)
!1002 = !DILocation(line: 294, column: 7, scope: !945)
!1003 = !DILocation(line: 298, column: 4, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !978, file: !600, line: 297, column: 38)
