; ModuleID = './libguestInfo_la-diskInfo.o.i'
source_filename = "./libguestInfo_la-diskInfo.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._DiskInfo = type { i32, %struct._PartitionEntry* }
%struct._PartitionEntry = type <{ i64, i64, [100 x i8] }>
%struct.WiperPartition_List = type { %struct.DblLnkLst_Links }
%struct.DblLnkLst_Links = type { %struct.DblLnkLst_Links*, %struct.DblLnkLst_Links* }
%struct.WiperPartition = type { [256 x i8], i32, i8, i8*, %struct.DblLnkLst_Links }

@.str = private unnamed_addr constant [10 x i8] c"guestinfo\00", align 1
@.str.1 = private unnamed_addr constant [50 x i8] c"GetDiskInfo: ERROR: could not get partition list\0A\00", align 1
@.str.2 = private unnamed_addr constant [67 x i8] c"GetDiskInfo: ERROR: could not get space info for partition %s: %s\0A\00", align 1
@.str.3 = private unnamed_addr constant [53 x i8] c"GetDiskInfo: ERROR: Partition name buffer too small\0A\00", align 1
@.str.4 = private unnamed_addr constant [54 x i8] c"%s added partition #%d %s type %d free %lu total %lu\0A\00", align 1
@__FUNCTION__.GuestInfoGetDiskInfoWiper = private unnamed_addr constant [26 x i8] c"GuestInfoGetDiskInfoWiper\00", align 1
@.str.5 = private unnamed_addr constant [41 x i8] c"%s ignoring unsupported partition %s %s\0A\00", align 1
@.str.6 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1

; Function Attrs: nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !31)
!1 = !DIFile(filename: "libguestInfo_la-diskInfo.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1434")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 51, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1434")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!7 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!8 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!9 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!10 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!11 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!12 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!13 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!14 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 42, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/wiper.h", directory: "/home/lichi/Desktop/open-vm-tools/line1434")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!18 = !DIEnumerator(name: "PARTITION_UNSUPPORTED", value: 0)
!19 = !DIEnumerator(name: "PARTITION_EXT2", value: 1)
!20 = !DIEnumerator(name: "PARTITION_EXT3", value: 2)
!21 = !DIEnumerator(name: "PARTITION_REISERFS", value: 3)
!22 = !DIEnumerator(name: "PARTITION_NTFS", value: 4)
!23 = !DIEnumerator(name: "PARTITION_FAT", value: 5)
!24 = !DIEnumerator(name: "PARTITION_UFS", value: 6)
!25 = !DIEnumerator(name: "PARTITION_PCFS", value: 7)
!26 = !DIEnumerator(name: "PARTITION_EXT4", value: 8)
!27 = !DIEnumerator(name: "PARTITION_HFS", value: 9)
!28 = !DIEnumerator(name: "PARTITION_ZFS", value: 10)
!29 = !DIEnumerator(name: "PARTITION_XFS", value: 11)
!30 = !DIEnumerator(name: "PARTITION_BTRFS", value: 12)
!31 = !{!32, !58, !59}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "WiperPartition", file: !16, line: 86, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WiperPartition", file: !16, line: 62, size: 2304, align: 64, elements: !35)
!35 = !{!36, !41, !43, !47, !50}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "mountPoint", scope: !34, file: !16, line: 63, baseType: !37, size: 2048, align: 8)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, align: 8, elements: !39)
!38 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!39 = !{!40}
!40 = !DISubrange(count: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !34, file: !16, line: 66, baseType: !42, size: 32, align: 32, offset: 2048)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "WiperPartition_Type", file: !16, line: 56, baseType: !15)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "attemptUnmaps", scope: !34, file: !16, line: 72, baseType: !44, size: 8, align: 8, offset: 2080)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !45, line: 230, baseType: !46)
!45 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1434")
!46 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !34, file: !16, line: 78, baseType: !48, size: 64, align: 64, offset: 2112)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !34, file: !16, line: 85, baseType: !51, size: 128, align: 64, offset: 2176)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "DblLnkLst_Links", file: !52, line: 94, baseType: !53)
!52 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dbllnklst.h", directory: "/home/lichi/Desktop/open-vm-tools/line1434")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DblLnkLst_Links", file: !52, line: 91, size: 128, align: 64, elements: !54)
!54 = !{!55, !57}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !53, file: !52, line: 92, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !53, file: !52, line: 93, baseType: !56, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !60, line: 119, baseType: !61)
!60 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line1434")
!61 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!62 = !{i32 2, !"Dwarf Version", i32 4}
!63 = !{i32 2, !"Debug Info Version", i32 3}
!64 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!65 = distinct !DISubprogram(name: "GuestInfo_FreeDiskInfo", scope: !66, file: !66, line: 54, type: !67, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!66 = !DIFile(filename: "diskInfo.c", directory: "/home/lichi/Desktop/open-vm-tools/line1434")
!67 = !DISubroutineType(types: !68)
!68 = !{null, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestDiskInfo", file: !71, line: 106, baseType: !72)
!71 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/guestInfo.h", directory: "/home/lichi/Desktop/open-vm-tools/line1434")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DiskInfo", file: !71, line: 103, size: 128, align: 64, elements: !73)
!73 = !{!74, !76}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "numEntries", scope: !72, file: !71, line: 104, baseType: !75, size: 32, align: 32)
!75 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "partitionList", scope: !72, file: !71, line: 105, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPartitionEntry", file: !71, line: 101, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PartitionEntry", file: !71, line: 95, size: 928, align: 8, elements: !80)
!80 = !{!81, !85, !86}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "freeBytes", scope: !79, file: !71, line: 96, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !45, line: 171, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !60, line: 55, baseType: !84)
!84 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "totalBytes", scope: !79, file: !71, line: 97, baseType: !82, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !79, file: !71, line: 98, baseType: !87, size: 800, align: 8, offset: 128)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 800, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 100)
!90 = !{}
!91 = !DILocalVariable(name: "di", arg: 1, scope: !65, file: !66, line: 54, type: !69)
!92 = !DIExpression()
!93 = !DILocation(line: 54, column: 39, scope: !65)
!94 = !DILocation(line: 56, column: 8, scope: !95)
!95 = distinct !DILexicalBlock(scope: !65, file: !66, line: 56, column: 8)
!96 = !DILocation(line: 56, column: 8, scope: !65)
!97 = !DILocation(line: 57, column: 12, scope: !98)
!98 = distinct !DILexicalBlock(scope: !95, file: !66, line: 56, column: 12)
!99 = !DILocation(line: 57, column: 16, scope: !98)
!100 = !DILocation(line: 57, column: 7, scope: !98)
!101 = !DILocation(line: 58, column: 12, scope: !98)
!102 = !DILocation(line: 58, column: 7, scope: !98)
!103 = !DILocation(line: 59, column: 4, scope: !98)
!104 = !DILocation(line: 60, column: 1, scope: !65)
!105 = distinct !DISubprogram(name: "GuestInfoGetDiskInfoWiper", scope: !66, file: !66, line: 81, type: !106, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !90)
!106 = !DISubroutineType(types: !107)
!107 = !{!69, !44}
!108 = !DILocalVariable(name: "includeReserved", arg: 1, scope: !105, file: !66, line: 81, type: !44)
!109 = !DILocation(line: 81, column: 32, scope: !105)
!110 = !DILocalVariable(name: "pl", scope: !105, file: !66, line: 83, type: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "WiperPartition_List", file: !16, line: 90, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WiperPartition_List", file: !16, line: 88, size: 128, align: 64, elements: !113)
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !112, file: !16, line: 89, baseType: !51, size: 128, align: 64)
!115 = !DILocation(line: 83, column: 24, scope: !105)
!116 = !DILocalVariable(name: "curr", scope: !105, file: !66, line: 84, type: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!118 = !DILocation(line: 84, column: 21, scope: !105)
!119 = !DILocalVariable(name: "partCount", scope: !105, file: !66, line: 85, type: !75)
!120 = !DILocation(line: 85, column: 17, scope: !105)
!121 = !DILocalVariable(name: "freeBytes", scope: !105, file: !66, line: 86, type: !82)
!122 = !DILocation(line: 86, column: 11, scope: !105)
!123 = !DILocalVariable(name: "totalBytes", scope: !105, file: !66, line: 87, type: !82)
!124 = !DILocation(line: 87, column: 11, scope: !105)
!125 = !DILocalVariable(name: "partNameSize", scope: !105, file: !66, line: 88, type: !75)
!126 = !DILocation(line: 88, column: 17, scope: !105)
!127 = !DILocalVariable(name: "success", scope: !105, file: !66, line: 89, type: !44)
!128 = !DILocation(line: 89, column: 9, scope: !105)
!129 = !DILocalVariable(name: "di", scope: !105, file: !66, line: 90, type: !69)
!130 = !DILocation(line: 90, column: 19, scope: !105)
!131 = !DILocation(line: 93, column: 9, scope: !132)
!132 = distinct !DILexicalBlock(scope: !105, file: !66, line: 93, column: 8)
!133 = !DILocation(line: 93, column: 8, scope: !105)
!134 = !DILocation(line: 94, column: 7, scope: !135)
!135 = distinct !DILexicalBlock(scope: !132, file: !66, line: 93, column: 38)
!136 = !DILocation(line: 95, column: 7, scope: !135)
!137 = !DILocation(line: 98, column: 9, scope: !105)
!138 = !DILocation(line: 98, column: 7, scope: !105)
!139 = !DILocation(line: 99, column: 17, scope: !105)
!140 = !DILocation(line: 101, column: 21, scope: !141)
!141 = distinct !DILexicalBlock(scope: !105, file: !66, line: 101, column: 4)
!142 = !DILocation(line: 101, column: 28, scope: !141)
!143 = !DILocation(line: 101, column: 14, scope: !141)
!144 = !DILocation(line: 101, column: 9, scope: !141)
!145 = !DILocation(line: 101, column: 34, scope: !146)
