; ModuleID = './hgfsChannelGuest.o.i'
source_filename = "./hgfsChannelGuest.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.HgfsChannelData = type { i8*, %struct.HgfsGuestChannelCBTable*, i32, %struct.HgfsGuestConn*, %struct.HgfsChannelServerData*, %struct.Atomic_uint32 }
%struct.HgfsGuestChannelCBTable = type { i8 (%struct.HgfsServerSessionCallbacks*, i8*, i8*, %struct.HgfsGuestConn**)*, void (%struct.HgfsGuestConn*)*, i8 (%struct.HgfsGuestConn*, i8*, i64, i8*, i64*)*, i32 (%struct.HgfsGuestConn*)* }
%struct.HgfsServerSessionCallbacks = type { i8 (i8*, %struct.HgfsServerChannelCallbacks*, %struct.HgfsServerChannelData*, i8**)*, void (i8*)*, void (i8*)*, void (%struct.HgfsPacket*, i8*)*, void (i8*, %struct.DblLnkLst_Links*)*, i32 (i8*)*, void (%struct.HgfsPacket*, i8*)*, void (i8*, i32)* }
%struct.HgfsServerChannelCallbacks = type { void ()*, void ()*, i8* (i64, i32, i8**)*, i8* (i64, i32, i8**)*, void (i8**)*, i8 (i8*, %struct.HgfsPacket*, i32)* }
%struct.HgfsPacket = type { i64, i64, i8*, i64, i32, i64, i8, i32, i8*, i64, i32, i64, i32, i8, i32, i8*, i64, i64, i8, [2 x %struct.HgfsVmxIov], i32, [1 x %struct.HgfsVmxIov] }
%struct.HgfsVmxIov = type { i8*, i64, i32, i8* }
%struct.HgfsServerChannelData = type { i32, i32 }
%struct.DblLnkLst_Links = type { %struct.DblLnkLst_Links*, %struct.DblLnkLst_Links* }
%struct.HgfsGuestConn = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13, globals: !20)
!1 = !DIFile(filename: "hgfsChannelGuest.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line429")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 36, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hgfsServer.h", directory: "/home/lichi/Desktop/open-vm-tools/line429")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "BUF_READABLE", value: 0)
!7 = !DIEnumerator(name: "BUF_WRITEABLE", value: 1)
!8 = !DIEnumerator(name: "BUF_READWRITEABLE", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 164, size: 32, align: 32, elements: !10)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "HGFS_QUIESCE_FREEZE", value: 0)
!12 = !DIEnumerator(name: "HGFS_QUIESCE_THAW", value: 1)
!13 = !{!14, !15}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !16, line: 173, baseType: !17)
!16 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line429")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 51, baseType: !19)
!18 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line429")
!19 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!20 = !{!21, !204, !211}
!21 = distinct !DIGlobalVariable(name: "gHgfsChannels", scope: !0, file: !22, line: 95, type: !23, isLocal: true, isDefinition: true, variable: [1 x %struct.HgfsChannelData]* @gHgfsChannels)
!22 = !DIFile(filename: "hgfsChannelGuest.c", directory: "/home/lichi/Desktop/open-vm-tools/line429")
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 384, align: 64, elements: !124)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelData", file: !22, line: 89, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsChannelData", file: !22, line: 82, size: 384, align: 64, elements: !26)
!26 = !{!27, !31, !182, !183, !184, !203}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !25, file: !22, line: 83, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !25, file: !22, line: 84, baseType: !32, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsGuestChannelCBTable", file: !35, line: 55, baseType: !36)
!35 = !DIFile(filename: "hgfsChannelGuestInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line429")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsGuestChannelCBTable", file: !35, line: 50, size: 256, align: 64, elements: !37)
!37 = !{!38, !168, !172, !178}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !36, file: !35, line: 51, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !43, !14, !14, !165}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !16, line: 230, baseType: !30)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerSessionCallbacks", file: !4, line: 201, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerSessionCallbacks", file: !4, line: 192, size: 512, align: 64, elements: !47)
!47 = !{!48, !134, !138, !139, !143, !155, !159, !160}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "connect", scope: !46, file: !4, line: 193, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!42, !14, !52, !127, !71}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerChannelCallbacks", file: !4, line: 190, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerChannelCallbacks", file: !4, line: 183, size: 384, align: 64, elements: !55)
!55 = !{!56, !61, !63, !72, !73, !78}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "registerThread", scope: !54, file: !4, line: 184, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelRegisterThreadFunc", file: !4, line: 180, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{null}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "unregisterThread", scope: !54, file: !4, line: 185, baseType: !62, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelUnregisterThreadFunc", file: !4, line: 181, baseType: !58)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "getReadVa", scope: !54, file: !4, line: 186, baseType: !64, size: 64, align: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelMapVirtAddrFunc", file: !4, line: 178, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!14, !68, !15, !71}
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !16, line: 171, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 55, baseType: !70)
!70 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "getWriteVa", scope: !54, file: !4, line: 187, baseType: !64, size: 64, align: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "putVa", scope: !54, file: !4, line: 188, baseType: !74, size: 64, align: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelUnmapVirtAddrFunc", file: !4, line: 179, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !71}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !54, file: !4, line: 189, baseType: !79, size: 64, align: 64, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelSendFunc", file: !4, line: 175, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!42, !14, !83, !126}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsPacket", file: !4, line: 78, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsPacket", file: !4, line: 45, size: 1920, align: 64, elements: !86)
!86 = !{!87, !88, !90, !91, !94, !95, !96, !97, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !121, !122}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !85, file: !4, line: 46, baseType: !68, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !85, file: !4, line: 48, baseType: !89, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsStateFlags", file: !4, line: 42, baseType: !68)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacket", scope: !85, file: !4, line: 51, baseType: !14, size: 64, align: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacketSize", scope: !85, file: !4, line: 52, baseType: !92, size: 64, align: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !93, line: 216, baseType: !70)
!93 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line429")
!94 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacketMappedIov", scope: !85, file: !4, line: 53, baseType: !15, size: 32, align: 32, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacketDataSize", scope: !85, file: !4, line: 54, baseType: !92, size: 64, align: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacketIsAllocated", scope: !85, file: !4, line: 55, baseType: !42, size: 8, align: 8, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "metaMappingType", scope: !85, file: !4, line: 56, baseType: !98, size: 32, align: 32, offset: 416)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "MappingType", file: !4, line: 40, baseType: !3)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacket", scope: !85, file: !4, line: 58, baseType: !14, size: 64, align: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketSize", scope: !85, file: !4, line: 59, baseType: !92, size: 64, align: 64, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketMappedIov", scope: !85, file: !4, line: 60, baseType: !15, size: 32, align: 32, offset: 576)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketDataSize", scope: !85, file: !4, line: 61, baseType: !92, size: 64, align: 64, offset: 640)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketIovIndex", scope: !85, file: !4, line: 62, baseType: !15, size: 32, align: 32, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketIsAllocated", scope: !85, file: !4, line: 63, baseType: !42, size: 8, align: 8, offset: 736)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "dataMappingType", scope: !85, file: !4, line: 65, baseType: !98, size: 32, align: 32, offset: 768)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "replyPacket", scope: !85, file: !4, line: 67, baseType: !14, size: 64, align: 64, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "replyPacketSize", scope: !85, file: !4, line: 68, baseType: !92, size: 64, align: 64, offset: 896)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "replyPacketDataSize", scope: !85, file: !4, line: 69, baseType: !92, size: 64, align: 64, offset: 960)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "replyPacketIsAllocated", scope: !85, file: !4, line: 70, baseType: !42, size: 8, align: 8, offset: 1024)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "channelIov", scope: !85, file: !4, line: 73, baseType: !111, size: 512, align: 64, offset: 1088)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 512, align: 64, elements: !119)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsVmxIov", file: !4, line: 34, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsVmxIov", file: !4, line: 29, size: 256, align: 64, elements: !114)
!114 = !{!115, !116, !117, !118}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "va", scope: !113, file: !4, line: 30, baseType: !14, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pa", scope: !113, file: !4, line: 31, baseType: !68, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !113, file: !4, line: 32, baseType: !15, size: 32, align: 32, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !113, file: !4, line: 33, baseType: !14, size: 64, align: 64, offset: 192)
!119 = !{!120}
!120 = !DISubrange(count: 2)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "iovCount", scope: !85, file: !4, line: 75, baseType: !15, size: 32, align: 32, offset: 1600)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !85, file: !4, line: 76, baseType: !123, size: 256, align: 64, offset: 1664)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 256, align: 64, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 1)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSendFlags", file: !4, line: 98, baseType: !15)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerChannelData", file: !4, line: 111, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerChannelData", file: !4, line: 108, size: 64, align: 32, elements: !130)
!130 = !{!131, !133}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !129, file: !4, line: 109, baseType: !132, size: 32, align: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelFlags", file: !4, line: 104, baseType: !15)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "maxPacketSize", scope: !129, file: !4, line: 110, baseType: !15, size: 32, align: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect", scope: !46, file: !4, line: 194, baseType: !135, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !14}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !46, file: !4, line: 195, baseType: !135, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "receive", scope: !46, file: !4, line: 196, baseType: !140, size: 64, align: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !83, !14}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "invalidateObjects", scope: !46, file: !4, line: 197, baseType: !144, size: 64, align: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !14, !147}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "DblLnkLst_Links", file: !149, line: 94, baseType: !150)
!149 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dbllnklst.h", directory: "/home/lichi/Desktop/open-vm-tools/line429")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DblLnkLst_Links", file: !149, line: 91, size: 128, align: 64, elements: !151)
!151 = !{!152, !154}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !150, file: !149, line: 92, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !149, line: 93, baseType: !153, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "invalidateInactiveSessions", scope: !46, file: !4, line: 198, baseType: !156, size: 64, align: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!15, !14}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "sendComplete", scope: !46, file: !4, line: 199, baseType: !140, size: 64, align: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "quiesce", scope: !46, file: !4, line: 200, baseType: !161, size: 64, align: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !14, !164}
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsQuiesceOp", file: !4, line: 167, baseType: !9)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsGuestConn", file: !35, line: 45, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !36, file: !35, line: 52, baseType: !169, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !166}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "receive", scope: !36, file: !35, line: 53, baseType: !173, size: 64, align: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!42, !166, !28, !92, !176, !177}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "invalidateInactiveSessions", scope: !36, file: !35, line: 54, baseType: !179, size: 64, align: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!15, !166}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !25, file: !22, line: 85, baseType: !15, size: 32, align: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !25, file: !22, line: 86, baseType: !166, size: 64, align: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "serverInfo", scope: !25, file: !22, line: 87, baseType: !185, size: 64, align: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelServerData", file: !22, line: 73, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsChannelServerData", file: !22, line: 70, size: 128, align: 64, elements: !188)
!188 = !{!189, !196}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "serverCBTable", scope: !187, file: !22, line: 71, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerCallbacks", file: !4, line: 206, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerCallbacks", file: !4, line: 204, size: 512, align: 64, elements: !194)
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "session", scope: !193, file: !4, line: 205, baseType: !45, size: 512, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", scope: !187, file: !22, line: 72, baseType: !197, size: 32, align: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint32", file: !198, line: 135, baseType: !199)
!198 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_atomic.h", directory: "/home/lichi/Desktop/open-vm-tools/line429")
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint32", file: !198, line: 133, size: 32, align: 32, elements: !200)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !199, file: !198, line: 134, baseType: !202, size: 32, align: 32)
!202 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !15)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", scope: !25, file: !22, line: 88, baseType: !197, size: 32, align: 32, offset: 320)
!204 = distinct !DIGlobalVariable(name: "gHgfsGuestCfgSettings", scope: !0, file: !22, line: 99, type: !205, isLocal: true, isDefinition: true, variable: %struct.HgfsServerConfig* @gHgfsGuestCfgSettings)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerConfig", file: !4, line: 127, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerConfig", file: !4, line: 124, size: 64, align: 32, elements: !207)
!207 = !{!208, !210}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !206, file: !4, line: 125, baseType: !209, size: 32, align: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsConfigFlags", file: !4, line: 117, baseType: !15)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "maxCachedOpenNodes", scope: !206, file: !4, line: 126, baseType: !15, size: 32, align: 32, offset: 32)
!211 = distinct !DIGlobalVariable(name: "gHgfsChannelServerInfo", scope: !0, file: !22, line: 105, type: !186, isLocal: true, isDefinition: true, variable: %struct.HgfsChannelServerData* @gHgfsChannelServerInfo)
!212 = !{i32 2, !"Dwarf Version", i32 4}
!213 = !{i32 2, !"Debug Info Version", i32 3}
!214 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!215 = distinct !DISubprogram(name: "HgfsChannelGetChannel", scope: !22, file: !22, line: 286, type: !216, isLocal: false, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !219)
!216 = !DISubroutineType(types: !217)
!217 = !{!15, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!219 = !{}
!220 = !DILocalVariable(name: "channel", arg: 1, scope: !215, file: !22, line: 286, type: !218)
!221 = !DIExpression()
!222 = !DILocation(line: 286, column: 40, scope: !215)
!223 = !DILocation(line: 289, column: 29, scope: !215)
!224 = !DILocation(line: 289, column: 38, scope: !215)
!225 = !DILocation(line: 289, column: 11, scope: !215)
!226 = !DILocation(line: 289, column: 4, scope: !215)
!227 = distinct !DISubprogram(name: "Atomic_ReadInc32", scope: !198, file: !198, line: 1927, type: !228, isLocal: true, isDefinition: true, scopeLine: 1928, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !219)
!228 = !DISubroutineType(types: !229)
!229 = !{!15, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!231 = !DILocalVariable(name: "var", arg: 1, scope: !227, file: !198, line: 1927, type: !230)
!232 = !DILocation(line: 1927, column: 33, scope: !227)
!233 = !DILocation(line: 1929, column: 28, scope: !227)
!234 = !DILocation(line: 1929, column: 11, scope: !227)
!235 = !DILocation(line: 1929, column: 4, scope: !227)
!236 = distinct !DISubprogram(name: "HgfsChannelGuest_Init", scope: !22, file: !22, line: 576, type: !237, isLocal: false, isDefinition: true, scopeLine: 578, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !219)
!237 = !DISubroutineType(types: !238)
!238 = !{!42, !239, !248}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerMgrData", file: !241, line: 49, baseType: !242)
!241 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hgfsServerManager.h", directory: "/home/lichi/Desktop/open-vm-tools/line429")
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerMgrData", file: !241, line: 44, size: 256, align: 64, elements: !243)
!243 = !{!244, !245, !246, !247}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "appName", scope: !242, file: !241, line: 45, baseType: !28, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !242, file: !241, line: 46, baseType: !14, size: 64, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "rpcCallback", scope: !242, file: !241, line: 47, baseType: !14, size: 64, align: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !242, file: !241, line: 48, baseType: !14, size: 64, align: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerMgrCallbacks", file: !4, line: 162, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerMgrCallbacks", file: !4, line: 160, size: 192, align: 64, elements: !251)
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "enumResources", scope: !250, file: !4, line: 161, baseType: !253, size: 192, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerResEnumCallbacks", file: !4, line: 153, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerResEnumCallbacks", file: !4, line: 149, size: 192, align: 64, elements: !255)
!255 = !{!256, !261, !268}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !254, file: !4, line: 150, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerResEnumInitFunc", file: !4, line: 142, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!14}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !254, file: !4, line: 151, baseType: !262, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerResEnumGetFunc", file: !4, line: 143, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!42, !14, !266, !177, !267}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !254, file: !4, line: 152, baseType: !269, size: 64, align: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerResEnumExitFunc", file: !4, line: 147, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!42, !14}
!273 = !DILocalVariable(name: "mgrData", arg: 1, scope: !236, file: !22, line: 576, type: !239)
!274 = !DILocation(line: 576, column: 42, scope: !236)
!275 = !DILocalVariable(name: "mgrCb", arg: 2, scope: !236, file: !22, line: 577, type: !248)
!276 = !DILocation(line: 577, column: 47, scope: !236)
!277 = !DILocalVariable(name: "success", scope: !236, file: !22, line: 579, type: !42)
!278 = !DILocation(line: 579, column: 9, scope: !236)
!279 = !DILocalVariable(name: "channel", scope: !236, file: !22, line: 580, type: !218)
!280 = !DILocation(line: 580, column: 21, scope: !236)
!281 = !DILocalVariable(name: "channelRefCount", scope: !236, file: !22, line: 581, type: !15)
!282 = !DILocation(line: 581, column: 11, scope: !236)
!283 = !DILocation(line: 591, column: 10, scope: !236)
!284 = !DILocation(line: 591, column: 19, scope: !236)
!285 = !DILocation(line: 591, column: 28, scope: !236)
!286 = !DILocation(line: 591, column: 37, scope: !236)
!287 = !DILocation(line: 591, column: 42, scope: !236)
!288 = !DILocation(line: 591, column: 51, scope: !236)
!289 = !DILocation(line: 590, column: 4, scope: !236)
!290 = !DILocation(line: 593, column: 15, scope: !291)
!291 = distinct !DILexicalBlock(scope: !236, file: !22, line: 593, column: 7)
!292 = !DILocation(line: 593, column: 24, scope: !291)
!293 = !DILocation(line: 593, column: 12, scope: !291)
!294 = !DILocation(line: 593, column: 28, scope: !291)
!295 = !DILocation(line: 593, column: 39, scope: !296)
!296 = !DILexicalBlockFile(scope: !291, file: !22, discriminator: 1)
!297 = !DILocation(line: 593, column: 48, scope: !296)
!298 = !DILocation(line: 593, column: 36, scope: !296)
!299 = !DILocation(line: 593, column: 7, scope: !296)
!300 = !DILocation(line: 599, column: 7, scope: !301)
!301 = distinct !DILexicalBlock(scope: !291, file: !22, line: 593, column: 61)
!302 = !DILocation(line: 600, column: 7, scope: !301)
!303 = !DILocation(line: 608, column: 44, scope: !236)
!304 = !DILocation(line: 608, column: 22, scope: !236)
!305 = !DILocation(line: 608, column: 20, scope: !236)
!306 = !DILocation(line: 610, column: 26, scope: !236)
!307 = !DILocation(line: 610, column: 4, scope: !236)
!308 = !DILocation(line: 610, column: 13, scope: !236)
!309 = !DILocation(line: 610, column: 24, scope: !236)
!310 = !DILocation(line: 611, column: 13, scope: !311)
!311 = distinct !DILexicalBlock(scope: !236, file: !22, line: 611, column: 8)
!312 = !DILocation(line: 611, column: 10, scope: !311)
!313 = !DILocation(line: 611, column: 8, scope: !236)
!314 = !DILocation(line: 614, column: 35, scope: !315)
!315 = distinct !DILexicalBlock(scope: !316, file: !22, line: 614, column: 11)
!316 = distinct !DILexicalBlock(scope: !311, file: !22, line: 611, column: 30)
!317 = !DILocation(line: 614, column: 44, scope: !315)
!318 = !DILocation(line: 614, column: 12, scope: !315)
!319 = !DILocation(line: 614, column: 11, scope: !316)
!320 = !DILocation(line: 615, column: 10, scope: !321)
!321 = distinct !DILexicalBlock(scope: !315, file: !22, line: 614, column: 77)
!322 = !DILocation(line: 616, column: 10, scope: !321)
!323 = !DILocation(line: 620, column: 39, scope: !324)
!324 = distinct !DILexicalBlock(scope: !316, file: !22, line: 620, column: 11)
!325 = !DILocation(line: 621, column: 39, scope: !324)
!326 = !DILocation(line: 621, column: 48, scope: !324)
!327 = !DILocation(line: 622, column: 39, scope: !324)
!328 = !DILocation(line: 622, column: 48, scope: !324)
!329 = !DILocation(line: 620, column: 12, scope: !324)
!330 = !DILocation(line: 620, column: 11, scope: !316)
!331 = !DILocation(line: 623, column: 10, scope: !332)
