; ModuleID = './[inter]src--depcon.o.i'
source_filename = "./[inter]src--depcon.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.deppossi_pkg_iterator = type { %struct.deppossi*, %struct.pkginfo*, i32 }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.1, i32 }
%struct.anon.1 = type { %struct.deppossi*, %struct.deppossi* }
%struct.dpkg_version = type { i32, i8*, i8* }
%struct.pkgbin = type { %struct.dependency*, i8, i32, %struct.dpkg_arch*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.dpkg_version, %struct.conffile*, %struct.arbitraryfield* }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.conffile = type { %struct.conffile*, i8*, i8*, i8 }
%struct.arbitraryfield = type { %struct.arbitraryfield*, i8*, i8* }
%struct.perpackagestate = type { i32, i32, i8, i32, i32, %struct.pkg_list* }
%struct.pkg_list = type { %struct.pkg_list*, %struct.pkginfo* }
%struct.archivedetails = type { %struct.archivedetails*, i8*, i8*, i8*, i8* }
%struct.anon = type { %struct.trigaw*, %struct.trigaw* }

!78 = !DIEnumerator(name: "FNNF_FILTERED", value: 512)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "deptype", file: !4, line: 44, size: 32, align: 32, elements: !80)
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89}
!81 = !DIEnumerator(name: "dep_suggests", value: 0)
!82 = !DIEnumerator(name: "dep_recommends", value: 1)
!83 = !DIEnumerator(name: "dep_depends", value: 2)
!84 = !DIEnumerator(name: "dep_predepends", value: 3)
!85 = !DIEnumerator(name: "dep_breaks", value: 4)
!86 = !DIEnumerator(name: "dep_conflicts", value: 5)
!87 = !DIEnumerator(name: "dep_provides", value: 6)
!88 = !DIEnumerator(name: "dep_replaces", value: 7)
!89 = !DIEnumerator(name: "dep_enhances", value: 8)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_relation", file: !91, line: 61, size: 32, align: 32, elements: !92)
!91 = !DIFile(filename: "../lib/dpkg/version.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!92 = !{!93, !94, !95, !96, !97, !98}
!93 = !DIEnumerator(name: "DPKG_RELATION_NONE", value: 0)
!94 = !DIEnumerator(name: "DPKG_RELATION_EQ", value: 1)
!95 = !DIEnumerator(name: "DPKG_RELATION_LT", value: 2)
!96 = !DIEnumerator(name: "DPKG_RELATION_LE", value: 3)
!97 = !DIEnumerator(name: "DPKG_RELATION_GT", value: 4)
!98 = !DIEnumerator(name: "DPKG_RELATION_GE", value: 5)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "which_pkgbin", file: !54, line: 340, size: 32, align: 32, elements: !100)
!100 = !{!101, !102, !103}
!101 = !DIEnumerator(name: "wpb_installed", value: 0)
!102 = !DIEnumerator(name: "wpb_available", value: 1)
!103 = !DIEnumerator(name: "wpb_by_istobe", value: 2)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_name_arch_when", file: !4, line: 396, size: 32, align: 32, elements: !105)
!105 = !{!106, !107, !108, !109}
!106 = !DIEnumerator(name: "pnaw_never", value: 0)
!107 = !DIEnumerator(name: "pnaw_nonambig", value: 1)
!108 = !DIEnumerator(name: "pnaw_foreign", value: 2)
!109 = !DIEnumerator(name: "pnaw_always", value: 3)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "versiondisplayepochwhen", file: !4, line: 388, size: 32, align: 32, elements: !111)
!111 = !{!112, !113, !114}
!112 = !DIEnumerator(name: "vdew_never", value: 0)
!113 = !DIEnumerator(name: "vdew_nonambig", value: 1)
!114 = !DIEnumerator(name: "vdew_always", value: 2)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "debugflags", file: !116, line: 41, size: 32, align: 32, elements: !117)
!116 = !DIFile(filename: "../lib/dpkg/debug.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130}
!118 = !DIEnumerator(name: "dbg_general", value: 1)
!119 = !DIEnumerator(name: "dbg_scripts", value: 2)
!120 = !DIEnumerator(name: "dbg_eachfile", value: 8)
!121 = !DIEnumerator(name: "dbg_eachfiledetail", value: 64)
!122 = !DIEnumerator(name: "dbg_conff", value: 16)
!123 = !DIEnumerator(name: "dbg_conffdetail", value: 128)
!124 = !DIEnumerator(name: "dbg_depcon", value: 32)
!125 = !DIEnumerator(name: "dbg_depcondetail", value: 256)
!126 = !DIEnumerator(name: "dbg_veryverbose", value: 512)
!127 = !DIEnumerator(name: "dbg_stupidlyverbose", value: 1024)
!128 = !DIEnumerator(name: "dbg_triggers", value: 4096)
!129 = !DIEnumerator(name: "dbg_triggersdetail", value: 8192)
!130 = !DIEnumerator(name: "dbg_triggersstupid", value: 16384)
!131 = !{i32 2, !"Dwarf Version", i32 4}
!132 = !{i32 2, !"Debug Info Version", i32 3}
!133 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!134 = distinct !DISubprogram(name: "deppossi_pkg_iter_new", scope: !135, file: !135, line: 49, type: !136, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!135 = !DIFile(filename: "depcon.c", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!136 = !DISubroutineType(types: !137)
!137 = !{!138, !142, !99}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi_pkg_iterator", file: !135, line: 42, size: 192, align: 64, elements: !140)
!140 = !{!141, !346, !347}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "possi", scope: !139, file: !135, line: 43, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !144)
!144 = !{!145, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !143, file: !4, line: 64, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !148)
!148 = !{!149, !334, !335, !336}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !147, file: !4, line: 57, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !152)
!152 = !{!153, !170, !171, !172, !173, !174, !175, !176, !177, !184, !223, !224, !240, !249, !265, !266, !272, !328, !332, !333}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !151, file: !4, line: 196, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !156)
!156 = !{!157, !158, !162, !163, !168}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !4, line: 243, baseType: !154, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !4, line: 244, baseType: !159, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!161 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !155, file: !4, line: 245, baseType: !151, size: 3072, align: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !155, file: !4, line: 249, baseType: !164, size: 128, align: 64, offset: 3200)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !155, file: !4, line: 246, size: 128, align: 64, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !164, file: !4, line: 247, baseType: !142, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !164, file: !4, line: 248, baseType: !142, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !155, file: !4, line: 250, baseType: !169, size: 32, align: 32, offset: 3328)
!169 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !151, file: !4, line: 197, baseType: !150, size: 64, align: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !151, file: !4, line: 199, baseType: !3, size: 32, align: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !151, file: !4, line: 201, baseType: !12, size: 32, align: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !151, file: !4, line: 202, baseType: !16, size: 32, align: 32, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !151, file: !4, line: 203, baseType: !26, size: 32, align: 32, offset: 224)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !151, file: !4, line: 204, baseType: !159, size: 64, align: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !151, file: !4, line: 205, baseType: !159, size: 64, align: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !151, file: !4, line: 206, baseType: !178, size: 192, align: 64, offset: 384)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !91, line: 42, size: 192, align: 64, elements: !179)
!179 = !{!180, !182, !183}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !178, file: !91, line: 44, baseType: !181, size: 32, align: 32)
!181 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !178, file: !91, line: 46, baseType: !159, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !178, file: !91, line: 48, baseType: !159, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !151, file: !4, line: 207, baseType: !185, size: 960, align: 64, offset: 576)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !186)
!186 = !{!187, !188, !190, !191, !200, !201, !202, !203, !204, !205, !206, !207, !208, !216}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !185, file: !4, line: 108, baseType: !146, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !185, file: !4, line: 110, baseType: !189, size: 8, align: 8, offset: 64)
!189 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !185, file: !4, line: 111, baseType: !36, size: 32, align: 32, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !185, file: !4, line: 112, baseType: !192, size: 64, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !43, line: 48, size: 192, align: 64, elements: !195)
!195 = !{!196, !198, !199}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !194, file: !43, line: 49, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !43, line: 50, baseType: !159, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !194, file: !43, line: 51, baseType: !42, size: 32, align: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !185, file: !4, line: 115, baseType: !159, size: 64, align: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !185, file: !4, line: 116, baseType: !159, size: 64, align: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !185, file: !4, line: 117, baseType: !159, size: 64, align: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !185, file: !4, line: 118, baseType: !159, size: 64, align: 64, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !185, file: !4, line: 119, baseType: !159, size: 64, align: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !185, file: !4, line: 120, baseType: !159, size: 64, align: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !185, file: !4, line: 121, baseType: !159, size: 64, align: 64, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !185, file: !4, line: 122, baseType: !178, size: 192, align: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !185, file: !4, line: 123, baseType: !209, size: 64, align: 64, offset: 832)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !211)
!211 = !{!212, !213, !214, !215}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !4, line: 81, baseType: !209, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !4, line: 82, baseType: !159, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !210, file: !4, line: 83, baseType: !159, size: 64, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !210, file: !4, line: 84, baseType: !189, size: 8, align: 8, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !185, file: !4, line: 124, baseType: !217, size: 64, align: 64, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !219)
!219 = !{!220, !221, !222}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !218, file: !4, line: 75, baseType: !217, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !218, file: !4, line: 76, baseType: !159, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !218, file: !4, line: 77, baseType: !159, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !151, file: !4, line: 208, baseType: !185, size: 960, align: 64, offset: 1536)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !151, file: !4, line: 209, baseType: !225, size: 64, align: 64, offset: 2496)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !54, line: 53, size: 256, align: 64, elements: !227)
!227 = !{!228, !229, !230, !231, !232, !233}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "istobe", scope: !226, file: !54, line: 54, baseType: !53, size: 32, align: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !226, file: !54, line: 57, baseType: !61, size: 32, align: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "enqueued", scope: !226, file: !54, line: 59, baseType: !189, size: 8, align: 8, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "replacingfilesandsaid", scope: !226, file: !54, line: 61, baseType: !169, size: 32, align: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "cmdline_seen", scope: !226, file: !54, line: 62, baseType: !169, size: 32, align: 32, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "trigprocdeferred", scope: !226, file: !54, line: 65, baseType: !234, size: 64, align: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_list", file: !236, line: 34, size: 128, align: 64, elements: !237)
!236 = !DIFile(filename: "../lib/dpkg/pkg-list.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !235, file: !236, line: 35, baseType: !234, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !235, file: !236, line: 36, baseType: !150, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !151, file: !4, line: 211, baseType: !241, size: 64, align: 64, offset: 2560)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !243)
!243 = !{!244, !245, !246, !247, !248}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !4, line: 88, baseType: !241, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !242, file: !4, line: 89, baseType: !159, size: 64, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !242, file: !4, line: 90, baseType: !159, size: 64, align: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !242, file: !4, line: 91, baseType: !159, size: 64, align: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !242, file: !4, line: 92, baseType: !159, size: 64, align: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !151, file: !4, line: 216, baseType: !250, size: 128, align: 64, offset: 2624)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !151, file: !4, line: 213, size: 128, align: 64, elements: !251)
!251 = !{!252, !264}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !250, file: !4, line: 215, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !255)
!255 = !{!256, !257, !258, !259}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !254, file: !4, line: 143, baseType: !150, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !254, file: !4, line: 143, baseType: !150, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !254, file: !4, line: 144, baseType: !253, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !254, file: !4, line: 147, baseType: !260, size: 128, align: 64, offset: 192)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !4, line: 145, size: 128, align: 64, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !4, line: 146, baseType: !253, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !260, file: !4, line: 146, baseType: !253, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !250, file: !4, line: 215, baseType: !253, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !151, file: !4, line: 219, baseType: !253, size: 64, align: 64, offset: 2752)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !151, file: !4, line: 220, baseType: !267, size: 64, align: 64, offset: 2816)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !4, line: 135, baseType: !267, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !4, line: 136, baseType: !159, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !151, file: !4, line: 231, baseType: !273, size: 64, align: 64, offset: 2880)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !67, line: 122, size: 128, align: 64, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !67, line: 123, baseType: !273, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "namenode", scope: !274, file: !67, line: 124, baseType: !278, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode", file: !67, line: 90, size: 640, align: 64, elements: !280)
!280 = !{!281, !282, !283, !284, !292, !311, !314, !315, !316, !317}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !279, file: !67, line: 91, baseType: !278, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !279, file: !67, line: 92, baseType: !159, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "packages", scope: !279, file: !67, line: 93, baseType: !234, size: 64, align: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "divert", scope: !279, file: !67, line: 94, baseType: !285, size: 64, align: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_diversion", file: !67, line: 151, size: 256, align: 64, elements: !287)
!287 = !{!288, !289, !290, !291}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "useinstead", scope: !286, file: !67, line: 152, baseType: !278, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "camefrom", scope: !286, file: !67, line: 153, baseType: !278, size: 64, align: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pkgset", scope: !286, file: !67, line: 154, baseType: !154, size: 64, align: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !286, file: !67, line: 157, baseType: !285, size: 64, align: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "statoverride", scope: !279, file: !67, line: 101, baseType: !293, size: 64, align: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !295, line: 40, size: 256, align: 64, elements: !296)
!295 = !DIFile(filename: "../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!296 = !{!297, !302, !305, !308, !310}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !294, file: !295, line: 41, baseType: !298, size: 32, align: 32)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !299, line: 80, baseType: !300)
!299 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !301, line: 125, baseType: !181)
!301 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!302 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !294, file: !295, line: 42, baseType: !303, size: 32, align: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !299, line: 65, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !301, line: 126, baseType: !181)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !294, file: !295, line: 43, baseType: !306, size: 32, align: 32, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !299, line: 70, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !301, line: 129, baseType: !181)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !294, file: !295, line: 47, baseType: !309, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !294, file: !295, line: 48, baseType: !309, size: 64, align: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "trig_interested", scope: !279, file: !67, line: 103, baseType: !312, size: 64, align: 64, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "trigfileint", file: !67, line: 103, flags: DIFlagFwdDecl)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !279, file: !67, line: 111, baseType: !66, size: 32, align: 32, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "oldhash", scope: !279, file: !67, line: 114, baseType: !159, size: 64, align: 64, offset: 448)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "newhash", scope: !279, file: !67, line: 117, baseType: !159, size: 64, align: 64, offset: 512)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "file_ondisk_id", scope: !279, file: !67, line: 119, baseType: !318, size: 64, align: 64, offset: 576)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_ondisk_id", file: !67, line: 85, size: 128, align: 64, elements: !320)
!320 = !{!321, !325}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "id_dev", scope: !319, file: !67, line: 86, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !299, line: 60, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !301, line: 124, baseType: !324)
!324 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "id_ino", scope: !319, file: !67, line: 87, baseType: !326, size: 64, align: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !299, line: 48, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !301, line: 127, baseType: !324)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !151, file: !4, line: 232, baseType: !329, size: 64, align: 64, offset: 2944)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !299, line: 86, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !301, line: 131, baseType: !331)
!331 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !151, file: !4, line: 233, baseType: !189, size: 8, align: 8, offset: 3008)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !151, file: !4, line: 236, baseType: !189, size: 8, align: 8, offset: 3016)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !4, line: 58, baseType: !146, size: 64, align: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !147, file: !4, line: 59, baseType: !142, size: 64, align: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !4, line: 60, baseType: !79, size: 32, align: 32, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !143, file: !4, line: 65, baseType: !154, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !143, file: !4, line: 66, baseType: !142, size: 64, align: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !143, file: !4, line: 66, baseType: !142, size: 64, align: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !143, file: !4, line: 66, baseType: !142, size: 64, align: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !143, file: !4, line: 67, baseType: !192, size: 64, align: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !143, file: !4, line: 68, baseType: !178, size: 192, align: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !143, file: !4, line: 69, baseType: !90, size: 32, align: 32, offset: 576)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !143, file: !4, line: 70, baseType: !189, size: 8, align: 8, offset: 608)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !143, file: !4, line: 71, baseType: !189, size: 8, align: 8, offset: 616)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_next", scope: !139, file: !135, line: 44, baseType: !150, size: 64, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "which_pkgbin", scope: !139, file: !135, line: 45, baseType: !99, size: 32, align: 32, offset: 128)
!348 = !{}
!349 = !DILocalVariable(name: "possi", arg: 1, scope: !134, file: !135, line: 49, type: !142)
!350 = !DIExpression()
!351 = !DILocation(line: 49, column: 40, scope: !134)
!352 = !DILocalVariable(name: "wpb", arg: 2, scope: !134, file: !135, line: 49, type: !99)
!353 = !DILocation(line: 49, column: 65, scope: !134)
!354 = !DILocalVariable(name: "iter", scope: !134, file: !135, line: 51, type: !138)
!355 = !DILocation(line: 51, column: 33, scope: !134)
!356 = !DILocation(line: 53, column: 10, scope: !134)
!357 = !DILocation(line: 53, column: 8, scope: !134)
!358 = !DILocation(line: 54, column: 17, scope: !134)
!359 = !DILocation(line: 54, column: 3, scope: !134)
!360 = !DILocation(line: 54, column: 9, scope: !134)
!361 = !DILocation(line: 54, column: 15, scope: !134)
!362 = !DILocation(line: 55, column: 21, scope: !134)
!363 = !DILocation(line: 55, column: 28, scope: !134)
!364 = !DILocation(line: 55, column: 32, scope: !134)
!365 = !DILocation(line: 55, column: 3, scope: !134)
!366 = !DILocation(line: 55, column: 9, scope: !134)
!367 = !DILocation(line: 55, column: 18, scope: !134)
!368 = !DILocation(line: 56, column: 24, scope: !134)
!369 = !DILocation(line: 56, column: 3, scope: !134)
!370 = !DILocation(line: 56, column: 9, scope: !134)
!371 = !DILocation(line: 56, column: 22, scope: !134)
!372 = !DILocation(line: 58, column: 10, scope: !134)
!373 = !DILocation(line: 58, column: 3, scope: !134)
!374 = distinct !DISubprogram(name: "deppossi_pkg_iter_next", scope: !135, file: !135, line: 62, type: !375, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!375 = !DISubroutineType(types: !376)
!376 = !{!150, !138}
!377 = !DILocalVariable(name: "iter", arg: 1, scope: !374, file: !135, line: 62, type: !138)
!378 = !DILocation(line: 62, column: 54, scope: !374)
!379 = !DILocalVariable(name: "pkg_cur", scope: !374, file: !135, line: 64, type: !150)
!380 = !DILocation(line: 64, column: 19, scope: !374)
!381 = !DILocalVariable(name: "pkgbin", scope: !374, file: !135, line: 65, type: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!383 = !DILocation(line: 65, column: 18, scope: !374)
!384 = !DILocation(line: 67, column: 3, scope: !374)
!385 = !DILocation(line: 67, column: 21, scope: !386)
!386 = !DILexicalBlockFile(scope: !374, file: !135, discriminator: 1)
!387 = !DILocation(line: 67, column: 27, scope: !386)
!388 = !DILocation(line: 67, column: 19, scope: !386)
!389 = !DILocation(line: 67, column: 3, scope: !386)
!390 = !DILocation(line: 68, column: 22, scope: !391)
!391 = distinct !DILexicalBlock(scope: !374, file: !135, line: 67, column: 38)
!392 = !DILocation(line: 68, column: 31, scope: !391)
!393 = !DILocation(line: 68, column: 5, scope: !391)
!394 = !DILocation(line: 68, column: 11, scope: !391)
!395 = !DILocation(line: 68, column: 20, scope: !391)
!396 = !DILocation(line: 70, column: 13, scope: !391)
!397 = !DILocation(line: 70, column: 19, scope: !391)
!398 = !DILocation(line: 70, column: 5, scope: !391)
!399 = !DILocation(line: 72, column: 17, scope: !400)
!400 = distinct !DILexicalBlock(scope: !391, file: !135, line: 70, column: 33)
!401 = !DILocation(line: 72, column: 26, scope: !400)
!402 = !DILocation(line: 72, column: 14, scope: !400)
!403 = !DILocation(line: 73, column: 7, scope: !400)
!404 = !DILocation(line: 75, column: 17, scope: !400)
!405 = !DILocation(line: 75, column: 26, scope: !400)
!406 = !DILocation(line: 75, column: 14, scope: !400)
!407 = !DILocation(line: 76, column: 7, scope: !400)
!408 = !DILocation(line: 78, column: 11, scope: !409)
!409 = distinct !DILexicalBlock(scope: !400, file: !135, line: 78, column: 11)
!410 = !DILocation(line: 78, column: 20, scope: !409)
!411 = !DILocation(line: 78, column: 31, scope: !409)
!412 = !DILocation(line: 79, column: 11, scope: !409)
!413 = !DILocation(line: 79, column: 20, scope: !409)
!414 = !DILocation(line: 79, column: 32, scope: !409)
!415 = !DILocation(line: 79, column: 39, scope: !409)
!416 = !DILocation(line: 78, column: 11, scope: !417)
!417 = !DILexicalBlockFile(scope: !400, file: !135, discriminator: 1)
!418 = !DILocation(line: 80, column: 19, scope: !409)
!419 = !DILocation(line: 80, column: 28, scope: !409)
!420 = !DILocation(line: 80, column: 16, scope: !409)
!421 = !DILocation(line: 80, column: 9, scope: !409)
!422 = !DILocation(line: 82, column: 19, scope: !409)
!423 = !DILocation(line: 82, column: 28, scope: !409)
!424 = !DILocation(line: 82, column: 16, scope: !409)
!425 = !DILocation(line: 83, column: 7, scope: !400)
!426 = !DILocation(line: 85, column: 73, scope: !400)
!427 = !DILocation(line: 85, column: 79, scope: !400)
!428 = !DILocation(line: 85, column: 7, scope: !400)
!429 = !DILocation(line: 88, column: 23, scope: !430)
!430 = distinct !DILexicalBlock(scope: !391, file: !135, line: 88, column: 9)
!431 = !DILocation(line: 88, column: 31, scope: !430)
!432 = !DILocation(line: 88, column: 37, scope: !430)
!433 = !DILocation(line: 88, column: 9, scope: !430)
!434 = !DILocation(line: 88, column: 9, scope: !391)
!435 = !DILocation(line: 89, column: 14, scope: !430)
!436 = !DILocation(line: 89, column: 7, scope: !430)
!437 = !DILocation(line: 67, column: 3, scope: !438)
!438 = !DILexicalBlockFile(scope: !374, file: !135, discriminator: 2)
!439 = distinct !{!439, !384}
!440 = !DILocation(line: 92, column: 3, scope: !374)
!441 = !DILocation(line: 93, column: 1, scope: !374)
!442 = distinct !DISubprogram(name: "deppossi_pkg_iter_free", scope: !135, file: !135, line: 96, type: !443, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !138}
!445 = !DILocalVariable(name: "iter", arg: 1, scope: !442, file: !135, line: 96, type: !138)
!446 = !DILocation(line: 96, column: 54, scope: !442)
!447 = !DILocation(line: 98, column: 8, scope: !442)
!448 = !DILocation(line: 98, column: 3, scope: !442)
!449 = !DILocation(line: 99, column: 1, scope: !442)
!450 = distinct !DISubprogram(name: "findbreakcycle", scope: !135, file: !135, line: 225, type: !451, isLocal: false, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!451 = !DISubroutineType(types: !452)
!452 = !{!189, !150}
!453 = !DILocalVariable(name: "pkg", arg: 1, scope: !450, file: !135, line: 225, type: !150)
!454 = !DILocation(line: 225, column: 32, scope: !450)
!455 = !DILocalVariable(name: "iter", scope: !450, file: !135, line: 227, type: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_hash_iter", file: !4, line: 314, flags: DIFlagFwdDecl)
!458 = !DILocation(line: 227, column: 25, scope: !450)
!459 = !DILocalVariable(name: "tpkg", scope: !450, file: !135, line: 228, type: !150)
!460 = !DILocation(line: 228, column: 19, scope: !450)
!461 = !DILocation(line: 231, column: 10, scope: !450)
!462 = !DILocation(line: 231, column: 8, scope: !450)
!463 = !DILocation(line: 232, column: 3, scope: !450)
!464 = !DILocation(line: 232, column: 41, scope: !465)
!465 = !DILexicalBlockFile(scope: !450, file: !135, discriminator: 1)
!466 = !DILocation(line: 232, column: 18, scope: !465)
!467 = !DILocation(line: 232, column: 16, scope: !465)
!468 = !DILocation(line: 232, column: 3, scope: !465)
!469 = !DILocation(line: 233, column: 31, scope: !470)
!470 = distinct !DILexicalBlock(scope: !450, file: !135, line: 232, column: 49)
!471 = !DILocation(line: 233, column: 5, scope: !470)
!472 = !DILocation(line: 234, column: 5, scope: !470)
!473 = !DILocation(line: 234, column: 11, scope: !470)
!474 = !DILocation(line: 234, column: 23, scope: !470)
!475 = !DILocation(line: 234, column: 29, scope: !470)
!476 = !DILocation(line: 232, column: 3, scope: !477)
!477 = !DILexicalBlockFile(scope: !450, file: !135, discriminator: 2)
!478 = distinct !{!478, !463}
!479 = !DILocation(line: 236, column: 22, scope: !450)
!480 = !DILocation(line: 236, column: 3, scope: !450)
!481 = !DILocation(line: 238, column: 34, scope: !450)
!482 = !DILocation(line: 238, column: 10, scope: !450)
!483 = !DILocation(line: 238, column: 3, scope: !450)
!484 = distinct !DISubprogram(name: "findbreakcyclerecursive", scope: !135, file: !135, line: 161, type: !485, isLocal: true, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !348)
!485 = !DISubroutineType(types: !486)
!486 = !{!189, !150, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cyclesofarlink", file: !135, line: 101, size: 192, align: 64, elements: !489)
!489 = !{!490, !491, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !488, file: !135, line: 102, baseType: !487, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !488, file: !135, line: 103, baseType: !150, size: 64, align: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "possi", scope: !488, file: !135, line: 104, baseType: !142, size: 64, align: 64, offset: 128)
!493 = !DILocalVariable(name: "pkg", arg: 1, scope: !484, file: !135, line: 161, type: !150)
!494 = !DILocation(line: 161, column: 41, scope: !484)
!495 = !DILocalVariable(name: "sofar", arg: 2, scope: !484, file: !135, line: 161, type: !487)
!496 = !DILocation(line: 161, column: 69, scope: !484)
!497 = !DILocalVariable(name: "thislink", scope: !484, file: !135, line: 163, type: !488)
!498 = !DILocation(line: 163, column: 25, scope: !484)
!499 = !DILocalVariable(name: "sol", scope: !484, file: !135, line: 163, type: !487)
!500 = !DILocation(line: 163, column: 36, scope: !484)
!501 = !DILocalVariable(name: "dep", scope: !484, file: !135, line: 164, type: !146)
!502 = !DILocation(line: 164, column: 22, scope: !484)
!503 = !DILocalVariable(name: "possi", scope: !484, file: !135, line: 165, type: !142)
!504 = !DILocation(line: 165, column: 20, scope: !484)
!505 = !DILocalVariable(name: "providelink", scope: !484, file: !135, line: 165, type: !142)
!506 = !DILocation(line: 165, column: 28, scope: !484)
!507 = !DILocalVariable(name: "provider", scope: !484, file: !135, line: 166, type: !150)
!508 = !DILocation(line: 166, column: 19, scope: !484)
!509 = !DILocalVariable(name: "pkg_pos", scope: !484, file: !135, line: 166, type: !150)
!510 = !DILocation(line: 166, column: 30, scope: !484)
!511 = !DILocation(line: 168, column: 7, scope: !512)
!512 = distinct !DILexicalBlock(scope: !484, file: !135, line: 168, column: 7)
!513 = !DILocation(line: 168, column: 12, scope: !512)
!514 = !DILocation(line: 168, column: 24, scope: !512)
!515 = !DILocation(line: 168, column: 30, scope: !512)
!516 = !DILocation(line: 168, column: 7, scope: !484)
!517 = !DILocation(line: 169, column: 5, scope: !512)
!518 = !DILocation(line: 170, column: 3, scope: !484)
!519 = !DILocation(line: 170, column: 8, scope: !484)
!520 = !DILocation(line: 170, column: 20, scope: !484)
!521 = !DILocation(line: 170, column: 26, scope: !484)
!522 = !DILocation(line: 172, column: 7, scope: !523)
!523 = distinct !DILexicalBlock(scope: !484, file: !135, line: 172, column: 7)
!524 = !DILocation(line: 172, column: 7, scope: !484)
!525 = !DILocalVariable(name: "str_pkgs", scope: !526, file: !135, line: 173, type: !527)
!526 = distinct !DILexicalBlock(scope: !523, file: !135, line: 172, column: 41)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !528, line: 55, size: 192, align: 64, elements: !529)
!528 = !DIFile(filename: "../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!529 = !{!530, !533, !534}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !527, file: !528, line: 56, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !532, line: 216, baseType: !324)
!532 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!533 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !527, file: !528, line: 56, baseType: !531, size: 64, align: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !527, file: !528, line: 57, baseType: !309, size: 64, align: 64, offset: 128)
!535 = !DILocation(line: 173, column: 19, scope: !526)
!536 = !DILocation(line: 175, column: 16, scope: !537)
!537 = distinct !DILexicalBlock(scope: !526, file: !135, line: 175, column: 5)
!538 = !DILocation(line: 175, column: 14, scope: !537)
!539 = !DILocation(line: 175, column: 10, scope: !537)
!540 = !DILocation(line: 175, column: 23, scope: !541)
!541 = !DILexicalBlockFile(scope: !542, file: !135, discriminator: 1)
!542 = distinct !DILexicalBlock(scope: !537, file: !135, line: 175, column: 5)
!543 = !DILocation(line: 175, column: 5, scope: !541)
!544 = !DILocation(line: 176, column: 7, scope: !545)
!545 = distinct !DILexicalBlock(scope: !542, file: !135, line: 175, column: 45)
!546 = !DILocation(line: 177, column: 41, scope: !545)
!547 = !DILocation(line: 177, column: 46, scope: !545)
!548 = !DILocation(line: 177, column: 52, scope: !545)
!549 = !DILocation(line: 177, column: 57, scope: !545)
!550 = !DILocation(line: 177, column: 62, scope: !545)
!551 = !DILocation(line: 177, column: 7, scope: !545)
!552 = !DILocation(line: 178, column: 5, scope: !545)
!553 = !DILocation(line: 175, column: 34, scope: !554)
!554 = !DILexicalBlockFile(scope: !542, file: !135, discriminator: 2)
!555 = !DILocation(line: 175, column: 39, scope: !554)
!556 = !DILocation(line: 175, column: 32, scope: !554)
!557 = !DILocation(line: 175, column: 5, scope: !554)
!558 = distinct !{!558, !559}
!559 = !DILocation(line: 175, column: 5, scope: !526)
!560 = !DILocation(line: 179, column: 5, scope: !526)
!561 = !DILocation(line: 181, column: 20, scope: !526)
!562 = !DILocation(line: 181, column: 11, scope: !526)
!563 = !DILocation(line: 181, column: 48, scope: !526)
!564 = !DILocation(line: 180, column: 5, scope: !526)
!565 = !DILocation(line: 182, column: 5, scope: !526)
!566 = !DILocation(line: 183, column: 3, scope: !526)
!567 = !DILocation(line: 184, column: 17, scope: !484)
!568 = !DILocation(line: 184, column: 12, scope: !484)
!569 = !DILocation(line: 184, column: 15, scope: !484)
!570 = !DILocation(line: 185, column: 19, scope: !484)
!571 = !DILocation(line: 185, column: 12, scope: !484)
!572 = !DILocation(line: 185, column: 17, scope: !484)
!573 = !DILocation(line: 186, column: 12, scope: !484)
!574 = !DILocation(line: 186, column: 18, scope: !484)
!575 = !DILocation(line: 187, column: 13, scope: !576)
!576 = distinct !DILexicalBlock(scope: !484, file: !135, line: 187, column: 3)
!577 = !DILocation(line: 187, column: 18, scope: !576)
!578 = !DILocation(line: 187, column: 28, scope: !576)
!579 = !DILocation(line: 187, column: 11, scope: !576)
!580 = !DILocation(line: 187, column: 8, scope: !576)
!581 = !DILocation(line: 187, column: 37, scope: !582)
!582 = !DILexicalBlockFile(scope: !583, file: !135, discriminator: 1)
!583 = distinct !DILexicalBlock(scope: !576, file: !135, line: 187, column: 3)
!584 = !DILocation(line: 187, column: 3, scope: !582)
!585 = !DILocation(line: 188, column: 9, scope: !586)
!586 = distinct !DILexicalBlock(scope: !587, file: !135, line: 188, column: 9)
!587 = distinct !DILexicalBlock(scope: !583, file: !135, line: 187, column: 58)
!588 = !DILocation(line: 188, column: 14, scope: !586)
!589 = !DILocation(line: 188, column: 19, scope: !586)
!590 = !DILocation(line: 188, column: 34, scope: !586)
!591 = !DILocation(line: 188, column: 37, scope: !592)
!592 = !DILexicalBlockFile(scope: !586, file: !135, discriminator: 1)
!593 = !DILocation(line: 188, column: 42, scope: !592)
!594 = !DILocation(line: 188, column: 47, scope: !592)
!595 = !DILocation(line: 188, column: 9, scope: !592)
!596 = !DILocation(line: 188, column: 66, scope: !597)
!597 = !DILexicalBlockFile(scope: !586, file: !135, discriminator: 2)
!598 = !DILocation(line: 189, column: 17, scope: !599)
!599 = distinct !DILexicalBlock(scope: !587, file: !135, line: 189, column: 5)
!600 = !DILocation(line: 189, column: 22, scope: !599)
