; ModuleID = './[inter]src--packages.o.i'
source_filename = "./[inter]src--packages.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pkg_queue = type { %struct.pkg_list*, %struct.pkg_list*, i32 }
%struct.pkg_list = type { %struct.pkg_list*, %struct.pkginfo* }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.1, i32 }
%struct.anon.1 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }
%struct.pkgbin = type { %struct.dependency*, i8, i32, %struct.dpkg_arch*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.dpkg_version, %struct.conffile*, %struct.arbitraryfield* }
%struct.conffile = type { %struct.conffile*, i8*, i8*, i8 }
%struct.arbitraryfield = type { %struct.arbitraryfield*, i8*, i8* }

!180 = !DIEnumerator(name: "act_validate_version", value: 30)
!181 = !DIEnumerator(name: "act_audit", value: 31)
!182 = !DIEnumerator(name: "act_unpackchk", value: 32)
!183 = !DIEnumerator(name: "act_predeppackage", value: 33)
!184 = !DIEnumerator(name: "act_getselections", value: 34)
!185 = !DIEnumerator(name: "act_setselections", value: 35)
!186 = !DIEnumerator(name: "act_clearselections", value: 36)
!187 = !DIEnumerator(name: "act_avail", value: 37)
!188 = !DIEnumerator(name: "act_printavail", value: 38)
!189 = !DIEnumerator(name: "act_avclear", value: 39)
!190 = !DIEnumerator(name: "act_avreplace", value: 40)
!191 = !DIEnumerator(name: "act_avmerge", value: 41)
!192 = !DIEnumerator(name: "act_forgetold", value: 42)
!193 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_name_arch_when", file: !13, line: 396, size: 32, align: 32, elements: !194)
!194 = !{!195, !196, !197, !198}
!195 = !DIEnumerator(name: "pnaw_never", value: 0)
!196 = !DIEnumerator(name: "pnaw_nonambig", value: 1)
!197 = !DIEnumerator(name: "pnaw_foreign", value: 2)
!198 = !DIEnumerator(name: "pnaw_always", value: 3)
!199 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "debugflags", file: !200, line: 41, size: 32, align: 32, elements: !201)
!200 = !DIFile(filename: "../lib/dpkg/debug.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214}
!202 = !DIEnumerator(name: "dbg_general", value: 1)
!203 = !DIEnumerator(name: "dbg_scripts", value: 2)
!204 = !DIEnumerator(name: "dbg_eachfile", value: 8)
!205 = !DIEnumerator(name: "dbg_eachfiledetail", value: 64)
!206 = !DIEnumerator(name: "dbg_conff", value: 16)
!207 = !DIEnumerator(name: "dbg_conffdetail", value: 128)
!208 = !DIEnumerator(name: "dbg_depcon", value: 32)
!209 = !DIEnumerator(name: "dbg_depcondetail", value: 256)
!210 = !DIEnumerator(name: "dbg_veryverbose", value: 512)
!211 = !DIEnumerator(name: "dbg_stupidlyverbose", value: 1024)
!212 = !DIEnumerator(name: "dbg_triggers", value: 4096)
!213 = !DIEnumerator(name: "dbg_triggersdetail", value: 8192)
!214 = !DIEnumerator(name: "dbg_triggersstupid", value: 16384)
!215 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !216, line: 41, size: 32, align: 32, elements: !217)
!216 = !DIFile(filename: "../lib/dpkg/ehandle.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!217 = !{!218, !219, !220}
!218 = !DIEnumerator(name: "ehflag_normaltidy", value: 1)
!219 = !DIEnumerator(name: "ehflag_bombout", value: 2)
!220 = !DIEnumerator(name: "ehflag_recursiveerror", value: 4)
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "trigproc_type", file: !4, line: 320, size: 32, align: 32, elements: !222)
!222 = !{!223, !224, !225}
!223 = !DIEnumerator(name: "TRIGPROC_TRY_DEFERRED", value: 0)
!224 = !DIEnumerator(name: "TRIGPROC_TRY_QUEUED", value: 1)
!225 = !DIEnumerator(name: "TRIGPROC_REQUIRED", value: 2)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dep_check", file: !4, line: 199, size: 32, align: 32, elements: !227)
!227 = !{!228, !229, !230}
!228 = !DIEnumerator(name: "DEP_CHECK_HALT", value: 0)
!229 = !DIEnumerator(name: "DEP_CHECK_DEFER", value: 1)
!230 = !DIEnumerator(name: "DEP_CHECK_OK", value: 2)
!231 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "found_status", file: !232, line: 347, size: 32, align: 32, elements: !233)
!232 = !DIFile(filename: "packages.c", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!233 = !{!234, !235, !236, !237}
!234 = !DIEnumerator(name: "FOUND_NONE", value: 0)
!235 = !DIEnumerator(name: "FOUND_DEFER", value: 1)
!236 = !DIEnumerator(name: "FOUND_FORCED", value: 2)
!237 = !DIEnumerator(name: "FOUND_OK", value: 3)
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "which_pkgbin", file: !4, line: 340, size: 32, align: 32, elements: !239)
!239 = !{!240, !241, !242}
!240 = !DIEnumerator(name: "wpb_installed", value: 0)
!241 = !DIEnumerator(name: "wpb_available", value: 1)
!242 = !DIEnumerator(name: "wpb_by_istobe", value: 2)
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "versiondisplayepochwhen", file: !13, line: 388, size: 32, align: 32, elements: !244)
!244 = !{!245, !246, !247}
!245 = !DIEnumerator(name: "vdew_never", value: 0)
!246 = !DIEnumerator(name: "vdew_nonambig", value: 1)
!247 = !DIEnumerator(name: "vdew_always", value: 2)
!248 = !{!249, !250}
!249 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!251 = !{!252, !253, !254, !458}
!252 = distinct !DIGlobalVariable(name: "dependtry", scope: !0, file: !232, line: 52, type: !3, isLocal: false, isDefinition: true, variable: i32* @dependtry)
!253 = distinct !DIGlobalVariable(name: "sincenothing", scope: !0, file: !232, line: 53, type: !249, isLocal: false, isDefinition: true, variable: i32* @sincenothing)
!254 = distinct !DIGlobalVariable(name: "progress_bytrigproc", scope: !0, file: !232, line: 49, type: !255, isLocal: true, isDefinition: true, variable: %struct.pkginfo** @progress_bytrigproc)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !13, line: 195, size: 3072, align: 64, elements: !257)
!257 = !{!258, !309, !310, !311, !312, !313, !314, !315, !316, !317, !347, !348, !364, !373, !389, !390, !396, !452, !456, !457}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !256, file: !13, line: 196, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !13, line: 242, size: 3392, align: 64, elements: !261)
!261 = !{!262, !263, !267, !268, !308}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !13, line: 243, baseType: !259, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !13, line: 244, baseType: !264, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !260, file: !13, line: 245, baseType: !256, size: 3072, align: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !260, file: !13, line: 249, baseType: !269, size: 128, align: 64, offset: 3200)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !13, line: 246, size: 128, align: 64, elements: !270)
!270 = !{!271, !307}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !269, file: !13, line: 247, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !13, line: 63, size: 640, align: 64, elements: !274)
!274 = !{!275, !283, !284, !285, !286, !287, !296, !303, !304, !306}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !273, file: !13, line: 64, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !13, line: 56, size: 256, align: 64, elements: !278)
!278 = !{!279, !280, !281, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !277, file: !13, line: 57, baseType: !255, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !13, line: 58, baseType: !276, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !277, file: !13, line: 59, baseType: !272, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !277, file: !13, line: 60, baseType: !12, size: 32, align: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !273, file: !13, line: 65, baseType: !259, size: 64, align: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !273, file: !13, line: 66, baseType: !272, size: 64, align: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !273, file: !13, line: 66, baseType: !272, size: 64, align: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !273, file: !13, line: 66, baseType: !272, size: 64, align: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !273, file: !13, line: 67, baseType: !288, size: 64, align: 64, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !25, line: 48, size: 192, align: 64, elements: !291)
!291 = !{!292, !294, !295}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !290, file: !25, line: 49, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !25, line: 50, baseType: !264, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !25, line: 51, baseType: !24, size: 32, align: 32, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !273, file: !13, line: 68, baseType: !297, size: 192, align: 64, offset: 384)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !36, line: 42, size: 192, align: 64, elements: !298)
!298 = !{!299, !301, !302}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !297, file: !36, line: 44, baseType: !300, size: 32, align: 32)
!300 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !297, file: !36, line: 46, baseType: !264, size: 64, align: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !297, file: !36, line: 48, baseType: !264, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !273, file: !13, line: 69, baseType: !35, size: 32, align: 32, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !273, file: !13, line: 70, baseType: !305, size: 8, align: 8, offset: 608)
!305 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !273, file: !13, line: 71, baseType: !305, size: 8, align: 8, offset: 616)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !269, file: !13, line: 248, baseType: !272, size: 64, align: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !260, file: !13, line: 250, baseType: !249, size: 32, align: 32, offset: 3328)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !256, file: !13, line: 197, baseType: !255, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !256, file: !13, line: 199, baseType: !44, size: 32, align: 32, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !256, file: !13, line: 201, baseType: !52, size: 32, align: 32, offset: 160)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !256, file: !13, line: 202, baseType: !56, size: 32, align: 32, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !256, file: !13, line: 203, baseType: !66, size: 32, align: 32, offset: 224)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !256, file: !13, line: 204, baseType: !264, size: 64, align: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !256, file: !13, line: 205, baseType: !264, size: 64, align: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !256, file: !13, line: 206, baseType: !297, size: 192, align: 64, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !256, file: !13, line: 207, baseType: !318, size: 960, align: 64, offset: 576)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !13, line: 107, size: 960, align: 64, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !340}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !318, file: !13, line: 108, baseType: !276, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !318, file: !13, line: 110, baseType: !305, size: 8, align: 8, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !318, file: !13, line: 111, baseType: !76, size: 32, align: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !318, file: !13, line: 112, baseType: !288, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !318, file: !13, line: 115, baseType: !264, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !318, file: !13, line: 116, baseType: !264, size: 64, align: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !318, file: !13, line: 117, baseType: !264, size: 64, align: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !318, file: !13, line: 118, baseType: !264, size: 64, align: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !318, file: !13, line: 119, baseType: !264, size: 64, align: 64, offset: 448)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !318, file: !13, line: 120, baseType: !264, size: 64, align: 64, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !318, file: !13, line: 121, baseType: !264, size: 64, align: 64, offset: 576)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !318, file: !13, line: 122, baseType: !297, size: 192, align: 64, offset: 640)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !318, file: !13, line: 123, baseType: !333, size: 64, align: 64, offset: 832)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !13, line: 80, size: 256, align: 64, elements: !335)
!335 = !{!336, !337, !338, !339}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !334, file: !13, line: 81, baseType: !333, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !334, file: !13, line: 82, baseType: !264, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !334, file: !13, line: 83, baseType: !264, size: 64, align: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !334, file: !13, line: 84, baseType: !305, size: 8, align: 8, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !318, file: !13, line: 124, baseType: !341, size: 64, align: 64, offset: 896)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !13, line: 74, size: 192, align: 64, elements: !343)
!343 = !{!344, !345, !346}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !342, file: !13, line: 75, baseType: !341, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !342, file: !13, line: 76, baseType: !264, size: 64, align: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !342, file: !13, line: 77, baseType: !264, size: 64, align: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !256, file: !13, line: 208, baseType: !318, size: 960, align: 64, offset: 1536)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !256, file: !13, line: 209, baseType: !349, size: 64, align: 64, offset: 2496)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !4, line: 53, size: 256, align: 64, elements: !351)
!351 = !{!352, !353, !354, !355, !356, !357}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "istobe", scope: !350, file: !4, line: 54, baseType: !82, size: 32, align: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !350, file: !4, line: 57, baseType: !89, size: 32, align: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "enqueued", scope: !350, file: !4, line: 59, baseType: !305, size: 8, align: 8, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "replacingfilesandsaid", scope: !350, file: !4, line: 61, baseType: !249, size: 32, align: 32, offset: 96)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "cmdline_seen", scope: !350, file: !4, line: 62, baseType: !249, size: 32, align: 32, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "trigprocdeferred", scope: !350, file: !4, line: 65, baseType: !358, size: 64, align: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_list", file: !360, line: 34, size: 128, align: 64, elements: !361)
!360 = !DIFile(filename: "../lib/dpkg/pkg-list.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !359, file: !360, line: 35, baseType: !358, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !359, file: !360, line: 36, baseType: !255, size: 64, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !256, file: !13, line: 211, baseType: !365, size: 64, align: 64, offset: 2560)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !13, line: 87, size: 320, align: 64, elements: !367)
!367 = !{!368, !369, !370, !371, !372}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !366, file: !13, line: 88, baseType: !365, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !366, file: !13, line: 89, baseType: !264, size: 64, align: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !366, file: !13, line: 90, baseType: !264, size: 64, align: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !366, file: !13, line: 91, baseType: !264, size: 64, align: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !366, file: !13, line: 92, baseType: !264, size: 64, align: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !256, file: !13, line: 216, baseType: !374, size: 128, align: 64, offset: 2624)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !256, file: !13, line: 213, size: 128, align: 64, elements: !375)
!375 = !{!376, !388}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !374, file: !13, line: 215, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !13, line: 142, size: 320, align: 64, elements: !379)
!379 = !{!380, !381, !382, !383}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !378, file: !13, line: 143, baseType: !255, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !378, file: !13, line: 143, baseType: !255, size: 64, align: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !378, file: !13, line: 144, baseType: !377, size: 64, align: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !378, file: !13, line: 147, baseType: !384, size: 128, align: 64, offset: 192)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !378, file: !13, line: 145, size: 128, align: 64, elements: !385)
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !384, file: !13, line: 146, baseType: !377, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !384, file: !13, line: 146, baseType: !377, size: 64, align: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !374, file: !13, line: 215, baseType: !377, size: 64, align: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !256, file: !13, line: 219, baseType: !377, size: 64, align: 64, offset: 2752)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !256, file: !13, line: 220, baseType: !391, size: 64, align: 64, offset: 2816)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !13, line: 134, size: 128, align: 64, elements: !393)
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !392, file: !13, line: 135, baseType: !391, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !392, file: !13, line: 136, baseType: !264, size: 64, align: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !256, file: !13, line: 231, baseType: !397, size: 64, align: 64, offset: 2880)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !95, line: 122, size: 128, align: 64, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !398, file: !95, line: 123, baseType: !397, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "namenode", scope: !398, file: !95, line: 124, baseType: !402, size: 64, align: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode", file: !95, line: 90, size: 640, align: 64, elements: !404)
!404 = !{!405, !406, !407, !408, !416, !435, !438, !439, !440, !441}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !403, file: !95, line: 91, baseType: !402, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !403, file: !95, line: 92, baseType: !264, size: 64, align: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "packages", scope: !403, file: !95, line: 93, baseType: !358, size: 64, align: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "divert", scope: !403, file: !95, line: 94, baseType: !409, size: 64, align: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_diversion", file: !95, line: 151, size: 256, align: 64, elements: !411)
!411 = !{!412, !413, !414, !415}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "useinstead", scope: !410, file: !95, line: 152, baseType: !402, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "camefrom", scope: !410, file: !95, line: 153, baseType: !402, size: 64, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pkgset", scope: !410, file: !95, line: 154, baseType: !259, size: 64, align: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !410, file: !95, line: 157, baseType: !409, size: 64, align: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "statoverride", scope: !403, file: !95, line: 101, baseType: !417, size: 64, align: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !419, line: 40, size: 256, align: 64, elements: !420)
!419 = !DIFile(filename: "../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!420 = !{!421, !426, !429, !432, !434}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !418, file: !419, line: 41, baseType: !422, size: 32, align: 32)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !423, line: 80, baseType: !424)
!423 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !425, line: 125, baseType: !300)
!425 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!426 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !418, file: !419, line: 42, baseType: !427, size: 32, align: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !423, line: 65, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !425, line: 126, baseType: !300)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !418, file: !419, line: 43, baseType: !430, size: 32, align: 32, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !423, line: 70, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !425, line: 129, baseType: !300)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !418, file: !419, line: 47, baseType: !433, size: 64, align: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !418, file: !419, line: 48, baseType: !433, size: 64, align: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "trig_interested", scope: !403, file: !95, line: 103, baseType: !436, size: 64, align: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "trigfileint", file: !95, line: 103, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !403, file: !95, line: 111, baseType: !94, size: 32, align: 32, offset: 384)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "oldhash", scope: !403, file: !95, line: 114, baseType: !264, size: 64, align: 64, offset: 448)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "newhash", scope: !403, file: !95, line: 117, baseType: !264, size: 64, align: 64, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "file_ondisk_id", scope: !403, file: !95, line: 119, baseType: !442, size: 64, align: 64, offset: 576)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_ondisk_id", file: !95, line: 85, size: 128, align: 64, elements: !444)
!444 = !{!445, !449}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "id_dev", scope: !443, file: !95, line: 86, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !423, line: 60, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !425, line: 124, baseType: !448)
!448 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "id_ino", scope: !443, file: !95, line: 87, baseType: !450, size: 64, align: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !423, line: 48, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !425, line: 127, baseType: !448)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !256, file: !13, line: 232, baseType: !453, size: 64, align: 64, offset: 2944)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !423, line: 86, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !425, line: 131, baseType: !455)
!455 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !256, file: !13, line: 233, baseType: !305, size: 8, align: 8, offset: 3008)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !256, file: !13, line: 236, baseType: !305, size: 8, align: 8, offset: 3016)
!458 = distinct !DIGlobalVariable(name: "queue", scope: !0, file: !232, line: 50, type: !459, isLocal: true, isDefinition: true, variable: %struct.pkg_queue* @queue)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_queue", file: !460, line: 35, size: 192, align: 64, elements: !461)
!460 = !DIFile(filename: "../lib/dpkg/pkg-queue.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!461 = !{!462, !463, !464}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !459, file: !460, line: 36, baseType: !358, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !459, file: !460, line: 36, baseType: !358, size: 64, align: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !459, file: !460, line: 37, baseType: !249, size: 32, align: 32, offset: 128)
!465 = !{i32 2, !"Dwarf Version", i32 4}
!466 = !{i32 2, !"Debug Info Version", i32 3}
!467 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!468 = distinct !DISubprogram(name: "enqueue_package", scope: !232, file: !232, line: 56, type: !469, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !471)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !255}
!471 = !{}
!472 = !DILocalVariable(name: "pkg", arg: 1, scope: !468, file: !232, line: 56, type: !255)
!473 = !DIExpression()
!474 = !DILocation(line: 56, column: 33, scope: !468)
!475 = !DILocation(line: 58, column: 29, scope: !468)
!476 = !DILocation(line: 58, column: 3, scope: !468)
!477 = !DILocation(line: 59, column: 7, scope: !478)
!478 = distinct !DILexicalBlock(scope: !468, file: !232, line: 59, column: 7)
!479 = !DILocation(line: 59, column: 12, scope: !478)
!480 = !DILocation(line: 59, column: 24, scope: !478)
!481 = !DILocation(line: 59, column: 7, scope: !468)
!482 = !DILocation(line: 60, column: 5, scope: !478)
!483 = !DILocation(line: 61, column: 3, scope: !468)
!484 = !DILocation(line: 61, column: 8, scope: !468)
!485 = !DILocation(line: 61, column: 20, scope: !468)
!486 = !DILocation(line: 61, column: 29, scope: !468)
!487 = !DILocation(line: 62, column: 26, scope: !468)
!488 = !DILocation(line: 62, column: 3, scope: !468)
!489 = !DILocation(line: 63, column: 1, scope: !468)
!490 = !DILocation(line: 63, column: 1, scope: !491)
!491 = !DILexicalBlockFile(scope: !468, file: !232, discriminator: 1)
!492 = distinct !DISubprogram(name: "enqueue_package_mark_seen", scope: !232, file: !232, line: 66, type: !469, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !471)
!493 = !DILocalVariable(name: "pkg", arg: 1, scope: !492, file: !232, line: 66, type: !255)
!494 = !DILocation(line: 66, column: 43, scope: !492)
!495 = !DILocation(line: 68, column: 19, scope: !492)
!496 = !DILocation(line: 68, column: 3, scope: !492)
!497 = !DILocation(line: 69, column: 3, scope: !492)
!498 = !DILocation(line: 69, column: 8, scope: !492)
!499 = !DILocation(line: 69, column: 20, scope: !492)
!500 = !DILocation(line: 69, column: 32, scope: !492)
!501 = !DILocation(line: 70, column: 1, scope: !492)
!502 = distinct !DISubprogram(name: "packages", scope: !232, file: !232, line: 136, type: !503, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !471)
!503 = !DISubroutineType(types: !504)
!504 = !{!249, !505}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!507 = !DILocalVariable(name: "argv", arg: 1, scope: !502, file: !232, line: 136, type: !505)
!508 = !DILocation(line: 136, column: 29, scope: !502)
!509 = !DILocation(line: 138, column: 3, scope: !502)
!510 = !DILocation(line: 140, column: 18, scope: !502)
!511 = !DILocation(line: 140, column: 18, scope: !512)
!512 = !DILexicalBlockFile(scope: !502, file: !232, discriminator: 1)
!513 = !DILocation(line: 141, column: 18, scope: !502)
!514 = !DILocation(line: 140, column: 18, scope: !515)
!515 = !DILexicalBlockFile(scope: !502, file: !232, discriminator: 2)
!516 = !DILocation(line: 140, column: 18, scope: !517)
!517 = !DILexicalBlockFile(scope: !502, file: !232, discriminator: 3)
!518 = !DILocation(line: 140, column: 3, scope: !517)
!519 = !DILocation(line: 143, column: 3, scope: !502)
!520 = !DILocation(line: 144, column: 3, scope: !502)
!521 = !DILocation(line: 146, column: 38, scope: !502)
!522 = !DILocation(line: 146, column: 49, scope: !502)
!523 = !DILocation(line: 146, column: 3, scope: !502)
!524 = !DILocation(line: 148, column: 7, scope: !525)
!525 = distinct !DILexicalBlock(scope: !502, file: !232, line: 148, column: 7)
!526 = !DILocation(line: 148, column: 7, scope: !502)
!527 = !DILocation(line: 149, column: 10, scope: !528)
!528 = distinct !DILexicalBlock(scope: !529, file: !232, line: 149, column: 9)
!529 = distinct !DILexicalBlock(scope: !525, file: !232, line: 148, column: 18)
!530 = !DILocation(line: 149, column: 9, scope: !528)
!531 = !DILocation(line: 149, column: 9, scope: !529)
!532 = !DILocation(line: 150, column: 16, scope: !528)
!533 = !DILocation(line: 150, column: 81, scope: !528)
!534 = !DILocation(line: 150, column: 92, scope: !528)
!535 = !DILocation(line: 150, column: 7, scope: !536)
!536 = !DILexicalBlockFile(scope: !528, file: !232, discriminator: 1)
!537 = !DILocation(line: 150, column: 7, scope: !528)
!538 = !DILocation(line: 152, column: 5, scope: !529)
!539 = !DILocation(line: 153, column: 3, scope: !529)
!540 = !DILocation(line: 154, column: 11, scope: !541)
!541 = distinct !DILexicalBlock(scope: !542, file: !232, line: 154, column: 9)
!542 = distinct !DILexicalBlock(scope: !525, file: !232, line: 153, column: 10)
!543 = !DILocation(line: 154, column: 10, scope: !541)
!544 = !DILocation(line: 154, column: 9, scope: !542)
!545 = !DILocation(line: 155, column: 16, scope: !541)
!546 = !DILocation(line: 155, column: 74, scope: !541)
!547 = !DILocation(line: 155, column: 85, scope: !541)
!548 = !DILocation(line: 155, column: 7, scope: !549)
!549 = !DILexicalBlockFile(scope: !541, file: !232, discriminator: 1)
!550 = !DILocation(line: 155, column: 7, scope: !541)
!551 = !DILocation(line: 157, column: 23, scope: !542)
!552 = !DILocation(line: 157, column: 5, scope: !542)
!553 = !DILocation(line: 160, column: 3, scope: !502)
!554 = !DILocation(line: 162, column: 3, scope: !502)
!555 = !DILocation(line: 163, column: 3, scope: !502)
!556 = !DILocation(line: 165, column: 3, scope: !502)
!557 = !DILocation(line: 167, column: 3, scope: !502)
!558 = distinct !DISubprogram(name: "enqueue_pending", scope: !232, file: !232, line: 73, type: !559, isLocal: true, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !471)
!559 = !DISubroutineType(types: !560)
!560 = !{null}
!561 = !DILocalVariable(name: "iter", scope: !558, file: !232, line: 75, type: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_hash_iter", file: !13, line: 314, flags: DIFlagFwdDecl)
!564 = !DILocation(line: 75, column: 25, scope: !558)
!565 = !DILocalVariable(name: "pkg", scope: !558, file: !232, line: 76, type: !255)
!566 = !DILocation(line: 76, column: 19, scope: !558)
!567 = !DILocation(line: 78, column: 10, scope: !558)
!568 = !DILocation(line: 78, column: 8, scope: !558)
!569 = !DILocation(line: 79, column: 3, scope: !558)
!570 = !DILocation(line: 79, column: 40, scope: !571)
!571 = !DILexicalBlockFile(scope: !558, file: !232, discriminator: 1)
!572 = !DILocation(line: 79, column: 17, scope: !571)
!573 = !DILocation(line: 79, column: 15, scope: !571)
!574 = !DILocation(line: 79, column: 47, scope: !571)
!575 = !DILocation(line: 79, column: 3, scope: !571)
!576 = !DILocation(line: 80, column: 13, scope: !577)
!577 = distinct !DILexicalBlock(scope: !558, file: !232, line: 79, column: 55)
!578 = !DILocation(line: 80, column: 24, scope: !577)
!579 = !DILocation(line: 80, column: 5, scope: !577)
!580 = !DILocation(line: 82, column: 13, scope: !581)
!581 = distinct !DILexicalBlock(scope: !582, file: !232, line: 82, column: 11)
!582 = distinct !DILexicalBlock(scope: !577, file: !232, line: 80, column: 33)
!583 = !DILocation(line: 82, column: 18, scope: !581)
!584 = !DILocation(line: 82, column: 25, scope: !581)
!585 = !DILocation(line: 82, column: 46, scope: !581)
!586 = !DILocation(line: 83, column: 13, scope: !581)
!587 = !DILocation(line: 83, column: 18, scope: !581)
!588 = !DILocation(line: 83, column: 25, scope: !581)
!589 = !DILocation(line: 83, column: 52, scope: !581)
!590 = !DILocation(line: 84, column: 13, scope: !581)
!591 = !DILocation(line: 84, column: 18, scope: !581)
!592 = !DILocation(line: 82, column: 11, scope: !593)
!593 = !DILexicalBlockFile(scope: !582, file: !232, discriminator: 1)
!594 = !DILocation(line: 85, column: 9, scope: !581)
!595 = distinct !{!595, !569}
!596 = !DILocation(line: 86, column: 11, scope: !597)
!597 = distinct !DILexicalBlock(scope: !582, file: !232, line: 86, column: 11)
!598 = !DILocation(line: 86, column: 16, scope: !597)
!599 = !DILocation(line: 86, column: 21, scope: !597)
!600 = !DILocation(line: 86, column: 11, scope: !582)
!601 = !DILocation(line: 87, column: 9, scope: !597)
!602 = !DILocation(line: 88, column: 7, scope: !582)
!603 = !DILocation(line: 90, column: 12, scope: !604)
!604 = distinct !DILexicalBlock(scope: !582, file: !232, line: 90, column: 11)
!605 = !DILocation(line: 90, column: 17, scope: !604)
!606 = !DILocation(line: 90, column: 11, scope: !582)
!607 = !DILocation(line: 91, column: 9, scope: !604)
!608 = !DILocation(line: 92, column: 11, scope: !609)
!609 = distinct !DILexicalBlock(scope: !582, file: !232, line: 92, column: 11)
!610 = !DILocation(line: 92, column: 16, scope: !609)
!611 = !DILocation(line: 92, column: 21, scope: !609)
!612 = !DILocation(line: 92, column: 11, scope: !582)
!613 = !DILocation(line: 93, column: 9, scope: !609)
!614 = !DILocation(line: 94, column: 7, scope: !582)
!615 = !DILocation(line: 97, column: 11, scope: !616)
!616 = distinct !DILexicalBlock(scope: !582, file: !232, line: 97, column: 11)
!617 = !DILocation(line: 97, column: 16, scope: !616)
!618 = !DILocation(line: 97, column: 21, scope: !616)
!619 = !DILocation(line: 97, column: 11, scope: !582)
!620 = !DILocation(line: 98, column: 13, scope: !621)
!621 = distinct !DILexicalBlock(scope: !622, file: !232, line: 98, column: 13)
!622 = distinct !DILexicalBlock(scope: !616, file: !232, line: 97, column: 40)
!623 = !DILocation(line: 98, column: 18, scope: !621)
!624 = !DILocation(line: 98, column: 23, scope: !621)
!625 = !DILocation(line: 98, column: 13, scope: !622)
!626 = !DILocation(line: 99, column: 11, scope: !621)
!627 = !DILocation(line: 100, column: 13, scope: !628)
!628 = distinct !DILexicalBlock(scope: !622, file: !232, line: 100, column: 13)
!629 = !DILocation(line: 100, column: 18, scope: !628)
!630 = !DILocation(line: 100, column: 25, scope: !628)
!631 = !DILocation(line: 100, column: 13, scope: !622)
!632 = !DILocation(line: 101, column: 11, scope: !628)
!633 = !DILocation(line: 102, column: 7, scope: !622)
!634 = !DILocation(line: 103, column: 11, scope: !635)
!635 = distinct !DILexicalBlock(scope: !582, file: !232, line: 103, column: 11)
!636 = !DILocation(line: 103, column: 16, scope: !635)
!637 = !DILocation(line: 103, column: 23, scope: !635)
!638 = !DILocation(line: 103, column: 11, scope: !582)
!639 = !DILocation(line: 104, column: 9, scope: !635)
!640 = !DILocation(line: 105, column: 7, scope: !582)
!641 = !DILocation(line: 107, column: 72, scope: !582)
!642 = !DILocation(line: 107, column: 83, scope: !582)
!643 = !DILocation(line: 107, column: 7, scope: !582)
!644 = !DILocation(line: 109, column: 21, scope: !577)
!645 = !DILocation(line: 109, column: 5, scope: !577)
!646 = !DILocation(line: 79, column: 3, scope: !647)
!647 = !DILexicalBlockFile(scope: !558, file: !232, discriminator: 2)
!648 = !DILocation(line: 111, column: 22, scope: !558)
!649 = !DILocation(line: 111, column: 3, scope: !558)
!650 = !DILocation(line: 112, column: 1, scope: !558)
!651 = distinct !DISubprogram(name: "enqueue_specified", scope: !232, file: !232, line: 115, type: !652, isLocal: true, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !471)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !505}
!654 = !DILocalVariable(name: "argv", arg: 1, scope: !651, file: !232, line: 115, type: !505)
!655 = !DILocation(line: 115, column: 38, scope: !651)
!656 = !DILocalVariable(name: "thisarg", scope: !651, file: !232, line: 117, type: !264)
!657 = !DILocation(line: 117, column: 15, scope: !651)
!658 = !DILocation(line: 119, column: 3, scope: !651)
!659 = !DILocation(line: 119, column: 26, scope: !660)
!660 = !DILexicalBlockFile(scope: !651, file: !232, discriminator: 1)
!661 = !DILocation(line: 119, column: 21, scope: !660)
!662 = !DILocation(line: 119, column: 19, scope: !660)
!663 = !DILocation(line: 119, column: 30, scope: !660)
!664 = !DILocation(line: 119, column: 3, scope: !660)
!665 = !DILocalVariable(name: "pkg", scope: !666, file: !232, line: 120, type: !255)
!666 = distinct !DILexicalBlock(scope: !651, file: !232, line: 119, column: 38)
!667 = !DILocation(line: 120, column: 21, scope: !666)
!668 = !DILocation(line: 122, column: 38, scope: !666)
!669 = !DILocation(line: 122, column: 49, scope: !666)
!670 = !DILocation(line: 122, column: 11, scope: !666)
!671 = !DILocation(line: 122, column: 9, scope: !666)
!672 = !DILocation(line: 123, column: 9, scope: !673)
!673 = distinct !DILexicalBlock(scope: !666, file: !232, line: 123, column: 9)
!674 = !DILocation(line: 123, column: 14, scope: !673)
!675 = !DILocation(line: 123, column: 21, scope: !673)
!676 = !DILocation(line: 123, column: 46, scope: !673)
!677 = !DILocation(line: 124, column: 23, scope: !673)
!678 = !DILocation(line: 124, column: 28, scope: !673)
!679 = !DILocation(line: 124, column: 33, scope: !673)
!680 = !DILocation(line: 124, column: 9, scope: !673)
!681 = !DILocation(line: 123, column: 9, scope: !682)
!682 = !DILexicalBlockFile(scope: !666, file: !232, discriminator: 1)
!683 = !DILocation(line: 125, column: 16, scope: !684)
!684 = distinct !DILexicalBlock(scope: !673, file: !232, line: 124, column: 48)
!685 = !DILocation(line: 125, column: 7, scope: !686)
!686 = !DILexicalBlockFile(scope: !684, file: !232, discriminator: 1)
!687 = !DILocation(line: 125, column: 7, scope: !684)
!688 = !DILocation(line: 128, column: 31, scope: !666)
!689 = !DILocation(line: 128, column: 5, scope: !666)
!690 = !DILocation(line: 119, column: 3, scope: !691)
!691 = !DILexicalBlockFile(scope: !651, file: !232, discriminator: 2)
!692 = distinct !{!692, !658}
!693 = !DILocation(line: 131, column: 7, scope: !694)
!694 = distinct !DILexicalBlock(scope: !651, file: !232, line: 131, column: 7)
!695 = !DILocation(line: 131, column: 18, scope: !694)
!696 = !DILocation(line: 131, column: 26, scope: !694)
!697 = !DILocation(line: 131, column: 7, scope: !651)
!698 = !DILocation(line: 132, column: 5, scope: !694)
!699 = !DILocation(line: 133, column: 1, scope: !651)
!700 = distinct !DISubprogram(name: "process_queue", scope: !232, file: !232, line: 170, type: !559, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !471)
!701 = !DILocalVariable(name: "rundown", scope: !700, file: !232, line: 171, type: !358)
!702 = !DILocation(line: 171, column: 20, scope: !700)
!703 = !DILocalVariable(name: "pkg", scope: !700, file: !232, line: 172, type: !704)
!704 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !255)
!705 = !DILocation(line: 172, column: 28, scope: !700)
!706 = !DILocalVariable(name: "action_todo", scope: !700, file: !232, line: 173, type: !707)
!707 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !148)
!708 = !DILocation(line: 173, column: 24, scope: !700)
!709 = !DILocalVariable(name: "ejbuf", scope: !700, file: !232, line: 174, type: !710)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !711, line: 48, baseType: !712)
!711 = !DIFile(filename: "/usr/include/setjmp.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 1600, align: 64, elements: !731)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !711, line: 34, size: 1600, align: 64, elements: !714)
!714 = !{!715, !721, !722}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !713, file: !711, line: 40, baseType: !716, size: 512, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !717, line: 31, baseType: !718)
!717 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 512, align: 64, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 8)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !713, file: !711, line: 41, baseType: !249, size: 32, align: 32, offset: 512)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !713, file: !711, line: 42, baseType: !723, size: 1024, align: 64, offset: 576)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !724, line: 30, baseType: !725)
!724 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !724, line: 27, size: 1024, align: 64, elements: !726)
!726 = !{!727}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !725, file: !724, line: 29, baseType: !728, size: 1024, align: 64)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 1024, align: 64, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 16)
!731 = !{!732}
!732 = !DISubrange(count: 1)
!733 = !DILocation(line: 174, column: 11, scope: !700)
!734 = !DILocalVariable(name: "istobe", scope: !700, file: !232, line: 175, type: !82)
!735 = !DILocation(line: 175, column: 19, scope: !700)
!736 = !DILocation(line: 177, column: 7, scope: !737)
!737 = distinct !DILexicalBlock(scope: !700, file: !232, line: 177, column: 7)
!738 = !DILocation(line: 177, column: 7, scope: !700)
!739 = !DILocation(line: 178, column: 5, scope: !737)
!740 = !DILocation(line: 180, column: 3, scope: !700)
!741 = !DILocation(line: 182, column: 11, scope: !700)
!742 = !DILocation(line: 182, column: 22, scope: !700)
!743 = !DILocation(line: 182, column: 3, scope: !700)
!744 = !DILocation(line: 186, column: 12, scope: !745)
!745 = distinct !DILexicalBlock(scope: !700, file: !232, line: 182, column: 31)
!746 = !DILocation(line: 187, column: 5, scope: !745)
!747 = !DILocation(line: 190, column: 12, scope: !745)
!748 = !DILocation(line: 191, column: 5, scope: !745)
!749 = !DILocation(line: 193, column: 70, scope: !745)
!750 = !DILocation(line: 193, column: 81, scope: !745)
!751 = !DILocation(line: 193, column: 5, scope: !745)
!752 = !DILocation(line: 195, column: 24, scope: !753)
!753 = distinct !DILexicalBlock(scope: !700, file: !232, line: 195, column: 3)
!754 = !DILocation(line: 195, column: 16, scope: !753)
!755 = !DILocation(line: 195, column: 8, scope: !753)
!756 = !DILocation(line: 195, column: 30, scope: !757)
!757 = !DILexicalBlockFile(scope: !758, file: !232, discriminator: 1)
!758 = distinct !DILexicalBlock(scope: !753, file: !232, line: 195, column: 3)
!759 = !DILocation(line: 195, column: 3, scope: !757)
!760 = !DILocation(line: 196, column: 31, scope: !761)
!761 = distinct !DILexicalBlock(scope: !758, file: !232, line: 195, column: 64)
!762 = !DILocation(line: 196, column: 40, scope: !761)
!763 = !DILocation(line: 196, column: 5, scope: !761)
!764 = !DILocation(line: 200, column: 9, scope: !765)
!765 = distinct !DILexicalBlock(scope: !761, file: !232, line: 200, column: 9)
!766 = !DILocation(line: 200, column: 18, scope: !765)
!767 = !DILocation(line: 200, column: 23, scope: !765)
!768 = !DILocation(line: 200, column: 35, scope: !765)
!769 = !DILocation(line: 200, column: 48, scope: !765)
!770 = !DILocation(line: 200, column: 9, scope: !761)
!771 = !DILocation(line: 201, column: 15, scope: !772)
!772 = distinct !DILexicalBlock(scope: !765, file: !232, line: 200, column: 53)
!773 = !DILocation(line: 201, column: 26, scope: !772)
!774 = !DILocation(line: 201, column: 7, scope: !772)
!775 = !DILocation(line: 204, column: 16, scope: !776)
!776 = distinct !DILexicalBlock(scope: !772, file: !232, line: 201, column: 35)
!777 = !DILocation(line: 205, column: 25, scope: !776)
!778 = !DILocation(line: 205, column: 34, scope: !776)
!779 = !DILocation(line: 205, column: 16, scope: !776)
!780 = !DILocation(line: 204, column: 9, scope: !781)
!781 = !DILexicalBlockFile(scope: !776, file: !232, discriminator: 1)
!782 = !DILocation(line: 206, column: 9, scope: !776)
!783 = !DILocation(line: 208, column: 16, scope: !776)
!784 = !DILocation(line: 210, column: 25, scope: !776)
!785 = !DILocation(line: 210, column: 34, scope: !776)
!786 = !DILocation(line: 210, column: 16, scope: !776)
!787 = !DILocation(line: 208, column: 9, scope: !781)
!788 = !DILocation(line: 211, column: 9, scope: !776)
!789 = !DILocation(line: 213, column: 74, scope: !776)
!790 = !DILocation(line: 213, column: 85, scope: !776)
!791 = !DILocation(line: 213, column: 9, scope: !776)
!792 = !DILocation(line: 215, column: 5, scope: !772)
!793 = !DILocation(line: 216, column: 40, scope: !761)
!794 = !DILocation(line: 216, column: 5, scope: !761)
!795 = !DILocation(line: 216, column: 14, scope: !761)
!796 = !DILocation(line: 216, column: 19, scope: !761)
!797 = !DILocation(line: 216, column: 31, scope: !761)
!798 = !DILocation(line: 216, column: 38, scope: !761)
!799 = !DILocation(line: 217, column: 3, scope: !761)
!800 = !DILocation(line: 195, column: 49, scope: !801)
!801 = !DILexicalBlockFile(scope: !758, file: !232, discriminator: 2)
!802 = !DILocation(line: 195, column: 58, scope: !801)
!803 = !DILocation(line: 195, column: 47, scope: !801)
!804 = !DILocation(line: 195, column: 3, scope: !801)
!805 = distinct !{!805, !806}
!806 = !DILocation(line: 195, column: 3, scope: !700)
!807 = !DILocation(line: 219, column: 3, scope: !700)
!808 = !DILocation(line: 219, column: 11, scope: !809)
!809 = !DILexicalBlockFile(scope: !700, file: !232, discriminator: 1)
!810 = !DILocation(line: 219, column: 10, scope: !809)
!811 = !DILocation(line: 219, column: 3, scope: !809)
!812 = !DILocation(line: 220, column: 11, scope: !813)
!813 = distinct !DILexicalBlock(scope: !700, file: !232, line: 219, column: 39)
!814 = !DILocation(line: 220, column: 9, scope: !813)
!815 = !DILocation(line: 221, column: 10, scope: !816)
!816 = distinct !DILexicalBlock(scope: !813, file: !232, line: 221, column: 9)
!817 = !DILocation(line: 221, column: 9, scope: !813)
!818 = !DILocation(line: 222, column: 7, scope: !816)
!819 = distinct !{!819, !807}
!820 = !DILocation(line: 224, column: 31, scope: !813)
!821 = !DILocation(line: 224, column: 5, scope: !813)
!822 = !DILocation(line: 225, column: 5, scope: !813)
!823 = !DILocation(line: 225, column: 10, scope: !813)
!824 = !DILocation(line: 225, column: 22, scope: !813)
!825 = !DILocation(line: 225, column: 31, scope: !813)
!826 = !DILocation(line: 227, column: 19, scope: !813)
!827 = !DILocation(line: 227, column: 30, scope: !813)
!828 = !DILocation(line: 227, column: 17, scope: !813)
!829 = !DILocation(line: 229, column: 21, scope: !830)
!830 = distinct !DILexicalBlock(scope: !813, file: !232, line: 229, column: 9)
!831 = !DILocation(line: 229, column: 32, scope: !830)
!832 = !DILocation(line: 229, column: 39, scope: !830)
!833 = !DILocation(line: 229, column: 43, scope: !830)
!834 = !DILocation(line: 229, column: 24, scope: !830)
!835 = !DILocation(line: 229, column: 9, scope: !813)
!836 = !DILocation(line: 233, column: 16, scope: !837)
!837 = distinct !DILexicalBlock(scope: !830, file: !232, line: 229, column: 48)
!838 = !DILocation(line: 234, column: 20, scope: !837)
!839 = !DILocation(line: 235, column: 11, scope: !840)
!840 = distinct !DILexicalBlock(scope: !837, file: !232, line: 235, column: 11)
!841 = !DILocation(line: 235, column: 21, scope: !840)
!842 = !DILocation(line: 235, column: 11, scope: !837)
!843 = !DILocation(line: 236, column: 81, scope: !840)
!844 = !DILocation(line: 236, column: 92, scope: !840)
!845 = !DILocation(line: 236, column: 112, scope: !840)
!846 = !DILocation(line: 236, column: 9, scope: !840)
!847 = !DILocation(line: 238, column: 5, scope: !837)
!848 = !DILocation(line: 238, column: 16, scope: !849)
!849 = !DILexicalBlockFile(scope: !850, file: !232, discriminator: 1)
!850 = distinct !DILexicalBlock(scope: !830, file: !232, line: 238, column: 16)
!851 = !DILocation(line: 238, column: 37, scope: !849)
!852 = !DILocation(line: 238, column: 44, scope: !849)
!853 = !DILocation(line: 238, column: 48, scope: !849)
!854 = !DILocation(line: 238, column: 29, scope: !849)
!855 = !DILocation(line: 239, column: 11, scope: !856)
!856 = distinct !DILexicalBlock(scope: !857, file: !232, line: 239, column: 11)
!857 = distinct !DILexicalBlock(scope: !850, file: !232, line: 238, column: 53)
!858 = !DILocation(line: 239, column: 21, scope: !856)
!859 = !DILocation(line: 239, column: 44, scope: !856)
!860 = !DILocation(line: 240, column: 11, scope: !856)
!861 = !DILocation(line: 240, column: 31, scope: !856)
!862 = !DILocation(line: 240, column: 34, scope: !863)
!863 = !DILexicalBlockFile(scope: !856, file: !232, discriminator: 1)
!864 = !DILocation(line: 240, column: 55, scope: !863)
!865 = !DILocation(line: 239, column: 11, scope: !866)
!866 = !DILexicalBlockFile(scope: !857, file: !232, discriminator: 1)
!867 = !DILocation(line: 241, column: 25, scope: !868)
!868 = distinct !DILexicalBlock(scope: !856, file: !232, line: 240, column: 70)
!869 = !DILocation(line: 241, column: 9, scope: !868)
!870 = !DILocation(line: 242, column: 15, scope: !868)
!871 = !DILocation(line: 242, column: 13, scope: !868)
!872 = !DILocation(line: 243, column: 29, scope: !868)
!873 = !DILocation(line: 244, column: 21, scope: !868)
!874 = !DILocation(line: 245, column: 7, scope: !868)
!875 = !DILocation(line: 246, column: 18, scope: !876)
!876 = distinct !DILexicalBlock(scope: !856, file: !232, line: 245, column: 14)
!877 = !DILocation(line: 247, column: 22, scope: !876)
!878 = !DILocation(line: 248, column: 13, scope: !879)
!879 = distinct !DILexicalBlock(scope: !876, file: !232, line: 248, column: 13)
!880 = !DILocation(line: 248, column: 23, scope: !879)
!881 = !DILocation(line: 248, column: 13, scope: !876)
!882 = !DILocation(line: 249, column: 83, scope: !879)
!883 = !DILocation(line: 249, column: 94, scope: !879)
!884 = !DILocation(line: 249, column: 114, scope: !879)
!885 = !DILocation(line: 249, column: 11, scope: !879)
!886 = !DILocation(line: 252, column: 5, scope: !857)
!887 = !DILocation(line: 255, column: 20, scope: !813)
!888 = !DILocation(line: 255, column: 11, scope: !813)
!889 = !DILocation(line: 255, column: 45, scope: !813)
!890 = !DILocation(line: 255, column: 53, scope: !813)
!891 = !DILocation(line: 255, column: 67, scope: !813)
!892 = !DILocation(line: 254, column: 5, scope: !813)
!893 = !DILocation(line: 257, column: 9, scope: !894)
!894 = distinct !DILexicalBlock(scope: !813, file: !232, line: 257, column: 9)
!895 = !DILocation(line: 257, column: 14, scope: !894)
!896 = !DILocation(line: 257, column: 21, scope: !894)
!897 = !DILocation(line: 257, column: 9, scope: !813)
!898 = !DILocation(line: 258, column: 69, scope: !894)
!899 = !DILocation(line: 258, column: 60, scope: !894)
!900 = !DILocation(line: 258, column: 88, scope: !894)
!901 = !DILocation(line: 258, column: 93, scope: !894)
!902 = !DILocation(line: 258, column: 7, scope: !903)
!903 = !DILexicalBlockFile(scope: !894, file: !232, discriminator: 1)
!904 = !DILocation(line: 258, column: 7, scope: !894)
!905 = !DILocation(line: 261, column: 8, scope: !906)
!906 = distinct !DILexicalBlock(scope: !813, file: !232, line: 261, column: 8)
!907 = !DILocation(line: 261, column: 8, scope: !813)
!908 = !DILocation(line: 264, column: 7, scope: !909)
!909 = distinct !DILexicalBlock(scope: !906, file: !232, line: 261, column: 23)
!910 = !DILocation(line: 264, column: 12, scope: !909)
!911 = !DILocation(line: 264, column: 24, scope: !909)
!912 = !DILocation(line: 264, column: 31, scope: !909)
!913 = !DILocation(line: 266, column: 7, scope: !909)
!914 = !DILocation(line: 267, column: 11, scope: !915)
!915 = distinct !DILexicalBlock(scope: !909, file: !232, line: 267, column: 11)
!916 = !DILocation(line: 267, column: 11, scope: !909)
!917 = !DILocation(line: 268, column: 9, scope: !915)
!918 = !DILocation(line: 269, column: 7, scope: !909)
!919 = !DILocation(line: 272, column: 38, scope: !813)
!920 = !DILocation(line: 272, column: 29, scope: !813)
!921 = !DILocation(line: 271, column: 5, scope: !813)
!922 = !DILocation(line: 274, column: 13, scope: !813)
!923 = !DILocation(line: 274, column: 5, scope: !813)
!924 = !DILocation(line: 276, column: 12, scope: !925)
!925 = distinct !DILexicalBlock(scope: !926, file: !232, line: 276, column: 11)
!926 = distinct !DILexicalBlock(scope: !813, file: !232, line: 274, column: 26)
!927 = !DILocation(line: 276, column: 17, scope: !925)
!928 = !DILocation(line: 276, column: 11, scope: !926)
!929 = !DILocation(line: 277, column: 16, scope: !925)
!930 = !DILocation(line: 279, column: 25, scope: !925)
!931 = !DILocation(line: 279, column: 16, scope: !925)
!932 = !DILocation(line: 279, column: 62, scope: !925)
!933 = !DILocation(line: 279, column: 46, scope: !934)
!934 = !DILexicalBlockFile(scope: !925, file: !232, discriminator: 1)
!935 = !DILocation(line: 277, column: 9, scope: !934)
!936 = !DILocation(line: 277, column: 9, scope: !925)
!937 = !DILocation(line: 276, column: 17, scope: !934)
!938 = !DILocation(line: 283, column: 11, scope: !939)
!939 = distinct !DILexicalBlock(scope: !926, file: !232, line: 283, column: 11)
!940 = !DILocation(line: 283, column: 16, scope: !939)
!941 = !DILocation(line: 283, column: 23, scope: !939)
!942 = !DILocation(line: 283, column: 11, scope: !926)
!943 = !DILocation(line: 284, column: 9, scope: !939)
!944 = !DILocation(line: 283, column: 26, scope: !945)
!945 = !DILexicalBlockFile(scope: !939, file: !232, discriminator: 1)
!946 = !DILocation(line: 288, column: 11, scope: !947)
!947 = distinct !DILexicalBlock(scope: !926, file: !232, line: 288, column: 11)
!948 = !DILocation(line: 288, column: 16, scope: !947)
!949 = !DILocation(line: 288, column: 11, scope: !926)
!950 = !DILocation(line: 289, column: 18, scope: !947)
!951 = !DILocation(line: 289, column: 9, scope: !947)
!952 = !DILocation(line: 291, column: 28, scope: !947)
!953 = !DILocation(line: 291, column: 9, scope: !947)
!954 = !DILocation(line: 292, column: 7, scope: !926)
!955 = !DILocation(line: 294, column: 23, scope: !926)
!956 = !DILocation(line: 294, column: 7, scope: !926)
!957 = !DILocation(line: 295, column: 7, scope: !926)
!958 = !DILocation(line: 297, column: 72, scope: !926)
!959 = !DILocation(line: 297, column: 83, scope: !926)
!960 = !DILocation(line: 297, column: 7, scope: !926)
!961 = !DILocation(line: 299, column: 13, scope: !813)
!962 = !DILocation(line: 299, column: 21, scope: !813)
!963 = !DILocation(line: 299, column: 5, scope: !964)
!964 = !DILexicalBlockFile(scope: !813, file: !232, discriminator: 1)
!965 = !DILocation(line: 300, column: 13, scope: !813)
!966 = !DILocation(line: 300, column: 21, scope: !813)
!967 = !DILocation(line: 300, column: 5, scope: !964)
!968 = !DILocation(line: 302, column: 5, scope: !813)
!969 = !DILocation(line: 219, column: 3, scope: !970)
!970 = !DILexicalBlockFile(scope: !700, file: !232, discriminator: 2)
!971 = !DILocation(line: 305, column: 13, scope: !972)
!972 = distinct !DILexicalBlock(scope: !700, file: !232, line: 305, column: 7)
!973 = !DILocation(line: 305, column: 7, scope: !972)
!974 = !DILocation(line: 305, column: 7, scope: !700)
!975 = !DILocation(line: 306, column: 85, scope: !972)
!976 = !DILocation(line: 306, column: 5, scope: !972)
!977 = !DILocation(line: 308, column: 1, scope: !700)
!978 = distinct !DISubprogram(name: "breakses_ok", scope: !232, file: !232, line: 597, type: !979, isLocal: false, isDefinition: true, scopeLine: 598, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !471)
!979 = !DISubroutineType(types: !980)
!980 = !{!226, !255, !981}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !983, line: 55, size: 192, align: 64, elements: !984)
!983 = !DIFile(filename: "../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!984 = !{!985, !988, !989}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !982, file: !983, line: 56, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !987, line: 216, baseType: !448)
!987 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!988 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !982, file: !983, line: 56, baseType: !986, size: 64, align: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !982, file: !983, line: 57, baseType: !433, size: 64, align: 64, offset: 128)
!990 = !DILocalVariable(name: "pkg", arg: 1, scope: !978, file: !232, line: 597, type: !255)
!991 = !DILocation(line: 597, column: 29, scope: !978)
!992 = !DILocalVariable(name: "aemsgs", arg: 2, scope: !978, file: !232, line: 597, type: !981)
!993 = !DILocation(line: 597, column: 49, scope: !978)
!994 = !DILocalVariable(name: "dep", scope: !978, file: !232, line: 599, type: !276)
!995 = !DILocation(line: 599, column: 22, scope: !978)
!996 = !DILocalVariable(name: "virtbroken", scope: !978, file: !232, line: 600, type: !272)
!997 = !DILocation(line: 600, column: 20, scope: !978)
!998 = !DILocalVariable(name: "ok", scope: !978, file: !232, line: 601, type: !226)
!999 = !DILocation(line: 601, column: 18, scope: !978)
!1000 = !DILocation(line: 603, column: 3, scope: !978)
!1001 = !DILocation(line: 605, column: 23, scope: !978)
!1002 = !DILocation(line: 605, column: 36, scope: !978)
!1003 = !DILocation(line: 605, column: 41, scope: !978)
!1004 = !DILocation(line: 605, column: 46, scope: !978)
!1005 = !DILocation(line: 605, column: 3, scope: !978)
!1006 = !DILocation(line: 607, column: 13, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !978, file: !232, line: 607, column: 3)
!1008 = !DILocation(line: 607, column: 18, scope: !1007)
!1009 = !DILocation(line: 607, column: 28, scope: !1007)
!1010 = !DILocation(line: 607, column: 11, scope: !1007)
!1011 = !DILocation(line: 607, column: 8, scope: !1007)
!1012 = !DILocation(line: 607, column: 37, scope: !1013)
!1013 = !DILexicalBlockFile(scope: !1014, file: !232, discriminator: 1)
!1014 = distinct !DILexicalBlock(scope: !1007, file: !232, line: 607, column: 3)
!1015 = !DILocation(line: 607, column: 3, scope: !1013)
!1016 = !DILocation(line: 608, column: 9, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !232, line: 608, column: 9)
!1018 = distinct !DILexicalBlock(scope: !1014, file: !232, line: 607, column: 58)
!1019 = !DILocation(line: 608, column: 14, scope: !1017)
!1020 = !DILocation(line: 608, column: 19, scope: !1017)
!1021 = !DILocation(line: 608, column: 9, scope: !1018)
!1022 = !DILocation(line: 608, column: 36, scope: !1023)
!1023 = !DILexicalBlockFile(scope: !1017, file: !232, discriminator: 1)
!1024 = !DILocation(line: 609, column: 18, scope: !1018)
!1025 = !DILocation(line: 609, column: 23, scope: !1018)
!1026 = !DILocation(line: 609, column: 16, scope: !1018)
!1027 = !DILocation(line: 610, column: 60, scope: !1018)
!1028 = !DILocation(line: 610, column: 72, scope: !1018)
!1029 = !DILocation(line: 610, column: 76, scope: !1018)
!1030 = !DILocation(line: 610, column: 5, scope: !1018)
!1031 = !DILocation(line: 611, column: 25, scope: !1018)
!1032 = !DILocation(line: 611, column: 38, scope: !1018)
!1033 = !DILocation(line: 611, column: 43, scope: !1018)
!1034 = !DILocation(line: 611, column: 55, scope: !1018)
!1035 = !DILocation(line: 611, column: 59, scope: !1018)
!1036 = !DILocation(line: 611, column: 5, scope: !1018)
!1037 = !DILocation(line: 612, column: 3, scope: !1018)
!1038 = !DILocation(line: 607, column: 47, scope: !1039)
!1039 = !DILexicalBlockFile(scope: !1014, file: !232, discriminator: 2)
!1040 = !DILocation(line: 607, column: 52, scope: !1039)
!1041 = !DILocation(line: 607, column: 45, scope: !1039)
!1042 = !DILocation(line: 607, column: 3, scope: !1039)
!1043 = distinct !{!1043, !1044}
!1044 = !DILocation(line: 607, column: 3, scope: !978)
!1045 = !DILocation(line: 613, column: 10, scope: !978)
!1046 = !DILocation(line: 613, column: 3, scope: !978)
!1047 = distinct !DISubprogram(name: "breaks_check_target", scope: !232, file: !232, line: 584, type: !1048, isLocal: true, isDefinition: true, scopeLine: 587, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !471)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{null, !981, !1050, !255, !259, !272}
