; ModuleID = './[inter]src--help.o.i'
source_filename = "./[inter]src--help.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pkg_list = type { %struct.pkg_list*, %struct.pkginfo* }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.1, i32 }
%struct.anon.1 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }
%struct.pkgbin = type { %struct.dependency*, i8, i32, %struct.dpkg_arch*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.dpkg_version, %struct.conffile*, %struct.arbitraryfield* }
%struct.conffile = type { %struct.conffile*, i8*, i8*, i8 }
%struct.arbitraryfield = type { %struct.arbitraryfield*, i8*, i8* }
%struct.perpackagestate = type { i32, i32, i8, i32, i32, %struct.pkg_list* }

!112 = !DIEnumerator(name: "dbg_triggers", value: 4096)
!113 = !DIEnumerator(name: "dbg_triggersdetail", value: 8192)
!114 = !DIEnumerator(name: "dbg_triggersstupid", value: 16384)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_name_arch_when", file: !4, line: 396, size: 32, align: 32, elements: !116)
!116 = !{!117, !118, !119, !120}
!117 = !DIEnumerator(name: "pnaw_never", value: 0)
!118 = !DIEnumerator(name: "pnaw_nonambig", value: 1)
!119 = !DIEnumerator(name: "pnaw_foreign", value: 2)
!120 = !DIEnumerator(name: "pnaw_always", value: 3)
!121 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "force_flags", file: !122, line: 28, size: 32, align: 32, elements: !123)
!122 = !DIFile(filename: "force.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!123 = !{!124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151}
!124 = !DIEnumerator(name: "FORCE_ARCHITECTURE", value: 1)
!125 = !DIEnumerator(name: "FORCE_BAD_PATH", value: 2)
!126 = !DIEnumerator(name: "FORCE_BAD_VERIFY", value: 4)
!127 = !DIEnumerator(name: "FORCE_BAD_VERSION", value: 8)
!128 = !DIEnumerator(name: "FORCE_BREAKS", value: 16)
!129 = !DIEnumerator(name: "FORCE_CONFF_ASK", value: 32)
!130 = !DIEnumerator(name: "FORCE_CONFF_DEF", value: 64)
!131 = !DIEnumerator(name: "FORCE_CONFF_MISS", value: 128)
!132 = !DIEnumerator(name: "FORCE_CONFF_NEW", value: 256)
!133 = !DIEnumerator(name: "FORCE_CONFF_OLD", value: 512)
!134 = !DIEnumerator(name: "FORCE_CONFIGURE_ANY", value: 1024)
!135 = !DIEnumerator(name: "FORCE_CONFLICTS", value: 2048)
!136 = !DIEnumerator(name: "FORCE_DEPENDS", value: 4096)
!137 = !DIEnumerator(name: "FORCE_DEPENDS_VERSION", value: 8192)
!138 = !DIEnumerator(name: "FORCE_DOWNGRADE", value: 16384)
!139 = !DIEnumerator(name: "FORCE_HOLD", value: 32768)
!140 = !DIEnumerator(name: "FORCE_NON_ROOT", value: 65536)
!141 = !DIEnumerator(name: "FORCE_OVERWRITE", value: 131072)
!142 = !DIEnumerator(name: "FORCE_OVERWRITE_DIR", value: 262144)
!143 = !DIEnumerator(name: "FORCE_OVERWRITE_DIVERTED", value: 524288)
!144 = !DIEnumerator(name: "FORCE_REMOVE_ESSENTIAL", value: 1048576)
!145 = !DIEnumerator(name: "FORCE_REMOVE_REINSTREQ", value: 2097152)
!146 = !DIEnumerator(name: "FORCE_SCRIPT_CHROOTLESS", value: 4194304)
!147 = !DIEnumerator(name: "FORCE_UNSAFE_IO", value: 8388608)
!148 = !DIEnumerator(name: "FORCE_STATOVERRIDE_ADD", value: 16777216)
!149 = !DIEnumerator(name: "FORCE_STATOVERRIDE_DEL", value: 33554432)
!150 = !DIEnumerator(name: "FORCE_SECURITY_MAC", value: 67108864)
!151 = !DIEnumerator(name: "FORCE_ALL", value: -1)
!152 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "versiondisplayepochwhen", file: !4, line: 388, size: 32, align: 32, elements: !153)
!153 = !{!154, !155, !156}
!154 = !DIEnumerator(name: "vdew_never", value: 0)
!155 = !DIEnumerator(name: "vdew_nonambig", value: 1)
!156 = !DIEnumerator(name: "vdew_always", value: 2)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "which_pkgbin", file: !74, line: 340, size: 32, align: 32, elements: !158)
!158 = !{!159, !160, !161}
!159 = !DIEnumerator(name: "wpb_installed", value: 0)
!160 = !DIEnumerator(name: "wpb_available", value: 1)
!161 = !DIEnumerator(name: "wpb_by_istobe", value: 2)
!162 = !{!163, !166}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !164, line: 216, baseType: !165)
!164 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!165 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!167 = !{!168, !177}
!168 = distinct !DIGlobalVariable(name: "statusstrings", scope: !0, file: !169, line: 41, type: !170, isLocal: false, isDefinition: true, variable: [8 x i8*]* @statusstrings)
!169 = !DIFile(filename: "help.c", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 512, align: 64, elements: !175)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!175 = !{!176}
!176 = !DISubrange(count: 8)
!177 = distinct !DIGlobalVariable(name: "prog_list", scope: !178, file: !169, line: 115, type: !182, isLocal: true, isDefinition: true, variable: [7 x i8*]* @checkpath.prog_list)
!178 = distinct !DISubprogram(name: "checkpath", scope: !169, file: !169, line: 114, type: !179, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !181)
!179 = !DISubroutineType(types: !180)
!180 = !{null}
!181 = !{}
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 448, align: 64, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 7)
!185 = !{i32 2, !"Dwarf Version", i32 4}
!186 = !{i32 2, !"Debug Info Version", i32 3}
!187 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!188 = distinct !DISubprogram(name: "namenodetouse", scope: !169, file: !169, line: 53, type: !189, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !181)
!189 = !DISubroutineType(types: !190)
!190 = !{!191, !191, !203, !391}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode", file: !87, line: 90, size: 640, align: 64, elements: !193)
!193 = !{!194, !195, !196, !350, !358, !375, !378, !379, !380, !381}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !87, line: 91, baseType: !191, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !192, file: !87, line: 92, baseType: !172, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "packages", scope: !192, file: !87, line: 93, baseType: !197, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_list", file: !199, line: 34, size: 128, align: 64, elements: !200)
!199 = !DIFile(filename: "../lib/dpkg/pkg-list.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !198, file: !199, line: 35, baseType: !197, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !198, file: !199, line: 36, baseType: !203, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !205)
!205 = !{!206, !255, !256, !257, !258, !259, !260, !261, !262, !263, !293, !294, !304, !313, !329, !330, !336, !342, !348, !349}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !204, file: !4, line: 196, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !209)
!209 = !{!210, !211, !212, !213, !253}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !4, line: 243, baseType: !207, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !208, file: !4, line: 244, baseType: !172, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !208, file: !4, line: 245, baseType: !204, size: 3072, align: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !208, file: !4, line: 249, baseType: !214, size: 128, align: 64, offset: 3200)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !4, line: 246, size: 128, align: 64, elements: !215)
!215 = !{!216, !252}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !214, file: !4, line: 247, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !219)
!219 = !{!220, !228, !229, !230, !231, !232, !241, !248, !249, !251}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !218, file: !4, line: 64, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !223)
!223 = !{!224, !225, !226, !227}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !222, file: !4, line: 57, baseType: !203, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !4, line: 58, baseType: !221, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !222, file: !4, line: 59, baseType: !217, size: 64, align: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !222, file: !4, line: 60, baseType: !3, size: 32, align: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !218, file: !4, line: 65, baseType: !207, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !218, file: !4, line: 66, baseType: !217, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !218, file: !4, line: 66, baseType: !217, size: 64, align: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !218, file: !4, line: 66, baseType: !217, size: 64, align: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !218, file: !4, line: 67, baseType: !233, size: 64, align: 64, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !16, line: 48, size: 192, align: 64, elements: !236)
!236 = !{!237, !239, !240}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !235, file: !16, line: 49, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !235, file: !16, line: 50, baseType: !172, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !235, file: !16, line: 51, baseType: !15, size: 32, align: 32, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !218, file: !4, line: 68, baseType: !242, size: 192, align: 64, offset: 384)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !27, line: 42, size: 192, align: 64, elements: !243)
!243 = !{!244, !246, !247}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !242, file: !27, line: 44, baseType: !245, size: 32, align: 32)
!245 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !242, file: !27, line: 46, baseType: !172, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !242, file: !27, line: 48, baseType: !172, size: 64, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !218, file: !4, line: 69, baseType: !26, size: 32, align: 32, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !218, file: !4, line: 70, baseType: !250, size: 8, align: 8, offset: 608)
!250 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !218, file: !4, line: 71, baseType: !250, size: 8, align: 8, offset: 616)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !214, file: !4, line: 248, baseType: !217, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !208, file: !4, line: 250, baseType: !254, size: 32, align: 32, offset: 3328)
!254 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !204, file: !4, line: 197, baseType: !203, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !204, file: !4, line: 199, baseType: !35, size: 32, align: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !204, file: !4, line: 201, baseType: !43, size: 32, align: 32, offset: 160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !204, file: !4, line: 202, baseType: !47, size: 32, align: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !204, file: !4, line: 203, baseType: !57, size: 32, align: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !204, file: !4, line: 204, baseType: !172, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !204, file: !4, line: 205, baseType: !172, size: 64, align: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !204, file: !4, line: 206, baseType: !242, size: 192, align: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !204, file: !4, line: 207, baseType: !264, size: 960, align: 64, offset: 576)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !286}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !264, file: !4, line: 108, baseType: !221, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !264, file: !4, line: 110, baseType: !250, size: 8, align: 8, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !264, file: !4, line: 111, baseType: !67, size: 32, align: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !264, file: !4, line: 112, baseType: !233, size: 64, align: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !264, file: !4, line: 115, baseType: !172, size: 64, align: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !264, file: !4, line: 116, baseType: !172, size: 64, align: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !264, file: !4, line: 117, baseType: !172, size: 64, align: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !264, file: !4, line: 118, baseType: !172, size: 64, align: 64, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !264, file: !4, line: 119, baseType: !172, size: 64, align: 64, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !264, file: !4, line: 120, baseType: !172, size: 64, align: 64, offset: 512)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !264, file: !4, line: 121, baseType: !172, size: 64, align: 64, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !264, file: !4, line: 122, baseType: !242, size: 192, align: 64, offset: 640)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !264, file: !4, line: 123, baseType: !279, size: 64, align: 64, offset: 832)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !281)
!281 = !{!282, !283, !284, !285}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !280, file: !4, line: 81, baseType: !279, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !280, file: !4, line: 82, baseType: !172, size: 64, align: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !280, file: !4, line: 83, baseType: !172, size: 64, align: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !280, file: !4, line: 84, baseType: !250, size: 8, align: 8, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !264, file: !4, line: 124, baseType: !287, size: 64, align: 64, offset: 896)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !289)
!289 = !{!290, !291, !292}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !288, file: !4, line: 75, baseType: !287, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !288, file: !4, line: 76, baseType: !172, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !288, file: !4, line: 77, baseType: !172, size: 64, align: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !204, file: !4, line: 208, baseType: !264, size: 960, align: 64, offset: 1536)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !204, file: !4, line: 209, baseType: !295, size: 64, align: 64, offset: 2496)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !74, line: 53, size: 256, align: 64, elements: !297)
!297 = !{!298, !299, !300, !301, !302, !303}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "istobe", scope: !296, file: !74, line: 54, baseType: !73, size: 32, align: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !296, file: !74, line: 57, baseType: !81, size: 32, align: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "enqueued", scope: !296, file: !74, line: 59, baseType: !250, size: 8, align: 8, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "replacingfilesandsaid", scope: !296, file: !74, line: 61, baseType: !254, size: 32, align: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "cmdline_seen", scope: !296, file: !74, line: 62, baseType: !254, size: 32, align: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "trigprocdeferred", scope: !296, file: !74, line: 65, baseType: !197, size: 64, align: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !204, file: !4, line: 211, baseType: !305, size: 64, align: 64, offset: 2560)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !307)
!307 = !{!308, !309, !310, !311, !312}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !306, file: !4, line: 88, baseType: !305, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !4, line: 89, baseType: !172, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !306, file: !4, line: 90, baseType: !172, size: 64, align: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !306, file: !4, line: 91, baseType: !172, size: 64, align: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !306, file: !4, line: 92, baseType: !172, size: 64, align: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !204, file: !4, line: 216, baseType: !314, size: 128, align: 64, offset: 2624)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !204, file: !4, line: 213, size: 128, align: 64, elements: !315)
!315 = !{!316, !328}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !314, file: !4, line: 215, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !319)
!319 = !{!320, !321, !322, !323}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !318, file: !4, line: 143, baseType: !203, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !318, file: !4, line: 143, baseType: !203, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !318, file: !4, line: 144, baseType: !317, size: 64, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !318, file: !4, line: 147, baseType: !324, size: 128, align: 64, offset: 192)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !318, file: !4, line: 145, size: 128, align: 64, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !4, line: 146, baseType: !317, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !324, file: !4, line: 146, baseType: !317, size: 64, align: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !314, file: !4, line: 215, baseType: !317, size: 64, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !204, file: !4, line: 219, baseType: !317, size: 64, align: 64, offset: 2752)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !204, file: !4, line: 220, baseType: !331, size: 64, align: 64, offset: 2816)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !4, line: 135, baseType: !331, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !332, file: !4, line: 136, baseType: !172, size: 64, align: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !204, file: !4, line: 231, baseType: !337, size: 64, align: 64, offset: 2880)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !87, line: 122, size: 128, align: 64, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !338, file: !87, line: 123, baseType: !337, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "namenode", scope: !338, file: !87, line: 124, baseType: !191, size: 64, align: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !204, file: !4, line: 232, baseType: !343, size: 64, align: 64, offset: 2944)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !344, line: 86, baseType: !345)
!344 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !346, line: 131, baseType: !347)
!346 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!347 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !204, file: !4, line: 233, baseType: !250, size: 8, align: 8, offset: 3008)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !204, file: !4, line: 236, baseType: !250, size: 8, align: 8, offset: 3016)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "divert", scope: !192, file: !87, line: 94, baseType: !351, size: 64, align: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_diversion", file: !87, line: 151, size: 256, align: 64, elements: !353)
!353 = !{!354, !355, !356, !357}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "useinstead", scope: !352, file: !87, line: 152, baseType: !191, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "camefrom", scope: !352, file: !87, line: 153, baseType: !191, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pkgset", scope: !352, file: !87, line: 154, baseType: !207, size: 64, align: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !352, file: !87, line: 157, baseType: !351, size: 64, align: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "statoverride", scope: !192, file: !87, line: 101, baseType: !359, size: 64, align: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !361, line: 40, size: 256, align: 64, elements: !362)
!361 = !DIFile(filename: "../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!362 = !{!363, !366, !369, !372, !374}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !360, file: !361, line: 41, baseType: !364, size: 32, align: 32)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !344, line: 80, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !346, line: 125, baseType: !245)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !360, file: !361, line: 42, baseType: !367, size: 32, align: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !344, line: 65, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !346, line: 126, baseType: !245)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !360, file: !361, line: 43, baseType: !370, size: 32, align: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !344, line: 70, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !346, line: 129, baseType: !245)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !360, file: !361, line: 47, baseType: !373, size: 64, align: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !360, file: !361, line: 48, baseType: !373, size: 64, align: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "trig_interested", scope: !192, file: !87, line: 103, baseType: !376, size: 64, align: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "trigfileint", file: !87, line: 103, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !192, file: !87, line: 111, baseType: !86, size: 32, align: 32, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "oldhash", scope: !192, file: !87, line: 114, baseType: !172, size: 64, align: 64, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "newhash", scope: !192, file: !87, line: 117, baseType: !172, size: 64, align: 64, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "file_ondisk_id", scope: !192, file: !87, line: 119, baseType: !382, size: 64, align: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_ondisk_id", file: !87, line: 85, size: 128, align: 64, elements: !384)
!384 = !{!385, !388}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "id_dev", scope: !383, file: !87, line: 86, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !344, line: 60, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !346, line: 124, baseType: !165)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "id_ino", scope: !383, file: !87, line: 87, baseType: !389, size: 64, align: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !344, line: 48, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !346, line: 127, baseType: !165)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!392 = !DILocalVariable(name: "namenode", arg: 1, scope: !188, file: !169, line: 53, type: !191)
!393 = !DIExpression()
!394 = !DILocation(line: 53, column: 37, scope: !188)
!395 = !DILocalVariable(name: "pkg", arg: 2, scope: !188, file: !169, line: 53, type: !203)
!396 = !DILocation(line: 53, column: 63, scope: !188)
!397 = !DILocalVariable(name: "pkgbin", arg: 3, scope: !188, file: !169, line: 54, type: !391)
!398 = !DILocation(line: 54, column: 30, scope: !188)
!399 = !DILocalVariable(name: "fnn", scope: !188, file: !169, line: 56, type: !191)
!400 = !DILocation(line: 56, column: 25, scope: !188)
!401 = !DILocation(line: 58, column: 8, scope: !402)
!402 = distinct !DILexicalBlock(scope: !188, file: !169, line: 58, column: 7)
!403 = !DILocation(line: 58, column: 18, scope: !402)
!404 = !DILocation(line: 58, column: 7, scope: !188)
!405 = !DILocation(line: 59, column: 12, scope: !402)
!406 = !DILocation(line: 59, column: 5, scope: !402)
!407 = !DILocation(line: 62, column: 9, scope: !188)
!408 = !DILocation(line: 62, column: 19, scope: !188)
!409 = !DILocation(line: 62, column: 37, scope: !188)
!410 = !DILocation(line: 62, column: 42, scope: !188)
!411 = !DILocation(line: 62, column: 25, scope: !188)
!412 = !DILocation(line: 61, column: 3, scope: !188)
!413 = !DILocation(line: 64, column: 10, scope: !188)
!414 = !DILocation(line: 64, column: 20, scope: !188)
!415 = !DILocation(line: 64, column: 28, scope: !188)
!416 = !DILocation(line: 64, column: 39, scope: !188)
!417 = !DILocation(line: 64, column: 42, scope: !418)
!418 = !DILexicalBlockFile(scope: !188, file: !169, discriminator: 1)
!419 = !DILocation(line: 64, column: 52, scope: !418)
!420 = !DILocation(line: 64, column: 60, scope: !418)
!421 = !DILocation(line: 64, column: 70, scope: !418)
!422 = !DILocation(line: 64, column: 75, scope: !418)
!423 = !DILocation(line: 64, column: 67, scope: !418)
!424 = !DILocation(line: 64, column: 9, scope: !418)
!425 = !DILocation(line: 65, column: 11, scope: !188)
!426 = !DILocation(line: 65, column: 21, scope: !188)
!427 = !DILocation(line: 65, column: 29, scope: !188)
!428 = !DILocation(line: 64, column: 9, scope: !429)
!429 = !DILexicalBlockFile(scope: !188, file: !169, discriminator: 2)
!430 = !DILocation(line: 65, column: 42, scope: !418)
!431 = !DILocation(line: 64, column: 9, scope: !432)
!432 = !DILexicalBlockFile(scope: !188, file: !169, discriminator: 3)
!433 = !DILocation(line: 64, column: 9, scope: !434)
!434 = !DILexicalBlockFile(scope: !188, file: !169, discriminator: 4)
!435 = !DILocation(line: 64, column: 7, scope: !434)
!436 = !DILocation(line: 69, column: 9, scope: !188)
!437 = !DILocation(line: 69, column: 19, scope: !188)
!438 = !DILocation(line: 69, column: 27, scope: !188)
!439 = !DILocation(line: 69, column: 40, scope: !418)
!440 = !DILocation(line: 69, column: 50, scope: !418)
!441 = !DILocation(line: 69, column: 58, scope: !418)
!442 = !DILocation(line: 69, column: 70, scope: !418)
!443 = !DILocation(line: 69, column: 9, scope: !418)
!444 = !DILocation(line: 69, column: 9, scope: !429)
!445 = !DILocation(line: 69, column: 9, scope: !432)
!446 = !DILocation(line: 70, column: 9, scope: !188)
!447 = !DILocation(line: 70, column: 19, scope: !188)
!448 = !DILocation(line: 70, column: 27, scope: !188)
!449 = !DILocation(line: 70, column: 38, scope: !418)
!450 = !DILocation(line: 70, column: 48, scope: !418)
!451 = !DILocation(line: 70, column: 56, scope: !418)
!452 = !DILocation(line: 70, column: 66, scope: !418)
!453 = !DILocation(line: 70, column: 9, scope: !418)
!454 = !DILocation(line: 70, column: 9, scope: !429)
!455 = !DILocation(line: 70, column: 9, scope: !432)
!456 = !DILocation(line: 71, column: 9, scope: !188)
!457 = !DILocation(line: 71, column: 19, scope: !188)
!458 = !DILocation(line: 71, column: 27, scope: !188)
!459 = !DILocation(line: 71, column: 36, scope: !418)
!460 = !DILocation(line: 71, column: 46, scope: !418)
!461 = !DILocation(line: 71, column: 54, scope: !418)
!462 = !DILocation(line: 71, column: 62, scope: !418)
!463 = !DILocation(line: 71, column: 9, scope: !418)
!464 = !DILocation(line: 71, column: 9, scope: !429)
!465 = !DILocation(line: 71, column: 9, scope: !432)
!466 = !DILocation(line: 72, column: 9, scope: !188)
!467 = !DILocation(line: 72, column: 14, scope: !188)
!468 = !DILocation(line: 67, column: 3, scope: !188)
!469 = !DILocation(line: 74, column: 10, scope: !188)
!470 = !DILocation(line: 74, column: 3, scope: !188)
!471 = !DILocation(line: 75, column: 1, scope: !188)
!472 = distinct !DISubprogram(name: "find_command", scope: !169, file: !169, line: 78, type: !473, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !181)
!473 = !DISubroutineType(types: !474)
!474 = !{!250, !172}
!475 = !DILocalVariable(name: "prog", arg: 1, scope: !472, file: !169, line: 78, type: !172)
!476 = !DILocation(line: 78, column: 26, scope: !472)
!477 = !DILocalVariable(name: "filename", scope: !472, file: !169, line: 80, type: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !479, line: 55, size: 192, align: 64, elements: !480)
!479 = !DIFile(filename: "../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!480 = !{!481, !482, !483}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !478, file: !479, line: 56, baseType: !163, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !478, file: !479, line: 56, baseType: !163, size: 64, align: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !478, file: !479, line: 57, baseType: !373, size: 64, align: 64, offset: 128)
!484 = !DILocation(line: 80, column: 17, scope: !472)
!485 = !DILocalVariable(name: "stab", scope: !472, file: !169, line: 81, type: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !487, line: 46, size: 1152, align: 64, elements: !488)
!487 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!488 = !{!489, !490, !491, !493, !494, !495, !496, !497, !498, !499, !501, !503, !511, !512, !513}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !486, file: !487, line: 48, baseType: !387, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !486, file: !487, line: 53, baseType: !390, size: 64, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !486, file: !487, line: 61, baseType: !492, size: 64, align: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !346, line: 130, baseType: !165)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !486, file: !487, line: 62, baseType: !371, size: 32, align: 32, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !486, file: !487, line: 64, baseType: !365, size: 32, align: 32, offset: 224)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !486, file: !487, line: 65, baseType: !368, size: 32, align: 32, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !486, file: !487, line: 67, baseType: !254, size: 32, align: 32, offset: 288)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !486, file: !487, line: 69, baseType: !387, size: 64, align: 64, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !486, file: !487, line: 74, baseType: !345, size: 64, align: 64, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !486, file: !487, line: 78, baseType: !500, size: 64, align: 64, offset: 448)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !346, line: 153, baseType: !347)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !486, file: !487, line: 80, baseType: !502, size: 64, align: 64, offset: 512)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !346, line: 158, baseType: !347)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !486, file: !487, line: 91, baseType: !504, size: 128, align: 64, offset: 576)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !505, line: 120, size: 128, align: 64, elements: !506)
!505 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!506 = !{!507, !509}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !504, file: !505, line: 122, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !346, line: 139, baseType: !347)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !504, file: !505, line: 123, baseType: !510, size: 64, align: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !346, line: 175, baseType: !347)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !486, file: !487, line: 92, baseType: !504, size: 128, align: 64, offset: 704)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !486, file: !487, line: 93, baseType: !504, size: 128, align: 64, offset: 832)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !486, file: !487, line: 106, baseType: !514, size: 192, align: 64, offset: 960)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 192, align: 64, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 3)
!517 = !DILocation(line: 81, column: 15, scope: !472)
!518 = !DILocalVariable(name: "path_list", scope: !472, file: !169, line: 82, type: !172)
!519 = !DILocation(line: 82, column: 15, scope: !472)
!520 = !DILocalVariable(name: "path", scope: !472, file: !169, line: 83, type: !172)
!521 = !DILocation(line: 83, column: 15, scope: !472)
!522 = !DILocalVariable(name: "path_end", scope: !472, file: !169, line: 83, type: !172)
!523 = !DILocation(line: 83, column: 22, scope: !472)
!524 = !DILocalVariable(name: "path_len", scope: !472, file: !169, line: 84, type: !163)
!525 = !DILocation(line: 84, column: 10, scope: !472)
!526 = !DILocation(line: 86, column: 15, scope: !472)
!527 = !DILocation(line: 86, column: 13, scope: !472)
!528 = !DILocation(line: 87, column: 8, scope: !529)
!529 = distinct !DILexicalBlock(scope: !472, file: !169, line: 87, column: 7)
!530 = !DILocation(line: 87, column: 7, scope: !472)
!531 = !DILocation(line: 88, column: 12, scope: !529)
!532 = !DILocation(line: 88, column: 5, scope: !533)
!533 = !DILexicalBlockFile(scope: !529, file: !169, discriminator: 1)
!534 = !DILocation(line: 88, column: 5, scope: !529)
!535 = !DILocation(line: 90, column: 15, scope: !536)
!536 = distinct !DILexicalBlock(scope: !472, file: !169, line: 90, column: 3)
!537 = !DILocation(line: 90, column: 13, scope: !536)
!538 = !DILocation(line: 90, column: 8, scope: !536)
!539 = !DILocation(line: 90, column: 26, scope: !540)
!540 = !DILexicalBlockFile(scope: !541, file: !169, discriminator: 1)
!541 = distinct !DILexicalBlock(scope: !536, file: !169, line: 90, column: 3)
!542 = !DILocation(line: 90, column: 3, scope: !540)
!543 = !DILocation(line: 91, column: 26, scope: !544)
!544 = distinct !DILexicalBlock(scope: !541, file: !169, line: 90, column: 71)
!545 = !DILocation(line: 91, column: 16, scope: !544)
!546 = !DILocation(line: 91, column: 14, scope: !544)
!547 = !DILocation(line: 92, column: 25, scope: !544)
!548 = !DILocation(line: 92, column: 36, scope: !544)
!549 = !DILocation(line: 92, column: 34, scope: !544)
!550 = !DILocation(line: 92, column: 14, scope: !544)
!551 = !DILocation(line: 94, column: 5, scope: !544)
!552 = !DILocation(line: 95, column: 31, scope: !544)
!553 = !DILocation(line: 95, column: 37, scope: !544)
!554 = !DILocation(line: 95, column: 5, scope: !544)
!555 = !DILocation(line: 96, column: 9, scope: !556)
!556 = distinct !DILexicalBlock(scope: !544, file: !169, line: 96, column: 9)
!557 = !DILocation(line: 96, column: 9, scope: !544)
!558 = !DILocation(line: 97, column: 7, scope: !556)
!559 = !DILocation(line: 98, column: 31, scope: !544)
!560 = !DILocation(line: 98, column: 44, scope: !544)
!561 = !DILocation(line: 98, column: 37, scope: !544)
!562 = !DILocation(line: 98, column: 5, scope: !563)
!563 = !DILexicalBlockFile(scope: !544, file: !169, discriminator: 1)
!564 = !DILocation(line: 99, column: 5, scope: !544)
!565 = !DILocation(line: 101, column: 23, scope: !566)
!566 = distinct !DILexicalBlock(scope: !544, file: !169, line: 101, column: 9)
!567 = !DILocation(line: 101, column: 9, scope: !566)
!568 = !DILocation(line: 101, column: 35, scope: !566)
!569 = !DILocation(line: 101, column: 40, scope: !566)
!570 = !DILocation(line: 101, column: 49, scope: !571)
!571 = !DILexicalBlockFile(scope: !566, file: !169, discriminator: 1)
!572 = !DILocation(line: 101, column: 57, scope: !571)
!573 = !DILocation(line: 101, column: 9, scope: !571)
!574 = !DILocation(line: 102, column: 7, scope: !575)
!575 = distinct !DILexicalBlock(scope: !566, file: !169, line: 101, column: 66)
!576 = !DILocation(line: 103, column: 7, scope: !575)
!577 = !DILocation(line: 105, column: 3, scope: !544)
!578 = !DILocation(line: 90, column: 40, scope: !579)
