; ModuleID = './[inter]src--main.o.i'
source_filename = "./[inter]src--main.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pkg_list = type { %struct.pkg_list*, %struct.pkginfo* }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.1, i32 }
%struct.anon.1 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }
%struct.pkgbin = type { %struct.dependency*, i8, i32, %struct.dpkg_arch*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.dpkg_version, %struct.conffile*, %struct.arbitraryfield* }
%struct.conffile = type { %struct.conffile*, i8*, i8*, i8 }
%struct.arbitraryfield = type { %struct.arbitraryfield*, i8*, i8* }
%struct.perpackagestate = type { i32, i32, i8, i32, i32, %struct.pkg_list* }

!158 = !DIEnumerator(name: "act_printforeignarches", value: 20)
!159 = !DIEnumerator(name: "act_assertpredep", value: 21)
!160 = !DIEnumerator(name: "act_assertepoch", value: 22)
!161 = !DIEnumerator(name: "act_assertlongfilenames", value: 23)
!162 = !DIEnumerator(name: "act_assertmulticonrep", value: 24)
!163 = !DIEnumerator(name: "act_assertmultiarch", value: 25)
!164 = !DIEnumerator(name: "act_assertverprovides", value: 26)
!165 = !DIEnumerator(name: "act_validate_pkgname", value: 27)
!166 = !DIEnumerator(name: "act_validate_trigname", value: 28)
!167 = !DIEnumerator(name: "act_validate_archname", value: 29)
!168 = !DIEnumerator(name: "act_validate_version", value: 30)
!169 = !DIEnumerator(name: "act_audit", value: 31)
!170 = !DIEnumerator(name: "act_unpackchk", value: 32)
!171 = !DIEnumerator(name: "act_predeppackage", value: 33)
!172 = !DIEnumerator(name: "act_getselections", value: 34)
!173 = !DIEnumerator(name: "act_setselections", value: 35)
!174 = !DIEnumerator(name: "act_clearselections", value: 36)
!175 = !DIEnumerator(name: "act_avail", value: 37)
!176 = !DIEnumerator(name: "act_printavail", value: 38)
!177 = !DIEnumerator(name: "act_avclear", value: 39)
!178 = !DIEnumerator(name: "act_avreplace", value: 40)
!179 = !DIEnumerator(name: "act_avmerge", value: 41)
!180 = !DIEnumerator(name: "act_forgetold", value: 42)
!181 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_ctype_bit", file: !182, line: 32, size: 32, align: 32, elements: !183)
!182 = !DIFile(filename: "../lib/dpkg/c-ctype.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!183 = !{!184, !185, !186, !187, !188, !189, !190, !191}
!184 = !DIEnumerator(name: "C_CTYPE_BLANK", value: 1)
!185 = !DIEnumerator(name: "C_CTYPE_WHITE", value: 2)
!186 = !DIEnumerator(name: "C_CTYPE_SPACE", value: 4)
!187 = !DIEnumerator(name: "C_CTYPE_UPPER", value: 8)
!188 = !DIEnumerator(name: "C_CTYPE_LOWER", value: 16)
!189 = !DIEnumerator(name: "C_CTYPE_DIGIT", value: 32)
!190 = !DIEnumerator(name: "C_CTYPE_ALPHA", value: 24)
!191 = !DIEnumerator(name: "C_CTYPE_ALNUM", value: 56)
!192 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "modstatdb_rw", file: !4, line: 263, size: 32, align: 32, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201}
!194 = !DIEnumerator(name: "msdbrw_readonly", value: 0)
!195 = !DIEnumerator(name: "msdbrw_needsuperuserlockonly", value: 1)
!196 = !DIEnumerator(name: "msdbrw_writeifposs", value: 2)
!197 = !DIEnumerator(name: "msdbrw_write", value: 3)
!198 = !DIEnumerator(name: "msdbrw_needsuperuser", value: 4)
!199 = !DIEnumerator(name: "msdbrw_available_readonly", value: 256)
!200 = !DIEnumerator(name: "msdbrw_available_write", value: 512)
!201 = !DIEnumerator(name: "msdbrw_available_mask", value: 65280)
!202 = !{!203, !207, !208, !209}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!206 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!208 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!212 = !{!213, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !425, !436, !437, !438, !464, !474, !478}
!213 = distinct !DIGlobalVariable(name: "f_pending", scope: !0, file: !214, line: 192, type: !208, isLocal: false, isDefinition: true, variable: i32* @f_pending)
!214 = !DIFile(filename: "main.c", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!215 = distinct !DIGlobalVariable(name: "f_recursive", scope: !0, file: !214, line: 192, type: !208, isLocal: false, isDefinition: true, variable: i32* @f_recursive)
!216 = distinct !DIGlobalVariable(name: "f_alsoselect", scope: !0, file: !214, line: 192, type: !208, isLocal: false, isDefinition: true, variable: i32* @f_alsoselect)
!217 = distinct !DIGlobalVariable(name: "f_skipsame", scope: !0, file: !214, line: 192, type: !208, isLocal: false, isDefinition: true, variable: i32* @f_skipsame)
!218 = distinct !DIGlobalVariable(name: "f_noact", scope: !0, file: !214, line: 192, type: !208, isLocal: false, isDefinition: true, variable: i32* @f_noact)
!219 = distinct !DIGlobalVariable(name: "f_autodeconf", scope: !0, file: !214, line: 193, type: !208, isLocal: false, isDefinition: true, variable: i32* @f_autodeconf)
!220 = distinct !DIGlobalVariable(name: "f_nodebsig", scope: !0, file: !214, line: 193, type: !208, isLocal: false, isDefinition: true, variable: i32* @f_nodebsig)
!221 = distinct !DIGlobalVariable(name: "f_triggers", scope: !0, file: !214, line: 194, type: !208, isLocal: false, isDefinition: true, variable: i32* @f_triggers)
!222 = distinct !DIGlobalVariable(name: "errabort", scope: !0, file: !214, line: 196, type: !208, isLocal: false, isDefinition: true, variable: i32* @errabort)
!223 = distinct !DIGlobalVariable(name: "instdir", scope: !0, file: !214, line: 198, type: !204, isLocal: false, isDefinition: true, variable: i8** @instdir)
!224 = distinct !DIGlobalVariable(name: "ignoredependss", scope: !0, file: !214, line: 199, type: !225, isLocal: false, isDefinition: true, variable: %struct.pkg_list** @ignoredependss)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_list", file: !227, line: 34, size: 128, align: 64, elements: !228)
!227 = !DIFile(filename: "../lib/dpkg/pkg-list.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !226, file: !227, line: 35, baseType: !225, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !226, file: !227, line: 36, baseType: !231, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !233)
!233 = !{!234, !282, !283, !284, !285, !286, !287, !288, !289, !290, !320, !321, !331, !340, !356, !357, !363, !419, !423, !424}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !232, file: !4, line: 196, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !237)
!237 = !{!238, !239, !240, !241, !281}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !4, line: 243, baseType: !235, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !4, line: 244, baseType: !204, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !236, file: !4, line: 245, baseType: !232, size: 3072, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !236, file: !4, line: 249, baseType: !242, size: 128, align: 64, offset: 3200)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !236, file: !4, line: 246, size: 128, align: 64, elements: !243)
!243 = !{!244, !280}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !242, file: !4, line: 247, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !247)
!247 = !{!248, !256, !257, !258, !259, !260, !269, !276, !277, !279}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !246, file: !4, line: 64, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !251)
!251 = !{!252, !253, !254, !255}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !250, file: !4, line: 57, baseType: !231, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !4, line: 58, baseType: !249, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !250, file: !4, line: 59, baseType: !245, size: 64, align: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !250, file: !4, line: 60, baseType: !3, size: 32, align: 32, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !246, file: !4, line: 65, baseType: !235, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !246, file: !4, line: 66, baseType: !245, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !246, file: !4, line: 66, baseType: !245, size: 64, align: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !246, file: !4, line: 66, baseType: !245, size: 64, align: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !246, file: !4, line: 67, baseType: !261, size: 64, align: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !16, line: 48, size: 192, align: 64, elements: !264)
!264 = !{!265, !267, !268}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !263, file: !16, line: 49, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !263, file: !16, line: 50, baseType: !204, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !263, file: !16, line: 51, baseType: !15, size: 32, align: 32, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !246, file: !4, line: 68, baseType: !270, size: 192, align: 64, offset: 384)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !27, line: 42, size: 192, align: 64, elements: !271)
!271 = !{!272, !274, !275}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !270, file: !27, line: 44, baseType: !273, size: 32, align: 32)
!273 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !270, file: !27, line: 46, baseType: !204, size: 64, align: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !270, file: !27, line: 48, baseType: !204, size: 64, align: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !246, file: !4, line: 69, baseType: !26, size: 32, align: 32, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !246, file: !4, line: 70, baseType: !278, size: 8, align: 8, offset: 608)
!278 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !246, file: !4, line: 71, baseType: !278, size: 8, align: 8, offset: 616)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !242, file: !4, line: 248, baseType: !245, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !236, file: !4, line: 250, baseType: !208, size: 32, align: 32, offset: 3328)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !232, file: !4, line: 197, baseType: !231, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !232, file: !4, line: 199, baseType: !35, size: 32, align: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !232, file: !4, line: 201, baseType: !43, size: 32, align: 32, offset: 160)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !232, file: !4, line: 202, baseType: !47, size: 32, align: 32, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !232, file: !4, line: 203, baseType: !57, size: 32, align: 32, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !232, file: !4, line: 204, baseType: !204, size: 64, align: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !232, file: !4, line: 205, baseType: !204, size: 64, align: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !232, file: !4, line: 206, baseType: !270, size: 192, align: 64, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !232, file: !4, line: 207, baseType: !291, size: 960, align: 64, offset: 576)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !313}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !291, file: !4, line: 108, baseType: !249, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !291, file: !4, line: 110, baseType: !278, size: 8, align: 8, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !291, file: !4, line: 111, baseType: !67, size: 32, align: 32, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !291, file: !4, line: 112, baseType: !261, size: 64, align: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !291, file: !4, line: 115, baseType: !204, size: 64, align: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !291, file: !4, line: 116, baseType: !204, size: 64, align: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !291, file: !4, line: 117, baseType: !204, size: 64, align: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !291, file: !4, line: 118, baseType: !204, size: 64, align: 64, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !291, file: !4, line: 119, baseType: !204, size: 64, align: 64, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !291, file: !4, line: 120, baseType: !204, size: 64, align: 64, offset: 512)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !291, file: !4, line: 121, baseType: !204, size: 64, align: 64, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !291, file: !4, line: 122, baseType: !270, size: 192, align: 64, offset: 640)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !291, file: !4, line: 123, baseType: !306, size: 64, align: 64, offset: 832)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !308)
!308 = !{!309, !310, !311, !312}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !307, file: !4, line: 81, baseType: !306, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !4, line: 82, baseType: !204, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !307, file: !4, line: 83, baseType: !204, size: 64, align: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !307, file: !4, line: 84, baseType: !278, size: 8, align: 8, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !291, file: !4, line: 124, baseType: !314, size: 64, align: 64, offset: 896)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !316)
!316 = !{!317, !318, !319}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !315, file: !4, line: 75, baseType: !314, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !4, line: 76, baseType: !204, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !315, file: !4, line: 77, baseType: !204, size: 64, align: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !232, file: !4, line: 208, baseType: !291, size: 960, align: 64, offset: 1536)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !232, file: !4, line: 209, baseType: !322, size: 64, align: 64, offset: 2496)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !74, line: 53, size: 256, align: 64, elements: !324)
!324 = !{!325, !326, !327, !328, !329, !330}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "istobe", scope: !323, file: !74, line: 54, baseType: !73, size: 32, align: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !323, file: !74, line: 57, baseType: !81, size: 32, align: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "enqueued", scope: !323, file: !74, line: 59, baseType: !278, size: 8, align: 8, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "replacingfilesandsaid", scope: !323, file: !74, line: 61, baseType: !208, size: 32, align: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "cmdline_seen", scope: !323, file: !74, line: 62, baseType: !208, size: 32, align: 32, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "trigprocdeferred", scope: !323, file: !74, line: 65, baseType: !225, size: 64, align: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !232, file: !4, line: 211, baseType: !332, size: 64, align: 64, offset: 2560)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !334)
!334 = !{!335, !336, !337, !338, !339}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !4, line: 88, baseType: !332, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !333, file: !4, line: 89, baseType: !204, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !333, file: !4, line: 90, baseType: !204, size: 64, align: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !333, file: !4, line: 91, baseType: !204, size: 64, align: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !333, file: !4, line: 92, baseType: !204, size: 64, align: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !232, file: !4, line: 216, baseType: !341, size: 128, align: 64, offset: 2624)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !232, file: !4, line: 213, size: 128, align: 64, elements: !342)
!342 = !{!343, !355}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !341, file: !4, line: 215, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !346)
!346 = !{!347, !348, !349, !350}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !345, file: !4, line: 143, baseType: !231, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !345, file: !4, line: 143, baseType: !231, size: 64, align: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !345, file: !4, line: 144, baseType: !344, size: 64, align: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !345, file: !4, line: 147, baseType: !351, size: 128, align: 64, offset: 192)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !345, file: !4, line: 145, size: 128, align: 64, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !351, file: !4, line: 146, baseType: !344, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !351, file: !4, line: 146, baseType: !344, size: 64, align: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !341, file: !4, line: 215, baseType: !344, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !232, file: !4, line: 219, baseType: !344, size: 64, align: 64, offset: 2752)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !232, file: !4, line: 220, baseType: !358, size: 64, align: 64, offset: 2816)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !359, file: !4, line: 135, baseType: !358, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !359, file: !4, line: 136, baseType: !204, size: 64, align: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !232, file: !4, line: 231, baseType: !364, size: 64, align: 64, offset: 2880)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !87, line: 122, size: 128, align: 64, elements: !366)
!366 = !{!367, !368}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !365, file: !87, line: 123, baseType: !364, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "namenode", scope: !365, file: !87, line: 124, baseType: !369, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode", file: !87, line: 90, size: 640, align: 64, elements: !371)
!371 = !{!372, !373, !374, !375, !383, !402, !405, !406, !407, !408}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !370, file: !87, line: 91, baseType: !369, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !370, file: !87, line: 92, baseType: !204, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "packages", scope: !370, file: !87, line: 93, baseType: !225, size: 64, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "divert", scope: !370, file: !87, line: 94, baseType: !376, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_diversion", file: !87, line: 151, size: 256, align: 64, elements: !378)
!378 = !{!379, !380, !381, !382}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "useinstead", scope: !377, file: !87, line: 152, baseType: !369, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "camefrom", scope: !377, file: !87, line: 153, baseType: !369, size: 64, align: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pkgset", scope: !377, file: !87, line: 154, baseType: !235, size: 64, align: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !377, file: !87, line: 157, baseType: !376, size: 64, align: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "statoverride", scope: !370, file: !87, line: 101, baseType: !384, size: 64, align: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !386, line: 40, size: 256, align: 64, elements: !387)
!386 = !DIFile(filename: "../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!387 = !{!388, !393, !396, !399, !401}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !385, file: !386, line: 41, baseType: !389, size: 32, align: 32)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !390, line: 80, baseType: !391)
!390 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !392, line: 125, baseType: !273)
!392 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!393 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !385, file: !386, line: 42, baseType: !394, size: 32, align: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !390, line: 65, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !392, line: 126, baseType: !273)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !385, file: !386, line: 43, baseType: !397, size: 32, align: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !390, line: 70, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !392, line: 129, baseType: !273)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !385, file: !386, line: 47, baseType: !400, size: 64, align: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !385, file: !386, line: 48, baseType: !400, size: 64, align: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "trig_interested", scope: !370, file: !87, line: 103, baseType: !403, size: 64, align: 64, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "trigfileint", file: !87, line: 103, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !370, file: !87, line: 111, baseType: !86, size: 32, align: 32, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "oldhash", scope: !370, file: !87, line: 114, baseType: !204, size: 64, align: 64, offset: 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "newhash", scope: !370, file: !87, line: 117, baseType: !204, size: 64, align: 64, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "file_ondisk_id", scope: !370, file: !87, line: 119, baseType: !409, size: 64, align: 64, offset: 576)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_ondisk_id", file: !87, line: 85, size: 128, align: 64, elements: !411)
!411 = !{!412, !416}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "id_dev", scope: !410, file: !87, line: 86, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !390, line: 60, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !392, line: 124, baseType: !415)
!415 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "id_ino", scope: !410, file: !87, line: 87, baseType: !417, size: 64, align: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !390, line: 48, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !392, line: 127, baseType: !415)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !232, file: !4, line: 232, baseType: !420, size: 64, align: 64, offset: 2944)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !390, line: 86, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !392, line: 131, baseType: !422)
!422 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !232, file: !4, line: 233, baseType: !278, size: 8, align: 8, offset: 3008)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !232, file: !4, line: 236, baseType: !278, size: 8, align: 8, offset: 3016)
!425 = distinct !DIGlobalVariable(name: "pre_invoke_hooks", scope: !0, file: !214, line: 353, type: !426, isLocal: false, isDefinition: true, variable: %struct.invoke_list* @pre_invoke_hooks)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "invoke_list", file: !74, line: 139, size: 128, align: 64, elements: !427)
!427 = !{!428, !434}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !426, file: !74, line: 140, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "invoke_hook", file: !74, line: 134, size: 128, align: 64, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !430, file: !74, line: 135, baseType: !429, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !430, file: !74, line: 136, baseType: !400, size: 64, align: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !426, file: !74, line: 140, baseType: !435, size: 64, align: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!436 = distinct !DIGlobalVariable(name: "post_invoke_hooks", scope: !0, file: !214, line: 354, type: !426, isLocal: false, isDefinition: true, variable: %struct.invoke_list* @post_invoke_hooks)
!437 = distinct !DIGlobalVariable(name: "status_loggers", scope: !0, file: !214, line: 355, type: !426, isLocal: false, isDefinition: true, variable: %struct.invoke_list* @status_loggers)
!438 = distinct !DIGlobalVariable(name: "cmdinfos", scope: !0, file: !214, line: 520, type: !439, isLocal: true, isDefinition: true, variable: [81 x %struct.cmdinfo]* @cmdinfos)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 41472, align: 64, elements: !462)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmdinfo", file: !442, line: 38, size: 512, align: 64, elements: !443)
!442 = !DIFile(filename: "../lib/dpkg/options.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!443 = !{!444, !445, !446, !447, !449, !450, !455, !456, !457}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "olong", scope: !441, file: !442, line: 39, baseType: !204, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "oshort", scope: !441, file: !442, line: 40, baseType: !206, size: 8, align: 8, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "takesvalue", scope: !441, file: !442, line: 48, baseType: !208, size: 32, align: 32, offset: 96)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "iassignto", scope: !441, file: !442, line: 49, baseType: !448, size: 64, align: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sassignto", scope: !441, file: !442, line: 50, baseType: !203, size: 64, align: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !441, file: !442, line: 51, baseType: !451, size: 64, align: 64, offset: 256)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !454, !204}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "arg_int", scope: !441, file: !442, line: 53, baseType: !208, size: 32, align: 32, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "arg_ptr", scope: !441, file: !442, line: 54, baseType: !207, size: 64, align: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !441, file: !442, line: 56, baseType: !458, size: 64, align: 64, offset: 448)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "action_func", file: !442, line: 36, baseType: !460)
!460 = !DISubroutineType(types: !461)
!461 = !{!208, !210}
!462 = !{!463}
!463 = !DISubrange(count: 81)
!464 = distinct !DIGlobalVariable(name: "debuginfos", scope: !0, file: !214, line: 208, type: !465, isLocal: true, isDefinition: true, variable: [14 x %struct.debuginfo]* @debuginfos)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 2688, align: 64, elements: !472)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "debuginfo", file: !214, line: 204, size: 192, align: 64, elements: !468)
!468 = !{!469, !470, !471}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !467, file: !214, line: 205, baseType: !208, size: 32, align: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !467, file: !214, line: 206, baseType: !204, size: 64, align: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !467, file: !214, line: 207, baseType: !204, size: 64, align: 64, offset: 128)
!472 = !{!473}
!473 = !DISubrange(count: 14)
!474 = distinct !DIGlobalVariable(name: "printforhelp", scope: !0, file: !214, line: 183, type: !475, isLocal: true, isDefinition: true, variable: [388 x i8]* @printforhelp)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 3104, align: 8, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 388)
!478 = distinct !DIGlobalVariable(name: "admindir", scope: !0, file: !214, line: 197, type: !204, isLocal: true, isDefinition: true, variable: i8** @admindir)
!479 = !{i32 2, !"Dwarf Version", i32 4}
!480 = !{i32 2, !"Debug Info Version", i32 3}
!481 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!482 = distinct !DISubprogram(name: "execbackend", scope: !214, file: !214, line: 614, type: !460, isLocal: false, isDefinition: true, scopeLine: 615, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !483)
!483 = !{}
!484 = !DILocalVariable(name: "argv", arg: 1, scope: !482, file: !214, line: 614, type: !210)
!485 = !DIExpression()
!486 = !DILocation(line: 614, column: 32, scope: !482)
!487 = !DILocalVariable(name: "cmd", scope: !482, file: !214, line: 616, type: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "command", file: !489, line: 37, size: 256, align: 64, elements: !490)
!489 = !DIFile(filename: "../lib/dpkg/command.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!490 = !{!491, !492, !493, !494, !495}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !488, file: !489, line: 39, baseType: !204, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !488, file: !489, line: 41, baseType: !204, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !488, file: !489, line: 42, baseType: !208, size: 32, align: 32, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "argv_size", scope: !488, file: !489, line: 43, baseType: !208, size: 32, align: 32, offset: 160)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !488, file: !489, line: 44, baseType: !203, size: 64, align: 64, offset: 192)
!496 = !DILocation(line: 616, column: 18, scope: !482)
!497 = !DILocation(line: 618, column: 22, scope: !482)
!498 = !DILocation(line: 618, column: 33, scope: !482)
!499 = !DILocation(line: 618, column: 3, scope: !482)
!500 = !DILocation(line: 619, column: 25, scope: !482)
!501 = !DILocation(line: 619, column: 36, scope: !482)
!502 = !DILocation(line: 619, column: 3, scope: !482)
!503 = !DILocation(line: 620, column: 41, scope: !482)
!504 = !DILocation(line: 620, column: 52, scope: !482)
!505 = !DILocation(line: 620, column: 25, scope: !482)
!506 = !DILocation(line: 620, column: 3, scope: !507)
!507 = !DILexicalBlockFile(scope: !482, file: !214, discriminator: 1)
!508 = !DILocation(line: 624, column: 3, scope: !482)
!509 = !DILocation(line: 625, column: 41, scope: !482)
!510 = !DILocation(line: 625, column: 3, scope: !482)
!511 = !DILocation(line: 627, column: 3, scope: !482)
!512 = !DILocation(line: 628, column: 1, scope: !482)
!513 = distinct !DISubprogram(name: "commandfd", scope: !214, file: !214, line: 631, type: !460, isLocal: false, isDefinition: true, scopeLine: 632, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !483)
!514 = !DILocalVariable(name: "argv", arg: 1, scope: !513, file: !214, line: 631, type: !210)
!515 = !DILocation(line: 631, column: 30, scope: !513)
!516 = !DILocalVariable(name: "linevb", scope: !513, file: !214, line: 633, type: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !518, line: 55, size: 192, align: 64, elements: !519)
!518 = !DIFile(filename: "../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!519 = !{!520, !523, !524}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !517, file: !518, line: 56, baseType: !521, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !522, line: 216, baseType: !415)
!522 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!523 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !517, file: !518, line: 56, baseType: !521, size: 64, align: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !517, file: !518, line: 57, baseType: !400, size: 64, align: 64, offset: 128)
!525 = !DILocation(line: 633, column: 17, scope: !513)
!526 = !DILocalVariable(name: "pipein", scope: !513, file: !214, line: 634, type: !204)
!527 = !DILocation(line: 634, column: 16, scope: !513)
!528 = !DILocalVariable(name: "newargs", scope: !513, file: !214, line: 635, type: !203)
!529 = !DILocation(line: 635, column: 16, scope: !513)
!530 = !DILocalVariable(name: "endargs", scope: !513, file: !214, line: 635, type: !203)
!531 = !DILocation(line: 635, column: 33, scope: !513)
!532 = !DILocalVariable(name: "ptr", scope: !513, file: !214, line: 636, type: !400)
!533 = !DILocation(line: 636, column: 9, scope: !513)
!534 = !DILocalVariable(name: "endptr", scope: !513, file: !214, line: 636, type: !400)
!535 = !DILocation(line: 636, column: 15, scope: !513)
!536 = !DILocalVariable(name: "in", scope: !513, file: !214, line: 637, type: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !539, line: 48, baseType: !540)
!539 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !541, line: 241, size: 1728, align: 64, elements: !542)
!541 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!542 = !{!543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !563, !564, !565, !566, !567, !569, !571, !575, !578, !580, !581, !582, !583, !584, !585, !586}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !540, file: !541, line: 242, baseType: !208, size: 32, align: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !540, file: !541, line: 247, baseType: !400, size: 64, align: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !540, file: !541, line: 248, baseType: !400, size: 64, align: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !540, file: !541, line: 249, baseType: !400, size: 64, align: 64, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !540, file: !541, line: 250, baseType: !400, size: 64, align: 64, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !540, file: !541, line: 251, baseType: !400, size: 64, align: 64, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !540, file: !541, line: 252, baseType: !400, size: 64, align: 64, offset: 384)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !540, file: !541, line: 253, baseType: !400, size: 64, align: 64, offset: 448)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !540, file: !541, line: 254, baseType: !400, size: 64, align: 64, offset: 512)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !540, file: !541, line: 256, baseType: !400, size: 64, align: 64, offset: 576)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !540, file: !541, line: 257, baseType: !400, size: 64, align: 64, offset: 640)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !540, file: !541, line: 258, baseType: !400, size: 64, align: 64, offset: 704)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !540, file: !541, line: 260, baseType: !556, size: 64, align: 64, offset: 768)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64, align: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !541, line: 156, size: 192, align: 64, elements: !558)
!558 = !{!559, !560, !562}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !557, file: !541, line: 157, baseType: !556, size: 64, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !557, file: !541, line: 158, baseType: !561, size: 64, align: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !557, file: !541, line: 162, baseType: !208, size: 32, align: 32, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !540, file: !541, line: 262, baseType: !561, size: 64, align: 64, offset: 832)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !540, file: !541, line: 264, baseType: !208, size: 32, align: 32, offset: 896)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !540, file: !541, line: 268, baseType: !208, size: 32, align: 32, offset: 928)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !540, file: !541, line: 270, baseType: !421, size: 64, align: 64, offset: 960)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !540, file: !541, line: 274, baseType: !568, size: 16, align: 16, offset: 1024)
!568 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !540, file: !541, line: 275, baseType: !570, size: 8, align: 8, offset: 1040)
!570 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !540, file: !541, line: 276, baseType: !572, size: 8, align: 8, offset: 1048)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 8, align: 8, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 1)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !540, file: !541, line: 280, baseType: !576, size: 64, align: 64, offset: 1088)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !541, line: 150, baseType: null)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !540, file: !541, line: 289, baseType: !579, size: 64, align: 64, offset: 1152)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !392, line: 132, baseType: !422)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !540, file: !541, line: 297, baseType: !207, size: 64, align: 64, offset: 1216)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !540, file: !541, line: 298, baseType: !207, size: 64, align: 64, offset: 1280)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !540, file: !541, line: 299, baseType: !207, size: 64, align: 64, offset: 1344)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !540, file: !541, line: 300, baseType: !207, size: 64, align: 64, offset: 1408)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !540, file: !541, line: 302, baseType: !521, size: 64, align: 64, offset: 1472)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !540, file: !541, line: 303, baseType: !208, size: 32, align: 32, offset: 1536)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !540, file: !541, line: 305, baseType: !587, size: 160, align: 8, offset: 1568)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 160, align: 8, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 20)
!590 = !DILocation(line: 637, column: 9, scope: !513)
!591 = !DILocalVariable(name: "infd", scope: !513, file: !214, line: 638, type: !422)
!592 = !DILocation(line: 638, column: 8, scope: !513)
!593 = !DILocalVariable(name: "ret", scope: !513, file: !214, line: 639, type: !208)
!594 = !DILocation(line: 639, column: 7, scope: !513)
!595 = !DILocalVariable(name: "c", scope: !513, file: !214, line: 640, type: !208)
!596 = !DILocation(line: 640, column: 7, scope: !513)
!597 = !DILocalVariable(name: "lno", scope: !513, file: !214, line: 640, type: !208)
!598 = !DILocation(line: 640, column: 10, scope: !513)
!599 = !DILocalVariable(name: "i", scope: !513, file: !214, line: 640, type: !208)
!600 = !DILocation(line: 640, column: 15, scope: !513)
!601 = !DILocalVariable(name: "skipchar", scope: !513, file: !214, line: 641, type: !278)
!602 = !DILocation(line: 641, column: 7, scope: !513)
!603 = !DILocation(line: 643, column: 17, scope: !513)
!604 = !DILocation(line: 643, column: 12, scope: !513)
!605 = !DILocation(line: 643, column: 10, scope: !513)
!606 = !DILocation(line: 644, column: 7, scope: !607)
!607 = distinct !DILexicalBlock(scope: !513, file: !214, line: 644, column: 7)
!608 = !DILocation(line: 644, column: 14, scope: !607)
!609 = !DILocation(line: 644, column: 21, scope: !607)
!610 = !DILocation(line: 644, column: 25, scope: !611)
!611 = !DILexicalBlockFile(scope: !607, file: !214, discriminator: 1)
!612 = !DILocation(line: 644, column: 24, scope: !611)
!613 = !DILocation(line: 644, column: 7, scope: !611)
!614 = !DILocation(line: 645, column: 14, scope: !607)
!615 = !DILocation(line: 645, column: 58, scope: !607)
!616 = !DILocation(line: 645, column: 69, scope: !607)
!617 = !DILocation(line: 645, column: 5, scope: !611)
!618 = !DILocation(line: 645, column: 5, scope: !607)
!619 = !DILocation(line: 647, column: 37, scope: !513)
!620 = !DILocation(line: 647, column: 48, scope: !513)
!621 = !DILocation(line: 647, column: 10, scope: !513)
!622 = !DILocation(line: 647, column: 8, scope: !513)
!623 = !DILocation(line: 648, column: 15, scope: !513)
!624 = !DILocation(line: 648, column: 8, scope: !513)
!625 = !DILocation(line: 648, column: 6, scope: !513)
!626 = !DILocation(line: 649, column: 7, scope: !627)
!627 = distinct !DILexicalBlock(scope: !513, file: !214, line: 649, column: 7)
!628 = !DILocation(line: 649, column: 10, scope: !627)
!629 = !DILocation(line: 649, column: 7, scope: !513)
!630 = !DILocation(line: 650, column: 13, scope: !627)
!631 = !DILocation(line: 650, column: 60, scope: !627)
!632 = !DILocation(line: 650, column: 55, scope: !627)
!633 = !DILocation(line: 650, column: 5, scope: !634)
!634 = !DILexicalBlockFile(scope: !627, file: !214, discriminator: 1)
!635 = !DILocation(line: 650, column: 5, scope: !627)
!636 = !DILocation(line: 652, column: 3, scope: !513)
!637 = !DILocalVariable(name: "mode", scope: !638, file: !214, line: 653, type: !278)
!638 = distinct !DILexicalBlock(scope: !639, file: !214, line: 652, column: 12)
!639 = distinct !DILexicalBlock(scope: !640, file: !214, line: 652, column: 3)
!640 = distinct !DILexicalBlock(scope: !513, file: !214, line: 652, column: 3)
!641 = !DILocation(line: 653, column: 9, scope: !638)
!642 = !DILocalVariable(name: "argc", scope: !638, file: !214, line: 654, type: !208)
!643 = !DILocation(line: 654, column: 9, scope: !638)
!644 = !DILocation(line: 655, column: 8, scope: !638)
!645 = !DILocation(line: 657, column: 5, scope: !638)
!646 = !DILocation(line: 659, column: 5, scope: !638)
!647 = distinct !{!647, !646}
!648 = !DILocation(line: 660, column: 10, scope: !649)
!649 = distinct !DILexicalBlock(scope: !638, file: !214, line: 659, column: 8)
!650 = !DILocation(line: 660, column: 9, scope: !649)
