; ModuleID = './[inter]src--trigproc.o.i'
source_filename = "./[inter]src--trigproc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pkg_queue = type { %struct.pkg_list*, %struct.pkg_list*, i32 }
%struct.pkg_list = type { %struct.pkg_list*, %struct.pkginfo* }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.2, i32 }
%struct.anon.2 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }
%struct.pkgbin = type { %struct.dependency*, i8, i32, %struct.dpkg_arch*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.dpkg_version, %struct.conffile*, %struct.arbitraryfield* }
%struct.conffile = type { %struct.conffile*, i8*, i8*, i8 }
%struct.arbitraryfield = type { %struct.arbitraryfield*, i8*, i8* }

!103 = !DIEnumerator(name: "FNNF_FILTERED", value: 512)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "debugflags", file: !105, line: 41, size: 32, align: 32, elements: !106)
!105 = !DIFile(filename: "../lib/dpkg/debug.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119}
!107 = !DIEnumerator(name: "dbg_general", value: 1)
!108 = !DIEnumerator(name: "dbg_scripts", value: 2)
!109 = !DIEnumerator(name: "dbg_eachfile", value: 8)
!110 = !DIEnumerator(name: "dbg_eachfiledetail", value: 64)
!111 = !DIEnumerator(name: "dbg_conff", value: 16)
!112 = !DIEnumerator(name: "dbg_conffdetail", value: 128)
!113 = !DIEnumerator(name: "dbg_depcon", value: 32)
!114 = !DIEnumerator(name: "dbg_depcondetail", value: 256)
!115 = !DIEnumerator(name: "dbg_veryverbose", value: 512)
!116 = !DIEnumerator(name: "dbg_stupidlyverbose", value: 1024)
!117 = !DIEnumerator(name: "dbg_triggers", value: 4096)
!118 = !DIEnumerator(name: "dbg_triggersdetail", value: 8192)
!119 = !DIEnumerator(name: "dbg_triggersstupid", value: 16384)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 41, size: 32, align: 32, elements: !122)
!121 = !DIFile(filename: "../lib/dpkg/ehandle.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!122 = !{!123, !124, !125}
!123 = !DIEnumerator(name: "ehflag_normaltidy", value: 1)
!124 = !DIEnumerator(name: "ehflag_bombout", value: 2)
!125 = !DIEnumerator(name: "ehflag_recursiveerror", value: 4)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_name_arch_when", file: !4, line: 396, size: 32, align: 32, elements: !127)
!127 = !{!128, !129, !130, !131}
!128 = !DIEnumerator(name: "pnaw_never", value: 0)
!129 = !DIEnumerator(name: "pnaw_nonambig", value: 1)
!130 = !DIEnumerator(name: "pnaw_foreign", value: 2)
!131 = !DIEnumerator(name: "pnaw_always", value: 3)
!132 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "trigproc_type", file: !74, line: 320, size: 32, align: 32, elements: !133)
!133 = !{!134, !135, !136}
!134 = !DIEnumerator(name: "TRIGPROC_TRY_DEFERRED", value: 0)
!135 = !DIEnumerator(name: "TRIGPROC_TRY_QUEUED", value: 1)
!136 = !DIEnumerator(name: "TRIGPROC_REQUIRED", value: 2)
!137 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dep_check", file: !74, line: 199, size: 32, align: 32, elements: !138)
!138 = !{!139, !140, !141}
!139 = !DIEnumerator(name: "DEP_CHECK_HALT", value: 0)
!140 = !DIEnumerator(name: "DEP_CHECK_DEFER", value: 1)
!141 = !DIEnumerator(name: "DEP_CHECK_OK", value: 2)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dependtry", file: !74, line: 243, size: 32, align: 32, elements: !143)
!143 = !{!144, !145, !146, !147, !148, !149}
!144 = !DIEnumerator(name: "DEPEND_TRY_NORMAL", value: 1)
!145 = !DIEnumerator(name: "DEPEND_TRY_CYCLES", value: 2)
!146 = !DIEnumerator(name: "DEPEND_TRY_TRIGGERS", value: 3)
!147 = !DIEnumerator(name: "DEPEND_TRY_FORCE_DEPENDS_VERSION", value: 4)
!148 = !DIEnumerator(name: "DEPEND_TRY_FORCE_DEPENDS", value: 5)
!149 = !DIEnumerator(name: "DEPEND_TRY_LAST", value: 6)
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "versiondisplayepochwhen", file: !4, line: 388, size: 32, align: 32, elements: !151)
!151 = !{!152, !153, !154}
!152 = !DIEnumerator(name: "vdew_never", value: 0)
!153 = !DIEnumerator(name: "vdew_nonambig", value: 1)
!154 = !DIEnumerator(name: "vdew_always", value: 2)
!155 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "modstatdb_rw", file: !4, line: 263, size: 32, align: 32, elements: !156)
!156 = !{!157, !158, !159, !160, !161, !162, !163, !164}
!157 = !DIEnumerator(name: "msdbrw_readonly", value: 0)
!158 = !DIEnumerator(name: "msdbrw_needsuperuserlockonly", value: 1)
!159 = !DIEnumerator(name: "msdbrw_writeifposs", value: 2)
!160 = !DIEnumerator(name: "msdbrw_write", value: 3)
!161 = !DIEnumerator(name: "msdbrw_needsuperuser", value: 4)
!162 = !DIEnumerator(name: "msdbrw_available_readonly", value: 256)
!163 = !DIEnumerator(name: "msdbrw_available_write", value: 512)
!164 = !DIEnumerator(name: "msdbrw_available_mask", value: 65280)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fsys_hash_find_flags", file: !92, line: 54, size: 32, align: 32, elements: !166)
!166 = !{!167, !168}
!167 = !DIEnumerator(name: "FHFF_NOCOPY", value: 1)
!168 = !DIEnumerator(name: "FHFF_NONE", value: 2)
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!171 = !{!172, !402, !403, !416, !417, !424}
!172 = distinct !DIGlobalVariable(name: "namesarg", scope: !173, file: !174, line: 373, type: !394, isLocal: true, isDefinition: true, variable: %struct.varbuf* @trigproc.namesarg)
!173 = distinct !DISubprogram(name: "trigproc", scope: !174, file: !174, line: 371, type: !175, isLocal: false, isDefinition: true, scopeLine: 372, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !393)
!174 = !DIFile(filename: "trigproc.c", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!175 = !DISubroutineType(types: !176)
!176 = !{null, !177, !132}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !179)
!179 = !{!180, !232, !233, !234, !235, !236, !237, !238, !239, !240, !270, !271, !287, !296, !312, !313, !319, !387, !391, !392}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !178, file: !4, line: 196, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !183)
!183 = !{!184, !185, !189, !190, !230}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !182, file: !4, line: 243, baseType: !181, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !4, line: 244, baseType: !186, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !182, file: !4, line: 245, baseType: !178, size: 3072, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !182, file: !4, line: 249, baseType: !191, size: 128, align: 64, offset: 3200)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !182, file: !4, line: 246, size: 128, align: 64, elements: !192)
!192 = !{!193, !229}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !191, file: !4, line: 247, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !196)
!196 = !{!197, !205, !206, !207, !208, !209, !218, !225, !226, !228}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !195, file: !4, line: 64, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !200)
!200 = !{!201, !202, !203, !204}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !199, file: !4, line: 57, baseType: !177, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !4, line: 58, baseType: !198, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !199, file: !4, line: 59, baseType: !194, size: 64, align: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !199, file: !4, line: 60, baseType: !3, size: 32, align: 32, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !195, file: !4, line: 65, baseType: !181, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !195, file: !4, line: 66, baseType: !194, size: 64, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !195, file: !4, line: 66, baseType: !194, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !195, file: !4, line: 66, baseType: !194, size: 64, align: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !195, file: !4, line: 67, baseType: !210, size: 64, align: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !16, line: 48, size: 192, align: 64, elements: !213)
!213 = !{!214, !216, !217}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !212, file: !16, line: 49, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !212, file: !16, line: 50, baseType: !186, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !212, file: !16, line: 51, baseType: !15, size: 32, align: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !195, file: !4, line: 68, baseType: !219, size: 192, align: 64, offset: 384)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !27, line: 42, size: 192, align: 64, elements: !220)
!220 = !{!221, !223, !224}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !219, file: !27, line: 44, baseType: !222, size: 32, align: 32)
!222 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !219, file: !27, line: 46, baseType: !186, size: 64, align: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !219, file: !27, line: 48, baseType: !186, size: 64, align: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !195, file: !4, line: 69, baseType: !26, size: 32, align: 32, offset: 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !195, file: !4, line: 70, baseType: !227, size: 8, align: 8, offset: 608)
!227 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !195, file: !4, line: 71, baseType: !227, size: 8, align: 8, offset: 616)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !191, file: !4, line: 248, baseType: !194, size: 64, align: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !182, file: !4, line: 250, baseType: !231, size: 32, align: 32, offset: 3328)
!231 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !178, file: !4, line: 197, baseType: !177, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !178, file: !4, line: 199, baseType: !35, size: 32, align: 32, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !178, file: !4, line: 201, baseType: !43, size: 32, align: 32, offset: 160)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !178, file: !4, line: 202, baseType: !47, size: 32, align: 32, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !178, file: !4, line: 203, baseType: !57, size: 32, align: 32, offset: 224)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !178, file: !4, line: 204, baseType: !186, size: 64, align: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !178, file: !4, line: 205, baseType: !186, size: 64, align: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !178, file: !4, line: 206, baseType: !219, size: 192, align: 64, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !178, file: !4, line: 207, baseType: !241, size: 960, align: 64, offset: 576)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !242)
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !263}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !241, file: !4, line: 108, baseType: !198, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !241, file: !4, line: 110, baseType: !227, size: 8, align: 8, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !241, file: !4, line: 111, baseType: !67, size: 32, align: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !241, file: !4, line: 112, baseType: !210, size: 64, align: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !241, file: !4, line: 115, baseType: !186, size: 64, align: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !241, file: !4, line: 116, baseType: !186, size: 64, align: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !241, file: !4, line: 117, baseType: !186, size: 64, align: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !241, file: !4, line: 118, baseType: !186, size: 64, align: 64, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !241, file: !4, line: 119, baseType: !186, size: 64, align: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !241, file: !4, line: 120, baseType: !186, size: 64, align: 64, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !241, file: !4, line: 121, baseType: !186, size: 64, align: 64, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !241, file: !4, line: 122, baseType: !219, size: 192, align: 64, offset: 640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !241, file: !4, line: 123, baseType: !256, size: 64, align: 64, offset: 832)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !258)
!258 = !{!259, !260, !261, !262}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !257, file: !4, line: 81, baseType: !256, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !257, file: !4, line: 82, baseType: !186, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !257, file: !4, line: 83, baseType: !186, size: 64, align: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !257, file: !4, line: 84, baseType: !227, size: 8, align: 8, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !241, file: !4, line: 124, baseType: !264, size: 64, align: 64, offset: 896)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !266)
!266 = !{!267, !268, !269}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !265, file: !4, line: 75, baseType: !264, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !265, file: !4, line: 76, baseType: !186, size: 64, align: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !265, file: !4, line: 77, baseType: !186, size: 64, align: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !178, file: !4, line: 208, baseType: !241, size: 960, align: 64, offset: 1536)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !178, file: !4, line: 209, baseType: !272, size: 64, align: 64, offset: 2496)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !74, line: 53, size: 256, align: 64, elements: !274)
!274 = !{!275, !276, !277, !278, !279, !280}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "istobe", scope: !273, file: !74, line: 54, baseType: !73, size: 32, align: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !273, file: !74, line: 57, baseType: !81, size: 32, align: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "enqueued", scope: !273, file: !74, line: 59, baseType: !227, size: 8, align: 8, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "replacingfilesandsaid", scope: !273, file: !74, line: 61, baseType: !231, size: 32, align: 32, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "cmdline_seen", scope: !273, file: !74, line: 62, baseType: !231, size: 32, align: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "trigprocdeferred", scope: !273, file: !74, line: 65, baseType: !281, size: 64, align: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_list", file: !283, line: 34, size: 128, align: 64, elements: !284)
!283 = !DIFile(filename: "../lib/dpkg/pkg-list.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !282, file: !283, line: 35, baseType: !281, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !282, file: !283, line: 36, baseType: !177, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !178, file: !4, line: 211, baseType: !288, size: 64, align: 64, offset: 2560)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !290)
!290 = !{!291, !292, !293, !294, !295}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !289, file: !4, line: 88, baseType: !288, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !289, file: !4, line: 89, baseType: !186, size: 64, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !289, file: !4, line: 90, baseType: !186, size: 64, align: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !289, file: !4, line: 91, baseType: !186, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !289, file: !4, line: 92, baseType: !186, size: 64, align: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !178, file: !4, line: 216, baseType: !297, size: 128, align: 64, offset: 2624)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !178, file: !4, line: 213, size: 128, align: 64, elements: !298)
!298 = !{!299, !311}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !297, file: !4, line: 215, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !302)
!302 = !{!303, !304, !305, !306}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !301, file: !4, line: 143, baseType: !177, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !301, file: !4, line: 143, baseType: !177, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !301, file: !4, line: 144, baseType: !300, size: 64, align: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !301, file: !4, line: 147, baseType: !307, size: 128, align: 64, offset: 192)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !301, file: !4, line: 145, size: 128, align: 64, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !307, file: !4, line: 146, baseType: !300, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !307, file: !4, line: 146, baseType: !300, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !297, file: !4, line: 215, baseType: !300, size: 64, align: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !178, file: !4, line: 219, baseType: !300, size: 64, align: 64, offset: 2752)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !178, file: !4, line: 220, baseType: !314, size: 64, align: 64, offset: 2816)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !316)
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !315, file: !4, line: 135, baseType: !314, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !4, line: 136, baseType: !186, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !178, file: !4, line: 231, baseType: !320, size: 64, align: 64, offset: 2880)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !92, line: 122, size: 128, align: 64, elements: !322)
!322 = !{!323, !324}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !321, file: !92, line: 123, baseType: !320, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "namenode", scope: !321, file: !92, line: 124, baseType: !325, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode", file: !92, line: 90, size: 640, align: 64, elements: !327)
!327 = !{!328, !329, !330, !331, !339, !358, !373, !374, !375, !376}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !326, file: !92, line: 91, baseType: !325, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !326, file: !92, line: 92, baseType: !186, size: 64, align: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "packages", scope: !326, file: !92, line: 93, baseType: !281, size: 64, align: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "divert", scope: !326, file: !92, line: 94, baseType: !332, size: 64, align: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_diversion", file: !92, line: 151, size: 256, align: 64, elements: !334)
!334 = !{!335, !336, !337, !338}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "useinstead", scope: !333, file: !92, line: 152, baseType: !325, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "camefrom", scope: !333, file: !92, line: 153, baseType: !325, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pkgset", scope: !333, file: !92, line: 154, baseType: !181, size: 64, align: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !92, line: 157, baseType: !332, size: 64, align: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "statoverride", scope: !326, file: !92, line: 101, baseType: !340, size: 64, align: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !342, line: 40, size: 256, align: 64, elements: !343)
!342 = !DIFile(filename: "../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!343 = !{!344, !349, !352, !355, !357}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !341, file: !342, line: 41, baseType: !345, size: 32, align: 32)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !346, line: 81, baseType: !347)
!346 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !348, line: 125, baseType: !222)
!348 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!349 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !341, file: !342, line: 42, baseType: !350, size: 32, align: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !346, line: 48, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !348, line: 126, baseType: !222)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !341, file: !342, line: 43, baseType: !353, size: 32, align: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !346, line: 62, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !348, line: 129, baseType: !222)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !341, file: !342, line: 47, baseType: !356, size: 64, align: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !341, file: !342, line: 48, baseType: !356, size: 64, align: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "trig_interested", scope: !326, file: !92, line: 103, baseType: !359, size: 64, align: 64, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigfileint", file: !87, line: 54, size: 448, align: 64, elements: !361)
!361 = !{!362, !363, !365, !366, !367, !368}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !360, file: !87, line: 55, baseType: !177, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pkgbin", scope: !360, file: !87, line: 56, baseType: !364, size: 64, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fnn", scope: !360, file: !87, line: 57, baseType: !325, size: 64, align: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !360, file: !87, line: 58, baseType: !86, size: 32, align: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "samefile_next", scope: !360, file: !87, line: 59, baseType: !359, size: 64, align: 64, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "inoverall", scope: !360, file: !87, line: 62, baseType: !369, size: 128, align: 64, offset: 320)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !360, file: !87, line: 60, size: 128, align: 64, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !369, file: !87, line: 61, baseType: !359, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !369, file: !87, line: 61, baseType: !359, size: 64, align: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !326, file: !92, line: 111, baseType: !91, size: 32, align: 32, offset: 384)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "oldhash", scope: !326, file: !92, line: 114, baseType: !186, size: 64, align: 64, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "newhash", scope: !326, file: !92, line: 117, baseType: !186, size: 64, align: 64, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "file_ondisk_id", scope: !326, file: !92, line: 119, baseType: !377, size: 64, align: 64, offset: 576)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_ondisk_id", file: !92, line: 85, size: 128, align: 64, elements: !379)
!379 = !{!380, !384}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "id_dev", scope: !378, file: !92, line: 86, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !346, line: 43, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !348, line: 124, baseType: !383)
!383 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "id_ino", scope: !378, file: !92, line: 87, baseType: !385, size: 64, align: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !346, line: 54, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !348, line: 127, baseType: !383)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !178, file: !4, line: 232, baseType: !388, size: 64, align: 64, offset: 2944)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !346, line: 73, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !348, line: 131, baseType: !390)
!390 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !178, file: !4, line: 233, baseType: !227, size: 8, align: 8, offset: 3008)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !178, file: !4, line: 236, baseType: !227, size: 8, align: 8, offset: 3016)
!393 = !{}
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !395, line: 55, size: 192, align: 64, elements: !396)
!395 = !DIFile(filename: "../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!396 = !{!397, !400, !401}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !394, file: !395, line: 56, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !399, line: 216, baseType: !383)
!399 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!400 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !394, file: !395, line: 56, baseType: !398, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !394, file: !395, line: 57, baseType: !356, size: 64, align: 64, offset: 128)
!402 = distinct !DIGlobalVariable(name: "tortoise_advance", scope: !0, file: !174, line: 201, type: !227, isLocal: true, isDefinition: true, variable: i8* @tortoise_advance)
!403 = distinct !DIGlobalVariable(name: "tortoise", scope: !0, file: !174, line: 202, type: !404, isLocal: true, isDefinition: true, variable: %struct.trigcyclenode** @tortoise)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigcyclenode", file: !174, line: 189, size: 192, align: 64, elements: !406)
!406 = !{!407, !408, !415}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !405, file: !174, line: 190, baseType: !404, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pkgs", scope: !405, file: !174, line: 191, baseType: !409, size: 64, align: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigcycleperpkg", file: !174, line: 195, size: 192, align: 64, elements: !411)
!411 = !{!412, !413, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !410, file: !174, line: 196, baseType: !409, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !410, file: !174, line: 197, baseType: !177, size: 64, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "then_trigs", scope: !410, file: !174, line: 198, baseType: !314, size: 64, align: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "then_processed", scope: !405, file: !174, line: 192, baseType: !177, size: 64, align: 64, offset: 128)
!416 = distinct !DIGlobalVariable(name: "hare", scope: !0, file: !174, line: 202, type: !404, isLocal: true, isDefinition: true, variable: %struct.trigcyclenode** @hare)
!417 = distinct !DIGlobalVariable(name: "deferred", scope: !0, file: !174, line: 92, type: !418, isLocal: true, isDefinition: true, variable: %struct.pkg_queue* @deferred)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_queue", file: !419, line: 35, size: 192, align: 64, elements: !420)
!419 = !DIFile(filename: "../lib/dpkg/pkg-queue.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!420 = !{!421, !422, !423}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !418, file: !419, line: 36, baseType: !281, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !418, file: !419, line: 36, baseType: !281, size: 64, align: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !418, file: !419, line: 37, baseType: !231, size: 32, align: 32, offset: 128)
!424 = distinct !DIGlobalVariable(name: "trig_our_hooks", scope: !0, file: !174, line: 561, type: !425, isLocal: true, isDefinition: true, variable: %struct.trig_hooks* @trig_our_hooks)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trig_hooks", file: !87, line: 70, size: 320, align: 64, elements: !427)
!427 = !{!428, !432, !436, !440, !445}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "enqueue_deferred", scope: !426, file: !87, line: 71, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !177}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "transitional_activate", scope: !426, file: !87, line: 72, baseType: !433, size: 64, align: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !155}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "namenode_find", scope: !426, file: !87, line: 74, baseType: !437, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!325, !186, !227}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "namenode_interested", scope: !426, file: !87, line: 75, baseType: !441, size: 64, align: 64, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!444, !325}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "namenode_name", scope: !426, file: !87, line: 78, baseType: !446, size: 64, align: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!186, !325}
!449 = !{i32 2, !"Dwarf Version", i32 4}
!450 = !{i32 2, !"Debug Info Version", i32 3}
!451 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!452 = distinct !DISubprogram(name: "trigproc_populate_deferred", scope: !174, file: !174, line: 123, type: !453, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !393)
!453 = !DISubroutineType(types: !454)
!454 = !{null}
!455 = !DILocalVariable(name: "iter", scope: !452, file: !174, line: 125, type: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_hash_iter", file: !4, line: 314, flags: DIFlagFwdDecl)
!458 = !DIExpression()
!459 = !DILocation(line: 125, column: 24, scope: !452)
!460 = !DILocalVariable(name: "pkg", scope: !452, file: !174, line: 126, type: !177)
!461 = !DILocation(line: 126, column: 18, scope: !452)
!462 = !DILocation(line: 128, column: 9, scope: !452)
!463 = !DILocation(line: 128, column: 7, scope: !452)
!464 = !DILocation(line: 129, column: 2, scope: !452)
!465 = !DILocation(line: 129, column: 39, scope: !466)
!466 = !DILexicalBlockFile(scope: !452, file: !174, discriminator: 1)
!467 = !DILocation(line: 129, column: 16, scope: !466)
!468 = !DILocation(line: 129, column: 14, scope: !466)
!469 = !DILocation(line: 129, column: 2, scope: !466)
!470 = !DILocation(line: 130, column: 8, scope: !471)
!471 = distinct !DILexicalBlock(scope: !472, file: !174, line: 130, column: 7)
!472 = distinct !DILexicalBlock(scope: !452, file: !174, line: 129, column: 47)
!473 = !DILocation(line: 130, column: 13, scope: !471)
!474 = !DILocation(line: 130, column: 7, scope: !472)
!475 = !DILocation(line: 131, column: 4, scope: !471)
!476 = distinct !{!476, !464}
!477 = !DILocation(line: 133, column: 7, scope: !478)
!478 = distinct !DILexicalBlock(scope: !472, file: !174, line: 133, column: 7)
!479 = !DILocation(line: 133, column: 12, scope: !478)
!480 = !DILocation(line: 133, column: 19, scope: !478)
!481 = !DILocation(line: 133, column: 47, scope: !478)
!482 = !DILocation(line: 134, column: 7, scope: !478)
!483 = !DILocation(line: 134, column: 12, scope: !478)
!484 = !DILocation(line: 134, column: 19, scope: !478)
!485 = !DILocation(line: 133, column: 7, scope: !486)
!486 = !DILexicalBlockFile(scope: !472, file: !174, discriminator: 1)
!487 = !DILocation(line: 135, column: 4, scope: !478)
!488 = !DILocation(line: 137, column: 7, scope: !489)
!489 = distinct !DILexicalBlock(scope: !472, file: !174, line: 137, column: 7)
!490 = !DILocation(line: 137, column: 12, scope: !489)
!491 = !DILocation(line: 137, column: 17, scope: !489)
!492 = !DILocation(line: 137, column: 7, scope: !472)
!493 = !DILocation(line: 138, column: 4, scope: !489)
!494 = !DILocation(line: 140, column: 29, scope: !472)
!495 = !DILocation(line: 140, column: 3, scope: !472)
!496 = !DILocation(line: 129, column: 2, scope: !497)
!497 = !DILexicalBlockFile(scope: !452, file: !174, discriminator: 2)
!498 = !DILocation(line: 142, column: 21, scope: !452)
!499 = !DILocation(line: 142, column: 2, scope: !452)
!500 = !DILocation(line: 143, column: 1, scope: !452)
!501 = distinct !DISubprogram(name: "trigproc_enqueue_deferred", scope: !174, file: !174, line: 95, type: !430, isLocal: true, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !393)
!502 = !DILocalVariable(name: "pend", arg: 1, scope: !501, file: !174, line: 95, type: !177)
!503 = !DILocation(line: 95, column: 43, scope: !501)
!504 = !DILocation(line: 97, column: 6, scope: !505)
!505 = distinct !DILexicalBlock(scope: !501, file: !174, line: 97, column: 6)
!506 = !DILocation(line: 97, column: 17, scope: !505)
!507 = !DILocation(line: 97, column: 6, scope: !501)
!508 = !DILocation(line: 98, column: 3, scope: !505)
!509 = !DILocation(line: 99, column: 28, scope: !501)
!510 = !DILocation(line: 99, column: 2, scope: !501)
!511 = !DILocation(line: 100, column: 6, scope: !512)
!512 = distinct !DILexicalBlock(scope: !501, file: !174, line: 100, column: 6)
!513 = !DILocation(line: 100, column: 12, scope: !512)
!514 = !DILocation(line: 100, column: 24, scope: !512)
!515 = !DILocation(line: 100, column: 6, scope: !501)
!516 = !DILocation(line: 101, column: 3, scope: !512)
!517 = !DILocation(line: 102, column: 65, scope: !501)
!518 = !DILocation(line: 102, column: 39, scope: !501)
!519 = !DILocation(line: 102, column: 2, scope: !501)
!520 = !DILocation(line: 102, column: 8, scope: !501)
!521 = !DILocation(line: 102, column: 20, scope: !501)
!522 = !DILocation(line: 102, column: 37, scope: !501)
!523 = !DILocation(line: 104, column: 17, scope: !501)
!524 = !DILocation(line: 104, column: 8, scope: !501)
!525 = !DILocation(line: 103, column: 2, scope: !501)
!526 = !DILocation(line: 105, column: 1, scope: !501)
!527 = !DILocation(line: 105, column: 1, scope: !528)
!528 = !DILexicalBlockFile(scope: !501, file: !174, discriminator: 1)
!529 = distinct !DISubprogram(name: "trigproc_run_deferred", scope: !174, file: !174, line: 146, type: !453, isLocal: false, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !393)
!530 = !DILocalVariable(name: "ejbuf", scope: !529, file: !174, line: 148, type: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !532, line: 48, baseType: !533)
!532 = !DIFile(filename: "/usr/include/setjmp.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 1600, align: 64, elements: !552)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !532, line: 34, size: 1600, align: 64, elements: !535)
!535 = !{!536, !542, !543}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !534, file: !532, line: 40, baseType: !537, size: 512, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !538, line: 31, baseType: !539)
!538 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 512, align: 64, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 8)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !534, file: !532, line: 41, baseType: !231, size: 32, align: 32, offset: 512)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !534, file: !532, line: 42, baseType: !544, size: 1024, align: 64, offset: 576)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !545, line: 30, baseType: !546)
!545 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 27, size: 1024, align: 64, elements: !547)
!547 = !{!548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !546, file: !545, line: 29, baseType: !549, size: 1024, align: 64)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 1024, align: 64, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 16)
!552 = !{!553}
!553 = !DISubrange(count: 1)
!554 = !DILocation(line: 148, column: 10, scope: !529)
!555 = !DILocation(line: 150, column: 2, scope: !529)
!556 = !DILocation(line: 151, column: 2, scope: !529)
!557 = !DILocation(line: 151, column: 10, scope: !558)
!558 = !DILexicalBlockFile(scope: !529, file: !174, discriminator: 1)
!559 = !DILocation(line: 151, column: 9, scope: !558)
!560 = !DILocation(line: 151, column: 2, scope: !558)
!561 = !DILocalVariable(name: "pkg", scope: !562, file: !174, line: 152, type: !177)
!562 = distinct !DILexicalBlock(scope: !529, file: !174, line: 151, column: 41)
!563 = !DILocation(line: 152, column: 19, scope: !562)
!564 = !DILocation(line: 154, column: 9, scope: !562)
!565 = !DILocation(line: 154, column: 7, scope: !562)
!566 = !DILocation(line: 155, column: 8, scope: !567)
!567 = distinct !DILexicalBlock(scope: !562, file: !174, line: 155, column: 7)
!568 = !DILocation(line: 155, column: 7, scope: !562)
!569 = !DILocation(line: 156, column: 4, scope: !567)
!570 = distinct !{!570, !556}
!571 = !DILocation(line: 158, column: 6, scope: !572)
!572 = distinct !DILexicalBlock(scope: !562, file: !174, line: 158, column: 6)
!573 = !DILocation(line: 158, column: 6, scope: !562)
!574 = !DILocation(line: 159, column: 4, scope: !575)
!575 = distinct !DILexicalBlock(scope: !572, file: !174, line: 158, column: 21)
!576 = !DILocation(line: 160, column: 4, scope: !575)
!577 = !DILocation(line: 163, column: 36, scope: !562)
!578 = !DILocation(line: 163, column: 27, scope: !562)
!579 = !DILocation(line: 162, column: 3, scope: !562)
!580 = !DILocation(line: 165, column: 29, scope: !562)
!581 = !DILocation(line: 165, column: 3, scope: !562)
!582 = !DILocation(line: 166, column: 3, scope: !562)
!583 = !DILocation(line: 166, column: 8, scope: !562)
!584 = !DILocation(line: 166, column: 20, scope: !562)
!585 = !DILocation(line: 166, column: 37, scope: !562)
!586 = !DILocation(line: 167, column: 12, scope: !562)
!587 = !DILocation(line: 167, column: 3, scope: !562)
!588 = !DILocation(line: 169, column: 3, scope: !562)
!589 = !DILocation(line: 151, column: 2, scope: !590)
!590 = !DILexicalBlockFile(scope: !529, file: !174, discriminator: 2)
!591 = !DILocation(line: 171, column: 1, scope: !529)
!592 = !DILocalVariable(name: "pkg", arg: 1, scope: !173, file: !174, line: 371, type: !177)
!593 = !DILocation(line: 371, column: 26, scope: !173)
!594 = !DILocalVariable(name: "type", arg: 2, scope: !173, file: !174, line: 371, type: !132)
!595 = !DILocation(line: 371, column: 50, scope: !173)
!596 = !DILocalVariable(name: "depwhynot", scope: !173, file: !174, line: 375, type: !394)
!597 = !DILocation(line: 375, column: 16, scope: !173)
!598 = !DILocalVariable(name: "tp", scope: !173, file: !174, line: 376, type: !314)
!599 = !DILocation(line: 376, column: 19, scope: !173)
!600 = !DILocalVariable(name: "gaveup", scope: !173, file: !174, line: 377, type: !177)
!601 = !DILocation(line: 377, column: 18, scope: !173)
!602 = !DILocation(line: 379, column: 46, scope: !173)
!603 = !DILocation(line: 379, column: 37, scope: !173)
!604 = !DILocation(line: 379, column: 2, scope: !605)
!605 = !DILexicalBlockFile(scope: !173, file: !174, discriminator: 1)
